[
    [
        {
            "content": "Before I begin my review, let me share with you a little story\r\nI once went to the \"Women Are Neglecting Kitchens Society\" ( Yes, I do know that abbreviates to W.A.N.K.S) Don't worry, all they do is tell \"Women and Kitchen\" jokes to each other. Anyways, the committee was proposing \"Kamijou Touma\" as their society's mascot. Bear in mind I did not watch any episodes of \"Toaru Majutsu no Index\" at all so I had to ask, \"Who the heck is Touma??\"\r\nMy membership got instantly revoked.\r\nSo after watching the first season, I still did not understand why is Touma is treated like a hero forthe W.A.N.K.S. But after venturing into the second season during the great \"Nuns vs Touma's Right Fist\" war, I finally understood them..\\n\\n\r\n\"Your story wasn't that entertaining\" says Misaka expressing her boredom.\\n\\n\r\nOh, and providing commentary for this review today is Misaka Clone #10032\\n\r\nSo let's begin the review shall we?\\n\\n\r\nAs I've mentioned before, I've continuously watched from the first season into the second season, thus I could significantly notice several changes between the two season.\\n\\n\r\nOnce again the story revolves around Kamijou Touma and his RIGHT FIST. Note I do not say RIGHT HAND to avoid any sexual innuendos. Once again, Touma lack of discrimination for women causes him to go out of his way to save any \"damsel in distress\" nor does he care about holding back when he \"rearranging their faces\" Along with index and a few other companions, he is again dragged into solving the problems between the two dominating church factions in the story out of his sense of altruism. I can absolutely say you will get hooked onto each episode, there is almost no such thing as \"fillers\" (Eventhough once in a while I would like that since the story is moving at such an incredible momentum) I did not read the light novels thus in no way am I comparing the anime to it.\\n\\n\r\nThe character design improved significantly from the previous season. Combat sequence are getting more serious effects. I love the new opening now and I've seen tons of spoof and parodies made about it in NND. This is one of the few openings I would actually listen to instead of skipping. And who doesn't like the sound effect when Touma uses his RIGHT FIST to dispel magic or espers ability?\\n\\n\r\nCharacters! More development here for Touma's character. And when I say more development, I mean his HAREM is developing! However I felt like they were neglecting Index once again.. Poor Index... Other supporting characters such as Misaka, Accelerator and Kuroko do appear to further compliment the story. Misaka and her tsudere-ness reaches a higher level! The sad part about this anime is that as new characters are being introduced, the older ones which had their own arc are being left by the sidelines. \\n\\n\r\n\"I did get to appear momentarily in one of the episodes...\" says Misaka proudly.\\n\\n\r\nNO!!! DONT SPOIL THE SHOW FOR THOSE WHO HAVEN'T WATCHED!! Now go make me a sammich!\\n\\n\r\n\"I decline...\" says Misaka while looking at the other direction.\\n\\n\r\nAnyways, as blasphemous as it is, I did enjoy the whole religion versus science theme. Ok, so technically all religions are not represented so to correct it, it would actually be a war between the Christian Crusaders and Science. And wow, these Christian Crusaders made Taliban Terrorist looks like wimps, eventhough in reality the existence of espers and magic isn't really acknowledge. Now the reason I wouldn't give the enjoyment value of this anime to the maximun score is because the whole Touma tries to reason a girl, girl rejects Touma's reasoning, Touma's crush girl's illusion a.k.a her face, girl defects and becomes his ally, is getting old pretty quick. Sure thats a nice way to add girls to your harem instead of the typical dating sim of buying flowers and chocolates and raising flags every single moment, why not just falcon punch her?? Now, in no way am I or Touma are sexist here.\\n\\n\r\n\"Touma isn't sexist as he indiscriminately punches anyone in the face, male or female\" Misaka adds to strengthen the argument. \\n\\n\r\nWell said. So to put it easily, if you're the type who fancies superpowers and ability users, this would be a good anime for you to watch. Be sure to watch the first season though. And what is a harem anime without a couple of fanservice?? Yes we do have some to satisfy you fetish! For all you lolicon, Miko fetish, and Nun fetish! Not to mention a lot of tsunderes to go around (10,000+ to be exact) \\n\r\nAnd do not take the religion aspect of this story too seriously, in no way it is connected to reality. This is a fictional world. Otherwise, how else would they be able to acquire magic make up?? What? You didn't notice they were wearing magic make up?? Whenever Touma punches his enemies' face with his RIGHT FIST, their faces becomes slightly uglier thus their magic make up was dispelled by Touma's RIGHT FIST..\\n\\n\r\n\"I do not understand your jokes..\" says Misaka showing her confusion\\n\\n\r\nWell how about this? Touma lost his right arm when he was a kid so Chuck Norris gave him his right arm since Chuck Norris has the ability to regenerate any of his body part. Thus explains why Touma's RIGHT FIST is supremely incredible!\\n\\n\r\n\"Who is this Chucku Norrissu of which you speak?\" Misaka asked in further confusion.\\n\\n\r\nHaremu Kingu,\\n\r\nSigning off!",
            "date": "2011-01-29T22:05:00+00:00",
            "helpful_count": 605,
            "mal_id": 34123,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=34123"
        },
        {
            "content": "The second season of To Aru Majutsu no Index continues from where the first season left off. Based on the popular Light Novel series, the story takes place in Academy City: a City where 80% of the population are students trained to develop superhuman powers through scientific methods. These students are known as “Espers”. But outside this city exists a religious fraction that can use Magic to counter Esper abilities. This fraction strongly detests the Science side and the two sides have been plotting each others destruction. Kamijyo Touma, the protagonist of this story, possesses a right hand that will negate all magic and esperpowers (as well as his own luck) and has been dragged into their plots against each other. \\n\\n\r\nNow I'll be the first to admit that the To Aru Majutsu no Index series has been less than brilliant but I still found the first series enjoyable. Pretty much every arc would have roughly the same shell: Touma meets a nice girl who is a victim of a horrible plot. Touma then finds out about said horrible plot. Touma confronts the antagonist behind the plot. Said antagonist gives a typical “Good intention but wrong method” excuse before Touma gives an idealistic speech and punches him in the face. Rinse and repeat. Not that I didn't enjoy it the first few times but it does get old and fast. Even so, the first season did make up for it by filling up that shell with some creative stuff and I was still intrigued with the dark mystery behind the Magic and Science sides. I also fell in love with the comedy and the character interactions which were just priceless. \\n\\n\r\nAll of that is mostly done away with in this new instalment. Any creativity the previous arcs had is thrown out the window leaving behind that empty shell I've grown to hate, with the only difference being that Touma is now punching girls instead of guys. I think the biggest problem is with the exposition. For example in the second arc, they pretty much throw you into the deep end of plots between churches and a whole load of techno-babble and if you can't make sense out of it in the first five seconds, well then good luck because they won't dally around. The comedy is sorely lacking in creativity as well. Let me give you an example of how that contrasts with the first season. At the beginning of one arc in the first season, Touma (who has amnesia) stumbles upon a very oddly dressed little girl. Touma being Genre Savvy enough to realise that anyone who dresses that strangely is someone he must know, decides to greet the girl. Except the girl in question immediately considers Touma an enemy just for greeting her and holds him at knife point. It's not that he wasn't exactly wrong in his deduction. It's just that he's an incredibly unlucky guy. In this season that type of comedy was mostly replaced with an insufferable amount of Accidental Pervert moments only two of which had any sort of creativity to them. There were some funny moments here and there but nothing like the first season and without that comedy the series loses much of its charm. \\n\\n\r\nAnd now that you're left with that empty shell you have the opportunity of realising just how ridiculously irritating Touma can be with his annoying speeches. In one arc, I noticed that when Styl was taken down by the antagonist if you actually notice, the pool of blood coming from Styl gets slowly bigger and bigger whilst Touma spends some precious time preaching to the antagonist about how wrong she is. Not only that but one problem is that anyone who knows even a little about how to argue would know just how terrible his debating skills are. It mostly just consists of throwing a lot of general idealistic principles. And that's not even the worst thing about his speeches. No, the worst thing is that it's only ever so far been used to break down incredibly weak motives. This was particularly egregious when the second to last antagonist Touma faces gives what has to be the most retarded antagonist's motive I've ever heard, not just in the To Aru series but in anime generally. \\n\\n\r\nOh and don't count on Index to become more important in this series like I did. She doesn't. Oh she serves as a good plot device in certain key moments but that's about as far as it gets. She's far more important in the first season, even when I thought she was being shafted. I wonder why they even call it “Magical Index” anymore. \\n\\n\r\nThat said it's not all bad. The series picks up in the last quarter and that would be mostly due to the introduction of Accelerator as a more central figure. A much more interesting character that provides a more cynical route for all those already irritated with Touma. But even then the last quarter had its flaws so it's nowhere near enough for me to overlook the poor quality of a whole three-quarter of this season. The soundtrack is at least as brilliant as it's always been (something I think is largely underrated) with each piece always providing the perfect atmosphere. The animation though has become a lot more inconsistent this season. It's great in many places but in others I notice a lot of odd and jerky movements and the inconstancy has been a notable pain for me throughout the entire season. \\n\\n\r\nOverall it's only because I'm a fan of the series that I'm not giving it an even lower rating. But even though the second season was a bitter disappointment, I still look forward to the third season (which although hasn't been announced yet is still a forgone conclusion). I’ve been promised by several Light Novel readers that the story really does get much better after this. Pushing aside the obvious problem that it would have to take 48 episodes to finally pick up, if season three does reach my expectations then I will simply consider this season a part of the story that bridges the gap between season one and three. So in conclusion, if you’re a fan of this series and you’re willing to watch 24 episodes of mostly mediocre stuff, all for the sake of understanding season three when it finally picks up then go for it, but make sure to lower your expectations. If you’re not a fan and you’re not in the least bit curious about what happens (even though you’re reading a review of it) then don’t bother.",
            "date": "2011-04-04T05:53:00+00:00",
            "helpful_count": 141,
            "mal_id": 35661,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/310836.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Haak",
                "username": "Haak"
            },
            "url": "https://myanimelist.net/reviews.php?id=35661"
        },
        {
            "content": "\"I'll break this illusion, with my right fist!\"\r\nA Certain Magical Index should really be renamed, and I have the perfect title: A Certain Frustrating Show. I don't think I've ever actually been so frustrated with a show quite like this before, not because it's bad, but because it's good, and very enjoyable - but for some bizarre reason, the show never uses its latent potential to become something truly outstanding.\r\nLet me get one thing out of the way first: Index II is a significant step-up from the first series, the first episode was actually better than nearly every single moment of the original series (minusAccelerator's little mini-arc) and actually got me looking forward to a show that I thought would only be marginally better than its prequel, instead, what I got was a series that involves a lot of evil Roman Catholics who are more extreme than most actual religious extremists, a lot of idealistic speeches and a lot of women being punched in the face.\\n\\n\r\nAnother thing I should get out of the way, if you're an easily offended religious person (specifically, a Roman Catholic) or a fairly hardcore feminist who believes that all men are \"pigs\", then this probably isn't the show for you, seeing as, more than likely, you may be offended by the shows content at some point.\\n\\n\r\nHaving said that, I don't think the show is actually trying to be offensive, it's just unfortunate that certain aspects of the show - which I'll cover later on - can be misconstrued as either racist or misogynistic depending on your beliefs. If you're able to get past these issues, then there's a good chance that you may be able to enjoy the show despite its faults.\\n\\n\r\nNow that I've covered the obligatory \"If you're easily offended, don't watch it\" section, I should probably move onto the reason you're (probably) still reading this review, that is, the part in which I'm actually reviewing.\\n\\n\r\nIndex II continues to follow the misadventures of everyone's favorite unfortunate protagonist, Kamijou Touma, and his exploits as he tries to deal with the looming threat of the Roman Catholic Church, the Roman Catholic Church and...the Roman Catholic Church, because apparently, the Roman Catholic Church seems to have nothing better to do with their time than try to take over Academy City - occasionally they mix things up a bit by not going after Academy City itself, but generally speaking, the Roman Catholics serve as the main antagonists for the most part.\\n\\n\r\nThey also happen to make some pretty poor antagonists at that, usually guided by poor motivations and weak reasons which are broken down by Touma's equally weak idealistic speeches which serve as a constant reminder that, despite having his occasionally cool moments in Index (and to a much greater extent, Railgun): Kamijou Touma is an idealistic buffoon, whose only redeeming feature is that he happens to have one of the most overpowered abilities in the history of fiction.\\n\\n\r\nHowever, poor antagonists aside, the most infuriating aspect of Index II's story is its own inability to capitalise on the clear potential that it actually has here, I'm not joking when I say that the potential for a really outstanding story is absolutely huge here. The story has a lot of really good ideas that, frustratingly, are hardly ever capitalised on for the majority of the run time - we still for example, don't actually know what Imagine Breaker is, all we know is that Touma's only redeeming feature is able to negate any supernatural ability that is thrown at him - magical or otherwise. No explanation is given as to why it is he has this power, what its full potential actually is, or why it's capable of negating supernatural abilities in the first place - it becomes clear in one of the later arcs that there is clearly a lot more to Imagine Breaker than meets the eye, (although this statement is kind of redundant, seeing as it was obvious) but that's about it.\\n\\n\r\nIndex too doesn't seem to serve any more importance than she did last season, in fact, there are several people who have argued that she was actually more important in the first season, even though there are arcs in which she doesn't actually appear at all. The MAL synopsis for this show is actually very misleading; if there are any of you who think that Index will serve a greater role in Index II then think again, she won't, and you'll be left feeling very disappointed. She's still just as annoying as ever mind you, so there are some definite pro's to this particular con of the story.\\n\\n\r\nThere are plenty of other occasions when the story fails to capitalise on its potential too, for instance, why doesn't it introduce any other saints besides Kanzaki Kaori? Surely the Church of England has other magicians it can send besides Stiyl, right? Just what exactly are Aleister's plans? Are there any other interesting Espers besides Misaka and Accelerator? Who exactly are the other Level 5 Espers anyway? (although Railgun S has already partially answered that question for me) There are a lot of other questions that I'd really love to ask, because this show still hasn't answered them, although I'm fairly sure that when Index III comes out, (it's a question of when, not if) I'll be getting my answers - in fact, I'm starting to think that Index II decided to purposely dodge any questions I may have purely for the purpose of getting me excited for the inevitable third season - and if that was the case, it succeeded.\\n\\n\r\nAnother issue with the story is the woman punching, personally, I wasn't as bothered by this as some people may actually be, but I can certainly understand why it can be seen as an issue. Nearly every arc (with a few notable exceptions) revolves around Touma punching the antagonist - in this case, the main female villain of the arc - in the face, and potentially rearranging it whilst he's doing so; I'm fairly sure that Index II's intention wasn't actually to be misogynistic, in the same way I think it's just using the Roman Catholic Church because of the various pieces of Christian symbolism it can use rather than being racist about it.\\n\\n\r\nIt's not all bad though, the last two arcs are actually really good and really enjoyable, for a few notable reasons, one of which being that they actually serve to progress the story and in a very notable way. The final two arcs are huge indications that something really big is coming, and make a large change to the sometimes filler-like feel of certain arcs (the Daihaseisai arc feeling like it was just dragging on, especially towards the end). Another reason is that Accelerator ends up becoming the main character for a time, which is a nice change of pace when compared to Touma. Everyone's favorite psychopathic anti-hero with a heart serves as a much more interesting main protagonist (which is why his little arc in the original series was by far the best thing about it), not to mention, he gets the good villain too, with his main enemy serving as a much more interesting, well motivated antagonist in comparison to Touma's villains. \\n\\n\r\nAnother notable aspect of Index II's story is that this time, it doesn't bombard you with lots of terminology, which was a huge problem of the original series, instead, any new terminology is actually explained and, more importantly, serves as relevant information to the plot - even if in some cases, it's arc limited. This makes it much easier to sort out plot details in your head, but it never feels like it's just spoon-feeding you either, which is nice.\\n\\n\r\nThe final thing about the story is, that, well, it actually goes somewhere...eventually. The original series never went anywhere with its plot, despite hinting that it clearly could, and whilst it takes a while for Index II to go somewhere, when it does eventually move, there are significant leaps in progress in comparison to the original.\\n\\n\r\nAnimation is also better than the original series, attacks look cooler and pack more of a punch in terms of visual clarity, the series animates rather well and it's obvious that Index II is getting the best part of the budget that I didn't know J.C Staff actually had.\\n\\n\r\nIt's not perfect however, there are some times when the animation becomes quite choppy and inconsistent, with the occasional off-model appearing every now and again, as well as some static images appearing here and there too. These are minor gripes however, as for the most part, Index II is generally rather good to watch and look at, especially when characters are bringing out their most powerful spells or Esper ability.\\n\\n\r\nSimilar to the first series, the OST doesn't really have that many notable tracks to go with it, although there a couple of tracks worth mentioning, probably because the show likes to play them a lot - Kyuuketsu Koroshi is a nice track that brings an atmosphere that wouldn't be out of place in a good detective show, Gensou Koroshi is essentially Touma's illusion breaking theme song, Nichijou provides some amusement when it's covering the daily lives of the characters. It's not a bad mix of tracks, although there are definitely better OST's out there.\\n\\n\r\nOpening and ending themes fare similarly to the previous series, with the one notable exception being the second opening, See VisionS, which is the series best opening by a long stretch and, funnily enough, becomes the shows opening theme when the story actually decides to become interesting.\\n\\n\r\nVoice acting is pretty strong too, now that I actually understand why it is that the various Misaka's speak like they do, I now actually think that it was a pretty clever choice as opposed to an annoying inclusion that actually does makes a lot of sense in context. Despite his character, Atsushi Abe is actually very good as Touma, and there are often plenty of times that his performance is able to sell the character despite the stupidity of his speeches (were it not for the fact that what he's saying is rather stupid, Abe puts so much effort into the role that he's capable of fooling you into thinking that what he's saying is worth listening to). Rina Satou still delivers well on Misaka - I'm inclined to like her more now seeing as I actually liked Railgun. Satomi Arai is actually pretty funny whenever she screams \"Onee-Sama\" as Kuroko, Rina Hidaka is fairly adorable as Last Order now that I understand more about the character...the list goes on.\\n\\n\r\nThere are a few notable performances in the voice acting as well, although, for different reasons. Rie Kugimiya does her trademark squeal as Sister Agnese, whether this is a good thing or not is entirely up to you, I personally didn't mind it. My man Keiji Fujiwara is a great addition to the cast as Accelerator's villain, Kihara, bringing a sadistic, cynical performance that totally fits with an arc revolving around Accelerator. Yuka Iguchi is...well, she's Yuka Iguchi, I didn't like her in the original series and honestly, my opinion of her hasn't changed all that much either. \\n\\n\r\nOnce again though, the best actor in the show is by far Nobuhiko Okamoto as Accelerator, he's able to pull off every scream, every insult, every single psychopathic laugh with amazing sincerity, all whilst being able to bring emotional depth to a character who, for all intents and purposes, you should probably hate and would do whatever it takes to avoid if you saw him on the street. It's Okamoto's performance when Accelerator's not screaming that really sells it, his world weary voice and seemingly apathetic attitude showing that, underneath the psychopath, is a very lonely and unloved boy who's just trying to get by and find people that he can actually get along with - which is probably why he goes so far to help Last Order and why they play off each other really well.\\n\\n\r\nThe characters of Index are a group of people who you will share a mixed relationship with, on the one hand, there are characters who are actually rather good, Accelerator being the most obvious example followed by Misaka, as well as characters who you will probably really dislike. I'll make this clear now, if you didn't like Index in the first series, forget about liking her here, she hasn't changed, she's still annoying and the moments when she bites Touma are not funny. The show does actually have some cool characters like Stiyl and Tsuchimikado, but they're never usually on screen long enough for you to actually say \"Yeah, these guys are actually really good characters.\" and that's actually a recurring issue with a lot of the characters in Index, there are definitely some cool characters here, but that's all they are: cool. You won't see any characters of any noticeable depth unless they're either main characters, or you watched Railgun and got to see Misaka's life fleshed out more. It's that irritating issue of when a show has too many characters, and doesn't know what to do with them, so you're left with two-dimensional to one-dimensional characters.\\n\\n\r\nThen there are the antagonists, a completely mixed bag of characters who range from decent (i.e Kihara) to pretty lacklustre (i.e most of Touma's villains) - Biagio Busoni I should add, is a total waste of Emperor Wakamoto's voice, in fact, if it turns out that they end up going up against God in Index III, Wakamoto should play God, that would be an appropriate role for him (for God I mean, 'cause he doesn't even come close to Emperor Wakamoto after all). \\n\\n\r\nThe most polarising character however, is Kamijou Touma himself. The main problem with Touma is that, well, he's a buffoon, an idealistic one at that, spouting out his ideals whenever his altruism gets him caught up in the final fight of the arc. Although, there is something there that doesn't make me totally dislike him - and I'm not just referring to his ability either. Kamijou Touma is a genuinely nice guy who goes to great lengths to ensure that everyone, be they friend or enemy regardless, turns out better for it, his altruism truly knows no bounds. Whilst I can't necessarily vouch for his brilliance as a character, he certainly does have some admirable traits about him, and if someone bothered to fix his idealistic speeches and terrible debating skills, I'd probably be saying I like the guy.\\n\\n\r\nWith all this being said though, Index II is an immensely enjoyable show. I managed to get through it in two days and I'm really looking forward to Index III (from what I know, the light novels are supposed to get really good once all the filler style stuff is out of the way), and flaws aside, when Index II is going at full swing, it's actually a hard show to fault - despite its issues, Index II has a considerably high entertainment factor. The comedy is actually legitimately funny and gets past cheap gags that were never really funny to begin with such as Index biting Touma, the action sequences are very good and are great to watch, and similar to the last season, the arc like structure allows you to pretty much watch the show at your leisure without feeling too bad about not watching for a bit. There's a lot going for Index II.\\n\\n\r\nI should also point out that, Index II is not a bad show, it's actually a good show - and it's fantastic in comparison to the first season. It's just a shame that, despite all its pros in comparison to the first series, its many cons, such as the frustrating inability to actually capitalise and fully exploit the good ideas that it actually has, prevent it from being truly outstanding, which is a really frustrating issue indeed. I'll just hope for now that, when Index III is confirmed, I'll finally be able to enjoy To Aru Majutsu no Index at its best and that I'll finally be able to say \"It's totally worth watching the first two seasons for.\"\\n\\n\r\nUntil that point however, it really will just be A Certain Frustrating Show.\\n",
            "date": "2013-06-30T08:50:00+00:00",
            "helpful_count": 106,
            "mal_id": 103127,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/276749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Masserati_",
                "username": "Masserati_"
            },
            "url": "https://myanimelist.net/reviews.php?id=103127"
        },
        {
            "content": "Return to the world of Science and Magic with Touma & Index.\r\nAfter the slightly successful, often enjoyable first series, J.C Staff fires off with the continuation of Touma's dilemma within Academy City.\r\nStory: 8/10 - The story that made the first series popular returns in its sequel. Here, the story kicks off with Touma attempting to finish his summer homework before the next day. Those who despised the slow pacing of its predecessor can rest easy - the series so far does a decent job of getting right into the action while reintroducing the familiar cast at the same time.\r\nArt: 10/10 - I always loved Toaru'sartstyle. But here, the character designs are more polished and proper, mixed with more than a fair share of loveable and humorous expressions.\\n\\n\r\nSound: 9/10 - Mami Kawada returns with her new single \"No Buts!\" as the opening. The song is very catchy and upbeat; a perfect blend of Techno and Pop.  Maiko Iuchi of \"I've Sound\" is once again in charge of the series musical score, and DAMN, the music this time around is awesome and fitting at the same time. The ending theme \"Magic∞World\" by Maon Kurosaki is pretty cool too.\\n\\n\r\nCharacter: 10/10 - The series has always been filled with loveable, colorful characters, and here is no different. New characters, bigger character development - what else can I say?!\\n\\n\r\nEnjoyment: 8/10 - Despite the amusing, interesting (and at times, absolutely hilarious) interactions between characters, it still struggles with the long and boring speeches on magic (seriously!). However, the fight scenes and special effects are better than before.\\n\\n\r\nIt's obvious that J.C Staff invested a much, MUCH bigger budget on animation and special effects this time around. With a start-up more enjoyable than the first, and the Academy Sports Festival coming up, I rate this series 9/10... for now. \\n\\n\r\nWhy are you still reading?! Go watch some Index!!!!",
            "date": "2010-11-05T18:00:00+00:00",
            "helpful_count": 66,
            "mal_id": 31845,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KentaMaeba",
                "username": "KentaMaeba"
            },
            "url": "https://myanimelist.net/reviews.php?id=31845"
        },
        {
            "content": "Some people hate sequels, saying it will never be as good as the original. Some people love them more, saying that they're just glad that there's more. I try to stay at a neutral stance, but I admit that I was still looking forward for this second season of Index (third if you count Railgun). I liked the first season; it had good characters and good story arcs. Railgun was a nice change to Index. How can putting the two together be bad? I had high hopes. Had. I don't know, but somehow, it happened. I mean, it was really really bad.\r\nThe story. What canI say? I just didn't really like them. Most of it has to do with the characters, which I will elaborate later on. The story arcs didn't lead to anything big in the end. There was no big climax or anything; they just left an ambiguous ending, sequelbating. The arcs seemed to be half religion half science. I would be okay with that if the two were actually mixed together but they were kept apart. It was more like it was half Index and half Railgun. At the end of each episode, they say that when magic and science cross, the story begins. That's the problem; they never crossed. Characters from their respective shows didn't really mix with the other either, and that was kind of disappointing. One of my biggest qualms with this show is how each arc ended. Some of the most unoriginal endings ever written. I can break it down. 1. Touma is the last man standing 2. He gives some terrible speech about care and love and other unimportant stuff and 3. He punches a woman in the face. How anti-climactic is that? You'd expect an epic ending with something magic or science related used against the enemy, but all you get is a punch in the face.\\n\\n\r\nThe characters. They have changed so much, and not in a good way. Touma seems even more self-righteous than usual. Index seems even more useless than usual too. She was very annoying, one of the most annoying characters in the series. You know, I didn't laugh the first time she bit Touma on the head, so why would I find the 46th time funny? Why are all the characters pandering to the fans? Who thought this was a good idea. I don't want to see every single female character wanting Touma little head (except for Index who wants his bigger one on his shoulders). They turned so many of them into tsunderes when they clearly weren't that in the previous season. Why? One is enough (well, one is too much, actually). Mixed in with these terrible story arcs, I've grown to hate these characters that I used to like. Oh, and there's fanservice. Some of the stupidest fanservice I have ever seen. In many shows, you have the panty shot, which is understandable because the camera just happened to be at an angle to see it, but it index, the characters strip down for you! Terrible.\\n\\n\\n\r\nThe art is very generic. The animation is average, I guess. Pretty much the same as the first season and Railgun, so I don't really have complaints about it. The music was really boring. It's some very generic music. I didn't really like the OPs and EDs either, but the first OP was alright. There seems to have been very poor artistic direction. Any art is just drained to almost nothing, and art is something that I crave. Oh well.\\n\\n\r\nOverall, I pulled nearly no enjoyment from this show at all. I absolutely hated the characters and story arcs. Very little logic was used, like that grenade in one of the later episodes that exploded in a small room and did barely any damage to the room and not even injuring anyone in the room. Logic was not on the menu for this show. J.C. Staff took something I really enjoyed and turned it into this ugly, disfigured beast that I found nauseating. I really hope they stop there and stop ruining it further. I can't say I have high hopes for that.\\n\\n\r\nThen again, I'm pessimistic.",
            "date": "2011-04-01T23:19:00+00:00",
            "helpful_count": 51,
            "mal_id": 35569,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Psychotik",
                "username": "Psychotik"
            },
            "url": "https://myanimelist.net/reviews.php?id=35569"
        },
        {
            "content": "Story - 6\r\nAfter watching the first season I hoped that the plot would finally unfold in to something bigger and better then the first season. Well it didn't!\r\nFor the most part it was worse and only close to the end got better. The problem with the story is that it isn't directional and is repetitive. It's because some villain shows up from the religion side (usually) and wants to do something bad. And then Touma comes to the rescue. And this happens like every time through out the season. Seriously the villains seem to change like every 3-5 episodes and only thing that they havein common is that Touma fights them with his right arm and wins. \\n\\n\r\nOnly at the end the story starts to do something about Magic vs. Science thing, but that isn't enough to draw your interest or provoke any real thoughts. Well the thought that this story provoked to me was that religion is crazy.\\n\\n\r\nVisuals - 9\\n\\n\r\nMaybe a bit too much flashy some times, but for like 98% of the time it is just great. Everything is crisp and clear and the characters all drawn well. Fights are all the time animated well also. I really have no more to say, because the art is great and nothing more.\\n\\n\r\nSound - 8\\n\\n\r\nBetter openings then the first season. The first OP was the greatest. As for the background music it kinda always fits well with what is happening, but never really increases your watching experience. It kinda is there doing it's job and nothing more so for the most part you will rarely notice it. In a way it is good, but it could bring out the overall experience watching to whole new level if somebody really wanted to.\\n\\n\r\nCharacters - 7\\n\\n\r\nI don't know why but for some reason Touma is the one character who I care less then the other secondary character like Misaka or Accelerator. Touma is just a plain normal hero-type. He is such a stereotype to the rescue that I want to punch him for being so cliche and uncool.\\n\r\nMost of the support cast is just some kind of fetish whatever and hareming all over Touma. It's just so stupid.\\n\\n\r\nOff course there are some likeable characters and Touma is in some way too. But do you really care for them? No, not really, except Accelerator and a little bit Misaka and the Misakas last younger clone called Last Order. If it would be my choice then Touma would not be main character, but Accelerator or Misaka would, because they are so much more more interesting and 3 dimensional.\\n\\n\r\nEnjoyment - 8\\n\\n\r\nAs for enjoyment I liked the comedy and the fights. As for everything else I can't that I enjoyed it a lot. Only for some moments, maybe. Also I would of really wanted so that this anime would provoke me to think about something.\\n\\n\r\nOverall - 8 (was very close to 7)\\n\\n\r\nToaru Majutsu No Index season 2 was a great as for the technical aspects like visuals and music, but when it comes to story and characters it lets you down quite a lot. If you have seen the first season then I can say to you that the second one was a bit better, but only by a small margin call. \\n\\n\r\nSeason 2 definitely isn't a must watch, but it is better then most of the animes out there. And if you liked first season a lot or you have none must watch series then go ahead and watch it. Just be careful, because the story really goes nowhere.\\n",
            "date": "2011-08-31T12:45:00+00:00",
            "helpful_count": 21,
            "mal_id": 42481,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/reinis-jan",
                "username": "reinis-jan"
            },
            "url": "https://myanimelist.net/reviews.php?id=42481"
        },
        {
            "content": "To be honest, after the first season, I had pretty low expectations for this second installment of Magical Index, but since I'm not one to judge something by it's cover, I went and watched it all. My short opinion: Pleasant surprise. Way better than the first season in every way, but has many problems still.\r\nThe first season of A Certain Magical Index was, frankly, a confusing mess. (See my review on the first season's page.)  Despite the unique and extremely intriguing setting, the story was jumping around like a wild firehose at full pressure, aimless and even major plot points went woefully unexplained whilethe characters were constantly spewing exposition over minute details. The characters themselves were but hollow shells with a bunch of conflicting tropes tacked on, only serving as plot devices. All that changed in the second season, and for the better.\\n\\n\r\nFor one thing, the characters now have clear motivations, something they lacked in the first installment. Toma, the main protagonist, is sadly still just a handle to drag the story forward, but at least he has some clear goals and motivations now. It's awfully cliché'd and hollow, but it's there. Basically, he wants to \"save everyone\" because he is a \"good guy\". His power is still totally unexplained and serves as a mere plot device (punch bad guy du jour in face = problem solved). Index didn't change much either, she is still suffering from the \"everything at once\" disorder, being the secret magical plot device, the tsundere and the comic relief moe all-in-one. The cute/whiny idioms, the biting and the forever-hungry gimmick is still there, and I know these are intended to be endearing, but it only comes off as annoying. However, there are new developments at the support character front. The introduction of the Sisters (Misaka and the nuns too), especially 20001 (Misaka-Misaka), Orsola Aquinas and gang, Kazakiri, the researchers, and a swath of new faces is really great, and brings some life into the series. Even the antagonists at least have some motivations other than \"I'm evil because I'm evil\", well, most of them anyway. It still seems to fall into one of two kinds, \"I'm following orders\" and \"I'm taking revenge because of reasons\". It's still an improvement.\\n\\n\r\nThe biggest improvement is definitely the story arc. Meaning, there is actually a story arc now, instead of random episodes with basically no connection. The series even goes as far as picking up loose ends from the first season and tying them into the story. By the end of the second season I just about started to feel like I'm watching a real anime with a story and good characters. Also, the second season is chock-full of fan service, some pretty weird ecchi scenes and finally some good humor. A special mention to Episode 17, which was genuinely enjoyable.\\n\\n\r\nA major shout-out to the only character, who received a character and a story arc: Accelerator. He is the ONLY ONE who went through any kind of change and was actually very well written as a sort of Faust character, and the only one who got his backstory and motivations detailed, at least somewhat. Not even the main protagonist received that kind of treatment, which is sort of puzzling. He is a kind of tragic hero, who now strives to right at least some of the wrongs he done. I especially like his involvement with 20001, and I really wanted to see more of his story. My only problem with him is his extremely annoying angsty, emo kid act. I can understand the borderline insanity and the conflicted morals and self-hate, but that's just a bit too much.\\n\\n\r\nAll in all, Index II is a definite improvement over the first season in most every way. It's not THAT great, but at least I could go through it all without cringing or scratching my head much, which is good.",
            "date": "2014-09-29T07:55:00+00:00",
            "helpful_count": 18,
            "mal_id": 162887,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4129013.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Playbahnosh",
                "username": "Playbahnosh"
            },
            "url": "https://myanimelist.net/reviews.php?id=162887"
        },
        {
            "content": "Writing a standalone review for an anime that is a sequel to another anime without referring to the predecessor is quite hard, what with all the comparing you need to do between the two shows. What was better? What went worse? Which season is the best one? Why? Questions like these will be brought up and thus, I am going to mention Index 1 in this review as well, but not to a far extent. However, I believe that shouldn't be a problem, since (I assume) you've probably watched season 1 already, which is why you're currently reading a review to its sequel.\r\nIn my reviewfor Index 1, I compared the show to a dinner consisting of grilled meat with various side dishes. I'm going to do the same with Index 2, so without further ado, let us move on.\\n\\n\r\nSo here we are again. You're sitting in the very same restaurant as last time, with the very same chef cooking you the very same meal. After he or she apologized for their mistakes regarding your last dinner here, you have agreed on giving them a new chance. Before long, the same plate is present at your table. There are the tender potatoes, the fresh vegetables and the tasty wine at the side. Then, there is the beef. Again, it at least looks and smells delicious, but you've learned to be skeptical when it comes to the food here by now. Nevertheless, it's time to see if the mistakes of the past have yielded the poor chef any experience.\\n\\n\r\nWhile still, very unfortunately, carrying with it some problems from the past, Toaru Majutsu no Index II is at least undoubtedly a better show than its predecessor. However, it is not so by too long a shot. Some (severe) issues regarding the consistency and description of the plot have been resolved, but they're not completely wiped out. Index 2 handles it's main story far better than the first season, with arcs being much more vowen into each other and characters not being forgotten. Also, there is actually some interaction between the parties of science and magic this time around. Nevertheless, the show still loses some potential with recurring faults. While the problems aren't big, they're many.\\n\\n\r\nThe meat is, for starters, edible this time around. It tastes nothing exceptional, but at least you know you can leave behind you an empty plate this evening. When taking the meal for what it is, the dinner is actually fairly enjoyable.\\n\\n\\n\r\nSTORY: 5\\n\r\nA score of 5 is a vast improvement over 2, which is what I rated the story of Index 1. The main improvement here is the consistency of events that unfold and the amount of depth given to each of them. The connection between happenings isn't always clear, but at least it's there. Characters (especially important ones) who are introduced are not forgotten anymore, which also adds to the fleshing out of them. All that being said, while 5 certainly is higher than 2, it's still far away from the higher scores. Agaian, Index 2 handles a lot of issues from the first season in a good way, but very few of these issues go completely solved. The story, while good, is far from as solid as it should be. Details of importance are still lost in the great void of bad storytelling, and sometimes events and happenings are downright mind-numbingly confusing as they seem to happen without you clearly knowing why. This goes for the last one or two arcs especially, where so much goes down while so little is clear.\\n\\n\r\nIndex 2 still divides the entire story into several different arcs, and it does so in a (much) better fashion than its predecessor. The arcs are consistent - they are connected. Next to all of them are interesting this time (some moments are even bloody awesome) and it feels like everything is adding to the core of the anime. However (forgive the repetitiveness by this point), some stories could have been told better. Thinking about it, this has been the true main problem up to this point for the entire time. While stumbling over its own feet, Index 2 loses details, sometimes crucial information, which are nothing short of needed for the viewer to fully understand what is going on. In the end though, Index as a series at least seems to be on its way towards the right track with many improvements having been made to it. It's far from perfect, but a show is (almost) always more enjoyable if stuff actually makes sense.\\n\\n\\n\r\nART: 8\\n\r\nNext to identical when compared to Index 1. Index 2 uses the same tone, same colors, same shading and so on. Note though that this isn't a bad thing. Far from it. I enjoyed the simple yet charming art-style of Index 1 a lot, and it being reused for Index 2 was nothing more than a welcome course of action. Nothing is too extremely detailed or well-drawn, but the skillful usage of simple colors to breathe life into the show is respectable and appreciated.\\n\\n\\n\r\nSOUND: 7\\n\r\nNothing stands out, but at the same time, nothing is bad. Very similar to Index 1 again, Index 2 hits the nail on its head while trying to set the mood right for specific events. Sound effects, just like the music, sound like they should - nothing exceptional yet nothing wrong.\\n\\n\r\nThe two things I do need to emphasize this time around are both openings respectively. They are, simply put, breathtaking. Even one who knows of Index's flaws regains hope and is deceived into thinking that everything surrounding the show is epic when they hear and see the colossi that the openings are. Maybe it's just me, but I'm serious. They are that good. The endings have also improved this time around, and are quite solid when used in the show.\\n\\n\\n\r\nCHARACTERS: 7\\n\r\nConsidering the fact that the score of the characters category here is identical to the one of my Index 1 review, it may seem odd seeing that characters actually got more time develop in Index 2. Yes, characters are consistent and ever-present in the second season, but while being so, they are still the ones you know from season 1. Touma has more time to be simply Touma, Misaka is the same girl who only gets a spoonful added to her person, and so forth. While characters are frequently presented in Index 2, they use their extra time to just present more of who they usually are anyway. The one character who actually progressed in his development was Accelerator, and that was one of the best things with the entire anime. Finally, as was the case with Index 1, side characters can sometimes carry too little importance for them to actually matter to the audience, and once they've had their handful of moments of importance or comic relief, they are quickly shunned away.\\n\\n\\n\r\nENJOYMENT: 5\\n\r\nYou like what you see, but you dislike what you know is bad simply because the storytelling varies from bad to abysmal. While being a step up from what Index 1 was, Index 2 is still plagued with the same faults, albeit at a smaller scale than its predecessor. The improved consistency of season 2 makes the show much easier to enjoy than season 1, however, and when the show manages to present what it has to tell in a decent way, the result is actually pretty impressive.\\n\\n\\n\r\nOVERALL: 6\\n\r\nIndex 2 is an improvement over Index 1, yes, but it is still a shame that so much gets lost because of bad storytelling. The main draw in the disappointment in both season 1 and 2 is that you can actually see the mighty impressive world created in the universe of Toaru Majutsu no Index. You know that everything needed for a fantastic experience is right there. However, when the ingredients are treated in the wrong way, what had the potential to be phenomenal becomes a saddening, dull mass of grey matter that you simply want to throw away. While Index 2 doesn't go that far, the show is still a crystal clear example of lost potential.\\n\\n\r\nThe meal is finished. In the end, it was fine, nothing more than that. Similar to a story that is treated in a bad way, you know that the faults don't lie within the food itself, but rather in the one who made it. If Index 2 is the ingredients which eventually turned out as the beef you just ate, the bad storytelling of the creator(s) is the chef in this case. Just like the chef had every chance in the world to turn the ingredients into something wonderful but failed, the creators of Toaru Majutsu no Index didn't manage to turn what they had into the sensation it very well could have become.\\n\\n\r\nWhen it all comes down to it, much like the food presented to you, Toaru Majutsu no Index is only fair at best because someone else messed it up. If a third season is ever released, I hope it's treated with the respect and care it genuinely deserves. A show that has all the potential in the world to grow up and become something grand but is never given the opportunity to do so is simply everyone's loss.",
            "date": "2012-02-16T16:38:00+00:00",
            "helpful_count": 13,
            "mal_id": 54031,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/443061.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tenos",
                "username": "Tenos"
            },
            "url": "https://myanimelist.net/reviews.php?id=54031"
        },
        {
            "content": "Toaru Majutsu no Index II is the sequel to the first season of Toaru Majutsu Series....I had high expectations for the sequel as someone who enjoyed the first season. But somewhere along the way i got a little disappointed. This review will tell you guys why. So let's get started shall we?\r\nStory (8/10): The story was just like how the first season went..it jumps from Arc-Arc-Arc....with different characters taking the spotlight. Well somehow the story got a little boring as it progresses. It's the same Fighting scene again and again and with Touma's fist always landing on their face's it got boring watching the samething again and again but overall it was good.\\n\\n\r\nArt (8/10): The Art is decent. Not much i can say about it. The fighting scenes are good,The Scenery,The Background are all good but maybe the key to which makes the art good is that the Art fits with the Story well. Serious,Happy or even Comedy moments were fitting with the athmosphere really well.\\n\\n\r\nSound (9/10): The Sound & Music on this one was great! It fits with the story too. Especially the OP & ED Songs. The fighting scene's theme song was my favourite. It just thrills your excitement when you are hearing the music along with the action which makes this anime's Songs Special.\\n\\n\r\nCharacter (8/10): While there were new character's thrown into the story.The Main Character's themselve's hasn't changed, well not in a bad way but they could have made the\\n\r\ncharacter development better. But with that said i find the character's really enjoyable and never found it boring at all.\\n\\n\r\nEnjoyment (8/10): This Anime was enjoyable but was also lame at times that i almost dropped it. The Thing that got me\\n\r\nunsatisfied with it is because of the \"Common\" Thing that happenes as the story progresses. Like the cliche \"Index Bite\\n\r\nat Touma's Head\" or \"Touma's I'll Beat that Illusion of Yours\"\\n\r\nIt was repeating again and again i almost fell asleep while watching the anime. But overall good Enjoyment.\\n\\n\r\nOverall (8/10): This Review is finally coming to a close. And overall the Anime was decent and sometimes it was also \"Special\" but that's it nothing more nothing less just decent Portrayal of Action and Comedy.\\n\\n\r\nWell Guys this is the end of my review...sorry if i'm still crappy at this but this is my 3rd review in MAL so please give suggestions and advices on how to make my review's better :) i'll appreciate it. #Da_Harem_King Signing Off",
            "date": "2014-10-16T19:28:00+00:00",
            "helpful_count": 12,
            "mal_id": 165053,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674457.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IMeinRuby",
                "username": "IMeinRuby"
            },
            "url": "https://myanimelist.net/reviews.php?id=165053"
        },
        {
            "content": "A Certain Magical Index 2 in a nutshell:\r\nFanservice villians vs touma's right fist\r\nStory (8/10)\r\nThe story continues as powerful religious organizations want to take a hold of Index to take one of the 103,000 books inside her.  \r\nWhat I hated most about the previous season is the rush of plot and throwing in 6 arcs. In this season, they shoved down another 6 arcs in 1 season. However, this time, the plot was somewhat easy to follow. These 6 arcs are called \"Orsola  Aquinas Rescue\", \"Tree Diagram Remnant\", \"Daihaisei Festival\", \"The Queen of the Adriatic Sea\", \"Academy City Invasion\", and \"Skill-out Uprising\". \r\nThe plotwas somewhat easy to follow because unlike Season 1, the plot doesn't jump around randomly every arc. They're all connected together. Also, the arcs are not all about Touma. It also focused on Accelerator, Misaka, and Shirai.\\n\\n\\n\\n\r\nArt/Animation (9/10)\\n\r\nThe Animation is a big improvement from the 1st season. The environment and character design looks more beautiful. Still a bit choppy here and there but they're not that significant.\\n\\n\\n\\n\r\nSoundtrack (8/10)\\n\r\nThe soundtrack is the same as the one I've heard in \"A Certain Scientific Railgun\". I love the soundtrack from Railgun so I also love it here. I don't think I've heard any exclusive soundtrack. Anyways, OP1 and ED1 was complete trash. By the time I was at episode 5, I started skipping the opening soundtrack because I couldn't handle it. On the other hand, OP2 and ED 2 was a big improvement.\\n\\n\\n\\n\r\nCharacter (8/10)\\n\r\nAll of the characters from the first Index are here with some new characters being introduced. Most of them are antagonists and some of them are characters that are added in Touma's harem. What I didn't like about the antagonists and some few new supporting characters are their appearance. I mean what the hell is up with their boob sizes? I couldn't really take them seriously. The only new characters I liked are the sisters of the Roman Orthodox Church. Some characters from Railgun also made an appearance here like Uiharu.\\n\\n\\n\\n\r\nEnjoyment (7/10)\\n\r\nI only enjoyed the 1st, 2nd, 4th and 5th arc. The remaining arcs are just either too stupid, full of fanservice, or just a filler. \\n\\n\\n\\n\r\nOverall (8/10)\\n\r\nOverall, the anime is an improvement from the 1st season but it still has a lot of flaws. At least, they learned to not throw a bunch of information at you in 1 minute and expect you to understand everything. Some people say Index 2 is better than both Railgun and Railgun S. I have to disagree with that. Index's biggest flaw is they rush the arc and the plot. In Railgun, they focus on 2 arcs only and it actually takes time for the story to develop.\\n\\n\\n\\n\\n\r\nPros:\\n\r\n-Story was an improvement from the 1st Season\\n\r\n-They learned from some of their mistakes from the 1st Season\\n\r\n-Better Animation\\n\r\n-Soundtrack slightly improved\\n\r\n-Characters from the 1st season is still likable\\n\r\n-Few funny moments\\n\\n\\n\r\nCons:\\n\r\n-Plot is still slightly rushed\\n\r\n-They still throw in 6 arcs instead of just focusing on 2-3.\\n\r\n-Antagonists and some new supporting characters are full of fanservice\\n\r\n-Protagonist can sometimes be frustrating\\n",
            "date": "2015-06-22T10:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 190928,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=190928"
        },
        {
            "content": "~ In a place where Science and Magic are at equilibrium ~\r\n(TL;DR Version: Bottom Paragraph)\r\nIn many ways the \"Index\" story/perspective bit off more than it could chew, and so while To Aru Majutsu No Index II is an IMPROVEMENT to the initial season in many ways, and regardless: a thrilling journey overall...  IT'S LIMITING AND COULD HAVE BEEN SO MUCH MORE...\r\nAs a continuation of the Toaru \"Index\" story, Toaru Majutsu no Index II is the sequel to begin work on bringing the comparatively chaotic and rushed first season (particularly past episode 10, as you can read up in my Toaru Majutsu no Index review)to a satisfying conclusion.  \"Index II\" as I will abbreviate this sequel season from now on set about rectifying LOTS of the prominent issues that arose during the previous 24-episode season; and to an extent this worked at increasing the overall vividness and development of the stories. For Index II to have accomplished this, it has evidently worked to subdue the fast-pacing issues combating depth in the prior season, and begin to take more time to explain the intricacies of the characters and plot. At least until the end drew near.\\n\\n\r\nContrasting with the \"Railgun\" story/perspective, even after the so-called culmination of the \"Index\" story shown here, it was still frustratingly left with a number of open ends. This is likely the result of the copious amount of arcs that were thrown in prior, and so whereas the \"Railgun\" story was given more time to develop consistently and conclude strongly; \"Index II\" proved unable to finish what it had begun. I therefore say that it was destined to fail at achieving its full potential from the start...\\n\\n\r\nAdvancements...\\n\r\nThe eventful life of Touma and Index in Academy City, plagued by the large scale conflict between science and magic of which they are both apart, is directly continued into Index II. Context continues to be integrated into the story through various revelations and realizations associated with a wide range of characters throughout. Arcs therefore tend to become clearer as the show is given time to progress.\\n\\n\r\nThe evolution of the prior season into Index II is similar to that of \"Toaru Kagaku no Railgun\" into \"Toaru Kagaku no Railgun S\": It feels more passionate and gripping. Primarily this is because Index II shows a fortunate change of technical investments. Most significantly, Index II is the sequel to ditch the \"content cramming\" of the first season, as i remember quoting in the corresponding review. Index II puts an end to abrupt endings and transitions, besides the odd unannounced classroom filler episode here and there. This means that each story seems more wholesome and more importantly: relevant to a greater plot. \\n\\n\r\nInstead of throwing up new enemies here and there like in the previous season to emphasize a sense of time and scale, Index II makes the wiser choice of favoring content quality over quantity. It showcases a more more considered approach which brings the motivations and personal complexities of each character, be it a friend or foe: to life. The relentless action across the entire Toaru franchise gives the whole thing an obvious cinematic \"kick\", as Index II continues to uphold this intensity. In addition, it brings about more unpredictability and in turn tension during the countless battles, just by leveling out the characters' abilities. This somewhat suppresses the formulaic and therefore flawed nature of Touma's typical path to victory, but the real development here is the introduction of the above mentioned \"considered approach\".\\n\\n\r\nIt adds to the cinematic and action-filled events of the \"Index\" story by factoring in more character motivations, and backstories. It brings about a more personal \"kick\" by lessening the distance between the viewer and the far-fetched characters by means of linking the two through better elaborated upon plights. It's an overused term, but this serves to deepen/bring some weight to an otherwise spontaneous set of leaps from bad-guy to bad-guy as were shown during the previous season.\\n\\n\r\nI have no doubt here that Index II made the right choice in allowing more time to cover material brought up too quickly prior, instead of filling up excessively on content scale, though it's far from minimal. One of my favourite examples of character development here is that of Accelerator, who similarly to Touma is given a very intimate form of documentation which incorporates a very personal-feeling viewpoint via integration of inner-thoughts and motivations. He is an example of how Index II builds up from what the previous season started... and I so really enjoyed the result of this continued exploration and explanations; on top of the more surprising and suspenseful battles which when combined give Index II a greater sense of substance, and allow for viewers to become more intrigued.\\n\\n\r\nOther characters: Agnese and even Shirai for example receive some light during Index II as well; which helps towards clarity. More importantly though is the way that instead of discarding old information and development by introducing something completely different afterwards: as was often shown in the previous season... Index II is much better at integrating elements of the \"Index\" story together though greater transitional consideration. It actually develops and builds much better in a more cohesive fashion; and so with such an improved approach compared to the prior season, why is it only \"1 mark\" higher?\\n\\n\r\nDownsides... Involving the \"Index\" story as a whole\\n\r\nWhen Index II rectified a lot of issues as mentioned above, it subsequently revealed a lot of loose ends particularly towards the conclusion, which drag down the very high level of presentation value.\\n\\n\r\nMost significantly, the ending: an underwhelming, inconclusive and ambiguous finish which hints at a direct conclusion that's likely to never come about: the \"Railgun\" story being a side/alternative/child plot line as opposed to a continuation for those unaware. The ending didn't show a good culmination or conclusion to the war we were first introduced to on episode one of the previous season, as it's almost like it never happened. The \"Index\" story talks a lot about a clash of science and magic, but they're always treated as separated elements. When your penultimate episode is called \"Before the war\" in spite of the fact that it was supposed to be coming to some sort of conclusion or conclusive message... goes to show that clearing up the errors of the previous season was too big-a-task for Index II on top of finishing properly what it had begun. It was unable to finish what it had set out to do.\\n\\n\r\nComing to a close...\\n\r\nIndex II is so much better when compared to the first \"Index\" story season...\\n\\n\r\nAnd so i agree with the many critics out there who rightfully point out that the story as a whole, FRUSTRATINGLY leaves too much unexplained to come to a satisfying closure. Had it been given more time in a direct continuation, it might have hoped to achieve its potential, as the context and premise (mentioned in my previous season review) brings about such an interesting setup. The religious war theme works really well, but is simply not expressed near fully at all.\\n\\n\r\nTL;DR\\n\r\n+ GREATLY Improved character development\\n\r\n+ GREATLY Improved cohesion of arcs\\n\r\n+ GREATLY Improved pacing until near the end\\n\r\n+ Improved tension and unpredictability in battle\\n\r\n+ Maintained decent audiovisuals\\n\\n\r\n- Still formulaic by nature\\n\r\n- Underwhelming conclusion\\n\r\n- Lots left unexplained\\n\r\n- I waited for some more of Index here as a character, but she remains very underdeveloped\\n\\n\r\n~ Power is striven for to tilt the scales... ~",
            "date": "2015-05-26T15:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 188885,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=188885"
        },
        {
            "content": "Great story, good battles, but the absolute most annoying characters in history. Index and Mini-Misaka 20001 makes me want to pound my face into my table. They just won't shut the fuck up. Excessive talking during battles while people are dying right behind that person. Sometimes I wonder how they even make it out of there.\r\nOnly going to give a longer review, solely for the battles and animation. You're thrown into a world where human beings have insane amounts of power. Naturally being humans we want to know who is more powerful, and again as humans we perpetually try to surpass that power. This animeshows power isn't everything. It also shows what it would look like to give an animator knowledge of plasma.",
            "date": "2014-08-17T03:54:00+00:00",
            "helpful_count": 9,
            "mal_id": 156865,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3472357.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/limbones",
                "username": "limbones"
            },
            "url": "https://myanimelist.net/reviews.php?id=156865"
        },
        {
            "content": "This review would include season one and season two.\r\n[7]Story:  The plot in ToAru is fairly good, but generic, a boy protecting his city and the people that he loves.  There is no uniqueness in that.  That being said, there is no plot development whatsoever, just the same guy doing the same things with different villains.  On the upside, all the action scenes are fun to watch and usually keeps you on the edge of your seat.\r\n[10]Art:  Outstanding animation, and the supernatural powers in ToAru are pretty unique and fun to watch.  Background scenery is exceptional.  Characters were eye-appealing.\r\n[9]Sound:As for sound, it was very well done.  Using Mami Kawada would be pretty fitting if the anime revolved around the female lead though.  Voice actors, just simply amazing.  I particularly think the female lead's voice is somewhat annoying.\\n\\n\r\n[4]Character:  The character development in ToAru is terrible.  You learn nothing about the main characters' pasts and the interaction between them is pointless.  Characters come and go, except for the male lead and a couple others.  I'd say there are far too many characters as well that are introduced.  The main female lead, Index,  is very annoying as well.  She's childish, uncute, and is only there so guys don't get bored of constantly looking at Touma.  In the first season, she was introduced as a very important character and helped Touma through everything.  Despite having her name in the actual title of the anime itself, she plays an unimportant role in the second season.  This anime would have been a lot better if Index and her powers were further revealed.  Touma also has a annoying and stupid thing he says constantly, and Index keeps being a little b@#$% and complains to him and then bites him on the head.\\n\\n\r\n[9]Enjoyment:  Despite the flaws in ToAru, this anime was actually very enjoyable for me and I couldn't wait for each episode to come out.  But, this has no re-watch value whatsoever to me.\\n\\n\r\n[7]Overall:  With ToAru, I thought it was a fairly decent anime despite the flaws.  If you like good action with a cool male lead, then this is your anime.  If you're more into detail and characters, I wouldn't recommend this to you.",
            "date": "2011-04-03T21:23:00+00:00",
            "helpful_count": 9,
            "mal_id": 35650,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373495.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kennydejavu",
                "username": "kennydejavu"
            },
            "url": "https://myanimelist.net/reviews.php?id=35650"
        },
        {
            "content": "(This is my first review,so please forgive me if it's lame XD)\r\n~Story & Overall~ 9/10\r\nAfter pretty good first season (which took me few weeks to complete since it wasn't really THAT interesting) I wanted to finish what I started and I must say that I was pretty much unpleased when I found out that it's still an ongoing series - it almost stopped me from watching, since I hate waiting; however, I continued and I was positively surprised. Since I'm (kinda) a young girl and not much of fan of harem stuff, I did roll my eyes at some fanservice moments, but other than that- WOW. It's like thousand times better than first series. Story gets much more complicated and Magic vs. Science 'fight' gets more serious. That's exactly what I like Also, less 'fillers' :D To sum' it all up - if you liked first season, you will LOVE this one. If you didn't like first season that much - well, you will still like this one. XD But if you loved first season aswell, then I really don't know why are you reading that XD Shoo, go watch it already!\\n\\n\r\n~Art~ 9/10\\n\r\nPretty animation, yes yes. It's clearly visible that more money was spent on 2nd season comapred to first. I took lots of screenshots because art is so nice.. The eyes, the hair, and...and....I looove how powers are drawn, like Misaka's electricity. :)\\n\\n\r\n~Sound~ 9/10\\n\r\nIf I say half of my MP3's full just with Index OSTs and openings/endings, doesn't that tell enough? As always, it's completely amazing :) Besides I'm huge fan of Mami Kawada and once again both openings are completely suiting for Index atmosphere - somewhere on youtube somebody wrote that Mami Kawada's songs always fit atmosphere perfectly, and I must agree. I never once skipped the opening since episode 17 xD\\n\\n\r\n~Character~ 9/10\\n\r\nWell...poor Index is being ignored again XD\\n\r\nAnd I miss Misaka - though I was watching Railgun parallely(is that even a word or I just invented it?) with it so I survived :3\\n\r\nHowever, I was really happy to get a little bit more of Accelerator and Last Order, also everybody besides Index gets development and all. They are great just as always.\\n\\n\r\n~Enjoyment~ 10/10\\n\r\nThere's where TAMNI didn't disappoint me nor in first season nor here. I remember falling asleep while watching first season though, while I was actually staring at the screen at late night hours such as 4 a.m. while watching second season",
            "date": "2011-03-06T09:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 34931,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/286861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Twigileia",
                "username": "Twigileia"
            },
            "url": "https://myanimelist.net/reviews.php?id=34931"
        },
        {
            "content": "Well, i have laughed so hard to this anime from season 1 to end of season 2.\r\nSo this is story of Man, right hand and hell lot of women who get punched in face from that man. There is lolis who get punch in face, there is nuns who get beaten, there is million times strogner ppl who get beaten whit one or two punches. \r\nBut the best super power that MC has is (not my words) MC therapy session. He's like Dr.Phil when he opens his mouth middle of fight.\r\nEvery one who's watched this knows what i mean ^^\r\nBut still overall this show was4/10 to me",
            "date": "2015-06-26T05:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 191306,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4100629.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Seepos",
                "username": "Seepos"
            },
            "url": "https://myanimelist.net/reviews.php?id=191306"
        },
        {
            "content": "If you are looking at this review im gonna guess you watched season one or you are looking at reviews from both season to get an idea if you should watch this show.\r\nA Certain Magical Index this show quickly became one of my favorite for many reason\r\n1. It has a good story whole science vs religion idea is very interesting idea and the series pulls in of well\r\n2. Characters the Mc Touma quickly became one of my favorite anime characters due to the fact he is unique most anime character do the right thing and do it for there friends Touma does what he deemsnecessary to save a persons life whether it be good or bad but he is also very funny and a straight up lady killer\\n\r\n3. Humor  this show is just hilarious i believe it is very underrated for its comedy\\n\r\n4. Awesome action fight scenes are real fun to watch seeing up 12 year old nun he boxed out there is nothing like it\\n\\n\r\nSo i really recommend this show its an easy 9/10",
            "date": "2015-01-12T23:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 177655,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4359331.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/toumasrhand",
                "username": "toumasrhand"
            },
            "url": "https://myanimelist.net/reviews.php?id=177655"
        },
        {
            "content": "This will be my first review ever of any series, but I do hope that it will be taken seriously. Let me start off by saying that I've never read the light novels before and that I thought season 1 was mediocre at best. Season 2 is basically the same in all aspects. It's just a continuation of the story. \r\nArt:\r\nI'm not sure if animation and art should be grouped in the same category. While you might have gorgeous looking backgrounds, you might also have shoddy animation that ruins the whole concept. JC Staff is guilty of some really horrible animations and storyboarding in certainscenes here. There were times where I felt like changing the channels solely due to embarassing storyboarding ideas. Take for example the school festival, when Mikado asked Touma to jump on his back WHILE they were still running because apparently if they do that he'll gain some extra speed.. Well, maybe if the animation was better in that scene it would've made more sense. Sadly, it wasn't. \\n\\n\r\nIt's a shame though, I would've really enjoyed Index if not for this factor.\\n\r\n5/10\\n\\n\r\nStory: \\n\r\nThis was the part of Index that made me stay for two seasons of awful animation. And if there were a third season, I would pick it up right away. The central theme here I believe is every individual's sense of righteousness.. like many other shounen shows. Whether you belong to the church or if you're in a military organization. Everyone's got their own opinions on what they're fighting for, so rogue factions are abound. In fact, a LOT of them. I hear it gets even more convoluted in the light novels, but I really do find it interesting watching everything unfold.\\n\\n\r\nI guess there might have been similar storylines in other pieces of literature, but it's all about how you execute that idea and adding in your own twist to it. \\n\\n\r\nI also like the idea of Academy City. A futuristic setting that has its own unique cultures. However it does not forget its own setback in becoming a densely populated cultural and modern hub. Crimes, and lots of them. Sometimes I feel that the city itself is its own unique character that shouldn't be overlooked by viewers.\\n\r\n8/10\\n\\n\r\nMusic:\\n\r\nI wasn't really paying attention to the music because it never really got hold of my attention in the first place. I always believe that all good anime have good music because the studio actually care about putting that extra effort in. The bgms never really captivated me. The ops were forgettable too, although I quite like the animation in it. Sadly it didn't transfer over to the actual show. Well don't get me wrong, I love what I've Sound has done for the animation industry. They have produced memorable tunes that every decent anime fan out there should have heard at least once, but I'm just not feeling it here. It's quite generic to be honest.\\n\r\n5/10\\n\\n\r\nOverall I feel that JC Staff has ruined what would've been a better anime in terms of animation. But I would still watch the 3rd season just because I'm too lazy to read light novels.\\n\\n\r\nSide note: I do NOT hate jc staff. In fact, I think that they have very good animators. Just look at kamimemo and toradora. \\n\\n\r\nThank you for reading!",
            "date": "2011-08-17T12:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 41667,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dizzydiz",
                "username": "dizzydiz"
            },
            "url": "https://myanimelist.net/reviews.php?id=41667"
        },
        {
            "content": "Okay. Let me explain my rating first. Yes, I gave it 5 across the boards, however the reason is because I only enjoyed half of this season. That half being Accelerator's story. If the show didn't have Touma as a main character then it would have been 10 all the way through. However, for some reason they back up a BORING, NON-DEVELOPING and UNRELATABLE HAREM-TARGET that is Touma.\r\nAlthough not as bad as season 1 of Magical Index, season 2 still suffers from what the previous season tried to accomplished. There are too many characters and arcs to cram into in such a short time. Especiallywith a main character [TOUMA] whose one and only trick is to lecture his enemies to death while somehow being Rocky Balboa and unable to stay down. Undeveloped villains don't really add much danger or significance to the story. Good thing that they learned how to fix it during Railgun & Railgun S. \\n\\n\r\nOKAY! THE GOOD PART! \\n\r\nThe one and only saving grace of this season, probably of the entire series, is the other protagonist/anti-hero ACCELERATOR.....and next to him LAST ORDER. If the season/show was about those two characters it would have been all we needed. The relationship between the two isn't stagnant and reliant on forced comedy. [HEAD BITING?] If you are on the fence about watching this series, then at least \"suffer\" it all for ACCELERATOR. Finest piece of character development ever with little to no background information. \\n\\n\r\nCan one to two characters support an entire show? ACCELERATOR and LAST ORDER can, i'll tell you what. Anyway, if A CERTAIN MAGICAL INDEX doesn't tickle your fancy, watch the better written and produced A CERTAIN SCIENTIFIC RAILGUN. Better story telling, character development, enhanced antagonists, involved support cast and comedy that supports the story along.  PLUS, ACCELERATOR background. SAY WHAT???\\n\\n\r\n**Thumbs Up! A Certain Scientific Accelerator**",
            "date": "2014-01-18T03:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 129177,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3473723.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JustDan",
                "username": "JustDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=129177"
        },
        {
            "content": "Prior to Index II I watched both seasons of Railgun as well as Index I.\r\nCompared to those seasons, this just feels incredibly rushed. \r\nAlthough The Daihasei Festival arc seems fine enough, Everything previous had no set-up and was over in just a couple of episodes. \r\nFurthermore they keep adding a few minutes of random interactions during each episode of Touma and the various other characters enjoying the festival, albiet with an incredible amount of fanservice. \r\nThat is why I docked the story down to a four.\r\nThe art neither improves nor degrades the already set art-style, although since as I was watching it, I had towatch it low-res, it looked rather meh\\n\\n\r\nThe music did not either particularly detrtact nor add to the overall experience, leading me to simply leave it at the same rating as I gave the anime over-all\\n\\n\r\nThe characters are fine, I do enjoy watching them simply interact between themselves.\\n\\n\r\nMy enjoyment was about the same as my over-all score.",
            "date": "2018-11-23T20:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 294603,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheSociopath",
                "username": "TheSociopath"
            },
            "url": "https://myanimelist.net/reviews.php?id=294603"
        },
        {
            "content": "STORY - 6\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 7\r\nENJOYMENT - 7\r\nOnce again, the Index series continues on with its story between the two great divisions of mankind: religion and science. Bringing the old and the new together, the second season expands its world of supernatural powers with greater proximity. There are indicators of something huge brewing right around the corner but quite frustratingly, the ever-present narrative issues are still there to dent the story's full potential.\r\nCompared to its predecessor, the second season follows more or less the same formulaic method as the first season, except now, we have some hints to a bigger story. Havinga core that holds each arc together gives everything one more level of significance. After all, this is a world where religion and science coexist with one another. It's definitely a story idea full of potential.\\n\\n\r\nBut like I've said already, a couple of negative factors sadly bog down the story. The biggest perpetrator is the mishandled pacing that felt too fast here and there. Especially for a complex world like the Index series, a rushed pacing will not bode well at all because it's synonymous to a jumbled-up story. And when you have a jumbled-up story, you will have an awkward time trying to process the many information, interactions, and fights that are present here.\\n\\n\r\nSo, how about the concepts of the story? Well, it's clear that there are more substantial movements going on in the religion side with various Christian sects such as the antagonistic Roman Catholic Church making their move. Touma, along with his mysterious right hand and other existing and new characters, must prevent their hostility from affecting the fragile balance of the world. In terms of the characters, the antagonists make up a pretty poor group of people driven by weak reasonings. When combined with their little screen time, they aren't that impactful to the story. They can be entertaining, but you will only reach the bedrock if you want to dig deep for any three-dimensional qualities. Character development is still not a very important factor for this series and as for the unlucky Touma, while he has his tendency to just shout idealistic lines and punch faces, his generic aspects serve as a good dichotomy against the diverse religious and scientific workings, like a litmus paper that functions under different conditions.\\n\\n\r\nThe last few episodes, thankfully, brings this season off to a solid conclusion with the focus on the Dark Side of Academy City along with some huge conflicts looming between the religion and the science side. Accelerator, the strongest esper who is also the face of Academy City's darkest secrets, gets more anti-heroic attention here and is put into a parallel comparison with Touma, highlighting their similarities and differences. This neatly ties in with the multifaceted viewpoints of the Index series and is definitely the strongest dynamic for this season.\\n\\n\r\nAnother good factor I enjoyed, albeit in the lighthearted zone, is the slices-of-life, usually constituting verbal dialogues that are clever in their humor. There are not as many of these compared to the first season, but they dampen up the inharmonious main story when they do appear. Basically a nice breath of air every once in a while, though the fan service ones are still not that tasteful. \\n\\n\r\nArtistically speaking, the visual is now cleaner with better line work and this results in an environment that is pretty much more polished in all aspects. Particularly, the backgrounds deserve a shout out just because of the high-quality glints that emit through the screen. A lot of the blue vibrancy in the backdrops brings out the magical and supernatural tone of this show, so it's definitely a cool complementary effect. As for the animation, it tends to be inconsistent but once the final climax of the fight comes in and Touma grips that right fist of his, the animation is amplified to noticeable levels. You might get a kick out of seeing all the close-ranged shots of faces getting punched to oblivion. I sure as hell did.\\n\\n\r\nThen we finally have the improved line-up of soundtracks. Of course, the upbeat electronic music with fast beats per minute is still there to pump up the fight scenes but there's a distinguishable presence of angelic soundtracks as well that really fits the religious theme. The diverse range of voice actors further contributes to the entertaining factor and especially for the antagonists, the expression of various personalities is the definition of eargasmic. Mami Kawada also knows how to sing cool opening songs while the second ending theme has a gentle melody that is a treat to listen to.\\n\\n\r\nAll in all, the second season of the Index series is a passable continuation. The anime suffers the most from a rushed pacing which left out quite a bit of relevant information from the light novels, affecting how the characters are treated and decreasing the enjoyment value. But religion and science have finally collided with each other this season. What happens next will certainly be bigger than anything we've seen so far.",
            "date": "2018-10-27T07:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 292712,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=292712"
        }
    ],
    [
        {
            "content": "Before I begin my review, let me share with you a little story\r\nI once went to the \"Women Are Neglecting Kitchens Society\" ( Yes, I do know that abbreviates to W.A.N.K.S) Don't worry, all they do is tell \"Women and Kitchen\" jokes to each other. Anyways, the committee was proposing \"Kamijou Touma\" as their society's mascot. Bear in mind I did not watch any episodes of \"Toaru Majutsu no Index\" at all so I had to ask, \"Who the heck is Touma??\"\r\nMy membership got instantly revoked.\r\nSo after watching the first season, I still did not understand why is Touma is treated like a hero forthe W.A.N.K.S. But after venturing into the second season during the great \"Nuns vs Touma's Right Fist\" war, I finally understood them..\\n\\n\r\n\"Your story wasn't that entertaining\" says Misaka expressing her boredom.\\n\\n\r\nOh, and providing commentary for this review today is Misaka Clone #10032\\n\r\nSo let's begin the review shall we?\\n\\n\r\nAs I've mentioned before, I've continuously watched from the first season into the second season, thus I could significantly notice several changes between the two season.\\n\\n\r\nOnce again the story revolves around Kamijou Touma and his RIGHT FIST. Note I do not say RIGHT HAND to avoid any sexual innuendos. Once again, Touma lack of discrimination for women causes him to go out of his way to save any \"damsel in distress\" nor does he care about holding back when he \"rearranging their faces\" Along with index and a few other companions, he is again dragged into solving the problems between the two dominating church factions in the story out of his sense of altruism. I can absolutely say you will get hooked onto each episode, there is almost no such thing as \"fillers\" (Eventhough once in a while I would like that since the story is moving at such an incredible momentum) I did not read the light novels thus in no way am I comparing the anime to it.\\n\\n\r\nThe character design improved significantly from the previous season. Combat sequence are getting more serious effects. I love the new opening now and I've seen tons of spoof and parodies made about it in NND. This is one of the few openings I would actually listen to instead of skipping. And who doesn't like the sound effect when Touma uses his RIGHT FIST to dispel magic or espers ability?\\n\\n\r\nCharacters! More development here for Touma's character. And when I say more development, I mean his HAREM is developing! However I felt like they were neglecting Index once again.. Poor Index... Other supporting characters such as Misaka, Accelerator and Kuroko do appear to further compliment the story. Misaka and her tsudere-ness reaches a higher level! The sad part about this anime is that as new characters are being introduced, the older ones which had their own arc are being left by the sidelines. \\n\\n\r\n\"I did get to appear momentarily in one of the episodes...\" says Misaka proudly.\\n\\n\r\nNO!!! DONT SPOIL THE SHOW FOR THOSE WHO HAVEN'T WATCHED!! Now go make me a sammich!\\n\\n\r\n\"I decline...\" says Misaka while looking at the other direction.\\n\\n\r\nAnyways, as blasphemous as it is, I did enjoy the whole religion versus science theme. Ok, so technically all religions are not represented so to correct it, it would actually be a war between the Christian Crusaders and Science. And wow, these Christian Crusaders made Taliban Terrorist looks like wimps, eventhough in reality the existence of espers and magic isn't really acknowledge. Now the reason I wouldn't give the enjoyment value of this anime to the maximun score is because the whole Touma tries to reason a girl, girl rejects Touma's reasoning, Touma's crush girl's illusion a.k.a her face, girl defects and becomes his ally, is getting old pretty quick. Sure thats a nice way to add girls to your harem instead of the typical dating sim of buying flowers and chocolates and raising flags every single moment, why not just falcon punch her?? Now, in no way am I or Touma are sexist here.\\n\\n\r\n\"Touma isn't sexist as he indiscriminately punches anyone in the face, male or female\" Misaka adds to strengthen the argument. \\n\\n\r\nWell said. So to put it easily, if you're the type who fancies superpowers and ability users, this would be a good anime for you to watch. Be sure to watch the first season though. And what is a harem anime without a couple of fanservice?? Yes we do have some to satisfy you fetish! For all you lolicon, Miko fetish, and Nun fetish! Not to mention a lot of tsunderes to go around (10,000+ to be exact) \\n\r\nAnd do not take the religion aspect of this story too seriously, in no way it is connected to reality. This is a fictional world. Otherwise, how else would they be able to acquire magic make up?? What? You didn't notice they were wearing magic make up?? Whenever Touma punches his enemies' face with his RIGHT FIST, their faces becomes slightly uglier thus their magic make up was dispelled by Touma's RIGHT FIST..\\n\\n\r\n\"I do not understand your jokes..\" says Misaka showing her confusion\\n\\n\r\nWell how about this? Touma lost his right arm when he was a kid so Chuck Norris gave him his right arm since Chuck Norris has the ability to regenerate any of his body part. Thus explains why Touma's RIGHT FIST is supremely incredible!\\n\\n\r\n\"Who is this Chucku Norrissu of which you speak?\" Misaka asked in further confusion.\\n\\n\r\nHaremu Kingu,\\n\r\nSigning off!",
            "date": "2011-01-29T22:05:00+00:00",
            "helpful_count": 605,
            "mal_id": 34123,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=34123"
        },
        {
            "content": "The second season of To Aru Majutsu no Index continues from where the first season left off. Based on the popular Light Novel series, the story takes place in Academy City: a City where 80% of the population are students trained to develop superhuman powers through scientific methods. These students are known as “Espers”. But outside this city exists a religious fraction that can use Magic to counter Esper abilities. This fraction strongly detests the Science side and the two sides have been plotting each others destruction. Kamijyo Touma, the protagonist of this story, possesses a right hand that will negate all magic and esperpowers (as well as his own luck) and has been dragged into their plots against each other. \\n\\n\r\nNow I'll be the first to admit that the To Aru Majutsu no Index series has been less than brilliant but I still found the first series enjoyable. Pretty much every arc would have roughly the same shell: Touma meets a nice girl who is a victim of a horrible plot. Touma then finds out about said horrible plot. Touma confronts the antagonist behind the plot. Said antagonist gives a typical “Good intention but wrong method” excuse before Touma gives an idealistic speech and punches him in the face. Rinse and repeat. Not that I didn't enjoy it the first few times but it does get old and fast. Even so, the first season did make up for it by filling up that shell with some creative stuff and I was still intrigued with the dark mystery behind the Magic and Science sides. I also fell in love with the comedy and the character interactions which were just priceless. \\n\\n\r\nAll of that is mostly done away with in this new instalment. Any creativity the previous arcs had is thrown out the window leaving behind that empty shell I've grown to hate, with the only difference being that Touma is now punching girls instead of guys. I think the biggest problem is with the exposition. For example in the second arc, they pretty much throw you into the deep end of plots between churches and a whole load of techno-babble and if you can't make sense out of it in the first five seconds, well then good luck because they won't dally around. The comedy is sorely lacking in creativity as well. Let me give you an example of how that contrasts with the first season. At the beginning of one arc in the first season, Touma (who has amnesia) stumbles upon a very oddly dressed little girl. Touma being Genre Savvy enough to realise that anyone who dresses that strangely is someone he must know, decides to greet the girl. Except the girl in question immediately considers Touma an enemy just for greeting her and holds him at knife point. It's not that he wasn't exactly wrong in his deduction. It's just that he's an incredibly unlucky guy. In this season that type of comedy was mostly replaced with an insufferable amount of Accidental Pervert moments only two of which had any sort of creativity to them. There were some funny moments here and there but nothing like the first season and without that comedy the series loses much of its charm. \\n\\n\r\nAnd now that you're left with that empty shell you have the opportunity of realising just how ridiculously irritating Touma can be with his annoying speeches. In one arc, I noticed that when Styl was taken down by the antagonist if you actually notice, the pool of blood coming from Styl gets slowly bigger and bigger whilst Touma spends some precious time preaching to the antagonist about how wrong she is. Not only that but one problem is that anyone who knows even a little about how to argue would know just how terrible his debating skills are. It mostly just consists of throwing a lot of general idealistic principles. And that's not even the worst thing about his speeches. No, the worst thing is that it's only ever so far been used to break down incredibly weak motives. This was particularly egregious when the second to last antagonist Touma faces gives what has to be the most retarded antagonist's motive I've ever heard, not just in the To Aru series but in anime generally. \\n\\n\r\nOh and don't count on Index to become more important in this series like I did. She doesn't. Oh she serves as a good plot device in certain key moments but that's about as far as it gets. She's far more important in the first season, even when I thought she was being shafted. I wonder why they even call it “Magical Index” anymore. \\n\\n\r\nThat said it's not all bad. The series picks up in the last quarter and that would be mostly due to the introduction of Accelerator as a more central figure. A much more interesting character that provides a more cynical route for all those already irritated with Touma. But even then the last quarter had its flaws so it's nowhere near enough for me to overlook the poor quality of a whole three-quarter of this season. The soundtrack is at least as brilliant as it's always been (something I think is largely underrated) with each piece always providing the perfect atmosphere. The animation though has become a lot more inconsistent this season. It's great in many places but in others I notice a lot of odd and jerky movements and the inconstancy has been a notable pain for me throughout the entire season. \\n\\n\r\nOverall it's only because I'm a fan of the series that I'm not giving it an even lower rating. But even though the second season was a bitter disappointment, I still look forward to the third season (which although hasn't been announced yet is still a forgone conclusion). I’ve been promised by several Light Novel readers that the story really does get much better after this. Pushing aside the obvious problem that it would have to take 48 episodes to finally pick up, if season three does reach my expectations then I will simply consider this season a part of the story that bridges the gap between season one and three. So in conclusion, if you’re a fan of this series and you’re willing to watch 24 episodes of mostly mediocre stuff, all for the sake of understanding season three when it finally picks up then go for it, but make sure to lower your expectations. If you’re not a fan and you’re not in the least bit curious about what happens (even though you’re reading a review of it) then don’t bother.",
            "date": "2011-04-04T05:53:00+00:00",
            "helpful_count": 141,
            "mal_id": 35661,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/310836.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Haak",
                "username": "Haak"
            },
            "url": "https://myanimelist.net/reviews.php?id=35661"
        },
        {
            "content": "\"I'll break this illusion, with my right fist!\"\r\nA Certain Magical Index should really be renamed, and I have the perfect title: A Certain Frustrating Show. I don't think I've ever actually been so frustrated with a show quite like this before, not because it's bad, but because it's good, and very enjoyable - but for some bizarre reason, the show never uses its latent potential to become something truly outstanding.\r\nLet me get one thing out of the way first: Index II is a significant step-up from the first series, the first episode was actually better than nearly every single moment of the original series (minusAccelerator's little mini-arc) and actually got me looking forward to a show that I thought would only be marginally better than its prequel, instead, what I got was a series that involves a lot of evil Roman Catholics who are more extreme than most actual religious extremists, a lot of idealistic speeches and a lot of women being punched in the face.\\n\\n\r\nAnother thing I should get out of the way, if you're an easily offended religious person (specifically, a Roman Catholic) or a fairly hardcore feminist who believes that all men are \"pigs\", then this probably isn't the show for you, seeing as, more than likely, you may be offended by the shows content at some point.\\n\\n\r\nHaving said that, I don't think the show is actually trying to be offensive, it's just unfortunate that certain aspects of the show - which I'll cover later on - can be misconstrued as either racist or misogynistic depending on your beliefs. If you're able to get past these issues, then there's a good chance that you may be able to enjoy the show despite its faults.\\n\\n\r\nNow that I've covered the obligatory \"If you're easily offended, don't watch it\" section, I should probably move onto the reason you're (probably) still reading this review, that is, the part in which I'm actually reviewing.\\n\\n\r\nIndex II continues to follow the misadventures of everyone's favorite unfortunate protagonist, Kamijou Touma, and his exploits as he tries to deal with the looming threat of the Roman Catholic Church, the Roman Catholic Church and...the Roman Catholic Church, because apparently, the Roman Catholic Church seems to have nothing better to do with their time than try to take over Academy City - occasionally they mix things up a bit by not going after Academy City itself, but generally speaking, the Roman Catholics serve as the main antagonists for the most part.\\n\\n\r\nThey also happen to make some pretty poor antagonists at that, usually guided by poor motivations and weak reasons which are broken down by Touma's equally weak idealistic speeches which serve as a constant reminder that, despite having his occasionally cool moments in Index (and to a much greater extent, Railgun): Kamijou Touma is an idealistic buffoon, whose only redeeming feature is that he happens to have one of the most overpowered abilities in the history of fiction.\\n\\n\r\nHowever, poor antagonists aside, the most infuriating aspect of Index II's story is its own inability to capitalise on the clear potential that it actually has here, I'm not joking when I say that the potential for a really outstanding story is absolutely huge here. The story has a lot of really good ideas that, frustratingly, are hardly ever capitalised on for the majority of the run time - we still for example, don't actually know what Imagine Breaker is, all we know is that Touma's only redeeming feature is able to negate any supernatural ability that is thrown at him - magical or otherwise. No explanation is given as to why it is he has this power, what its full potential actually is, or why it's capable of negating supernatural abilities in the first place - it becomes clear in one of the later arcs that there is clearly a lot more to Imagine Breaker than meets the eye, (although this statement is kind of redundant, seeing as it was obvious) but that's about it.\\n\\n\r\nIndex too doesn't seem to serve any more importance than she did last season, in fact, there are several people who have argued that she was actually more important in the first season, even though there are arcs in which she doesn't actually appear at all. The MAL synopsis for this show is actually very misleading; if there are any of you who think that Index will serve a greater role in Index II then think again, she won't, and you'll be left feeling very disappointed. She's still just as annoying as ever mind you, so there are some definite pro's to this particular con of the story.\\n\\n\r\nThere are plenty of other occasions when the story fails to capitalise on its potential too, for instance, why doesn't it introduce any other saints besides Kanzaki Kaori? Surely the Church of England has other magicians it can send besides Stiyl, right? Just what exactly are Aleister's plans? Are there any other interesting Espers besides Misaka and Accelerator? Who exactly are the other Level 5 Espers anyway? (although Railgun S has already partially answered that question for me) There are a lot of other questions that I'd really love to ask, because this show still hasn't answered them, although I'm fairly sure that when Index III comes out, (it's a question of when, not if) I'll be getting my answers - in fact, I'm starting to think that Index II decided to purposely dodge any questions I may have purely for the purpose of getting me excited for the inevitable third season - and if that was the case, it succeeded.\\n\\n\r\nAnother issue with the story is the woman punching, personally, I wasn't as bothered by this as some people may actually be, but I can certainly understand why it can be seen as an issue. Nearly every arc (with a few notable exceptions) revolves around Touma punching the antagonist - in this case, the main female villain of the arc - in the face, and potentially rearranging it whilst he's doing so; I'm fairly sure that Index II's intention wasn't actually to be misogynistic, in the same way I think it's just using the Roman Catholic Church because of the various pieces of Christian symbolism it can use rather than being racist about it.\\n\\n\r\nIt's not all bad though, the last two arcs are actually really good and really enjoyable, for a few notable reasons, one of which being that they actually serve to progress the story and in a very notable way. The final two arcs are huge indications that something really big is coming, and make a large change to the sometimes filler-like feel of certain arcs (the Daihaseisai arc feeling like it was just dragging on, especially towards the end). Another reason is that Accelerator ends up becoming the main character for a time, which is a nice change of pace when compared to Touma. Everyone's favorite psychopathic anti-hero with a heart serves as a much more interesting main protagonist (which is why his little arc in the original series was by far the best thing about it), not to mention, he gets the good villain too, with his main enemy serving as a much more interesting, well motivated antagonist in comparison to Touma's villains. \\n\\n\r\nAnother notable aspect of Index II's story is that this time, it doesn't bombard you with lots of terminology, which was a huge problem of the original series, instead, any new terminology is actually explained and, more importantly, serves as relevant information to the plot - even if in some cases, it's arc limited. This makes it much easier to sort out plot details in your head, but it never feels like it's just spoon-feeding you either, which is nice.\\n\\n\r\nThe final thing about the story is, that, well, it actually goes somewhere...eventually. The original series never went anywhere with its plot, despite hinting that it clearly could, and whilst it takes a while for Index II to go somewhere, when it does eventually move, there are significant leaps in progress in comparison to the original.\\n\\n\r\nAnimation is also better than the original series, attacks look cooler and pack more of a punch in terms of visual clarity, the series animates rather well and it's obvious that Index II is getting the best part of the budget that I didn't know J.C Staff actually had.\\n\\n\r\nIt's not perfect however, there are some times when the animation becomes quite choppy and inconsistent, with the occasional off-model appearing every now and again, as well as some static images appearing here and there too. These are minor gripes however, as for the most part, Index II is generally rather good to watch and look at, especially when characters are bringing out their most powerful spells or Esper ability.\\n\\n\r\nSimilar to the first series, the OST doesn't really have that many notable tracks to go with it, although there a couple of tracks worth mentioning, probably because the show likes to play them a lot - Kyuuketsu Koroshi is a nice track that brings an atmosphere that wouldn't be out of place in a good detective show, Gensou Koroshi is essentially Touma's illusion breaking theme song, Nichijou provides some amusement when it's covering the daily lives of the characters. It's not a bad mix of tracks, although there are definitely better OST's out there.\\n\\n\r\nOpening and ending themes fare similarly to the previous series, with the one notable exception being the second opening, See VisionS, which is the series best opening by a long stretch and, funnily enough, becomes the shows opening theme when the story actually decides to become interesting.\\n\\n\r\nVoice acting is pretty strong too, now that I actually understand why it is that the various Misaka's speak like they do, I now actually think that it was a pretty clever choice as opposed to an annoying inclusion that actually does makes a lot of sense in context. Despite his character, Atsushi Abe is actually very good as Touma, and there are often plenty of times that his performance is able to sell the character despite the stupidity of his speeches (were it not for the fact that what he's saying is rather stupid, Abe puts so much effort into the role that he's capable of fooling you into thinking that what he's saying is worth listening to). Rina Satou still delivers well on Misaka - I'm inclined to like her more now seeing as I actually liked Railgun. Satomi Arai is actually pretty funny whenever she screams \"Onee-Sama\" as Kuroko, Rina Hidaka is fairly adorable as Last Order now that I understand more about the character...the list goes on.\\n\\n\r\nThere are a few notable performances in the voice acting as well, although, for different reasons. Rie Kugimiya does her trademark squeal as Sister Agnese, whether this is a good thing or not is entirely up to you, I personally didn't mind it. My man Keiji Fujiwara is a great addition to the cast as Accelerator's villain, Kihara, bringing a sadistic, cynical performance that totally fits with an arc revolving around Accelerator. Yuka Iguchi is...well, she's Yuka Iguchi, I didn't like her in the original series and honestly, my opinion of her hasn't changed all that much either. \\n\\n\r\nOnce again though, the best actor in the show is by far Nobuhiko Okamoto as Accelerator, he's able to pull off every scream, every insult, every single psychopathic laugh with amazing sincerity, all whilst being able to bring emotional depth to a character who, for all intents and purposes, you should probably hate and would do whatever it takes to avoid if you saw him on the street. It's Okamoto's performance when Accelerator's not screaming that really sells it, his world weary voice and seemingly apathetic attitude showing that, underneath the psychopath, is a very lonely and unloved boy who's just trying to get by and find people that he can actually get along with - which is probably why he goes so far to help Last Order and why they play off each other really well.\\n\\n\r\nThe characters of Index are a group of people who you will share a mixed relationship with, on the one hand, there are characters who are actually rather good, Accelerator being the most obvious example followed by Misaka, as well as characters who you will probably really dislike. I'll make this clear now, if you didn't like Index in the first series, forget about liking her here, she hasn't changed, she's still annoying and the moments when she bites Touma are not funny. The show does actually have some cool characters like Stiyl and Tsuchimikado, but they're never usually on screen long enough for you to actually say \"Yeah, these guys are actually really good characters.\" and that's actually a recurring issue with a lot of the characters in Index, there are definitely some cool characters here, but that's all they are: cool. You won't see any characters of any noticeable depth unless they're either main characters, or you watched Railgun and got to see Misaka's life fleshed out more. It's that irritating issue of when a show has too many characters, and doesn't know what to do with them, so you're left with two-dimensional to one-dimensional characters.\\n\\n\r\nThen there are the antagonists, a completely mixed bag of characters who range from decent (i.e Kihara) to pretty lacklustre (i.e most of Touma's villains) - Biagio Busoni I should add, is a total waste of Emperor Wakamoto's voice, in fact, if it turns out that they end up going up against God in Index III, Wakamoto should play God, that would be an appropriate role for him (for God I mean, 'cause he doesn't even come close to Emperor Wakamoto after all). \\n\\n\r\nThe most polarising character however, is Kamijou Touma himself. The main problem with Touma is that, well, he's a buffoon, an idealistic one at that, spouting out his ideals whenever his altruism gets him caught up in the final fight of the arc. Although, there is something there that doesn't make me totally dislike him - and I'm not just referring to his ability either. Kamijou Touma is a genuinely nice guy who goes to great lengths to ensure that everyone, be they friend or enemy regardless, turns out better for it, his altruism truly knows no bounds. Whilst I can't necessarily vouch for his brilliance as a character, he certainly does have some admirable traits about him, and if someone bothered to fix his idealistic speeches and terrible debating skills, I'd probably be saying I like the guy.\\n\\n\r\nWith all this being said though, Index II is an immensely enjoyable show. I managed to get through it in two days and I'm really looking forward to Index III (from what I know, the light novels are supposed to get really good once all the filler style stuff is out of the way), and flaws aside, when Index II is going at full swing, it's actually a hard show to fault - despite its issues, Index II has a considerably high entertainment factor. The comedy is actually legitimately funny and gets past cheap gags that were never really funny to begin with such as Index biting Touma, the action sequences are very good and are great to watch, and similar to the last season, the arc like structure allows you to pretty much watch the show at your leisure without feeling too bad about not watching for a bit. There's a lot going for Index II.\\n\\n\r\nI should also point out that, Index II is not a bad show, it's actually a good show - and it's fantastic in comparison to the first season. It's just a shame that, despite all its pros in comparison to the first series, its many cons, such as the frustrating inability to actually capitalise and fully exploit the good ideas that it actually has, prevent it from being truly outstanding, which is a really frustrating issue indeed. I'll just hope for now that, when Index III is confirmed, I'll finally be able to enjoy To Aru Majutsu no Index at its best and that I'll finally be able to say \"It's totally worth watching the first two seasons for.\"\\n\\n\r\nUntil that point however, it really will just be A Certain Frustrating Show.\\n",
            "date": "2013-06-30T08:50:00+00:00",
            "helpful_count": 106,
            "mal_id": 103127,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/276749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Masserati_",
                "username": "Masserati_"
            },
            "url": "https://myanimelist.net/reviews.php?id=103127"
        },
        {
            "content": "Return to the world of Science and Magic with Touma & Index.\r\nAfter the slightly successful, often enjoyable first series, J.C Staff fires off with the continuation of Touma's dilemma within Academy City.\r\nStory: 8/10 - The story that made the first series popular returns in its sequel. Here, the story kicks off with Touma attempting to finish his summer homework before the next day. Those who despised the slow pacing of its predecessor can rest easy - the series so far does a decent job of getting right into the action while reintroducing the familiar cast at the same time.\r\nArt: 10/10 - I always loved Toaru'sartstyle. But here, the character designs are more polished and proper, mixed with more than a fair share of loveable and humorous expressions.\\n\\n\r\nSound: 9/10 - Mami Kawada returns with her new single \"No Buts!\" as the opening. The song is very catchy and upbeat; a perfect blend of Techno and Pop.  Maiko Iuchi of \"I've Sound\" is once again in charge of the series musical score, and DAMN, the music this time around is awesome and fitting at the same time. The ending theme \"Magic∞World\" by Maon Kurosaki is pretty cool too.\\n\\n\r\nCharacter: 10/10 - The series has always been filled with loveable, colorful characters, and here is no different. New characters, bigger character development - what else can I say?!\\n\\n\r\nEnjoyment: 8/10 - Despite the amusing, interesting (and at times, absolutely hilarious) interactions between characters, it still struggles with the long and boring speeches on magic (seriously!). However, the fight scenes and special effects are better than before.\\n\\n\r\nIt's obvious that J.C Staff invested a much, MUCH bigger budget on animation and special effects this time around. With a start-up more enjoyable than the first, and the Academy Sports Festival coming up, I rate this series 9/10... for now. \\n\\n\r\nWhy are you still reading?! Go watch some Index!!!!",
            "date": "2010-11-05T18:00:00+00:00",
            "helpful_count": 66,
            "mal_id": 31845,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KentaMaeba",
                "username": "KentaMaeba"
            },
            "url": "https://myanimelist.net/reviews.php?id=31845"
        },
        {
            "content": "Some people hate sequels, saying it will never be as good as the original. Some people love them more, saying that they're just glad that there's more. I try to stay at a neutral stance, but I admit that I was still looking forward for this second season of Index (third if you count Railgun). I liked the first season; it had good characters and good story arcs. Railgun was a nice change to Index. How can putting the two together be bad? I had high hopes. Had. I don't know, but somehow, it happened. I mean, it was really really bad.\r\nThe story. What canI say? I just didn't really like them. Most of it has to do with the characters, which I will elaborate later on. The story arcs didn't lead to anything big in the end. There was no big climax or anything; they just left an ambiguous ending, sequelbating. The arcs seemed to be half religion half science. I would be okay with that if the two were actually mixed together but they were kept apart. It was more like it was half Index and half Railgun. At the end of each episode, they say that when magic and science cross, the story begins. That's the problem; they never crossed. Characters from their respective shows didn't really mix with the other either, and that was kind of disappointing. One of my biggest qualms with this show is how each arc ended. Some of the most unoriginal endings ever written. I can break it down. 1. Touma is the last man standing 2. He gives some terrible speech about care and love and other unimportant stuff and 3. He punches a woman in the face. How anti-climactic is that? You'd expect an epic ending with something magic or science related used against the enemy, but all you get is a punch in the face.\\n\\n\r\nThe characters. They have changed so much, and not in a good way. Touma seems even more self-righteous than usual. Index seems even more useless than usual too. She was very annoying, one of the most annoying characters in the series. You know, I didn't laugh the first time she bit Touma on the head, so why would I find the 46th time funny? Why are all the characters pandering to the fans? Who thought this was a good idea. I don't want to see every single female character wanting Touma little head (except for Index who wants his bigger one on his shoulders). They turned so many of them into tsunderes when they clearly weren't that in the previous season. Why? One is enough (well, one is too much, actually). Mixed in with these terrible story arcs, I've grown to hate these characters that I used to like. Oh, and there's fanservice. Some of the stupidest fanservice I have ever seen. In many shows, you have the panty shot, which is understandable because the camera just happened to be at an angle to see it, but it index, the characters strip down for you! Terrible.\\n\\n\\n\r\nThe art is very generic. The animation is average, I guess. Pretty much the same as the first season and Railgun, so I don't really have complaints about it. The music was really boring. It's some very generic music. I didn't really like the OPs and EDs either, but the first OP was alright. There seems to have been very poor artistic direction. Any art is just drained to almost nothing, and art is something that I crave. Oh well.\\n\\n\r\nOverall, I pulled nearly no enjoyment from this show at all. I absolutely hated the characters and story arcs. Very little logic was used, like that grenade in one of the later episodes that exploded in a small room and did barely any damage to the room and not even injuring anyone in the room. Logic was not on the menu for this show. J.C. Staff took something I really enjoyed and turned it into this ugly, disfigured beast that I found nauseating. I really hope they stop there and stop ruining it further. I can't say I have high hopes for that.\\n\\n\r\nThen again, I'm pessimistic.",
            "date": "2011-04-01T23:19:00+00:00",
            "helpful_count": 51,
            "mal_id": 35569,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Psychotik",
                "username": "Psychotik"
            },
            "url": "https://myanimelist.net/reviews.php?id=35569"
        },
        {
            "content": "Story - 6\r\nAfter watching the first season I hoped that the plot would finally unfold in to something bigger and better then the first season. Well it didn't!\r\nFor the most part it was worse and only close to the end got better. The problem with the story is that it isn't directional and is repetitive. It's because some villain shows up from the religion side (usually) and wants to do something bad. And then Touma comes to the rescue. And this happens like every time through out the season. Seriously the villains seem to change like every 3-5 episodes and only thing that they havein common is that Touma fights them with his right arm and wins. \\n\\n\r\nOnly at the end the story starts to do something about Magic vs. Science thing, but that isn't enough to draw your interest or provoke any real thoughts. Well the thought that this story provoked to me was that religion is crazy.\\n\\n\r\nVisuals - 9\\n\\n\r\nMaybe a bit too much flashy some times, but for like 98% of the time it is just great. Everything is crisp and clear and the characters all drawn well. Fights are all the time animated well also. I really have no more to say, because the art is great and nothing more.\\n\\n\r\nSound - 8\\n\\n\r\nBetter openings then the first season. The first OP was the greatest. As for the background music it kinda always fits well with what is happening, but never really increases your watching experience. It kinda is there doing it's job and nothing more so for the most part you will rarely notice it. In a way it is good, but it could bring out the overall experience watching to whole new level if somebody really wanted to.\\n\\n\r\nCharacters - 7\\n\\n\r\nI don't know why but for some reason Touma is the one character who I care less then the other secondary character like Misaka or Accelerator. Touma is just a plain normal hero-type. He is such a stereotype to the rescue that I want to punch him for being so cliche and uncool.\\n\r\nMost of the support cast is just some kind of fetish whatever and hareming all over Touma. It's just so stupid.\\n\\n\r\nOff course there are some likeable characters and Touma is in some way too. But do you really care for them? No, not really, except Accelerator and a little bit Misaka and the Misakas last younger clone called Last Order. If it would be my choice then Touma would not be main character, but Accelerator or Misaka would, because they are so much more more interesting and 3 dimensional.\\n\\n\r\nEnjoyment - 8\\n\\n\r\nAs for enjoyment I liked the comedy and the fights. As for everything else I can't that I enjoyed it a lot. Only for some moments, maybe. Also I would of really wanted so that this anime would provoke me to think about something.\\n\\n\r\nOverall - 8 (was very close to 7)\\n\\n\r\nToaru Majutsu No Index season 2 was a great as for the technical aspects like visuals and music, but when it comes to story and characters it lets you down quite a lot. If you have seen the first season then I can say to you that the second one was a bit better, but only by a small margin call. \\n\\n\r\nSeason 2 definitely isn't a must watch, but it is better then most of the animes out there. And if you liked first season a lot or you have none must watch series then go ahead and watch it. Just be careful, because the story really goes nowhere.\\n",
            "date": "2011-08-31T12:45:00+00:00",
            "helpful_count": 21,
            "mal_id": 42481,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/reinis-jan",
                "username": "reinis-jan"
            },
            "url": "https://myanimelist.net/reviews.php?id=42481"
        },
        {
            "content": "To be honest, after the first season, I had pretty low expectations for this second installment of Magical Index, but since I'm not one to judge something by it's cover, I went and watched it all. My short opinion: Pleasant surprise. Way better than the first season in every way, but has many problems still.\r\nThe first season of A Certain Magical Index was, frankly, a confusing mess. (See my review on the first season's page.)  Despite the unique and extremely intriguing setting, the story was jumping around like a wild firehose at full pressure, aimless and even major plot points went woefully unexplained whilethe characters were constantly spewing exposition over minute details. The characters themselves were but hollow shells with a bunch of conflicting tropes tacked on, only serving as plot devices. All that changed in the second season, and for the better.\\n\\n\r\nFor one thing, the characters now have clear motivations, something they lacked in the first installment. Toma, the main protagonist, is sadly still just a handle to drag the story forward, but at least he has some clear goals and motivations now. It's awfully cliché'd and hollow, but it's there. Basically, he wants to \"save everyone\" because he is a \"good guy\". His power is still totally unexplained and serves as a mere plot device (punch bad guy du jour in face = problem solved). Index didn't change much either, she is still suffering from the \"everything at once\" disorder, being the secret magical plot device, the tsundere and the comic relief moe all-in-one. The cute/whiny idioms, the biting and the forever-hungry gimmick is still there, and I know these are intended to be endearing, but it only comes off as annoying. However, there are new developments at the support character front. The introduction of the Sisters (Misaka and the nuns too), especially 20001 (Misaka-Misaka), Orsola Aquinas and gang, Kazakiri, the researchers, and a swath of new faces is really great, and brings some life into the series. Even the antagonists at least have some motivations other than \"I'm evil because I'm evil\", well, most of them anyway. It still seems to fall into one of two kinds, \"I'm following orders\" and \"I'm taking revenge because of reasons\". It's still an improvement.\\n\\n\r\nThe biggest improvement is definitely the story arc. Meaning, there is actually a story arc now, instead of random episodes with basically no connection. The series even goes as far as picking up loose ends from the first season and tying them into the story. By the end of the second season I just about started to feel like I'm watching a real anime with a story and good characters. Also, the second season is chock-full of fan service, some pretty weird ecchi scenes and finally some good humor. A special mention to Episode 17, which was genuinely enjoyable.\\n\\n\r\nA major shout-out to the only character, who received a character and a story arc: Accelerator. He is the ONLY ONE who went through any kind of change and was actually very well written as a sort of Faust character, and the only one who got his backstory and motivations detailed, at least somewhat. Not even the main protagonist received that kind of treatment, which is sort of puzzling. He is a kind of tragic hero, who now strives to right at least some of the wrongs he done. I especially like his involvement with 20001, and I really wanted to see more of his story. My only problem with him is his extremely annoying angsty, emo kid act. I can understand the borderline insanity and the conflicted morals and self-hate, but that's just a bit too much.\\n\\n\r\nAll in all, Index II is a definite improvement over the first season in most every way. It's not THAT great, but at least I could go through it all without cringing or scratching my head much, which is good.",
            "date": "2014-09-29T07:55:00+00:00",
            "helpful_count": 18,
            "mal_id": 162887,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4129013.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Playbahnosh",
                "username": "Playbahnosh"
            },
            "url": "https://myanimelist.net/reviews.php?id=162887"
        },
        {
            "content": "Writing a standalone review for an anime that is a sequel to another anime without referring to the predecessor is quite hard, what with all the comparing you need to do between the two shows. What was better? What went worse? Which season is the best one? Why? Questions like these will be brought up and thus, I am going to mention Index 1 in this review as well, but not to a far extent. However, I believe that shouldn't be a problem, since (I assume) you've probably watched season 1 already, which is why you're currently reading a review to its sequel.\r\nIn my reviewfor Index 1, I compared the show to a dinner consisting of grilled meat with various side dishes. I'm going to do the same with Index 2, so without further ado, let us move on.\\n\\n\r\nSo here we are again. You're sitting in the very same restaurant as last time, with the very same chef cooking you the very same meal. After he or she apologized for their mistakes regarding your last dinner here, you have agreed on giving them a new chance. Before long, the same plate is present at your table. There are the tender potatoes, the fresh vegetables and the tasty wine at the side. Then, there is the beef. Again, it at least looks and smells delicious, but you've learned to be skeptical when it comes to the food here by now. Nevertheless, it's time to see if the mistakes of the past have yielded the poor chef any experience.\\n\\n\r\nWhile still, very unfortunately, carrying with it some problems from the past, Toaru Majutsu no Index II is at least undoubtedly a better show than its predecessor. However, it is not so by too long a shot. Some (severe) issues regarding the consistency and description of the plot have been resolved, but they're not completely wiped out. Index 2 handles it's main story far better than the first season, with arcs being much more vowen into each other and characters not being forgotten. Also, there is actually some interaction between the parties of science and magic this time around. Nevertheless, the show still loses some potential with recurring faults. While the problems aren't big, they're many.\\n\\n\r\nThe meat is, for starters, edible this time around. It tastes nothing exceptional, but at least you know you can leave behind you an empty plate this evening. When taking the meal for what it is, the dinner is actually fairly enjoyable.\\n\\n\\n\r\nSTORY: 5\\n\r\nA score of 5 is a vast improvement over 2, which is what I rated the story of Index 1. The main improvement here is the consistency of events that unfold and the amount of depth given to each of them. The connection between happenings isn't always clear, but at least it's there. Characters (especially important ones) who are introduced are not forgotten anymore, which also adds to the fleshing out of them. All that being said, while 5 certainly is higher than 2, it's still far away from the higher scores. Agaian, Index 2 handles a lot of issues from the first season in a good way, but very few of these issues go completely solved. The story, while good, is far from as solid as it should be. Details of importance are still lost in the great void of bad storytelling, and sometimes events and happenings are downright mind-numbingly confusing as they seem to happen without you clearly knowing why. This goes for the last one or two arcs especially, where so much goes down while so little is clear.\\n\\n\r\nIndex 2 still divides the entire story into several different arcs, and it does so in a (much) better fashion than its predecessor. The arcs are consistent - they are connected. Next to all of them are interesting this time (some moments are even bloody awesome) and it feels like everything is adding to the core of the anime. However (forgive the repetitiveness by this point), some stories could have been told better. Thinking about it, this has been the true main problem up to this point for the entire time. While stumbling over its own feet, Index 2 loses details, sometimes crucial information, which are nothing short of needed for the viewer to fully understand what is going on. In the end though, Index as a series at least seems to be on its way towards the right track with many improvements having been made to it. It's far from perfect, but a show is (almost) always more enjoyable if stuff actually makes sense.\\n\\n\\n\r\nART: 8\\n\r\nNext to identical when compared to Index 1. Index 2 uses the same tone, same colors, same shading and so on. Note though that this isn't a bad thing. Far from it. I enjoyed the simple yet charming art-style of Index 1 a lot, and it being reused for Index 2 was nothing more than a welcome course of action. Nothing is too extremely detailed or well-drawn, but the skillful usage of simple colors to breathe life into the show is respectable and appreciated.\\n\\n\\n\r\nSOUND: 7\\n\r\nNothing stands out, but at the same time, nothing is bad. Very similar to Index 1 again, Index 2 hits the nail on its head while trying to set the mood right for specific events. Sound effects, just like the music, sound like they should - nothing exceptional yet nothing wrong.\\n\\n\r\nThe two things I do need to emphasize this time around are both openings respectively. They are, simply put, breathtaking. Even one who knows of Index's flaws regains hope and is deceived into thinking that everything surrounding the show is epic when they hear and see the colossi that the openings are. Maybe it's just me, but I'm serious. They are that good. The endings have also improved this time around, and are quite solid when used in the show.\\n\\n\\n\r\nCHARACTERS: 7\\n\r\nConsidering the fact that the score of the characters category here is identical to the one of my Index 1 review, it may seem odd seeing that characters actually got more time develop in Index 2. Yes, characters are consistent and ever-present in the second season, but while being so, they are still the ones you know from season 1. Touma has more time to be simply Touma, Misaka is the same girl who only gets a spoonful added to her person, and so forth. While characters are frequently presented in Index 2, they use their extra time to just present more of who they usually are anyway. The one character who actually progressed in his development was Accelerator, and that was one of the best things with the entire anime. Finally, as was the case with Index 1, side characters can sometimes carry too little importance for them to actually matter to the audience, and once they've had their handful of moments of importance or comic relief, they are quickly shunned away.\\n\\n\\n\r\nENJOYMENT: 5\\n\r\nYou like what you see, but you dislike what you know is bad simply because the storytelling varies from bad to abysmal. While being a step up from what Index 1 was, Index 2 is still plagued with the same faults, albeit at a smaller scale than its predecessor. The improved consistency of season 2 makes the show much easier to enjoy than season 1, however, and when the show manages to present what it has to tell in a decent way, the result is actually pretty impressive.\\n\\n\\n\r\nOVERALL: 6\\n\r\nIndex 2 is an improvement over Index 1, yes, but it is still a shame that so much gets lost because of bad storytelling. The main draw in the disappointment in both season 1 and 2 is that you can actually see the mighty impressive world created in the universe of Toaru Majutsu no Index. You know that everything needed for a fantastic experience is right there. However, when the ingredients are treated in the wrong way, what had the potential to be phenomenal becomes a saddening, dull mass of grey matter that you simply want to throw away. While Index 2 doesn't go that far, the show is still a crystal clear example of lost potential.\\n\\n\r\nThe meal is finished. In the end, it was fine, nothing more than that. Similar to a story that is treated in a bad way, you know that the faults don't lie within the food itself, but rather in the one who made it. If Index 2 is the ingredients which eventually turned out as the beef you just ate, the bad storytelling of the creator(s) is the chef in this case. Just like the chef had every chance in the world to turn the ingredients into something wonderful but failed, the creators of Toaru Majutsu no Index didn't manage to turn what they had into the sensation it very well could have become.\\n\\n\r\nWhen it all comes down to it, much like the food presented to you, Toaru Majutsu no Index is only fair at best because someone else messed it up. If a third season is ever released, I hope it's treated with the respect and care it genuinely deserves. A show that has all the potential in the world to grow up and become something grand but is never given the opportunity to do so is simply everyone's loss.",
            "date": "2012-02-16T16:38:00+00:00",
            "helpful_count": 13,
            "mal_id": 54031,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/443061.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tenos",
                "username": "Tenos"
            },
            "url": "https://myanimelist.net/reviews.php?id=54031"
        },
        {
            "content": "Toaru Majutsu no Index II is the sequel to the first season of Toaru Majutsu Series....I had high expectations for the sequel as someone who enjoyed the first season. But somewhere along the way i got a little disappointed. This review will tell you guys why. So let's get started shall we?\r\nStory (8/10): The story was just like how the first season went..it jumps from Arc-Arc-Arc....with different characters taking the spotlight. Well somehow the story got a little boring as it progresses. It's the same Fighting scene again and again and with Touma's fist always landing on their face's it got boring watching the samething again and again but overall it was good.\\n\\n\r\nArt (8/10): The Art is decent. Not much i can say about it. The fighting scenes are good,The Scenery,The Background are all good but maybe the key to which makes the art good is that the Art fits with the Story well. Serious,Happy or even Comedy moments were fitting with the athmosphere really well.\\n\\n\r\nSound (9/10): The Sound & Music on this one was great! It fits with the story too. Especially the OP & ED Songs. The fighting scene's theme song was my favourite. It just thrills your excitement when you are hearing the music along with the action which makes this anime's Songs Special.\\n\\n\r\nCharacter (8/10): While there were new character's thrown into the story.The Main Character's themselve's hasn't changed, well not in a bad way but they could have made the\\n\r\ncharacter development better. But with that said i find the character's really enjoyable and never found it boring at all.\\n\\n\r\nEnjoyment (8/10): This Anime was enjoyable but was also lame at times that i almost dropped it. The Thing that got me\\n\r\nunsatisfied with it is because of the \"Common\" Thing that happenes as the story progresses. Like the cliche \"Index Bite\\n\r\nat Touma's Head\" or \"Touma's I'll Beat that Illusion of Yours\"\\n\r\nIt was repeating again and again i almost fell asleep while watching the anime. But overall good Enjoyment.\\n\\n\r\nOverall (8/10): This Review is finally coming to a close. And overall the Anime was decent and sometimes it was also \"Special\" but that's it nothing more nothing less just decent Portrayal of Action and Comedy.\\n\\n\r\nWell Guys this is the end of my review...sorry if i'm still crappy at this but this is my 3rd review in MAL so please give suggestions and advices on how to make my review's better :) i'll appreciate it. #Da_Harem_King Signing Off",
            "date": "2014-10-16T19:28:00+00:00",
            "helpful_count": 12,
            "mal_id": 165053,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674457.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IMeinRuby",
                "username": "IMeinRuby"
            },
            "url": "https://myanimelist.net/reviews.php?id=165053"
        },
        {
            "content": "A Certain Magical Index 2 in a nutshell:\r\nFanservice villians vs touma's right fist\r\nStory (8/10)\r\nThe story continues as powerful religious organizations want to take a hold of Index to take one of the 103,000 books inside her.  \r\nWhat I hated most about the previous season is the rush of plot and throwing in 6 arcs. In this season, they shoved down another 6 arcs in 1 season. However, this time, the plot was somewhat easy to follow. These 6 arcs are called \"Orsola  Aquinas Rescue\", \"Tree Diagram Remnant\", \"Daihaisei Festival\", \"The Queen of the Adriatic Sea\", \"Academy City Invasion\", and \"Skill-out Uprising\". \r\nThe plotwas somewhat easy to follow because unlike Season 1, the plot doesn't jump around randomly every arc. They're all connected together. Also, the arcs are not all about Touma. It also focused on Accelerator, Misaka, and Shirai.\\n\\n\\n\\n\r\nArt/Animation (9/10)\\n\r\nThe Animation is a big improvement from the 1st season. The environment and character design looks more beautiful. Still a bit choppy here and there but they're not that significant.\\n\\n\\n\\n\r\nSoundtrack (8/10)\\n\r\nThe soundtrack is the same as the one I've heard in \"A Certain Scientific Railgun\". I love the soundtrack from Railgun so I also love it here. I don't think I've heard any exclusive soundtrack. Anyways, OP1 and ED1 was complete trash. By the time I was at episode 5, I started skipping the opening soundtrack because I couldn't handle it. On the other hand, OP2 and ED 2 was a big improvement.\\n\\n\\n\\n\r\nCharacter (8/10)\\n\r\nAll of the characters from the first Index are here with some new characters being introduced. Most of them are antagonists and some of them are characters that are added in Touma's harem. What I didn't like about the antagonists and some few new supporting characters are their appearance. I mean what the hell is up with their boob sizes? I couldn't really take them seriously. The only new characters I liked are the sisters of the Roman Orthodox Church. Some characters from Railgun also made an appearance here like Uiharu.\\n\\n\\n\\n\r\nEnjoyment (7/10)\\n\r\nI only enjoyed the 1st, 2nd, 4th and 5th arc. The remaining arcs are just either too stupid, full of fanservice, or just a filler. \\n\\n\\n\\n\r\nOverall (8/10)\\n\r\nOverall, the anime is an improvement from the 1st season but it still has a lot of flaws. At least, they learned to not throw a bunch of information at you in 1 minute and expect you to understand everything. Some people say Index 2 is better than both Railgun and Railgun S. I have to disagree with that. Index's biggest flaw is they rush the arc and the plot. In Railgun, they focus on 2 arcs only and it actually takes time for the story to develop.\\n\\n\\n\\n\\n\r\nPros:\\n\r\n-Story was an improvement from the 1st Season\\n\r\n-They learned from some of their mistakes from the 1st Season\\n\r\n-Better Animation\\n\r\n-Soundtrack slightly improved\\n\r\n-Characters from the 1st season is still likable\\n\r\n-Few funny moments\\n\\n\\n\r\nCons:\\n\r\n-Plot is still slightly rushed\\n\r\n-They still throw in 6 arcs instead of just focusing on 2-3.\\n\r\n-Antagonists and some new supporting characters are full of fanservice\\n\r\n-Protagonist can sometimes be frustrating\\n",
            "date": "2015-06-22T10:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 190928,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=190928"
        },
        {
            "content": "~ In a place where Science and Magic are at equilibrium ~\r\n(TL;DR Version: Bottom Paragraph)\r\nIn many ways the \"Index\" story/perspective bit off more than it could chew, and so while To Aru Majutsu No Index II is an IMPROVEMENT to the initial season in many ways, and regardless: a thrilling journey overall...  IT'S LIMITING AND COULD HAVE BEEN SO MUCH MORE...\r\nAs a continuation of the Toaru \"Index\" story, Toaru Majutsu no Index II is the sequel to begin work on bringing the comparatively chaotic and rushed first season (particularly past episode 10, as you can read up in my Toaru Majutsu no Index review)to a satisfying conclusion.  \"Index II\" as I will abbreviate this sequel season from now on set about rectifying LOTS of the prominent issues that arose during the previous 24-episode season; and to an extent this worked at increasing the overall vividness and development of the stories. For Index II to have accomplished this, it has evidently worked to subdue the fast-pacing issues combating depth in the prior season, and begin to take more time to explain the intricacies of the characters and plot. At least until the end drew near.\\n\\n\r\nContrasting with the \"Railgun\" story/perspective, even after the so-called culmination of the \"Index\" story shown here, it was still frustratingly left with a number of open ends. This is likely the result of the copious amount of arcs that were thrown in prior, and so whereas the \"Railgun\" story was given more time to develop consistently and conclude strongly; \"Index II\" proved unable to finish what it had begun. I therefore say that it was destined to fail at achieving its full potential from the start...\\n\\n\r\nAdvancements...\\n\r\nThe eventful life of Touma and Index in Academy City, plagued by the large scale conflict between science and magic of which they are both apart, is directly continued into Index II. Context continues to be integrated into the story through various revelations and realizations associated with a wide range of characters throughout. Arcs therefore tend to become clearer as the show is given time to progress.\\n\\n\r\nThe evolution of the prior season into Index II is similar to that of \"Toaru Kagaku no Railgun\" into \"Toaru Kagaku no Railgun S\": It feels more passionate and gripping. Primarily this is because Index II shows a fortunate change of technical investments. Most significantly, Index II is the sequel to ditch the \"content cramming\" of the first season, as i remember quoting in the corresponding review. Index II puts an end to abrupt endings and transitions, besides the odd unannounced classroom filler episode here and there. This means that each story seems more wholesome and more importantly: relevant to a greater plot. \\n\\n\r\nInstead of throwing up new enemies here and there like in the previous season to emphasize a sense of time and scale, Index II makes the wiser choice of favoring content quality over quantity. It showcases a more more considered approach which brings the motivations and personal complexities of each character, be it a friend or foe: to life. The relentless action across the entire Toaru franchise gives the whole thing an obvious cinematic \"kick\", as Index II continues to uphold this intensity. In addition, it brings about more unpredictability and in turn tension during the countless battles, just by leveling out the characters' abilities. This somewhat suppresses the formulaic and therefore flawed nature of Touma's typical path to victory, but the real development here is the introduction of the above mentioned \"considered approach\".\\n\\n\r\nIt adds to the cinematic and action-filled events of the \"Index\" story by factoring in more character motivations, and backstories. It brings about a more personal \"kick\" by lessening the distance between the viewer and the far-fetched characters by means of linking the two through better elaborated upon plights. It's an overused term, but this serves to deepen/bring some weight to an otherwise spontaneous set of leaps from bad-guy to bad-guy as were shown during the previous season.\\n\\n\r\nI have no doubt here that Index II made the right choice in allowing more time to cover material brought up too quickly prior, instead of filling up excessively on content scale, though it's far from minimal. One of my favourite examples of character development here is that of Accelerator, who similarly to Touma is given a very intimate form of documentation which incorporates a very personal-feeling viewpoint via integration of inner-thoughts and motivations. He is an example of how Index II builds up from what the previous season started... and I so really enjoyed the result of this continued exploration and explanations; on top of the more surprising and suspenseful battles which when combined give Index II a greater sense of substance, and allow for viewers to become more intrigued.\\n\\n\r\nOther characters: Agnese and even Shirai for example receive some light during Index II as well; which helps towards clarity. More importantly though is the way that instead of discarding old information and development by introducing something completely different afterwards: as was often shown in the previous season... Index II is much better at integrating elements of the \"Index\" story together though greater transitional consideration. It actually develops and builds much better in a more cohesive fashion; and so with such an improved approach compared to the prior season, why is it only \"1 mark\" higher?\\n\\n\r\nDownsides... Involving the \"Index\" story as a whole\\n\r\nWhen Index II rectified a lot of issues as mentioned above, it subsequently revealed a lot of loose ends particularly towards the conclusion, which drag down the very high level of presentation value.\\n\\n\r\nMost significantly, the ending: an underwhelming, inconclusive and ambiguous finish which hints at a direct conclusion that's likely to never come about: the \"Railgun\" story being a side/alternative/child plot line as opposed to a continuation for those unaware. The ending didn't show a good culmination or conclusion to the war we were first introduced to on episode one of the previous season, as it's almost like it never happened. The \"Index\" story talks a lot about a clash of science and magic, but they're always treated as separated elements. When your penultimate episode is called \"Before the war\" in spite of the fact that it was supposed to be coming to some sort of conclusion or conclusive message... goes to show that clearing up the errors of the previous season was too big-a-task for Index II on top of finishing properly what it had begun. It was unable to finish what it had set out to do.\\n\\n\r\nComing to a close...\\n\r\nIndex II is so much better when compared to the first \"Index\" story season...\\n\\n\r\nAnd so i agree with the many critics out there who rightfully point out that the story as a whole, FRUSTRATINGLY leaves too much unexplained to come to a satisfying closure. Had it been given more time in a direct continuation, it might have hoped to achieve its potential, as the context and premise (mentioned in my previous season review) brings about such an interesting setup. The religious war theme works really well, but is simply not expressed near fully at all.\\n\\n\r\nTL;DR\\n\r\n+ GREATLY Improved character development\\n\r\n+ GREATLY Improved cohesion of arcs\\n\r\n+ GREATLY Improved pacing until near the end\\n\r\n+ Improved tension and unpredictability in battle\\n\r\n+ Maintained decent audiovisuals\\n\\n\r\n- Still formulaic by nature\\n\r\n- Underwhelming conclusion\\n\r\n- Lots left unexplained\\n\r\n- I waited for some more of Index here as a character, but she remains very underdeveloped\\n\\n\r\n~ Power is striven for to tilt the scales... ~",
            "date": "2015-05-26T15:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 188885,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=188885"
        },
        {
            "content": "Great story, good battles, but the absolute most annoying characters in history. Index and Mini-Misaka 20001 makes me want to pound my face into my table. They just won't shut the fuck up. Excessive talking during battles while people are dying right behind that person. Sometimes I wonder how they even make it out of there.\r\nOnly going to give a longer review, solely for the battles and animation. You're thrown into a world where human beings have insane amounts of power. Naturally being humans we want to know who is more powerful, and again as humans we perpetually try to surpass that power. This animeshows power isn't everything. It also shows what it would look like to give an animator knowledge of plasma.",
            "date": "2014-08-17T03:54:00+00:00",
            "helpful_count": 9,
            "mal_id": 156865,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3472357.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/limbones",
                "username": "limbones"
            },
            "url": "https://myanimelist.net/reviews.php?id=156865"
        },
        {
            "content": "This review would include season one and season two.\r\n[7]Story:  The plot in ToAru is fairly good, but generic, a boy protecting his city and the people that he loves.  There is no uniqueness in that.  That being said, there is no plot development whatsoever, just the same guy doing the same things with different villains.  On the upside, all the action scenes are fun to watch and usually keeps you on the edge of your seat.\r\n[10]Art:  Outstanding animation, and the supernatural powers in ToAru are pretty unique and fun to watch.  Background scenery is exceptional.  Characters were eye-appealing.\r\n[9]Sound:As for sound, it was very well done.  Using Mami Kawada would be pretty fitting if the anime revolved around the female lead though.  Voice actors, just simply amazing.  I particularly think the female lead's voice is somewhat annoying.\\n\\n\r\n[4]Character:  The character development in ToAru is terrible.  You learn nothing about the main characters' pasts and the interaction between them is pointless.  Characters come and go, except for the male lead and a couple others.  I'd say there are far too many characters as well that are introduced.  The main female lead, Index,  is very annoying as well.  She's childish, uncute, and is only there so guys don't get bored of constantly looking at Touma.  In the first season, she was introduced as a very important character and helped Touma through everything.  Despite having her name in the actual title of the anime itself, she plays an unimportant role in the second season.  This anime would have been a lot better if Index and her powers were further revealed.  Touma also has a annoying and stupid thing he says constantly, and Index keeps being a little b@#$% and complains to him and then bites him on the head.\\n\\n\r\n[9]Enjoyment:  Despite the flaws in ToAru, this anime was actually very enjoyable for me and I couldn't wait for each episode to come out.  But, this has no re-watch value whatsoever to me.\\n\\n\r\n[7]Overall:  With ToAru, I thought it was a fairly decent anime despite the flaws.  If you like good action with a cool male lead, then this is your anime.  If you're more into detail and characters, I wouldn't recommend this to you.",
            "date": "2011-04-03T21:23:00+00:00",
            "helpful_count": 9,
            "mal_id": 35650,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373495.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kennydejavu",
                "username": "kennydejavu"
            },
            "url": "https://myanimelist.net/reviews.php?id=35650"
        },
        {
            "content": "(This is my first review,so please forgive me if it's lame XD)\r\n~Story & Overall~ 9/10\r\nAfter pretty good first season (which took me few weeks to complete since it wasn't really THAT interesting) I wanted to finish what I started and I must say that I was pretty much unpleased when I found out that it's still an ongoing series - it almost stopped me from watching, since I hate waiting; however, I continued and I was positively surprised. Since I'm (kinda) a young girl and not much of fan of harem stuff, I did roll my eyes at some fanservice moments, but other than that- WOW. It's like thousand times better than first series. Story gets much more complicated and Magic vs. Science 'fight' gets more serious. That's exactly what I like Also, less 'fillers' :D To sum' it all up - if you liked first season, you will LOVE this one. If you didn't like first season that much - well, you will still like this one. XD But if you loved first season aswell, then I really don't know why are you reading that XD Shoo, go watch it already!\\n\\n\r\n~Art~ 9/10\\n\r\nPretty animation, yes yes. It's clearly visible that more money was spent on 2nd season comapred to first. I took lots of screenshots because art is so nice.. The eyes, the hair, and...and....I looove how powers are drawn, like Misaka's electricity. :)\\n\\n\r\n~Sound~ 9/10\\n\r\nIf I say half of my MP3's full just with Index OSTs and openings/endings, doesn't that tell enough? As always, it's completely amazing :) Besides I'm huge fan of Mami Kawada and once again both openings are completely suiting for Index atmosphere - somewhere on youtube somebody wrote that Mami Kawada's songs always fit atmosphere perfectly, and I must agree. I never once skipped the opening since episode 17 xD\\n\\n\r\n~Character~ 9/10\\n\r\nWell...poor Index is being ignored again XD\\n\r\nAnd I miss Misaka - though I was watching Railgun parallely(is that even a word or I just invented it?) with it so I survived :3\\n\r\nHowever, I was really happy to get a little bit more of Accelerator and Last Order, also everybody besides Index gets development and all. They are great just as always.\\n\\n\r\n~Enjoyment~ 10/10\\n\r\nThere's where TAMNI didn't disappoint me nor in first season nor here. I remember falling asleep while watching first season though, while I was actually staring at the screen at late night hours such as 4 a.m. while watching second season",
            "date": "2011-03-06T09:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 34931,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/286861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Twigileia",
                "username": "Twigileia"
            },
            "url": "https://myanimelist.net/reviews.php?id=34931"
        },
        {
            "content": "Well, i have laughed so hard to this anime from season 1 to end of season 2.\r\nSo this is story of Man, right hand and hell lot of women who get punched in face from that man. There is lolis who get punch in face, there is nuns who get beaten, there is million times strogner ppl who get beaten whit one or two punches. \r\nBut the best super power that MC has is (not my words) MC therapy session. He's like Dr.Phil when he opens his mouth middle of fight.\r\nEvery one who's watched this knows what i mean ^^\r\nBut still overall this show was4/10 to me",
            "date": "2015-06-26T05:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 191306,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4100629.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Seepos",
                "username": "Seepos"
            },
            "url": "https://myanimelist.net/reviews.php?id=191306"
        },
        {
            "content": "If you are looking at this review im gonna guess you watched season one or you are looking at reviews from both season to get an idea if you should watch this show.\r\nA Certain Magical Index this show quickly became one of my favorite for many reason\r\n1. It has a good story whole science vs religion idea is very interesting idea and the series pulls in of well\r\n2. Characters the Mc Touma quickly became one of my favorite anime characters due to the fact he is unique most anime character do the right thing and do it for there friends Touma does what he deemsnecessary to save a persons life whether it be good or bad but he is also very funny and a straight up lady killer\\n\r\n3. Humor  this show is just hilarious i believe it is very underrated for its comedy\\n\r\n4. Awesome action fight scenes are real fun to watch seeing up 12 year old nun he boxed out there is nothing like it\\n\\n\r\nSo i really recommend this show its an easy 9/10",
            "date": "2015-01-12T23:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 177655,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4359331.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/toumasrhand",
                "username": "toumasrhand"
            },
            "url": "https://myanimelist.net/reviews.php?id=177655"
        },
        {
            "content": "This will be my first review ever of any series, but I do hope that it will be taken seriously. Let me start off by saying that I've never read the light novels before and that I thought season 1 was mediocre at best. Season 2 is basically the same in all aspects. It's just a continuation of the story. \r\nArt:\r\nI'm not sure if animation and art should be grouped in the same category. While you might have gorgeous looking backgrounds, you might also have shoddy animation that ruins the whole concept. JC Staff is guilty of some really horrible animations and storyboarding in certainscenes here. There were times where I felt like changing the channels solely due to embarassing storyboarding ideas. Take for example the school festival, when Mikado asked Touma to jump on his back WHILE they were still running because apparently if they do that he'll gain some extra speed.. Well, maybe if the animation was better in that scene it would've made more sense. Sadly, it wasn't. \\n\\n\r\nIt's a shame though, I would've really enjoyed Index if not for this factor.\\n\r\n5/10\\n\\n\r\nStory: \\n\r\nThis was the part of Index that made me stay for two seasons of awful animation. And if there were a third season, I would pick it up right away. The central theme here I believe is every individual's sense of righteousness.. like many other shounen shows. Whether you belong to the church or if you're in a military organization. Everyone's got their own opinions on what they're fighting for, so rogue factions are abound. In fact, a LOT of them. I hear it gets even more convoluted in the light novels, but I really do find it interesting watching everything unfold.\\n\\n\r\nI guess there might have been similar storylines in other pieces of literature, but it's all about how you execute that idea and adding in your own twist to it. \\n\\n\r\nI also like the idea of Academy City. A futuristic setting that has its own unique cultures. However it does not forget its own setback in becoming a densely populated cultural and modern hub. Crimes, and lots of them. Sometimes I feel that the city itself is its own unique character that shouldn't be overlooked by viewers.\\n\r\n8/10\\n\\n\r\nMusic:\\n\r\nI wasn't really paying attention to the music because it never really got hold of my attention in the first place. I always believe that all good anime have good music because the studio actually care about putting that extra effort in. The bgms never really captivated me. The ops were forgettable too, although I quite like the animation in it. Sadly it didn't transfer over to the actual show. Well don't get me wrong, I love what I've Sound has done for the animation industry. They have produced memorable tunes that every decent anime fan out there should have heard at least once, but I'm just not feeling it here. It's quite generic to be honest.\\n\r\n5/10\\n\\n\r\nOverall I feel that JC Staff has ruined what would've been a better anime in terms of animation. But I would still watch the 3rd season just because I'm too lazy to read light novels.\\n\\n\r\nSide note: I do NOT hate jc staff. In fact, I think that they have very good animators. Just look at kamimemo and toradora. \\n\\n\r\nThank you for reading!",
            "date": "2011-08-17T12:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 41667,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dizzydiz",
                "username": "dizzydiz"
            },
            "url": "https://myanimelist.net/reviews.php?id=41667"
        },
        {
            "content": "Okay. Let me explain my rating first. Yes, I gave it 5 across the boards, however the reason is because I only enjoyed half of this season. That half being Accelerator's story. If the show didn't have Touma as a main character then it would have been 10 all the way through. However, for some reason they back up a BORING, NON-DEVELOPING and UNRELATABLE HAREM-TARGET that is Touma.\r\nAlthough not as bad as season 1 of Magical Index, season 2 still suffers from what the previous season tried to accomplished. There are too many characters and arcs to cram into in such a short time. Especiallywith a main character [TOUMA] whose one and only trick is to lecture his enemies to death while somehow being Rocky Balboa and unable to stay down. Undeveloped villains don't really add much danger or significance to the story. Good thing that they learned how to fix it during Railgun & Railgun S. \\n\\n\r\nOKAY! THE GOOD PART! \\n\r\nThe one and only saving grace of this season, probably of the entire series, is the other protagonist/anti-hero ACCELERATOR.....and next to him LAST ORDER. If the season/show was about those two characters it would have been all we needed. The relationship between the two isn't stagnant and reliant on forced comedy. [HEAD BITING?] If you are on the fence about watching this series, then at least \"suffer\" it all for ACCELERATOR. Finest piece of character development ever with little to no background information. \\n\\n\r\nCan one to two characters support an entire show? ACCELERATOR and LAST ORDER can, i'll tell you what. Anyway, if A CERTAIN MAGICAL INDEX doesn't tickle your fancy, watch the better written and produced A CERTAIN SCIENTIFIC RAILGUN. Better story telling, character development, enhanced antagonists, involved support cast and comedy that supports the story along.  PLUS, ACCELERATOR background. SAY WHAT???\\n\\n\r\n**Thumbs Up! A Certain Scientific Accelerator**",
            "date": "2014-01-18T03:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 129177,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3473723.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JustDan",
                "username": "JustDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=129177"
        },
        {
            "content": "Prior to Index II I watched both seasons of Railgun as well as Index I.\r\nCompared to those seasons, this just feels incredibly rushed. \r\nAlthough The Daihasei Festival arc seems fine enough, Everything previous had no set-up and was over in just a couple of episodes. \r\nFurthermore they keep adding a few minutes of random interactions during each episode of Touma and the various other characters enjoying the festival, albiet with an incredible amount of fanservice. \r\nThat is why I docked the story down to a four.\r\nThe art neither improves nor degrades the already set art-style, although since as I was watching it, I had towatch it low-res, it looked rather meh\\n\\n\r\nThe music did not either particularly detrtact nor add to the overall experience, leading me to simply leave it at the same rating as I gave the anime over-all\\n\\n\r\nThe characters are fine, I do enjoy watching them simply interact between themselves.\\n\\n\r\nMy enjoyment was about the same as my over-all score.",
            "date": "2018-11-23T20:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 294603,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheSociopath",
                "username": "TheSociopath"
            },
            "url": "https://myanimelist.net/reviews.php?id=294603"
        },
        {
            "content": "STORY - 6\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 7\r\nENJOYMENT - 7\r\nOnce again, the Index series continues on with its story between the two great divisions of mankind: religion and science. Bringing the old and the new together, the second season expands its world of supernatural powers with greater proximity. There are indicators of something huge brewing right around the corner but quite frustratingly, the ever-present narrative issues are still there to dent the story's full potential.\r\nCompared to its predecessor, the second season follows more or less the same formulaic method as the first season, except now, we have some hints to a bigger story. Havinga core that holds each arc together gives everything one more level of significance. After all, this is a world where religion and science coexist with one another. It's definitely a story idea full of potential.\\n\\n\r\nBut like I've said already, a couple of negative factors sadly bog down the story. The biggest perpetrator is the mishandled pacing that felt too fast here and there. Especially for a complex world like the Index series, a rushed pacing will not bode well at all because it's synonymous to a jumbled-up story. And when you have a jumbled-up story, you will have an awkward time trying to process the many information, interactions, and fights that are present here.\\n\\n\r\nSo, how about the concepts of the story? Well, it's clear that there are more substantial movements going on in the religion side with various Christian sects such as the antagonistic Roman Catholic Church making their move. Touma, along with his mysterious right hand and other existing and new characters, must prevent their hostility from affecting the fragile balance of the world. In terms of the characters, the antagonists make up a pretty poor group of people driven by weak reasonings. When combined with their little screen time, they aren't that impactful to the story. They can be entertaining, but you will only reach the bedrock if you want to dig deep for any three-dimensional qualities. Character development is still not a very important factor for this series and as for the unlucky Touma, while he has his tendency to just shout idealistic lines and punch faces, his generic aspects serve as a good dichotomy against the diverse religious and scientific workings, like a litmus paper that functions under different conditions.\\n\\n\r\nThe last few episodes, thankfully, brings this season off to a solid conclusion with the focus on the Dark Side of Academy City along with some huge conflicts looming between the religion and the science side. Accelerator, the strongest esper who is also the face of Academy City's darkest secrets, gets more anti-heroic attention here and is put into a parallel comparison with Touma, highlighting their similarities and differences. This neatly ties in with the multifaceted viewpoints of the Index series and is definitely the strongest dynamic for this season.\\n\\n\r\nAnother good factor I enjoyed, albeit in the lighthearted zone, is the slices-of-life, usually constituting verbal dialogues that are clever in their humor. There are not as many of these compared to the first season, but they dampen up the inharmonious main story when they do appear. Basically a nice breath of air every once in a while, though the fan service ones are still not that tasteful. \\n\\n\r\nArtistically speaking, the visual is now cleaner with better line work and this results in an environment that is pretty much more polished in all aspects. Particularly, the backgrounds deserve a shout out just because of the high-quality glints that emit through the screen. A lot of the blue vibrancy in the backdrops brings out the magical and supernatural tone of this show, so it's definitely a cool complementary effect. As for the animation, it tends to be inconsistent but once the final climax of the fight comes in and Touma grips that right fist of his, the animation is amplified to noticeable levels. You might get a kick out of seeing all the close-ranged shots of faces getting punched to oblivion. I sure as hell did.\\n\\n\r\nThen we finally have the improved line-up of soundtracks. Of course, the upbeat electronic music with fast beats per minute is still there to pump up the fight scenes but there's a distinguishable presence of angelic soundtracks as well that really fits the religious theme. The diverse range of voice actors further contributes to the entertaining factor and especially for the antagonists, the expression of various personalities is the definition of eargasmic. Mami Kawada also knows how to sing cool opening songs while the second ending theme has a gentle melody that is a treat to listen to.\\n\\n\r\nAll in all, the second season of the Index series is a passable continuation. The anime suffers the most from a rushed pacing which left out quite a bit of relevant information from the light novels, affecting how the characters are treated and decreasing the enjoyment value. But religion and science have finally collided with each other this season. What happens next will certainly be bigger than anything we've seen so far.",
            "date": "2018-10-27T07:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 292712,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=292712"
        }
    ],
    [
        {
            "content": "Fresh off the second season's finale. Story hangs in a more or less cliffhanger of events as the story converges to the climactic prologue of the next arc (novel readers would already know this). But let's be honest here, I guess most of you already know what's coming, having googled a certain wiki.\r\nIf yes, you're wasting your time reading this guano of a review. If not, or if you have and yet you feel like you want to continue; I thank thee for your compliance!\r\nSeason 2 of Index, I would say, is a very hasty season as compared to the first one. Arcs are dividedinto smaller segments this time around, at least that's how I feel. The only problem I see with this is that non-novel and non-Wiki readers would have some problems transitioning in-between events. What I don't get is also why the hell did the production wasted so much time on a certain arc (Daihaseisai arc if you must know) and leaving so many loopholes during the last few bits of the season. \\n\\n\r\nAlso, almost every episode you see fights and Touma's never ending generalization of things (reminds me alot of Kokuto Mikiya's bro-ness, except a bit more annoying). Fans of the first season who were enticed by the uniqueness of the abilities present in the Index universe would be delighted to know that you finally get to enjoy the tender, fluffy texture of the cake. More so if you're a fan of Magic instead of Esper abilities; A major chunk of Season 2 has our heroes deal more with the Church than with Academy City affairs, the latter only being zoomed in during the later part of the season.\\n\\n\r\nOh and guess what! Finally a change of scenery as our heroes not only do what they do in good-ol' Academy City! I was really getting sick of the dense urban jungle Academy City is. I think I'd even say that it looks better when it's destroyed.\\n\\n\r\nCharacter development has been, I would say \"fragmented\" throughout the season. Touma still has his memory destruction thing, and everyone in the season is oblivious to it (except maybe Aleister Crowley, since he's the floating dude who planned the shits going on in the entire series anyway, bet he enjoys doing a \"All According to Keikaku\" look in his sad room). And he's the same Touma we know from season 1, prior to and after the whole memory thing. As mentioned above, he does his whole generalization and \"illusion\" breaking stuff with his right hand. Oh and yes Touma still one-shots everyone, and everything, with his Imagine Breaker. At least it's balanced by making him a total wimp of justice.\\n\\n\r\nIndex has been demoted to the position of mascot. But that's ok, because the good part is coming in Season 3 (Hopefully)! Ok let me just skip to the good part of the character development stuff. I really, REALLY enjoyed Accelerator's appearance in Season 2. Now who here actually disagrees with me that his vector manipulation is made of win? Ever since his introduction in season 1, I've been hoping for moar of him. Sure, the small arc about saving Last Order in the previous season served a purpose as to pave the way towards his grandiose role he's supposed to have in the series, BUT IT WASN'T ENOUGH. Season 2 does just that: His soft-side (I know, dichotomy), his \"ideals\" and his \"goals\" are all laid down for us, and we get to see just what is behind that facade he puts on. \\n\\n\r\nAlong with Accelerator comes with Last Order. Awww, I just love the way she speaks where she repeats the Misaka part. A friend of mine often disregard it as \"utter annoyance\" but seriously now, it's kinda heartwarming when she does that, even when she's feeling kinda down.\\n\\n\r\nThe Magic side expands greatly this season. Abilities such as displacing action to a certain designated spot, grimoires creation, global AoE incapacitation, etc. You have a woman with big jugs, you have a yandere whose flat chested, and you have a loli too. What's there not to freaking like? On a side note, I prefer big jugs.\\n\\n\r\nThe first OP I find to be catchy, and my favourite of the openings. Kawada Mami's electro-pop \"No Butts!\" really fits into the overall fast-paced action you ought to see in the series. I think the production team really did a good job having her sing the OPs. Her style of music, I would say, accentuates with the feel of Academy City's technological aspect, while the lyrics serve to mash up the Magic side's religious aspects.\\n\\n\r\nI didn't really liked the first ED, but Memories Last does a good job bringing an episode to an end. Especially during the last episodes (I think last 6? I don't really remember), the often cliffhanging, destitution filled endings really play well with the beginning of the song's soft synthesizer tunes.\\n\\n\r\nOverall, I would say Toaru no Majutsu no Index II is a somewhat enjoyable sequel to its predecessor. The weaknesses are mostly associated with the standpoint of the arcs the season is in; there isn't really nothing to actually complain or advise against. That being said, I strongly recommend watching the second season, and start looking forward to season 3; Because I'm in love with Takitsubo Rikou.\\n\\n\r\nHaters gonna hate.",
            "date": "2011-04-02T07:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 35578,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25959.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/moomoocow1314",
                "username": "moomoocow1314"
            },
            "url": "https://myanimelist.net/reviews.php?id=35578"
        },
        {
            "content": "I completely loved the anime, its idea is very original. Its very fast paced and will always keep you wondering what going to happen next. Its character are full of life. i also recommend this anime, to all those enjoy sci-fi animes. Hands down, this is Great... must better than season 1, but i do hope you watch season 1, because otherwise you will not understand it.  I strongly recommed for a season 3.",
            "date": "2012-09-13T15:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 72249,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1263007.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Anime-Rules15",
                "username": "Anime-Rules15"
            },
            "url": "https://myanimelist.net/reviews.php?id=72249"
        },
        {
            "content": "I'll keep this review short and sweet, for those not looking for incredible depth into the value of a show:\r\nOverall, there is plenty to enjoy about A Certain Magical Index.  There are a number of fun and interesting characters that each have their moments (mini-MIsaka is my favorite), the \"world\" of the show is interesting in the division between fantasy-magic (classic Magic) and science-magic (ESPers), and its decently well acted.  However, there's no real overall arc or development of the characters even after 48 episodes across 2 seasons.  While new enemies appear, and side characters get more show-time, nothing ever really changesand there is far too much repetition of the same gags over-and-over-and-over-and-over again, and not in a good way.\\n\\n\r\nIf you are looking for a show to kill some time that is light and fun, check this out, watch it one arc at a time.  If you want something more substantial, check elsewhere.",
            "date": "2016-03-01T16:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 212052,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/tagbadger",
                "username": "tagbadger"
            },
            "url": "https://myanimelist.net/reviews.php?id=212052"
        },
        {
            "content": "I'll write this review with the fact that you've seen the first season. I've also written the prequels review so feel free to read it too.\r\nAnyway, the second season is better than the first due to a few aspects. We get more eye candy, new characters and some good action.\r\nStory 8/10:\r\nThe story is the same as it was before. Touma, with his right hand can defeat any magician and esper. Touman, like before, is the main character of the series. Index, well she shows up few and far between but the main focus is Touma.\r\nThe series is split into magic arcs and science arcs, justlike before. And just like before, the science arcs are pretty amazing as compared to the magic ones. One thing I liked in this sequel is that they really mixed up science and magic in a few arcs which made things much interesting. By mix up, I mean the magic arc is set in Academy City, and they also show many espers instead of the magicians themselves.\\n\r\nSome arcs had me wishing they'd end sooner and some episodes were so enjoyable that they went by in a flash. So, it's pretty much the same as it was before but new characters spice up the story a bit.\\n\\n\r\nArt 8/10:\\n\r\nSame as before. Pretty nice animation and graphics quality. And much more abundance of eye candy as compared to the prequel which, as we all know, is good.\\n\\n\r\nSound 7/10:\\n\r\nSome people like the songs of this series while some don't like them. I didn't find the songs to be anything interesting as to listen to them all the time.\\n\\n\r\nCharacter 8/10:\\n\r\nKamijou Touma is the same as he was before. But I think he gets a bit more confident in his ability in the sequel.\\n\r\nMagicians Cast:\\n\r\nMany new magicians appear in this sequel and some old ones disappear. Kanzaki Kaori, being my favorite character is nowhere to be seen during the entire series. She becomes more of a side-side-side character. She has importance in the story but we don't get to see her much. Tsuchimikadou is the main cast from the magicians side. And we do get to see Stiyl often but Tsuchimikadou is the main cast.\\n\r\nEsper Cast:\\n\r\nAs with the magic side, some new characters appear from the espers as well. Most of them are from the school of Touma but new baddies also appear.\\n\r\nOnly a few new characters have their stories explained while others are just for the moment. But they also play a role in the story's events.\\n\\n\r\nAll in all, the new characters are a pretty nice improvement and keep the show going good.\\n\\n\r\nEnjoyment 8/10:\\n\r\nWell, I can't say that I enjoyed this as much as I did other anime. Since some parts were quite stretched out and some drama here and there got be pretty bored. But I definitely did enjoy Touma punching the hell out of his opponents. Academy City is, as always, the best place to be in this anime, speaking in terms of eye candy, action, comedy. Some magic arcs take place outside the city and they were quite boring to watch.\\n\\n\r\nOverall, this is a good anime but not as good as I expected it to be. And with the ending they put, it's just begging for a sequel. If you watch this anime, it's good but if you don't watch it, you lose nothing. It's not an anime that you must definitely watch. It's just ok. Not bad, but not amazing either.",
            "date": "2015-03-01T03:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 181442,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AbsarNaeem",
                "username": "AbsarNaeem"
            },
            "url": "https://myanimelist.net/reviews.php?id=181442"
        },
        {
            "content": "I was really excited for this season since season 1 was one of my faves. However, I was left dissapointed with each arc... The only arc I liked was where Kuroko had time to shine, it is probably the only arc where it didn't finish with Touma punching someone is the face. Too bad it was rushed as well, but still very enjoyable.\r\nOtherwise it is the same thing over and over, Touma has a huge speech and then punches someone in the face, I mean come on! There are a lot of skilled characters with far more experience yet they always get tossed to theside while our beginner Touma punches the shit out of the enemy -_-\\n\\n\r\nTouma had used his Imagine Breaker so many times that I can't belive that enemies side still didn't figure out how to fight it. Whenever enemy seems to notice his hand power, they still for some stupid reason end up falling for it. They don't change their tactics at all! Or at least not to the point that it would be THAT noticable =/\\n\\n\r\nWhy can't it be like in Kuroko's and Awaki's arc where it wasn't Touma who finished the fight?\\n\\n\r\nThen comes characters issue, Index was seriously annoying this time around. All she did was getting mad at Touma for no reason and then bite him 100 times... Is she some kind of dog?\\n\\n\r\nKaori had joined Touma's harem... how did THAT happen?!\\n\\n\r\nThe only entertaining thing was when magic and science side decided to strike at the same time but even then conclusion wasn't as great as I wanted...\\n\\n\r\nSeries did have some really interesting arc beginings which got me excited but the moment we reached conclusion, it was a fail. Some conclusions were actually very dumb, to the point that you wanted to slap yourself.\\n\\n\r\nI really hope that if there will be season 3, that the arcs conclusions will be far more exciting and less repetitive because for now they all can be named \"TOUMA PUNCH!\".\\n\\n\r\nI give this season 7 over all, I would have given less but I still respect season 1 and this season did have good ideas which sadly were crashed later.",
            "date": "2011-04-02T06:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 35577,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238319.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kitten320",
                "username": "kitten320"
            },
            "url": "https://myanimelist.net/reviews.php?id=35577"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nWell this show has been a waste of my time. A broken promise of a clash between science and magic, a protagonist that fights more with his mouth than his supposedly almighty hand, unnecessary side stories and fanservicing. The only saving grace were a few certain arcs concerning the science side. I would go on but I'm too lazy to continue. \r\nJk I'm gonna continue.\r\nThe second season continues off where the season one ended and it goes even more downhill from there. To start off, the protagonist gets all even more whiny. I'm fine with him punching women in the face. WhatI'm not fine with is him constantly berating anyone before punching them. If they wanted to hear you whine so much they would have gone to a counselor, a teacher, to anyone but you. And his ability. For someone whose ability is actually limited to his physical range, he sure wins a lot of obviously disadvantageous battles. Oh he can stop my single ranged attack with his hand? Well I guess I  have to resort to attacking head-on instead of attacking with multiple projectiles or balls or whatever that one hand only couldn't possibly block since that will spoil the story.\\n\\n\r\nNext comes a shitload of characters. Yea sure the story is about a city and its inhabitants and its enemies and allies blah blah. Characters keep popping up from nowhere just to add tension and surprise to the plot and then they disappear. Even my imaginary coffee maker has more development than them. Did I mention the harem? Every lady/girl the dull protagonist comes across is mesmerised by his mouth that won't stop yapping. Honestly I don't see the appeal in this character and why the females in this story are so attracted to him. Oh he saved you with his speech and promptly ignores you after that so you should be attracted to him. K can. Back to the characters. Index is a broken recorder, and the rest are insignificant. Except for the Mikasa people. They are slightly more interesting.\\n\\n\r\nThen comes the plot with more holes than a swiss cheese. So much jargon is unexplained or explained poorly, leaving me confused at times. Wait scratch that. Make it all the time. The arcs are incoherent and the transition is lacking. Jumping from science to magic does not equate to science meets magic, contrary to what this anime believes. Jumping from relevant but boring story arc to standalone and equally boring arc is also stupid. The plot is never here, nor there or anywhere for the matter. And so much story telling. Let's stop fight halfway to reveal a sad backstory. Or some mumbo-jumbo about how some claptrap works. Yea sure all that exposition is needed for the story to progress but isn't there a better way to present it than in the middle of a fight? \\n\\n\r\nAnd the fights. Any fight involving the counselor-wannabe is sure to leave him pretty much unharmed. No signs of a broken limb or bone or any injury too serious. Only bruises and coughing up blood even after being thrown around like a ragdoll. No problemo I understand your body can dispel injuries. Then when it comes to Accelerator it goes all grim and bloody and dead like wow finally something realistic. Thumbs up for that. If only the protagonist's fights were more like Accelerator's. But please dump the unnecessary internal melodrama.\\n\\n\r\nThe sound was horrible too. Constant droning of toma touma toommaaa, that sound effect when protagonist punches some mishmash etc. I could make better effects in the toilet. But the art though. That was decent.\\n\\n\r\nSo, in conclusion, um, not to be mean, but the story was splattered everywhere and the technical stuff was pretty bad, except for the art. The only decent parts were arcs relating to Accelerator. So yea, this may be seen as a rant. Maybe it is.",
            "date": "2016-02-12T11:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 210731,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TableLeg",
                "username": "TableLeg"
            },
            "url": "https://myanimelist.net/reviews.php?id=210731"
        },
        {
            "content": "As a novel series, it should have been on par with DRRR!!! but only with the presence of Touma's harem ruin many points this series deserve to get. How 50% of the female cast would end up liking him, just because they have heard him talk in an elongated not-quite-so-heroic speech about his philosophy, thats the biggest weakness this series have in my opinion. As Touma is like any other guys with harems in other anime, a stupid, near-powerless guy that had never been described as being attractive but with some odd sense of justice that should have been simple suicide in his situation buthe will still survive, gaining more girls to his harem through the process. I personally find how all of the 3 protagonists of this series can be paired with 2+ girls irritating, as they could've given the girls to other guys instead of flocking up on these 3\\n\\n\r\nHow Touma fight also give out more questions, yes he may be a good street fighter, but he's still a student who waste days on end trying to live normally. Nevertheless he will still win over guys with years of battle experience for some odd random reason(and just to point out further stuffs, Touma can withstand almost any type of attack given to him and would still be able to stand up, while most of his enemy would fall by 1-3 punches). In reality Touma would be one of the easiest character to kill, as one bullet from a single pistol should have been enough to put him out of his misery.\\n\\n\r\nFor Accelerator side, Accelerator is a neatly made chara with a nice mix of a psychopath and an effective antihero. I enjoy his lack of sanity, creaking screams and maniacal laughs, his Vector Shift ability is original and is effective without hurting the actual science behind it, though I didn't quite like how his psychopath personality is softened by a mere loli that he appears to develop bond to without any apparent reason.\\n\\n\r\nAnother bad point I didn't enjoy are the Misaka clones, since there are so many Misakas around it kill the appeal the original Misaka is supposed to have. How Touma and Accelerator both can be paired with 2 each of their own personal Misakas.(*SPOILER* Accelerator will get another Misaka clone, forming his own mini-harem) So there's so many Biribiri running around and 4 of them can be taken as heroine, that look boring to me.\\n\\n\r\nThe last problem I have with this series are the naming of each term, though Imagine Breaker, Meltdowner, Railgun, etc may be decent names, naming teams of people GROUP, ITEM, SCHOOL, MEMBER etc sounds simply dumb. You could obviously have come up wit better names, just spend 5 more minutes on it at least.\\n\\n\r\nFor other points, the music of this series is good, and yes Accelerator's wails of sadistic joy is also nice to the ear too.",
            "date": "2011-09-04T21:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 42735,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/564349.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shemyaza",
                "username": "Shemyaza"
            },
            "url": "https://myanimelist.net/reviews.php?id=42735"
        },
        {
            "content": "I really have no idea why.\r\nWhy is it on its 2nd season and why oh why, each season contain 24 episodes\r\nI was trying to figure out, this series, but, obviously, utterly failed in the end\r\nOh yeah. Right. Constructive Review. Okay...\r\nThe hero continues on its approach. Long dialogues about religion and science. In it details why this magic happened and why this scenario occurred and reasoned why the owl hunts at night. \r\nI don't know if others felt the same way but to me, it just seems that they took too much time talking. Many judges kids or people with short attention span that its normalnot to like this approach, though I doubt I have this problem. I can read through thick books, fiction mostly, in one sitting. I can stay up to the most boring teacher there ever lived.\\n\\n\r\nAnyhow. The story continues where the season 1 left off. And as said, greatly details the side of religion and science. The religion for magic and sorcery while the science will be represented with esper capable people.\\n\\n\r\nI want to give you the basic idea of what they are on about. their arguments. But every time I try to listen, words would just tunnel through me from ear to ear. I don't get it. And most of the time, I start to wander off, or sleep. Probably snore, considering the effort in trying to understand this series. \\n\\n\r\nThere were no improvement. The hero and its sub characters were freezed. No lessons, no motivation clearly defined, at least one that I understand or can relate to. You see, in this series, the main character comes to save every person he comes by, risks his live even. How and why did he come to this kind of state. Instead of an in depth knowing of the hero's life to somehow explain his god-like goodness, we are busied with watching various stories of chivalry, battling monsters, and if not one of those, more likely showing us some hot anime girls, clothes or no clothes. \\n\\n\r\nThis series is survival to the fittest, to me that is. Constantly in it to survive until knowing the ending, out of curiosity. I'm already more than half of the series. I don't know about the others since apparently, the anime is popular? You might find this fun, going by the probability and if you're one to like neked anime girls, then the probability of liking this series goes through the roof.\\n",
            "date": "2015-07-28T00:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 194519,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743422.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/animeBee1ver",
                "username": "animeBee1ver"
            },
            "url": "https://myanimelist.net/reviews.php?id=194519"
        },
        {
            "content": "The initial energy of Toaru Majutsu no Index II seemed to quickly dissipate to me -- and with it went in-depth development of more characters and story arcs!\r\nTL;DR last paragraph.\r\nTo be honest, I'd read reviews so I was hoping for some honest-to-goodness fanservice, but there was little to be offended at.  I would have liked to see more than rounded stretched shirts on those rockin' racks on the adults and MILF supporting roles scattered throughout (like Misaka's mom!).  Any so-called loli views that I can recall were tame, if completely non-existent. (Faces, and hidden figures that completely lack physical form, aren't \"loli\" -and their outfits couldn't really be considered special, revealing or alluring, could they?)\\n\\n\r\nI was soo tired of Index -- it didn't take long for her to start dragging down the show that I felt sorry for her!  -- A one dimensional Savant, helpless, boring and not-funny to the point of a sad girl:  Almost passed out from hunger?  not funny after the 12th time!  Gnawing on Touma's head? OMG, not funny after the 4th time, and not funny after the 20th time!!! Jealous for no good reason? Not funny after the third time, and still not funny after the 10th time!!   TOUUMMAAA  -- TOOUUMMAAA!!  (repeats)  <rolls eyes>  For the love of... there's no reason they could have sat her out and developed a far more interesting girl - or two!!  The worst/best example of lazy lazy lazy writing.\\n\\n\r\nAlso, multiple and repeated use of the cat-mouth in a show where someone's brains get sprayed out....maybe it's just me but juxtaposing the cute/blissful face in between the horror didn't work, it was annoying and distracting.  Sure you're buying a girl ice cream or whatever, fine.  But too much, man, way too much.\\n\\n\r\nIssues with fights: (Minor Spoilers)  1) our MC wins when he should have flat-out been knocked the fuck out...  c'mon-- he's a freakin' kid fighting seasoned adults - or whacked with an ASP! -  and \"grit\" goes only sooo far folks!  2) Why keep throwing ESPers at him when you know he's got the \"magic hand\"?  How about some Judo, or a brick or a 2x4?  3) and when Touma does knock down a bad guy/girl, why does he just hit them like once, knock them over, but never, ever take away their spell casting stuff so they can't kick his ASS again? ARG!!! (example, his showdown with Oriana Thomson!) I mean, he gets up after getting pounded, so why does he think they won't?! Knock their shit away, then they can come up with some hidden stuff... \\n\\n\r\nI do understand why/how Accelerator could take an interest in a young waif and care for her, despite being the butcher he is -- murderers like puppies....\\n\\n\r\nWhat is unknown to me is why our MC fights his battles - yes, I know it is the essence of a Harem plot to fight for these girls.  But Touma can hear of some girl - unknown to him - is in trouble and he'll risk great bodily harm?  Uh uh, I don't care how noble a person is, once you break a couple ribs and more, you don't volunteer to go back and do it again -- especially without receiving any further martial arts training?  Why?  It's not for money, and not for actual pussy, so why walk into that buzz saw over and over again?  What?  Touma finds something offensive, or unfair? Dude, you're 17 years old - call the Police!  lazy writing, lazy writing, lazy writing.\\n\\n\r\nDid I miss this explanation?  Touma for no good reason repeatedly places himself in danger to save women he doesn't know, and simply rushes to danger and peril that he was unprepared for and unqualified to deal with because - reasons! Heck, nearly half the time he did shit that had nothing to do with his right hand, so that reason's out.  Didn't even come across as a dare-devil of a kid, or one who was done with life and so screw self-preservation....\\n\\n\r\nOverall, 6/10 due to lazy writing that kept stale, boring characters around and not developing others; winning fights ex machina; 20 minutes of cat-mouth; dragging on fight ending without coming up with new stunts because you're too lazy to come up with new drama; very little fanservice; no clear motivation or reason for Touma to step up to have his head caved in the first place.  So it wasted the opportunity given with 24 Episodes, and stretched it out too long as a result.",
            "date": "2017-02-24T02:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 241258,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5528848.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/brad_Wolff",
                "username": "brad_Wolff"
            },
            "url": "https://myanimelist.net/reviews.php?id=241258"
        },
        {
            "content": "Pretty good stuff. No fillers. New characters came off a bit shallow, but the ones introduced in previous series were further developed in interesting ways.\r\nNot enough Mikoto :-D but then again there's no such a thing as enough Mikoto.\r\nEnding was a little weak, but then again it's obviously not an actual ending, but rather a cliffhanger for the next series (Index III or Railgun II?). After the amazing endings of Railgun and Index 1, that was a bit of a let-down. Had it ended in 22, it would have felt like a stronger series.\r\nIn fact, my greatest fear with this series was that there wasa lot of preparation, foreshadowing, and cliffhanger-ing, so in the end it kind of feels like a giant pilot episode or something; if for whatever reason the meta-series does not continue, fans will be rather disappointed.\\n\\n\r\nThe music was better than the average anime, but even that was a little disappointing after the epic coolness fripSide delivered in Railgun (some of my favourite music in the last few years). Let's hope fripSide comes back on the next one.\\n\\n\r\nOverall, not as good as Railgun IMHO, but better than Index season 1.",
            "date": "2011-04-02T04:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 35576,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/462650.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lalomartins",
                "username": "lalomartins"
            },
            "url": "https://myanimelist.net/reviews.php?id=35576"
        },
        {
            "content": "Story: I give it 9. It's not linear, it's fun, no time to be bored!\nArt : 8, nothing else to say!\nSound : good sounds effects, even if some of them are a little bit... too much\nCharacter : They just really nice! Touma : fu-ko-da! They all have very different minds, and this is really good! Also Accelerator is nice here (instead of the 1st season)\nEnjoyment : Yes, only 7. The end isn't an end. The anime was fun, but the end break everything...\nOverall : 9, just a f***ing good second season! Watch it!",
            "date": "2013-07-10T20:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 104801,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1690303.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cyril72240",
                "username": "cyril72240"
            },
            "url": "https://myanimelist.net/reviews.php?id=104801"
        },
        {
            "content": "id give it an 11 but it does not go that high to me this was a fun anime it just one of those anime's you'd be willing to watch again just because how fun it was to watch only wished i got to watch it in dubbed because when im watching sub it ruins some of the fun of actually watching that anime not reading\r\n so in short \r\nthis anime has people with and without strange powers battling and the main character whose powers just void other powers gets to knock all the evil people  in the face which is just fun towatch the so called powerful people astonish look on there face",
            "date": "2011-08-26T14:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 42205,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/254866.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dicela",
                "username": "dicela"
            },
            "url": "https://myanimelist.net/reviews.php?id=42205"
        },
        {
            "content": "So, here we are. Toaru Majutsu no Index II, a second season/sequel to the first season. The audience is once again shown following the adventures of a certain man, Touma Kamijou, through the hells of Magic and Science. All the while building his (in)famous harem, of course.\r\nHonestly speaking, the Index series has been one of my favorites ever since I layed my eyes on it. After finishing season 1, I waited paitently for a season 2, expecting this series to be more awesome than it already is.\r\nAfter the 24(or 25, if you count the delay) weeks of watching it, I have found myself in quitea shock that Season 2, strangely, didn't live up to its first season counterpart... for me, at least.\\n\\n\r\nLet's break this down:\\n\\n\r\nStory: 7/10 (Good)\\n\\n\r\nOne of the more distinctive features of Toaru Majutsu no Index is the way its story is presented. Instead of every moment leading up to one giant picture by the end of the show's run, Index is divided into disjointed story arcs, each telling a different story. This is not to say that each arc is completely disjointed, as sometimes, characters and events leak from a previous arc to another. For Index II, the story arcs are more disjointed as compared to its first season counterpart, but with no events being absolutely inconsequential.\\n\\n\r\nThis leaves more space for error, with each arc being judged by the audience instead of evaluating a whole show. Needless to say, each arc is a hit-or-miss. In Index's case though, the show has a surprisingly good rate for \"hit\", though it will always be subjective as always.\\n\\n\r\nWhat one may notice about the story arcs in S2, though, is the formula that runs through each. Each and every arc follows a specific event sequencing that, over time, will wear the watcher down. The stories in these arcs are actually quite interesting and some even really exciting. However, if one is to note how each arc ends, there will surely be a visible pattern in motion, and certain viewers may actually end up really tired of the procedure. For some others though, the way it ends is pretty awesome anyway so it doesn't matter too much. (But of course, some arcs do admittedly end pretty weakly.)\\n\\n\r\nArt: 7/10 (Good)\\n\\n\r\nHints of Index II's art can actually be seen in most of J.C. Staff's other works. The art in the show is pretty clean and crisp. In well-crafted scenes, the way a picture is drawn and the quality of the art is great.\\n\\n\r\nDo note though, I did say \"In well-crafted scenes\".\\n\\n\r\nIndex, despite having top-notch art, sometimes does suffer from animation resulting from cutting corners and all that. While other scenes look good, the series also has its fair share of bad quality moments.\\n\\n\r\nSound: 9/10 (Great)\\n\\n\r\nIuchi Maiko composes great music for the show. That I can really vouch for.\\n\\n\r\nIts 2 Opening themes, \"No Buts\" and \"See Visions\" by Mami Kawada are very catching tunes and fit the show's theme and mood. The same goes for both Ending themes, \"Magic World\" and \"Memories Last\" by Maon Kurosaki.\\n\\n\r\nCharacter: 6/10 (Fair)\\n\\n\r\nCharacters. It gets pretty tricky here. For our hero, Touma Kamijou, he retains his whole personality from the first season. A strong determinator, clever... and preachy? Personally, I don't have a problem with him as I do with the others.\\n\\n\r\nSome characters(especially one of the famous ones) evidently suffer flanderization. This is especially jarring when a character from the previous season shows a solid personality while most appearances here depict(visibly) only one trait. This can be really cute at times, and actually quite enderaing. But in Index II, this trait was overused and for me, became quite tiresome.\\n\\n\r\nOther characters, though, are still okay personality wise. As for \"Touma's harem\", characters designs are still solid as always and always a plus.\\n\\n\r\nEnjoyment: 9/10 (Great)\\n\\n\r\nBut just because I have been saying some pretty negative things about it, it doesn't mean I didn't enjoy to its fullest.The show drifts from intense and thrilling action, to mysterious and dark atmospheres, to refreshing moe and fanservice galore. The way to enjoy this show is to accept the flaws and enjoy whatever the show wants to shell out. Each punch is precious, every thrill worth the ride and the fanservice all out to cherish.\\n\\n\r\nOverall: 8/10 (Very Good)\\n\\n\r\nFor me, Toaru Majutsu no Index has been a fun ride. And I'm glad I watched it. The show has its very visible flaws but will always remain to be a fan favorite as Index does not rely on being \"intellectual\" or \"deep\", but instead, wants to be fun and enjoyed by everyone(even if it means satisfying lowest common denominator). As I said earlier, even though for me, Index II didn't live up to its first season it was still a good watch.\\n\\n\r\nBeing a fan of the first season doesn't entail the enjoyment of the second, but it's worth the shot. We may wait for a Season 3, and hope it fairs a lot better and surpasses expectation.",
            "date": "2011-04-06T12:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 35746,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/239029.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LobsterRyoma",
                "username": "LobsterRyoma"
            },
            "url": "https://myanimelist.net/reviews.php?id=35746"
        },
        {
            "content": "I don't understand why the score is so low. Like I understand that Touma is not the best character and Index is really really annoying. Touma's fighting scene is not that impressive because all he did is just doing some inspirational speech, waving his hand and one punching the enemies, he also have the trait 'somehow always in the right place at the right time' or in this case the opposite.\r\nBut I feel like this is one of the most well made world I can recall. Every big arc have some connection like how Index arc destroyed the Three Diagram which leads to MISAKA arc.And how the a lot of the bad guys appear again as a good guys or some mercenaries rather than just disappear or never mention again. I also like how the story isn't just focused on the MC but also other character as well and how they fit perfectly, hell they even have the other series that also fit the timeline.",
            "date": "2018-09-22T01:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 289651,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4707765.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PoDH",
                "username": "PoDH"
            },
            "url": "https://myanimelist.net/reviews.php?id=289651"
        },
        {
            "content": "To Aru series holds a special place in my heart. As one of my first few series, and by that I mean first thirty, I had looked forward to season two since news reached my ear. However, the new season did nothing more than break the naïve fandom I fostered from that time. I still think that the show is good, but the second season follows the sequel rule: It isn't better.\r\nThe second season focuses almost solely on the magic side, the different church societies playing a role in every arc. That said, J.C. takes great liberties with the speed (not to mention 5 episodeslate on a new OP, another issue being a Mami Kawada fan). The arcs feel very long, and as such the interest I had suffered. The scale of the plot is a lot larger, as what was a single person or two in season one becomes a fleet of ships, an army of nuns, or a group of thugs. I love how descriptive and dialogue rich the show was, but as the scale got larger so did the amount of discussions - Touma gives his speech, but this time we have another three or four people that need to get their say in. Almost all of the characters make their return at one point of another, even the girls from railgun are shown working away at Judgement. The cast keeps growing larger though, as  Touma befriends a new church faction in the first arc that keeps reappearing.\\n\\n\r\nSince there is no esper arcs, biri biri rarely shows up, and neither does accelerator. Just like Touma in railgun, their appearance is the holy grail of the episode typically. While things are slow for the most part, accelerator never fails to cut to the chase and kick some ass. He is the only esper to play an active role in the plot of the show. Despite being crippled from his injury last season, he fights more intelligently and puts on a better show for us than Touma. In all honesty, Touma does nothing but walk in on naked girls, lecture them, and proceed to punch them in the face. The respect for his ability to fight against anyone with Imagine Breaker, shattered at the simple displays this season.\\n\\n\r\nWhile the majority of the show does not live up to the first season, the final arc restored some of my faith. I would definitely watch a third season, but I would have to say that either the second season had a handful of bad arcs, or I am more a esper fan than a magic one.\\n",
            "date": "2011-07-02T19:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 38609,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=38609"
        },
        {
            "content": "This anime has a very unique kick to it. Although it presents the typical conflict between magic and science, it shows that there is no one singular antagonist. Rather, there are antagonists and protagonists in both sides. This creates a sense of enjoyment of being able to pick one over the other. The main character, Touma, is smack dab right in the middle of it, so the watchers are stuck in the rift along with him between the two. Touma's power defies both the science and magic side with his right hand, which is able to nullify all supernatural forces, science developed, or magically casted.The anime shows a lush variety of things, some essence of a old beat em' up street fight concept, an extensively detailed, brilliantly pieced together and factual science concept, and a riveting back story and the many varieties of religion and it's capabilities of power on the magic side, and very elaborate concept all around every element of this story. This includes each individual character's powers, personality, and background, and also the settings have amazingly in depth concepts and details. There are many things to take in, and times, entertainingly complex as well, rather than just sitting there and watching what happens as a simple show. This anime is able to fuse comedy, romance, action, and suspense mind boggingly well, with each concept having a nice depth of detail to it. The character interactions are genuine and unique for each individual. It's almost as if there are 3 stories in one, the magic side's story, the science side's story, and Touma's story. But, you could even create a story for many of the other characters,(Railgun and many other side stories do exist because of this) that's how detailed and elaborate it is.\\n",
            "date": "2013-05-22T23:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 98101,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/poketurtle",
                "username": "poketurtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=98101"
        },
        {
            "content": "yeah there is very cool anime for me...\r\ni very like the art...\r\nlike science and magic, level 6 project, multi skill, saint, majin, and anythink.\r\nand i very like the people create it...\r\ni don't know why he make anime with the very good art...\r\nand, i so will be wait about the third series to aru majutsu no index spring tommorow...\r\nhow i know spring tommorrow the 3rd series to aru majutsu will be release?\r\nbecause the issue in the wiki to aru talk it...\r\nthat is my review..",
            "date": "2013-12-24T15:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 125411,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2701033.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Luki_Shirinkato",
                "username": "Luki_Shirinkato"
            },
            "url": "https://myanimelist.net/reviews.php?id=125411"
        },
        {
            "content": "the end scene of episode 22 brought this whole series up from an 8 to a 9 and i am strongly considering a 10 simply based off of the story and especially the ridiculously amazing voice acting for accelerator. this is all that need be said. you're welcome.",
            "date": "2013-08-31T11:28:00+00:00",
            "helpful_count": 0,
            "mal_id": 111731,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1811069.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dayslikeours",
                "username": "dayslikeours"
            },
            "url": "https://myanimelist.net/reviews.php?id=111731"
        },
        {
            "content": "Toaru Majutsu no Index 1 was just fantastic. The series never went out of my head for like two months or so. And now we have a second season. Fantastic!\r\nAll fans just end up getting on their PC, ready to download and by the end of the last episode, they go \"huh?\"\r\nIt's puzzling, disappointing and somewhat strange. The story takes place again at Acadamy City and this time, life gets a bit more serious for Touma, as the Catholic Church is pissed at him.... really pissed. Plus, Accelerator gets into something new...\r\nThat's enough and more would be a spoiler.\r\nArt, Sound, Character all those things areas brilliant as ever. Mind that the series has become a bit bloodier.\\n\\n\r\nBut besides the usual comedy and romance(?), the overall story arc is too ..... \"to be continued\"-ish? The story arcs conclude with a bit too many unexplained questions and cliffhangers. I know these things can make people want to see more, and indeed I'm really looking forward to the 3rd season, but it costed the 2nd season. The 2nd season is more of a \"bridge\" season.\\n\\n\r\nIt's as if you expected a juicy steak to come out, but you end up with a mushroom soup. Aww..... But the soup is the appetizer. TMI 2 promises a more exciting adventure in the future and if you are a fan... yes, you should watch the series, get puzzled and wait for the 3rd season",
            "date": "2011-10-07T08:22:00+00:00",
            "helpful_count": 0,
            "mal_id": 45005,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hangbin9",
                "username": "hangbin9"
            },
            "url": "https://myanimelist.net/reviews.php?id=45005"
        }
    ]
]