[
    [
        {
            "content": "Here's a multiple choice question before I begin talking about this series:\r\nWhat would you do when your carefree life is suddenly being thrown into unsettled chaos when three girls, a middle-schooler, a fifth-grader, and a toddler wants to be under you care due to an unprecedented tragedy?\r\nA) Call the cops\r\nB) Try to find another babysitter\r\nC) Slap yourself twice and tell yourself that this is all a dream and you'll wake up soon.\r\nD) Take responsibility, learn about the value of family life, and take care of them\r\nIf you choose D, then kiss your carefree life goodbye and hello to responsibility of being uncle, big brother, andfather all at once.\\n\\n\r\nJudging by the title of the series, there's not much to expect and could seem to be quite predictable. \"Listen to me Girls, I am Your Father!\" But let's face the music, here...how many of you actually listen to your parents when you were little? (I know, I didn't). And going from there, we have the first episode where at the ending, one of our main characters (Sora Takanashi) is caught with her pants down literally. Now, you're probably thinking about dropping the series at this point as it might turn into an \"ecchi\" series. Well, dead wrong.\\n\\n\r\nYou see, in this story, we have our main character, the carefree Yuuta Segawa (also known affectionately as \"uncles\" by our cute little Hina). Of course, judging by just that, we might have our \"kawaiiiii\" moments running through our heads. Then, we have the middle child Miu Takanashi who causes mischievious deeds throughout the series for \"uncles\" and Sora. And finally, who could forget our tsundere-like Sora? I mean, the first scene we see her with uncles gets her pants caught down literally! \\n\\n\r\nDespite all that's mentioned above, there is much more depth into this series than meets the eye. From a tragic news of the morning comes forth an unprecedented event that will change uncles' life forever. I mean, how would you feel if you certainly realized that someone you once knew disappear from the face of this Earth? \\n\\n\r\nWith the surprising turn of events, it is clear now that this series has a much in depth theme, the theme of responsibility and be someone you never thought you'd be: a father, an uncle, and a big brother. \\n\\n\r\nDespite this though, there are still those fan-service scenes popping up occasionally such as Sora's untimely undressing and morning wake up calls. Then, there is our Raika girl, the strange girl with boobs that makes Sora's look like marbles. At this point, some of our viewers may have pushed that \"dropped\" button on their anime list. With the common usage of fan-service we see in nearly God-knows-what % of anime we see these days, it's not surprising. However, if you watch the series carefully, you may notice that this series eventually shows its true visage. \\n\\n\r\nThat visage is being the emotional and drama side of the show. It is deep as the series progresses. It is emotional as we see some of the more vulnerable sides of our characters. It is dramatic in the way how events turns out to be. And it is reality, not a dream. \\n\\n\r\nSeriously, if you or most people were in Yuuta's shoes, it would of been something that you wish and wish was a bad dream and wake up to a morning coffee. But mornings will never be the same again with these three girls under your roof. \\n\\n\r\nBeyond that, there are also some insightful side characters of the series some of us may want to keep their eyes on. (not just our hot girl Raika) For instance, the lolicon Sako who's there for the comic relif, the ladies man Nimura that has some great chemistry with Miu, and last but not least is  Raika that skyrockets Sora's tsundere sense like no tomorrow. Despite her relatively short appearances, it is clear that her view in this series has touched the hearts and our minds (no, not just with her appearance) but by her interactions with the other characters.\\n\\n\r\nAs for the art and sound, I would say that both are just average and not award worthy of the year. I mean, it is just there. Of course, the light themed piano tone of the background occasionally does mix in with the series well but overall, not something I'll remember by for a long time. The art (like most 2010+ series) is presented well. However, there are those scenes where they background and obscene characters looks like computer generated graphics that leads to a turn off. \\n\\n\r\nOverall, I'd say that this was a great series that debuted so far. It has its good (the realism of taking care of people and becoming someone you never thought you'd be). It has its bad (the pointless fan-service and some blend character designs). And then it has the ability to make our viewers continue to watch through its drama that all started after an unprecedented tragedy. What originally thought by some viewers (you know who you are) to be a series that tried to get attention through common cliche instead became a series of a touching melancholy. Perhaps, responsibility changes people who they are from carefree to responsible. Perhaps, it is unprecedented events that leads to people to discover their identity. Or perhaps, it is the reality that most of us may face today in our lives that can be reflected upon from this series. But all in all, this series is something to keep an eye on (especially since it only covers roughly 1/3 of the light novels). Remember, responsibility is not a privilege, it is a right. Don't believe me? Just ask Peter Parker.\\n\\n\\n",
            "date": "2012-05-15T21:32:00+00:00",
            "helpful_count": 363,
            "mal_id": 61279,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=61279"
        },
        {
            "content": "If you plan to watch this anime with the assumption you'll get a lot of moe loli-fanservice, then you'll be sad to know that there isn't much of it.\r\nWhat you do get however, is a very deep, touching story, that's very thoughtfully written. It tackles a lot of different, difficult topics and approaches them in a very realistic manner. The result is a very sweet anime that breaks from the norm and is a great optimistic, thought-provoking watch.\r\nI won't say any more here as nothing much needs to be said. Watch with low-expectations (as I did at the beginning) and you'll be sure to havethem far exceeded. \\n\\n",
            "date": "2012-02-13T17:34:00+00:00",
            "helpful_count": 96,
            "mal_id": 53839,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/660485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scruff",
                "username": "Scruff"
            },
            "url": "https://myanimelist.net/reviews.php?id=53839"
        },
        {
            "content": "\"Family must not be separated, they must be together\" - Segawa Yuuta\r\nRaising a child isnt an easy matters, even for parents. Sometimes we must realize that if we're in our parents position and what do they feel when taking care of us, of course it isnt an easy things to do. So, can you imagine if we're a college student but at the same time we must taking care for 3 children? Segawa Yuuta knows the answer.\r\n------------------------------------------------------------------------------------------------\r\nSTORY 9/10\r\nThe story begins with Segawa Yuuta as the Main lead, he is a freshman of a university. His parents passed away while he was young and he gotcared by his own sisters. and One day, he is visiting to his sister's apartement because he got asked to take care of her three daughter while Yuri (his sister) and her husband were on trip. and then the problem occured, His sister and her husband got a plane crash during the trip, and so, the three daughter will being live separately because of the family want they do so, and to prevent that happen, Yuuta decided to take all the three girls and live with them.\\n\\n\r\nIf you have watch Usagi Drop, then maybe this will kinda remembering you. a man adopted girls (but in Usagi Drop there was just one girl) because he is kinda sorry about what happen with her and back to the Papa no Iukoto,  the story is focussing on their life like what you're gonna do with your life, since now you're taking care of 3 children. you must thinking about their food, their school, and even their happiness, can you do that? So does this life story was BORING? NO WAY'D HELL. The story is really maginificent, the problem that occured each episode is real, quite logic and not exaggerating. There is no drama that is excessive, they're just life or we can said more common life problems\\n\\n\r\nFor me, every each episode in Papakiki so tear jerking moments. I couldnt help to shed my tears. and honestly, while watching this i must have handerkerchief on my side (kinda embarassed). Because the way how this anime tells the story is really touchy. The slow paced story that this anime brings really increasing the atmosphere.\\n\\n\\n\r\nART 8/10\\n\\n\r\nThe art in this anime is really colorful and bright. The characters design is quite attractive and simply charming.\\n\r\nOne anime comes to my mind while watching this anime was \"Mayoi Neko Overrun\", the art is so similar between this two anime, the girl is depicted cute. they use so many colour in the art (like three different colour hair in Takanashi sisters), and with this of course, the viewer who're watching this will never feel dull about this anime and more, the scenery or background is really good, like that i said, so colourful and i presume , it brings the atmosphere is cheerful and happy.\\n\\n\r\nBut with this art, its didnt really fit it with an heartwarming atmosphere. Colorful and bright coloring is more suitable if the anime is focussing on cheerful and happy moments. However, its not quite a problem since we might be distracted by how beautiful and colorful this art was.\\n\\n\\n\r\nSOUND 8/10\\n\\n\r\nAgain, i am surprise how good the seiyuu was in this anime. especially for Takanashi Hina's voice. the sound was so childish like any 3 years old girl and more, the other Seiyuu like the seiyuu for Takanashi Sora is really talented, while she was singing, the sound was clearly like a profesional singer. What i mean is, they really put their feelings into it, i was moved by how much effort that they do and the result like you can estimate, it was perfect.\\n\\n\r\nAs for OP and ED, honestly i more like to hear the ED song, i am not saying the OP was bad, but the ED song was really more fits with the anime. i dont know what make ED more fits with the anime, but i have feeling towards this ED song. it brings happiness yet sometimes it was sorrowful (mixed feelings).\\n\\n\\n\r\nCHARACTER 9/10\\n\\n\r\nThis probably what i loved the most from this anime, they really brings out the character. like the three sisters, they really unified with each other like the siblings must to be. and what make this series more interesting was of course, the little takanashi, Hina. We cant help not to in love with her. Cheerful and yet funny little girl. and that Hina itself that brings the atmosphere more lively and yet make the sad atmosphere, like when she asking where her mother and father is... if you're in Yuuta position, what will you said?\\n\\n\r\nNot just the Hina itself that appealing me, Every characters that appears in this anime (except someone, you will find it in below) was the real reason too why i love the character in this anime, here is the summary for each character (especially Takanashi sisters and Yuuta) :\\n\\n\r\n- Takanashi Sora, maybe the most character that have so much appearance in this anime, this character was lovely. As being the oldest sister between the three, she trying so hard so the other sisters will be like her and yet her shyness and tsundere toward Yuuta was reasonable, you will find it why i am not gonna spoil it.\\n\\n\r\n- Takanashi Miu, if there was a character that i love after Hina, it must be Miu. i am surprise how mature Miu was, toward her act even her manner. sometimes i thought Miu was the older sister. and yet, she is a mediator between Yuuta and Sora, since she knows that his older sister have a feeling towards Yuuta\\n\\n\r\n- Yuuta Segawa, i am impressed by how hardwork that he does for his niece (the three sisters), since he's just a student but he's also work for them and he really does it like a real man. Not wimpy character and even never give up. He can be a example for every man in the world. That the man must never give up. Do what you think is important.\\n\\n\r\n- Raika Oda, the woman that will makes you falling in love in her. it attractive and even Kuudere! , behind that, she is like Miu, mature in every ways.\\n\\n\r\nI want to give this section 10, but there is one problem that ruins it all. that is the president of SS club, pervert and even i dont know why he must appears in this series, as for me he doesnt give any positive to this and even ruins every scene if he is appear, if he never exist i thought that this anime will be more awesome.\\n\\n\\n\r\nCONCLUSION\\n\\n\r\nI have regret on this anime... it was.. WHY I DIDNT KNOW THIS ANIME SOONER? when i found this anime i was like found a hidden gem/diamond in many of mainstream anime. This anime is totally recommended for all people who loves heartwarming anime with a light story on it.\\n\\n\r\n*Feedback and comments are welcome*",
            "date": "2013-08-05T03:20:00+00:00",
            "helpful_count": 82,
            "mal_id": 108289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=108289"
        },
        {
            "content": "Man, what the hell is an \"Ecchi\" tag doing on this anime?\r\nThis anime has all the components of a successful emotional anime. It deals with the themes of loss, family and survival in a mature way and can make you tear up at more than one point, while portraying daily life of the protagonist with a sense of realism and without the tropes found in many anime.\r\nIf there was no \"but\" following this anime might be considered a mini-Clannad by those who viewed it. \r\nBUT\r\nThe writers inexplicably decide that a show about loss, family and perseverance is somehow the  right time to add run-of-the-millpantie shots and incest humor. It's as perplexing as it is infuriating.\\n\\n\r\nNow don't get me wrong. I am a... purveyor... of many a pantie shot and clumsy-airhead-girl humor bit. I don't immediately cry \"FANSERVICE\" and dismiss an entertaining anime. But I still have no need to have a tear in my eye as we watch a three year old learn the cold facts about death, and then ten minutes later watch a 12 year old tsundere's older cousin complex.",
            "date": "2015-02-11T09:14:00+00:00",
            "helpful_count": 74,
            "mal_id": 180140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4454087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/milkblob",
                "username": "milkblob"
            },
            "url": "https://myanimelist.net/reviews.php?id=180140"
        },
        {
            "content": "I just want to say that I am really happy to see that this will be getting 26 episodes. It is really vibrant and cute.\r\nThe story revolves around our main protagonist who has to take care of his sister's 3 kids (although 2 of them are not blood related, they came from the sister's husbands 2 previous marriages, so technically none of the girls are related to each other).\r\nI started reading this manga a few weeks ago and I was SO happy to see that this season would have the anime version of it along with other great series (Zero no tsukaima, Youko x BokuSSS, Highschool DxD and I think there was one more).\\n\\n\r\nStory: 10/10. It's a cute story where the uncle enjoys his daily life with the 3 kids and they all become a happy family. I don't want to spoil anything so I won't say why it's a Harem genre (but you can probably tell already).\\n\\n\r\nArt: 10/10. Seeing how this is a 2012 anime the art has to be good, and it really is. The details they put into the characters are really something. For instance, when yuuta walks into the room of one of the girls changing the red blush on her face/body is really noticeable. That's one thing that really stood out to me.\\n\\n\r\nSound: 10/10. I don't recall the OP but I listened to the Ending and it's really cute and sweet. I tend not to watch OP/ED since the show is already over or you just want to heart of the show, not the OP lol. There's only certain OP/ED I will watch (for instance Fairy Tails Ending where Gray is walking a path and reminiscing about the past, the music and animation is really nice so I actually watched it every time for that season. Also the OP of Mirai Nikki is AMAZING, the animation too).\\n\\n\r\nCharacter: 10/10. Your typical cute family harem comedy. It's very nice and the 3 girls are very charming and have great personalities. Yuuta starts off as a typical \"why the f*ck do I have to watch these 3 kids when I just want to be a normal college kid\" (BUT IT'S A VERY MILD CASE).\\n\\n\r\nHe's not a douche about it. He cares for the girls and I don't want to spoil anything but if you've read the manga you know that he goes out of his way a lot to make sure that the girls are all happy and comfortable.\\n\\n\r\nEnjoyment: 10/10. If you enjoy cute/family comedy harems then this is a great show. It's not a hardcore incestual/lolicon harem show at all. It's just a cute little comedy that brings people together :)\\n\\n\r\nOverall: 10/10\\n\\n\r\nGreat show. Great everything. I look forward to the next 25 episodes.\\n\\n\\n\r\nI probably won't have to update this in the future since I've already read a bit of the manga so I know what happens sorta. Please enjoy the show if you do watch it :)\\n\\n\r\nThanks for reading",
            "date": "2012-01-11T10:14:00+00:00",
            "helpful_count": 45,
            "mal_id": 51535,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=51535"
        },
        {
            "content": "**Warning: Contains minor spoilers**\r\nIf you want a comedy that's full of ecchi fan service involving children as well as loli vibes throughout the anime, look no further. You've found what you are looking for. If that's not something that would interest you, I don't recommend this anime. If you're still on the fence about it and/or want to hear what I have to say, then please read the rest of my review. \r\nSound: 6/10\r\nThe voice acting was fine and the music was appropriate. Nothing special, though, and nothing really stood out to me. There were some cute moments when they were singing, but otherwise it'sforgettable. The voice actors did a good job of portraying their characters, so I have no complaints on that score either. \\n\\n\r\nArt:  6/10\\n\\n\r\nThe art always felt familiar, like I'd seen it somewhere before. Then I realized that (in my opinion at least) Sako looked exactly like Kouta Hirano from Highschool of the Dead. Sora looks similar Haruhi (The Meloncholy of Haruhi Suzumiya). Hina looked like a mini version of Taiga (Toradora) with black hair. Nimura looks like Koizumi from Haruhi Suzumiya. Miu's looks kind of remind me of Asuza Nanako (K-on).Etc...Seriously all of them look like the replica of a character from a different anime. While the art was beautiful, it still felt very unoriginal. \\n\\n\r\nI also found it annoying that Yuuta is supposed to be a college student, yet he looks the same age as 14 year old Sora. in the anime Yuuta is 18, making him 4 years older than Sora, so way does he look her age and sometimes younger than her? There are also times I feel that they made the 10 year old, Miu, look older than she was. Same with Hina. She looked more like a five or six year old than a three year old. I suppose if they drew people to match their ages, then the comedy and acceptance of that comedy wouldn't work as well? I don't know...moving on....\\n\\n\r\nStory: 3/10\\n\\n\r\nFirst, let me say that I have not read the manga, nor do I intend to, so this is all based solely on my impressions of the anime (and the three ova). \\n\\n\r\nWhat makes this anime so sad is that it had such great potential. As the synopsis states, it's a about an 8 year old college freshman who takes in his three nieces (two of which aren't blood-related) after his sister and her husband's plane goes missing (and they are presumed dead - which they are). Sounds like it could be a really good anime, right? That's what I thought too. I was wrong. It was far from being a great anime, or even good or average anime, which is a shame. \\n\\n\r\nThis story truly could have been something great. The premise was a good one and I wanted to see it develop into something deep and meaningful (even with the genre of comedy attached to it). This simply was not to be as the powers that be ruined it with unneeded and tasteless fan service, along with some characters that were better off never being in the show given their behavior and how said behavior dragged the show into the dirt. I understand that this is a comedy and they were trying to be lighthearted, but I just felt it was done poorly. Very poorly. \\n\\n\r\nThe fan service was way to much for me to handle considering the premise of the show. I feel that this anime should have an ecchi lolicon warning label attached to it, so people can know about that aspect before going into for people (like me) who tries not to read reviews before watching the anime.\\n\\n\r\nLet me warn you: There are A LOT of bath scenes. There are also plenty panty shots, boob shots, etc...a good majority of which center on the little girls (ages 3, 10, and 14). I didn't care for this aspect of the anime. Maybe it's because I'm a mother of two young children myself or maybe it's because I simply don't think little girls should be sexualized. Either way, the fan service added nothing meaningful to the plot and ended up leaving me feeling as if I had just seen something I had no business seeing. \\n\\n\r\nTo add insult to injury they just had to add pedophilia to the mix . Because what ecchi lolicon anime would it be without a pedophile(or two) that no one is really bothered by? That's what that particular tv trope (the lolicon trope) is all about, after all. \\n\\n\r\nHowever, I didn't find it humorous. It had the complete opposite effect, actually. When that aspect came to life, I lost interest in the anime and simply watched it just to say I finished it. Using pedophilia as a joke isn't funny to me at all. So not only did it have a lot of ecchi fan service of young girls, but also pedophile elements that we were supposed to find amusing. I am not amused. Not to all. \\n\\n\r\nIt didn't help that the woman, Raika, struck me as being something of a pedophile herself. I can't be sure if her love and affection for the girls is platonic or not. The OVA seems to suggest something more (for some weird reason one of the OVAs seemed to turn all the girls in the show into some type of pseudo-lesbians).  Innocent or not, Raika's behavior was no easier to shallow than Sako's disturbing behavior towards the girls. Both of them had an unhealthy obsession with them that, again, seemed to bother no one, yet bothered me as a viewer greatly.  \\n\\n\r\nCharacters: 3/10 \\n\\n\r\nOutside of the pedophile aspect of some characters, two more examples of useless characters in this anime are the landlady's daughter who tries to evict them simply because he took in his sister's kids, and Raika (her loli moments aside) was someone I just never understood and never found funny. Maybe I just don't get the humor in this anime? I mean, who would try to evict someone for attempting to do the responsible thing? While the anime tried to explain her harsh behavior, the execution was done badly and to be honest, every time she was on screen I couldn't stop getting distracted by how she was practically the glasses-wearing version of Karan from No. 6 (anime). \\n\\n\r\nAs far as I can tell the friends (Raika, Sako, and Nimura) contributed next to nothing to the anime and often were shown in a poor light when they were given screen time (though my definition of poor light may vary greatly from yours). The only one of the three I found even remotely likable was Nimura, but even so, the way everyone thinks these kids are cute and practically seem to fall in love with them is a put-off. Even if Nimura's true intentions are innocent, sometimes it just doesn't feel that way. In reality, it makes me question if everyone in the show is a lolicon in some form or another. \\n\\n\r\nI also hated how the girls always said that Yuuta lacked delicacy. I didn't see that. If anything, they should have been more understanding of him and realized that more often than not they were at equal fault whenever something happened that put them in an awkward situation. \\n\\n\r\nI found it annoying that Yuuto had taken them all in so the sisters could stay together when no one else would do that only for them to treat him so badly because he was a boy. I get that they are young girls, but there's a limit to how childish you can be. Yet Yuuta never chastised them for it and went along with their whims, which bothered me even more as he's supposed to be the adult. Instead, he allowed them to treat him like an inferior and even apologize to them when he'd done nothing wrong. \\n\\n\r\nExample: when Yuuta offered to help Sora with her luggage because he was afraid she'd fall. She refused and, go figure, she fell down the stairs. When she fell the clothes in the luggage went flying and he accidentally picked up her panties. She gets embarrassed and slaps him, for which he apologizes. I'm sorry, but how was that his fault? I didn't find that funny, I just found it stupid.\\n\\n\r\nAs for character development, I didn't really see too much. While it was definitely there, considering the premise of the anime, a lot more character growth should have taken place. Instead serious events or issues that would have helped them grow as people were often glossed over or ignored for irrelevant material that has no business being in an anime centering on children for the purposes of comedy or whatever it was the creators thought to do with it. \\n\\n\r\nEnjoyment: 3/10 \\n\\n\r\nI enjoyed the anime until the point that the bad humor and excessive fan service became too much for me to continue enjoying it. As already stated, the excessively ecchi fan service and the lolicon vibe of the anime made me feel uncomfortable while watching this. They are little girls. There's nothing funny about lolicon in this situation (or any situation really). \\n\\n\r\nI can't imagine any normal person wanting to see little girls taking baths or seeing their panties or boobs or naked skin. They are kids. That's not cute. This is what really ruined it for me. Even with a good plot, there was no way I could force myself to enjoy it. I ended up feeling very disconnected from the characters and the anime the more I watched and was tempted to drop it a couple times. \\n\\n\r\nOverall: 5/10\\n\\n\r\nDespite the good plot, I did not like this anime. The humor was distasteful and the use of fan service in regards to little girls made me uneasy. I feel that a great plot was largely ruined for worthless tropes that lowered the anime from something that could have been great to barely tolerable. At times, yes it was cute. At times, yes, the plot was wonderful. Sadly, it wasn't enough nor am I able to overcome my own personal bias to rate this higher. \\n\\n\r\nIf you don't mind kids being used as ecchi fan service material and pedophile tropes don't bother you then you should do fine with this anime. In fact, there's no reason you wouldn't love it. However, if things like that bother you as they do me, then I suggest skipping this anime, no matter how tempting the premise is. Had I known before startinf the anime about these details, I would have skipped it myself. It's just not worth it.  At times such as these, reading some of the reviews before watching can really go a long way.\\n\\n\r\nWhile I understand this is just an anime and that I probably need to lighten up, I can't find it in me to do that. Therefore, my score of 5/10. That's the best I can give it, based purely on the premise (that was wasted), the sound, and the copy-cat art that reminds me keenly of other anime, sometimes to the point of distraction. \\n\\n\r\nIf I was going to rate this as I really want to, I'd give it a three out of ten, but I'm not going to be that cynical. It did have it's good moments and it wasn't necessarily a bad anime. I'm sure there are many people who would (and do) love it and find it fun to watch. I am not one of them. That's not saying that the anime sucks or that I have poor taste. It's just that in this instance, I found that I simply couldn't enjoy it personally. So again, 5/10 is the best I can do in my overall rating and even that is being too generous in light of my personal qualms with the anime.  \\n\\n\r\nI hope that this review was helpful to you. Thank you for reading it. \\n",
            "date": "2016-03-05T05:28:00+00:00",
            "helpful_count": 32,
            "mal_id": 212285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554945.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Midievalfantasy",
                "username": "Midievalfantasy"
            },
            "url": "https://myanimelist.net/reviews.php?id=212285"
        },
        {
            "content": "If you have ever fantasized about what would happen if suddenly you became the guardian of 3 little girls out of nowhere, then this might just be your anime. \r\n|Objective Review|\r\n|Story/Plot|\r\nThe overall story is very well organised and presented throughout the whole series. The core idea is presented and developed at a great pace, maintaining variety. While the main idea might not seem too interesting at first, Papa still makes it exciting. Papa puts the characters to great use to make sure the flood of problems stay fresh and varied. Though there are a couple of flaws here and there (see at Characters). The animeending is not particularly great, but it can be forgiven if you watch the OVA and specials which give it a proper ending.\\n\r\nScore - 7 (9 with OVA and specials)\\n\\n\r\n|Comedy|\\n\r\nExpect to see some minor comedy in the anime. Nothing too spectacular, it's just there to spice things up. However, the jokes can become repetitive and boring after awhile since they use the same concept and ideas for jokes. \\n\\n\r\n|Characters|\\n\r\nThe characters are the most integral part of Papa and it succeeds to deliver. Almost all of the main characters are great, none of them are shallow characters. They all have deep/multi-layered personalities and they made them feel real, making it easy to like them all. \\n\r\nThe supporting characters on the other hand are very-very supporting characters. Most of them are just one of the basic stereotypes and don't really show anything beyond those. \\n\r\nAs the series go, the main characters build deep bonds and their character develop into more depth. My only concern was the lack of attention for Miu both in terms of connections and character development. The same goes for the support characters.\\n\r\nScore - 8\\n\\n\r\n|Art|\\n\r\nThe art is one of the best ones. Not really because it's beautiful in art terms, but because it complements the story and ambiance so well. It's bright, heart warming and cute. It really helps you ease into the mood of this anime.\\n\r\nScore - 9\\n\\n\r\n|Sounds|\\n\r\nThe voice acting was pretty good in my opinion. There was character to them, i could feel the emotions behind them. As far as the music goes, i think it was good, but nothing outstanding. However, it still goes well with the heart warming charm of Papa.\\n\r\nScore - 7\\n\\n\r\n|The whole package|\\n\r\nAs i have already implied, the audio-visuals just work so greatly together and Papa really has a great ambiance to it, which i can only recommend. All in all, if you would like to see how a \"newly-born\" family bonds over while overcoming all hurdles, melting hearts with how cute and lovely it is, then this anime is for you.\\n\r\nOverall Score - 8\\n\\n\\n\r\n|Subjective part|\\n\r\nFor me, who always wanted to have a loving family environment, where i felt comfortable, this anime was just incredibly heart warming for me. It really meant a lot for me, and seeing the family bond over all the issues was just an unimaginable dream for me. Not to mention the characters... They were all extremely lovable and i could really put myself into their shoes. Personally speaking i'm still disappointed by the lack of Miu content but oh well. But because of all these, the anime will always have a place in my heart and i will give it a \\n\r\nSubjective Overall Score - 10 (9 because of Miu)\\n",
            "date": "2017-08-27T17:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 256380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760738.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shattiiee",
                "username": "Shattiiee"
            },
            "url": "https://myanimelist.net/reviews.php?id=256380"
        },
        {
            "content": "Today I’ll be reviewing one of Sentai’s newest works, Papa no Iu Koto o Kikinasai! or PapaKiki for short. Much like the critically acclaimed Usagi Drop, this slice of life anime involves a young man whos world turns upside down when he finds himself a guardian due to unforeseen circumstances. Unlike PapaKiki, however, Usagi Drop was actually an enjoyable experience. There are so many things wrong with PapaKiki, it was almost unwatchable for me.\r\n              The premise itself doesn’tseem too bad at face value. The main character Yuta is a college student who decides to take in his older sister’s 3 kids after she disappears in a plane crash along with her husband. However, this is where holes start to pop up. There is zero emotional impact with the disappearance because we barely got to know Yuta’s older sister at all and her husband straight up never appears onscreen. But it isn’t until the memorial service that things get REALLY ridiculous. After hearing that the sisters will be separated and sent off with different relatives Yuta takes a huge leap and offers to take them all in so they’ll be together. It’s a heartfelt idea, but ultimately unreasonable, right? Well apparently not because the adults LET IT HAPPEN. Forget the fact that the dude is attending college and working at the same time. Forget the fact that other, more responsible family members are willing to take in the young ones. Forget the fact that Yuta literally has only spent a couple days with the kids at that point. Nope, let em all stay in a cramped,one bedroom apartment. Needless to say, Hijinks ensue! Well, not really. \\n\r\n               The 3 sisters are 14 year old Sora, 10 year old Miu, and 3 year old Hina. Sora is a tsundere with a brother-complex..er..adopted brother…uhm father complex? Long story short she wants Yuta’s D , because whats an anime without incest vibes? Id mention more about her but besides the fact that she has a slight resemblance to Haruhi there IS nothing else to mention about her character. Miu is the most tolerable of the 3 even though she does fuck all the entire time. There’s one episode focused directly on her but she mostly just chills in the background. Hina however, is in my opinion, not only the most annoying character in the series but the most unbearable anime character in recent memory. With a voice that manages to be high pitched yet grating at the same time, her overly “cutesy” behavior, and her predilection for breaking out into “Twinkle Twinkle Little Star” (I swear to fuck she sings that at LEAST 60 times during the course of the series) Hina never fails to infuriate me just by being on screen. There are a few other characters but they’re so cookie cutter that I didn’t even bother to remember their names. There’s a beautiful girl who’s super popular in school but takes an interest in Yuta for no apparent reason even though she’s way out of his league. The good looking, womanizing best friend. And the fat, creepy, glasses wearing nerd…who’s also a lolicon. (of course)\\n\r\n             Animation and character design is bland and even downright confusing at times. For example, Hina has a full head of hair that goes down to her lower back even though she’s only 3 and all the characters seem to have permanent red marks on their knees and elbows. The fan service is also a problem. There isn’t nearly enough to satisfy the lolicon pervs but there’s still enough to get an eyeroll from the people who actually want to pay attention to the story. OP isn’t bad but ultimately forgettable. The ED however is damn catchy. An 8bit-like tune that reminds me of 90’s Gameboy games. Though in retrospect, the fact that the ED signaled to me that my 24 minutes of brain rape were over is also probably part of the reason I liked it so much. \\n\\n\r\nPros- Fat lolicon dude gets a few chuckles now and again\\n\r\n          Ending song is Ipod worthy\\n\\n\r\nCons- HINA\\n\r\n            Premise a bit too unbelievable\\n\r\n            HINA\\n\r\n            Full of clichés and character tropes\\n\r\n            HOLY SHIT, HINA DIEEEEE                  \\n",
            "date": "2013-07-09T23:55:00+00:00",
            "helpful_count": 20,
            "mal_id": 104675,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2255393.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Agmkreptile",
                "username": "Agmkreptile"
            },
            "url": "https://myanimelist.net/reviews.php?id=104675"
        },
        {
            "content": "Do you like anime about family bonding, growing up, and learning life lessons--then you should watch this anime. Family can be blood related or not as it doesn't matter. Family is a family. Its the time you spent with them that count and the memories you share.  I am reminded of another anime  Usagi Drop that has a similar feeling. Anyway on to the story--Papa no Iukoto wo Kikinasai! or Listen to Me, Girls. I Am Your Father!. is about Segawa Yuuta , a 19 year college student has to take care of his sister's 3 children. ( 1 of them is bloodrelated while the other 2 are not related)  One might think this is a harem/ecchi  type anime-(as stated above) deals with life lessons that everyone should learn from. \\n\\n\r\nArt/Characters \\n\r\nI say its good, everyone has their own unique feel and charm about them\\n\\n\r\nSound\\n\r\nOpening song is very touching and it shows the relationship between Yuuta and his 3 sisters. Ending song is cute- showcasing the 3 sisters- cute charm/appeal : ) One more thing--its really colorful : )\\n\\n\r\nEnjoyment\\n\r\nI believe yuuta and his 3 sister will have a very close bond. Everyone who enjoys slice of life anime that deals with life and learning life's preciousness lessons should watch this series. Give it a chance  :  )\\n",
            "date": "2012-01-28T10:56:00+00:00",
            "helpful_count": 15,
            "mal_id": 52745,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/834209.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnimeFan500",
                "username": "AnimeFan500"
            },
            "url": "https://myanimelist.net/reviews.php?id=52745"
        },
        {
            "content": "We're pushed into a story where it starts calm, then the sad part hits. To some, they might tear, I completely understand the motive behind each character's decision, but it really doesn't drag me into the main story much as I didn't care for the characters that much during the beginning, I had enpathy for them but caring was still lacking.\r\nThis isn't a AAA+ action anime, it's realistic modern day Japan, so all the actions or... most of the non-sexual ones seem logical to me. The jokes are funny at first but they're overused way too much throughout the series. \r\nThe three sisters are allcute, a tsundere, a toddler and the pretty one, all lolis of course. But there comes a time when their actions also become overused, with the exception of Mia, the pretty one as she is slightly less predictable than the other two. The incest related relationship seems at first uncomfortable to me, but as the story progress I grew... not attached at all but more accepting of it. The sexual joke scenes seems awkwardly placed, kinda enjoyable, but it just made attachments with characters slightly loosen and I couldn't take the serious scenes completely serious. You have two female characters that you meet... and you will most likely not care at all for them as they have less than five minutes of screen time in the entire series even though they have a slight side effect to the main characters. There's also another female character, she's supposedly has the best body out of all the female characters, however her body hardly seems different from the two other female characters if you know what I mean. She appears in almost every episode and no one knows what her motives are or why she possesses an interest in the main male protagonist, the type of interest isn't even determined either. The show is mostly about the male protagonist but the scenes where he's at work or college seems like the most pointless scenes.\\n\\n\r\nThe anime sports a lot of cute but random occurences, it's hard to get into, but I managed to be able to get into it. The sad or bad moments are painfully predictable and when they actually come, I didn't feel surprised at all at the timing, I only just wonder \"What kind of trouble are they in now?\". I only feel a little bad at their reactions to the situations, I didn't shed a tear.\\n\\n\r\nWith situations resolved I feel only a little happy for the characters, then the ending music plays and I feel that it multiplies that happy feeling much more. I love the ending so much, both the animation and the music.\\n\\n\r\nThis isn't an overly fantastic anime, it had a lot of potential but a lot of holes appear in the plot. Plus a lot of pointless characters... but those pointless characters add to the realism in a way because in most other animes every single character is friends with each other, this anime shows slight realism that shows that not everyone know everyone else because they're linked. The characters also seem to become attached too quickly, it takes one episode for a character to become best friends with another, or a certain five minute moment makes a girl fall in love with a guy for the rest of her life. They could of had a lot of plot twists in this anime that would of made it way better, but it isn't and it makes it painfully predictable and not surprising at all, mixing with strangely timed fanservice, it all ruined attachment to characters. If you happen to get into it, it's great and enjoyable to watch, if you can't you're looking rock bottom as they'd say.\\n",
            "date": "2015-06-23T22:57:00+00:00",
            "helpful_count": 12,
            "mal_id": 191096,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4694678.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/RedFlamedArt",
                "username": "RedFlamedArt"
            },
            "url": "https://myanimelist.net/reviews.php?id=191096"
        },
        {
            "content": "Papa no Iukoto wo Kikinasa is something as close to a Masterpiece as you will find in an Anime Series.\r\nIf you read the description on what this is about, or translated the title that in English means \"Listen to Me, Girls. I Am Your Father!\" \r\nYuri and Shingo are going on a Honeymoon when their plane hits bad weather and crashed, Killing both of them.\r\nTheir 3 kids now have no parents, Would you a College student, have the guts, the courage to stand forth after hearing that the 3 girls would be split up, To take matters into your own hands?\r\nIt takes a special kidof person, and that is Segawa Yuuto, He stood up to the family members and said he wants ALL 3 and will look after them.\\n\\n\r\nCharacters:\\n\\n\r\nYuuto for one you see a change in him, he has to go from a careless college guy, so a person that now cares for 3 girls, works extra jobs and does college as well, you can see the pressures and the strains this can cause, He becomes a MAN during this time, and its sooo easy to see, even the girl he has a crush on can see the change in him, a good change at that.\\n\r\nFor the other characters they are perfect, From the 3 kids, Hina is the one that makes this series, she is 3 and thus comes alot of innocence, but this innocence can sometimes be very funny and amusing, then it could be Heart warming (When she wants to learn something to show Mummy and Daddy when they are back) and the next terribly sad.\\n\r\nEven the sub-characters are amazing and portrayed perfectly, they fit the show and help out when they can, but are NEEDED, Friends can help you in life, and this series shows that.\\n\\n\r\nArt:\\n\\n\r\nIs Sublime, One of the better looking series i have seen in a while, Even down the little quirks they give Hina (3 Year Old) is soo cute.\\n\\n\r\nSound:\\n\\n\r\nVoice's REALLY fit the characters, a perfect job there, only downside is the music was good nothing that was incredibly memorable though.\\n\\n\r\nOverall:\\n\\n\r\nAll i need to say, Is watch this series right away, Its something Special, One of the best series i have seen.\\n\r\nI have been thinking of Lines and Lines to say about this, But there is no need, To sum it up, Everything is done in a sublime fashion, and you will miss one of the best series around if you don't watch this.\\n\\n\r\n(Soooooooooooo Wish for a Season II) :(\\n\\n",
            "date": "2012-10-26T17:48:00+00:00",
            "helpful_count": 11,
            "mal_id": 75987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1514017.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lukas10",
                "username": "Lukas10"
            },
            "url": "https://myanimelist.net/reviews.php?id=75987"
        },
        {
            "content": "Papa no Iukoto wo Kikinasai! A somewhat difficult show to review. Decent premise, some good characters, pretty art, but still doesn't really convince me it worked as a show.\r\nThe story is a relatively interesting premise. Yuuta ends up taking in 3 of his nieces after their parents die, to stop them going off to different homes and ultimately being separated, he feels so strongly about this because his older sister and the mother of the youngest niece raised him when their own parents died. As you may have guessed from the last sentence Yuuta is only blood related to one of the girls.\r\nThe biggest issuei have with this show is that it tries to draw upon far to many ideas and genres, for a half series to really succeed with any of them. Sometimes it wants to be a slice of life drawing upon all the hardships of a poor college student trying to raise 3 girls on his own, other times it pushes lots of screen time into Yuuta's college life, mainly the strange club he joins and the love interest there with Raika, other times it wants to run with the oldest sister Sora having romantic feelings for Yuuta, and heads down the whole possible incest route. Then it remembers it could just flood the show with fan service and cute moments. The way the theme changes often several times in any one given episode makes it very difficult to really get into the show, given you'll probably like 1 or 2 aspects and be unhappy when it strongly overplays the others.\\n\\n\r\nIf you look at some of the more popular shows with this sort of subject matter most of them succeed by largely focusing on one theme and running all others as small scale extras, Usagi drop quickly jumps to mind, for keeping its focus to great success.\\n\\n\r\nI liked the characters, the youngest sister Hina is cuteness overkill, Miu is crafty and wise well beyond her apparent age of 10, and Sora the oldest sister is semi in love with Yuuta, which will appeal to some.\\n\\n\r\nArt is pretty good, i'm genuinely excited Feel are doing the new Minami-ke based on this showing. Art is distinctive, bright and generally well drawn.\\n\\n\r\nIn conclusion this sounded a great idea, that didn't really come off with all the demographics it's tried to cater for and squeeze into a relatively short run time.\\n\\n",
            "date": "2012-12-02T13:59:00+00:00",
            "helpful_count": 10,
            "mal_id": 78986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=78986"
        },
        {
            "content": "\"Tinkel, tinkel, lilel stal\"\r\n\"How I wondaa wat chu aar\"\r\n\"Up above zaa wald so hay\"\r\n\"Rayk a daymond in za sky\"\r\n - Takanashi Hina\r\nFirst of all, I would like to announce that I'm an idiot for not finding this animation sooner, which is one of the better manga series I've read. For Pete's sake, I'm late for about three years. No use crying over spilled milk.\r\nI write this review assuming you've watched the series. Worry not, it doesn't contain any spoilers. Oh and a little more, I've been writing a lot of reviews on MAL but I didn't read one of the guideline, \"Don't include story summaries,users already have the synopsis written for them.\". I am ashamed of what I've been doing.\\n\\n\\n\\n\r\nGreat job, dummy me.\\n\\n\\n\\n\r\nSTORY 9/10\\n\r\nTo be frank, I wasn't expecting any serious plot about Papa no Iukoto when I read it on 2009. I thought, \"Lookie, lookie! Another harem series full of fan service and with three lolis in it!\" (Loli lovers raise yer hands!).\\n\r\nAfter reading a few chapters of it; my perception about it instantaneously changed. I felt guilty judging it hastily.\\n\\n\r\nPapa no Iukoto wa Kikinasai's offers a different--- a heartwarming story which I find very entertaining. It's a little bit tragic. Good thing the series focused more on the cheerful side of the story. It tells us about responsibility. Well, technically, no one would do this kind of big--- I mean, ginormous responsibility in real life.  A 19-year-old kid taking care of three girls (two lolis and one adolescent girl, yes, I needed to clarify that) while studying at a university? Man, you have to be a superhuman to do that. Fortunately, this is just a show.\\n\\n\r\nWe all know how hard it is, but nevertheless, Yuuta (MC) tries his hardest to take responsibility for the three girls. Yes, it's foolish. But for Yuuta, family's the most important thing. That's why he tries his hardest to provide for the three girls. Bearing this big of a responsibility is like climbing a tree, with just one arm. It might seem impossible, but with great effort, it's still doable.\\n\\n\\n\r\nHonestly speaking, Papa no Iukoto's a lot better than most of the series that I have watched. Storyline wise, it's one of the best. Not too much drama in it; but nonetheless, was still enough to bring a tear or two to my eyes.\\n\\n\\n\\n\r\nArt 8/10\\n\r\nThe art is superb! Detailed characters, good background, and uhh--- okay, enough trying to be an art expert. Like I've been saying in my previous reviews (dumb reviews), art that doesn't please the viewers these days are a rarity. And Papa no Iukoto's not an exception. The art is great, period.\\n\\n\\n\\n\r\nSOUND 9/10\\n\r\nOh my God. Kitamura Eri and Horie Yui for seiyuus? Heck, yeah! I immediately recognized their voices the first time I heard them.Takanashi Hina's (the smallest girl) seiyuu has done a great job too! Being able to voice a three-year-old girl is no easy feat, and she did it with flying colors. Other seiyuus were perfect for their characters.\\n\\n\r\nFor the OP and ED. I. LOVE. THEM. BOTH. OP's done by Kitamura Eri; and the ED's done by Horie Yui!\\n\\n\\n\\n\r\nCHARACTERS 8/10\\n\r\nCute--- no, fantastically cute! The designs on the girls were great. Especially Hina, she's the cutest character here. Anyway, every character in Papa no Iukoto is good. They have their own unique personality, which is good. Even the supporting characters were designed perfectly.\\n\\n\r\nYuuta's a bit on the plain side, though.\\n\\n\\n\\n\r\nENJOYMENT 8/10\\n\r\nDid I enjoy it? Heck, I did! The slow development of the story didn't bother me that much. In fact, I liked it. Even though its a bit tragic, I love how simple the story has developed into. Every episode is filled with laughter, a bit drama, and heartwarming scenes.\\n\\n\\n\\n\r\nOVERALL 9/10\\n\r\nClearly speaking, Papa no Iukoto is one of the better shows out there. Its able to make you laugh and cry. It does not contain any heavy drama in it; and it doesn't have a complicated plot. We all watch to be entertained, no? It's just a matter of perspective. And if you happen to have the same perspective as I am, you'll love the show. Overall, it's a great show filled with cheerfulness and a bit of tragedy in it, just an itsy bit.\\n\\n\\n\\n\\n\\n\\n\r\nP.S.\\n\r\nIgarashi Hiromi, Hina's seiyuu, is a hentai seiyuu. She voiced Oni Chichi's Airi.",
            "date": "2015-01-18T09:37:00+00:00",
            "helpful_count": 9,
            "mal_id": 178361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=178361"
        },
        {
            "content": "I'm not one for reviews that are college-length dissections of anime so I'll try to keep my review short without leaving out much about how I see Papa to go for viewers.\r\nGeneralizing to three types of viewers:\r\n1. Those who can't stand fan service (disproportionate women, pedophiles, inappropriate comedy, etc) and want to see a PROPER story told (like me): I'll get to that in the end.\r\n2. Those who like a good plot and don't mind fan service: This anime is for you. I can guarantee you'll give it an 8/10 or more.\r\n3. Those of you who only care for fan service: This isn't a badanime for it, it's got a quite the range of it. I can't say much more because I hate that nonsense/ weirdo stuff.\\n\\n\r\nIn my opinion, Papa no Iukoto wo Kikinasai is nothing but wasted potential. It presents a great collection of issues and situations that could have played out to be one of the best stories ever told, but every time it started to blossom the animators RUINED IT with fan service (the kinds stated above). If it were not for the good moments that stuck to the plot, this would've gotten a 1/10 from me.\\n\r\nBut again, that is only my opinion. In the end, if you are on the fence about it, see where you fit in in the 3 categories of viewers and go according to that.",
            "date": "2015-01-21T00:10:00+00:00",
            "helpful_count": 9,
            "mal_id": 178660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4395543.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShadiiBoi",
                "username": "ShadiiBoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=178660"
        },
        {
            "content": "[SPOILERS AHEAD] Sorry, but in order for me to write an honest in-depth review about this anime, I feel as though some spoilers from both the OVA AND THE LIGHT NOVEL are necessary. \r\nStory: (I am only talking about the 2nd ep not the first, the first is more or less a filler, plain fan service) In this part of the OVA, Miu, Hina, and Sora's parents come back as harmless ghosts for one day after 4 years since the incident. The whole episode is seen from their point of view and in this episode we see a whole bunch of changes between everyone andeverything that occurred within the 4 years. \\n\\n\r\nWell after the outcry and the beggings of a 2nd season from the fans of this series, the studio gave us an OVA that is basically a translation of the final volume in the Light Novel. This was a HUGE mistake in my opinion. There should have been a 2nd season instead of 1 episode because the audience is suddenly introduced to MANY new things, and its just too much to take in! [THIS IS WHERE SPOILERS ARE IN] Especially the marriage between Sora and Yuta. WHAT? WAIT WHAT? Yep. The author pulls a COMPLETE USAGI DROP and makes the impossible happen with the ending. Now, for those of us who watched the OVA without reading the novel, its a complete \"What the fuck man?\" moment. Is this normal? What happened in the Light Novel that led up to this? Surely there must have been a good reason for Yuta to have married Sora instead of the beautiful Raika that he was so fit for. And after extensive research and readings into the Light Novel, I assure you that I am still going: \"What the fuck man.” In the Light Novel, turns out that Raika DOES like Yuta and starts to actively fight other heroines in order to get Yuta. Some of those Heroines include Sora, Miu (wat), Miu’s mother Sasha (wat), the neighbor across the street, and Yutas own college friend. Now, the light novels are not translated to the fullest, but tl;dr, Yuta ends up marrying Sora even though the girl of his dreams confesses to him.  \\n\\n\r\nNow, I do not want to instigate anything, nor do I want to judge other's perception of love, but this pairing was just preposterous. If you were to be suddenly in charge of taking care of your niece, since she was a pre-pubescent girl, in what stage of the relationship would you possibly have started to develop romantic feelings toward her? It does not matter that Yuta and Sora were not \"blood related\" the whole message that the first season taught us was that \"Family sticks together\" and this ending completely did a 180˙ turn. After having the audience hooked for 17 volumes, it is very insulting to be suddenly given an ending like this. It feels as though the author gives a final FUCK YOU to his or her fans. \\n\\n\r\nHowever, it would be very wrong for myself to judge this whole anime on this one part. The anime gives us a whole bunch of heartfelt, beautiful moments and it wouldn’t be fair for me to judge the whole thing based on the ending. But like I said, it was very disheartening to be seeing such an impossible and improbable ending happen. \\n\r\nI will be giving this a 7/10 because the ending really did provide the audience with the closure that they needed since the first season ended and it more or less gives off the same vibes that we’ve gotten from before.  \\n",
            "date": "2015-06-28T10:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 191613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3976287.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuzaki",
                "username": "Yuzaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=191613"
        },
        {
            "content": "Adapted into anime by studio Feel = This anime has feels. Papa no iukoto wo kikinasai, is a story based on Yutta dealing three siblings whose mother and father are missing (presumably dead) from plane crash. A story telling what it would feel without a family and how we would suffer without a family. Also how can we deal your siblings without your family\r\nStory: 8/10 \r\nIt begins with Yutta going to collage and then attending the night party which he then fell asleep, then Sako pretendly accuses him for harrasing Raika whose really not that emotional. That was a good part, then all the sadparts come through, his sister and her husband are missing in plane crash, making him tp take care the three siblings in his tiny apartment, lots and lots of thing happen there in his entire 12 episode life, from getting almost evicted to his apartment, Sora problems, Miu Problems, Hina problems, aunt coming checking by. Certainly it begin with sad plot but moving on you will have a heart feeling moments. \\n\\n\r\nArt: 8/10\\n\r\nThe art are decent, not too bright nor dim. Just right, perfect for the mood of the viewers, character designs were fine to me except for Yutta's hair but still it makes a perfect character trait for him.\\n\\n\r\nSound:8/10\\n\r\nAll those OST are tear jerking and some are relaxing. OP and ED was so energized \\n\\n\r\nCharacters:8/10\\n\r\nI think Yutta Seiyuu did well but he could improve more if it could show more feelings rather than Huh, Hah,Hee? The rest Seiyuus are fine to me since Sora and Miu VA are from Working!! And Chuunibyou\\n\\n\r\nEnjoyment: 10/10\\n\r\nAt first i don't feel like watching it but because of the storyline was interesting and heart warming, I enjoyed watching it. Nevertheless, it helps me to learn what family is all about. Thank you for having animes because anime do really bring some morals.\\n\\n\r\nOverall:8/10\\n\\n",
            "date": "2015-04-03T09:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 184598,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=184598"
        },
        {
            "content": "I am sure some producer in Japan watched Usagi Drop and thought \"This show would make a ton of more money if it only had more Moe!\". So he found a novel for LtMGIYF and turned it into an anime. Change the main character from a mature adult to the standard insecure College student, replace the one little girl with 3 fitting different stereo types and add in some quirky friends and neighbors to replace the more normal secondary characters in Usagi Drop.\r\nWhen I first saw this show on the list for winter, my first thought was \"oh, no! not more Tsunderes and Ecchi\". ButI checked out the first episode I was pleasantly surprised. There is really little to no Ecchiness (No panty shots, no nudity, no side boobs, some towel scenes and bare legs, but that is about it). All the girls ended up being being very polite and nice, if a little high strung. It still is a full tilt Moe fest however, and you should be prepared for that. In the end though, it is and adorable and entertaining show. It's sappy, sad, and humorous all at the same time. If you ever lost a parent at a young age, you'll probably cry your eyes out.\\n\\n\r\nIt's still early, but if you are an adult and liked Usagi Drop, you'll like this show, though maybe not as much. If you are a young, have a short attention span and mentally block out serious situations, you might even like this better than Usagi Drop.",
            "date": "2012-02-15T11:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 53935,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301927.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 3,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/grond",
                "username": "grond"
            },
            "url": "https://myanimelist.net/reviews.php?id=53935"
        },
        {
            "content": "The creator of Papakiki, Tomohiro Matsu, is a good person. (He has recently pass away, RIP) He would protect the characters from suffering and sacrifice the plot. \r\nUsually it's the other way, like Urobuchi Gen, writers would make the characters suffer in order to bring tension to the plot.\r\nSo is it a good thing? I really depends, I am not a person that cares a lot about plot so it's okay for me. \r\nPapakiki is a show that abandoned its plots for the reasons of love.\r\nThe story is not very good.\r\nThe premises is very good. If the writer really wants to take it seriously, ithas great potential.\\n\r\nHowever despite having a tragedy premise, the writer seems to keep preventing bad things from happening in the story. \\n\r\nPlot just stop developing every time it hit some heavy subject. \\n\r\nThis makes the show boring because nothing actually happened.  \\n\\n\r\nThe music doesn't fit too.\\n\r\nIts op is called ''Happy Girls'' even though it is about little girls losing both of their parents in an aeroplane accident.\\n\r\nThe ed is a piece of catchy electronic music which can destroy all the ''feel'' you've got from that episode. \\n\\n\r\nSo why do I like it?\\n\r\nIt is all about love and care.\\n\\n\r\nIt has one of the most likable cast of characters. \\n\r\nThe male MC is the most hardworking and responsible character I've seen in a while.\\n\r\nThe oldest girl is really mature and caring.\\n\r\nThe second girl is also very mature and has high EQ too.\\n\r\nHina is just pure cuteness.\\n\\n\r\nNo wonder why the MC, or the writer, tried to protect the girls so much.\\n\\n\r\nPapakiki is just a cute, lovable and really heart-warming show overall. \\n\r\nIt is not something spectacular with mind-blowing plot twists and have you crying for days. But if you want some to feel some love, you can give it a try.",
            "date": "2017-09-24T03:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 258473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6432186.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nbyung09",
                "username": "nbyung09"
            },
            "url": "https://myanimelist.net/reviews.php?id=258473"
        },
        {
            "content": "At first glance you might be hesitant on watching this because, you know, it's about a college boy having the responsibility of taking care of a few relatives. Although the idea of this might not sound so good to you it actually shows proficiency in the storyline, it's a bit shaking during the beginning though.\r\nStory: All I have to say is that if something like this ever happened to anyone, he would be the best to handle the situation. What would happen if you were a first year college student and all of a sudden you are now a guardian of 3 young relatives? Damn...The story is kept hold of pretty well. It shows the struggles that comes about and overcomes it with touching joy.\\n\\n\r\nArt: As an anime of 2012 I have to say I expected better character details but I can't be picky, maybe it's their budget cut or something I don't know, but the art itself (disregarding the year it was made) was done very well.\\n\\n\r\nSound: The sound is a near perfection, everything fits. The voices of each character seems to fit them perfectly, almost as if you would be able to meet them in reality.\\n\\n\r\nCharacter: Most of the characters are pretty cliche, although by that I mean just their character. What's not cliche is that different characters from different sections of anime come's together. You'll understand once you watch it.\\n\\n\r\nEnjoyment: Well this is my own opinion because enjoyment is something only you can experience, for me personally I think a young man taking responsibility of being a guardian is a pretty big deal in society so I wanted to see how an anime version would turn out as and honestly speaking it kept me interested. But there's not many people like me who enjoys these kind of anime. \\n\\n\r\nOverall: It was good, entertaining, and touching.",
            "date": "2012-09-24T10:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 73161,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1494197.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KnightsToFear",
                "username": "KnightsToFear"
            },
            "url": "https://myanimelist.net/reviews.php?id=73161"
        },
        {
            "content": "I'm 6'7\", and have a really deep voice. It takes a lot to make me cry, but this story got to me. I want a daughter, and this anime just made want 3. It has everything that captures a young girls innocence, crushes, and ways to deal with pain. I would also like to say that I am not a lolicon, but this anime makes me feel like being one. That sounded weird but it would make anyone feel even a little like that.",
            "date": "2012-08-02T14:40:00+00:00",
            "helpful_count": 6,
            "mal_id": 68475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1428131.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Guy_with_a_face",
                "username": "Guy_with_a_face"
            },
            "url": "https://myanimelist.net/reviews.php?id=68475"
        }
    ],
    [
        {
            "content": "Here's a multiple choice question before I begin talking about this series:\r\nWhat would you do when your carefree life is suddenly being thrown into unsettled chaos when three girls, a middle-schooler, a fifth-grader, and a toddler wants to be under you care due to an unprecedented tragedy?\r\nA) Call the cops\r\nB) Try to find another babysitter\r\nC) Slap yourself twice and tell yourself that this is all a dream and you'll wake up soon.\r\nD) Take responsibility, learn about the value of family life, and take care of them\r\nIf you choose D, then kiss your carefree life goodbye and hello to responsibility of being uncle, big brother, andfather all at once.\\n\\n\r\nJudging by the title of the series, there's not much to expect and could seem to be quite predictable. \"Listen to me Girls, I am Your Father!\" But let's face the music, here...how many of you actually listen to your parents when you were little? (I know, I didn't). And going from there, we have the first episode where at the ending, one of our main characters (Sora Takanashi) is caught with her pants down literally. Now, you're probably thinking about dropping the series at this point as it might turn into an \"ecchi\" series. Well, dead wrong.\\n\\n\r\nYou see, in this story, we have our main character, the carefree Yuuta Segawa (also known affectionately as \"uncles\" by our cute little Hina). Of course, judging by just that, we might have our \"kawaiiiii\" moments running through our heads. Then, we have the middle child Miu Takanashi who causes mischievious deeds throughout the series for \"uncles\" and Sora. And finally, who could forget our tsundere-like Sora? I mean, the first scene we see her with uncles gets her pants caught down literally! \\n\\n\r\nDespite all that's mentioned above, there is much more depth into this series than meets the eye. From a tragic news of the morning comes forth an unprecedented event that will change uncles' life forever. I mean, how would you feel if you certainly realized that someone you once knew disappear from the face of this Earth? \\n\\n\r\nWith the surprising turn of events, it is clear now that this series has a much in depth theme, the theme of responsibility and be someone you never thought you'd be: a father, an uncle, and a big brother. \\n\\n\r\nDespite this though, there are still those fan-service scenes popping up occasionally such as Sora's untimely undressing and morning wake up calls. Then, there is our Raika girl, the strange girl with boobs that makes Sora's look like marbles. At this point, some of our viewers may have pushed that \"dropped\" button on their anime list. With the common usage of fan-service we see in nearly God-knows-what % of anime we see these days, it's not surprising. However, if you watch the series carefully, you may notice that this series eventually shows its true visage. \\n\\n\r\nThat visage is being the emotional and drama side of the show. It is deep as the series progresses. It is emotional as we see some of the more vulnerable sides of our characters. It is dramatic in the way how events turns out to be. And it is reality, not a dream. \\n\\n\r\nSeriously, if you or most people were in Yuuta's shoes, it would of been something that you wish and wish was a bad dream and wake up to a morning coffee. But mornings will never be the same again with these three girls under your roof. \\n\\n\r\nBeyond that, there are also some insightful side characters of the series some of us may want to keep their eyes on. (not just our hot girl Raika) For instance, the lolicon Sako who's there for the comic relif, the ladies man Nimura that has some great chemistry with Miu, and last but not least is  Raika that skyrockets Sora's tsundere sense like no tomorrow. Despite her relatively short appearances, it is clear that her view in this series has touched the hearts and our minds (no, not just with her appearance) but by her interactions with the other characters.\\n\\n\r\nAs for the art and sound, I would say that both are just average and not award worthy of the year. I mean, it is just there. Of course, the light themed piano tone of the background occasionally does mix in with the series well but overall, not something I'll remember by for a long time. The art (like most 2010+ series) is presented well. However, there are those scenes where they background and obscene characters looks like computer generated graphics that leads to a turn off. \\n\\n\r\nOverall, I'd say that this was a great series that debuted so far. It has its good (the realism of taking care of people and becoming someone you never thought you'd be). It has its bad (the pointless fan-service and some blend character designs). And then it has the ability to make our viewers continue to watch through its drama that all started after an unprecedented tragedy. What originally thought by some viewers (you know who you are) to be a series that tried to get attention through common cliche instead became a series of a touching melancholy. Perhaps, responsibility changes people who they are from carefree to responsible. Perhaps, it is unprecedented events that leads to people to discover their identity. Or perhaps, it is the reality that most of us may face today in our lives that can be reflected upon from this series. But all in all, this series is something to keep an eye on (especially since it only covers roughly 1/3 of the light novels). Remember, responsibility is not a privilege, it is a right. Don't believe me? Just ask Peter Parker.\\n\\n\\n",
            "date": "2012-05-15T21:32:00+00:00",
            "helpful_count": 363,
            "mal_id": 61279,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=61279"
        },
        {
            "content": "If you plan to watch this anime with the assumption you'll get a lot of moe loli-fanservice, then you'll be sad to know that there isn't much of it.\r\nWhat you do get however, is a very deep, touching story, that's very thoughtfully written. It tackles a lot of different, difficult topics and approaches them in a very realistic manner. The result is a very sweet anime that breaks from the norm and is a great optimistic, thought-provoking watch.\r\nI won't say any more here as nothing much needs to be said. Watch with low-expectations (as I did at the beginning) and you'll be sure to havethem far exceeded. \\n\\n",
            "date": "2012-02-13T17:34:00+00:00",
            "helpful_count": 96,
            "mal_id": 53839,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/660485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scruff",
                "username": "Scruff"
            },
            "url": "https://myanimelist.net/reviews.php?id=53839"
        },
        {
            "content": "\"Family must not be separated, they must be together\" - Segawa Yuuta\r\nRaising a child isnt an easy matters, even for parents. Sometimes we must realize that if we're in our parents position and what do they feel when taking care of us, of course it isnt an easy things to do. So, can you imagine if we're a college student but at the same time we must taking care for 3 children? Segawa Yuuta knows the answer.\r\n------------------------------------------------------------------------------------------------\r\nSTORY 9/10\r\nThe story begins with Segawa Yuuta as the Main lead, he is a freshman of a university. His parents passed away while he was young and he gotcared by his own sisters. and One day, he is visiting to his sister's apartement because he got asked to take care of her three daughter while Yuri (his sister) and her husband were on trip. and then the problem occured, His sister and her husband got a plane crash during the trip, and so, the three daughter will being live separately because of the family want they do so, and to prevent that happen, Yuuta decided to take all the three girls and live with them.\\n\\n\r\nIf you have watch Usagi Drop, then maybe this will kinda remembering you. a man adopted girls (but in Usagi Drop there was just one girl) because he is kinda sorry about what happen with her and back to the Papa no Iukoto,  the story is focussing on their life like what you're gonna do with your life, since now you're taking care of 3 children. you must thinking about their food, their school, and even their happiness, can you do that? So does this life story was BORING? NO WAY'D HELL. The story is really maginificent, the problem that occured each episode is real, quite logic and not exaggerating. There is no drama that is excessive, they're just life or we can said more common life problems\\n\\n\r\nFor me, every each episode in Papakiki so tear jerking moments. I couldnt help to shed my tears. and honestly, while watching this i must have handerkerchief on my side (kinda embarassed). Because the way how this anime tells the story is really touchy. The slow paced story that this anime brings really increasing the atmosphere.\\n\\n\\n\r\nART 8/10\\n\\n\r\nThe art in this anime is really colorful and bright. The characters design is quite attractive and simply charming.\\n\r\nOne anime comes to my mind while watching this anime was \"Mayoi Neko Overrun\", the art is so similar between this two anime, the girl is depicted cute. they use so many colour in the art (like three different colour hair in Takanashi sisters), and with this of course, the viewer who're watching this will never feel dull about this anime and more, the scenery or background is really good, like that i said, so colourful and i presume , it brings the atmosphere is cheerful and happy.\\n\\n\r\nBut with this art, its didnt really fit it with an heartwarming atmosphere. Colorful and bright coloring is more suitable if the anime is focussing on cheerful and happy moments. However, its not quite a problem since we might be distracted by how beautiful and colorful this art was.\\n\\n\\n\r\nSOUND 8/10\\n\\n\r\nAgain, i am surprise how good the seiyuu was in this anime. especially for Takanashi Hina's voice. the sound was so childish like any 3 years old girl and more, the other Seiyuu like the seiyuu for Takanashi Sora is really talented, while she was singing, the sound was clearly like a profesional singer. What i mean is, they really put their feelings into it, i was moved by how much effort that they do and the result like you can estimate, it was perfect.\\n\\n\r\nAs for OP and ED, honestly i more like to hear the ED song, i am not saying the OP was bad, but the ED song was really more fits with the anime. i dont know what make ED more fits with the anime, but i have feeling towards this ED song. it brings happiness yet sometimes it was sorrowful (mixed feelings).\\n\\n\\n\r\nCHARACTER 9/10\\n\\n\r\nThis probably what i loved the most from this anime, they really brings out the character. like the three sisters, they really unified with each other like the siblings must to be. and what make this series more interesting was of course, the little takanashi, Hina. We cant help not to in love with her. Cheerful and yet funny little girl. and that Hina itself that brings the atmosphere more lively and yet make the sad atmosphere, like when she asking where her mother and father is... if you're in Yuuta position, what will you said?\\n\\n\r\nNot just the Hina itself that appealing me, Every characters that appears in this anime (except someone, you will find it in below) was the real reason too why i love the character in this anime, here is the summary for each character (especially Takanashi sisters and Yuuta) :\\n\\n\r\n- Takanashi Sora, maybe the most character that have so much appearance in this anime, this character was lovely. As being the oldest sister between the three, she trying so hard so the other sisters will be like her and yet her shyness and tsundere toward Yuuta was reasonable, you will find it why i am not gonna spoil it.\\n\\n\r\n- Takanashi Miu, if there was a character that i love after Hina, it must be Miu. i am surprise how mature Miu was, toward her act even her manner. sometimes i thought Miu was the older sister. and yet, she is a mediator between Yuuta and Sora, since she knows that his older sister have a feeling towards Yuuta\\n\\n\r\n- Yuuta Segawa, i am impressed by how hardwork that he does for his niece (the three sisters), since he's just a student but he's also work for them and he really does it like a real man. Not wimpy character and even never give up. He can be a example for every man in the world. That the man must never give up. Do what you think is important.\\n\\n\r\n- Raika Oda, the woman that will makes you falling in love in her. it attractive and even Kuudere! , behind that, she is like Miu, mature in every ways.\\n\\n\r\nI want to give this section 10, but there is one problem that ruins it all. that is the president of SS club, pervert and even i dont know why he must appears in this series, as for me he doesnt give any positive to this and even ruins every scene if he is appear, if he never exist i thought that this anime will be more awesome.\\n\\n\\n\r\nCONCLUSION\\n\\n\r\nI have regret on this anime... it was.. WHY I DIDNT KNOW THIS ANIME SOONER? when i found this anime i was like found a hidden gem/diamond in many of mainstream anime. This anime is totally recommended for all people who loves heartwarming anime with a light story on it.\\n\\n\r\n*Feedback and comments are welcome*",
            "date": "2013-08-05T03:20:00+00:00",
            "helpful_count": 82,
            "mal_id": 108289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=108289"
        },
        {
            "content": "Man, what the hell is an \"Ecchi\" tag doing on this anime?\r\nThis anime has all the components of a successful emotional anime. It deals with the themes of loss, family and survival in a mature way and can make you tear up at more than one point, while portraying daily life of the protagonist with a sense of realism and without the tropes found in many anime.\r\nIf there was no \"but\" following this anime might be considered a mini-Clannad by those who viewed it. \r\nBUT\r\nThe writers inexplicably decide that a show about loss, family and perseverance is somehow the  right time to add run-of-the-millpantie shots and incest humor. It's as perplexing as it is infuriating.\\n\\n\r\nNow don't get me wrong. I am a... purveyor... of many a pantie shot and clumsy-airhead-girl humor bit. I don't immediately cry \"FANSERVICE\" and dismiss an entertaining anime. But I still have no need to have a tear in my eye as we watch a three year old learn the cold facts about death, and then ten minutes later watch a 12 year old tsundere's older cousin complex.",
            "date": "2015-02-11T09:14:00+00:00",
            "helpful_count": 74,
            "mal_id": 180140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4454087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/milkblob",
                "username": "milkblob"
            },
            "url": "https://myanimelist.net/reviews.php?id=180140"
        },
        {
            "content": "I just want to say that I am really happy to see that this will be getting 26 episodes. It is really vibrant and cute.\r\nThe story revolves around our main protagonist who has to take care of his sister's 3 kids (although 2 of them are not blood related, they came from the sister's husbands 2 previous marriages, so technically none of the girls are related to each other).\r\nI started reading this manga a few weeks ago and I was SO happy to see that this season would have the anime version of it along with other great series (Zero no tsukaima, Youko x BokuSSS, Highschool DxD and I think there was one more).\\n\\n\r\nStory: 10/10. It's a cute story where the uncle enjoys his daily life with the 3 kids and they all become a happy family. I don't want to spoil anything so I won't say why it's a Harem genre (but you can probably tell already).\\n\\n\r\nArt: 10/10. Seeing how this is a 2012 anime the art has to be good, and it really is. The details they put into the characters are really something. For instance, when yuuta walks into the room of one of the girls changing the red blush on her face/body is really noticeable. That's one thing that really stood out to me.\\n\\n\r\nSound: 10/10. I don't recall the OP but I listened to the Ending and it's really cute and sweet. I tend not to watch OP/ED since the show is already over or you just want to heart of the show, not the OP lol. There's only certain OP/ED I will watch (for instance Fairy Tails Ending where Gray is walking a path and reminiscing about the past, the music and animation is really nice so I actually watched it every time for that season. Also the OP of Mirai Nikki is AMAZING, the animation too).\\n\\n\r\nCharacter: 10/10. Your typical cute family harem comedy. It's very nice and the 3 girls are very charming and have great personalities. Yuuta starts off as a typical \"why the f*ck do I have to watch these 3 kids when I just want to be a normal college kid\" (BUT IT'S A VERY MILD CASE).\\n\\n\r\nHe's not a douche about it. He cares for the girls and I don't want to spoil anything but if you've read the manga you know that he goes out of his way a lot to make sure that the girls are all happy and comfortable.\\n\\n\r\nEnjoyment: 10/10. If you enjoy cute/family comedy harems then this is a great show. It's not a hardcore incestual/lolicon harem show at all. It's just a cute little comedy that brings people together :)\\n\\n\r\nOverall: 10/10\\n\\n\r\nGreat show. Great everything. I look forward to the next 25 episodes.\\n\\n\\n\r\nI probably won't have to update this in the future since I've already read a bit of the manga so I know what happens sorta. Please enjoy the show if you do watch it :)\\n\\n\r\nThanks for reading",
            "date": "2012-01-11T10:14:00+00:00",
            "helpful_count": 45,
            "mal_id": 51535,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=51535"
        },
        {
            "content": "**Warning: Contains minor spoilers**\r\nIf you want a comedy that's full of ecchi fan service involving children as well as loli vibes throughout the anime, look no further. You've found what you are looking for. If that's not something that would interest you, I don't recommend this anime. If you're still on the fence about it and/or want to hear what I have to say, then please read the rest of my review. \r\nSound: 6/10\r\nThe voice acting was fine and the music was appropriate. Nothing special, though, and nothing really stood out to me. There were some cute moments when they were singing, but otherwise it'sforgettable. The voice actors did a good job of portraying their characters, so I have no complaints on that score either. \\n\\n\r\nArt:  6/10\\n\\n\r\nThe art always felt familiar, like I'd seen it somewhere before. Then I realized that (in my opinion at least) Sako looked exactly like Kouta Hirano from Highschool of the Dead. Sora looks similar Haruhi (The Meloncholy of Haruhi Suzumiya). Hina looked like a mini version of Taiga (Toradora) with black hair. Nimura looks like Koizumi from Haruhi Suzumiya. Miu's looks kind of remind me of Asuza Nanako (K-on).Etc...Seriously all of them look like the replica of a character from a different anime. While the art was beautiful, it still felt very unoriginal. \\n\\n\r\nI also found it annoying that Yuuta is supposed to be a college student, yet he looks the same age as 14 year old Sora. in the anime Yuuta is 18, making him 4 years older than Sora, so way does he look her age and sometimes younger than her? There are also times I feel that they made the 10 year old, Miu, look older than she was. Same with Hina. She looked more like a five or six year old than a three year old. I suppose if they drew people to match their ages, then the comedy and acceptance of that comedy wouldn't work as well? I don't know...moving on....\\n\\n\r\nStory: 3/10\\n\\n\r\nFirst, let me say that I have not read the manga, nor do I intend to, so this is all based solely on my impressions of the anime (and the three ova). \\n\\n\r\nWhat makes this anime so sad is that it had such great potential. As the synopsis states, it's a about an 8 year old college freshman who takes in his three nieces (two of which aren't blood-related) after his sister and her husband's plane goes missing (and they are presumed dead - which they are). Sounds like it could be a really good anime, right? That's what I thought too. I was wrong. It was far from being a great anime, or even good or average anime, which is a shame. \\n\\n\r\nThis story truly could have been something great. The premise was a good one and I wanted to see it develop into something deep and meaningful (even with the genre of comedy attached to it). This simply was not to be as the powers that be ruined it with unneeded and tasteless fan service, along with some characters that were better off never being in the show given their behavior and how said behavior dragged the show into the dirt. I understand that this is a comedy and they were trying to be lighthearted, but I just felt it was done poorly. Very poorly. \\n\\n\r\nThe fan service was way to much for me to handle considering the premise of the show. I feel that this anime should have an ecchi lolicon warning label attached to it, so people can know about that aspect before going into for people (like me) who tries not to read reviews before watching the anime.\\n\\n\r\nLet me warn you: There are A LOT of bath scenes. There are also plenty panty shots, boob shots, etc...a good majority of which center on the little girls (ages 3, 10, and 14). I didn't care for this aspect of the anime. Maybe it's because I'm a mother of two young children myself or maybe it's because I simply don't think little girls should be sexualized. Either way, the fan service added nothing meaningful to the plot and ended up leaving me feeling as if I had just seen something I had no business seeing. \\n\\n\r\nTo add insult to injury they just had to add pedophilia to the mix . Because what ecchi lolicon anime would it be without a pedophile(or two) that no one is really bothered by? That's what that particular tv trope (the lolicon trope) is all about, after all. \\n\\n\r\nHowever, I didn't find it humorous. It had the complete opposite effect, actually. When that aspect came to life, I lost interest in the anime and simply watched it just to say I finished it. Using pedophilia as a joke isn't funny to me at all. So not only did it have a lot of ecchi fan service of young girls, but also pedophile elements that we were supposed to find amusing. I am not amused. Not to all. \\n\\n\r\nIt didn't help that the woman, Raika, struck me as being something of a pedophile herself. I can't be sure if her love and affection for the girls is platonic or not. The OVA seems to suggest something more (for some weird reason one of the OVAs seemed to turn all the girls in the show into some type of pseudo-lesbians).  Innocent or not, Raika's behavior was no easier to shallow than Sako's disturbing behavior towards the girls. Both of them had an unhealthy obsession with them that, again, seemed to bother no one, yet bothered me as a viewer greatly.  \\n\\n\r\nCharacters: 3/10 \\n\\n\r\nOutside of the pedophile aspect of some characters, two more examples of useless characters in this anime are the landlady's daughter who tries to evict them simply because he took in his sister's kids, and Raika (her loli moments aside) was someone I just never understood and never found funny. Maybe I just don't get the humor in this anime? I mean, who would try to evict someone for attempting to do the responsible thing? While the anime tried to explain her harsh behavior, the execution was done badly and to be honest, every time she was on screen I couldn't stop getting distracted by how she was practically the glasses-wearing version of Karan from No. 6 (anime). \\n\\n\r\nAs far as I can tell the friends (Raika, Sako, and Nimura) contributed next to nothing to the anime and often were shown in a poor light when they were given screen time (though my definition of poor light may vary greatly from yours). The only one of the three I found even remotely likable was Nimura, but even so, the way everyone thinks these kids are cute and practically seem to fall in love with them is a put-off. Even if Nimura's true intentions are innocent, sometimes it just doesn't feel that way. In reality, it makes me question if everyone in the show is a lolicon in some form or another. \\n\\n\r\nI also hated how the girls always said that Yuuta lacked delicacy. I didn't see that. If anything, they should have been more understanding of him and realized that more often than not they were at equal fault whenever something happened that put them in an awkward situation. \\n\\n\r\nI found it annoying that Yuuto had taken them all in so the sisters could stay together when no one else would do that only for them to treat him so badly because he was a boy. I get that they are young girls, but there's a limit to how childish you can be. Yet Yuuta never chastised them for it and went along with their whims, which bothered me even more as he's supposed to be the adult. Instead, he allowed them to treat him like an inferior and even apologize to them when he'd done nothing wrong. \\n\\n\r\nExample: when Yuuta offered to help Sora with her luggage because he was afraid she'd fall. She refused and, go figure, she fell down the stairs. When she fell the clothes in the luggage went flying and he accidentally picked up her panties. She gets embarrassed and slaps him, for which he apologizes. I'm sorry, but how was that his fault? I didn't find that funny, I just found it stupid.\\n\\n\r\nAs for character development, I didn't really see too much. While it was definitely there, considering the premise of the anime, a lot more character growth should have taken place. Instead serious events or issues that would have helped them grow as people were often glossed over or ignored for irrelevant material that has no business being in an anime centering on children for the purposes of comedy or whatever it was the creators thought to do with it. \\n\\n\r\nEnjoyment: 3/10 \\n\\n\r\nI enjoyed the anime until the point that the bad humor and excessive fan service became too much for me to continue enjoying it. As already stated, the excessively ecchi fan service and the lolicon vibe of the anime made me feel uncomfortable while watching this. They are little girls. There's nothing funny about lolicon in this situation (or any situation really). \\n\\n\r\nI can't imagine any normal person wanting to see little girls taking baths or seeing their panties or boobs or naked skin. They are kids. That's not cute. This is what really ruined it for me. Even with a good plot, there was no way I could force myself to enjoy it. I ended up feeling very disconnected from the characters and the anime the more I watched and was tempted to drop it a couple times. \\n\\n\r\nOverall: 5/10\\n\\n\r\nDespite the good plot, I did not like this anime. The humor was distasteful and the use of fan service in regards to little girls made me uneasy. I feel that a great plot was largely ruined for worthless tropes that lowered the anime from something that could have been great to barely tolerable. At times, yes it was cute. At times, yes, the plot was wonderful. Sadly, it wasn't enough nor am I able to overcome my own personal bias to rate this higher. \\n\\n\r\nIf you don't mind kids being used as ecchi fan service material and pedophile tropes don't bother you then you should do fine with this anime. In fact, there's no reason you wouldn't love it. However, if things like that bother you as they do me, then I suggest skipping this anime, no matter how tempting the premise is. Had I known before startinf the anime about these details, I would have skipped it myself. It's just not worth it.  At times such as these, reading some of the reviews before watching can really go a long way.\\n\\n\r\nWhile I understand this is just an anime and that I probably need to lighten up, I can't find it in me to do that. Therefore, my score of 5/10. That's the best I can give it, based purely on the premise (that was wasted), the sound, and the copy-cat art that reminds me keenly of other anime, sometimes to the point of distraction. \\n\\n\r\nIf I was going to rate this as I really want to, I'd give it a three out of ten, but I'm not going to be that cynical. It did have it's good moments and it wasn't necessarily a bad anime. I'm sure there are many people who would (and do) love it and find it fun to watch. I am not one of them. That's not saying that the anime sucks or that I have poor taste. It's just that in this instance, I found that I simply couldn't enjoy it personally. So again, 5/10 is the best I can do in my overall rating and even that is being too generous in light of my personal qualms with the anime.  \\n\\n\r\nI hope that this review was helpful to you. Thank you for reading it. \\n",
            "date": "2016-03-05T05:28:00+00:00",
            "helpful_count": 32,
            "mal_id": 212285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554945.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Midievalfantasy",
                "username": "Midievalfantasy"
            },
            "url": "https://myanimelist.net/reviews.php?id=212285"
        },
        {
            "content": "If you have ever fantasized about what would happen if suddenly you became the guardian of 3 little girls out of nowhere, then this might just be your anime. \r\n|Objective Review|\r\n|Story/Plot|\r\nThe overall story is very well organised and presented throughout the whole series. The core idea is presented and developed at a great pace, maintaining variety. While the main idea might not seem too interesting at first, Papa still makes it exciting. Papa puts the characters to great use to make sure the flood of problems stay fresh and varied. Though there are a couple of flaws here and there (see at Characters). The animeending is not particularly great, but it can be forgiven if you watch the OVA and specials which give it a proper ending.\\n\r\nScore - 7 (9 with OVA and specials)\\n\\n\r\n|Comedy|\\n\r\nExpect to see some minor comedy in the anime. Nothing too spectacular, it's just there to spice things up. However, the jokes can become repetitive and boring after awhile since they use the same concept and ideas for jokes. \\n\\n\r\n|Characters|\\n\r\nThe characters are the most integral part of Papa and it succeeds to deliver. Almost all of the main characters are great, none of them are shallow characters. They all have deep/multi-layered personalities and they made them feel real, making it easy to like them all. \\n\r\nThe supporting characters on the other hand are very-very supporting characters. Most of them are just one of the basic stereotypes and don't really show anything beyond those. \\n\r\nAs the series go, the main characters build deep bonds and their character develop into more depth. My only concern was the lack of attention for Miu both in terms of connections and character development. The same goes for the support characters.\\n\r\nScore - 8\\n\\n\r\n|Art|\\n\r\nThe art is one of the best ones. Not really because it's beautiful in art terms, but because it complements the story and ambiance so well. It's bright, heart warming and cute. It really helps you ease into the mood of this anime.\\n\r\nScore - 9\\n\\n\r\n|Sounds|\\n\r\nThe voice acting was pretty good in my opinion. There was character to them, i could feel the emotions behind them. As far as the music goes, i think it was good, but nothing outstanding. However, it still goes well with the heart warming charm of Papa.\\n\r\nScore - 7\\n\\n\r\n|The whole package|\\n\r\nAs i have already implied, the audio-visuals just work so greatly together and Papa really has a great ambiance to it, which i can only recommend. All in all, if you would like to see how a \"newly-born\" family bonds over while overcoming all hurdles, melting hearts with how cute and lovely it is, then this anime is for you.\\n\r\nOverall Score - 8\\n\\n\\n\r\n|Subjective part|\\n\r\nFor me, who always wanted to have a loving family environment, where i felt comfortable, this anime was just incredibly heart warming for me. It really meant a lot for me, and seeing the family bond over all the issues was just an unimaginable dream for me. Not to mention the characters... They were all extremely lovable and i could really put myself into their shoes. Personally speaking i'm still disappointed by the lack of Miu content but oh well. But because of all these, the anime will always have a place in my heart and i will give it a \\n\r\nSubjective Overall Score - 10 (9 because of Miu)\\n",
            "date": "2017-08-27T17:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 256380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760738.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shattiiee",
                "username": "Shattiiee"
            },
            "url": "https://myanimelist.net/reviews.php?id=256380"
        },
        {
            "content": "Today I’ll be reviewing one of Sentai’s newest works, Papa no Iu Koto o Kikinasai! or PapaKiki for short. Much like the critically acclaimed Usagi Drop, this slice of life anime involves a young man whos world turns upside down when he finds himself a guardian due to unforeseen circumstances. Unlike PapaKiki, however, Usagi Drop was actually an enjoyable experience. There are so many things wrong with PapaKiki, it was almost unwatchable for me.\r\n              The premise itself doesn’tseem too bad at face value. The main character Yuta is a college student who decides to take in his older sister’s 3 kids after she disappears in a plane crash along with her husband. However, this is where holes start to pop up. There is zero emotional impact with the disappearance because we barely got to know Yuta’s older sister at all and her husband straight up never appears onscreen. But it isn’t until the memorial service that things get REALLY ridiculous. After hearing that the sisters will be separated and sent off with different relatives Yuta takes a huge leap and offers to take them all in so they’ll be together. It’s a heartfelt idea, but ultimately unreasonable, right? Well apparently not because the adults LET IT HAPPEN. Forget the fact that the dude is attending college and working at the same time. Forget the fact that other, more responsible family members are willing to take in the young ones. Forget the fact that Yuta literally has only spent a couple days with the kids at that point. Nope, let em all stay in a cramped,one bedroom apartment. Needless to say, Hijinks ensue! Well, not really. \\n\r\n               The 3 sisters are 14 year old Sora, 10 year old Miu, and 3 year old Hina. Sora is a tsundere with a brother-complex..er..adopted brother…uhm father complex? Long story short she wants Yuta’s D , because whats an anime without incest vibes? Id mention more about her but besides the fact that she has a slight resemblance to Haruhi there IS nothing else to mention about her character. Miu is the most tolerable of the 3 even though she does fuck all the entire time. There’s one episode focused directly on her but she mostly just chills in the background. Hina however, is in my opinion, not only the most annoying character in the series but the most unbearable anime character in recent memory. With a voice that manages to be high pitched yet grating at the same time, her overly “cutesy” behavior, and her predilection for breaking out into “Twinkle Twinkle Little Star” (I swear to fuck she sings that at LEAST 60 times during the course of the series) Hina never fails to infuriate me just by being on screen. There are a few other characters but they’re so cookie cutter that I didn’t even bother to remember their names. There’s a beautiful girl who’s super popular in school but takes an interest in Yuta for no apparent reason even though she’s way out of his league. The good looking, womanizing best friend. And the fat, creepy, glasses wearing nerd…who’s also a lolicon. (of course)\\n\r\n             Animation and character design is bland and even downright confusing at times. For example, Hina has a full head of hair that goes down to her lower back even though she’s only 3 and all the characters seem to have permanent red marks on their knees and elbows. The fan service is also a problem. There isn’t nearly enough to satisfy the lolicon pervs but there’s still enough to get an eyeroll from the people who actually want to pay attention to the story. OP isn’t bad but ultimately forgettable. The ED however is damn catchy. An 8bit-like tune that reminds me of 90’s Gameboy games. Though in retrospect, the fact that the ED signaled to me that my 24 minutes of brain rape were over is also probably part of the reason I liked it so much. \\n\\n\r\nPros- Fat lolicon dude gets a few chuckles now and again\\n\r\n          Ending song is Ipod worthy\\n\\n\r\nCons- HINA\\n\r\n            Premise a bit too unbelievable\\n\r\n            HINA\\n\r\n            Full of clichés and character tropes\\n\r\n            HOLY SHIT, HINA DIEEEEE                  \\n",
            "date": "2013-07-09T23:55:00+00:00",
            "helpful_count": 20,
            "mal_id": 104675,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2255393.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Agmkreptile",
                "username": "Agmkreptile"
            },
            "url": "https://myanimelist.net/reviews.php?id=104675"
        },
        {
            "content": "Do you like anime about family bonding, growing up, and learning life lessons--then you should watch this anime. Family can be blood related or not as it doesn't matter. Family is a family. Its the time you spent with them that count and the memories you share.  I am reminded of another anime  Usagi Drop that has a similar feeling. Anyway on to the story--Papa no Iukoto wo Kikinasai! or Listen to Me, Girls. I Am Your Father!. is about Segawa Yuuta , a 19 year college student has to take care of his sister's 3 children. ( 1 of them is bloodrelated while the other 2 are not related)  One might think this is a harem/ecchi  type anime-(as stated above) deals with life lessons that everyone should learn from. \\n\\n\r\nArt/Characters \\n\r\nI say its good, everyone has their own unique feel and charm about them\\n\\n\r\nSound\\n\r\nOpening song is very touching and it shows the relationship between Yuuta and his 3 sisters. Ending song is cute- showcasing the 3 sisters- cute charm/appeal : ) One more thing--its really colorful : )\\n\\n\r\nEnjoyment\\n\r\nI believe yuuta and his 3 sister will have a very close bond. Everyone who enjoys slice of life anime that deals with life and learning life's preciousness lessons should watch this series. Give it a chance  :  )\\n",
            "date": "2012-01-28T10:56:00+00:00",
            "helpful_count": 15,
            "mal_id": 52745,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/834209.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnimeFan500",
                "username": "AnimeFan500"
            },
            "url": "https://myanimelist.net/reviews.php?id=52745"
        },
        {
            "content": "We're pushed into a story where it starts calm, then the sad part hits. To some, they might tear, I completely understand the motive behind each character's decision, but it really doesn't drag me into the main story much as I didn't care for the characters that much during the beginning, I had enpathy for them but caring was still lacking.\r\nThis isn't a AAA+ action anime, it's realistic modern day Japan, so all the actions or... most of the non-sexual ones seem logical to me. The jokes are funny at first but they're overused way too much throughout the series. \r\nThe three sisters are allcute, a tsundere, a toddler and the pretty one, all lolis of course. But there comes a time when their actions also become overused, with the exception of Mia, the pretty one as she is slightly less predictable than the other two. The incest related relationship seems at first uncomfortable to me, but as the story progress I grew... not attached at all but more accepting of it. The sexual joke scenes seems awkwardly placed, kinda enjoyable, but it just made attachments with characters slightly loosen and I couldn't take the serious scenes completely serious. You have two female characters that you meet... and you will most likely not care at all for them as they have less than five minutes of screen time in the entire series even though they have a slight side effect to the main characters. There's also another female character, she's supposedly has the best body out of all the female characters, however her body hardly seems different from the two other female characters if you know what I mean. She appears in almost every episode and no one knows what her motives are or why she possesses an interest in the main male protagonist, the type of interest isn't even determined either. The show is mostly about the male protagonist but the scenes where he's at work or college seems like the most pointless scenes.\\n\\n\r\nThe anime sports a lot of cute but random occurences, it's hard to get into, but I managed to be able to get into it. The sad or bad moments are painfully predictable and when they actually come, I didn't feel surprised at all at the timing, I only just wonder \"What kind of trouble are they in now?\". I only feel a little bad at their reactions to the situations, I didn't shed a tear.\\n\\n\r\nWith situations resolved I feel only a little happy for the characters, then the ending music plays and I feel that it multiplies that happy feeling much more. I love the ending so much, both the animation and the music.\\n\\n\r\nThis isn't an overly fantastic anime, it had a lot of potential but a lot of holes appear in the plot. Plus a lot of pointless characters... but those pointless characters add to the realism in a way because in most other animes every single character is friends with each other, this anime shows slight realism that shows that not everyone know everyone else because they're linked. The characters also seem to become attached too quickly, it takes one episode for a character to become best friends with another, or a certain five minute moment makes a girl fall in love with a guy for the rest of her life. They could of had a lot of plot twists in this anime that would of made it way better, but it isn't and it makes it painfully predictable and not surprising at all, mixing with strangely timed fanservice, it all ruined attachment to characters. If you happen to get into it, it's great and enjoyable to watch, if you can't you're looking rock bottom as they'd say.\\n",
            "date": "2015-06-23T22:57:00+00:00",
            "helpful_count": 12,
            "mal_id": 191096,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4694678.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/RedFlamedArt",
                "username": "RedFlamedArt"
            },
            "url": "https://myanimelist.net/reviews.php?id=191096"
        },
        {
            "content": "Papa no Iukoto wo Kikinasa is something as close to a Masterpiece as you will find in an Anime Series.\r\nIf you read the description on what this is about, or translated the title that in English means \"Listen to Me, Girls. I Am Your Father!\" \r\nYuri and Shingo are going on a Honeymoon when their plane hits bad weather and crashed, Killing both of them.\r\nTheir 3 kids now have no parents, Would you a College student, have the guts, the courage to stand forth after hearing that the 3 girls would be split up, To take matters into your own hands?\r\nIt takes a special kidof person, and that is Segawa Yuuto, He stood up to the family members and said he wants ALL 3 and will look after them.\\n\\n\r\nCharacters:\\n\\n\r\nYuuto for one you see a change in him, he has to go from a careless college guy, so a person that now cares for 3 girls, works extra jobs and does college as well, you can see the pressures and the strains this can cause, He becomes a MAN during this time, and its sooo easy to see, even the girl he has a crush on can see the change in him, a good change at that.\\n\r\nFor the other characters they are perfect, From the 3 kids, Hina is the one that makes this series, she is 3 and thus comes alot of innocence, but this innocence can sometimes be very funny and amusing, then it could be Heart warming (When she wants to learn something to show Mummy and Daddy when they are back) and the next terribly sad.\\n\r\nEven the sub-characters are amazing and portrayed perfectly, they fit the show and help out when they can, but are NEEDED, Friends can help you in life, and this series shows that.\\n\\n\r\nArt:\\n\\n\r\nIs Sublime, One of the better looking series i have seen in a while, Even down the little quirks they give Hina (3 Year Old) is soo cute.\\n\\n\r\nSound:\\n\\n\r\nVoice's REALLY fit the characters, a perfect job there, only downside is the music was good nothing that was incredibly memorable though.\\n\\n\r\nOverall:\\n\\n\r\nAll i need to say, Is watch this series right away, Its something Special, One of the best series i have seen.\\n\r\nI have been thinking of Lines and Lines to say about this, But there is no need, To sum it up, Everything is done in a sublime fashion, and you will miss one of the best series around if you don't watch this.\\n\\n\r\n(Soooooooooooo Wish for a Season II) :(\\n\\n",
            "date": "2012-10-26T17:48:00+00:00",
            "helpful_count": 11,
            "mal_id": 75987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1514017.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lukas10",
                "username": "Lukas10"
            },
            "url": "https://myanimelist.net/reviews.php?id=75987"
        },
        {
            "content": "Papa no Iukoto wo Kikinasai! A somewhat difficult show to review. Decent premise, some good characters, pretty art, but still doesn't really convince me it worked as a show.\r\nThe story is a relatively interesting premise. Yuuta ends up taking in 3 of his nieces after their parents die, to stop them going off to different homes and ultimately being separated, he feels so strongly about this because his older sister and the mother of the youngest niece raised him when their own parents died. As you may have guessed from the last sentence Yuuta is only blood related to one of the girls.\r\nThe biggest issuei have with this show is that it tries to draw upon far to many ideas and genres, for a half series to really succeed with any of them. Sometimes it wants to be a slice of life drawing upon all the hardships of a poor college student trying to raise 3 girls on his own, other times it pushes lots of screen time into Yuuta's college life, mainly the strange club he joins and the love interest there with Raika, other times it wants to run with the oldest sister Sora having romantic feelings for Yuuta, and heads down the whole possible incest route. Then it remembers it could just flood the show with fan service and cute moments. The way the theme changes often several times in any one given episode makes it very difficult to really get into the show, given you'll probably like 1 or 2 aspects and be unhappy when it strongly overplays the others.\\n\\n\r\nIf you look at some of the more popular shows with this sort of subject matter most of them succeed by largely focusing on one theme and running all others as small scale extras, Usagi drop quickly jumps to mind, for keeping its focus to great success.\\n\\n\r\nI liked the characters, the youngest sister Hina is cuteness overkill, Miu is crafty and wise well beyond her apparent age of 10, and Sora the oldest sister is semi in love with Yuuta, which will appeal to some.\\n\\n\r\nArt is pretty good, i'm genuinely excited Feel are doing the new Minami-ke based on this showing. Art is distinctive, bright and generally well drawn.\\n\\n\r\nIn conclusion this sounded a great idea, that didn't really come off with all the demographics it's tried to cater for and squeeze into a relatively short run time.\\n\\n",
            "date": "2012-12-02T13:59:00+00:00",
            "helpful_count": 10,
            "mal_id": 78986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=78986"
        },
        {
            "content": "\"Tinkel, tinkel, lilel stal\"\r\n\"How I wondaa wat chu aar\"\r\n\"Up above zaa wald so hay\"\r\n\"Rayk a daymond in za sky\"\r\n - Takanashi Hina\r\nFirst of all, I would like to announce that I'm an idiot for not finding this animation sooner, which is one of the better manga series I've read. For Pete's sake, I'm late for about three years. No use crying over spilled milk.\r\nI write this review assuming you've watched the series. Worry not, it doesn't contain any spoilers. Oh and a little more, I've been writing a lot of reviews on MAL but I didn't read one of the guideline, \"Don't include story summaries,users already have the synopsis written for them.\". I am ashamed of what I've been doing.\\n\\n\\n\\n\r\nGreat job, dummy me.\\n\\n\\n\\n\r\nSTORY 9/10\\n\r\nTo be frank, I wasn't expecting any serious plot about Papa no Iukoto when I read it on 2009. I thought, \"Lookie, lookie! Another harem series full of fan service and with three lolis in it!\" (Loli lovers raise yer hands!).\\n\r\nAfter reading a few chapters of it; my perception about it instantaneously changed. I felt guilty judging it hastily.\\n\\n\r\nPapa no Iukoto wa Kikinasai's offers a different--- a heartwarming story which I find very entertaining. It's a little bit tragic. Good thing the series focused more on the cheerful side of the story. It tells us about responsibility. Well, technically, no one would do this kind of big--- I mean, ginormous responsibility in real life.  A 19-year-old kid taking care of three girls (two lolis and one adolescent girl, yes, I needed to clarify that) while studying at a university? Man, you have to be a superhuman to do that. Fortunately, this is just a show.\\n\\n\r\nWe all know how hard it is, but nevertheless, Yuuta (MC) tries his hardest to take responsibility for the three girls. Yes, it's foolish. But for Yuuta, family's the most important thing. That's why he tries his hardest to provide for the three girls. Bearing this big of a responsibility is like climbing a tree, with just one arm. It might seem impossible, but with great effort, it's still doable.\\n\\n\\n\r\nHonestly speaking, Papa no Iukoto's a lot better than most of the series that I have watched. Storyline wise, it's one of the best. Not too much drama in it; but nonetheless, was still enough to bring a tear or two to my eyes.\\n\\n\\n\\n\r\nArt 8/10\\n\r\nThe art is superb! Detailed characters, good background, and uhh--- okay, enough trying to be an art expert. Like I've been saying in my previous reviews (dumb reviews), art that doesn't please the viewers these days are a rarity. And Papa no Iukoto's not an exception. The art is great, period.\\n\\n\\n\\n\r\nSOUND 9/10\\n\r\nOh my God. Kitamura Eri and Horie Yui for seiyuus? Heck, yeah! I immediately recognized their voices the first time I heard them.Takanashi Hina's (the smallest girl) seiyuu has done a great job too! Being able to voice a three-year-old girl is no easy feat, and she did it with flying colors. Other seiyuus were perfect for their characters.\\n\\n\r\nFor the OP and ED. I. LOVE. THEM. BOTH. OP's done by Kitamura Eri; and the ED's done by Horie Yui!\\n\\n\\n\\n\r\nCHARACTERS 8/10\\n\r\nCute--- no, fantastically cute! The designs on the girls were great. Especially Hina, she's the cutest character here. Anyway, every character in Papa no Iukoto is good. They have their own unique personality, which is good. Even the supporting characters were designed perfectly.\\n\\n\r\nYuuta's a bit on the plain side, though.\\n\\n\\n\\n\r\nENJOYMENT 8/10\\n\r\nDid I enjoy it? Heck, I did! The slow development of the story didn't bother me that much. In fact, I liked it. Even though its a bit tragic, I love how simple the story has developed into. Every episode is filled with laughter, a bit drama, and heartwarming scenes.\\n\\n\\n\\n\r\nOVERALL 9/10\\n\r\nClearly speaking, Papa no Iukoto is one of the better shows out there. Its able to make you laugh and cry. It does not contain any heavy drama in it; and it doesn't have a complicated plot. We all watch to be entertained, no? It's just a matter of perspective. And if you happen to have the same perspective as I am, you'll love the show. Overall, it's a great show filled with cheerfulness and a bit of tragedy in it, just an itsy bit.\\n\\n\\n\\n\\n\\n\\n\r\nP.S.\\n\r\nIgarashi Hiromi, Hina's seiyuu, is a hentai seiyuu. She voiced Oni Chichi's Airi.",
            "date": "2015-01-18T09:37:00+00:00",
            "helpful_count": 9,
            "mal_id": 178361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=178361"
        },
        {
            "content": "I'm not one for reviews that are college-length dissections of anime so I'll try to keep my review short without leaving out much about how I see Papa to go for viewers.\r\nGeneralizing to three types of viewers:\r\n1. Those who can't stand fan service (disproportionate women, pedophiles, inappropriate comedy, etc) and want to see a PROPER story told (like me): I'll get to that in the end.\r\n2. Those who like a good plot and don't mind fan service: This anime is for you. I can guarantee you'll give it an 8/10 or more.\r\n3. Those of you who only care for fan service: This isn't a badanime for it, it's got a quite the range of it. I can't say much more because I hate that nonsense/ weirdo stuff.\\n\\n\r\nIn my opinion, Papa no Iukoto wo Kikinasai is nothing but wasted potential. It presents a great collection of issues and situations that could have played out to be one of the best stories ever told, but every time it started to blossom the animators RUINED IT with fan service (the kinds stated above). If it were not for the good moments that stuck to the plot, this would've gotten a 1/10 from me.\\n\r\nBut again, that is only my opinion. In the end, if you are on the fence about it, see where you fit in in the 3 categories of viewers and go according to that.",
            "date": "2015-01-21T00:10:00+00:00",
            "helpful_count": 9,
            "mal_id": 178660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4395543.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShadiiBoi",
                "username": "ShadiiBoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=178660"
        },
        {
            "content": "[SPOILERS AHEAD] Sorry, but in order for me to write an honest in-depth review about this anime, I feel as though some spoilers from both the OVA AND THE LIGHT NOVEL are necessary. \r\nStory: (I am only talking about the 2nd ep not the first, the first is more or less a filler, plain fan service) In this part of the OVA, Miu, Hina, and Sora's parents come back as harmless ghosts for one day after 4 years since the incident. The whole episode is seen from their point of view and in this episode we see a whole bunch of changes between everyone andeverything that occurred within the 4 years. \\n\\n\r\nWell after the outcry and the beggings of a 2nd season from the fans of this series, the studio gave us an OVA that is basically a translation of the final volume in the Light Novel. This was a HUGE mistake in my opinion. There should have been a 2nd season instead of 1 episode because the audience is suddenly introduced to MANY new things, and its just too much to take in! [THIS IS WHERE SPOILERS ARE IN] Especially the marriage between Sora and Yuta. WHAT? WAIT WHAT? Yep. The author pulls a COMPLETE USAGI DROP and makes the impossible happen with the ending. Now, for those of us who watched the OVA without reading the novel, its a complete \"What the fuck man?\" moment. Is this normal? What happened in the Light Novel that led up to this? Surely there must have been a good reason for Yuta to have married Sora instead of the beautiful Raika that he was so fit for. And after extensive research and readings into the Light Novel, I assure you that I am still going: \"What the fuck man.” In the Light Novel, turns out that Raika DOES like Yuta and starts to actively fight other heroines in order to get Yuta. Some of those Heroines include Sora, Miu (wat), Miu’s mother Sasha (wat), the neighbor across the street, and Yutas own college friend. Now, the light novels are not translated to the fullest, but tl;dr, Yuta ends up marrying Sora even though the girl of his dreams confesses to him.  \\n\\n\r\nNow, I do not want to instigate anything, nor do I want to judge other's perception of love, but this pairing was just preposterous. If you were to be suddenly in charge of taking care of your niece, since she was a pre-pubescent girl, in what stage of the relationship would you possibly have started to develop romantic feelings toward her? It does not matter that Yuta and Sora were not \"blood related\" the whole message that the first season taught us was that \"Family sticks together\" and this ending completely did a 180˙ turn. After having the audience hooked for 17 volumes, it is very insulting to be suddenly given an ending like this. It feels as though the author gives a final FUCK YOU to his or her fans. \\n\\n\r\nHowever, it would be very wrong for myself to judge this whole anime on this one part. The anime gives us a whole bunch of heartfelt, beautiful moments and it wouldn’t be fair for me to judge the whole thing based on the ending. But like I said, it was very disheartening to be seeing such an impossible and improbable ending happen. \\n\r\nI will be giving this a 7/10 because the ending really did provide the audience with the closure that they needed since the first season ended and it more or less gives off the same vibes that we’ve gotten from before.  \\n",
            "date": "2015-06-28T10:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 191613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3976287.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuzaki",
                "username": "Yuzaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=191613"
        },
        {
            "content": "Adapted into anime by studio Feel = This anime has feels. Papa no iukoto wo kikinasai, is a story based on Yutta dealing three siblings whose mother and father are missing (presumably dead) from plane crash. A story telling what it would feel without a family and how we would suffer without a family. Also how can we deal your siblings without your family\r\nStory: 8/10 \r\nIt begins with Yutta going to collage and then attending the night party which he then fell asleep, then Sako pretendly accuses him for harrasing Raika whose really not that emotional. That was a good part, then all the sadparts come through, his sister and her husband are missing in plane crash, making him tp take care the three siblings in his tiny apartment, lots and lots of thing happen there in his entire 12 episode life, from getting almost evicted to his apartment, Sora problems, Miu Problems, Hina problems, aunt coming checking by. Certainly it begin with sad plot but moving on you will have a heart feeling moments. \\n\\n\r\nArt: 8/10\\n\r\nThe art are decent, not too bright nor dim. Just right, perfect for the mood of the viewers, character designs were fine to me except for Yutta's hair but still it makes a perfect character trait for him.\\n\\n\r\nSound:8/10\\n\r\nAll those OST are tear jerking and some are relaxing. OP and ED was so energized \\n\\n\r\nCharacters:8/10\\n\r\nI think Yutta Seiyuu did well but he could improve more if it could show more feelings rather than Huh, Hah,Hee? The rest Seiyuus are fine to me since Sora and Miu VA are from Working!! And Chuunibyou\\n\\n\r\nEnjoyment: 10/10\\n\r\nAt first i don't feel like watching it but because of the storyline was interesting and heart warming, I enjoyed watching it. Nevertheless, it helps me to learn what family is all about. Thank you for having animes because anime do really bring some morals.\\n\\n\r\nOverall:8/10\\n\\n",
            "date": "2015-04-03T09:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 184598,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=184598"
        },
        {
            "content": "I am sure some producer in Japan watched Usagi Drop and thought \"This show would make a ton of more money if it only had more Moe!\". So he found a novel for LtMGIYF and turned it into an anime. Change the main character from a mature adult to the standard insecure College student, replace the one little girl with 3 fitting different stereo types and add in some quirky friends and neighbors to replace the more normal secondary characters in Usagi Drop.\r\nWhen I first saw this show on the list for winter, my first thought was \"oh, no! not more Tsunderes and Ecchi\". ButI checked out the first episode I was pleasantly surprised. There is really little to no Ecchiness (No panty shots, no nudity, no side boobs, some towel scenes and bare legs, but that is about it). All the girls ended up being being very polite and nice, if a little high strung. It still is a full tilt Moe fest however, and you should be prepared for that. In the end though, it is and adorable and entertaining show. It's sappy, sad, and humorous all at the same time. If you ever lost a parent at a young age, you'll probably cry your eyes out.\\n\\n\r\nIt's still early, but if you are an adult and liked Usagi Drop, you'll like this show, though maybe not as much. If you are a young, have a short attention span and mentally block out serious situations, you might even like this better than Usagi Drop.",
            "date": "2012-02-15T11:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 53935,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301927.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 3,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/grond",
                "username": "grond"
            },
            "url": "https://myanimelist.net/reviews.php?id=53935"
        },
        {
            "content": "The creator of Papakiki, Tomohiro Matsu, is a good person. (He has recently pass away, RIP) He would protect the characters from suffering and sacrifice the plot. \r\nUsually it's the other way, like Urobuchi Gen, writers would make the characters suffer in order to bring tension to the plot.\r\nSo is it a good thing? I really depends, I am not a person that cares a lot about plot so it's okay for me. \r\nPapakiki is a show that abandoned its plots for the reasons of love.\r\nThe story is not very good.\r\nThe premises is very good. If the writer really wants to take it seriously, ithas great potential.\\n\r\nHowever despite having a tragedy premise, the writer seems to keep preventing bad things from happening in the story. \\n\r\nPlot just stop developing every time it hit some heavy subject. \\n\r\nThis makes the show boring because nothing actually happened.  \\n\\n\r\nThe music doesn't fit too.\\n\r\nIts op is called ''Happy Girls'' even though it is about little girls losing both of their parents in an aeroplane accident.\\n\r\nThe ed is a piece of catchy electronic music which can destroy all the ''feel'' you've got from that episode. \\n\\n\r\nSo why do I like it?\\n\r\nIt is all about love and care.\\n\\n\r\nIt has one of the most likable cast of characters. \\n\r\nThe male MC is the most hardworking and responsible character I've seen in a while.\\n\r\nThe oldest girl is really mature and caring.\\n\r\nThe second girl is also very mature and has high EQ too.\\n\r\nHina is just pure cuteness.\\n\\n\r\nNo wonder why the MC, or the writer, tried to protect the girls so much.\\n\\n\r\nPapakiki is just a cute, lovable and really heart-warming show overall. \\n\r\nIt is not something spectacular with mind-blowing plot twists and have you crying for days. But if you want some to feel some love, you can give it a try.",
            "date": "2017-09-24T03:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 258473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6432186.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nbyung09",
                "username": "nbyung09"
            },
            "url": "https://myanimelist.net/reviews.php?id=258473"
        },
        {
            "content": "At first glance you might be hesitant on watching this because, you know, it's about a college boy having the responsibility of taking care of a few relatives. Although the idea of this might not sound so good to you it actually shows proficiency in the storyline, it's a bit shaking during the beginning though.\r\nStory: All I have to say is that if something like this ever happened to anyone, he would be the best to handle the situation. What would happen if you were a first year college student and all of a sudden you are now a guardian of 3 young relatives? Damn...The story is kept hold of pretty well. It shows the struggles that comes about and overcomes it with touching joy.\\n\\n\r\nArt: As an anime of 2012 I have to say I expected better character details but I can't be picky, maybe it's their budget cut or something I don't know, but the art itself (disregarding the year it was made) was done very well.\\n\\n\r\nSound: The sound is a near perfection, everything fits. The voices of each character seems to fit them perfectly, almost as if you would be able to meet them in reality.\\n\\n\r\nCharacter: Most of the characters are pretty cliche, although by that I mean just their character. What's not cliche is that different characters from different sections of anime come's together. You'll understand once you watch it.\\n\\n\r\nEnjoyment: Well this is my own opinion because enjoyment is something only you can experience, for me personally I think a young man taking responsibility of being a guardian is a pretty big deal in society so I wanted to see how an anime version would turn out as and honestly speaking it kept me interested. But there's not many people like me who enjoys these kind of anime. \\n\\n\r\nOverall: It was good, entertaining, and touching.",
            "date": "2012-09-24T10:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 73161,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1494197.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KnightsToFear",
                "username": "KnightsToFear"
            },
            "url": "https://myanimelist.net/reviews.php?id=73161"
        },
        {
            "content": "I'm 6'7\", and have a really deep voice. It takes a lot to make me cry, but this story got to me. I want a daughter, and this anime just made want 3. It has everything that captures a young girls innocence, crushes, and ways to deal with pain. I would also like to say that I am not a lolicon, but this anime makes me feel like being one. That sounded weird but it would make anyone feel even a little like that.",
            "date": "2012-08-02T14:40:00+00:00",
            "helpful_count": 6,
            "mal_id": 68475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1428131.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Guy_with_a_face",
                "username": "Guy_with_a_face"
            },
            "url": "https://myanimelist.net/reviews.php?id=68475"
        }
    ],
    [
        {
            "content": "It depends on different viewers to rate this anime, if this is your first time seen this anime, you might find it amusing and a funny(mostly because of raika and sako sempai), but there are some touching moments that shows the hardship that Yuuta went through when he lost his parents, his sister,and now try to raise the 3 daughter so they won't have to experience the same life as Yuuta. Its heart warming to see how much the 3 sister are caring for their uncle too.\r\nBut if you have read its light novel, like me, you might have different opinion in the animed version.This also depends on different readers. But in my opinion, the light novel is a must read, since its the original version of papakiki. The story line are quite different,only some major event are preserved, which is normal in light novel-anime adoption. Its quite sad to see it end so quick, since the novel are still on going. But some rumors said its going for 26 episodes. This is confusing and I don't really know about it, so I assume it to just be a rumor. Its also a bit disappointing to see they actually changed a few characters' personality (for example Sora-chan's club president). In the light novel, there are some more romance and a whole lot more of comedy, and there are several important events that explain a lot of things that we cannot understand in the animated series,including each character's history.\\n\\n\r\nYou can expect a season 2 coming, but might not be so soon. I expect more romance in this show and lets hope they can preserve the story line as much as possible.  But still, love anime and the light novels, i enjoy both of them very much.\\n\\n\r\nBy the way, i won't recommend the manga, in my own opinion, the artwork are not very well done, story line seriously went out of track, and too much mild ecchi scene, the original story might also have some too but not that much when compared to the manga series, some of those events didn't even exist in the original plot!!  No offence to the manga lover who are also reading papakiki in manga version, not trying to say anything bad about it. I read it too to make comparison between original, manga and anime. But if you like the manga then please continue your reading.\\n\\n\r\nJust saying how I feel about this animated series, in short, its a good show and i enjoy it a lot. Can't wait for season 2 to come.",
            "date": "2012-04-05T16:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 57993,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/qwh930812",
                "username": "qwh930812"
            },
            "url": "https://myanimelist.net/reviews.php?id=57993"
        },
        {
            "content": "Papa no Iukoto wo Kikinasai! is one of those animes that both lighten and enlighten your day: it tells you the story of a family caught in a very difficult moment and of a college student who goes out of his way to keep the three daughters of his sister together (yes, I know, two of them are stepdaughters), despite the hard time that this decision is going to give him. In fact the challenges will be numerous, but Yuuto (our MC) will make any sacrifice necessary for their happiness; and this is most certainly going to make you smile.\r\nStory: 9/10.\r\nThe story is in myhumble opinion one of the strong points of this anime. The plot is not at all complicated though, and it does not need to be, the situation is already tough enough for the girls: they discover that their parents' flight has gone missing and that their life is going to radically change, with them almost surely divided among the other relatives. Yuuto intervenes and chooses to keep them all together in his rather small apartment: from that moment onwards there are very few major events, while the show concentrates on the dozens of real-life problems that this brave but maybe too light-hearted decision will bring on the new family, mostly a chronic lack of money, of time and of sleep. It's this focus on realism that got me: this show didn't need any sudden plot twist to keep you worrying and caring about the main characters; and even with the many little difficulties and the sad event that was the cause of everything, it managed to remain a very heartwarming anime.\\n\\n\r\nArt: 8/10.\\n\r\nThere is nothing much to say about the art: the characters and the background are both very good, and the colours are as warm and bright as the show; as expected, the three main girls are drawn in detail and they sure look beautiful and cute.\\n\\n\r\nSound: 8/10.\\n\r\nI never pay much attention to the background sound of an anime, and well, as a matter of fact that's what it should do, not to catch the attention but to just convey a certain atmosphere suitable to the moment without the audience even noticing it: it worked. Also, the opening was great for me and I listened to it in its entirety every time.\\n\\n\r\nCharacters: 8/10.\\n\r\nSegawa Yuuto is the other strong point of the anime. Sure his decision was sudden and not very well pondered, but it was definitely not just on a whim: he was just repaying and even honouring his sister for doing the same thing years before. Also, his behaviour was even impeccable when he had to face the harsh reality of growing three children while going to college: not once he faltered, not once he put himself before the girls' well-being, and he worked as hard as possible to give them all that they needed to have the life they deserved.\\n\r\nThe girls too were not just adorable but seriously involved in helping back Yuuto not to kill himself in the effort of making everything right for the four of them (well, here I'm clearly talking about Sora and Miu). I could have a couple of perplexities that are not real downsides: first, the love that Sora feels for Yuuto seemed to me a little gratuitous, as if it was just decided that there had to be some love tension somewhere in the anime (this did not stop me from shipping Yuuto x Sora for the whole series); second, Sora and Miu seemed to remember to feel pain for the loss of their parents only when Hina was reminding them about it (but again, everyone copes with loss in different ways, so it didn't bother me very much in the end).\\n\r\nAs for the secondary characters, there were somewhat funny stereotypes as the cool beauty and the lolicon, but they were not too annoyingly flat to be a burden to the anime: they actually had their moments of seriousness and honest help, so sure, ok, I guess I forgive their other excesses.\\n\\n\r\nEnjoyment: 8/10.\\n\r\nThis was a very enjoyable experience for me: it didn't have the drama that such a premise could signify for an anime, but instead it focused on making you cheer up for this group of unlucky children and their new tutor. It was a formula that worked very well on me, although it could not maybe be the same for someone less prone to be influenced by kawaii characters and situations; anyway I think it's very likely that you will find yourself smiling throughout every episode, not only for their adorableness but also for their unforeseen strength.\\n\\n\r\nOverall: 8/10.\\n\r\nPapa no Iukoto wo Kikinasai! is an effective combination of light moments that you could find in any close family and moments in which the issues coming from the reality of their situation hit the characters (mostly Yuuto), and in both occasions you see them always react in the same way: with a contagious smile. I cannot but recommend it, as it will sure give your day what you need, be it a laughter or a tear.",
            "date": "2015-06-14T10:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 190313,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4669530.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Bernstein",
                "username": "Bernstein"
            },
            "url": "https://myanimelist.net/reviews.php?id=190313"
        },
        {
            "content": "this story is great, some people may have different opinion though.\r\nif you kinda want to get the feeling of what happens when someone died in your family and you have to move somewhere else, this is just right. \r\nthis anime have a nice plot about a possibility of what might happens once both the parent of some children pass away by an accident. the outcome could be both good and bad, but the best thing is never to give up.\r\nalthough this anime could make some people feel kinda.... childish... it's still great, and makes you somewhat feel the burden of becoming an older person.\r\nthey dohave a bit of fan service, which if your somewhat a lolicon you might like some of the scene ;) \\n\r\nOverall it was interesting, for me, in a way that makes me feel kind of the responsibility that could be install for anyone in the future, of becoming a parent.",
            "date": "2012-05-01T19:27:00+00:00",
            "helpful_count": 6,
            "mal_id": 60161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/128889.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pakin",
                "username": "pakin"
            },
            "url": "https://myanimelist.net/reviews.php?id=60161"
        },
        {
            "content": "This title is oh so misleading! As soon as I stumbled across this anime, I laughed at why anyone would call something \"Listen to me, Girls. I am your Father!\", and seeing as \"comedy\" was the genre, I immediately expected something terribly seedy. But boy was I wrong! This is the biggest testimony to why no-one should judge a book by its cover. This anime turned out to be a very inspiring and heart-warming story about how a young man takes on the challenging responsibility of caring for three young girls and how they connect as a family, even in the toughest of situations.\r\nThe twooverall themes of this anime are solidarity (sticking together through everything) and what does it mean to be a family. Yuta, a college student, opts to take care of three of his nieces following the death of his sister. At the beginning, it seems a little awkward and rushed as the girls somehow just find themselves in this one bedroom apartment by the third episode as soon as their parents have died, but after the first few episodes, we get to see their lives play out and how each of them is affected by the new circumstances that they've been thrown into. \\n\\n\r\nAt first instance, the girls are soooo adorable!! But even beneath the kawaii factor, there's an edge of reality added to the girls as you see more of their back-stories and the way that they handle living in such a tight space, with very little sleep, and with the responsibility of running a household whilst keeping up with school. It's easy to get sucked into the positive and fighting spirit that these girls display, and as the story goes on, they start to impact their neighbours and friends as well. I would have liked to see even more in terms of their back-story and there could have been more of a focus on the emotions of the girls rather than just how they manage themselves. But for the space of 12 episodes, there was just enough character development to warrant a relatively high score on my part.\\n\\n\r\nBut whilst the character and relationship development was commendable for the girls, Yuta was not really focused on, except for at the beginning and at the end. But really, he was the one responsible for the whole situation, so he would presumably have been through a lot of emotions and concerns! There were snippets of his feelings here and there, but he seemed to be at work the whole time... which is reasonable I suppose (since he was the main money-earner). But considering that he was one of the key protagonists, I was a little disappointed with the attention that was given to him as a character and I would have liked to see more depth in his development as a person than what was displayed for most of the episodes; fortunately, the last few episodes of this show only just made up for the lack of focus on Yuta. \\n\\n\r\nOverall, I enjoyed watching this show because of the progression that you can see in the relationships between the characters and the sense of family that develops throughout the episodes. It starts off as sad, but really, it is a fun and heart-warming show to watch. And who can complain about the kawaii-ness of the girls, they are so cute!!\\n\\n\r\nSo don't be put off by the title, this is definitely something worth checking out if you're looking for an anime revolving around the theme of family and togetherness.",
            "date": "2013-09-17T05:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 113207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1842680.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tish92",
                "username": "tish92"
            },
            "url": "https://myanimelist.net/reviews.php?id=113207"
        },
        {
            "content": "If you want another show about ecchi, harem comedy with lolis... This is not the anime for you.\r\nIf you want a show about familial bonds, a realistic take on raising children and feels..... This is not the anime for you.\r\nPapakiki is an anime that tries to be all of the above, but ends up becoming a Hodge podge of tropes with no set narrative, or storyline.  The only saving grace of this show is the above average OP and some of its character designs.\r\nThis is an adaptation of a light novel of the same name that has been completed with 14 volumes.  3of which has been translated thus far by the fanbase with no progress being made on the rest, as such, if you are interested in following the story your out of luck.",
            "date": "2017-05-20T09:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 248138,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/elricboy",
                "username": "elricboy"
            },
            "url": "https://myanimelist.net/reviews.php?id=248138"
        },
        {
            "content": "Ah, children.  Some people want to have them, to love them, and to cherish them for as long as they can.  While others, want nothing to do with them, and would rather stay their usual lives that don't involve the little people.  And then there's Yuuta, a college student, that puts himself in a very unlikely, but heartwarming scenario.  Yes, this review is about Papa no Iukoto wo Kikinasai, or Papakiki, an anime, that can touch many people's hearts.\r\nStory (8/10): After a sudden incident that led to the disappearance of their parents, Yuuta, the main character, chooses to take care ofhis 3 nieces that lost said parents.  With a set of conspiring events that lead up to the anime's rather satisfying ending, Papakiki is an emotional rollercoaster with fun and wonderful little bits in between.  The story itself has almost no flaws, in my opinion.  The story is told through the perspectives of Yuuta, and his 3 nieces, Sora, Miu, and Hina as they live out their lives together, in a small, one room apartment.  It's because of this storyline, that the anime itself proves very well in terms of execution.  It focuses mainly on the problems, trials and tribulations, as well as the fun and happy times that they have together, which, in turn, creates a wonderful real life feeling in this extremely unlikely scenario.  While yes, the anime did go on several tangents that seemed a bit pointless at times, I never once felt like I didn't like how the anime was going.  It all came together wonderfully, with little to no time wasted to convey its storyline.  \\n\\n\r\nCharacters (9/10): For the most part, I really enjoyed the characters.  Yes, there were some really strange side characters, (really strange), but for the most part, the cast was a very likable group, most of them.  First is Yuuta, a first year college student.  Yuuta is a very hard worker, and has shown many times that he never gives up.  Though this is a bit generic, Yuuta seems different.  His reasoning and attitude don't seem too cliched, and his personality actually fits in with the story really well.  Though he doesn't get much screentime towards the end of the series, he does play an extremely important part as shown through the girls' perspective.  Next is my favorite of the 3, Sora.  Sora, as the eldest of the 3 sisters, is a very interesting character.  Though she does have the stereotypical tsundere attitude towards Yuuta, (hint hint), she has shown to be very hard working as well, and extremely considerate towards him and her siblings.  She shows a lot of growth, as she grows to understand her uncle more and more, slowly becoming more mature and grown up as the series goes on, such as making sacrifices and taking responsibilities for certain actions.  Next is Miu.  As the middle sister, Miu possesses a very sly and childish personality, constantly teasing her older sister, and being all around mischievous.  Just like her older sister, she grows to take in more responsibilities, and becomes a bit more mature.  She, like the rest of her family, love each other dearly.  And last, is the youngest of the 3, Hina.  As a little toddler that hasn't reached preschool yet, Hina is very childish.  Her personality is portrayed as an innocent child, unaware of some things that go around her, while at the same time, being just one of the most adorable things you will ever see.  While the individual characters are good in and of themselves, it's how the 4 of them function, which really makes this anime.  Because the 4 of them care and love each other so much, there is almost no conflict between them.  Because they share such a bond, the storytelling itself exceeds greatly into a very heartfelt story.  Other then the main cast, there's a good chunk of side characters, most of them are normal, and some of them are not.  Especially the one called Sako.  -__-  (No, just no.)  The side characters add to the story in a very good sense, providing the main character some knowledge, and adding to the anime as a whole.\\n\\n\r\nArt and Sound (8/10 and 7/10): Personally, I like the art.  The art isn't too complicated or detail, and it's very pleasing to the eyes.  It's very natural feeling, and all around good to look at.  Yes, there are unnecessary fanservice scenes included with this anime, but it doesn't really impact too much on how nice the actual scenery looks.  The sound is something I'm a bit on and off on.  It's opening titled \"Happy Girl\", is a very bright and well, happy, sounding piece of music that I found myself enjoying time and time again as I moved onto the next episode.  While yes, it does sound somewhat generic, I did enjoy it thoroughly.  Aside from that, there are only 2 more tracks that I think deserve a mention.  One is the ED, which, I'm not a fan of.  Personally, I don't like the dotty, techno music, so I'm not a fan.  The other one is a track that is played by the soft piano and violin on constant repeat.  The anime literally only has this one track playing in the background, and they use it in the way similar to how Elfen Lied plays its theme.  The theme itself is played in many fashions, like happy or sad, and overall sounds good, but it's actually quite forgettable most of the time.\\n\\n\r\nPersonal Enjoyment (9/10): To me, family is important.  I see my own family as a personal safety net for me, and I treasure them dearly.  Looking at this anime, I could see just how strong their bond was, and it warmed my heart.  The anime throws many problems for the main cast, essentially, testing them on how close they are to each other, and how they would react/change to the problem at hand.  As the series goes on, the characters start to change and grow, adapting to their new lifestyle, and having fun with it.  It proves that no matter what, through thick and thin, family will always be there for you.  (The characters do face a lot of hardships.  A lot.)  While the series to me, ended on a really nice and touching note, I felt like I needed a bit more.  The animators skipped through a pile of images to a conclusion that one could figure out easily, but I felt like I needed an actual anime scene in order to get the full emotional feel of it.  Whatever, I'm a sucker for these kinds of things; it was good enough.  All in all, Papakiki is a wonderful little series about a very unlikely, but touching set of circumstances, and I would highly recommend this to anyone who wants to see a nice and touching family story.",
            "date": "2014-01-13T22:59:00+00:00",
            "helpful_count": 5,
            "mal_id": 128703,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=128703"
        },
        {
            "content": "This story was about loss, Three girls loose their father and mother (for two of them it was their step mother) and where going to be split up into different house holds Yuta was the girls step mother/mother's brother she took him in when she was younger and raised him after their parents die. So after loosing his sister he takes the girls in but he is a poor college student himself but he still makes ends meat for him and the girls with the help from others. \r\nThis anime is about growing up.\r\nLearning the value of family.\r\nHaving hope even when you loose everything else.",
            "date": "2016-01-14T01:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 208485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4183831.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lynxessa",
                "username": "Lynxessa"
            },
            "url": "https://myanimelist.net/reviews.php?id=208485"
        },
        {
            "content": "One of the most enjoyable series I'm yet to watch! Thrown into a world where a college student has suddenly taken responsibility for the children of his recently passed sister and her husband! Looking for a good slice of life, comedy and even romance story? Well look no further! This is the perfect show to hit you with a load of emotions!\r\nStory 10/10: I just loved how the story was laid out so well! This is the first type of series I've watch so far where they went in this direction.. I definitely think they could of added in a load of sadder moments intothe series but I think it was fairly balanced between the two. Story is just an emotional roller coaster and you won't want to get off until the end! I'm glad that it ended in the way it did with the OVA as well, even though some people might be a little grossed out? I thought they went in the right direction with it! The ending is by far one of the better ones I've seen from a show so far.\\n\\n\r\nArt 10/10: I love these type of anime with this type of anime style! The really up'd the animation with the characters as well by not making it to unrealistic. \\n\\n\r\nSound 9/10: I'm not fussed on sound but still thought that it sounded well..\\n\\n\r\nCharacter 10/10: The main characters are amazing, it was amazing to them all come together to become a family like that with the support of others. I never thought I could fall more in love with the youngest Hina! She was so adorable and cute! God I wish I could have a daughter like that! The character's all worked well together and each brought something new to the mix to benefit to the series! You had the typical love crushed girl who is in love with someone's who older and protective! You have the typical cute and young girl whose always making a fuss about everything! But yet I was surprised to see a young member of the family impact it so much and it made it 10 times better where they added her. \\n\\n\r\nEnjoyment 10/10: I'd re-watch this in a heart beat and still enjoy it if I watched it 3 times over, it was so enjoyable that I watched it over night! \\n\\n\r\nOverall: Looking for a well balanced story that will leave you heart broken when it finally ends? Look no further and watch the show! It's an amazing story and it will even make the manliest of men cry when they see the sad and happy moments of the anime! It was really something else and I'd recommend it to anyone!",
            "date": "2018-03-27T03:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 275295,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7073275.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RainbowSlowmo",
                "username": "RainbowSlowmo"
            },
            "url": "https://myanimelist.net/reviews.php?id=275295"
        },
        {
            "content": "Cuteness overload alert!! This anime was truly a very cute and heartwarming show to watch. Every episode twisted my emotions one way or another, not so much in a sad way. There are a few sad moments, but once you invest time into the characters its hard not to feel for them. Although if you aren't a big fan of moe type anime, you should still give this one a shot.\r\nThe downsides to this anime would probably be that there is little to no music throughout the show. \r\nThe characters have a very mature personality based on the ages of the characters in the show.All in all a very fun and enjoyable anime to watch.\\n\\n\r\nI definitely recommend you give this one a go!!",
            "date": "2016-06-16T18:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 220901,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4751347.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Chiaki__Nanami",
                "username": "Chiaki__Nanami"
            },
            "url": "https://myanimelist.net/reviews.php?id=220901"
        },
        {
            "content": "I started watching this show for some loli slice of life and moe, so i could drool over these and keep my brain in trance. Though the first few episodes satisfied me and made me thirsty for more, the later ones were found to be less carefree and more serious. Don't get me wrong, i like the show, but never did i expect seriousness in this loli, slice of life, 3 girl 1 boy setting. I never did. Yet the show makes its point through poetic devices , delivers ample blushes and cute girls. So i am happy. \r\nStory: 6/10\r\nThe story is quiet simple andunderstandable. Though it may be questionable to allow an university student to cater the needs of 3 girls and one among them being 3 years old all alone by himself. Come on, it's anime. Anything can be done to get a selling point scenario. But the story shows a more practical side of the scenario as they appear to struggle for everyday activities. I felt the story to be yearning for sympathy from the viewers. I couldn't enjoy the girls or the romantic side because of this very reason. The story moves at good pacing keeping a good balance between humour and things of importance. I especially like how a deeper view of the happenings in story was presented through fantasy dreams of a character. I would say the date episode exposed the true level of the story; it was beautiful. The ending was not to my liking, but may be contrary for many. There are lot of moral lessons in this anime that are of grave importance in one way or the other. Therefore, i like the story. \\n\\n\r\nArt: 8/10\\n\r\nI watched the BD version. Apart from the blushing and glowing bodies, the girls were the best looking. At first, I believed the show to be a harem! The attention to detail is superb. The house, the shopping district, the school, the train station, every place is well drawn in detail. The colour felt warm and happy, setting the mood bright. The night sky, evening, lighting physics are also praiseworthy. \\n\\n\r\nSound: 7/10\\n\r\nI listened to Japanese Audio with English subtitles. The voice actors have done a great job bringing out the best in every character. I don't know Japanese, but the voice was pretty decent and immersive. The OP and ED is also nice. The ED melody suits lot of moods, so i like it more.\\n\\n\r\nCharacter: 7/10\\n\r\nThere are ample many characters in this show doing main and supporting roles. The loli character is indeed an attraction. There is no over populated scenarios. Though the main casts are unique, there is not much about them. This does not become an issue since the story moves forward at a good pace as i had told before. The club members are indeed an interesting bunch. The monotonous talk is something that i will always remember. For the serious and sympathy demanding nature of the story, i could never think dirty of any characters, but i digress. This is not an anime to have dirty thoughts about in the first place.\\n\\n\r\nEnjoyment: 7/10\\n\r\nGood story, praise worthy art, pleasing sound, diverse characters. But it depended too much on sympathy. The lead male should have made a better practical choice at least at the end. There is lots more to complain about the male lead. But that just ruins the whole story, so i digress. As an anime, this is a good watch.\\n\\n\r\nOverall: 7/10\\n",
            "date": "2017-08-26T09:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 256300,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6034757.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/reun100e",
                "username": "reun100e"
            },
            "url": "https://myanimelist.net/reviews.php?id=256300"
        },
        {
            "content": "This is a very relaxing and enjoyable series despite the serious plot at hand, which revolves around the daily lifes of three girls, after an unfortunate accident leaves them orphaned. \r\nBefore I continue I want to state that this review has been written to clear up a misunderstanding that a lot of people seem to have on this series and spoilers will be involved. If you don't want to read this kind of review stop now & read a different one. \r\nThis series follows an episodic pattern but all episodes are more or less linked to each other and the story progresses with little tono filler elements. The synopsis describes the story perfectly - an average college students' life is changed for good when his sister and her husband go missing in a plane accident. \\n\\n\r\nThere are four main characters, Yuuta, Sora, Miu and Hina. While there are supporting characters here and there that will pop up in almost every episode I was under the impression that they were plot-irrelevant since the series seemed to be focusing on more important themes i.e being an orphan. \\n\\n\r\nNow, despite what other people who have watched this series say, this is NOT a harem anime. There are absolutely no harem elements in here. First off the 3 main female characters are way too young for any harem to be added in, they are 3 (Hina), 10 (Miu) and 14 (Sora) respectively. The 3 year old plays around all day and is there to add cuteness to the series. The 10 year old, despite showing maturity beyond her years has no romantic or, god forbid, sexual attachment to the male character. The 14 year old does seem to have some romantic feelings going for Yuuta, but the makers didn't focus enough on that to give it some clarity. I.e we don't know whether it's genuine love or just simple infatuation. \\n\\n\r\nAs for other female characters... Yuuta hardly even talks to them. There can be no harem in an anime unless there's something going on between the male protagonist and other female characters and in this anime - there's nothing of the sort. A few ambiguous conversations and an eye wink do not make a harem anime.\\n\\n\r\nMoving on - the sound and art were exceptionally good for a 12 episode tv series. Voice acting was authentic and art had that \"eye-candy\" effect. Both the opening and the ending songs were appropriate for this kind of anime. They weren't too ecstatic but not too serious either, they were just right. \\n\\n\r\nAll in all a very good anime that I would recommend to everyone who's looking for something... relaxing. Relaxing is the right word here because this anime isn't dark or serious enough to make you cry, instead it presents you with a problem the main characters are struggling with and it gradually solves that problem and in the end you connect with the characters and feel happy for them. \\n\\n\r\n8 out of 10 points from me.",
            "date": "2012-09-08T12:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 71851,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=71851"
        },
        {
            "content": "My score is a little random here, but I'll briefly explain: The concept is amazing. It really strikes true to the heart of a young man who wants to give back to the memory of his sister, who took away from her own teenhood and college years to raise him, by taking in her daughters so they won't be separated. \r\nThe problem is that while this is a really heartfelt story, it gets a little too caught up in obligatory echii moments, psuedo-incest and loli-complex jokes that make me uncomfortable. I dropped the series because I felt like I couldn't come to terms with thosethemes.",
            "date": "2014-12-05T03:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 171085,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChipNoir",
                "username": "ChipNoir"
            },
            "url": "https://myanimelist.net/reviews.php?id=171085"
        },
        {
            "content": "There's already a ton of other reviews so I'll keep this short and to the point.\r\nIf you're someone who has recently moved out on your own, lost a beloved family member, or already have kids; Then this show will hit you in the feels, and keep hitting until you're a wreck and you'll love every minute of it as you cry yourself to sleep.\r\nThe show isn't too terribly sad, and it's definitely got it's nice happy fun time moments, what really makes it impactful though is how damn realistic it is. There's no cute, little, perfect siblings who adore their new big bro, it feelslike actual people, real interactions etc. It's fantastic, sad, and nothing is perfect, the flaws found in living is what brings this anime to life and that...that is what makes it so beautiful.\\n\\n\r\nThat said you might find some things about this anime annoying, I'd say the only real drawback would be a certain running gag, but even with that this anime managed to move me.",
            "date": "2015-09-07T10:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 198031,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/LG-W-Hat",
                "username": "LG-W-Hat"
            },
            "url": "https://myanimelist.net/reviews.php?id=198031"
        },
        {
            "content": "Story:\r\nI-I'm a huge fanboy here but I say is amazing. I enjoyed every episode of it and rewatched it alot of times. Is it kinda weird watching it? Sure but come on who doesn't like some kawaii sister anime!\r\nArt :\r\nJUST TOO KAWAII! Everyone looks soooo kawaii for some reason here. Espically Hina, she's drawed to just pleasure all pedophile ;)\r\nSound:\r\nOpening did it all for me. The soundtrack is also quite good, would shell cash out for it\r\nCharacter:\r\nImpossible to rate them, I like all of them too much and very attached to them. Not a whole lot of background but is enough for me to knowthem\\n\\n\r\nEnjoyment:\\n\r\nJust go watch it!\\n\\n\r\nOverall:\\n\r\nMy first anime and still is my best anime. I can fight you if you talk shit about this! Everyone should just give this a shot!",
            "date": "2017-06-23T04:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 250746,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5914208.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PinkyForever",
                "username": "PinkyForever"
            },
            "url": "https://myanimelist.net/reviews.php?id=250746"
        },
        {
            "content": "Story: 6/10\r\nFor most of the story, they didn't really do anything to advance the plot. Some people might've found the comedy and the episode by episode story to be interesting, but subjectively, it wasn't for me. The only interesting bits were the major plot points at the beginning and ending of the show. \r\nArt: 6/10\r\nArt wasn't anything phenomenal. The color palette was more wide range than usual shows, but the animation was average. Characters and art style are somewhat unique, but not anything too outstanding. \r\nSound: 6/10\r\nOST, Opening, and Ending were average. The background sounds/music were average as well. Nothing phenomenal, but nothing bad.\r\nCharacter: 6/10\r\nTheonly ones with a somewhat unique personality that made an impression on me was the youngest child and the club president. Everyone else was a bit average and their character tropes have been somewhat used before. \\n\\n\r\nEnjoyment: 4/10\\n\r\nThe first and last few episodes were the only ones that entertained me. The other ones were a bit bland due to the content being purely subjective and not to my tastes. \\n\\n\r\nOverall: 5/10\\n\r\nIt's a cute show with only 2 major 'arcs' of the story. Aside from that, it's mainly just antics and Slice of Life episodes that barely advance the plot. Other people can find this enjoyable, but this show just wasn't for me.",
            "date": "2016-08-20T18:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 227229,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4841846.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hitori_Samishiku",
                "username": "Hitori_Samishiku"
            },
            "url": "https://myanimelist.net/reviews.php?id=227229"
        },
        {
            "content": "A family should be together. Pope in Iukoto wo Kikinasai! is an anime that tells the story about an almost adult boy, who ends up becoming guardian of three girls, who were stepdaughters and his sister's daughters. I honestly thought it would just be more of a slice of life anime with ecchi and a bit of romance (that part I hit, unfortunately) in which the protagonist would percerber how family is something important through interaction with his nieces and with the new husband of his sister. But, to my surprise, no, soon in the second episode is placed the great plot in the anime,he lost his only family, but with this he also gets a new one. The characters are very interesting and they complement each other well, the drama parts placed around them also worked very well, it is difficult to imagine a child of three years understanding what death is, and it happens here too, our cute little heroine he does not understand why he can not see his parents, but he keeps moving forward hoping to see them again. What really disappointed me was the novel, it's that of the uncle and the niece, and the \"main\" girl in the play is left in the background. But the anime is still good, give it a try. (I apologize for my spelling mistakes)\\n\\n\r\n(PT-Br) Uma família deveria ficar junta. Papa no Iukoto wo Kikinasai! é um anime que conta a história sobre um garoto quase adulto, o qual acaba por se tornar guardião de três garotas, que eram enteadas e filhas de sua irmã. Eu sinceramente achei que só seria mais um anime slice of life com ecchi e um pouco de romance (essa parte eu acertei, infelizmente) em que o protagonista iria perceber como a família é algo importante através da interação com suas sobrinhas e com o novo marido de sua irmã. Mas, para minha surpresa, não, logo no segundo episódio é colocado o grande plot no anime, ele perdeu sua única família, mas, com isso ele consegue também uma nova. As personagens são bastante interessantes e elas se completam bem, as partes de drama colocadas ao redor delas também funcionou muito bem, é difícil imaginar uma criança de três anos entendendo o que é a morte, e isso acontece aqui também, nossa pequena e fofa heroína não entende o motivo de não poder ver seus pais, mas continua seguindo em frente com a esperança de vê-los de novo. O que me decepcionou de fato foi o romance, fica aquilo de tio e sobrinha, e a garota \"principal\" da obra é deixada como segundo plano. Mas o anime continua bom, dê uma chance.\\n",
            "date": "2019-05-01T13:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 307585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7279162.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xRhune",
                "username": "xRhune"
            },
            "url": "https://myanimelist.net/reviews.php?id=307585"
        },
        {
            "content": "In life we never experience the hardship of losing our parents but the possibly is there for some. Papa no Ikuoto brought some of the best slice of life when a university student takes care of his three nieces after his sister dies in a plane crash. The hardship that all four of them had to endure is really heartbreaking. What we have is a good well written story. Props to the author. \r\nHopefully everyone who watches this anime will see past the loli, lolicon (yep), and a touch of ecchi. This anime is for every slice of life genre lovers out there, I canguarantee you that. \\n\\n\r\nOverall Rating\\n\r\n8.0",
            "date": "2012-10-11T18:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 74693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372117.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Prind",
                "username": "Prind"
            },
            "url": "https://myanimelist.net/reviews.php?id=74693"
        },
        {
            "content": "Listen To Me Girls, I Am Your Father!\r\nFrom the very beginning I really enjoyed this art style. The large hair styles are a bit over the top, but it all payed off. I really enjoyed the the use of wind, and hair and all of the other types of small details that made the animation absolutely fantastic. Something I wasn’t to happy about was the amount of Fan Service that seemed to occur. Now I have said before that I am not opposed to fan service, but it really focused on the fourteen year old Sora, and the 10 year old Miu. Now there wasno real nudity so there is that but plenty of innuendo which takes us to the story.\\n\\n\r\nThis story revolves around a college student, Yuta, who unexpectedly is watching the three kids of his older sister and her husband. Through a twist of events Yuta has to take all three of the sisters--Sora (14), Miu (10), and Hina (3)--and keep them until further notice. There is a romantic interest that is apparent from the very beginning from Sora to Yuta, and while he is more interested in a girl in a club he accidentally joined, and how their relationship develops is fun and witty to watch.\\n\\n\r\nThe music here is really fantastic. The opening song is extremely catchy and shows a great example of how the characters interact with each other. While I also love the ending song, I felt that there was a number of times that the song was so upbeat, and when the episode ended on a heavy cliffhanger, it hit me so hard with the happy music that really tore me out from the story. This happened two or three times and while it didn’t hurt the show as a whole, I felt that at the time, it just hurt. But I was hurting from the story, then it just flipped over and I didn’t like that.\\n\\n\r\nGoing into the show I had no idea what I was going to get. I was expecting something dealing with Daddy/little girl relationships, and that wasn’t what it was at all. It was overall a story about taking on responsibility when it wasn’t planned. I grew to love each character because they each had their own personality and could stand on their own without one of the other main cast around. While this review might be rather short and sweet, this show will not be that way for watchers. It will grow and grow, and when it does end after a short 12 episodes, you will want to find a way to keep the story going. However, the story comes to a natural stopping point at the end of the final episode, so the choice of continuing the story is really up to you. \\n\r\nOverall Rating: 9.9/10\\n",
            "date": "2016-04-24T12:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 217067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4688864.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Chiburo",
                "username": "Chiburo"
            },
            "url": "https://myanimelist.net/reviews.php?id=217067"
        },
        {
            "content": "Wow... This was just way above my expectations! It was simply beautiful, a true life lesson... With a name like this, it's almost impossible to think how it's like without reading at least the synopsis, but this one has a deep meaning within... It's about growing up and facing the real world with your head up high... Amazing...\r\n{STORY - 10/10}\r\nAt first, it may not look too impressive, but a small twist would change Yuuta's life once again, like when he was a child. After the accident that took both his sister and brother-in-law's lives, his nieces were about to be separated from each other, aseach one of them would live with their closest relatives.\\n\\n\r\nThe actually imature, still, kind decision of taking all the girls away to live together, on his apartment, seemed the best way. However, Yuuta had just begun college and worked only for his own keep. Would he ever be able to look out for everyone, work harder and go well with his studies?\\n\\n\r\nA lot of problems will be getting on their way, but the new Takanashi family has strong bounds and will stay united until the end... Friends will help on difficult moments and Yuuta will struggle to make everyone happy... That's what it's all about...\\n\\n\r\n{ART - 9/10}\\n\\n\r\nReally unique features were used, as characters have a simple design and, still, look so different from anything I saw before. Lifted noses and small eyes, with big pupils are what called most of my attention. And I must say that the ED theme for this anime was the most perfect and gorgeous one i've ever saw! The incredible use of a huge variety of special colors, with amazing gradient effects and a sweet animation made this ED so wonderfully original... LO-VED-IT!!!\\n\\n\r\n{SOUND - 10/10}\\n\\n\r\nSongs made for this one also don't let you down. \"Happy Girl\", from the OP theme, fits it's cheering and soft animation so much and the song itself gets so addicting after hearing it over three times! Oh, and that electro-pop song chosen to background the perfect ED theme, \"Coloring\"... Just like the own name says, you can see it was made to be a totally flawless match and, just like the OP song, you may be unable to forget this one so soon...\\n\\n\r\n{CHARACTERS - 8/10}\\n\\n\r\nThey had a really interesting development and not only their personalities, but their appearance as well are really distinctive. First, we have Yuuta, a boy that is turning into a man and gets into all this mess just by following his heart, proving that a emotions and kindness are deep characteristics from his mature personality. His senpai, Raika, a serious woman, is just adorable and her skills at cooking, combined with a mature appearance, make her look as a real mother.\\n\\n\r\nTalking about the girls, both Sora and Miu have absolutely no blood relation with Yuuta. Despite that, not only them, but Hina as well show affection just like a real daughter would. Sora is the one interested on Yuuta. Being a sensible and strong-willed girl makes her the most responsible amoung the girls. Miu is the middle sister, energetic and cheering, always trying to make everyone smile. And Hina... She is just the most authentical reference of a sweet, cute and lovely little girl... The way she talks, moves and acts makes her very popular amoung anyone nearby.\\n\\n\r\nAnd not leaving aside this notable observation, Hirano, from H.O.T.D. grew up, changed his name to Sako and is now the president from the Observation Club, a lolicon pervert without any bounds... The first moment I saw him was like a flash: I've remembered Hirano almost instantanely! Funny note, don't mind my joke... But this coincidence got my attention on first sight!\\n\\n\r\n{ENJOYMENT - 10/10}\\n\\n\r\nAll I can say is that what I've learned from here is something that I'll take with me for the rest of my life. It's really funny and distinct, but my true enjoyment is based on the important things we can absorb from watching anime. Totally enjoyable and a must-watch, for sure!\\n\\n\r\n{OVERALL - 9/10}\\n\\n\r\nThe life of an adult isn't easy. Living on your own, paying your own bills... Things get even thougher after the first child appears. Yuuta didn't know a thing about parenting. Still, he saved three little sisters from living apart. An important lesson, based on maturity and responsability, mixed with both funny and dramatic moments... Yuuta made his decision and he now has to take care of his nieces... Understanding how is it to be a father will change his way of thinking. This will turn him into a responsible, admirable and sweet man...",
            "date": "2013-11-16T16:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 120523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=120523"
        },
        {
            "content": "story: 6\r\nThis anime is clearly about the concept, not the story, but it sure isn't bad so far\r\nart: 8\r\nI really like how it's drawn.\r\nsound: 7\r\nThe opening is very addictive, but the ending isn't that special. Maybe a nice elevator song\r\nCharacters: 9\r\nI think sora is quite annoying: she likes the 'godfather' but because of that, she's scared of him. He has no idea what's going on and that's a little annoying. I love the other characters. Hina is very bright for her age. I like she's not some kind of dumb baby that only cries. Miu is annoying to everybody but that is very funny. Sheacts exactly her age. \\n\r\nThe best character of them all is Raika. She's very weird but likeable anyway. Very original\\n\\n\r\nEnjoyment: 7\\n\r\nIt has a lot of nice jokes and everything fits right\\n\\n\r\nOverall: 7",
            "date": "2012-03-02T09:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 55179,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/926331.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hououin-Kyoma",
                "username": "Hououin-Kyoma"
            },
            "url": "https://myanimelist.net/reviews.php?id=55179"
        }
    ],
    [
        {
            "content": "With this anime, you get a fair share of kawaii, and that's pretty much it. It never drove me to tears yet it never made me laugh out loud. There were moments of adorableness and that's pretty much it. The story wasn't very realistic but that aside it wasn't fantastic. The art was okay with only the character design to be good. The sound wasn't fantastic either. There were many times I was bored but other then that the characters were very cute. 6/10 - It's okay.",
            "date": "2013-10-02T16:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 115137,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3168833.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeAwesomes117",
                "username": "AnimeAwesomes117"
            },
            "url": "https://myanimelist.net/reviews.php?id=115137"
        },
        {
            "content": "After the first episode of this anime, I hastily rated it as a 1 and wrote a nasty comment on my page. But then I was shocked to see so many positive reviews. So I gave it another chance. I am very glad I did.\r\nThe last 5 or so episodes had me crying the whole time. Maybe I'm a bit of a child, but I always prefer my media to have some sort of life lesson, and this one is clear: Life can be hard, but if you stay close to the ones you love and be happy, that is all you will need.\r\nNumbers:\r\nThe storyis the main reason to watch this. The art is nothing to rave about, but the outro is really cute. The sound is fair. With only twelve episodes and so many characters, it's amazing how much depth was given to some of them.\\n\\n\r\nI absolutely adored this anime, but I can't give it a ten because there was a lot of kiddy-loving fan service. It's really bad, and at times it made me fear for my own nieces. If they had left that out, and removed the perverted character who wants the young girls, this would be a ten for sure.",
            "date": "2013-06-28T10:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 102799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2757063.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PlungingHornets",
                "username": "PlungingHornets"
            },
            "url": "https://myanimelist.net/reviews.php?id=102799"
        },
        {
            "content": "I think this anime is a great example of something that could happen in someone's life and shows it in one of the best possible ways.\r\nThe main character has to take care of 3 kids that his sister has left for him to do, why you ask? Watch and found out. The reason he does this is because his sister took care of him when he was young and despite his sister having a life of her own, she still cares for him.\r\nThis anime would make you think \"what would you do if you were in his shoes?\"\r\nI think this anime shows a great storylinewith a realistic plot with great character development and also shows how hard life can be.\\n\\n",
            "date": "2013-02-18T09:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 87149,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1730617.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KurokoShadow75",
                "username": "KurokoShadow75"
            },
            "url": "https://myanimelist.net/reviews.php?id=87149"
        },
        {
            "content": "I figured that this was going to be a horrid assault on kids everywhere when I seen the age of one of the girls in this show. To my complete surprise it was not. In fact it was the opposite. It showed the realistic and rational side to a collage kid watching two school kids and a toddler. As we know from the synopsis, he is going to eventually not just be babysitting, They can still ruin it for themselves if they overdo it. However It has one thing going for it, I was so surprised by it that it made me write my firstreview.\\n\\n\r\nQuick review score-----\\n\r\nstory-line(backstory and character dev.)__:  4/5\\n\r\npresentation(sound and art)____________: 4/5\\n\r\noveral  ---  4/5\\n\\n\r\nseen episode one only",
            "date": "2012-03-28T00:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 57203,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/343281.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/blaze1514",
                "username": "blaze1514"
            },
            "url": "https://myanimelist.net/reviews.php?id=57203"
        },
        {
            "content": "Enjoyable story, no train wreck at the end!\r\nThis story was cute and enjoyable. The premise is that three sisters are being raised by their uncle Yuuta, who is still in high school. It had a tragic thread woven into it, but in a sense that was necessary to drive the story line. Beyond the early tragedy, the story stayed fairly lighthearted and cute the entire time, with some occasional serious moments here and there. The voice acting and music was well done and added to the enjoyment of the story. I recommend this if you want to enjoy a shorter and lighter anime series.",
            "date": "2014-08-28T18:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 158339,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3075337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bearvarine",
                "username": "bearvarine"
            },
            "url": "https://myanimelist.net/reviews.php?id=158339"
        }
    ]
]