[
    [
        {
            "content": "Overview:\r\nIt's the 4th of July everybody! As an American, I will celebrate my country with one of our time honored traditions...beating the dog shit out of something weak and defenseless. Everyone is lining up to shit on Eromanga Sensei. Worst animu of the year! Sure that's pretty low hanging fruit, but I'm going even lower. If bashing Eromanga Sensei was the equivalent of America's pummeling and carving up Serbia, picking on poor Berserk 2017 is like the 1983 invasion of Grenada! \r\nStory:\r\nBerserk 2017 has 2 clip show episodes in a 12 episode run! That's really all I need to say to illustrate how fucking shitthis series was. That could be the entire review right there!\\n\\n\r\nHowever, I'm a tad more professional then that so let's get on with the review.  This series covered the part of the manga where Guts meets Schierke, gains the Berserker Armor, and fights the New Band of the Hawk. Basically this is the part of the manga where Miura abandons the \"Ow the Edge\" feel of the Black Swordsman Arc and makes Berserk a shonen with occasional tits and gore. I'm exaggerating of course, but the tone has changed vastly and it often seems to almost venture into shonen territory. This SHOULD make it easier to adapt into a fun and fluid anime right? Unfortunately it would seem not. They cover very little of the manga in these 12 episodes, not only because there are 2 fucking clip shows, but because the pacing isn't great. If they were going to make it short and sweet, they could at least put serious attention and detail into the battle scenes. However, the art budget got gutted AGAIN, so this series often looks even worse than Berserk 2016! The battle scenes are predictably lackluster, so we mostly get padding and dialogue. Does it even end at the logical point with Guts gaining the Berserker armor and standing tall against Griffith's minions? Nope. The series rushed that scene and farted on for another episode so we could meet Bonebeard the Pirate...the character near universally considered to be the worst character in all of Berserk. Yes, he's worse than Puck. Since this series bombed and there are no plans for a Berserk 2018, this is where the Berserk anime journey ends...with Bonebeard the fucking Pirate! I don't know whether to laugh or cry.\\n\\n\r\nArt:\\n\\n\r\nIf you had told me last year that Berserk 2017 would look even worse than 2016 I wouldn't have believed you. How could they possibly sink further down when they had reached the center of the Earth?  From that point, any direction would be up. However, Studio Gemba has accomplished the unthinkable. There are a lot of anime studios I love to give shit: Toei, ARMS, 4C, OLM, etc. Those are all GODLIKE though compared to Gemba. Only Idea Factory can compete head to head with Gemba when it comes to being an absolute shitstain of an animation company.\\n\\n\r\nOverall:\\n\\n\r\nWere my expectations high following last years' travesty? Nope. Was I STILL somehow disappointed by this trash? Yep. Berserk 2017 isn't even good as a guilty pleasure. Keep in mind my standards aren't that high. Dragonball Super is something I watch as a guilty pleasure. Berserk 2017 is to Berserk what Superman 4 was to Superman films. It is a blow so devastating that it may never recover. As successful a cult following as the manga has, it will likely be YEARS before we see another attempt at a Berserk anime if ever.",
            "date": "2017-07-04T20:53:00+00:00",
            "helpful_count": 155,
            "mal_id": 251977,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=251977"
        },
        {
            "content": "I will say this in advance, if you judge the flaws too much your enjoyment will spoil. I highly suggest you rather go into this knowing that it's going to be the exact CG and features as last season or continue being a perfectionist and be very disappointed. It's the simple matter of knowing what to expect. \r\nThere's a \"episodic\" section and a \"features & info\" section. The () with numbers in them represents spoilers for the spoiler paragraph. If you want, check out the stats paragraph that goes through the current and previous stats. \r\n**************************************************************\r\nFEATURES & INFO\r\nANIMATION/ART/MOVEMENT:\r\nSo we know that it's CG, however thereis more to it than you might think. The 2D, 3D, art, pace and movement is gonna be looked upon this season. The question is, has it changed for the better? Yes, but not entirely. The character details of random people can look very lazy in some cases. They don't get enough screen time so I understand, though you will notice it. \\n\r\nThe characters look the same, but this time it's easier to take in.\\n\r\nThe art can be beautiful, this includes the scenery and general use. The art isn't perfect so just keep that in mind.\\n\r\nThe movement is very frustrating, especially in the background. The background characters comes to an absolute stop at several occasions and it just ruins the mood. Taking 4:33-4:38 from episode 8 for example, the movement of the characters that should be moving just stopped (7). In any case, it will become easier to handle the CG. Unless your allergic to CG.\\n\\n\r\nCAMERA:\\n\r\nThe angles are fine but sometime it can be over used.  When the camera moves from showing the characters face to a position just behind them, viewing what the character sees... it can get a little old. This is only me though, I notice the camera movement much more for this anime compared to everything else I've watched. The camera angles and movement is much better than the prequel, I would rate it a 7/10. So far the anime doesn't have any filler, but that doesn't mean they don't skip minor details. Scenes get rushed every so often, of course it's to fit more material.\\n\\n\r\nMUSIC/SOUND:\\n\r\nThe music is important to anime and this anime was spot on in this area. The opening and ending is something to look forward to. The Sound effects are more or less the same but I like the sound of Guts sword in particular. The soundtracks are the same and good as ever. In episode 3 at 6:49-7:53 the soundtrack was perfect for the scenery and speech, even though this soundtrack has been used in the other Berserk anime it still was lovely. The voice actors/actresses work well with the characters, no flaws at all in the voices. There may be some characters that will grow on you due to the VA. Seeing Puck and ...... fighting with voices was much more enjoyable compared to the Manga (5). The sound is one of the best aspects of this anime, without the soundtracks and songs... It wouldn't be as great.\\n\\n\r\nMY ENJOYMENT:\\n\r\nSeeing my favorite manga adapted is very very exciting, I have been waiting for this for a long time. As I stated I was disappointed, yet I enjoyed it so much that I can re-watch it anytime. I always get shivers down my spine from just watching the opening and a few moments during the episodes. For the opening I like the art and basically how it was made. Just seeing the animation and movements of the white and black still characters is satisfying enough for me. I admit the manga is better but I need music and voices, I don't care about these peoples criticism.\\n\\n\r\nMY THOUGHTS:\\n\r\n\"What can anime do that manga can't? What by definition is possible through the medium of animation that is not possible by a series of printed pictures on paper (manga)?\". This here is what I think that keeps lot's of people going, the color, sound and movement. This is a good point about the anime, it has these things that the Manga doesn't have. Does it mean it's better than the Manga? No. Does it mean that we get to hear voices we only imagined in our heads? Yes. Anyway I'm just happy we have gotten this far in the anime.\\n\\n\r\nThe quote in the paragraph above was originally written by another user, I got his permission to add this to my review.\\n\\n\\n\r\nCONCLUSION:\\n\r\nThis season looks better than the prequel, mostly the camera angles and music. It's definitely worth watching. It's possible that you will find this very entertaining like me. Remember it still has big flaws.                                   \\n\\n\r\n**************************************************************                           \\n\r\nEPISODIC\\n\\n\\n\r\nFIRST EPISODE:\\n\r\nThe first 2 minutes of the first episode was perfectly done. From 00:07-2:07, the art was amazing and the 2D animation worked perfectly for it (Since I was using kissanime the time may vary. It's about a 6 second difference without KA). The characters had faded lines near their body parts just like the previous season but it was no doubt 2D. This was a perfect start to the anime and the opening after that scene made it even better, especially listening to another 9mm Parabellum Bullet song. Just as you finish watching the opening you will undoubtedly come upon the same CG animation as the prequel. To be frank, it was kind of disappointing. I knew what I was going into but I was unable to prevent thinking, \"What would Berserk look like if it wasn't CG\". The CG can get rather inadequate, yet it does grow on you. Look, I'm going to be straight forward with this... seeing the 3D characters talking and moving was very unsatisfying. It's possible that this episode will worry you for the upcoming episodes, but rest assured it does get better. During 09:07-15:50 there is a big fight. In that big fight at 10:17-10:19, 11:06-11:43, Guts and someone else clashes swords several of times (1). For this fight it was said to be swords clashing in repeated motions. I reduced the speed to 0.15 to confirm what a youtuber (Professor Anime) said, on the end he was half right.  At 19:32-20:30 the scene had a mixture of 2D and 3D, specifically at 19:53-20:30 was just 2D. I couldn't ask for anything better for that bloody scene (when I said bloody I mean blood rushing out of a head and arrow shots). That short battle scene was much better than how the movies executed them. Another good animation scene was at 21:20-21:35, it was superior to all of the prequels moments. Presumably, by now you know that Berserk has it's fair share of 2D scenes, but this is very limited to just close up's and short scenes. \\n\\n\r\nSECOND EPISODE:\\n\r\nAt 3:44-4:30, a demon (call it what you want) appeared and I must say that the animation was crap. I just didn't buy it, it was like it was cut out straight out of the manga and just put in 3D without bothering putting in better details in it. At 6:02-16:15 it was a flashback of ****** past, for the whole 10 minutes it was 2D (2). The content in that 10 minutes was very important since it was clearing up that uncertainty about ******  that's been going on since the prequel. Making the flashback with the 2D was what made this episode successful. At 20:34-21:00 it was missing one thing... it was nipples. It's got nothing to do with my sexual desire, it's what I think would work for such a moment. I would like to see more mature scenes because this is Berserk after all.\\n\\n\r\nTHIRD EPISODE: \\n\r\nAt 16:35-18:22 this was the area where I was most worried, but I was impressed. The soundtrack worked very well with the scene and the animation wasn't a burden to the content at all. At the scene there was a bunch of demons in a cave, it could of gone so wrong but it was saved by the 2D moments. To be honest everything was fine for me, it's other people I was worried about. Around 35 seconds out of the 1.48 minutes was 2D and I tell you this now, 17:02-17:30 was absolutely BEAUTIFUL. It was one of the best animation moments of the series since it looked professionally animated.\\n\\n\r\nFIFTH EPISODE:\\n\r\nThis episode here is very important. It contains a turning point that changes what we have been seeing for the whole series to something entirely new. We have been witnessing bloodbaths and demon slaying, now a new genre kicks in and brings us to a new interesting arc (3). This episode also had a change of pace. We got a break from the constant killing and can watch the characters enjoy the peaceful time. Another important feature was the 2D. The important scenes had 2D and I got to say that this was crucial. I would of loved it if the whole series was made like that, however this is one of the flaws we have to deal with. 14:46-19:00 was entirely 2D.\\n\\n\r\nSIXTH EPISODE:\\n\r\nAnother episode the studio couldn't mess up, they showed what we Berserk fans wanted. (6) This whole sentence can't possibly be put in non-spoiler form. Not big spoiler but things you don't know of yet. In this episode I realised how much Farenese-sama character has developed. A massive improvement and I consider her cute in 3D and 2D (waifu nearly). I had a laugh at a few scenes in this episode. Guts sword handling was better than earlier this season, I say it was the best of the modern Berserk. 3D didn't screw up anything for me for the past few weeks if I must say.\\n\\n\r\nSEVENTH EPISODE: \\n\r\nThe action in this episode beats everything so far. It can sometimes look like a PC game in some scenes, but the actual fighting and such is great. Of course it can't be perfect but I personally think that some of the camera angles didn't work out.\\n\\n\\n\\n\\n\\n\\n\r\n------------------------------------------------------------------\\n\\n\\n\\n\\n\\n\r\nSPOILER (OPTIONAL):\\n\r\n(1) In this battle Guts faces Zodd one-on-one. The speed of this battle is crazy to the point that you don't know what's going on. The 3D in this didn't work out that well in my opinion.\\n\r\n(2) A flashback of Farnese-sama's past. Regarding her past, it was slightly rushed especially around the time when Serpico had the duel and a few other parts. To be honest this isn't worth mentioning because it's very minor.\\n\r\n(3) This episode brings the topic of the spirit realm and the talk of Astral beings. Not to mention the newly introduced spirits called Sylphs, air elementals. The sylph sword held by Serpico was brilliant. Also the introduction to Salamanders, fire elementals. Basically the fantasy side of Berserk.\\n\r\n(4) This episode introduces us to the Trolls. It would of been better if their body hair didn't look like it had gel in it. btw I wasn't making fun of it, I was simply pointing out it's flaw. You should know from last season anyway.\\n\r\n(5) In episode 5 during 5:46-6:58, Puck and Evarella fights for an acorn. It's possible to miss it because it happens during a important conversation.\\n\\n\r\n(6) Serpico tries out his sylph sword against trolls, he was the best character in this episode. The animation of the magic was brilliant, the colors too. \\n\\n\r\n(7) So a troll was raping a woman in a 2 second scene and after that, 7 or so Trolls was showed in the background raping with no movement... it was very disappointing.\\n\\n\\n\\n\\n\\n\r\n------------------------------------------------------------------\\n\\n\\n\\n\\n\\n\\n\r\nSTATS (OPTIONAL):\\n\r\n(+)(-) =  is rating increase or decrease from the last edit.\\n\r\nThe prequel Berserk (2016) has 46,610 users scored out of 110,842 members. That is a 64,232 users who didn't score. \\n\r\nBerserk (2017) on the other hand has 7,569 users scored out of 41,702 members. That means that 34,133 members who didn't score due to several reasons that you probably get an idea of. In the end 69,140 members from Berserk (2016) decided to not add the sequel to their lists. This is assuming that all users added (2016) to their list before (2017).\\n\r\nThe prequel has a score of 6.77 and previously had a score of 6.13 when it was airing. Berserk (2017) however has the score of 7.39 (0.04-) and beats its prequels airing score by 1.26 with room for improvement. Anyone can see that there has been a improvement in the scores.\\n\r\nFrom when I first made this review, there was a big change. \\n\r\nFor Berserk (2016), there was a 5,281 increase of users scored and a 4,830 increase of members. \\n\r\nFor Berserk (2017), there was a 3,039 increase of users scored and a 6,610 increase of members.\\n\\n\\n\r\nI basically said everything I wanted to say, I leave the decision of watching it to you. I spent a lot of time on this review, I hope it helped. Just in case you liked the stats, the recordings are on my profile.\\n\\n\\n\r\nEDIT: 9/6/17 8:37 AM\\n\r\nEpisodes watched: 9\\n\r\nModified by Jeikobu11\\n\\n",
            "date": "2017-04-25T04:08:00+00:00",
            "helpful_count": 78,
            "mal_id": 246276,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jeikobu11",
                "username": "jeikobu11"
            },
            "url": "https://myanimelist.net/reviews.php?id=246276"
        },
        {
            "content": "Buckle up, this is going to be a long one.\r\nBefore I get into any detail with this show I'd like to pose a question. What can anime do that manga can't? What by definition is possible through the medium of animation that is not possible by a series of printed pictures on paper (manga)?\r\nThere's two things: sound and movement. With anime (read: animation) you can have music, sound effects and often voice acting as well. While movement can be suggested in a manga, the pictures do not literally move before your eyes like with animation. \r\nMy point here is that an animated adaption of amanga relies on, well, animation and sound to become something arguably more than the source material. There's a lot to gain from becoming animated but it's also possible to screw this up creating a product lesser than the source manga. \\n\\n\r\nIn addition this assumes that adaption did not remove material from the source that affects the quality of the plot. This also assumes that the original artwork hasn't been degraded in detail and quality. However to make animation economical the art (more often than not) is degraded in quality but I believe the quality of the animation can make up for this. It's also worth mentioning that the vast majority of manga are primarily in black and white, which opens up the possible avenue of using color where there really wasn't before.\\n\\n\r\nThe original Berserk is a traditional manga. It is in black and white, features no true animation, and has no sound of any kind. Because of this I am going to be rating this adaptation based on the following: Faithfulness of Plot, Sound Design, Animation Quality and Color Quality. My belief is that any anime adaptation of a manga that fails in these regards is a complete failure of an adaptation.\\n\\n\r\nFaithfulness of Plot:\\n\\n\r\nThe previous season was absolutely infamous for including an opening episode full of nonsense that contradicted the original plot. I've been told spoilers are not allowed so to be brief: Two whole arcs of Berserk were skipped and character introductions were remade to fit in with the much more condensed timeline. This is one of the reasons I gave the previous season a \"1\". Over time the episodes became more accurate to the source material but I want to make it clear, this is not a plus. This is not \"Plot Quality\" but how intact the original source material is. In some very rare occasions changes to a plot in an adaptation might actually make the plot more rational or more enjoyable but it pains me to say this isn't one of them.\\n\\n\r\nSo when I say something like \"This season of Berserk is generally more accurate to the source material's plot.\", don't take it as a plus. It is me acknowledging that the original plot still functions. Having an intact plot is not a plus for a medium like animation. It's not something it gains over the manga. So far the plot has been mostly intact outside of what one might consider nitpicks. The biggest of which is that in episode three I remember the main villain making an incredibly odd manic-villain like face that was totally and completely out of character for a generally well composed villain.\\n\\n\r\nSound Design:\\n\\n\r\nWhen I say \"Sound Design\" I first mean sound effects. Now in an average review for some other adaptation I would first jump to music. I would likely not even mention \"sound design\" because we have reached a point where the average anime has reasonable sound effects to match the actions of the characters and objects on screen. To be honest I can't really think of a time where this wasn't the case. But if you're a Berserk fan you know that this is not the case for this series. \\n\\n\r\nThe *CLANG* sound effect coming from the main character's weapon makes it sound like a frying pan as compared to a weapon referred to in the source material as \"...too thick to be called a sword\". It is not only irrational that such a hollow sound would emanate from this weapon, but the sheer loudness of it is absurd. There's only three or four different *CLANG* sounds ever used and they are used constantly between this season and the previous. In this season a new character wielding a hammer of immense weight shows up and it turns out that he too uses a mostly hollow, likely aluminum weapon for it also has the *CLANG* sound effect. Also a demon using a \"horse head cutter\" apparently also needs that same *CLANG*. Watch the first episode and in particular look for the fight between the characters \"Guts\" and \"Zodd\" and you'll understand why I spent so much time talking about one sound effect.\\n\\n\r\nIf you haven't watched this series than I know you may think this is just a nitpick but every time it occurs I feel a wince of anger that I'm not used to feeling from basic sound effects. I never felt this way watching the original 90's Berserk adaptation nor the somewhat weaker movie adaptations.\\n\\n\r\nIn general the sound design isn't the best. For example, amazing composer Susumu Hirasawa composed two songs for this show, \"Hai Yo\" and \"Ash Crow\". On their own these songs are pretty good. I still prefer \"Forces\" and \"Aria\", but these songs are no slouches. But usage is everything in an anime. Hai Yo is used incredibly frequently and is often used as background music. Keep in mind this is not a \"background song\". It has lyrics that regularly get talked over.  I like to believe I am writing  in a very dignified style so my emotions may not totally reach you so I want to make it clear that this makes me very unhappy. Very. Susumu Hirasawa's music made the 90's anime what it was. The animation quality in that show wasn't the best (better than this but still not great) but the way his music powered scenes was nothing short of fantastic. He is my favorite anime composer, bar none.\\n\\n\r\nBut here his music is talked over and used as episode preview music. Do you like anime by Satoshi Kon? Do you remember Paranoia Agent? Imagine the OP of that series playing not only at the beginning of every episode but often in the episodes as well at the end too and every time someone was talking over it. And the rest of the soundtrack was replaced with very generic tunes. That's what the music in this series is like. Same composer by the way, Susumu Hirasawa was there too. One track overused and yet under utilized. \\n\\n\r\nBut the sound design IS better than before. The clangs are a little less prevalent and the voice acting is often easier to hear now. The cast is perfectly acceptable by the way. At no point did I really feel any great or super memorable moments of acting from the cast but that's more than likely due to the animation quality making the characters look silly over anything else.\\n\\n\r\nAnimation Quality:\\n\\n\r\nThis is the sticker. This is the one you've heard about. To put it plainly, this is the fatal flaw. In the past I have been called \"shallow\" for caring so much about animation quality. But I want to say two things in reaction to that. First I just mentioned I loved the 90's Berserk anime despite its shortcomings and two, anime IS animation. Anime is by literal definition a Japanese adaptation of the word \"animation\". As stated above there are things you can do with this medium that you absolutely 100% cannot do in others. When adapting something like a light novel there's few pictures to go off of so the animators can probably get away with more than when they are adapting a manga, especially one like Berserk.\\n\\n\r\nBerserk is written and illustrated by Kentaro Miura and he is well known for his immensely detailed and layered art. That isn't to say he can't put a lot of emotion into simpler drawings, he can do both. Anime often runs at a lower frame rate already than (generally speaking) western animation to acclimate for more detail but even among manga Berserk is absurdly detailed. There are images in the Millennium Falcon arc of Berserk (which is what this season is at least partially adapting) in which I simply cannot fathom a human being taking a pencil/pen and drawing line by line those images on paper. \\n\\n\r\nBecause you now know this you might believe it could be impossible to truly and accurately recreate the drawings of Berserk economically in a reasonable time period. And you are right. But that's fine. This is par for the course for a lot of anime. The creators of this series decided to deal with this problem by using Computer Generated Images. I'll just say CG for now.\\n\\n\r\nThe CG in Berserk is awful. It runs at an absurdly janky frame rate compounded by highly unnatural movement. In addition to this the creators of the show have decided to add on this fake shading by attempting fake crosshatching on everything. I mean everything. Every single character has these criss-crossing lines on their faces and bodies at all times that make it absurdly clear just how undetailed these models are. This show is mostly CG too. There are hand-drawn scenes but they in some ways might actually make the show worse. Let me explain through comparison.\\n\\n\r\nIn the first two Berserk movies there was a lot of this very problem. Janky CG. But in the third movie many people started to forgive Studio 4C's CG and I believe this to be for two reasons. The first being that they actually learned from their mistakes. The framerate and detail of their models did increase.\\n\\n\r\nThe second is that, no spoilers, but there was a good amount of supernatural and otherworldly imagery in the third Berserk movie. A lot of that imagery also shows up in this show. The thing is that 2D and 3D imagery inherently clash when the CG isn't essentially perfect. In more horrific scenes this works out well, providing a somewhat uncanny valley feeling to the proceedings.\\n\\n\r\nBut this new show is ALWAYS like that. Main characters are mostly rendered in CG and then suddenly switching to 2D at random intervals. It's jarring. I think I'd prefer all mediocre 2D or all substandard 3D over this. Although neither of those alternatives is something I'd want in lieu of actually good animation. And I'm not saying 3D animation is inherently bad, but this is no Gantz if you catch my drift.\\n\\n\r\nThat being said if compared to the previous season this show is better. Guts' model is more accurate, there's a bit more 2D animation and the general 3D animation is slightly smoother in movement.\\n\\n\r\nI also want to mention something else this show screws up, camera movements. It seems almost ridiculous to talk about, I never really think about this in any other anime. But the director seems to be either overly excited to have a 3D plane to work in or is simply incompetent with camera movement (or both) so the camera in this series is almost always shaking, or spinning, or doing god knows what to be honest. As the episodes go on and there's less action and this nonsense definitely happens less but it's still quite absurd I even have to mention this. This is a failure you just don't see everyday. \\n\\n\r\nColor Design:\\n\\n\r\nThe last thing an anime can do over a (black and white) manga is to add color. This show certainly tries to do this. Some colors seem to make logical sense while others are absurdly bright. In general this whole show seems to lack logical shading (see that cross-hatching thing I talked about before) and some characters are crazy bright. There's an archer character introduced a few episodes in that wears a bright pink shirt, so bright you would be able to see him a mile away, ironic is it not? I made sure to check in the manga and low and behold, in the few colored drawings of him it's a dark maroon shirt.\\n\\n\r\nAgain this was worse in the previous season (see: Holy Iron Chain Knights) but again this ISN'T a thing I should have to mention. Although Berserk is black and white there IS colored reference material the studio could have easily extrapolated into the show's character designs.\\n\\n\r\nConclusion:\\n\\n\r\nThis show can be considered functional. You turn on an episode and it will play from beginning to end and will manage to tell a coherent story. It will have sound and movement. It is by all definitions an animated work. But is it worth watching as an adaptation? No. Absolutely not.\\n\\n\r\nIf you didn't know, as of writing Berserk is the single highest reviewed manga on this website. By a good margin too. It has been showered with tons of praise and I myself have given it a 10 which I want to say is very, VERY rare of me to do. I take \"10's\" very seriously. It's my favorite manga easy but don't take just my word for it.\\n\\n\r\nNow consider this show. It's got what, a 7.37 right now? That's about 2 points lower than the manga. Is a 7.37 anime better to you than a 9.28 manga? Allow me to make an assumption too: this show would be reviewed even worse than 7.37 if people were actually watching it. The previous season left such a stink in so many mouths that this season is significantly less popular. It's less popular than Sin: Nanatsu no Taizai, which is an adaptation of a series of plastic models.\\n\\n\r\nThink about that. An adaptation of the best reviewed manga on this website is less popular than middling softcore porn about a series of purchasable toys. That hurts me.\\n\\n\r\nI gave this show a \"3\" meaning I think it is very bad. I love the story of Berserk but this show doesn't do it justice. There's so much that can be done with the medium of anime but this show fails to do any of it even though its storyboards were provided to them.\\n\\n\r\nPlease read the manga. Even if you've never read a manga before, please give this one a shot. This show doesn't give the original story what it deserves and fails to add more to it. In the end and after so many words that's all I can say, please read the manga and do not let the failings of this poor adaptation keep you from enjoying the masterpiece that is Berserk.\\n\\n\r\nEDIT: Update my score to a 1. All that this show succeeded in, what little there was, completely fell apart in the last 4 episodes. Avoid this show like the plague.\\n\\n\\n\\n",
            "date": "2017-04-25T23:57:00+00:00",
            "helpful_count": 49,
            "mal_id": 246329,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4445996.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/UtterSpartan",
                "username": "UtterSpartan"
            },
            "url": "https://myanimelist.net/reviews.php?id=246329"
        },
        {
            "content": "I'll keep this short and sweet because everyone here must have seen Berserk (2016). \r\nIt's basically the exact same, except the pacing problems have gotten better. There really isn't too much too say, the CGI art is trash, but if you have read the manga you'll take what you can get. Obviously the ending is incomplete because the manga continues on much much further, and is still ongoing. \r\nI'd say don't watch this if you haven't read the manga, because it will confuse you and will be the least bit enjoyable. For me I love seeing manga come to life through animation even if itisn't the best so I did enjoy it to a degree, and overall will give it a 7.",
            "date": "2017-06-23T08:06:00+00:00",
            "helpful_count": 39,
            "mal_id": 250754,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4745752.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/existentialist",
                "username": "existentialist"
            },
            "url": "https://myanimelist.net/reviews.php?id=250754"
        },
        {
            "content": "I think being an anime-only watcher has helped me in sticking it out with this anime despite its glaring faults in the technical department(CGI,sound effects, etc). \r\nI decided to give the Berserk franchise a chance with the introduction of the 2016 season and if I had to compare that season to 2017's there are a couple things I can mention. \r\nThe story for this season was amazing as always and it is what keeps me coming back to watch week after week. I didn't have any issues with how the pacing was done.\r\n I felt like the directing was a bit better this season thanin 2016 although this was mainly for about 75% of the series. The last 1/4 had some major issues that I couldn't look past. Much of the same can be said for art and animation. The addition of 2D animation for some scenes were more than welcomed on my end but if you are one that do not like the mixture of 2D and 3D in shows then it might be a bit jarring for you.\\n\r\nThe soundtrack is what you would've been familiar too from the 2016 season and it is great as always. The introduction of new characters as well as the development given to some members of the cast was appreciated. Overall I was able to enjoy this season of Berserk a little bit more than I had the first season.\\n\r\nIf you are coming across this anime for the first time, I'd suggest you give episode 1 of the 2016 season a go to see if the 3D CGI would sit well with you. After that I recommend you check out the Berserk anime that came out in the 90s(or the movies if you're short on time) or you can read the manga for which I keep hearing great things about. I hope my thoughts on this show was useful to you!",
            "date": "2017-06-23T14:10:00+00:00",
            "helpful_count": 33,
            "mal_id": 250788,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 4,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=250788"
        },
        {
            "content": "TL;DR: 7/10 - The dreadful 3D CGI animation is almost bad enough by itself to ruin this whole adaptation, but in the end, this show has enough awesome characters, plot developments, and fight scenes to make it worth watching. \r\nART: 2/10\r\nLet's get this out of the way. The 3D CGI \"art\" is bad. There is no way around it, and there is no excuse good enough to make up for it. The actual moments where they take the time to fully draw each scene without the CGI is so beautiful that it literally makes the show worse because you know what it could've been, whatit should've been. I wouldn't go as far as saying that the show is unwatchable, but I'm admittedly a huge nerd for Berserk, and I've conditioned myself by watching RWBY, Blame!, Knights of Sidonia, etc..\\n\\n\r\nSTORY: 10/10\\n\\n\r\nSpot on adaptation, frame for frame, and scene for scene. So what can I say about the story? It's Berserk, and it's the good times, where we really see some actual character development and the fight scenes sprinkled in are frequent and satisfying. There's new characters, both allies and enemies, magical weapons, mysterious powers, interesting plot developments; I really envy anyone who is unfamiliar with Berserk and gets to see it for the first time in all its glory!\\n\\n\r\nSOUND: 9/10\\n\\n\r\nAll of the voices are still coming out pretty much how I imagined them when I was reading the manga. 9mm Parabellum Bullet returns to provide the opening once again this season, and it's just as awesome as the first one; the ending was just okay. Just like the plot, the score of this show often pushes the boundaries of being over-dramatic and cliche, yet somehow it always appears graceful and confident. You may, however, get tired of BLOOD AND GUTS AND GUTS AND BLOOD AND BLOOD AND GUTS AND GUTS AND BLOOD AND BLOOD AND GUTS AND GUTS......and blood\\n\\n\r\nCHARACTER: 10/10\\n\\n\r\nSolid characters appear this season, and we get to see deeper character development of ones that have been around a while. The unlikely cast that began to form in the first season becomes better, faster, stronger, and most importantly, more fun to watch as they work together to get out of life-threatening situations. Gone are the days of watching Guts, all alone, getting thrown around for twenty minutes before somehow impaling the enemy and dragging his broken body away. Now he has friends to watch him do it too! We also get to see most of the enemies that will become more of a presence as time goes on, even if it's just for a moment. There are also a few characters, both new and old, whose true alignment is hard to determine.\\n\\n\r\nENJOYMENT: 7/10\\n\\n\r\nThis one was tough, because I truly enjoyed this season, and this new anime series as a whole. I didn't want it to end, and I'm excited that a third season has been confirmed. That being said, I can't blind myself to the complaints of others, who have enjoyed Berserk in the past, but were completely turned off by the new animation. \"Read the manga\" is not something you want to hear when describing an anime adaptation, and I can't honestly say that those who are newbies to Berserk would be able to appreciate this show as much as I did. \\n\\n\r\nOVERALL: 7/10\\n\\n\r\nIt pains me to give an official entry in the Berserk series such a mediocre score, but I feel that if I went any higher it would be the fanboy in me, not the reviewer. This isn't what anyone imagined when they pictured the day that Berserk would get a continuation to the anime adaptation. I wish they could've chosen another show to try this on, but I respect them for trying at least, and it is enjoyable to watch. I hope that they prove everyone wrong next season, and really get the hang of overlaying the CGI with drawings and commit to it like in the movies, but if none of that happens I'll still watch it.",
            "date": "2017-06-23T12:24:00+00:00",
            "helpful_count": 32,
            "mal_id": 250781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1440577.jpg",
                "scores": {
                    "animation": 2,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lainsbearsuit",
                "username": "Lainsbearsuit"
            },
            "url": "https://myanimelist.net/reviews.php?id=250781"
        },
        {
            "content": "As someone who Loves Berserk as a manga and read everything up umtil the most recent stuff. this series just like S1 this series is an insult. it's an insult at best. the charecter writing is Loyal to it's original meterial.\r\nThe soundtrack is realy nice. It get's you hyped for some epic events, wich look horrible in this animation. If Studio Madhouse would not be this Busy i wish they would have picked up this show because the art of shingeki, or how it's animated would have been so much better than the pile of shit the studio produced.",
            "date": "2017-05-19T05:16:00+00:00",
            "helpful_count": 15,
            "mal_id": 248035,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheNightquest",
                "username": "TheNightquest"
            },
            "url": "https://myanimelist.net/reviews.php?id=248035"
        },
        {
            "content": "First time I started watching Berserk in 2014 year and that was movies 1,2,3 and 3D art was amazing + story line and overall 10/10 true masterpiece.\r\nSecond time was 2016 season 2 TV series almost everything on 8/10 except art\r\n5/10 everyhing (story) is from manga, but I do not read manga just played berserk in dreamcast and ps2 version.\r\n2017 jul I started season 3 and what I saw art improvements and all other things same, tbh from this 3D art I got resistance and no longer crying about it.\r\nThat ANIME in overall = Masterpiece and if you disagree that means you are WEAK!",
            "date": "2018-02-20T13:07:00+00:00",
            "helpful_count": 11,
            "mal_id": 272036,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6490648.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/magaiverix",
                "username": "magaiverix"
            },
            "url": "https://myanimelist.net/reviews.php?id=272036"
        },
        {
            "content": "This is hilariously bad. It is so bad that it actually serves a purpose by being a great filter for people with horrible taste. If you ever see someone recommending this to you or someone giving it a score above 4, try not to listen to any recommendations by that person.\r\nHilarious webms of the anime:\r\nZodd transforming: https://webmshare.com/JGWoL\r\nno impact slapping: https://webmshare.com/qN9Mz\r\nIsidro turned into a droid: https://webmshare.com/m8mEJ\r\nasymmetrical movement: https://webmshare.com/3y1aD\r\nSouth Park or Berserk: https://webmshare.com/WWQLK\r\nBoth the sound and art direction are an absolute mess. \r\nThe art is basically only CGI with characters looking and moving like stiff ragdolls, sometimes completely out of sync with their environment or each other,sometimes the animation is so minimal you may think this is actually South Park.\\n\r\nSound, on the other hand, consists of the same 10 overused effects over and over again. CLANK CLANK CLANK. The sound of a metal pole hitting an empty garbage bin is used for whatever weapons clash.\\n\r\nThis is one the level of Musashi Gundou, but sadly it ain't as hilarious, considering the fanbase waited an eternity for a worthy anime adaptation to continue the saga.",
            "date": "2017-06-03T17:13:00+00:00",
            "helpful_count": 12,
            "mal_id": 249215,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97391.jpg",
                "scores": {
                    "animation": 1,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 2,
                    "sound": 1,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shabazza",
                "username": "Shabazza"
            },
            "url": "https://myanimelist.net/reviews.php?id=249215"
        },
        {
            "content": "I don't know what to say.... Berserk is personally my favorite manga of all the times... The story and the characters, the artwork... Everything is just perfect, i can't find any flaws.... And fast forward here we are in 2017... The 2016 anime was a letdown but we all still had one hope for the next arc.... The Berserker Armor........ I won't go into details as to why i absolutely love the story of Berserk as i believe anyone who has read the manga does not require an explanation. So yeah, today the time has finally come, after enduring all these episodes of crappy animation,bad expressionless cgi, character models that look like manequinns, all of the CLANG sound effects and the memes that came from it..... the fated time was here............ AND IT WAS HORRIBLE!!! I never wrote a review but i was so furiously enraged that i just had to!!!! Where do i begin??? The horrible animations? With the fact that the Berserker Armor episode was probably the worst looking one in the entire series??? I don't know. I mean, seriously. At the moment where the armor's helmet changed shapes, they didn't even bother making a decent scene out of it, i simply assume they had given up and so to minimize the hatred that would come they simply USED A COLORED MANGA PANEL!!!!!! IM SERIOUS!!! A COLORED MANGA PANEL!!!! And thank god they did!!! Because otherwise i probably would have cried!! Thank god they didn't animate it!!!! Because they are so bad, without talent or skills and disrespectul to the original work that i really hoped the entire series was just colored panels, i would have preffered it. I know you can't call this a complete review as i only talk about the Berserker Armor episode, but i will say this. The anime is generally terrible, mainly because it's visuals and the sound effects etc doesn't do it justice either. I really wish that show was given the amount of love and artistry it deserved... It's really sad. That one episode was the thing that made me break.... I will not watch another episode, simply because of the pure dissapointment... I will just re-read the manga to wash the shittyness off, if it is possible at all.... I honestly have to say that LIDENFILMS have sinned here.... If i could give a negative score then i would have given it a -10\\n\r\nTruly Berserk is one of my favorite stories and LIDENFILMS have created such an abomination that i have given it the lowest score... It is a sad day for Berserk",
            "date": "2017-05-26T11:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 248575,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ProteinShake",
                "username": "ProteinShake"
            },
            "url": "https://myanimelist.net/reviews.php?id=248575"
        },
        {
            "content": "STOP. Please, just stop.\r\nThis is a disaster, this is a trainwreck, this is trash to the ten billionth degree. Who in the hell thought that it was a good idea to give one of the greatest manga franchises of all time to a terrible, inexperienced CG Studio who couldn't animate their way out of Mickey Mouse's toilet bowl? Stop, just stop already, this is tearing me apart, Lisa! Give Berserk to Trigger, give Berserk to Madhouse, give Berserk to ANYONE EVEN MODERATELY COMPETENT IN THE ART OF ANIMATION IN THE SLIGHTEST BIT AT ALL! \r\nWhy? Why does this exist? Everyone involved in the decision togive Berserk to this studio should be fired into the sun. If I was Miura I would be having a freaking conniption that this was what they were doing to an absolute masterpiece of a manga. The 1997 anime is a bit dated, sure, but it still looks competent, it's easily watchable, it conveys the tone, the fight choreography make this thing look like toddlers slap boxing with flimsy action figures in a play pin. Why was this CG, why was this given to this studio, just why?\\n\\n\r\nPlease, end it, reboot immediately with a better studio, make it stop, this is literally painful to watch. 1 out of 10, I'd give it a negative 10,000 out of 10 if I could. Stop this madness, give one of the greatest mangas of all time to a great animation studio, this will be remembered as one of the worst studio decisions in the history of the anime industry. JUST STOP, please and thank you.",
            "date": "2018-02-15T09:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 271560,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6557058.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ShotgunXShogun",
                "username": "ShotgunXShogun"
            },
            "url": "https://myanimelist.net/reviews.php?id=271560"
        },
        {
            "content": "I can't believe i've rated a Berseker so low but well..I did and here comes one of the shortest reviews i've done to date.If you are a fanboy or a fangirl or someone who can't handle mature language get a hike cause things are gonna get a bit messy.\r\nIt's a little known fact among my peers that i love Berseker.In fact i love it so much that i wanted to move to Japan and marry it,have it's kids and live happily ever after.But i think it might have been a holiday romance and when we came back i realised that it had horrid face hair.\r\nIwas in love with the manga.All the details,the story,the design....Every single damn thing was absolutely stunning..And some time back the first one popped and boy did all the boys howl like we saw Pamela Anderson blowing Tommy Lee on a boat(which happened some years later actually).And while not the best even by the standards of the time it had something to it that made you....Happy.\\n\r\nFast forward to 2016 and after many attempts the franchise had yet to see a proper adaptation.And this one was the first ever Berseker that made me hate its' guts(pun intended).In short it was unwatchable.My head was spinning like i took cocaine or meth.Which clearly to my mind was what the studio that made this was on at the time.That horrible CGI,i still have nightmares about it.\\n\r\n2017 and there's word about this,the new and better in every way Berseker..And when i saw it i smiled.I smiled like Joker did.But my friends as it turned out the only normal thing,animationwise wwwwwwwwaaaaaaaaaaassssss..The fucking opening.After that it was like being dipped in liquid nitrogen and then smashed to pieces.\\n\r\nAll the excitement and joy gone in secs.i couldn't believe my eyes.The CGI was still there and still as cancerous as ever.If the previous one gave my eyes cancer this gave my brain Ebola and i died painfully screaming like a madman.\\n\r\nThe characters design....Dear lord deliver us from evil.The shades for example were like i took a pencil and just drew some lines on their faces.You remember those early 32 bit console graphics?Well they managed to do worse than those.It was painful to watch.The camera angles are like they're taken out of Ozzy's birthday party after he got hold of a camera,stoned out of his mind.\\n\r\nThe animation is the killer of this show.Even the 90's Berserk animation is better than that.Now i know that the cost of adapting the highly detailed manga would be off the charts.But this isn't an excuse for such a bad job.The frame rate is jerky at best.The movements are so unnatural it's like watching a mouse breastfeeding an elephant.The combined use of 2d and 3d is off the place.The end result is so appaling it's almost like watching Donald Trump havin one of his famous showers...\\n\r\nThen onto the sound dept..The sound effects are horrible beyond belief..A fight breaks out and swords clash and you hear the unmistakable sound of your mother banging sauce pans..If i wanted to hear sauce pans banging i'd hear Metallica's St.Anger lads...The opening song?It doesn't serve only as an opening song but also as a background music...Seriously?How freakin lazy are they?You can hear the damn lyrics in the background while conversations are taking place.\\n\r\nI expect the fanboys to barge in and burn me alive for this review,but i'm not into fanboyisms..If something is crap i'll say it's crap..Emotions don't make for a better show..And this isn't one.\\n\r\nIF we were talking about the manga,IF,i would be writing a love letter to the maker not a rant in MAL.But now we are talking about the anime.And since the most basic pillar,the animation,is outrageously bad to the point it becomes dangerous for my health then i can't possibly care if the story is made from the tears of an angel.And since i can't bring my self to watch this i can't and won't care about anything.If they wanted me and other people to care maybe they should have gone down another path.Which they didn't.\\n\\n\r\nLet me give you an example.If you have a surgery you expect the doctor to do a good job and not leave you a hideous scar.If the doctor does a good job all is well.If he leaves a sponge or a screwdriver inside you after the operation...See my point?\\n",
            "date": "2017-12-06T01:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 264620,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339890.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Dionkeykong",
                "username": "Dionkeykong"
            },
            "url": "https://myanimelist.net/reviews.php?id=264620"
        },
        {
            "content": "I don't now how people can defend this anime,the story of berserk shines through. while it has some of the worst cgi i've ever seen and then when it does the 2D it looks good but thats hardly ever. The VA is good. The music is good at first but after they replay the same music over , over  and over , it gets old very quite. The characters are great when they don't rewrite them from the manga. i didn't really have much enjoyment due to awful cgi. The manga is a downright masterpiece and does not deserve to have this crap asan adaption. if you like the story and haven't read the manga do yourself a favour and read it.don't waste your time with this anime.",
            "date": "2017-06-20T22:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 250510,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6235220.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Crazyripps",
                "username": "Crazyripps"
            },
            "url": "https://myanimelist.net/reviews.php?id=250510"
        },
        {
            "content": "I don't know how this got a rating this high, i mean 7.14 or sth. like that i just can't. you know guys this is a disgrace to you and the masterpiece of miura himself you should not be satisfied with this horseshite and don't be afraid to ask for sth. better we, the manga and miura deserve better than this shit this is just a shame. instead go read the manga or watch the anime from 1997 also not perfect but way better than this. well i need to mention im happy that susumu did the music at least he does a great joband did it also in the 1997 anime thats one of the few positive things i have to say about this steaming pile of disgraceful shit. yea i like to use disgraceful because this shit is just an disgrace, you know when u order some of your favorite food and you get shit served and they want to tell you this is the food you ordered or wanted after you said this is not what i wanted well you got the same here just because there is not much of animated berserk doesn't mean you have to accept it all as good or say: well at least sth. no thats not how it should be, it is an horrible adaptation and nothing else and thats what it has to be pointed out for",
            "date": "2017-10-13T19:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 260705,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6629681.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SteamingDullahan",
                "username": "SteamingDullahan"
            },
            "url": "https://myanimelist.net/reviews.php?id=260705"
        },
        {
            "content": "I didn't want to write a review so early, but I feel like this needs to be said straight away for those who were left with a sour taste in their mouths from Berserk 2016. This review will be updated at the end of the series, and some scores and notes may change due to changes in the show itself.\r\n~Story 10/10\r\nI'm getting the vibes that people who have watched the first two episodes of Berserk 2017 have not read the manga. As it stands now in the scoring department, as far as I can see, it is split between people who have read and peoplewho haven't. With that little gap of people who scored the show low for the animation.\\n\r\nThis arc or arcs, are the segments in the manga that again, some people didn't like being added to Berserk. That segment being the magical aspect of the show, which further leads into the Berserker Armor later on. This what Berserk is all about, the build to this was just the beginning, to see it on screen makes me squirm with joy. Please do not judge the show thinking the source material isn't up to par, because in retrospect, it is all about the story.\\n\\n\r\n*After Completing*\\n\r\nIt looks like we're going to get a part two of the City arc and possibly part of the boat arc if Berserk continues.\\n\\n\r\n~Art 6/10\\n\r\nFirst I want to talk about the OP, then I'll get to the show's in-show art itself.\\n\\n\r\nThe OP starts off with a sunrise. Casca, Guts and Puck resting after what looks like a very strenuous night fighting off demons. The blood from Guts' brand still fresh proves this testament as the title-card BERSERK pans up on screen. Sonia is then seen running wide-eyed and excited to see Griffith, while the Band of the Falcon's flag flies behind her. She opens her arms and Griffith accepts her gesture. This shows us that Griffith will use anyone for his main goal, and discard anyone he pleases on a wim. A picture of Griffith is shown, he looks down as if to reflect on what he's done, but is quickly reminded that emotions are a distraction as he looks up and yandere(ly) stares at the viewer.\\n\r\nWe now go back to Guts, Casca and Puck as they get ready to make their way to the next location with the rest of the main cast shown in a pan shot.\\n\r\nThe troll fight is a reflection of what is to come during this arc, the introduction to the power of magic, and the importance of Schierke in the series.\\n\r\nWe get a zoom-out-shot of our main cast of heroes, the shot however is slanted. This represents how fringe the group as become, how odd this band of travelers is. We then see a panning shot of some key role-players in the Band of the Falcon.\\n\r\nThe setting then changes to night as Guts is consumed by the rage of the Berserker Armor.\\n\r\nCasca tries to rip her ropes as a metaphor for her trying to escape the pain and mental distress brought onto her by Griffith.\\n\r\nSchierke cries out at the loss of a loved one.\\n\r\nGuts is then shown he has control over the armor with Schierke's help.\\n\\n\r\nThe art in the OP was wonderful, however the show itself is still lackluster. However I can see some improvements since the disgrace of Berserk 2016, some that need to be mentioned. \\n\\n\r\n1) Establishing shots are done correctly, I was surprised to see this at first, we can connect with scenes now and not be confused.\\n\r\n2) The color pallet isn't an LSD trip, it seems to be more down to Earth this time around.\\n\r\n3) In important story-telling that reflects character development CG is not used to get the viewer to connect with the characters more, since it is harder to relate to a digitally rendered being.\\n\r\n4) Emotions are animated better than Berserk 2016, even in CG digital animation.\\n\r\nMistakes have been made prior, and they have been corrected. This is worth praising.\\n\\n\r\n*After Completing*\\n\r\nI was wrong in many many cases in regards to how Berserk would turn out 4 episodes in.\\n\r\nThe art stagnated into oblivion, establishing shots were decimated, and the animation decided to give us screenshots of drawn work over CG.\\n\r\nThe fight scenes were drawn out better in some cases...majorily not, but respectfully. \\n\r\nI'm baffled that the last 3 minutes of episode 12 were drawn so well. Baffled that they couldn't animate the entire series like this, I almost feel insulted. Here's to hoping this is a sign of change for the next series of Berserk. \\n\\n\r\n~Sound 8/10\\n\r\nThe awesome thing about this series is the soundtrack, the key element to its predecessor. It's back and better than ever.\\n\\n\r\n~Character 7/10\\n\r\nWorking on character development straight out of the oven. I can see myself caring for these characters as much as I do in the manga, time will tell.\\n\\n\r\n*After Completing*\\n\r\nI still care for these characters however one is missing, manga viewers will be disappointed.\\n\\n\r\n~Enjoyment 7/10\\n\r\nSo far, despite the animation, knowing it has improved, I'm really enjoying the show. \\n\\n\r\n*After Completing*\\n\r\nBerserk 2017 was a roller-coaster, but I wouldn't ride it again. \\n\r\n~Overall (as of now) 8/10\\n\r\n~Overall (Completed) 7/10",
            "date": "2017-04-28T19:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 246515,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283499.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Meew2",
                "username": "Meew2"
            },
            "url": "https://myanimelist.net/reviews.php?id=246515"
        },
        {
            "content": "Berserk (2017) offers only the bare-bones of its manga counterpart. The skeleton it constructs manages to hold itself together, if not competently then just enough to look as if it was doing a jig and effectively masquerading the failings of its ligaments. Behind the jarring visual quality lies an engrossing Gothic inspired fantasy adventure following an endearing ragtag group of characters in a world rife with lore, brewing with demonic forces and accompanied by a pretty decent musical score.  \r\nWith Guts and his merry band of outcasts forming up from the get go there was less changing of POVs and this made it feellike more about his quest to protect Casca. Which made it all the more bitter when Gut's struggle explored his vulnerability that he, himself could be a danger to her and how it led him to rely and trust his new accomplices. This never felt overt or hammed in, having been predominantly conveyed through seemingly insignificant actions that may only become apparent through a characters stray thought.\\n\\n\r\nAll of the side characters went through some self actualisation. Farnese's faced self perceived uselessness, followed by her confrontation of the witches and her nurturing relationship with Casca. These experiences accumulated into her growing into a more stable character, which may disappoint some if you enjoyed her antics of the first season. Her sadistic and  over-privileged demeanor were expanded upon in a insightful flash back sequence of Serpico's childhood, which also added a new layer of complexity to their master and servant relationship.    \\n\\n\r\nAs a witch Schierke has been inundated with tradition, her arc covers the magic system, supernatural beings and history, which was interesting enough and paced out effectively to not feel like exposition. As she ventures into the outside world, no longer having someone to follow she learns what she wants to do for herself. This time of uncertainty can be contrasted with entering adulthood and finding your own way into the world.  Isidoro's adventure is just beginning, which makes him most similar to Scheirke yet he views things from a \"I can do anything.\" belief. He uses his practical skills to move through life, while Scheirke follows her intuition which causes a friendly, childish clash between the two. There are plenty of lighter moments of banter, crushes, budding friendships, zombie Casca being zombie Casca and Puck displaying a visually off kilter type of comic relief, all of which provides much needed levity. \\n\\n\r\nThe low production values are glaring to look at, the action scenes especially suffer. What the sporadic cinematography achieves in shifting the focus away from the awkward CGI trades off some of the impact on what could have been epic moments. At times the landscapes capture a sweeping brooding beauty, the animation flows and the composition makes you want to take a snap shot but these are far and few in between to be redeemable.   \\n\\n\r\nBesides from some cheap metallic clanging and the odd overused theme Berserk (2017) holds up proficiently in the sound department. Hirasawa is back, blending in his style of rock that captures the atmosphere of Berserk. Hirasawa aside, there are a few tracks that while enhance the action can be overbearing take you out of the dark fantasy world of Midland. The voice actor for Gut's does a good job of capturing his gruff and occasional inhuman voice.    \\n\\n\r\nThere are always a multitude of threads moving through narrative and the sense of danger is always lurking within them all. In a way the ugliness of the character designs and animation match the grim events taking place yet for a series heavy on action, no matter how cool it may look conceptually there is no denying that it falters. Like with a skeleton doing a jig, it outwardly looks more awkward then it does scary yet even when its original intent was to stirrup fear, the skeleton can still put on a fun performance.",
            "date": "2017-06-27T10:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 251222,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1490799.jpg",
                "scores": {
                    "animation": 2,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mookster",
                "username": "Mookster"
            },
            "url": "https://myanimelist.net/reviews.php?id=251222"
        },
        {
            "content": "This show showed me how anime can ruin a great manga. This show fails on all accounts for me. The awful CG which looks like it took 4 minutes to program, the shot composition which a baby would do better, pathetic fps in fight scenes and character designs which look like nightmare fan art of the original. I'd rather have my intestines ripped out and fed to me than being subjected to watching a second longer of this terrible, terrible adaptation that puts Akame ga Kill on a pedestal when compared to it. Excuse me while I go scoop out my brain's memory center soI forget this atrocity was actually born and aired in this sad, sad universe.",
            "date": "2018-09-01T02:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 287882,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7327463.jpg",
                "scores": {
                    "animation": 1,
                    "character": 8,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NarDev",
                "username": "NarDev"
            },
            "url": "https://myanimelist.net/reviews.php?id=287882"
        },
        {
            "content": "Kentaro Miura did a great job giving us such a series to read. If it wasn't for his many hiatus, Berserk would have been competing with One Piece in manga category. Now coming to the anime, again going for the 3DCGI. The animation totally sucked, it was looking like playing a 3rd rate 3D video game. The only thing that helped berserk cross the line of being a decent anime was its intense storyline and an amazing plot. Although, the anime left out a lot of scenes, but if they would have stuck to 2DCGI rather than doing the entire stuff it would have muchgreat!!! The fight scenes and the blood shed would have been more intensified if the frame overlaying would have been a lot smoother considering they would have done it in 2D style animation. Aside from that it was all Kentaro Miura's story telling and plot that dragged the anime forward keeping viewers glued to the series cosnidering many Berserk fans prefer reading it rather than watching after the Berserk (1997) series.",
            "date": "2018-04-13T13:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 277980,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7026252.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/otaku_nerd7",
                "username": "otaku_nerd7"
            },
            "url": "https://myanimelist.net/reviews.php?id=277980"
        },
        {
            "content": "Berserk 2017, don't judge a book by its cover. I've tried so, but the product evokes as well the popular adage \"don't make the same mistake twice!\".\r\nIn case of story and characters the applause for writing a gorgeous Manga, with good story and character development rightfully belongs to the Manga-ka and no one else. In other words, the appropriate use of an already given story and its characters is a solid ground-skill that is required for the preparation or completion of an respectable result. That basic knowledge can, neither be regarded as valid sign of professionalism nor as a possibility to mitigate flaws in otherdisciplines, e.g. the visual adapting. In brief, if the good story and its character are regarded as a merit of the creative team, to me that seems like an intention to trigger a cycle which reverse the previous link between cause and effect. In combination with an attitude of \"Everything is good as long as it is entertaining\", this leads to an unacceptable philosophy that is best described as an unreflected, illogical positivist perception.\\n\\n\r\nIt doesn't matter how much effort and fine polish was used to improve the visuals of Berserk 2017 if techniques are used in the same way as in Berserk 2016 the result will be the same visual disgrace, just like a leopard cannot change its spots. Instead of using the standard 2D, GEMBA chosen a 3D modeling which cuts to 2D in dint of close-up shots. But the 3D modeling looks sloppy because well portrayed expressions or emotions are often lacking. The synchronization quality between speeches and mouth movement is bad. And last but not least, to put insult to injury, the most compelling, expressiveness and vivaciousness force in the case of an anime character that creates a tension in the observer somewhere between interest and seductive sensibility is the expression of the eyes but the performance attempts in Berserk 2017 are still remotely inadequate to printout the strength and beauty of this elementary component. For this reason and because of the stiff unnatural movement of the characters the created actions scenes do leave the spectator's souls untouched. The shadows are still done by linear hatching, it looks cheap and, at the same time irritates, because frequently it looks like the shadows are floating and even moving when the camera zoom-in or -out. The cinematography, is still sometimes incorrect so that the viewer frequently feels uncomfortable, by the disorienting camera work. All in all it looks artificial, totally unpleasant and even sometimes extremely ugly, like the outward appearance (esp. the face) of the pirate-captain near the end of episode 12. An creative team must be prepared to listen to complaints and accept criticism. Notwithstanding the fact that the predecessor was already criticized a lot, all the flaws of the 2016 version are represent in Berserk 2017 as well. In this connection, the saddest aspect is - could laugh about it if the matter were not so serious - that there are signs of what it could have been but they did not put any effort on and ignored the feedback, so that it feelt like wasting the breath with the words.\\n\\n\r\nThe sound section was not much better either. Quite the contrary, the sound of sword is still ridiculous and synthetic no matter what it hits. The BGM seemed frequently misplaced and even disturbing. I constantly had the feeling that the music reminded me of other famous Themes. \"Peering into Darkness\" e.g. reminds me of Maurice Ravel`s \"Bolero\". The OP \"Sacrifice\" - 9mm Parabellum Bullet, isn`t bad but it sounds more like an opening for an shounen, rather than a dark and gloomy medieval fantasy show. A suitable musical form that allow the right atmosphere to be created for a show like this, needs to be more gloomy (IMO). For example good gothic-rock or power metal could have been appropriate. The ED \"Issai wa Monogatari\" by Nanjou, Yoshino (feat.) Yanagi, Nagi, maybe the text is poetically interesting but starts off with monotonous singing then starts developing somewhat style but soon refocusing on typical, appropriate for an ending theme instead of inventing something new and therefore it is not very notable. In the predecessor, the voice acting seemed to be the one thing that at least showed some effort but this time it does not feel the same.\\n\\n\r\nWell, there has been a small probability to convince me but then I encountered the problem that they have done \"the same mistakes twice!\". That was a very disappointing development in my view and so I really hope that there will be no continuation of using the Manga as a sacrificial lamb on the altar of commerce. As bad as the predecessor but this approach, also has additionally the downside of being the second failure.\\n\\n\r\nIt simply was no fun at all.\\n\\n",
            "date": "2018-02-23T09:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 272247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5632852.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sesshomaru",
                "username": "Sesshomaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=272247"
        },
        {
            "content": "If you hated the last season of berserk and was hoping they would improve on there mistakes you will be disappointed like the first overall just stay way from this one theirs just not much to write about this that hasn't been said about the first season.\r\nThe animation is still piss poor like the first season no improvements there not much to talk about on that.\r\nStory is done better in this season but the animation holds it back and really theirs no point to really watch since we have a manga that has better art to help the story its the same for characters. \r\nthemusic is the best part of season 1 and 2 really holds up same with voice acting these are the best parts about the show but that not saying much.  \\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-07-02T13:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 251769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4321307.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dragon97king",
                "username": "dragon97king"
            },
            "url": "https://myanimelist.net/reviews.php?id=251769"
        }
    ],
    [
        {
            "content": "Overview:\r\nIt's the 4th of July everybody! As an American, I will celebrate my country with one of our time honored traditions...beating the dog shit out of something weak and defenseless. Everyone is lining up to shit on Eromanga Sensei. Worst animu of the year! Sure that's pretty low hanging fruit, but I'm going even lower. If bashing Eromanga Sensei was the equivalent of America's pummeling and carving up Serbia, picking on poor Berserk 2017 is like the 1983 invasion of Grenada! \r\nStory:\r\nBerserk 2017 has 2 clip show episodes in a 12 episode run! That's really all I need to say to illustrate how fucking shitthis series was. That could be the entire review right there!\\n\\n\r\nHowever, I'm a tad more professional then that so let's get on with the review.  This series covered the part of the manga where Guts meets Schierke, gains the Berserker Armor, and fights the New Band of the Hawk. Basically this is the part of the manga where Miura abandons the \"Ow the Edge\" feel of the Black Swordsman Arc and makes Berserk a shonen with occasional tits and gore. I'm exaggerating of course, but the tone has changed vastly and it often seems to almost venture into shonen territory. This SHOULD make it easier to adapt into a fun and fluid anime right? Unfortunately it would seem not. They cover very little of the manga in these 12 episodes, not only because there are 2 fucking clip shows, but because the pacing isn't great. If they were going to make it short and sweet, they could at least put serious attention and detail into the battle scenes. However, the art budget got gutted AGAIN, so this series often looks even worse than Berserk 2016! The battle scenes are predictably lackluster, so we mostly get padding and dialogue. Does it even end at the logical point with Guts gaining the Berserker armor and standing tall against Griffith's minions? Nope. The series rushed that scene and farted on for another episode so we could meet Bonebeard the Pirate...the character near universally considered to be the worst character in all of Berserk. Yes, he's worse than Puck. Since this series bombed and there are no plans for a Berserk 2018, this is where the Berserk anime journey ends...with Bonebeard the fucking Pirate! I don't know whether to laugh or cry.\\n\\n\r\nArt:\\n\\n\r\nIf you had told me last year that Berserk 2017 would look even worse than 2016 I wouldn't have believed you. How could they possibly sink further down when they had reached the center of the Earth?  From that point, any direction would be up. However, Studio Gemba has accomplished the unthinkable. There are a lot of anime studios I love to give shit: Toei, ARMS, 4C, OLM, etc. Those are all GODLIKE though compared to Gemba. Only Idea Factory can compete head to head with Gemba when it comes to being an absolute shitstain of an animation company.\\n\\n\r\nOverall:\\n\\n\r\nWere my expectations high following last years' travesty? Nope. Was I STILL somehow disappointed by this trash? Yep. Berserk 2017 isn't even good as a guilty pleasure. Keep in mind my standards aren't that high. Dragonball Super is something I watch as a guilty pleasure. Berserk 2017 is to Berserk what Superman 4 was to Superman films. It is a blow so devastating that it may never recover. As successful a cult following as the manga has, it will likely be YEARS before we see another attempt at a Berserk anime if ever.",
            "date": "2017-07-04T20:53:00+00:00",
            "helpful_count": 155,
            "mal_id": 251977,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=251977"
        },
        {
            "content": "I will say this in advance, if you judge the flaws too much your enjoyment will spoil. I highly suggest you rather go into this knowing that it's going to be the exact CG and features as last season or continue being a perfectionist and be very disappointed. It's the simple matter of knowing what to expect. \r\nThere's a \"episodic\" section and a \"features & info\" section. The () with numbers in them represents spoilers for the spoiler paragraph. If you want, check out the stats paragraph that goes through the current and previous stats. \r\n**************************************************************\r\nFEATURES & INFO\r\nANIMATION/ART/MOVEMENT:\r\nSo we know that it's CG, however thereis more to it than you might think. The 2D, 3D, art, pace and movement is gonna be looked upon this season. The question is, has it changed for the better? Yes, but not entirely. The character details of random people can look very lazy in some cases. They don't get enough screen time so I understand, though you will notice it. \\n\r\nThe characters look the same, but this time it's easier to take in.\\n\r\nThe art can be beautiful, this includes the scenery and general use. The art isn't perfect so just keep that in mind.\\n\r\nThe movement is very frustrating, especially in the background. The background characters comes to an absolute stop at several occasions and it just ruins the mood. Taking 4:33-4:38 from episode 8 for example, the movement of the characters that should be moving just stopped (7). In any case, it will become easier to handle the CG. Unless your allergic to CG.\\n\\n\r\nCAMERA:\\n\r\nThe angles are fine but sometime it can be over used.  When the camera moves from showing the characters face to a position just behind them, viewing what the character sees... it can get a little old. This is only me though, I notice the camera movement much more for this anime compared to everything else I've watched. The camera angles and movement is much better than the prequel, I would rate it a 7/10. So far the anime doesn't have any filler, but that doesn't mean they don't skip minor details. Scenes get rushed every so often, of course it's to fit more material.\\n\\n\r\nMUSIC/SOUND:\\n\r\nThe music is important to anime and this anime was spot on in this area. The opening and ending is something to look forward to. The Sound effects are more or less the same but I like the sound of Guts sword in particular. The soundtracks are the same and good as ever. In episode 3 at 6:49-7:53 the soundtrack was perfect for the scenery and speech, even though this soundtrack has been used in the other Berserk anime it still was lovely. The voice actors/actresses work well with the characters, no flaws at all in the voices. There may be some characters that will grow on you due to the VA. Seeing Puck and ...... fighting with voices was much more enjoyable compared to the Manga (5). The sound is one of the best aspects of this anime, without the soundtracks and songs... It wouldn't be as great.\\n\\n\r\nMY ENJOYMENT:\\n\r\nSeeing my favorite manga adapted is very very exciting, I have been waiting for this for a long time. As I stated I was disappointed, yet I enjoyed it so much that I can re-watch it anytime. I always get shivers down my spine from just watching the opening and a few moments during the episodes. For the opening I like the art and basically how it was made. Just seeing the animation and movements of the white and black still characters is satisfying enough for me. I admit the manga is better but I need music and voices, I don't care about these peoples criticism.\\n\\n\r\nMY THOUGHTS:\\n\r\n\"What can anime do that manga can't? What by definition is possible through the medium of animation that is not possible by a series of printed pictures on paper (manga)?\". This here is what I think that keeps lot's of people going, the color, sound and movement. This is a good point about the anime, it has these things that the Manga doesn't have. Does it mean it's better than the Manga? No. Does it mean that we get to hear voices we only imagined in our heads? Yes. Anyway I'm just happy we have gotten this far in the anime.\\n\\n\r\nThe quote in the paragraph above was originally written by another user, I got his permission to add this to my review.\\n\\n\\n\r\nCONCLUSION:\\n\r\nThis season looks better than the prequel, mostly the camera angles and music. It's definitely worth watching. It's possible that you will find this very entertaining like me. Remember it still has big flaws.                                   \\n\\n\r\n**************************************************************                           \\n\r\nEPISODIC\\n\\n\\n\r\nFIRST EPISODE:\\n\r\nThe first 2 minutes of the first episode was perfectly done. From 00:07-2:07, the art was amazing and the 2D animation worked perfectly for it (Since I was using kissanime the time may vary. It's about a 6 second difference without KA). The characters had faded lines near their body parts just like the previous season but it was no doubt 2D. This was a perfect start to the anime and the opening after that scene made it even better, especially listening to another 9mm Parabellum Bullet song. Just as you finish watching the opening you will undoubtedly come upon the same CG animation as the prequel. To be frank, it was kind of disappointing. I knew what I was going into but I was unable to prevent thinking, \"What would Berserk look like if it wasn't CG\". The CG can get rather inadequate, yet it does grow on you. Look, I'm going to be straight forward with this... seeing the 3D characters talking and moving was very unsatisfying. It's possible that this episode will worry you for the upcoming episodes, but rest assured it does get better. During 09:07-15:50 there is a big fight. In that big fight at 10:17-10:19, 11:06-11:43, Guts and someone else clashes swords several of times (1). For this fight it was said to be swords clashing in repeated motions. I reduced the speed to 0.15 to confirm what a youtuber (Professor Anime) said, on the end he was half right.  At 19:32-20:30 the scene had a mixture of 2D and 3D, specifically at 19:53-20:30 was just 2D. I couldn't ask for anything better for that bloody scene (when I said bloody I mean blood rushing out of a head and arrow shots). That short battle scene was much better than how the movies executed them. Another good animation scene was at 21:20-21:35, it was superior to all of the prequels moments. Presumably, by now you know that Berserk has it's fair share of 2D scenes, but this is very limited to just close up's and short scenes. \\n\\n\r\nSECOND EPISODE:\\n\r\nAt 3:44-4:30, a demon (call it what you want) appeared and I must say that the animation was crap. I just didn't buy it, it was like it was cut out straight out of the manga and just put in 3D without bothering putting in better details in it. At 6:02-16:15 it was a flashback of ****** past, for the whole 10 minutes it was 2D (2). The content in that 10 minutes was very important since it was clearing up that uncertainty about ******  that's been going on since the prequel. Making the flashback with the 2D was what made this episode successful. At 20:34-21:00 it was missing one thing... it was nipples. It's got nothing to do with my sexual desire, it's what I think would work for such a moment. I would like to see more mature scenes because this is Berserk after all.\\n\\n\r\nTHIRD EPISODE: \\n\r\nAt 16:35-18:22 this was the area where I was most worried, but I was impressed. The soundtrack worked very well with the scene and the animation wasn't a burden to the content at all. At the scene there was a bunch of demons in a cave, it could of gone so wrong but it was saved by the 2D moments. To be honest everything was fine for me, it's other people I was worried about. Around 35 seconds out of the 1.48 minutes was 2D and I tell you this now, 17:02-17:30 was absolutely BEAUTIFUL. It was one of the best animation moments of the series since it looked professionally animated.\\n\\n\r\nFIFTH EPISODE:\\n\r\nThis episode here is very important. It contains a turning point that changes what we have been seeing for the whole series to something entirely new. We have been witnessing bloodbaths and demon slaying, now a new genre kicks in and brings us to a new interesting arc (3). This episode also had a change of pace. We got a break from the constant killing and can watch the characters enjoy the peaceful time. Another important feature was the 2D. The important scenes had 2D and I got to say that this was crucial. I would of loved it if the whole series was made like that, however this is one of the flaws we have to deal with. 14:46-19:00 was entirely 2D.\\n\\n\r\nSIXTH EPISODE:\\n\r\nAnother episode the studio couldn't mess up, they showed what we Berserk fans wanted. (6) This whole sentence can't possibly be put in non-spoiler form. Not big spoiler but things you don't know of yet. In this episode I realised how much Farenese-sama character has developed. A massive improvement and I consider her cute in 3D and 2D (waifu nearly). I had a laugh at a few scenes in this episode. Guts sword handling was better than earlier this season, I say it was the best of the modern Berserk. 3D didn't screw up anything for me for the past few weeks if I must say.\\n\\n\r\nSEVENTH EPISODE: \\n\r\nThe action in this episode beats everything so far. It can sometimes look like a PC game in some scenes, but the actual fighting and such is great. Of course it can't be perfect but I personally think that some of the camera angles didn't work out.\\n\\n\\n\\n\\n\\n\\n\r\n------------------------------------------------------------------\\n\\n\\n\\n\\n\\n\r\nSPOILER (OPTIONAL):\\n\r\n(1) In this battle Guts faces Zodd one-on-one. The speed of this battle is crazy to the point that you don't know what's going on. The 3D in this didn't work out that well in my opinion.\\n\r\n(2) A flashback of Farnese-sama's past. Regarding her past, it was slightly rushed especially around the time when Serpico had the duel and a few other parts. To be honest this isn't worth mentioning because it's very minor.\\n\r\n(3) This episode brings the topic of the spirit realm and the talk of Astral beings. Not to mention the newly introduced spirits called Sylphs, air elementals. The sylph sword held by Serpico was brilliant. Also the introduction to Salamanders, fire elementals. Basically the fantasy side of Berserk.\\n\r\n(4) This episode introduces us to the Trolls. It would of been better if their body hair didn't look like it had gel in it. btw I wasn't making fun of it, I was simply pointing out it's flaw. You should know from last season anyway.\\n\r\n(5) In episode 5 during 5:46-6:58, Puck and Evarella fights for an acorn. It's possible to miss it because it happens during a important conversation.\\n\\n\r\n(6) Serpico tries out his sylph sword against trolls, he was the best character in this episode. The animation of the magic was brilliant, the colors too. \\n\\n\r\n(7) So a troll was raping a woman in a 2 second scene and after that, 7 or so Trolls was showed in the background raping with no movement... it was very disappointing.\\n\\n\\n\\n\\n\\n\r\n------------------------------------------------------------------\\n\\n\\n\\n\\n\\n\\n\r\nSTATS (OPTIONAL):\\n\r\n(+)(-) =  is rating increase or decrease from the last edit.\\n\r\nThe prequel Berserk (2016) has 46,610 users scored out of 110,842 members. That is a 64,232 users who didn't score. \\n\r\nBerserk (2017) on the other hand has 7,569 users scored out of 41,702 members. That means that 34,133 members who didn't score due to several reasons that you probably get an idea of. In the end 69,140 members from Berserk (2016) decided to not add the sequel to their lists. This is assuming that all users added (2016) to their list before (2017).\\n\r\nThe prequel has a score of 6.77 and previously had a score of 6.13 when it was airing. Berserk (2017) however has the score of 7.39 (0.04-) and beats its prequels airing score by 1.26 with room for improvement. Anyone can see that there has been a improvement in the scores.\\n\r\nFrom when I first made this review, there was a big change. \\n\r\nFor Berserk (2016), there was a 5,281 increase of users scored and a 4,830 increase of members. \\n\r\nFor Berserk (2017), there was a 3,039 increase of users scored and a 6,610 increase of members.\\n\\n\\n\r\nI basically said everything I wanted to say, I leave the decision of watching it to you. I spent a lot of time on this review, I hope it helped. Just in case you liked the stats, the recordings are on my profile.\\n\\n\\n\r\nEDIT: 9/6/17 8:37 AM\\n\r\nEpisodes watched: 9\\n\r\nModified by Jeikobu11\\n\\n",
            "date": "2017-04-25T04:08:00+00:00",
            "helpful_count": 78,
            "mal_id": 246276,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jeikobu11",
                "username": "jeikobu11"
            },
            "url": "https://myanimelist.net/reviews.php?id=246276"
        },
        {
            "content": "Buckle up, this is going to be a long one.\r\nBefore I get into any detail with this show I'd like to pose a question. What can anime do that manga can't? What by definition is possible through the medium of animation that is not possible by a series of printed pictures on paper (manga)?\r\nThere's two things: sound and movement. With anime (read: animation) you can have music, sound effects and often voice acting as well. While movement can be suggested in a manga, the pictures do not literally move before your eyes like with animation. \r\nMy point here is that an animated adaption of amanga relies on, well, animation and sound to become something arguably more than the source material. There's a lot to gain from becoming animated but it's also possible to screw this up creating a product lesser than the source manga. \\n\\n\r\nIn addition this assumes that adaption did not remove material from the source that affects the quality of the plot. This also assumes that the original artwork hasn't been degraded in detail and quality. However to make animation economical the art (more often than not) is degraded in quality but I believe the quality of the animation can make up for this. It's also worth mentioning that the vast majority of manga are primarily in black and white, which opens up the possible avenue of using color where there really wasn't before.\\n\\n\r\nThe original Berserk is a traditional manga. It is in black and white, features no true animation, and has no sound of any kind. Because of this I am going to be rating this adaptation based on the following: Faithfulness of Plot, Sound Design, Animation Quality and Color Quality. My belief is that any anime adaptation of a manga that fails in these regards is a complete failure of an adaptation.\\n\\n\r\nFaithfulness of Plot:\\n\\n\r\nThe previous season was absolutely infamous for including an opening episode full of nonsense that contradicted the original plot. I've been told spoilers are not allowed so to be brief: Two whole arcs of Berserk were skipped and character introductions were remade to fit in with the much more condensed timeline. This is one of the reasons I gave the previous season a \"1\". Over time the episodes became more accurate to the source material but I want to make it clear, this is not a plus. This is not \"Plot Quality\" but how intact the original source material is. In some very rare occasions changes to a plot in an adaptation might actually make the plot more rational or more enjoyable but it pains me to say this isn't one of them.\\n\\n\r\nSo when I say something like \"This season of Berserk is generally more accurate to the source material's plot.\", don't take it as a plus. It is me acknowledging that the original plot still functions. Having an intact plot is not a plus for a medium like animation. It's not something it gains over the manga. So far the plot has been mostly intact outside of what one might consider nitpicks. The biggest of which is that in episode three I remember the main villain making an incredibly odd manic-villain like face that was totally and completely out of character for a generally well composed villain.\\n\\n\r\nSound Design:\\n\\n\r\nWhen I say \"Sound Design\" I first mean sound effects. Now in an average review for some other adaptation I would first jump to music. I would likely not even mention \"sound design\" because we have reached a point where the average anime has reasonable sound effects to match the actions of the characters and objects on screen. To be honest I can't really think of a time where this wasn't the case. But if you're a Berserk fan you know that this is not the case for this series. \\n\\n\r\nThe *CLANG* sound effect coming from the main character's weapon makes it sound like a frying pan as compared to a weapon referred to in the source material as \"...too thick to be called a sword\". It is not only irrational that such a hollow sound would emanate from this weapon, but the sheer loudness of it is absurd. There's only three or four different *CLANG* sounds ever used and they are used constantly between this season and the previous. In this season a new character wielding a hammer of immense weight shows up and it turns out that he too uses a mostly hollow, likely aluminum weapon for it also has the *CLANG* sound effect. Also a demon using a \"horse head cutter\" apparently also needs that same *CLANG*. Watch the first episode and in particular look for the fight between the characters \"Guts\" and \"Zodd\" and you'll understand why I spent so much time talking about one sound effect.\\n\\n\r\nIf you haven't watched this series than I know you may think this is just a nitpick but every time it occurs I feel a wince of anger that I'm not used to feeling from basic sound effects. I never felt this way watching the original 90's Berserk adaptation nor the somewhat weaker movie adaptations.\\n\\n\r\nIn general the sound design isn't the best. For example, amazing composer Susumu Hirasawa composed two songs for this show, \"Hai Yo\" and \"Ash Crow\". On their own these songs are pretty good. I still prefer \"Forces\" and \"Aria\", but these songs are no slouches. But usage is everything in an anime. Hai Yo is used incredibly frequently and is often used as background music. Keep in mind this is not a \"background song\". It has lyrics that regularly get talked over.  I like to believe I am writing  in a very dignified style so my emotions may not totally reach you so I want to make it clear that this makes me very unhappy. Very. Susumu Hirasawa's music made the 90's anime what it was. The animation quality in that show wasn't the best (better than this but still not great) but the way his music powered scenes was nothing short of fantastic. He is my favorite anime composer, bar none.\\n\\n\r\nBut here his music is talked over and used as episode preview music. Do you like anime by Satoshi Kon? Do you remember Paranoia Agent? Imagine the OP of that series playing not only at the beginning of every episode but often in the episodes as well at the end too and every time someone was talking over it. And the rest of the soundtrack was replaced with very generic tunes. That's what the music in this series is like. Same composer by the way, Susumu Hirasawa was there too. One track overused and yet under utilized. \\n\\n\r\nBut the sound design IS better than before. The clangs are a little less prevalent and the voice acting is often easier to hear now. The cast is perfectly acceptable by the way. At no point did I really feel any great or super memorable moments of acting from the cast but that's more than likely due to the animation quality making the characters look silly over anything else.\\n\\n\r\nAnimation Quality:\\n\\n\r\nThis is the sticker. This is the one you've heard about. To put it plainly, this is the fatal flaw. In the past I have been called \"shallow\" for caring so much about animation quality. But I want to say two things in reaction to that. First I just mentioned I loved the 90's Berserk anime despite its shortcomings and two, anime IS animation. Anime is by literal definition a Japanese adaptation of the word \"animation\". As stated above there are things you can do with this medium that you absolutely 100% cannot do in others. When adapting something like a light novel there's few pictures to go off of so the animators can probably get away with more than when they are adapting a manga, especially one like Berserk.\\n\\n\r\nBerserk is written and illustrated by Kentaro Miura and he is well known for his immensely detailed and layered art. That isn't to say he can't put a lot of emotion into simpler drawings, he can do both. Anime often runs at a lower frame rate already than (generally speaking) western animation to acclimate for more detail but even among manga Berserk is absurdly detailed. There are images in the Millennium Falcon arc of Berserk (which is what this season is at least partially adapting) in which I simply cannot fathom a human being taking a pencil/pen and drawing line by line those images on paper. \\n\\n\r\nBecause you now know this you might believe it could be impossible to truly and accurately recreate the drawings of Berserk economically in a reasonable time period. And you are right. But that's fine. This is par for the course for a lot of anime. The creators of this series decided to deal with this problem by using Computer Generated Images. I'll just say CG for now.\\n\\n\r\nThe CG in Berserk is awful. It runs at an absurdly janky frame rate compounded by highly unnatural movement. In addition to this the creators of the show have decided to add on this fake shading by attempting fake crosshatching on everything. I mean everything. Every single character has these criss-crossing lines on their faces and bodies at all times that make it absurdly clear just how undetailed these models are. This show is mostly CG too. There are hand-drawn scenes but they in some ways might actually make the show worse. Let me explain through comparison.\\n\\n\r\nIn the first two Berserk movies there was a lot of this very problem. Janky CG. But in the third movie many people started to forgive Studio 4C's CG and I believe this to be for two reasons. The first being that they actually learned from their mistakes. The framerate and detail of their models did increase.\\n\\n\r\nThe second is that, no spoilers, but there was a good amount of supernatural and otherworldly imagery in the third Berserk movie. A lot of that imagery also shows up in this show. The thing is that 2D and 3D imagery inherently clash when the CG isn't essentially perfect. In more horrific scenes this works out well, providing a somewhat uncanny valley feeling to the proceedings.\\n\\n\r\nBut this new show is ALWAYS like that. Main characters are mostly rendered in CG and then suddenly switching to 2D at random intervals. It's jarring. I think I'd prefer all mediocre 2D or all substandard 3D over this. Although neither of those alternatives is something I'd want in lieu of actually good animation. And I'm not saying 3D animation is inherently bad, but this is no Gantz if you catch my drift.\\n\\n\r\nThat being said if compared to the previous season this show is better. Guts' model is more accurate, there's a bit more 2D animation and the general 3D animation is slightly smoother in movement.\\n\\n\r\nI also want to mention something else this show screws up, camera movements. It seems almost ridiculous to talk about, I never really think about this in any other anime. But the director seems to be either overly excited to have a 3D plane to work in or is simply incompetent with camera movement (or both) so the camera in this series is almost always shaking, or spinning, or doing god knows what to be honest. As the episodes go on and there's less action and this nonsense definitely happens less but it's still quite absurd I even have to mention this. This is a failure you just don't see everyday. \\n\\n\r\nColor Design:\\n\\n\r\nThe last thing an anime can do over a (black and white) manga is to add color. This show certainly tries to do this. Some colors seem to make logical sense while others are absurdly bright. In general this whole show seems to lack logical shading (see that cross-hatching thing I talked about before) and some characters are crazy bright. There's an archer character introduced a few episodes in that wears a bright pink shirt, so bright you would be able to see him a mile away, ironic is it not? I made sure to check in the manga and low and behold, in the few colored drawings of him it's a dark maroon shirt.\\n\\n\r\nAgain this was worse in the previous season (see: Holy Iron Chain Knights) but again this ISN'T a thing I should have to mention. Although Berserk is black and white there IS colored reference material the studio could have easily extrapolated into the show's character designs.\\n\\n\r\nConclusion:\\n\\n\r\nThis show can be considered functional. You turn on an episode and it will play from beginning to end and will manage to tell a coherent story. It will have sound and movement. It is by all definitions an animated work. But is it worth watching as an adaptation? No. Absolutely not.\\n\\n\r\nIf you didn't know, as of writing Berserk is the single highest reviewed manga on this website. By a good margin too. It has been showered with tons of praise and I myself have given it a 10 which I want to say is very, VERY rare of me to do. I take \"10's\" very seriously. It's my favorite manga easy but don't take just my word for it.\\n\\n\r\nNow consider this show. It's got what, a 7.37 right now? That's about 2 points lower than the manga. Is a 7.37 anime better to you than a 9.28 manga? Allow me to make an assumption too: this show would be reviewed even worse than 7.37 if people were actually watching it. The previous season left such a stink in so many mouths that this season is significantly less popular. It's less popular than Sin: Nanatsu no Taizai, which is an adaptation of a series of plastic models.\\n\\n\r\nThink about that. An adaptation of the best reviewed manga on this website is less popular than middling softcore porn about a series of purchasable toys. That hurts me.\\n\\n\r\nI gave this show a \"3\" meaning I think it is very bad. I love the story of Berserk but this show doesn't do it justice. There's so much that can be done with the medium of anime but this show fails to do any of it even though its storyboards were provided to them.\\n\\n\r\nPlease read the manga. Even if you've never read a manga before, please give this one a shot. This show doesn't give the original story what it deserves and fails to add more to it. In the end and after so many words that's all I can say, please read the manga and do not let the failings of this poor adaptation keep you from enjoying the masterpiece that is Berserk.\\n\\n\r\nEDIT: Update my score to a 1. All that this show succeeded in, what little there was, completely fell apart in the last 4 episodes. Avoid this show like the plague.\\n\\n\\n\\n",
            "date": "2017-04-25T23:57:00+00:00",
            "helpful_count": 49,
            "mal_id": 246329,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4445996.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/UtterSpartan",
                "username": "UtterSpartan"
            },
            "url": "https://myanimelist.net/reviews.php?id=246329"
        },
        {
            "content": "I'll keep this short and sweet because everyone here must have seen Berserk (2016). \r\nIt's basically the exact same, except the pacing problems have gotten better. There really isn't too much too say, the CGI art is trash, but if you have read the manga you'll take what you can get. Obviously the ending is incomplete because the manga continues on much much further, and is still ongoing. \r\nI'd say don't watch this if you haven't read the manga, because it will confuse you and will be the least bit enjoyable. For me I love seeing manga come to life through animation even if itisn't the best so I did enjoy it to a degree, and overall will give it a 7.",
            "date": "2017-06-23T08:06:00+00:00",
            "helpful_count": 39,
            "mal_id": 250754,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4745752.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/existentialist",
                "username": "existentialist"
            },
            "url": "https://myanimelist.net/reviews.php?id=250754"
        },
        {
            "content": "I think being an anime-only watcher has helped me in sticking it out with this anime despite its glaring faults in the technical department(CGI,sound effects, etc). \r\nI decided to give the Berserk franchise a chance with the introduction of the 2016 season and if I had to compare that season to 2017's there are a couple things I can mention. \r\nThe story for this season was amazing as always and it is what keeps me coming back to watch week after week. I didn't have any issues with how the pacing was done.\r\n I felt like the directing was a bit better this season thanin 2016 although this was mainly for about 75% of the series. The last 1/4 had some major issues that I couldn't look past. Much of the same can be said for art and animation. The addition of 2D animation for some scenes were more than welcomed on my end but if you are one that do not like the mixture of 2D and 3D in shows then it might be a bit jarring for you.\\n\r\nThe soundtrack is what you would've been familiar too from the 2016 season and it is great as always. The introduction of new characters as well as the development given to some members of the cast was appreciated. Overall I was able to enjoy this season of Berserk a little bit more than I had the first season.\\n\r\nIf you are coming across this anime for the first time, I'd suggest you give episode 1 of the 2016 season a go to see if the 3D CGI would sit well with you. After that I recommend you check out the Berserk anime that came out in the 90s(or the movies if you're short on time) or you can read the manga for which I keep hearing great things about. I hope my thoughts on this show was useful to you!",
            "date": "2017-06-23T14:10:00+00:00",
            "helpful_count": 33,
            "mal_id": 250788,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 4,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=250788"
        },
        {
            "content": "TL;DR: 7/10 - The dreadful 3D CGI animation is almost bad enough by itself to ruin this whole adaptation, but in the end, this show has enough awesome characters, plot developments, and fight scenes to make it worth watching. \r\nART: 2/10\r\nLet's get this out of the way. The 3D CGI \"art\" is bad. There is no way around it, and there is no excuse good enough to make up for it. The actual moments where they take the time to fully draw each scene without the CGI is so beautiful that it literally makes the show worse because you know what it could've been, whatit should've been. I wouldn't go as far as saying that the show is unwatchable, but I'm admittedly a huge nerd for Berserk, and I've conditioned myself by watching RWBY, Blame!, Knights of Sidonia, etc..\\n\\n\r\nSTORY: 10/10\\n\\n\r\nSpot on adaptation, frame for frame, and scene for scene. So what can I say about the story? It's Berserk, and it's the good times, where we really see some actual character development and the fight scenes sprinkled in are frequent and satisfying. There's new characters, both allies and enemies, magical weapons, mysterious powers, interesting plot developments; I really envy anyone who is unfamiliar with Berserk and gets to see it for the first time in all its glory!\\n\\n\r\nSOUND: 9/10\\n\\n\r\nAll of the voices are still coming out pretty much how I imagined them when I was reading the manga. 9mm Parabellum Bullet returns to provide the opening once again this season, and it's just as awesome as the first one; the ending was just okay. Just like the plot, the score of this show often pushes the boundaries of being over-dramatic and cliche, yet somehow it always appears graceful and confident. You may, however, get tired of BLOOD AND GUTS AND GUTS AND BLOOD AND BLOOD AND GUTS AND GUTS AND BLOOD AND BLOOD AND GUTS AND GUTS......and blood\\n\\n\r\nCHARACTER: 10/10\\n\\n\r\nSolid characters appear this season, and we get to see deeper character development of ones that have been around a while. The unlikely cast that began to form in the first season becomes better, faster, stronger, and most importantly, more fun to watch as they work together to get out of life-threatening situations. Gone are the days of watching Guts, all alone, getting thrown around for twenty minutes before somehow impaling the enemy and dragging his broken body away. Now he has friends to watch him do it too! We also get to see most of the enemies that will become more of a presence as time goes on, even if it's just for a moment. There are also a few characters, both new and old, whose true alignment is hard to determine.\\n\\n\r\nENJOYMENT: 7/10\\n\\n\r\nThis one was tough, because I truly enjoyed this season, and this new anime series as a whole. I didn't want it to end, and I'm excited that a third season has been confirmed. That being said, I can't blind myself to the complaints of others, who have enjoyed Berserk in the past, but were completely turned off by the new animation. \"Read the manga\" is not something you want to hear when describing an anime adaptation, and I can't honestly say that those who are newbies to Berserk would be able to appreciate this show as much as I did. \\n\\n\r\nOVERALL: 7/10\\n\\n\r\nIt pains me to give an official entry in the Berserk series such a mediocre score, but I feel that if I went any higher it would be the fanboy in me, not the reviewer. This isn't what anyone imagined when they pictured the day that Berserk would get a continuation to the anime adaptation. I wish they could've chosen another show to try this on, but I respect them for trying at least, and it is enjoyable to watch. I hope that they prove everyone wrong next season, and really get the hang of overlaying the CGI with drawings and commit to it like in the movies, but if none of that happens I'll still watch it.",
            "date": "2017-06-23T12:24:00+00:00",
            "helpful_count": 32,
            "mal_id": 250781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1440577.jpg",
                "scores": {
                    "animation": 2,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lainsbearsuit",
                "username": "Lainsbearsuit"
            },
            "url": "https://myanimelist.net/reviews.php?id=250781"
        },
        {
            "content": "As someone who Loves Berserk as a manga and read everything up umtil the most recent stuff. this series just like S1 this series is an insult. it's an insult at best. the charecter writing is Loyal to it's original meterial.\r\nThe soundtrack is realy nice. It get's you hyped for some epic events, wich look horrible in this animation. If Studio Madhouse would not be this Busy i wish they would have picked up this show because the art of shingeki, or how it's animated would have been so much better than the pile of shit the studio produced.",
            "date": "2017-05-19T05:16:00+00:00",
            "helpful_count": 15,
            "mal_id": 248035,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheNightquest",
                "username": "TheNightquest"
            },
            "url": "https://myanimelist.net/reviews.php?id=248035"
        },
        {
            "content": "First time I started watching Berserk in 2014 year and that was movies 1,2,3 and 3D art was amazing + story line and overall 10/10 true masterpiece.\r\nSecond time was 2016 season 2 TV series almost everything on 8/10 except art\r\n5/10 everyhing (story) is from manga, but I do not read manga just played berserk in dreamcast and ps2 version.\r\n2017 jul I started season 3 and what I saw art improvements and all other things same, tbh from this 3D art I got resistance and no longer crying about it.\r\nThat ANIME in overall = Masterpiece and if you disagree that means you are WEAK!",
            "date": "2018-02-20T13:07:00+00:00",
            "helpful_count": 11,
            "mal_id": 272036,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6490648.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/magaiverix",
                "username": "magaiverix"
            },
            "url": "https://myanimelist.net/reviews.php?id=272036"
        },
        {
            "content": "This is hilariously bad. It is so bad that it actually serves a purpose by being a great filter for people with horrible taste. If you ever see someone recommending this to you or someone giving it a score above 4, try not to listen to any recommendations by that person.\r\nHilarious webms of the anime:\r\nZodd transforming: https://webmshare.com/JGWoL\r\nno impact slapping: https://webmshare.com/qN9Mz\r\nIsidro turned into a droid: https://webmshare.com/m8mEJ\r\nasymmetrical movement: https://webmshare.com/3y1aD\r\nSouth Park or Berserk: https://webmshare.com/WWQLK\r\nBoth the sound and art direction are an absolute mess. \r\nThe art is basically only CGI with characters looking and moving like stiff ragdolls, sometimes completely out of sync with their environment or each other,sometimes the animation is so minimal you may think this is actually South Park.\\n\r\nSound, on the other hand, consists of the same 10 overused effects over and over again. CLANK CLANK CLANK. The sound of a metal pole hitting an empty garbage bin is used for whatever weapons clash.\\n\r\nThis is one the level of Musashi Gundou, but sadly it ain't as hilarious, considering the fanbase waited an eternity for a worthy anime adaptation to continue the saga.",
            "date": "2017-06-03T17:13:00+00:00",
            "helpful_count": 12,
            "mal_id": 249215,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97391.jpg",
                "scores": {
                    "animation": 1,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 2,
                    "sound": 1,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shabazza",
                "username": "Shabazza"
            },
            "url": "https://myanimelist.net/reviews.php?id=249215"
        },
        {
            "content": "I don't know what to say.... Berserk is personally my favorite manga of all the times... The story and the characters, the artwork... Everything is just perfect, i can't find any flaws.... And fast forward here we are in 2017... The 2016 anime was a letdown but we all still had one hope for the next arc.... The Berserker Armor........ I won't go into details as to why i absolutely love the story of Berserk as i believe anyone who has read the manga does not require an explanation. So yeah, today the time has finally come, after enduring all these episodes of crappy animation,bad expressionless cgi, character models that look like manequinns, all of the CLANG sound effects and the memes that came from it..... the fated time was here............ AND IT WAS HORRIBLE!!! I never wrote a review but i was so furiously enraged that i just had to!!!! Where do i begin??? The horrible animations? With the fact that the Berserker Armor episode was probably the worst looking one in the entire series??? I don't know. I mean, seriously. At the moment where the armor's helmet changed shapes, they didn't even bother making a decent scene out of it, i simply assume they had given up and so to minimize the hatred that would come they simply USED A COLORED MANGA PANEL!!!!!! IM SERIOUS!!! A COLORED MANGA PANEL!!!! And thank god they did!!! Because otherwise i probably would have cried!! Thank god they didn't animate it!!!! Because they are so bad, without talent or skills and disrespectul to the original work that i really hoped the entire series was just colored panels, i would have preffered it. I know you can't call this a complete review as i only talk about the Berserker Armor episode, but i will say this. The anime is generally terrible, mainly because it's visuals and the sound effects etc doesn't do it justice either. I really wish that show was given the amount of love and artistry it deserved... It's really sad. That one episode was the thing that made me break.... I will not watch another episode, simply because of the pure dissapointment... I will just re-read the manga to wash the shittyness off, if it is possible at all.... I honestly have to say that LIDENFILMS have sinned here.... If i could give a negative score then i would have given it a -10\\n\r\nTruly Berserk is one of my favorite stories and LIDENFILMS have created such an abomination that i have given it the lowest score... It is a sad day for Berserk",
            "date": "2017-05-26T11:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 248575,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ProteinShake",
                "username": "ProteinShake"
            },
            "url": "https://myanimelist.net/reviews.php?id=248575"
        },
        {
            "content": "STOP. Please, just stop.\r\nThis is a disaster, this is a trainwreck, this is trash to the ten billionth degree. Who in the hell thought that it was a good idea to give one of the greatest manga franchises of all time to a terrible, inexperienced CG Studio who couldn't animate their way out of Mickey Mouse's toilet bowl? Stop, just stop already, this is tearing me apart, Lisa! Give Berserk to Trigger, give Berserk to Madhouse, give Berserk to ANYONE EVEN MODERATELY COMPETENT IN THE ART OF ANIMATION IN THE SLIGHTEST BIT AT ALL! \r\nWhy? Why does this exist? Everyone involved in the decision togive Berserk to this studio should be fired into the sun. If I was Miura I would be having a freaking conniption that this was what they were doing to an absolute masterpiece of a manga. The 1997 anime is a bit dated, sure, but it still looks competent, it's easily watchable, it conveys the tone, the fight choreography make this thing look like toddlers slap boxing with flimsy action figures in a play pin. Why was this CG, why was this given to this studio, just why?\\n\\n\r\nPlease, end it, reboot immediately with a better studio, make it stop, this is literally painful to watch. 1 out of 10, I'd give it a negative 10,000 out of 10 if I could. Stop this madness, give one of the greatest mangas of all time to a great animation studio, this will be remembered as one of the worst studio decisions in the history of the anime industry. JUST STOP, please and thank you.",
            "date": "2018-02-15T09:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 271560,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6557058.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ShotgunXShogun",
                "username": "ShotgunXShogun"
            },
            "url": "https://myanimelist.net/reviews.php?id=271560"
        },
        {
            "content": "I can't believe i've rated a Berseker so low but well..I did and here comes one of the shortest reviews i've done to date.If you are a fanboy or a fangirl or someone who can't handle mature language get a hike cause things are gonna get a bit messy.\r\nIt's a little known fact among my peers that i love Berseker.In fact i love it so much that i wanted to move to Japan and marry it,have it's kids and live happily ever after.But i think it might have been a holiday romance and when we came back i realised that it had horrid face hair.\r\nIwas in love with the manga.All the details,the story,the design....Every single damn thing was absolutely stunning..And some time back the first one popped and boy did all the boys howl like we saw Pamela Anderson blowing Tommy Lee on a boat(which happened some years later actually).And while not the best even by the standards of the time it had something to it that made you....Happy.\\n\r\nFast forward to 2016 and after many attempts the franchise had yet to see a proper adaptation.And this one was the first ever Berseker that made me hate its' guts(pun intended).In short it was unwatchable.My head was spinning like i took cocaine or meth.Which clearly to my mind was what the studio that made this was on at the time.That horrible CGI,i still have nightmares about it.\\n\r\n2017 and there's word about this,the new and better in every way Berseker..And when i saw it i smiled.I smiled like Joker did.But my friends as it turned out the only normal thing,animationwise wwwwwwwwaaaaaaaaaaassssss..The fucking opening.After that it was like being dipped in liquid nitrogen and then smashed to pieces.\\n\r\nAll the excitement and joy gone in secs.i couldn't believe my eyes.The CGI was still there and still as cancerous as ever.If the previous one gave my eyes cancer this gave my brain Ebola and i died painfully screaming like a madman.\\n\r\nThe characters design....Dear lord deliver us from evil.The shades for example were like i took a pencil and just drew some lines on their faces.You remember those early 32 bit console graphics?Well they managed to do worse than those.It was painful to watch.The camera angles are like they're taken out of Ozzy's birthday party after he got hold of a camera,stoned out of his mind.\\n\r\nThe animation is the killer of this show.Even the 90's Berserk animation is better than that.Now i know that the cost of adapting the highly detailed manga would be off the charts.But this isn't an excuse for such a bad job.The frame rate is jerky at best.The movements are so unnatural it's like watching a mouse breastfeeding an elephant.The combined use of 2d and 3d is off the place.The end result is so appaling it's almost like watching Donald Trump havin one of his famous showers...\\n\r\nThen onto the sound dept..The sound effects are horrible beyond belief..A fight breaks out and swords clash and you hear the unmistakable sound of your mother banging sauce pans..If i wanted to hear sauce pans banging i'd hear Metallica's St.Anger lads...The opening song?It doesn't serve only as an opening song but also as a background music...Seriously?How freakin lazy are they?You can hear the damn lyrics in the background while conversations are taking place.\\n\r\nI expect the fanboys to barge in and burn me alive for this review,but i'm not into fanboyisms..If something is crap i'll say it's crap..Emotions don't make for a better show..And this isn't one.\\n\r\nIF we were talking about the manga,IF,i would be writing a love letter to the maker not a rant in MAL.But now we are talking about the anime.And since the most basic pillar,the animation,is outrageously bad to the point it becomes dangerous for my health then i can't possibly care if the story is made from the tears of an angel.And since i can't bring my self to watch this i can't and won't care about anything.If they wanted me and other people to care maybe they should have gone down another path.Which they didn't.\\n\\n\r\nLet me give you an example.If you have a surgery you expect the doctor to do a good job and not leave you a hideous scar.If the doctor does a good job all is well.If he leaves a sponge or a screwdriver inside you after the operation...See my point?\\n",
            "date": "2017-12-06T01:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 264620,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339890.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Dionkeykong",
                "username": "Dionkeykong"
            },
            "url": "https://myanimelist.net/reviews.php?id=264620"
        },
        {
            "content": "I don't now how people can defend this anime,the story of berserk shines through. while it has some of the worst cgi i've ever seen and then when it does the 2D it looks good but thats hardly ever. The VA is good. The music is good at first but after they replay the same music over , over  and over , it gets old very quite. The characters are great when they don't rewrite them from the manga. i didn't really have much enjoyment due to awful cgi. The manga is a downright masterpiece and does not deserve to have this crap asan adaption. if you like the story and haven't read the manga do yourself a favour and read it.don't waste your time with this anime.",
            "date": "2017-06-20T22:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 250510,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6235220.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Crazyripps",
                "username": "Crazyripps"
            },
            "url": "https://myanimelist.net/reviews.php?id=250510"
        },
        {
            "content": "I don't know how this got a rating this high, i mean 7.14 or sth. like that i just can't. you know guys this is a disgrace to you and the masterpiece of miura himself you should not be satisfied with this horseshite and don't be afraid to ask for sth. better we, the manga and miura deserve better than this shit this is just a shame. instead go read the manga or watch the anime from 1997 also not perfect but way better than this. well i need to mention im happy that susumu did the music at least he does a great joband did it also in the 1997 anime thats one of the few positive things i have to say about this steaming pile of disgraceful shit. yea i like to use disgraceful because this shit is just an disgrace, you know when u order some of your favorite food and you get shit served and they want to tell you this is the food you ordered or wanted after you said this is not what i wanted well you got the same here just because there is not much of animated berserk doesn't mean you have to accept it all as good or say: well at least sth. no thats not how it should be, it is an horrible adaptation and nothing else and thats what it has to be pointed out for",
            "date": "2017-10-13T19:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 260705,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6629681.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SteamingDullahan",
                "username": "SteamingDullahan"
            },
            "url": "https://myanimelist.net/reviews.php?id=260705"
        },
        {
            "content": "I didn't want to write a review so early, but I feel like this needs to be said straight away for those who were left with a sour taste in their mouths from Berserk 2016. This review will be updated at the end of the series, and some scores and notes may change due to changes in the show itself.\r\n~Story 10/10\r\nI'm getting the vibes that people who have watched the first two episodes of Berserk 2017 have not read the manga. As it stands now in the scoring department, as far as I can see, it is split between people who have read and peoplewho haven't. With that little gap of people who scored the show low for the animation.\\n\r\nThis arc or arcs, are the segments in the manga that again, some people didn't like being added to Berserk. That segment being the magical aspect of the show, which further leads into the Berserker Armor later on. This what Berserk is all about, the build to this was just the beginning, to see it on screen makes me squirm with joy. Please do not judge the show thinking the source material isn't up to par, because in retrospect, it is all about the story.\\n\\n\r\n*After Completing*\\n\r\nIt looks like we're going to get a part two of the City arc and possibly part of the boat arc if Berserk continues.\\n\\n\r\n~Art 6/10\\n\r\nFirst I want to talk about the OP, then I'll get to the show's in-show art itself.\\n\\n\r\nThe OP starts off with a sunrise. Casca, Guts and Puck resting after what looks like a very strenuous night fighting off demons. The blood from Guts' brand still fresh proves this testament as the title-card BERSERK pans up on screen. Sonia is then seen running wide-eyed and excited to see Griffith, while the Band of the Falcon's flag flies behind her. She opens her arms and Griffith accepts her gesture. This shows us that Griffith will use anyone for his main goal, and discard anyone he pleases on a wim. A picture of Griffith is shown, he looks down as if to reflect on what he's done, but is quickly reminded that emotions are a distraction as he looks up and yandere(ly) stares at the viewer.\\n\r\nWe now go back to Guts, Casca and Puck as they get ready to make their way to the next location with the rest of the main cast shown in a pan shot.\\n\r\nThe troll fight is a reflection of what is to come during this arc, the introduction to the power of magic, and the importance of Schierke in the series.\\n\r\nWe get a zoom-out-shot of our main cast of heroes, the shot however is slanted. This represents how fringe the group as become, how odd this band of travelers is. We then see a panning shot of some key role-players in the Band of the Falcon.\\n\r\nThe setting then changes to night as Guts is consumed by the rage of the Berserker Armor.\\n\r\nCasca tries to rip her ropes as a metaphor for her trying to escape the pain and mental distress brought onto her by Griffith.\\n\r\nSchierke cries out at the loss of a loved one.\\n\r\nGuts is then shown he has control over the armor with Schierke's help.\\n\\n\r\nThe art in the OP was wonderful, however the show itself is still lackluster. However I can see some improvements since the disgrace of Berserk 2016, some that need to be mentioned. \\n\\n\r\n1) Establishing shots are done correctly, I was surprised to see this at first, we can connect with scenes now and not be confused.\\n\r\n2) The color pallet isn't an LSD trip, it seems to be more down to Earth this time around.\\n\r\n3) In important story-telling that reflects character development CG is not used to get the viewer to connect with the characters more, since it is harder to relate to a digitally rendered being.\\n\r\n4) Emotions are animated better than Berserk 2016, even in CG digital animation.\\n\r\nMistakes have been made prior, and they have been corrected. This is worth praising.\\n\\n\r\n*After Completing*\\n\r\nI was wrong in many many cases in regards to how Berserk would turn out 4 episodes in.\\n\r\nThe art stagnated into oblivion, establishing shots were decimated, and the animation decided to give us screenshots of drawn work over CG.\\n\r\nThe fight scenes were drawn out better in some cases...majorily not, but respectfully. \\n\r\nI'm baffled that the last 3 minutes of episode 12 were drawn so well. Baffled that they couldn't animate the entire series like this, I almost feel insulted. Here's to hoping this is a sign of change for the next series of Berserk. \\n\\n\r\n~Sound 8/10\\n\r\nThe awesome thing about this series is the soundtrack, the key element to its predecessor. It's back and better than ever.\\n\\n\r\n~Character 7/10\\n\r\nWorking on character development straight out of the oven. I can see myself caring for these characters as much as I do in the manga, time will tell.\\n\\n\r\n*After Completing*\\n\r\nI still care for these characters however one is missing, manga viewers will be disappointed.\\n\\n\r\n~Enjoyment 7/10\\n\r\nSo far, despite the animation, knowing it has improved, I'm really enjoying the show. \\n\\n\r\n*After Completing*\\n\r\nBerserk 2017 was a roller-coaster, but I wouldn't ride it again. \\n\r\n~Overall (as of now) 8/10\\n\r\n~Overall (Completed) 7/10",
            "date": "2017-04-28T19:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 246515,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283499.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Meew2",
                "username": "Meew2"
            },
            "url": "https://myanimelist.net/reviews.php?id=246515"
        },
        {
            "content": "Berserk (2017) offers only the bare-bones of its manga counterpart. The skeleton it constructs manages to hold itself together, if not competently then just enough to look as if it was doing a jig and effectively masquerading the failings of its ligaments. Behind the jarring visual quality lies an engrossing Gothic inspired fantasy adventure following an endearing ragtag group of characters in a world rife with lore, brewing with demonic forces and accompanied by a pretty decent musical score.  \r\nWith Guts and his merry band of outcasts forming up from the get go there was less changing of POVs and this made it feellike more about his quest to protect Casca. Which made it all the more bitter when Gut's struggle explored his vulnerability that he, himself could be a danger to her and how it led him to rely and trust his new accomplices. This never felt overt or hammed in, having been predominantly conveyed through seemingly insignificant actions that may only become apparent through a characters stray thought.\\n\\n\r\nAll of the side characters went through some self actualisation. Farnese's faced self perceived uselessness, followed by her confrontation of the witches and her nurturing relationship with Casca. These experiences accumulated into her growing into a more stable character, which may disappoint some if you enjoyed her antics of the first season. Her sadistic and  over-privileged demeanor were expanded upon in a insightful flash back sequence of Serpico's childhood, which also added a new layer of complexity to their master and servant relationship.    \\n\\n\r\nAs a witch Schierke has been inundated with tradition, her arc covers the magic system, supernatural beings and history, which was interesting enough and paced out effectively to not feel like exposition. As she ventures into the outside world, no longer having someone to follow she learns what she wants to do for herself. This time of uncertainty can be contrasted with entering adulthood and finding your own way into the world.  Isidoro's adventure is just beginning, which makes him most similar to Scheirke yet he views things from a \"I can do anything.\" belief. He uses his practical skills to move through life, while Scheirke follows her intuition which causes a friendly, childish clash between the two. There are plenty of lighter moments of banter, crushes, budding friendships, zombie Casca being zombie Casca and Puck displaying a visually off kilter type of comic relief, all of which provides much needed levity. \\n\\n\r\nThe low production values are glaring to look at, the action scenes especially suffer. What the sporadic cinematography achieves in shifting the focus away from the awkward CGI trades off some of the impact on what could have been epic moments. At times the landscapes capture a sweeping brooding beauty, the animation flows and the composition makes you want to take a snap shot but these are far and few in between to be redeemable.   \\n\\n\r\nBesides from some cheap metallic clanging and the odd overused theme Berserk (2017) holds up proficiently in the sound department. Hirasawa is back, blending in his style of rock that captures the atmosphere of Berserk. Hirasawa aside, there are a few tracks that while enhance the action can be overbearing take you out of the dark fantasy world of Midland. The voice actor for Gut's does a good job of capturing his gruff and occasional inhuman voice.    \\n\\n\r\nThere are always a multitude of threads moving through narrative and the sense of danger is always lurking within them all. In a way the ugliness of the character designs and animation match the grim events taking place yet for a series heavy on action, no matter how cool it may look conceptually there is no denying that it falters. Like with a skeleton doing a jig, it outwardly looks more awkward then it does scary yet even when its original intent was to stirrup fear, the skeleton can still put on a fun performance.",
            "date": "2017-06-27T10:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 251222,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1490799.jpg",
                "scores": {
                    "animation": 2,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mookster",
                "username": "Mookster"
            },
            "url": "https://myanimelist.net/reviews.php?id=251222"
        },
        {
            "content": "This show showed me how anime can ruin a great manga. This show fails on all accounts for me. The awful CG which looks like it took 4 minutes to program, the shot composition which a baby would do better, pathetic fps in fight scenes and character designs which look like nightmare fan art of the original. I'd rather have my intestines ripped out and fed to me than being subjected to watching a second longer of this terrible, terrible adaptation that puts Akame ga Kill on a pedestal when compared to it. Excuse me while I go scoop out my brain's memory center soI forget this atrocity was actually born and aired in this sad, sad universe.",
            "date": "2018-09-01T02:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 287882,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7327463.jpg",
                "scores": {
                    "animation": 1,
                    "character": 8,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NarDev",
                "username": "NarDev"
            },
            "url": "https://myanimelist.net/reviews.php?id=287882"
        },
        {
            "content": "Kentaro Miura did a great job giving us such a series to read. If it wasn't for his many hiatus, Berserk would have been competing with One Piece in manga category. Now coming to the anime, again going for the 3DCGI. The animation totally sucked, it was looking like playing a 3rd rate 3D video game. The only thing that helped berserk cross the line of being a decent anime was its intense storyline and an amazing plot. Although, the anime left out a lot of scenes, but if they would have stuck to 2DCGI rather than doing the entire stuff it would have muchgreat!!! The fight scenes and the blood shed would have been more intensified if the frame overlaying would have been a lot smoother considering they would have done it in 2D style animation. Aside from that it was all Kentaro Miura's story telling and plot that dragged the anime forward keeping viewers glued to the series cosnidering many Berserk fans prefer reading it rather than watching after the Berserk (1997) series.",
            "date": "2018-04-13T13:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 277980,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7026252.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/otaku_nerd7",
                "username": "otaku_nerd7"
            },
            "url": "https://myanimelist.net/reviews.php?id=277980"
        },
        {
            "content": "Berserk 2017, don't judge a book by its cover. I've tried so, but the product evokes as well the popular adage \"don't make the same mistake twice!\".\r\nIn case of story and characters the applause for writing a gorgeous Manga, with good story and character development rightfully belongs to the Manga-ka and no one else. In other words, the appropriate use of an already given story and its characters is a solid ground-skill that is required for the preparation or completion of an respectable result. That basic knowledge can, neither be regarded as valid sign of professionalism nor as a possibility to mitigate flaws in otherdisciplines, e.g. the visual adapting. In brief, if the good story and its character are regarded as a merit of the creative team, to me that seems like an intention to trigger a cycle which reverse the previous link between cause and effect. In combination with an attitude of \"Everything is good as long as it is entertaining\", this leads to an unacceptable philosophy that is best described as an unreflected, illogical positivist perception.\\n\\n\r\nIt doesn't matter how much effort and fine polish was used to improve the visuals of Berserk 2017 if techniques are used in the same way as in Berserk 2016 the result will be the same visual disgrace, just like a leopard cannot change its spots. Instead of using the standard 2D, GEMBA chosen a 3D modeling which cuts to 2D in dint of close-up shots. But the 3D modeling looks sloppy because well portrayed expressions or emotions are often lacking. The synchronization quality between speeches and mouth movement is bad. And last but not least, to put insult to injury, the most compelling, expressiveness and vivaciousness force in the case of an anime character that creates a tension in the observer somewhere between interest and seductive sensibility is the expression of the eyes but the performance attempts in Berserk 2017 are still remotely inadequate to printout the strength and beauty of this elementary component. For this reason and because of the stiff unnatural movement of the characters the created actions scenes do leave the spectator's souls untouched. The shadows are still done by linear hatching, it looks cheap and, at the same time irritates, because frequently it looks like the shadows are floating and even moving when the camera zoom-in or -out. The cinematography, is still sometimes incorrect so that the viewer frequently feels uncomfortable, by the disorienting camera work. All in all it looks artificial, totally unpleasant and even sometimes extremely ugly, like the outward appearance (esp. the face) of the pirate-captain near the end of episode 12. An creative team must be prepared to listen to complaints and accept criticism. Notwithstanding the fact that the predecessor was already criticized a lot, all the flaws of the 2016 version are represent in Berserk 2017 as well. In this connection, the saddest aspect is - could laugh about it if the matter were not so serious - that there are signs of what it could have been but they did not put any effort on and ignored the feedback, so that it feelt like wasting the breath with the words.\\n\\n\r\nThe sound section was not much better either. Quite the contrary, the sound of sword is still ridiculous and synthetic no matter what it hits. The BGM seemed frequently misplaced and even disturbing. I constantly had the feeling that the music reminded me of other famous Themes. \"Peering into Darkness\" e.g. reminds me of Maurice Ravel`s \"Bolero\". The OP \"Sacrifice\" - 9mm Parabellum Bullet, isn`t bad but it sounds more like an opening for an shounen, rather than a dark and gloomy medieval fantasy show. A suitable musical form that allow the right atmosphere to be created for a show like this, needs to be more gloomy (IMO). For example good gothic-rock or power metal could have been appropriate. The ED \"Issai wa Monogatari\" by Nanjou, Yoshino (feat.) Yanagi, Nagi, maybe the text is poetically interesting but starts off with monotonous singing then starts developing somewhat style but soon refocusing on typical, appropriate for an ending theme instead of inventing something new and therefore it is not very notable. In the predecessor, the voice acting seemed to be the one thing that at least showed some effort but this time it does not feel the same.\\n\\n\r\nWell, there has been a small probability to convince me but then I encountered the problem that they have done \"the same mistakes twice!\". That was a very disappointing development in my view and so I really hope that there will be no continuation of using the Manga as a sacrificial lamb on the altar of commerce. As bad as the predecessor but this approach, also has additionally the downside of being the second failure.\\n\\n\r\nIt simply was no fun at all.\\n\\n",
            "date": "2018-02-23T09:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 272247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5632852.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sesshomaru",
                "username": "Sesshomaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=272247"
        },
        {
            "content": "If you hated the last season of berserk and was hoping they would improve on there mistakes you will be disappointed like the first overall just stay way from this one theirs just not much to write about this that hasn't been said about the first season.\r\nThe animation is still piss poor like the first season no improvements there not much to talk about on that.\r\nStory is done better in this season but the animation holds it back and really theirs no point to really watch since we have a manga that has better art to help the story its the same for characters. \r\nthemusic is the best part of season 1 and 2 really holds up same with voice acting these are the best parts about the show but that not saying much.  \\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-07-02T13:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 251769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4321307.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dragon97king",
                "username": "dragon97king"
            },
            "url": "https://myanimelist.net/reviews.php?id=251769"
        }
    ],
    [
        {
            "content": "Because I cannot truly enjoy this version...To put it simply, if you don't know Berserk at all then do not start with the 2016-17 versions.  Start back at the original 1990 series, and then after enjoying that then go onto this series OR read the manga then whichever you didn't do last time.  \r\nNow to the actual review.  If this was the only anime and the 1990 version didn't exist then I'd say it is actually pretty decent.  It isn't a GOOD anime, but it isn't bad either.\r\nStory: 10, It has a great story as Berserks story is outstanding, 10/10\r\nArt: 4,Decent art, I am not a fan of CG in general but it isn't awful, but it also isn't good.\\n\\n\r\nSound: 2, Absolutely dreadful sound design..  Berserk is known from the 1990 for a fabulous sound design throughout its gruesomeness and epic battles along with woeful emotion driven scenes.. The sound for battles resembles someone using the microphone to smash the opponent armed with kitchen ware, pots, pans and maybe a microwave in the mix.  Just... awful.\\n\\n\r\nCharacter: 6, in the 2017 they found that they stayed away from straight up endless battle scenes and started to just give their characters real screen time that it might strengthen the anime...  This was a very good change as I'm sure people's ears were bleeding from the sound of endless fight scenes.  But they do develop the characters well.. or better in the 2017 version and it is the primary reason why I'm still watching it.  It isn't GOOD, but at least its something.\\n\\n\r\nEnjoyment: 5, Meh its Berserk, one of my favorite series of all time..  I enjoy it because of the nostalgia.  Someone on that team is trying to tell the amazing story that Berserk is.  Props for that.\\n\\n\r\nOverall: 5, It isn't good, it isn't bad, its better then a lot of things you could be watching and a lot worse then some things you could be watching.  For anyone who is a long time Berserk fan, take off your fanboy hate hat and allow the nostalgia of the series pull you through, don't think about how good it could have been and just watch like the dumb specimens we are.\\n\r\n:)",
            "date": "2017-05-21T17:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 248241,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/193217.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 2,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/madmaxypoo",
                "username": "madmaxypoo"
            },
            "url": "https://myanimelist.net/reviews.php?id=248241"
        },
        {
            "content": "This review is tainted by the subjective feelings of a Berserk fan. \r\nI tried my best to suppress them but I can't ignore those entirely, I'm sorry. \r\nIf you want a totally unbiased opinion, please do not read further.\r\nThere are people who enjoyed Berserk (2017), and they have the right to do so.\r\nBut I simply couldn't.\r\nFans know the suffering.\r\nWe live with it every day, knowing it will never come to fruition:\r\nThe perfect Berserk Anime.\r\nEven though, we keep on hoping that someday, someone will  take on the task of transforming Kentaro Miura's outstanding work, into a visual experience comparable to his exceptional art skills, itwill probably never happen. \\n\r\nThe expectations are way too high, so we will keep on complaining that nothing is good enough.\\n\r\nKeep that in mind while reading further.\\n\\n\r\n\"But maybe....\", your were thinking, when they announced Berserk (2017), a sequel to the atrocious prequel and adaptation that was Berserk(2016).\\n\r\n\"Just maybe, this time it's going to be fine. Yeah sure, the animations were bad, a CGI-Monstrosity even. The sounds were supposedly recorded on a busy day, in a tiny Japanese restaurant: *clang* *clang* *clang*, weapon sounds similar to a distorted pan hitting the floor.\\n\r\nAwful and absurd scene positioning and camera shots, draining a lot of scenes off their potential... \\n\r\nBut maybe not this time! They surely used some feedback to improve the show, making it possible to watch an entire episode without screaming internally. It's going to be okay.\"\\n\\n\r\nWhelp, prepare to cry. It happened again.\\n\r\nThe issues of the first season are the same in the second.\\n\r\nI do not exaggerate when I say, that the best thing that came out of it for me, were the opening and the last two minutes of the season finale, which were on one hand, decently animated and on the other hand a painful reminder of what could have been.\\n\r\nThe only reason I watched it to the end, was the same reason why a lot of people did the same thing: The source material. \\n\r\nAnd when you stick to a series just because of the source material, I don't think that the adaptation was a success. But that's just an opinion after all.\\n\r\nMaybe my expectations were to high or the mentioned insufficient objectivity blinded my openness completely...\\n\r\nI desperately wanted it to be good, but I couldn't.\\n\\n\r\nIf you enjoyed Berserk (2016) you will enjoy Berserk (2017).\\n\r\nIf not, then you won't like the second season as well.\\n\\n\r\nBut don't despair, struggler.\\n\r\nMaybe next time it's going to be all right...",
            "date": "2017-07-06T06:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 252099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6003434.jpg",
                "scores": {
                    "animation": 4,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HuiItsLui",
                "username": "HuiItsLui"
            },
            "url": "https://myanimelist.net/reviews.php?id=252099"
        },
        {
            "content": "They have butchered Berserk more than Guts butchers just about everything.\r\nThe only decent things I can say about this show, is that the music is not terrible, and they somehow managed to keep parts of the original show in it...are they done well? God no, but there are still traces of it there, slowly being consumed by a studio that clearly does not want to listen to the fans. The sound effects are pretty shit, though the voice acting is solid enough, though I can only say so much about that since I am not Japanese. So now I am going to talk about theanimation...at least I would if there was much there...Now I don't hate 3d animation, in fact I actually quite like the Berserk movies, and hell even Kado has some damn fine 3d animation, but this looks horrendous. Like don't get me wrong, it looked bad in 2016, but it somehow manages to look even worse this season. Characters have little to no emotion, and there are points in time where nothing is moving... Now nothing moving wouldn't be a huge problem if the still shots were at least pleasant to look at, but you could honestly get more mileage out of stick figures. Please for the love of god don't watch this show. Don't give this studio any attention, just let the show go die in a hole so that hopefully we can get something better by a studio that cares down the line. Sure it ain't likely to happen, but I would rather have nothing if this is the something.",
            "date": "2017-06-25T14:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 251031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6208466.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Shadowarrow64",
                "username": "Shadowarrow64"
            },
            "url": "https://myanimelist.net/reviews.php?id=251031"
        },
        {
            "content": "well despite what most people say i found this season to be really enjoyable the CGI from last season and this one was a bit to get used to, but i kind of find myself liking it more and more every time i see. the pacing was better than the 2016 season and the new comrades are always nice to the show.\r\nmy only major complaint about the show is that 12 episodes is just too damn short wish they would dish out the big bucks for a longer format season to add more content/story to the show.\r\nnext season i just hope guts is not stuckon the boat for 12 episodes.... i think i might die if i have to go through that again.",
            "date": "2017-06-23T21:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 250817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2505085.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/budweis3r",
                "username": "budweis3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=250817"
        },
        {
            "content": "I rarely buy manga but berserk was the exception for me, I had everything I could ask for in a fictional series and more. When It comes to the newer berserk adaptations people go straight to the bad CGI for why It's terrible, but I'll try to focus on more than that.\r\nStory: 8 This anime covers the Millennium falcon/hawk arc of the manga and does a pretty good job of staying true the story and not being a mess in the beginning like the 2016 anime.\r\nArt: 1 Baring a few scenes with hand drawn animation the rest is very poor CGI same as last season.\r\nSound:6  The score by Sagisu Shiro while not as fitting as Hirasawa's music for the 97 series is still epic. Theres a few overused tracks but thats it. Guts voice actor sounded very stiff in 2016 but improved a bit in this series. The rest of the cast was solid.\\n\\n\r\nCharacter: 9 In this arc guts forms his traveling party all made of characters that get a great amount of development in this arc.\\n\\n\r\nEnjoyment: 6 Once I got past the jarring art and realized it's still berserk's characters and story underneath I got a good amount of enjoyment.\\n\\n\r\nOverall: 6 Whether you like this series or not will depend on how much you love berserk and whether or not you can look past the art. I don't recommend either this series or it's prequel to someone who hasn't read the manga. \\n",
            "date": "2017-06-23T16:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 250804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5461485.jpg",
                "scores": {
                    "animation": 1,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RuleZaWarudo",
                "username": "RuleZaWarudo"
            },
            "url": "https://myanimelist.net/reviews.php?id=250804"
        },
        {
            "content": "It..it was fine.. kinda. Sitting with the group of 'at least we get something' fans.\r\nThe main issue is obviously the animation, since the story is still following the manga. It ends at a somewhat odd point, but anime adaptions love cutting things off so. \r\nONTO THE ANIMATION....If you try to imagine it like cut scenes from a game, then maybe it takes the edge off...though it very quickly smacks you in the face again when a scene combines classic animation with the new 3d stuff.  \r\nNOW, the apostles were actually kinda decent honestly. They just..they gotta work on the people. I don't want tosee Guts walking towards the screen like a puppet from the original thunderbirds show. \\n\\n\r\nOverall I think its bearable if you have the mindset that's stated at the start. Don't go into it with high expectations and you'll be fine. Think of the story, not the imagery...maybe.",
            "date": "2019-01-13T06:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 298919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6577044.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LostintheEcho",
                "username": "LostintheEcho"
            },
            "url": "https://myanimelist.net/reviews.php?id=298919"
        },
        {
            "content": "*Disclaimer*\r\nJust personal scratch.\r\nAdvised, possible spoilers.\r\nOpinion & Informal \r\nNote #1: Going to make a few slight comparisons to the manga in regards to what I personally would have preferred to have been adapted. \r\nArt: 5/10 This season did much better than the last. CGI models and backgrounds/environment. Certain scenes and animations were in a more traditional drawn style. There were more drawn scenes in this season than the last which is a plus. The CGI models weren't too bad and seemed a bit better than the last. Overall there were decent enough improvements art-wise and model-wise compared to the previous season. There was still the problemof not giving too much dedication or attention to the impact-shots which I had mentioned about in the previous season. What I mean is that I wish the beautiful impact-shots that were done in the manga would have been better adapted in this season. Those were quickly skimmed over and I wish there would have been a focus on those bits. Proportions and anatomy were okay. Monsters looked alright and didn't look too cheap or low-effort. \\n\\n\r\nAnimation: 5/10 About the same as the previous season. Sort of clunky still, but it didn't use too many cut-shots this time. Some scenes and motions such as sword swings were actually shown on some occasions. Movements such as walking and running were okay for the most part, though there were indeed some awkward moments. Some of the special effects were nice to look at but they weren't super impressive. \\n\\n\r\nCharacters: 4/10 I feel like the characters weren't as fleshed out in this adaptation as I would have liked. Their grievances, resolutions, and feelings weren't captured as well as I would have liked. Yes, all the cast was there. Characters weren't missing exactly, but at the same time they did feel like they were missing. Now this territory is in what the individual thinks and concludes for themselves, but I personally felt that Isidro  (I personally pronounce it as Ishidoro) had feelings of inferiority? When I read the manga I personally, repeat: personally, think that Isidro began to harbor a slight jealousy? inferiority? realization? not sure, towards (I pronounce it as Shirkee) when Isidro saw how much more capable she was compared to himself despite being about the same age. There was a slight hint of that during their whole troll den escapade but it was so skimmed over and practically ignored. Mmm, if I wanted to just be easy about it I would just say that the characters seemed so flat in this adaptation. They didn't really have the same \"life\" I felt they had in the manga. \\n\\n\r\nPlot: 4/10 Goes up to the Holy See's harbor part right after Isidro reconciles with Shirkee when he had messed up her hat. It leaves off at a sort of weird spot.\\n\\n\r\nDevelopment: 4/10 I'm okay with what went on here. There was some freedoms taken but this season did much better than the last in terms of following the source timeline. I don't have much to say because they things that were supposed to happen, happened. I wasn't particularly surprised by anything because I'm already familiar with the source. If we're talking about parts that were well done I would say that the initial donning of the Berserker Armor was cool, but it was only cool. It wasn't well done, it was cool. The \"Ash Crow\" song that played during that part sent a slight chill down my spine. That bit was nice. I'm not comfortable in saying that anything in this adaptation was truly well done. I dislike how the bit on the consequences of Guts turning on his friends was skimmed over. I also dislike how pulling him back from his enraged-mode was skimmed over as well. \\n\\n\r\nMusic: 7/10 This season did much much better in using its theme songs appropriately, especially during impact-scenes. This season used pretty much the same osts, soundboard, and sound design as the last but it did so in a much more noticeable fashion. The \"CLANGs\" weren't as prevalent in this season and didn't overwhelm the music which is either a plus or minus depending on the person. For example, The \"Hai Yo (Oh Ashes)\" was used in battle scenes and was noticeable in how it was used and the right times. Same for the \"My Brother\" song. The \"Ash Crow\" song was also used appropriately in my opinion. I gained a new appreciation for Ash Crow and have actually come to like it a lot. The song really brought out a sense of dread and a foreboding air whenever it played and fit the scenes it was used in. \\n\\n\r\nConclusion: 5/10 Sort of underwhelming ending. Gave us an \"It continues\" or whatever at the end of the last sequence. Open-ended ending for another season I suppose? It answered a few questions and did its best to whip up some sort of meaningful resolution-ending for Shirkee. \\n\\n\r\nOverall: 5/10 Enjoyed it a bit better than the previous season, but in terms of pacing and where it leaves off I don't like it. This section of Guts' journey is the \"Going on an adventure with me and my friends.\" bit. They could have at least focused a bit more on certain developments and growth areas than going along with the story at an unreasonably quicker pace. Overall I have mostly the same gripes as what I thought about the previous season. There were some improvements art, animation, and music-wise but those aren't enough to make up for failing to capture Berserk as a story. This adaptation was okay.",
            "date": "2018-09-08T18:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 288489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2481421.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheHentaiKing",
                "username": "TheHentaiKing"
            },
            "url": "https://myanimelist.net/reviews.php?id=288489"
        }
    ]
]