[
    [
        {
            "content": "Anime sometimes appeals to action, adventure and over-dramatic plots to keep people watching the series...after all anime series before it, very few revolved around real life and work places. Well, Working'!! is one of them, and though the story is mostly nonexistent, all the humor around the episodes will draw your attention to it. It's on the same base as the original Working!! anime, but with new characters and more of the anime restaurant we begin to love so much. \r\n--Story--\r\nHow everything begins, and why everything happens. (Skip if you already read synopsis)\r\nFollowing last season's end, Takanashi continues to work on Wagnaria with his fellowco-workers and bosses, dealing with his own family affairs meanwhile. Here, the relationship between co-workers goes slightly better, but just enough to not involve any serious romance affairs, but also to make new gags to crack a laugh from time to time.\\n\\n\r\n--Time exploitation--\\n\r\nSome animes makes time pass faster when watching them, and some do the opposite.\\n\\n\r\nOh, it's good. Believe me. As I said, it doesn't have a concrete story or goal to archieve on each episode, but even so, you'll get dragged in one of the many sub-plots, normally involving 2 characters, and you'll eventually worry about them, sympathize with them, or simply laugh as the situation gets incredibly awkward to one of them.\\n\\n\r\nEvery episode has about 3 \"semi-stories\" in it, so you'll never get stuck in something that doesn't go on or simply get the feeling nothing's really happening there.\\n\\n\r\n--Story and Characters Evolution--\\n\r\nStory (usually) grows as time passes, but how about the characters?\\n\\n\r\nHard to say, actually. Comparing to the last season, most people is basically the same, with their same strange habits and same unrequited loves. But, during the season, things change a little. Inami, as she gets better at controlling her androphobia, Takanashi begins to deal better with non-chibi woman, Yachiyo starts to get closer to Satou, and so on.\\n\\n\r\n--PERSONAL Opinion--\\n\r\nExactly what it means. What I think about the anime ^^\\n\\n\r\nSome people says watching an anime without a story is like reading a book about a normal old man: you get nothing out of it....well, half true...but does it really matter? Really? I watched this anime just a couple of months ago, and I laughed every 4 minutes of it, and just because of this little fact I became so addicted to Working. Indeed, most animes have their gag scenes and phrases, but on Working, it never gets old or repetitive, and even on apparently normal scenes, it throws something all of the sudden just to make you laugh.\\n\\n\r\nThe visuals are gorgeous as always, the soundtrack is pretty much the same, the new characters are just as complex and well balanced between crazy and realistic as the others, and of course, you'll have lots of fun watching the anime\\n\\n\r\n-- Score and Recommendation--\\n\r\nFinal score to me and to what people I would recommend.\\n\\n\r\n8,0/10\\n\\n\r\nIf you don't care about story and just want to go in to meet crazy characters and a little of their lives, welcome in. Otherwise, better go watch some other anime.",
            "date": "2012-03-02T20:17:00+00:00",
            "helpful_count": 53,
            "mal_id": 55219,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1081273.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Niokun",
                "username": "Niokun"
            },
            "url": "https://myanimelist.net/reviews.php?id=55219"
        },
        {
            "content": "!!This review includes the first season!!\r\nI′m not really that strict when it comes to anime with no 'goal' and story line. If it has a great art, music and set of characters - I′ll watch it. And of course, I need to rely on my enjoyment, if it′s not pleasing enough to make me smile, drop it. Working!! Is a really great and funny anime, with a simple sense of humor and jokes. At first, I wasn′t really paying any heed to Working!! because I thought this anime is just a mediocre and will be boring as hell - well I was totally wrong atall the points.\\n\\n\r\nTalk about story, this anime doesn′t really have what you would call a 'plot', neither does this story have a goal that they need to aim and complete at all costs. If you don′t like shows with no story and just full of gags, this isn′t for you. But hey, this one′s different - by different I mean really different. Truly, Slice of Life and Comedy mix is one the best combination of genres in a show.\\n\\n\r\nWhat about the characters?\\n\r\nThe characters in Working!! are all great, they have their own personalities that most probably suit their images and outer appearance really well; Working!! has a great mix and set of characters - Popura who is as cute as a hamster, Takanashi or Katanashi as referred to by Popura who is a lolicon — in which he is denying strongly by stating that he just likes cute things/kids. Yachiyo, a closed-eye character who is very naive and is in-love with the Manager, Kyoko, who is not really doing her job and is just eating all day. Satou, who is a blonde-haired handsome dude. Souma-san who has a radiant smiling face and Inami who has an androphobia - let′s say she′s a bit of a Tsundere and cute (but not as cute as Popura) but her androphobia sickness is pissing me off really really bad.\\n\\n\r\nThe characters are very like-able, though at some point, you may find of them as annoying and irritating, it can′t be helped since not all creations are perfect, and every person has something they will not like, based on their preferences.\\n\\n\r\nWhat I like about Working!! is its simpleness - the genres are balanced and distributed really well. The art is very simple and clean, along with the cute melodic intros and outros which are very catchy. I also like the comedic flashbacks with a mix of light drama in them; and the introductions of the new characters—who are only supporting—is also very much like-able. Because their intros have a mix of light seriousness and a touch of comedy.\\n\\n\r\nI really like comedies, especially when there are parodies involved, like in Gintama. Though the genre of Working!! doesn′t involve parody, it′s still very much funny, like so. Though if you′re a type of person who barely laughs, I doubt you′ll go along with the gags and jokes, if I do say so. Nevertheless, the slice of life share of genre, is also quite much on par with the comedy here — if there′s a slice-of-life type of scene in the anime, rest assured that there will be an incoming gag and comedic insert. The comedy and gags will never ever be missing.\\n\\n\r\nThe thing that I didn′t like about Working!! is its lack of story line, given that there isn′t one. It′s not that I really dislike it, the things is, I hoped for a more great development with the characters, along with their 'story'; And at some point, I also hoped for romance to bloom, given once again that there isn′t one. If there were a romance to bloom, I think that lots of people would really like this show more, as much as they like as it is now.\\n\\n\r\nAs far as you′re concerned, I really enjoyed watching Working!! despite the fact that it has no plot and goal involved, the substitute is your laugh and your smile. I′m really glad I didn′t follow others′ opinion to check out a new refreshing environment - which was Working!! If you′re hesitating to watch Working!! because of other people′s review, do not hesitate. Follow your own eyes and your own preference, who knows, you might get hooked on something you thought that wasn′t worth the time and effort. For me, it was totally worth it.",
            "date": "2013-03-30T02:12:00+00:00",
            "helpful_count": 25,
            "mal_id": 91581,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/334452.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hengao",
                "username": "Hengao"
            },
            "url": "https://myanimelist.net/reviews.php?id=91581"
        },
        {
            "content": "Working'!! is the second season of a great show, but this season in particular seems to only kick the can down the road.\r\nI like the concept that Working!! is using, however, the relationships and character development seem to be at near stand still. The season presents perfect opportunities for relationship advancements, but the characters are either simply too dense to notice what's happening or the writers are trying to delay an inevitable ending.\r\nCharacter 4/10\r\nI give such a low score because the character relationships do not advance very much. The biggest advancement so far is an exchange of text messages between Inami and Takashi. That's it.\r\nArt,Sound, Story 8/10\\n\r\nThese three are all the same as the previous season.\\n\\n\r\nEnjoyment 7/10\\n\r\nMy enjoyment could have been a lot better, but I found the inability to enhance relationships a very frustrating thing. The awkward moments would happen frequently, but nothing really happens after that. It's like the writers are walking away from something great and having to be replaced with mediocre crap.. The show must end some day, maybe not this season, but I hope it will end the way we all want it too.",
            "date": "2011-12-19T19:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 49611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=49611"
        },
        {
            "content": "Hummmmmmmm..........So far, as I've viewed the 5th episode of this sequel of the original anime, I'd say that it is still as funny as before. It still maintains a plotless comedy genre about a group of individuals working in a family restaurant called \"Wagnaria\" in the outskirts of Hokkaido, and as usual the main focus are wacky everyday things that happens in the family restaurant, so for the story since it isn't much I'll give it a \"Fair\" number 6.\r\nAs for the art...........well........I'd say a \"Mediocre\" number 5 will do, since it is still the same art being used from the original anime. Sound, oksince I like the opening theme a \"Fair\" number 6 would be fine.\\n\\n\r\nCharacters let check the usual:\\n\\n\r\nSouta Takanashi- Wagnaria's only male waiter, as usual, a nice guy who has a thing for cute little ladies (except for Aoi), as usual, has to deal with the following on the day to day basis; at home his dysfunctional elder sisters , at work aside from doing a good job he has to also deal with the following; Aoi's clumsiness and nosiness, staying a few feet away from Miharu and avoid getting into Jun, Yachiyo and Kyuko's bad sides, as usual. \\n\\n\r\nMiharu Inami - The only waitress who avoids getting close to males co'z she has a bad case of Androphobia and wouldn't hesitate to punch any guy who gets  close to her….. as usual. \\n\\n\r\nShirafuji, Kyouko - The restaurant’s manager who does nothing but order Yachiyo to make her parfait, loiter around the office and eat the restaurant’s food, the usual stuff - everybody avoids getting on her bad side as well. \\n\r\nSouma, Hiroomi- One of the restaurant’s chef with the usual nosy attitude. \\n\r\nTaneshima Popura – Still has the usual height issue, still a cute waitress in the same restaurant and still mistaken for a grade schooler.  \\n\r\nTodoroki, Yachiyo – Still welding her katana, still the only bisexual waitress in the restaurant with a thing for both Jun and Kyouko. \\n\r\nAoi Yamada – Ok she’s used to be a support character from season 1, now she’s promoted to be a main character , she’s the restaurant’s residence free loader, who only does menial chores and like Hiroomi she also has a nosy attitude. \\n\r\nJun Satou – The restaurant’s head chef, and as usual he’s the only character whom everybody respects, he can be a handful when he's pissed even for Kyouko.\\n\\n\r\nAs for the other support characters:\\n\\n\r\nOtoo Hyogo – The owner of Wagnaria the restaurant (I think) where everybody works and is still as wimpy as usual.\\n\\n\r\nTakanashi’s sisters:\\n\r\nIzumi, Kazue and Kozue – Well, as usual they’re the muchacho’s  (male lead Souta) troublesome trio who seems to give the latter a lot of headaches, except for  Nazuna the youngest who’s very helpful and understanding with the muchacho’s  predicament in their household. And they now have bigger roles in this 2nd season, mostly in the opening scene.\\n\\n\r\nAnd as for the other small support character:\\n\\n\r\nMashiba  Yohei, Mashiba Mitsuki and Matsumoto  Maya – Hummm, they’re merely what they were intended to be and that is to be supports for the season 2 of this anime, as for Matsumoto Maya, I think she has the potential to have a big role in this anime and I do mean a speaking role and not just limited to a cameo. Now, Otoo Haruna is yet to come out, how she fit in this anime is yet to be known. \\n\\n\r\nSince, it is the main characters that matters and they’re still there and still funny with the addition of the support characters, I guess a “Fair” number 5 will do.  \\n\\n\r\nEnjoyment and Overall: Good number 7.\\n\r\nWhat can I say, this sequel is good. However, I really do prefer Popura to be Souta’s love interest instead of Inami, then again, who am I kidding, this anime’s genre is comedy not romance. Just adding a little humor.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2011-11-07T01:04:00+00:00",
            "helpful_count": 16,
            "mal_id": 46999,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=46999"
        },
        {
            "content": "~ Never Change, Senpai! ~\r\nThe everyday antics and documentation of life at Wagnaria continue into this sequel installment to the first season of Working...\r\n----------\r\nIntroduction / Context...\r\n----------\r\nAs a direct continuation, \"Working'!!\" or \"Season 2\" as i will refer to it to avoid confusion, picks up where \"Working!!\" left off. The prior season of 13 relaxing episodes, was a \"minimalist-styled\" depiction of everyday life within our favourite family restaurant. It embraced its identity as a heavily slice of life oriented production, and so favored character development, over complicated plot development; hence the \"no story, no good\" argument used by those who generally dislike the SoL genre. Priorto Season 2, the \"Working\" franchise has indeed proven itself to be: \"escapism into an optimistic life perspective\" in my books; as you can read up in my corresponding review. And while being such a carefree and often comedic show, I've always felt that its emitted a unique, cosy, warm and \"family-like\" character chemistry, that's not only entertaining to observe, but sets the overriding tone beautifully. \"Working!!\" set the series up rather well by injecting a lot of personality into what has become a particularly memorable cast. It under-toned some dramatic situations, and conversely broke up any heaviness with plentiful laughs to stay true to its strengths. Most importantly, it allowed us to get a decent sense of each character's quirky personalities, and get to know them personally from the intimacy of their thought processes. Except one...\\n\\n\r\n----------\\n\r\nActual Review\\n\r\n----------\\n\r\nAoi Yamada, has always seemed a little distanced from the rest of the cast as viewers of the prior season should be familiar; given her rather mysterious and late appearance.\\n\r\nThere's only so much you can do with 13 episodes, and while I maintain that the \"Working\" series is a well crafted one, the development of this purple-haired, \"Otoo-crazed\"\\n\r\nemployee is perhaps the single hole in the prior season's development; given the required comprehensiveness of the character development, contrasting with the seemingly non-existent story line. Interestingly enough, I initially failed to pick up on the fact that this was indeed a hole, and i'm sure i'm not alone in this, but the awesome people at Aniplex blessed us\\n\r\nwith a second season anyway...\\n\\n\r\nFar from \"improving\", Season 2 fills the hole of Yamada's development with ease, and then quickly goes above and beyond the call of duty to further almost every aspect of the show.\\n\r\nSeason 2 is essentially the refinement: an advancement of the prior, that goes to the lengths of polishing up and adding to already near-faultless piece of work - in regards to the way the franchise \"intends\" to be received.\\n\\n\r\nFirst and foremost, allow me to put fans at ease by mentioning that this sequel season retains the entirety of the signature \"Working!!\" charm of the prior. Unlike some other anime franchises, it hasn't tried to change itself in order to appeal to a new audience, and instead has stayed loyal to its methods, therefore its branding. It's still casually presented, and down-to-earth with none other than an \"everyday\" plot to keep up the relatability aspect. It still brings forth a lot of depth when it comes to expanding on the personalities of the characters; and so it continues to give the viewer an intimate insight into the working lives of the people who make up Wagnaria. It still documents the subtle growth of the characters, as they surpass (or not) an array of appropriately plausible plights, which is sure to withhold the realism of the show, and in turn keep the audience connected; losing themselves in the vivid picture of the family restaurant \"painted\" in front.\\n\\n\r\nAs I mentioned, Yamada's presence becomes more prominent in Season 2, and we learn more not only about her, but the rest of the cast through the mysteries her background proposes as well; a sort of ongoing development \"arc\" if you will. Nevertheless, she is no longer a stranger come Season 2, and so it's great that the character development of the original cast reaches a point of complete coverage during these 13 additional episodes.\\n\\n\r\nAniplex could have stopped there, and had the show come to summit of its success, a flat line from which it can only fall. Fortunately they persisted though in adding new content...\\n\\n\r\nSeason 2 brings about some new faces: from the bizarre antics of the Mashiba siblings, to a long lost relative of Yamada. There's evidently never a dull moment in Wagnaria, which in my opinion is the reason for its success. It refuses to be \"the lake that dries up\", and instead retains the refreshing vibe it started out with; never running out of new revelations, and instead having our admiration of the cast mature, as opposed to stagnate...\\n\\n\r\nThere's more \"maturing\" than you would think going on in the \"Staff-only\" area, as Season 2 brings about: new challenges to test the resolve of Inami. New things for Yamada to help fix. New heights for our \"Senpai\" to reach, and even fears for Takanashi to overcome. Everywhere... The awkward relationships are maturing (with no help from Souma), and Kyouko is hungrier than ever. So yes, life at Wagnaria continues to blossom seamlessly following the previous season, and progress steadily as if the \" \" to \" ' \" transition never occurred. \\n\\n\r\nSeason 2 also seems to work on controlling the visuals better...\\n\r\ncapping the expressive cliche/abstract/chibi presentation, if not just a bit: to make the emotive and comedy scenes more punchy, which in turn had me laughing considerably more.\\n\r\nNo longer does Aniplex accompany every emotion with \"frustration lines\", like in the first season it fortunately seems.\\n\\n\r\nSome drama, a healthy helping of comedy, and a tonne of character-based charm...\\n\r\nWhich is confirmed to be leading towards a third installment, and so I won't criticize the extremely late formal introduction of Mayu as of yet... \\n\\n\r\nAudiovisuals?\\n\r\nThese are for the most part: the same, high, colourful and uplifting standards, as can be seen in the original season. We get a new OP (which i love), and a new ED (which is also very appropriate), the show is throughout still accompanied by a carefree piano-based score...\\n\\n\r\nDownsides?\\n\r\nAsides from the limiting factors of the \"everyday\" premise and branding, from a technical perspective (at least in my mind): I don't see anything fundamentally wrong about this follow up season. It is therefore, ultimately, a straight-up elaboration/advancement to the \"Working!!\" of which you're familiar, and so i have no doubt that fans of the franchise will enjoy...\\n\\n\r\n~ Yama-Dash! ~",
            "date": "2015-05-28T15:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 189044,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=189044"
        },
        {
            "content": "[This is a review from the perspective of someone that didn't watch the first season. Might contain some generalized spoilers]\r\nIronically, everything that I was looking forward to this fall season turned out to be absolutely mediocre, and everything I didn't care for turned out to be pretty decent. Knowing this, I picked up Working'!! without watching the previous season, and surprisingly, it wasn't difficult to quickly get accustomed to the characters. \r\nFrom what I've noticed, several factors make Working'!! a “good” anime; however,  a few others hinder it from becoming a “great” anime. Working'!! has a cast of great characters, although they're not themost original and developed; they all remain easily likable. Now, as opposed to many other slice-of-life's; relationships between the characters tend to stay almost completely static, with a few smaller developments towards the end. This normally wouldn't be a “bad” thing in a slice-of-life, but it's disappointing to see the possible “romances” at a halt,  especially when there's so much chemistry going on  between the characters. \\n\\n\r\nBut what else makes Working'!! a “good” anime? The centerpiece in the anime besides the slice-of-life aspect is the comedy. Now how is the comedy dealt with? It's actually dealt with in a rather unusual way. In comparison to other anime such as Seitokai Yakuindomo and Haganai where the basis of the majority of the jokes are vulgar, the jokes in Working'!! actually incorporate a different feel. The jokes aren't really offensive, which opens the show to a much broader audience. \\n\\n\r\nNow, the greatest factor that sets Working'!! apart from many other comedy anime, is the lack of ecchi. Nowadays, obnoxious fan service and ecchi basically go hand in hand in comedy anime, it's somewhat disappointing. But Working'!! is basically void of all the irritating aspects of it. It's a rarity, and it should be appreciated. \\n\\n\r\nObjective Rating: 6/10. It's a good comedy anime. It's episodic, you could easily pick up the anime on episode eight, as easily as you could on episode one. It's constantly enjoyable, but there aren't any episodes that leave you breathless, it's constantly good, but it's never extraordinary, or great. It leaves you in a good mood after watching it most of the time.\\n\\n\r\nSubjective Rating: 7/10: It's a really enjoyable watch. The characters create a familial atmosphere, and it's hard to not keep a smile while watching it.",
            "date": "2011-12-24T10:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 50015,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/525509.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mdz",
                "username": "mdz"
            },
            "url": "https://myanimelist.net/reviews.php?id=50015"
        },
        {
            "content": "Recipe: \r\n6 Main characters\r\nA variety of side characters (add at own discretion)\r\n1 Relatively simple Slice of Life plot\r\n1 Modern Day restaurant setting\r\nA dash of comedy\r\nthrow them in a bowl, stir thoroughly, and your reward is Working!!. If your working comes attached with a ' at the end, don't worry it tastes exactly the same as a regular Working!! \r\nYes and here we are, with the second installment of that little series Working!!. The original was a quaint little show with a nice set of characters, a decent little story and while a little bit forgettable, it was overall a well put together show. So howdoes the sequel hold up when compared to its originals fairly rooted stand? Well lets dive in and talk a look.\\n\\n\r\nAs you could probably tell by that short little opening recipe there... Working'!! is very similar to Working!!. In fact it really just feels like the first season was meant to be 26 episodes but they weren't entirely sure how well it would sell, so they edited half of them out and saved them for a later day. Why they decided to call it Working with an apostrophe is a bit of a strange choice to me. I get the feeling they didn't just want to stick a number after it so they thought they'd be clever and put an apostrophe there to screw with people that have bad short range vision. Personally I would have called it something like Working: Some More, or Working: Another One... but maybe that wouldn't translate so well to Japanese. Anyways... while similar to the original, that isn't entirely a bad thing, as I've said the original was a decent little show, a fun little romp through the lives of a couple interesting characters. \\n\\n\r\nRight away you'll be hit with a sense of familiarity when the opening starts to play, as the similarity between the two is just enormous. The characters all return, the jokes are similar the location is all similar, and the art style is identical. Since I doubt you're using this season as the jumping on point for this series, you can basically use your own judgement of the first season as your basic analysis for this one. The characters are still the same, while not entirely deep or moving they each have their own quirks and traits that make them likeable. The plot isn't entirely there but it works in its slice of lifey sort of way, with small little dilemmas that get resolved over each episode. Your bound to get at least a few laughs from an episode and the art and music still both look and sound very nice, and keep the atmosphere of the whole series very in tune with what its going for. \\n\\n\r\nSo O.K, so far all I've done is say how similar it is to the original, what does it do thats different? Well... to tell the truth not a whole lot, but there are a few things. For starters, a few new minor characters get added who help liven up an already interesting cast. Also, old characters who didn't get a whole lot of screen time in the previous segment get a bit more of a chance to shine, such as that one older sister who always hides in her room, or a more touching side of the Manager. Also, once again being a new season, the show likes to experiment a bit with its characters, mostly by pitting characters who don't normally associate with or against each other. Stuff like Soma talking more with Inami, Inami talking with the author older sister, Takenashi and the manager etc etc. But aside from that, its still very much the same show, and this is where I start to find my problem with this little sequel. \\n\\n\r\nWhile each episode is pretty nice, and overall the series is an enjoyable little series, I really think it has no right to exist. Ok hear me out first. For starters, it really is just more of working S1. I keep going back to that I know, but there really isn't much else to say about it, it is very similar to the original. \\n\\n\r\nBut that alone is not enough to condemn it, if the show took the opportunity to help expand its characters or its plot in some sort of way, then I feel this series would have been worth it. And it does... sort of. Like I said a few minor characters get a bit more drawn out, so that we can relate to them a bit more and feel like they are decent characters. But here's the real problem. NOTHING. GETS. RESOLVED. AT ALL. Every single episode from start to finish goes waaayyy out of its way to make sure everything returns to the status quo by the end of the episode. The only things I can say with confidence change over the course of this season, is one girl gets a bear, one gets  a cell phone, and one gets a cell phone number... whoop dee doo. And I mean, sure. Every episode one character learns a bit of a lesson, but they never really go back to it. You come back to the next episode and Inami is still throwing punches, popura is still a child at heart, sato still has a crush on todoriki who still has the hots for the manager etc etc. At the end of the season, absolutely nothing important will have changed from the originals finale. \\n\\n\r\nEven the first season had a bit of a flow to it. It was mostly keeping a tab on Inami, and her overcoming her crippling man-phobia. And while it didn't go very far in curing it over the first season, it still ended with you feeling like they had come at least some way forward in the process. In Working'!!, one could almost argue that Inami regresses a little, possibly even putting back what the first season tried to achieve. So really, the fact that so little happened in the grand scheme of the Working!! series as a whole, really makes me feel like this season has absolutely no point.\\n\\n\r\nBut overall... I can't call it a bad series because of that complaint alone. Overall, its just more of Working!! S1. If you liked the first season there's no reason you aren't going to like this one. You might like it a little bit more even if you prefer this seasons comedy, or maybe like the different takes on a few of the characters. I still enjoyed the jokes, it was kinda nice to see the characters once again, and it was good enough that I was easily able to watch it until the end. But I will say this: Anime as a whole would have lost absolutely nothing had this series never been made. Its a fun, but ultimately pointless little romp, like getting a high score on tetris.",
            "date": "2012-01-14T02:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 51779,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/312392.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/leingodf8",
                "username": "leingodf8"
            },
            "url": "https://myanimelist.net/reviews.php?id=51779"
        },
        {
            "content": "This will get my typical second season review, which means that most of what I say will be found in my Season 1 review.\r\nAnother season of Wagnaria's crazy antics, gone by. Wagnaria Season 2 went in nice and quiet, then proceeded to get to the levels of craziness we're all used to.\r\nStory: The story is the same as the original, although with a few extra characters being in the story more. Now instead of just the regular day at Wagnaria, you also follow others, like Yamada's brother and Otoo's wife. Overall, story's not changed, but a few extra gimmicks help keep it interesting.\r\nArt: Updated withnew visual standards, Wagnaria looks better than ever. Brighter colours, more fluid animation, etc. Overall, everything looks much nicer.\\n\\n\r\nSound: Voice acting is still amazing, and the show is now rocking a new opening and ending. The opening feels a bit strange with the intro, but I grew to like it. As always, the opening's animation fits well with the opening, and still pays homage to the original. The ending also works really well, and got me asking myself how Japanese Disco actually would sound.\\n\\n\r\nCharacter: Characters are all still charming, and some extra information is thrown at you allowing for more character development. You now learn about the side characters more in depth. The only thing that I wanted was for the characters to resolve their problems in terms of \"what they're looking for\", but that's what season 3 is for. \\n\\n\r\nEnjoyment: I found this season to be even more enjoyable than season 1, which is always a good sign. \\n\\n\r\nOverall: This season was solid, overall, improving on most categories while never lowering standards. It's actually gotten me excited for Season 3, which I started the same day I'm writing this. If you've been putting off Wagnaria, my only question to you is this: Why?\\n",
            "date": "2018-02-27T18:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 272621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5869540.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rabb2t",
                "username": "Rabb2t"
            },
            "url": "https://myanimelist.net/reviews.php?id=272621"
        },
        {
            "content": "REVIEW: Working'!! (Season two)\r\n\"This is season two of the series by the way. If you want to read it anyway, go on ahead! Spoilers! If you want to read my review on the first season however, the review will be right down below!\"\r\nStory (5/10): Without a resolve with Inami's androphobia, without a surprise is that the unresolved fear of Inami's androphobia is going to continue on within the second season. To mention Ooto's search of his lost wife, Satou and Todoroki's relationship and Yamada's relationship with her family has yet to be solved. What I found disappointing however is that the plot that was worthyof following of was the main characters, mostly Takanshi's resolve to cure of Inami's androphobia. \\n\\n\r\nPersonal rant: Honestly, the plot is bland but the characters help make up for it. If there was a decent plot to follow, surely it would be more entertaining to watch. It is entertaining as it is! But, can't help feel there should be a decent plot to it. For example, an intricate love triangle. Not the one between Satou, Todoroki, and Kyouko. But between Takanshi, Inami, and Taneshima. Not saying this is a good idea considering this is not intended to be a romance series. But, it would be certainly be entertaining to see a sort of development happening. Something of that sort. But, without any intricate plots, it's entertaining either way. It's what makes this anime unique.\\n\\n\r\nArt (10/10): One year had passed since the first season had aired and compared to the art from last season, this season took it up-a-notch! The characters were polished, more detailed than last season. That can be said with the scenery as well! Also, A-1 Pictures again took the time and effort to make another striking and marvelous opening theme! The most rememberable part when it comes to the opening themes is that they never fail to add are the female characters chibi's version of themselves which can be found in the middle of the opening which are just adorable! Not to mention, loved how the ending theme was made which was made with the use of juxtaposition for the most part. Which near the end of the ending theme, Yamada and Souma can be seen playing the tambourine quite hilariously behind Takanashi back in the background. Without a doubt, A-1 Pictures couldn't not have done any better in the art direction in this anime! No complaints here!\\n\\n\r\nSound (10/10): Compared to last season's soundtrack, this season was even better. To mention, that the opening theme was catchier and same goes with the ending theme of this season. Once again, the ending theme was sung by the Fukumaya Jun, Kamiya Hiroshi, and Ono Daisuke. What a blessing to hear them singing once again! Also, the 'seiyuus' once again did an excellent job of voicing their characters roles! Especially when it came down to Yamada this time! Her voice defined her character and not to mention was adorably cute! \\n\\n\r\nCharacter (10/10): The characters definitely livened up the expectations of the series! When it comes to most anime in general, with the addition of adding more supporting characters, all it does just makes it a nuisance. With this series however, with the addition of new characters just made the series even livelier! The character that left a remarkable impression this season was Yamada! She definitely stole the spotlight when it came down to how she interacted with each character! Each interaction was hilarious to watch! Also, can't forget to mention the Takanashi family as well! Each member in Takanashi's family is so intriguing to learn about that there should be a separate series for them alone! Even though they are the supporting characters, they definitely deserve more screen-time! What was disappointing however is that with the introduction of Matsumoto Maya last season was not properly built up this season. She is always seen in jump-cut scenes and until the last episode. It felt unfair to the character not giving appropriate amount of screen time to build up her character. It would've been interesting to see her character more! What I also found disappointing is the relationship between Taneshima and Takanashi's. It would be cute to see them for their relationship to be deepened together. But, to be stolen by Inami which I don't find bothersome at all. Lastly, what I found interesting is that that some of the character's relationship seem to deepens as this series goes by. And, Takanashi and Todoraki who are unaware of love gave out clues and hints of 'romantic feelings'. Despite this series being involving romance, it interesting to see the development of the character's relationship with others.\\n\\n\r\nEnjoyment (8/10): Cannot say that it wasn't enjoyable because that would be a straight-up lie. It was amusing to see every antic the characters had to make! Cried out tears of laughter every now and then simply because this anime is hilarious to watch! Season two, in my opinion, was better than last season! \\n\\n\r\nOverall: (8/10): Season three will definitely be on the look out since it might as well be the conclusion of the series! But without a doubt, this has been quite a ride so far! Can say that this is one of best or the best 4-koma manga anime adaptions up to date! Entertaining and contagious to watch! Can't live without season two, watch it!\\n\\n\r\nRAW SCORE: 8.3/10\\n\\n\r\nOVERALL SCORE: 8/10\\n\\n\\n\r\nReview: Working!! (Season one)\\n\\n\r\n\"Why is this rated a 7.82!? This anime is great!\"\\n\\n\r\nStory (7/10): Concerning of plot, the story has no framework. The anime just revolves many main characters and involves their everyday lives of 'working' in a restaurant. Besides that point, each of their personalities pale in comparison from each other. As a result their personalities mix in oddly well making their everyday lives pleasantly humorous to watch. If there was a framework to follow on however, it isn't until one of the the main character steps into play. Her androphobia, and the cause behind it. Androphobia is the fear of men and the fact of the matter is, she has to constantly have to deal with it with everyday life. Despite her fear of men, she works at Wagnaria where it is inevitable where there may be men at. With the help of main characters however, they push her to get over her fear of androphobia. Through hilarious trials and consequences, the main characters help her inch away out of her fear of men. Even though there may be a little to no plot, the anime is enjoyable to watch nevertheless. \\n\\n\r\nArt (8/10): Like the name clearly states, A-1 Pictures. Nothing is better than A-1 really. The art direction for the opening theme coming into this anime is eye-catching and amusing to see. That can be said with the ending theme following of the anime. To mention, A-1 did a excellent job in catching every detail that it had to offer to the character designs to the scenery. With this particular anime being the based on a 4-koma manga, the animation is grand and the manga pales in comparison. That's all I have to say!\\n\\n\r\nSound (9/10): Ono Daisuke, Kamiya Hiroshi, and Fukuyama Jun are all in one place as they voice all the male main characters in the series. With that being the case, it is particularly interesting to hear their voices. Since they are known voicing many characters from all different series people all know and love. I can quite say all the voice actors did their voice roles well. Especially, when it came to one of the main heroines, Taneshima. To mention, her voice is irresistibly cute. For the music however, the opening coming into this can compare to opening themes such as Baka to Test to Shoukanjuu and Nicjijou. Catchy and up-lifting. For the the ending theme however, the ending theme is soothingly jazzy hearing all the male 'seiyuu' mentioned above sing the ending theme at each episode which was a highlight of this anime. The music was one of its strong points as it created a 'fun atmosphere' for this anime to watch.\\n\\n\r\nCharacter (9/10): The character lineup was definitely bizarre and large in comparison to some anime. Not to mention that one character looked like Sanji out of One Piece. It refreshing to see some characters were not being used out of the anime trope. However, there were a few characters that used the anime trope, but weren't overused to the point it became a nuisance. They were original as each of them had a quirk or trademark to remember them by. The large lineup and the liveliness of the characters is also one of its strong points making the anime enjoyable to watch.\\n\\n\r\nEnjoyment: (7/10): Managed to binge-watch this anime throughout one go. It's easy and fun to watch since it's a refreshing anime to watch. There wasn't a boring moment when it came to this anime. Definitely humorous and laughed out loud. \\n\\n\r\nOVERALL: (8/10): Season two will be on a look out since this was a refreshing anime to watch. Despite the story, the characters and how they interact with each other in their everyday life is amusing. Each character and their own little quirky personalities are rememberable despite having so many characters. It's what this makes this anime look forward to. The art direction from A-1 Pictures could not have been better as the character designs and scenery had little to none flaws at all. With Ono Daisuke, Kamiya Hiroshi and Fukuyama Jun singing karaoke at the end at each episode and the comedic relief this anime comes out with is relaxing. Overall, this anime is perfect if done with watching a favorite anime, having a bad day, or have an anime to watch on the weekend! Definitely recommend this anime to watch!\\n\\n\r\nRAW SCORE: 7.8/8.0\\n\\n\r\nOVERALL SCORE: 8.0/10.0",
            "date": "2016-08-28T03:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 227790,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006714.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/_LorDNiCo_",
                "username": "_LorDNiCo_"
            },
            "url": "https://myanimelist.net/reviews.php?id=227790"
        },
        {
            "content": "This season was just as good as the first one imho. \r\nI laughed at every episode.\r\nHighly recommended imo.\r\nStory: Received a 9 only because I was hoping for a bit more on the Inami/Takanashi relationship but only about an episode or two really looked back on it and gave it a bit more depth.\r\nCharacter: The other characters in the series got a bit more screen time with them not focusing so much on Inami/Takanashi. I did however enjoy that they got a bit more detailed with the Kyokuo/Tordoroki/Satou love triangle. The Popura jokes are always funny. I liked that Yamada got some more air-time and reallygot more in-depth with her as a character. Souma has always made me laugh with his blackmail towards others and I felt that was a bit more used in this season than in the first.\\n\\n\r\nEnjoyment: Like I said before, I laughed during every episode. This is by far my favorite anime series. I love the gags and they never get old. I laugh everytime.\\n\\n\r\nNot pointed out because I didn't feel the need: Art and Sound",
            "date": "2012-01-05T15:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 51011,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1048255.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Xatic",
                "username": "Xatic"
            },
            "url": "https://myanimelist.net/reviews.php?id=51011"
        },
        {
            "content": "I don't know why, I don't know how, but \"Working!!\" (or \"Wagnaria!!\") managed to reach the top of the podium and become my favorite anime. I was a mostly shonen watcher when my friend told me about this comedy/slice of life anime named \"Working!!\". Well, it seemed nice and I decided to watch it. For my and his surprise, I ended up liking it a lot, much more than him, who showed me the series.\r\nAlthough it has not one of the greatest plots ever (actually, doesn't even have a real, complex, totally continuous plot), the anime surprised me. As a seinen, it actually didn't haveanything bad related to blood or sexual themes, as anyone could expect. It's just an anime with a simple (but unusual) story, good gags and romantic moments. But that's what made it special: simple, but inovattive. \\n\\n\r\nIt was one of the first anime to portray a character who suffer from androphobia (fear of men), which generated good jokes and romantic expectations. It also has several unusual characters that combined make a 100% crazy environment. It explores themes such as bosses who gain money without working at all; a person who just cares about cute things and about girls under 12 years old; a guy that knows everything about everybody and uses their secrets to manipulate them... It's a wide variety of characters. \\n\\n\r\nThere are no villains, there is no big action... It's just a story that asks: what would happen if we picked up the strangest people in the world and put them all together working in a familiar restaurant? Well, it would certainly be less funny than this fictional story.\\n\\n\r\nAnd what made me like it even more was the expectative about the relationships between the characters. Will they be together at least? Will somebody discover that his friend is in love with him? With all those strange people, it's more complicated than you can possibly imagine. After two seasons of 13 episodes each and no question ever answered, I still hope for a season 3 coming soon!!!\\n\\n\r\nI didn't even gave the best rating possible because I know it wouldn't be fair, but, for some reason, I like it more than many other anime that I know that are better! (?!)",
            "date": "2012-10-23T19:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 75785,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1677101.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Longshooter",
                "username": "Longshooter"
            },
            "url": "https://myanimelist.net/reviews.php?id=75785"
        },
        {
            "content": "Wagnari just a normal family restaurant job with some normal short, sister, good looking chef, missing manager looking for his wife, and the schedule manger being op and having to be the manger. Its natural these things happen working at a family restaurant. \r\nThe show is funny and chill like a slice of life that isnt taking itself to serious. No i'm not saying its got gintama, belzebub, or tom and jerry humor like an endless vortex, but it makes you laugh some. This is not an amazing anime, but I wished the second season continued with the exact same characters as it would benice to see the story continued and the romances continued. That doesn't make it a bad show as it has you itching for more each episode. Like most shows like this (Hanada-kun, Katori-san, and other chill SOL anime) it has no story really early on and each episode you learn a few major things about a certain character and information comes about who they really are. \\n\\n\\n\r\nThis needs to  be continued but I will post this here for the time being",
            "date": "2018-03-31T22:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 276155,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tatakin",
                "username": "Tatakin"
            },
            "url": "https://myanimelist.net/reviews.php?id=276155"
        },
        {
            "content": "\"Arigatou Daisy-chan\"\r\nThe loveable incompetent idiots return for another excellent and hilarious season of Working'!!\r\nStory: 8/10\r\nWorking'!! starts immediately where the first season left off, and doesn't fail to make me laugh and enjoy their daily shenanigans once again. One downfall was that not much was improved from the last season as this was a direct continuation of the last season, but the comedy and SOL moments more than made up for it yet again. Since it's a slice of life (one of my favorite genres) you won't and shouldn't expect much of a plot going on anywhere, and that's the best part about the genre asa whole itself, you don't need to overburden yourself with thoughts of a plot, just enjoy. And Working brought me just that, a second time. \\n\\n\r\nArt: 9/10\\n\\n\r\nThe art was once again delightful to watch. This time though the characters were a little bit more zoomed in than before and was a positive change since it made them cuter and added more dynamic to the movements as well. Nothing new was added to stablise the change between season's and I think that's a good thing.\\n\\n\r\nSound: 8/10\\n\\n\r\nAdopting a similar OP and ED to the last season the enjoyment was once again retained (although we went from \"ONE ONE\" to \"PONPONPON\"). On the other hand the Seiyuus did a wonderful job and you'll be surprised who does their voices! Fukuyama Jun does Souta's voice and he does Lelouch as well, no explanation needed. I never thought he'd do comedy that well since it took me a long time to understand who this VA was when I saw Working. Saki Fujita (Hatsune Miku) was the voice of Inami and though her voice felt a little too much at times it was great in it's own way. Another notable VA was Hiroshi Kamiya who was the voice of the cunning Souma. Overall with a star studded cast they did an excellent job portraying the characters.\\n\\n\r\nCharacters: 8/10\\n\\n\r\nEven though it's a SOL there still wasn't much charm in the characters from last season, not to say they were bad but there wasn't any change from the last season at all. And I know I've repeated it again in my previous season's review, Inami was once again quite irritating, though a little less this time. There was a lot to love about the characters but one thing sealed this anime's fate with having one of my all-time favorite moments in anime. *SPOILERS IF YOU LIKE SATOU* His smile killed me. Literally. He rarely smiles and when he actually did man I fanboyed at that moment *END SPOILER IF YOU LIKE SATOU* Overall the cast was fun to watch and I got a lot of laughs this time, even more this time than the last.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThe Working!! series is one of those who always leave you with a smile, and that's how I felt about this season as well. Excellently done. I came for the comedy, and got a lot of good comedy out of it. Although the romance part was kinda less focussed on (from a romance fan's perspective)  I think it was for the better. Nonetheless, Working'!! has definitely set it's place as one of my top most entertaining series I ever watched.\\n\\n\r\nOverall: 8.4\\n\\n\r\nOverall, Working'!! continued a lot of elements from it's first season which meant that the good returned, as well as the few flaws. It had a star studded cast both on seiyuu and character levels and Satou once again set in stone his position as the best character of the anime. If you liked him in the first season, worry not, there's MORE of him here. Hope you enjoyed my review and hope you enjoy the anime too!\\n\\n\r\nP.S: Satou best husbando once again <3 He and Yachiyo are just perfect <3",
            "date": "2017-12-07T08:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 264699,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=264699"
        },
        {
            "content": "2011 Slice of Life Series\r\nCo-produced by A-1 Pictures and Aniplex\r\nLicensed by NIS America\r\nReview from my POV (w/personal biases)\r\n(Sp)oiler level: Medium (will take viewing S1 into account)\r\nPROS/What I liked:\r\n+ The background art got a noticeable face lift and the small faded coloring of the characters and lighting felt appealing. More fining detail was put into this show.\r\n+ There were a FEW moments here and there that gave me a genuine laugh with it's deeply present situational humor (The frailness of Izumi Takanashi was hilarious)\r\nCONS/What I loathe:\r\n- Again, no plot which isnt the problem. What is is that the arcs they show are kinda all over theplace.\\n\r\n- None of these characters grow like at all (no pun intended) and most of these characters become one note/flat (Sp) Taneshima is still too kawaii, Yachiyo is still a ditzy chick, and Kyoko won't stop with the parfaits.\\n\r\n- (Sp) Sato and Soma still dont get proper exposition.\\n\r\n- New characters are introduced and just add to the chaos\\n\r\n- (Sp) Takanashi's personality becomes a one note joke. We get it, our main character likes small things.\\n\r\n- Yamada, why do you exist? no exposition, annoying AF, and you take half the F*ckin screen time. It's like Mater from Cars 2 or Jar Jar from The Phantom Menace. So irrelevant.\\n\\n\r\nFinal Note:\\n\r\nHaving enjoyed the 1st season, I came into this show expecting more of the same with about the same amount of quality or even a little more...........but nah, it turns out to be the exact opposite.\\n\\n\r\nRecommends to:\\n\r\nPeople who deeply love the 1st season of this show",
            "date": "2013-06-01T11:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 99315,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1316105.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Cruzader93",
                "username": "Cruzader93"
            },
            "url": "https://myanimelist.net/reviews.php?id=99315"
        },
        {
            "content": "\"Try your very best to not write any spoilers.\"\r\nOddly enough, that seems not to be the case that often. I probably should state a good example right now but I came badly prepared so brain has to serve and rescue the review.\r\nAs you can guess from the synopsis already this second season of Working!! rotates around the same simple plot (slice of life at wagnaria's and the takanishi household) and still aims to just get you smiling rather than thingking. \r\nYou will get reunited with the same characters, which have still the same interesting starting position and they still won't solve anything. Sound and artaren't much unlike before (I seriously noticed no improvement/change) and the new support characters won't make a big deal either.\\n\\n\\n\r\nTo keep long stuff short and useful, the story is still dragging ever so slow and the jokes still come rarely, but aat least they still come. It's a solid anime if you need some entertainment and a smile but you probably end up sleeping and waiting for it to get finally good. Not happening in this season.^^",
            "date": "2015-11-24T21:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 204124,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987820.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Review_Reaper",
                "username": "Review_Reaper"
            },
            "url": "https://myanimelist.net/reviews.php?id=204124"
        },
        {
            "content": "Gorgeous anime characters very wonderful and her beautiful styles, characters speak beautifully and each character has a certain something wonderful is found in the context of this anime",
            "date": "2015-06-23T18:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 191074,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4600374.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/chitandaoreki505",
                "username": "chitandaoreki505"
            },
            "url": "https://myanimelist.net/reviews.php?id=191074"
        },
        {
            "content": "The story is still really simple. It doesn’t have a complicated storyline and there’s not even a plot. Though that is the case, it’s still not boring at all. In a way that is very admirable because I honestly think it is very hard to make a series interesting if the story is very simple. It is also a lot funnier. The gags and punch lines are a lot cleaner. There’s even a bit of drama as well and in fairness, it is nicely done.\r\nThough the storyline is very simple, it becomes interesting because of the characters. Well, that’s exactly what’s making the series interestingin the first place. All the characters are stranger and weirder than ever. Each has their unique antics that make them interesting and it is even more heightened now. Of course, like any other sequels there are new characters and even some recurring characters are tackled more. The unique yet nice relationship of the characters are a more featured in this sequel. They seem to be a lot closer. Friendship and particularly love are a lot more tackled this time which is no doubt making the series way more interesting. Some characters who were so oblivious of the feelings of others for them, are finally realizing it this time around little by little. And you could say there are huge character developments as well. Sometimes, when there are so many things happening around them, are they still able to work? And let me just mention that it is quite funny that the girl with glasses is only having some exposure during the last episode. All in all, everyone is still so much fun.\\n\\n\r\nIt is no doubt that there are lots of improvements to it but the most evident is the animation. Characters look a lot cuter and the animation looks a lot cleaner. It looks more sophisticated. Well, not that the previous one was less nicely done. I also like the opening theme. It is very cute and fun.\\n",
            "date": "2012-12-10T05:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 79802,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79802"
        },
        {
            "content": "Working’!! is exactly like Working!! but with an added apostrophe to confuse you. It has the same thirteen episode set up with the same characters, same restaurant, and same jokes. What I’m trying to get at is the fact that this review will be fairly tiny because there’s really not a lot that can be said about this second season of the series that I did not say in my previous review of Working!!.\r\nThe story is the same as before with Souta helping to cure Mahiru’s androphobia while working at a family restaurant operated by a big group of misfits. It runs in a somewhatepisodic way, with some overflow into the future episodes. That said, that’s about all I need to say. There is not a lot of story being dished out, or anything too complex anyway. Each episode ranges from fun and entertaining to boring and slow. These are especially prevalent around the points with Mahiru, who I complained about previously, and I shall complain about again. While I must commend the series for not making her the focal point and showcasing the others a lot more, she was still really prevalent and out of all the characters she is one of the worst. Thankfully, my prayers were answered and the cute romance between Jun and Yachiyo gets a lot more screen time and, while not going anywhere (just like every romance and major plot point of the series), still gives the characters added depth and a much more realistic feel than any of the others. The biggest plot aside from the androphobia concerns a guy looking for his sister. He’s not a particularly interesting or funny character, and this plot goes nowhere. Which is the problem with the series is that it just doesn’t develop. And there is a reason for this, that being Working!! is based on a comic strip which is the reason they use the same gags again and again and the characters never develop. So I guess I can be somewhat lenient based on that fact, but at the same time I feel that somebody should have taken the initiative and said something about tying up the romances or plots and at least ending the series with a bit of a bow on top. Instead it ends like any other episode and hopes I’ll return. Does this mean I can expect a season three called Working’,!! or is it just a tease like most anime endings? Time will tell I guess.\\n\\n\r\nThe animation is once again pretty unsubstantial. It’s good, but it’s not anything that will make you say “wow”. Character designs aren’t that fantastic and memorable.\\n\\n\r\nThe sound is okay. The theme song for this season is not as catchy as the previous one, and the ending isn’t as great either. The sound during the show fits perfectly fine.\\n\\n\r\nFor more on characters, please refer to my previous review. Which makes me sound lazy, but I’d feel lazier if I copy and pasted the exact words about each of the characters in this spot. Everyone is the same. There are no differences and no character development so you don’t have to worry about me saying anything. Once again, Maya Matsumoto, the self-proclaimed “Normal girl” returns with lines during the last episode, but remains a mute throughout, though can be seen in the background. She actually works with the crew in the last episode and seems to have some sort of relationship with all of them, but yet she is never used throughout to instill a sense of normality in the show. It doesn’t feel right for a character who has been there to magically have lines the last episode and become part of the plot. It’s like someone forgot about her up to that point and then quickly wrote her into the script.\\n\\n\r\nYeah, this review is very short by my standards, but it’s the best I can really do without copy and pasting my review of the previous season. If you liked Working!!, you’ll love this season. It’s not really an improvement, though the shift of focus from androphobia is a big part of what makes this season slightly better, but it is a good addition to the franchise. Will there be more episodes? Who knows. Will I welcome them? Sure I will, but I don’t know how willingly. While I enjoy the occasional comedy/slice of life adventure, there has to be some development and growth and Working’!! doesn’t provide either. As it progresses, it grows staler with the same brand of comedy and the same pointless romances that go in circles. It started off fun and felt like it may go somewhere and continue to entertain, but the problem is it starts to flatline. With the occasional good episode and the typical average ones, it never seems to find its stride and only occasionally makes a joke that is laugh-worthy, because all the others we have heard previously.\\n\\n\r\nOverall, Working’!! is a step in the right direction, but the entity taking that step is growing old and tired and needs to be rested before it can go any further. If there were to be a third season, there would have to be a sense of freshness that this anime rarely provides.",
            "date": "2015-05-22T11:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 188523,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188523"
        },
        {
            "content": "Continuing with the goings on at Wagnaria.\r\nThis actually an improvement from the first season mainly due to the better comedy timing. Inami punching Sota just didn't get old.\r\nWe're introduced to a few new characters:\r\nMahiru - Inami's dad and cause of her androphobia.\r\nHaruna - Hyogo's wife who appears from odd places.\r\nYohei and Mitsuki - the squabbling twins from the manager's old delinquent gang. Yohei some how gets engaged to Sota's sister Kozue.\r\nKirio - Aoi's brother who is looking for her.\r\nI think they can get a last season out of this so fingers crossed to tie up the stories.",
            "date": "2012-05-31T04:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 62331,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=62331"
        },
        {
            "content": "Note: This is one of my works from Sekijitsu\r\nArt\r\nThe character designs and even the backgrounds were nothing great but nothing bad as well though what really appeals in the art section is the facial expressions and reactions each character displays throughout the series which makes it not only fun but FUN-ny (ahaha…no.) as well. It’s these over expressive emotions the characters in Working’!! display that makes the comedy they execute more powerful and enjoyable to watch that you’ll eventually want more.\r\nMusic\r\nThough not as catchy as the first OP, the second OP still offered a great jolt of fluffy cuteness while accompanied by the OP sequences.I wasn’t that impressed with the ED overall and tend to skip it most of the time but it’s the OST’s/BGM’s/SFX’s – however you want to call it – that really made this show work. While the comedy was being executed, there’s always a brilliantly selected background music or sound affect accompanied with the comedy, making it more emotionally powerful and hilarious to witness with our own eyes and ears.\\n\\n\r\nStory\\n\\n\r\nWorking’!! never really had a plot nor a serious story but when it had to get serious, Working’!! executed them well. Examples are the ‘couples’ of Wagnaria’s moments throughout the series. Even so, Working’!! compensated its lack of story and plot with comedy skits and that itself offered us a story in itself. Only a few times I didn’t find certain jokes funny enough to giggle about or put on a smirk but most of the times I’ll be laughing at how well done the comedy is in Working’!! and also how they continue to offer a great flow between scenes. I guess it’s true that if you’ve got a bunch of comedy, people will easily ignore the lack of story behind it? Well the thing about Working’!! is that it never needed a story; it just needed jokes.\\n\\n\r\nCharacters\\n\\n\r\nWithout a great cast of characters how can a show work? But do not fear because Working’!! has one of the best cast of characters I’ve seen who individually offer their own little personality and interactions with each other which ends up into a gigantic comedy fest. There are only a few characters in the series I don’t really care about or didn’t think much for them but the main suspects at Wagnaria sure knows how to please new and old fans/viewers. Everyone’s different perspectives put together works so well and offer an infinite amount of ideas that can be used as great comedy which they have done already! And the brilliance of it all is that you find yourself liking nearly every character the show has to offer.\\n\\n\r\nOverall\\n\\n\r\nThe characters individual personalities accompanied by their own unique character designs and befittingly selected choices of background music and sound effects all come together and sync so well in executing the comedy in which Working’!! wanted to execute. It’s such a hilarious series full of hits and only a few misses but not everyone can think of such a great way in portraying each character through the use of comedy and/or romance. Definitely an enjoyable series and a show that will pull you into wanting more the more you watch.\\n\\n\r\nShould you watch it?\\n\\n\r\nDefinitely watch Working’!! but if you haven’t watched the first season I suggest you do so to get familiar with all the characters and trust me, season 1 is as enjoyable as season 2 so you won’t be disappointed if you do pick this show up. As a matter of fact I picked this show up recently and now I love it and I’m sure you’ll all love it too.",
            "date": "2012-02-29T12:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 55061,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/402368.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TofuZz",
                "username": "TofuZz"
            },
            "url": "https://myanimelist.net/reviews.php?id=55061"
        }
    ],
    [
        {
            "content": "Anime sometimes appeals to action, adventure and over-dramatic plots to keep people watching the series...after all anime series before it, very few revolved around real life and work places. Well, Working'!! is one of them, and though the story is mostly nonexistent, all the humor around the episodes will draw your attention to it. It's on the same base as the original Working!! anime, but with new characters and more of the anime restaurant we begin to love so much. \r\n--Story--\r\nHow everything begins, and why everything happens. (Skip if you already read synopsis)\r\nFollowing last season's end, Takanashi continues to work on Wagnaria with his fellowco-workers and bosses, dealing with his own family affairs meanwhile. Here, the relationship between co-workers goes slightly better, but just enough to not involve any serious romance affairs, but also to make new gags to crack a laugh from time to time.\\n\\n\r\n--Time exploitation--\\n\r\nSome animes makes time pass faster when watching them, and some do the opposite.\\n\\n\r\nOh, it's good. Believe me. As I said, it doesn't have a concrete story or goal to archieve on each episode, but even so, you'll get dragged in one of the many sub-plots, normally involving 2 characters, and you'll eventually worry about them, sympathize with them, or simply laugh as the situation gets incredibly awkward to one of them.\\n\\n\r\nEvery episode has about 3 \"semi-stories\" in it, so you'll never get stuck in something that doesn't go on or simply get the feeling nothing's really happening there.\\n\\n\r\n--Story and Characters Evolution--\\n\r\nStory (usually) grows as time passes, but how about the characters?\\n\\n\r\nHard to say, actually. Comparing to the last season, most people is basically the same, with their same strange habits and same unrequited loves. But, during the season, things change a little. Inami, as she gets better at controlling her androphobia, Takanashi begins to deal better with non-chibi woman, Yachiyo starts to get closer to Satou, and so on.\\n\\n\r\n--PERSONAL Opinion--\\n\r\nExactly what it means. What I think about the anime ^^\\n\\n\r\nSome people says watching an anime without a story is like reading a book about a normal old man: you get nothing out of it....well, half true...but does it really matter? Really? I watched this anime just a couple of months ago, and I laughed every 4 minutes of it, and just because of this little fact I became so addicted to Working. Indeed, most animes have their gag scenes and phrases, but on Working, it never gets old or repetitive, and even on apparently normal scenes, it throws something all of the sudden just to make you laugh.\\n\\n\r\nThe visuals are gorgeous as always, the soundtrack is pretty much the same, the new characters are just as complex and well balanced between crazy and realistic as the others, and of course, you'll have lots of fun watching the anime\\n\\n\r\n-- Score and Recommendation--\\n\r\nFinal score to me and to what people I would recommend.\\n\\n\r\n8,0/10\\n\\n\r\nIf you don't care about story and just want to go in to meet crazy characters and a little of their lives, welcome in. Otherwise, better go watch some other anime.",
            "date": "2012-03-02T20:17:00+00:00",
            "helpful_count": 53,
            "mal_id": 55219,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1081273.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Niokun",
                "username": "Niokun"
            },
            "url": "https://myanimelist.net/reviews.php?id=55219"
        },
        {
            "content": "!!This review includes the first season!!\r\nI′m not really that strict when it comes to anime with no 'goal' and story line. If it has a great art, music and set of characters - I′ll watch it. And of course, I need to rely on my enjoyment, if it′s not pleasing enough to make me smile, drop it. Working!! Is a really great and funny anime, with a simple sense of humor and jokes. At first, I wasn′t really paying any heed to Working!! because I thought this anime is just a mediocre and will be boring as hell - well I was totally wrong atall the points.\\n\\n\r\nTalk about story, this anime doesn′t really have what you would call a 'plot', neither does this story have a goal that they need to aim and complete at all costs. If you don′t like shows with no story and just full of gags, this isn′t for you. But hey, this one′s different - by different I mean really different. Truly, Slice of Life and Comedy mix is one the best combination of genres in a show.\\n\\n\r\nWhat about the characters?\\n\r\nThe characters in Working!! are all great, they have their own personalities that most probably suit their images and outer appearance really well; Working!! has a great mix and set of characters - Popura who is as cute as a hamster, Takanashi or Katanashi as referred to by Popura who is a lolicon — in which he is denying strongly by stating that he just likes cute things/kids. Yachiyo, a closed-eye character who is very naive and is in-love with the Manager, Kyoko, who is not really doing her job and is just eating all day. Satou, who is a blonde-haired handsome dude. Souma-san who has a radiant smiling face and Inami who has an androphobia - let′s say she′s a bit of a Tsundere and cute (but not as cute as Popura) but her androphobia sickness is pissing me off really really bad.\\n\\n\r\nThe characters are very like-able, though at some point, you may find of them as annoying and irritating, it can′t be helped since not all creations are perfect, and every person has something they will not like, based on their preferences.\\n\\n\r\nWhat I like about Working!! is its simpleness - the genres are balanced and distributed really well. The art is very simple and clean, along with the cute melodic intros and outros which are very catchy. I also like the comedic flashbacks with a mix of light drama in them; and the introductions of the new characters—who are only supporting—is also very much like-able. Because their intros have a mix of light seriousness and a touch of comedy.\\n\\n\r\nI really like comedies, especially when there are parodies involved, like in Gintama. Though the genre of Working!! doesn′t involve parody, it′s still very much funny, like so. Though if you′re a type of person who barely laughs, I doubt you′ll go along with the gags and jokes, if I do say so. Nevertheless, the slice of life share of genre, is also quite much on par with the comedy here — if there′s a slice-of-life type of scene in the anime, rest assured that there will be an incoming gag and comedic insert. The comedy and gags will never ever be missing.\\n\\n\r\nThe thing that I didn′t like about Working!! is its lack of story line, given that there isn′t one. It′s not that I really dislike it, the things is, I hoped for a more great development with the characters, along with their 'story'; And at some point, I also hoped for romance to bloom, given once again that there isn′t one. If there were a romance to bloom, I think that lots of people would really like this show more, as much as they like as it is now.\\n\\n\r\nAs far as you′re concerned, I really enjoyed watching Working!! despite the fact that it has no plot and goal involved, the substitute is your laugh and your smile. I′m really glad I didn′t follow others′ opinion to check out a new refreshing environment - which was Working!! If you′re hesitating to watch Working!! because of other people′s review, do not hesitate. Follow your own eyes and your own preference, who knows, you might get hooked on something you thought that wasn′t worth the time and effort. For me, it was totally worth it.",
            "date": "2013-03-30T02:12:00+00:00",
            "helpful_count": 25,
            "mal_id": 91581,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/334452.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hengao",
                "username": "Hengao"
            },
            "url": "https://myanimelist.net/reviews.php?id=91581"
        },
        {
            "content": "Working'!! is the second season of a great show, but this season in particular seems to only kick the can down the road.\r\nI like the concept that Working!! is using, however, the relationships and character development seem to be at near stand still. The season presents perfect opportunities for relationship advancements, but the characters are either simply too dense to notice what's happening or the writers are trying to delay an inevitable ending.\r\nCharacter 4/10\r\nI give such a low score because the character relationships do not advance very much. The biggest advancement so far is an exchange of text messages between Inami and Takashi. That's it.\r\nArt,Sound, Story 8/10\\n\r\nThese three are all the same as the previous season.\\n\\n\r\nEnjoyment 7/10\\n\r\nMy enjoyment could have been a lot better, but I found the inability to enhance relationships a very frustrating thing. The awkward moments would happen frequently, but nothing really happens after that. It's like the writers are walking away from something great and having to be replaced with mediocre crap.. The show must end some day, maybe not this season, but I hope it will end the way we all want it too.",
            "date": "2011-12-19T19:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 49611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=49611"
        },
        {
            "content": "Hummmmmmmm..........So far, as I've viewed the 5th episode of this sequel of the original anime, I'd say that it is still as funny as before. It still maintains a plotless comedy genre about a group of individuals working in a family restaurant called \"Wagnaria\" in the outskirts of Hokkaido, and as usual the main focus are wacky everyday things that happens in the family restaurant, so for the story since it isn't much I'll give it a \"Fair\" number 6.\r\nAs for the art...........well........I'd say a \"Mediocre\" number 5 will do, since it is still the same art being used from the original anime. Sound, oksince I like the opening theme a \"Fair\" number 6 would be fine.\\n\\n\r\nCharacters let check the usual:\\n\\n\r\nSouta Takanashi- Wagnaria's only male waiter, as usual, a nice guy who has a thing for cute little ladies (except for Aoi), as usual, has to deal with the following on the day to day basis; at home his dysfunctional elder sisters , at work aside from doing a good job he has to also deal with the following; Aoi's clumsiness and nosiness, staying a few feet away from Miharu and avoid getting into Jun, Yachiyo and Kyuko's bad sides, as usual. \\n\\n\r\nMiharu Inami - The only waitress who avoids getting close to males co'z she has a bad case of Androphobia and wouldn't hesitate to punch any guy who gets  close to her….. as usual. \\n\\n\r\nShirafuji, Kyouko - The restaurant’s manager who does nothing but order Yachiyo to make her parfait, loiter around the office and eat the restaurant’s food, the usual stuff - everybody avoids getting on her bad side as well. \\n\r\nSouma, Hiroomi- One of the restaurant’s chef with the usual nosy attitude. \\n\r\nTaneshima Popura – Still has the usual height issue, still a cute waitress in the same restaurant and still mistaken for a grade schooler.  \\n\r\nTodoroki, Yachiyo – Still welding her katana, still the only bisexual waitress in the restaurant with a thing for both Jun and Kyouko. \\n\r\nAoi Yamada – Ok she’s used to be a support character from season 1, now she’s promoted to be a main character , she’s the restaurant’s residence free loader, who only does menial chores and like Hiroomi she also has a nosy attitude. \\n\r\nJun Satou – The restaurant’s head chef, and as usual he’s the only character whom everybody respects, he can be a handful when he's pissed even for Kyouko.\\n\\n\r\nAs for the other support characters:\\n\\n\r\nOtoo Hyogo – The owner of Wagnaria the restaurant (I think) where everybody works and is still as wimpy as usual.\\n\\n\r\nTakanashi’s sisters:\\n\r\nIzumi, Kazue and Kozue – Well, as usual they’re the muchacho’s  (male lead Souta) troublesome trio who seems to give the latter a lot of headaches, except for  Nazuna the youngest who’s very helpful and understanding with the muchacho’s  predicament in their household. And they now have bigger roles in this 2nd season, mostly in the opening scene.\\n\\n\r\nAnd as for the other small support character:\\n\\n\r\nMashiba  Yohei, Mashiba Mitsuki and Matsumoto  Maya – Hummm, they’re merely what they were intended to be and that is to be supports for the season 2 of this anime, as for Matsumoto Maya, I think she has the potential to have a big role in this anime and I do mean a speaking role and not just limited to a cameo. Now, Otoo Haruna is yet to come out, how she fit in this anime is yet to be known. \\n\\n\r\nSince, it is the main characters that matters and they’re still there and still funny with the addition of the support characters, I guess a “Fair” number 5 will do.  \\n\\n\r\nEnjoyment and Overall: Good number 7.\\n\r\nWhat can I say, this sequel is good. However, I really do prefer Popura to be Souta’s love interest instead of Inami, then again, who am I kidding, this anime’s genre is comedy not romance. Just adding a little humor.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2011-11-07T01:04:00+00:00",
            "helpful_count": 16,
            "mal_id": 46999,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=46999"
        },
        {
            "content": "~ Never Change, Senpai! ~\r\nThe everyday antics and documentation of life at Wagnaria continue into this sequel installment to the first season of Working...\r\n----------\r\nIntroduction / Context...\r\n----------\r\nAs a direct continuation, \"Working'!!\" or \"Season 2\" as i will refer to it to avoid confusion, picks up where \"Working!!\" left off. The prior season of 13 relaxing episodes, was a \"minimalist-styled\" depiction of everyday life within our favourite family restaurant. It embraced its identity as a heavily slice of life oriented production, and so favored character development, over complicated plot development; hence the \"no story, no good\" argument used by those who generally dislike the SoL genre. Priorto Season 2, the \"Working\" franchise has indeed proven itself to be: \"escapism into an optimistic life perspective\" in my books; as you can read up in my corresponding review. And while being such a carefree and often comedic show, I've always felt that its emitted a unique, cosy, warm and \"family-like\" character chemistry, that's not only entertaining to observe, but sets the overriding tone beautifully. \"Working!!\" set the series up rather well by injecting a lot of personality into what has become a particularly memorable cast. It under-toned some dramatic situations, and conversely broke up any heaviness with plentiful laughs to stay true to its strengths. Most importantly, it allowed us to get a decent sense of each character's quirky personalities, and get to know them personally from the intimacy of their thought processes. Except one...\\n\\n\r\n----------\\n\r\nActual Review\\n\r\n----------\\n\r\nAoi Yamada, has always seemed a little distanced from the rest of the cast as viewers of the prior season should be familiar; given her rather mysterious and late appearance.\\n\r\nThere's only so much you can do with 13 episodes, and while I maintain that the \"Working\" series is a well crafted one, the development of this purple-haired, \"Otoo-crazed\"\\n\r\nemployee is perhaps the single hole in the prior season's development; given the required comprehensiveness of the character development, contrasting with the seemingly non-existent story line. Interestingly enough, I initially failed to pick up on the fact that this was indeed a hole, and i'm sure i'm not alone in this, but the awesome people at Aniplex blessed us\\n\r\nwith a second season anyway...\\n\\n\r\nFar from \"improving\", Season 2 fills the hole of Yamada's development with ease, and then quickly goes above and beyond the call of duty to further almost every aspect of the show.\\n\r\nSeason 2 is essentially the refinement: an advancement of the prior, that goes to the lengths of polishing up and adding to already near-faultless piece of work - in regards to the way the franchise \"intends\" to be received.\\n\\n\r\nFirst and foremost, allow me to put fans at ease by mentioning that this sequel season retains the entirety of the signature \"Working!!\" charm of the prior. Unlike some other anime franchises, it hasn't tried to change itself in order to appeal to a new audience, and instead has stayed loyal to its methods, therefore its branding. It's still casually presented, and down-to-earth with none other than an \"everyday\" plot to keep up the relatability aspect. It still brings forth a lot of depth when it comes to expanding on the personalities of the characters; and so it continues to give the viewer an intimate insight into the working lives of the people who make up Wagnaria. It still documents the subtle growth of the characters, as they surpass (or not) an array of appropriately plausible plights, which is sure to withhold the realism of the show, and in turn keep the audience connected; losing themselves in the vivid picture of the family restaurant \"painted\" in front.\\n\\n\r\nAs I mentioned, Yamada's presence becomes more prominent in Season 2, and we learn more not only about her, but the rest of the cast through the mysteries her background proposes as well; a sort of ongoing development \"arc\" if you will. Nevertheless, she is no longer a stranger come Season 2, and so it's great that the character development of the original cast reaches a point of complete coverage during these 13 additional episodes.\\n\\n\r\nAniplex could have stopped there, and had the show come to summit of its success, a flat line from which it can only fall. Fortunately they persisted though in adding new content...\\n\\n\r\nSeason 2 brings about some new faces: from the bizarre antics of the Mashiba siblings, to a long lost relative of Yamada. There's evidently never a dull moment in Wagnaria, which in my opinion is the reason for its success. It refuses to be \"the lake that dries up\", and instead retains the refreshing vibe it started out with; never running out of new revelations, and instead having our admiration of the cast mature, as opposed to stagnate...\\n\\n\r\nThere's more \"maturing\" than you would think going on in the \"Staff-only\" area, as Season 2 brings about: new challenges to test the resolve of Inami. New things for Yamada to help fix. New heights for our \"Senpai\" to reach, and even fears for Takanashi to overcome. Everywhere... The awkward relationships are maturing (with no help from Souma), and Kyouko is hungrier than ever. So yes, life at Wagnaria continues to blossom seamlessly following the previous season, and progress steadily as if the \" \" to \" ' \" transition never occurred. \\n\\n\r\nSeason 2 also seems to work on controlling the visuals better...\\n\r\ncapping the expressive cliche/abstract/chibi presentation, if not just a bit: to make the emotive and comedy scenes more punchy, which in turn had me laughing considerably more.\\n\r\nNo longer does Aniplex accompany every emotion with \"frustration lines\", like in the first season it fortunately seems.\\n\\n\r\nSome drama, a healthy helping of comedy, and a tonne of character-based charm...\\n\r\nWhich is confirmed to be leading towards a third installment, and so I won't criticize the extremely late formal introduction of Mayu as of yet... \\n\\n\r\nAudiovisuals?\\n\r\nThese are for the most part: the same, high, colourful and uplifting standards, as can be seen in the original season. We get a new OP (which i love), and a new ED (which is also very appropriate), the show is throughout still accompanied by a carefree piano-based score...\\n\\n\r\nDownsides?\\n\r\nAsides from the limiting factors of the \"everyday\" premise and branding, from a technical perspective (at least in my mind): I don't see anything fundamentally wrong about this follow up season. It is therefore, ultimately, a straight-up elaboration/advancement to the \"Working!!\" of which you're familiar, and so i have no doubt that fans of the franchise will enjoy...\\n\\n\r\n~ Yama-Dash! ~",
            "date": "2015-05-28T15:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 189044,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=189044"
        },
        {
            "content": "[This is a review from the perspective of someone that didn't watch the first season. Might contain some generalized spoilers]\r\nIronically, everything that I was looking forward to this fall season turned out to be absolutely mediocre, and everything I didn't care for turned out to be pretty decent. Knowing this, I picked up Working'!! without watching the previous season, and surprisingly, it wasn't difficult to quickly get accustomed to the characters. \r\nFrom what I've noticed, several factors make Working'!! a “good” anime; however,  a few others hinder it from becoming a “great” anime. Working'!! has a cast of great characters, although they're not themost original and developed; they all remain easily likable. Now, as opposed to many other slice-of-life's; relationships between the characters tend to stay almost completely static, with a few smaller developments towards the end. This normally wouldn't be a “bad” thing in a slice-of-life, but it's disappointing to see the possible “romances” at a halt,  especially when there's so much chemistry going on  between the characters. \\n\\n\r\nBut what else makes Working'!! a “good” anime? The centerpiece in the anime besides the slice-of-life aspect is the comedy. Now how is the comedy dealt with? It's actually dealt with in a rather unusual way. In comparison to other anime such as Seitokai Yakuindomo and Haganai where the basis of the majority of the jokes are vulgar, the jokes in Working'!! actually incorporate a different feel. The jokes aren't really offensive, which opens the show to a much broader audience. \\n\\n\r\nNow, the greatest factor that sets Working'!! apart from many other comedy anime, is the lack of ecchi. Nowadays, obnoxious fan service and ecchi basically go hand in hand in comedy anime, it's somewhat disappointing. But Working'!! is basically void of all the irritating aspects of it. It's a rarity, and it should be appreciated. \\n\\n\r\nObjective Rating: 6/10. It's a good comedy anime. It's episodic, you could easily pick up the anime on episode eight, as easily as you could on episode one. It's constantly enjoyable, but there aren't any episodes that leave you breathless, it's constantly good, but it's never extraordinary, or great. It leaves you in a good mood after watching it most of the time.\\n\\n\r\nSubjective Rating: 7/10: It's a really enjoyable watch. The characters create a familial atmosphere, and it's hard to not keep a smile while watching it.",
            "date": "2011-12-24T10:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 50015,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/525509.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mdz",
                "username": "mdz"
            },
            "url": "https://myanimelist.net/reviews.php?id=50015"
        },
        {
            "content": "Recipe: \r\n6 Main characters\r\nA variety of side characters (add at own discretion)\r\n1 Relatively simple Slice of Life plot\r\n1 Modern Day restaurant setting\r\nA dash of comedy\r\nthrow them in a bowl, stir thoroughly, and your reward is Working!!. If your working comes attached with a ' at the end, don't worry it tastes exactly the same as a regular Working!! \r\nYes and here we are, with the second installment of that little series Working!!. The original was a quaint little show with a nice set of characters, a decent little story and while a little bit forgettable, it was overall a well put together show. So howdoes the sequel hold up when compared to its originals fairly rooted stand? Well lets dive in and talk a look.\\n\\n\r\nAs you could probably tell by that short little opening recipe there... Working'!! is very similar to Working!!. In fact it really just feels like the first season was meant to be 26 episodes but they weren't entirely sure how well it would sell, so they edited half of them out and saved them for a later day. Why they decided to call it Working with an apostrophe is a bit of a strange choice to me. I get the feeling they didn't just want to stick a number after it so they thought they'd be clever and put an apostrophe there to screw with people that have bad short range vision. Personally I would have called it something like Working: Some More, or Working: Another One... but maybe that wouldn't translate so well to Japanese. Anyways... while similar to the original, that isn't entirely a bad thing, as I've said the original was a decent little show, a fun little romp through the lives of a couple interesting characters. \\n\\n\r\nRight away you'll be hit with a sense of familiarity when the opening starts to play, as the similarity between the two is just enormous. The characters all return, the jokes are similar the location is all similar, and the art style is identical. Since I doubt you're using this season as the jumping on point for this series, you can basically use your own judgement of the first season as your basic analysis for this one. The characters are still the same, while not entirely deep or moving they each have their own quirks and traits that make them likeable. The plot isn't entirely there but it works in its slice of lifey sort of way, with small little dilemmas that get resolved over each episode. Your bound to get at least a few laughs from an episode and the art and music still both look and sound very nice, and keep the atmosphere of the whole series very in tune with what its going for. \\n\\n\r\nSo O.K, so far all I've done is say how similar it is to the original, what does it do thats different? Well... to tell the truth not a whole lot, but there are a few things. For starters, a few new minor characters get added who help liven up an already interesting cast. Also, old characters who didn't get a whole lot of screen time in the previous segment get a bit more of a chance to shine, such as that one older sister who always hides in her room, or a more touching side of the Manager. Also, once again being a new season, the show likes to experiment a bit with its characters, mostly by pitting characters who don't normally associate with or against each other. Stuff like Soma talking more with Inami, Inami talking with the author older sister, Takenashi and the manager etc etc. But aside from that, its still very much the same show, and this is where I start to find my problem with this little sequel. \\n\\n\r\nWhile each episode is pretty nice, and overall the series is an enjoyable little series, I really think it has no right to exist. Ok hear me out first. For starters, it really is just more of working S1. I keep going back to that I know, but there really isn't much else to say about it, it is very similar to the original. \\n\\n\r\nBut that alone is not enough to condemn it, if the show took the opportunity to help expand its characters or its plot in some sort of way, then I feel this series would have been worth it. And it does... sort of. Like I said a few minor characters get a bit more drawn out, so that we can relate to them a bit more and feel like they are decent characters. But here's the real problem. NOTHING. GETS. RESOLVED. AT ALL. Every single episode from start to finish goes waaayyy out of its way to make sure everything returns to the status quo by the end of the episode. The only things I can say with confidence change over the course of this season, is one girl gets a bear, one gets  a cell phone, and one gets a cell phone number... whoop dee doo. And I mean, sure. Every episode one character learns a bit of a lesson, but they never really go back to it. You come back to the next episode and Inami is still throwing punches, popura is still a child at heart, sato still has a crush on todoriki who still has the hots for the manager etc etc. At the end of the season, absolutely nothing important will have changed from the originals finale. \\n\\n\r\nEven the first season had a bit of a flow to it. It was mostly keeping a tab on Inami, and her overcoming her crippling man-phobia. And while it didn't go very far in curing it over the first season, it still ended with you feeling like they had come at least some way forward in the process. In Working'!!, one could almost argue that Inami regresses a little, possibly even putting back what the first season tried to achieve. So really, the fact that so little happened in the grand scheme of the Working!! series as a whole, really makes me feel like this season has absolutely no point.\\n\\n\r\nBut overall... I can't call it a bad series because of that complaint alone. Overall, its just more of Working!! S1. If you liked the first season there's no reason you aren't going to like this one. You might like it a little bit more even if you prefer this seasons comedy, or maybe like the different takes on a few of the characters. I still enjoyed the jokes, it was kinda nice to see the characters once again, and it was good enough that I was easily able to watch it until the end. But I will say this: Anime as a whole would have lost absolutely nothing had this series never been made. Its a fun, but ultimately pointless little romp, like getting a high score on tetris.",
            "date": "2012-01-14T02:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 51779,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/312392.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/leingodf8",
                "username": "leingodf8"
            },
            "url": "https://myanimelist.net/reviews.php?id=51779"
        },
        {
            "content": "This will get my typical second season review, which means that most of what I say will be found in my Season 1 review.\r\nAnother season of Wagnaria's crazy antics, gone by. Wagnaria Season 2 went in nice and quiet, then proceeded to get to the levels of craziness we're all used to.\r\nStory: The story is the same as the original, although with a few extra characters being in the story more. Now instead of just the regular day at Wagnaria, you also follow others, like Yamada's brother and Otoo's wife. Overall, story's not changed, but a few extra gimmicks help keep it interesting.\r\nArt: Updated withnew visual standards, Wagnaria looks better than ever. Brighter colours, more fluid animation, etc. Overall, everything looks much nicer.\\n\\n\r\nSound: Voice acting is still amazing, and the show is now rocking a new opening and ending. The opening feels a bit strange with the intro, but I grew to like it. As always, the opening's animation fits well with the opening, and still pays homage to the original. The ending also works really well, and got me asking myself how Japanese Disco actually would sound.\\n\\n\r\nCharacter: Characters are all still charming, and some extra information is thrown at you allowing for more character development. You now learn about the side characters more in depth. The only thing that I wanted was for the characters to resolve their problems in terms of \"what they're looking for\", but that's what season 3 is for. \\n\\n\r\nEnjoyment: I found this season to be even more enjoyable than season 1, which is always a good sign. \\n\\n\r\nOverall: This season was solid, overall, improving on most categories while never lowering standards. It's actually gotten me excited for Season 3, which I started the same day I'm writing this. If you've been putting off Wagnaria, my only question to you is this: Why?\\n",
            "date": "2018-02-27T18:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 272621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5869540.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rabb2t",
                "username": "Rabb2t"
            },
            "url": "https://myanimelist.net/reviews.php?id=272621"
        },
        {
            "content": "REVIEW: Working'!! (Season two)\r\n\"This is season two of the series by the way. If you want to read it anyway, go on ahead! Spoilers! If you want to read my review on the first season however, the review will be right down below!\"\r\nStory (5/10): Without a resolve with Inami's androphobia, without a surprise is that the unresolved fear of Inami's androphobia is going to continue on within the second season. To mention Ooto's search of his lost wife, Satou and Todoroki's relationship and Yamada's relationship with her family has yet to be solved. What I found disappointing however is that the plot that was worthyof following of was the main characters, mostly Takanshi's resolve to cure of Inami's androphobia. \\n\\n\r\nPersonal rant: Honestly, the plot is bland but the characters help make up for it. If there was a decent plot to follow, surely it would be more entertaining to watch. It is entertaining as it is! But, can't help feel there should be a decent plot to it. For example, an intricate love triangle. Not the one between Satou, Todoroki, and Kyouko. But between Takanshi, Inami, and Taneshima. Not saying this is a good idea considering this is not intended to be a romance series. But, it would be certainly be entertaining to see a sort of development happening. Something of that sort. But, without any intricate plots, it's entertaining either way. It's what makes this anime unique.\\n\\n\r\nArt (10/10): One year had passed since the first season had aired and compared to the art from last season, this season took it up-a-notch! The characters were polished, more detailed than last season. That can be said with the scenery as well! Also, A-1 Pictures again took the time and effort to make another striking and marvelous opening theme! The most rememberable part when it comes to the opening themes is that they never fail to add are the female characters chibi's version of themselves which can be found in the middle of the opening which are just adorable! Not to mention, loved how the ending theme was made which was made with the use of juxtaposition for the most part. Which near the end of the ending theme, Yamada and Souma can be seen playing the tambourine quite hilariously behind Takanashi back in the background. Without a doubt, A-1 Pictures couldn't not have done any better in the art direction in this anime! No complaints here!\\n\\n\r\nSound (10/10): Compared to last season's soundtrack, this season was even better. To mention, that the opening theme was catchier and same goes with the ending theme of this season. Once again, the ending theme was sung by the Fukumaya Jun, Kamiya Hiroshi, and Ono Daisuke. What a blessing to hear them singing once again! Also, the 'seiyuus' once again did an excellent job of voicing their characters roles! Especially when it came down to Yamada this time! Her voice defined her character and not to mention was adorably cute! \\n\\n\r\nCharacter (10/10): The characters definitely livened up the expectations of the series! When it comes to most anime in general, with the addition of adding more supporting characters, all it does just makes it a nuisance. With this series however, with the addition of new characters just made the series even livelier! The character that left a remarkable impression this season was Yamada! She definitely stole the spotlight when it came down to how she interacted with each character! Each interaction was hilarious to watch! Also, can't forget to mention the Takanashi family as well! Each member in Takanashi's family is so intriguing to learn about that there should be a separate series for them alone! Even though they are the supporting characters, they definitely deserve more screen-time! What was disappointing however is that with the introduction of Matsumoto Maya last season was not properly built up this season. She is always seen in jump-cut scenes and until the last episode. It felt unfair to the character not giving appropriate amount of screen time to build up her character. It would've been interesting to see her character more! What I also found disappointing is the relationship between Taneshima and Takanashi's. It would be cute to see them for their relationship to be deepened together. But, to be stolen by Inami which I don't find bothersome at all. Lastly, what I found interesting is that that some of the character's relationship seem to deepens as this series goes by. And, Takanashi and Todoraki who are unaware of love gave out clues and hints of 'romantic feelings'. Despite this series being involving romance, it interesting to see the development of the character's relationship with others.\\n\\n\r\nEnjoyment (8/10): Cannot say that it wasn't enjoyable because that would be a straight-up lie. It was amusing to see every antic the characters had to make! Cried out tears of laughter every now and then simply because this anime is hilarious to watch! Season two, in my opinion, was better than last season! \\n\\n\r\nOverall: (8/10): Season three will definitely be on the look out since it might as well be the conclusion of the series! But without a doubt, this has been quite a ride so far! Can say that this is one of best or the best 4-koma manga anime adaptions up to date! Entertaining and contagious to watch! Can't live without season two, watch it!\\n\\n\r\nRAW SCORE: 8.3/10\\n\\n\r\nOVERALL SCORE: 8/10\\n\\n\\n\r\nReview: Working!! (Season one)\\n\\n\r\n\"Why is this rated a 7.82!? This anime is great!\"\\n\\n\r\nStory (7/10): Concerning of plot, the story has no framework. The anime just revolves many main characters and involves their everyday lives of 'working' in a restaurant. Besides that point, each of their personalities pale in comparison from each other. As a result their personalities mix in oddly well making their everyday lives pleasantly humorous to watch. If there was a framework to follow on however, it isn't until one of the the main character steps into play. Her androphobia, and the cause behind it. Androphobia is the fear of men and the fact of the matter is, she has to constantly have to deal with it with everyday life. Despite her fear of men, she works at Wagnaria where it is inevitable where there may be men at. With the help of main characters however, they push her to get over her fear of androphobia. Through hilarious trials and consequences, the main characters help her inch away out of her fear of men. Even though there may be a little to no plot, the anime is enjoyable to watch nevertheless. \\n\\n\r\nArt (8/10): Like the name clearly states, A-1 Pictures. Nothing is better than A-1 really. The art direction for the opening theme coming into this anime is eye-catching and amusing to see. That can be said with the ending theme following of the anime. To mention, A-1 did a excellent job in catching every detail that it had to offer to the character designs to the scenery. With this particular anime being the based on a 4-koma manga, the animation is grand and the manga pales in comparison. That's all I have to say!\\n\\n\r\nSound (9/10): Ono Daisuke, Kamiya Hiroshi, and Fukuyama Jun are all in one place as they voice all the male main characters in the series. With that being the case, it is particularly interesting to hear their voices. Since they are known voicing many characters from all different series people all know and love. I can quite say all the voice actors did their voice roles well. Especially, when it came to one of the main heroines, Taneshima. To mention, her voice is irresistibly cute. For the music however, the opening coming into this can compare to opening themes such as Baka to Test to Shoukanjuu and Nicjijou. Catchy and up-lifting. For the the ending theme however, the ending theme is soothingly jazzy hearing all the male 'seiyuu' mentioned above sing the ending theme at each episode which was a highlight of this anime. The music was one of its strong points as it created a 'fun atmosphere' for this anime to watch.\\n\\n\r\nCharacter (9/10): The character lineup was definitely bizarre and large in comparison to some anime. Not to mention that one character looked like Sanji out of One Piece. It refreshing to see some characters were not being used out of the anime trope. However, there were a few characters that used the anime trope, but weren't overused to the point it became a nuisance. They were original as each of them had a quirk or trademark to remember them by. The large lineup and the liveliness of the characters is also one of its strong points making the anime enjoyable to watch.\\n\\n\r\nEnjoyment: (7/10): Managed to binge-watch this anime throughout one go. It's easy and fun to watch since it's a refreshing anime to watch. There wasn't a boring moment when it came to this anime. Definitely humorous and laughed out loud. \\n\\n\r\nOVERALL: (8/10): Season two will be on a look out since this was a refreshing anime to watch. Despite the story, the characters and how they interact with each other in their everyday life is amusing. Each character and their own little quirky personalities are rememberable despite having so many characters. It's what this makes this anime look forward to. The art direction from A-1 Pictures could not have been better as the character designs and scenery had little to none flaws at all. With Ono Daisuke, Kamiya Hiroshi and Fukuyama Jun singing karaoke at the end at each episode and the comedic relief this anime comes out with is relaxing. Overall, this anime is perfect if done with watching a favorite anime, having a bad day, or have an anime to watch on the weekend! Definitely recommend this anime to watch!\\n\\n\r\nRAW SCORE: 7.8/8.0\\n\\n\r\nOVERALL SCORE: 8.0/10.0",
            "date": "2016-08-28T03:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 227790,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006714.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/_LorDNiCo_",
                "username": "_LorDNiCo_"
            },
            "url": "https://myanimelist.net/reviews.php?id=227790"
        },
        {
            "content": "This season was just as good as the first one imho. \r\nI laughed at every episode.\r\nHighly recommended imo.\r\nStory: Received a 9 only because I was hoping for a bit more on the Inami/Takanashi relationship but only about an episode or two really looked back on it and gave it a bit more depth.\r\nCharacter: The other characters in the series got a bit more screen time with them not focusing so much on Inami/Takanashi. I did however enjoy that they got a bit more detailed with the Kyokuo/Tordoroki/Satou love triangle. The Popura jokes are always funny. I liked that Yamada got some more air-time and reallygot more in-depth with her as a character. Souma has always made me laugh with his blackmail towards others and I felt that was a bit more used in this season than in the first.\\n\\n\r\nEnjoyment: Like I said before, I laughed during every episode. This is by far my favorite anime series. I love the gags and they never get old. I laugh everytime.\\n\\n\r\nNot pointed out because I didn't feel the need: Art and Sound",
            "date": "2012-01-05T15:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 51011,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1048255.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Xatic",
                "username": "Xatic"
            },
            "url": "https://myanimelist.net/reviews.php?id=51011"
        },
        {
            "content": "I don't know why, I don't know how, but \"Working!!\" (or \"Wagnaria!!\") managed to reach the top of the podium and become my favorite anime. I was a mostly shonen watcher when my friend told me about this comedy/slice of life anime named \"Working!!\". Well, it seemed nice and I decided to watch it. For my and his surprise, I ended up liking it a lot, much more than him, who showed me the series.\r\nAlthough it has not one of the greatest plots ever (actually, doesn't even have a real, complex, totally continuous plot), the anime surprised me. As a seinen, it actually didn't haveanything bad related to blood or sexual themes, as anyone could expect. It's just an anime with a simple (but unusual) story, good gags and romantic moments. But that's what made it special: simple, but inovattive. \\n\\n\r\nIt was one of the first anime to portray a character who suffer from androphobia (fear of men), which generated good jokes and romantic expectations. It also has several unusual characters that combined make a 100% crazy environment. It explores themes such as bosses who gain money without working at all; a person who just cares about cute things and about girls under 12 years old; a guy that knows everything about everybody and uses their secrets to manipulate them... It's a wide variety of characters. \\n\\n\r\nThere are no villains, there is no big action... It's just a story that asks: what would happen if we picked up the strangest people in the world and put them all together working in a familiar restaurant? Well, it would certainly be less funny than this fictional story.\\n\\n\r\nAnd what made me like it even more was the expectative about the relationships between the characters. Will they be together at least? Will somebody discover that his friend is in love with him? With all those strange people, it's more complicated than you can possibly imagine. After two seasons of 13 episodes each and no question ever answered, I still hope for a season 3 coming soon!!!\\n\\n\r\nI didn't even gave the best rating possible because I know it wouldn't be fair, but, for some reason, I like it more than many other anime that I know that are better! (?!)",
            "date": "2012-10-23T19:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 75785,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1677101.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Longshooter",
                "username": "Longshooter"
            },
            "url": "https://myanimelist.net/reviews.php?id=75785"
        },
        {
            "content": "Wagnari just a normal family restaurant job with some normal short, sister, good looking chef, missing manager looking for his wife, and the schedule manger being op and having to be the manger. Its natural these things happen working at a family restaurant. \r\nThe show is funny and chill like a slice of life that isnt taking itself to serious. No i'm not saying its got gintama, belzebub, or tom and jerry humor like an endless vortex, but it makes you laugh some. This is not an amazing anime, but I wished the second season continued with the exact same characters as it would benice to see the story continued and the romances continued. That doesn't make it a bad show as it has you itching for more each episode. Like most shows like this (Hanada-kun, Katori-san, and other chill SOL anime) it has no story really early on and each episode you learn a few major things about a certain character and information comes about who they really are. \\n\\n\\n\r\nThis needs to  be continued but I will post this here for the time being",
            "date": "2018-03-31T22:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 276155,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tatakin",
                "username": "Tatakin"
            },
            "url": "https://myanimelist.net/reviews.php?id=276155"
        },
        {
            "content": "\"Arigatou Daisy-chan\"\r\nThe loveable incompetent idiots return for another excellent and hilarious season of Working'!!\r\nStory: 8/10\r\nWorking'!! starts immediately where the first season left off, and doesn't fail to make me laugh and enjoy their daily shenanigans once again. One downfall was that not much was improved from the last season as this was a direct continuation of the last season, but the comedy and SOL moments more than made up for it yet again. Since it's a slice of life (one of my favorite genres) you won't and shouldn't expect much of a plot going on anywhere, and that's the best part about the genre asa whole itself, you don't need to overburden yourself with thoughts of a plot, just enjoy. And Working brought me just that, a second time. \\n\\n\r\nArt: 9/10\\n\\n\r\nThe art was once again delightful to watch. This time though the characters were a little bit more zoomed in than before and was a positive change since it made them cuter and added more dynamic to the movements as well. Nothing new was added to stablise the change between season's and I think that's a good thing.\\n\\n\r\nSound: 8/10\\n\\n\r\nAdopting a similar OP and ED to the last season the enjoyment was once again retained (although we went from \"ONE ONE\" to \"PONPONPON\"). On the other hand the Seiyuus did a wonderful job and you'll be surprised who does their voices! Fukuyama Jun does Souta's voice and he does Lelouch as well, no explanation needed. I never thought he'd do comedy that well since it took me a long time to understand who this VA was when I saw Working. Saki Fujita (Hatsune Miku) was the voice of Inami and though her voice felt a little too much at times it was great in it's own way. Another notable VA was Hiroshi Kamiya who was the voice of the cunning Souma. Overall with a star studded cast they did an excellent job portraying the characters.\\n\\n\r\nCharacters: 8/10\\n\\n\r\nEven though it's a SOL there still wasn't much charm in the characters from last season, not to say they were bad but there wasn't any change from the last season at all. And I know I've repeated it again in my previous season's review, Inami was once again quite irritating, though a little less this time. There was a lot to love about the characters but one thing sealed this anime's fate with having one of my all-time favorite moments in anime. *SPOILERS IF YOU LIKE SATOU* His smile killed me. Literally. He rarely smiles and when he actually did man I fanboyed at that moment *END SPOILER IF YOU LIKE SATOU* Overall the cast was fun to watch and I got a lot of laughs this time, even more this time than the last.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThe Working!! series is one of those who always leave you with a smile, and that's how I felt about this season as well. Excellently done. I came for the comedy, and got a lot of good comedy out of it. Although the romance part was kinda less focussed on (from a romance fan's perspective)  I think it was for the better. Nonetheless, Working'!! has definitely set it's place as one of my top most entertaining series I ever watched.\\n\\n\r\nOverall: 8.4\\n\\n\r\nOverall, Working'!! continued a lot of elements from it's first season which meant that the good returned, as well as the few flaws. It had a star studded cast both on seiyuu and character levels and Satou once again set in stone his position as the best character of the anime. If you liked him in the first season, worry not, there's MORE of him here. Hope you enjoyed my review and hope you enjoy the anime too!\\n\\n\r\nP.S: Satou best husbando once again <3 He and Yachiyo are just perfect <3",
            "date": "2017-12-07T08:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 264699,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=264699"
        },
        {
            "content": "2011 Slice of Life Series\r\nCo-produced by A-1 Pictures and Aniplex\r\nLicensed by NIS America\r\nReview from my POV (w/personal biases)\r\n(Sp)oiler level: Medium (will take viewing S1 into account)\r\nPROS/What I liked:\r\n+ The background art got a noticeable face lift and the small faded coloring of the characters and lighting felt appealing. More fining detail was put into this show.\r\n+ There were a FEW moments here and there that gave me a genuine laugh with it's deeply present situational humor (The frailness of Izumi Takanashi was hilarious)\r\nCONS/What I loathe:\r\n- Again, no plot which isnt the problem. What is is that the arcs they show are kinda all over theplace.\\n\r\n- None of these characters grow like at all (no pun intended) and most of these characters become one note/flat (Sp) Taneshima is still too kawaii, Yachiyo is still a ditzy chick, and Kyoko won't stop with the parfaits.\\n\r\n- (Sp) Sato and Soma still dont get proper exposition.\\n\r\n- New characters are introduced and just add to the chaos\\n\r\n- (Sp) Takanashi's personality becomes a one note joke. We get it, our main character likes small things.\\n\r\n- Yamada, why do you exist? no exposition, annoying AF, and you take half the F*ckin screen time. It's like Mater from Cars 2 or Jar Jar from The Phantom Menace. So irrelevant.\\n\\n\r\nFinal Note:\\n\r\nHaving enjoyed the 1st season, I came into this show expecting more of the same with about the same amount of quality or even a little more...........but nah, it turns out to be the exact opposite.\\n\\n\r\nRecommends to:\\n\r\nPeople who deeply love the 1st season of this show",
            "date": "2013-06-01T11:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 99315,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1316105.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Cruzader93",
                "username": "Cruzader93"
            },
            "url": "https://myanimelist.net/reviews.php?id=99315"
        },
        {
            "content": "\"Try your very best to not write any spoilers.\"\r\nOddly enough, that seems not to be the case that often. I probably should state a good example right now but I came badly prepared so brain has to serve and rescue the review.\r\nAs you can guess from the synopsis already this second season of Working!! rotates around the same simple plot (slice of life at wagnaria's and the takanishi household) and still aims to just get you smiling rather than thingking. \r\nYou will get reunited with the same characters, which have still the same interesting starting position and they still won't solve anything. Sound and artaren't much unlike before (I seriously noticed no improvement/change) and the new support characters won't make a big deal either.\\n\\n\\n\r\nTo keep long stuff short and useful, the story is still dragging ever so slow and the jokes still come rarely, but aat least they still come. It's a solid anime if you need some entertainment and a smile but you probably end up sleeping and waiting for it to get finally good. Not happening in this season.^^",
            "date": "2015-11-24T21:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 204124,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987820.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Review_Reaper",
                "username": "Review_Reaper"
            },
            "url": "https://myanimelist.net/reviews.php?id=204124"
        },
        {
            "content": "Gorgeous anime characters very wonderful and her beautiful styles, characters speak beautifully and each character has a certain something wonderful is found in the context of this anime",
            "date": "2015-06-23T18:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 191074,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4600374.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/chitandaoreki505",
                "username": "chitandaoreki505"
            },
            "url": "https://myanimelist.net/reviews.php?id=191074"
        },
        {
            "content": "The story is still really simple. It doesn’t have a complicated storyline and there’s not even a plot. Though that is the case, it’s still not boring at all. In a way that is very admirable because I honestly think it is very hard to make a series interesting if the story is very simple. It is also a lot funnier. The gags and punch lines are a lot cleaner. There’s even a bit of drama as well and in fairness, it is nicely done.\r\nThough the storyline is very simple, it becomes interesting because of the characters. Well, that’s exactly what’s making the series interestingin the first place. All the characters are stranger and weirder than ever. Each has their unique antics that make them interesting and it is even more heightened now. Of course, like any other sequels there are new characters and even some recurring characters are tackled more. The unique yet nice relationship of the characters are a more featured in this sequel. They seem to be a lot closer. Friendship and particularly love are a lot more tackled this time which is no doubt making the series way more interesting. Some characters who were so oblivious of the feelings of others for them, are finally realizing it this time around little by little. And you could say there are huge character developments as well. Sometimes, when there are so many things happening around them, are they still able to work? And let me just mention that it is quite funny that the girl with glasses is only having some exposure during the last episode. All in all, everyone is still so much fun.\\n\\n\r\nIt is no doubt that there are lots of improvements to it but the most evident is the animation. Characters look a lot cuter and the animation looks a lot cleaner. It looks more sophisticated. Well, not that the previous one was less nicely done. I also like the opening theme. It is very cute and fun.\\n",
            "date": "2012-12-10T05:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 79802,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79802"
        },
        {
            "content": "Working’!! is exactly like Working!! but with an added apostrophe to confuse you. It has the same thirteen episode set up with the same characters, same restaurant, and same jokes. What I’m trying to get at is the fact that this review will be fairly tiny because there’s really not a lot that can be said about this second season of the series that I did not say in my previous review of Working!!.\r\nThe story is the same as before with Souta helping to cure Mahiru’s androphobia while working at a family restaurant operated by a big group of misfits. It runs in a somewhatepisodic way, with some overflow into the future episodes. That said, that’s about all I need to say. There is not a lot of story being dished out, or anything too complex anyway. Each episode ranges from fun and entertaining to boring and slow. These are especially prevalent around the points with Mahiru, who I complained about previously, and I shall complain about again. While I must commend the series for not making her the focal point and showcasing the others a lot more, she was still really prevalent and out of all the characters she is one of the worst. Thankfully, my prayers were answered and the cute romance between Jun and Yachiyo gets a lot more screen time and, while not going anywhere (just like every romance and major plot point of the series), still gives the characters added depth and a much more realistic feel than any of the others. The biggest plot aside from the androphobia concerns a guy looking for his sister. He’s not a particularly interesting or funny character, and this plot goes nowhere. Which is the problem with the series is that it just doesn’t develop. And there is a reason for this, that being Working!! is based on a comic strip which is the reason they use the same gags again and again and the characters never develop. So I guess I can be somewhat lenient based on that fact, but at the same time I feel that somebody should have taken the initiative and said something about tying up the romances or plots and at least ending the series with a bit of a bow on top. Instead it ends like any other episode and hopes I’ll return. Does this mean I can expect a season three called Working’,!! or is it just a tease like most anime endings? Time will tell I guess.\\n\\n\r\nThe animation is once again pretty unsubstantial. It’s good, but it’s not anything that will make you say “wow”. Character designs aren’t that fantastic and memorable.\\n\\n\r\nThe sound is okay. The theme song for this season is not as catchy as the previous one, and the ending isn’t as great either. The sound during the show fits perfectly fine.\\n\\n\r\nFor more on characters, please refer to my previous review. Which makes me sound lazy, but I’d feel lazier if I copy and pasted the exact words about each of the characters in this spot. Everyone is the same. There are no differences and no character development so you don’t have to worry about me saying anything. Once again, Maya Matsumoto, the self-proclaimed “Normal girl” returns with lines during the last episode, but remains a mute throughout, though can be seen in the background. She actually works with the crew in the last episode and seems to have some sort of relationship with all of them, but yet she is never used throughout to instill a sense of normality in the show. It doesn’t feel right for a character who has been there to magically have lines the last episode and become part of the plot. It’s like someone forgot about her up to that point and then quickly wrote her into the script.\\n\\n\r\nYeah, this review is very short by my standards, but it’s the best I can really do without copy and pasting my review of the previous season. If you liked Working!!, you’ll love this season. It’s not really an improvement, though the shift of focus from androphobia is a big part of what makes this season slightly better, but it is a good addition to the franchise. Will there be more episodes? Who knows. Will I welcome them? Sure I will, but I don’t know how willingly. While I enjoy the occasional comedy/slice of life adventure, there has to be some development and growth and Working’!! doesn’t provide either. As it progresses, it grows staler with the same brand of comedy and the same pointless romances that go in circles. It started off fun and felt like it may go somewhere and continue to entertain, but the problem is it starts to flatline. With the occasional good episode and the typical average ones, it never seems to find its stride and only occasionally makes a joke that is laugh-worthy, because all the others we have heard previously.\\n\\n\r\nOverall, Working’!! is a step in the right direction, but the entity taking that step is growing old and tired and needs to be rested before it can go any further. If there were to be a third season, there would have to be a sense of freshness that this anime rarely provides.",
            "date": "2015-05-22T11:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 188523,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188523"
        },
        {
            "content": "Continuing with the goings on at Wagnaria.\r\nThis actually an improvement from the first season mainly due to the better comedy timing. Inami punching Sota just didn't get old.\r\nWe're introduced to a few new characters:\r\nMahiru - Inami's dad and cause of her androphobia.\r\nHaruna - Hyogo's wife who appears from odd places.\r\nYohei and Mitsuki - the squabbling twins from the manager's old delinquent gang. Yohei some how gets engaged to Sota's sister Kozue.\r\nKirio - Aoi's brother who is looking for her.\r\nI think they can get a last season out of this so fingers crossed to tie up the stories.",
            "date": "2012-05-31T04:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 62331,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=62331"
        },
        {
            "content": "Note: This is one of my works from Sekijitsu\r\nArt\r\nThe character designs and even the backgrounds were nothing great but nothing bad as well though what really appeals in the art section is the facial expressions and reactions each character displays throughout the series which makes it not only fun but FUN-ny (ahaha…no.) as well. It’s these over expressive emotions the characters in Working’!! display that makes the comedy they execute more powerful and enjoyable to watch that you’ll eventually want more.\r\nMusic\r\nThough not as catchy as the first OP, the second OP still offered a great jolt of fluffy cuteness while accompanied by the OP sequences.I wasn’t that impressed with the ED overall and tend to skip it most of the time but it’s the OST’s/BGM’s/SFX’s – however you want to call it – that really made this show work. While the comedy was being executed, there’s always a brilliantly selected background music or sound affect accompanied with the comedy, making it more emotionally powerful and hilarious to witness with our own eyes and ears.\\n\\n\r\nStory\\n\\n\r\nWorking’!! never really had a plot nor a serious story but when it had to get serious, Working’!! executed them well. Examples are the ‘couples’ of Wagnaria’s moments throughout the series. Even so, Working’!! compensated its lack of story and plot with comedy skits and that itself offered us a story in itself. Only a few times I didn’t find certain jokes funny enough to giggle about or put on a smirk but most of the times I’ll be laughing at how well done the comedy is in Working’!! and also how they continue to offer a great flow between scenes. I guess it’s true that if you’ve got a bunch of comedy, people will easily ignore the lack of story behind it? Well the thing about Working’!! is that it never needed a story; it just needed jokes.\\n\\n\r\nCharacters\\n\\n\r\nWithout a great cast of characters how can a show work? But do not fear because Working’!! has one of the best cast of characters I’ve seen who individually offer their own little personality and interactions with each other which ends up into a gigantic comedy fest. There are only a few characters in the series I don’t really care about or didn’t think much for them but the main suspects at Wagnaria sure knows how to please new and old fans/viewers. Everyone’s different perspectives put together works so well and offer an infinite amount of ideas that can be used as great comedy which they have done already! And the brilliance of it all is that you find yourself liking nearly every character the show has to offer.\\n\\n\r\nOverall\\n\\n\r\nThe characters individual personalities accompanied by their own unique character designs and befittingly selected choices of background music and sound effects all come together and sync so well in executing the comedy in which Working’!! wanted to execute. It’s such a hilarious series full of hits and only a few misses but not everyone can think of such a great way in portraying each character through the use of comedy and/or romance. Definitely an enjoyable series and a show that will pull you into wanting more the more you watch.\\n\\n\r\nShould you watch it?\\n\\n\r\nDefinitely watch Working’!! but if you haven’t watched the first season I suggest you do so to get familiar with all the characters and trust me, season 1 is as enjoyable as season 2 so you won’t be disappointed if you do pick this show up. As a matter of fact I picked this show up recently and now I love it and I’m sure you’ll all love it too.",
            "date": "2012-02-29T12:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 55061,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/402368.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TofuZz",
                "username": "TofuZz"
            },
            "url": "https://myanimelist.net/reviews.php?id=55061"
        }
    ],
    [
        {
            "content": "Sequel from wagnaria working!! (1)\r\nStill based on manga written by takatsu karino.\r\nWhen there is sequel or next season of some story, you would expect \"more\". Especially from great success of previous season.\r\nUnfortunately, this sequel have no improvement from previous season. (maybe the cause is the original manga is sustainable).\r\nSo, because i expect more and reach saturation point, i rate it down a little bit.\r\nStory: no improvement, still fun and enjoyable. If compared from previous season, the role is split more evenly for each character with some new faces, when in the previous season have a little focus on inami and katanashi. \r\nSound: for Op, Edsong, I prefer the first one. (there is no special ed song like in ep 9 in working!!1 T-T)\\n\r\nArt, Character, Enjoyment : same as previous season",
            "date": "2012-09-02T06:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 71393,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/421158.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/wingz00",
                "username": "wingz00"
            },
            "url": "https://myanimelist.net/reviews.php?id=71393"
        }
    ]
]