[
    [
        {
            "content": "The most typical shut-in you'll get\r\nOnce filled out a survey on the net\r\nHis remarkable score\r\nOpened up a new door\r\nAnd then his new employment was set\r\nSo then after the following night\r\nWhat awaited him gave quite a fright\r\nAs he opened his eyes\r\nHe was seeing new skies\r\nIn a new world, a marvelous sight\r\nHe'd been sent to this realm on a quest\r\nThat would put all his skills to the test\r\nAbout culture he'd preach\r\nAbout manga he'd teach\r\nHe'd explain how Moe is the best\r\nBy his side was a beautiful maid\r\nWho would do anything that he bade\r\nBut the Tsundere Queen\r\nWho was barely a teen\r\nWould at all costs not let him get laid\r\nThena school was established one day\\n\r\nWhere the lessons all looked more like play\\n\r\nBut the Dwarves and the Elves\\n\r\nStarted fighting themselves\\n\r\nOver which was the best eroge\\n\\n\r\nSo the culture was rapidly spread\\n\r\nBut a problem came up in its stead\\n\r\nWho could ever have guessed\\n\r\nThey would all be obsessed\\n\r\nAnd read manga until they'd be dead\\n\\n\r\nIn the end all that matters is this:\\n\r\nIt's a truth you can never dismiss;\\n\r\nSimply no matter what\\n\r\nEnds up happening or not\\n\r\nThe Otaku culture is a bliss!",
            "date": "2013-12-20T10:12:00+00:00",
            "helpful_count": 1242,
            "mal_id": 124763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=124763"
        },
        {
            "content": "This whole anime can be summed up by the lyrics of one of the songs that comes from Outbreak Company.  \"DA. DA DA DA DIN DIN DA DA DA\"\r\nStory: 7\r\nThis anime is a clash of modern day Japan with a fantasy land that has knights, dragons, a loli ruler, elves, dwarfs and dragons.  Just imagine a brighter version of LOTR.  We follow Shinchi as he has to spread otaku culture (Anime and Manga) throughout the lands of Eldant.  That is pretty much the show....\r\nThe pacing of Outbreak Company was fine up until the final two episodes, which the pacing felt toofast as they tried cramming in a lot of seriousness that the other ten episodes lacked.  The ten episodes lacking seriousness wasn't a bad thing, the show was doing a great job with those episodes, but the last two rushed into drama and seriousness.  \\n\\n\r\nArt: 9\\n\r\nArt was great! Something I found enjoyable were all the references to other shows through background art such as a parody poster of Hataraku Maou-sama.    \\n\\n\r\nScenery was amazing as well they made medieval times look happy and splendid.  Castle, fields, mountains, the whole thing was pretty to look at.  \\n\\n\r\nCharacter designs weren't outstanding, but unique enough to separate characters and make them memorable.  \\n\\n\r\nSound: 10\\n\r\nIn my opinion, Univer Page, the OP of Outbreak Company is my favorite song to come out of this fall season of anime.  It is so cheery and the way the song starts, eargasm.  Watashi no Houseibako, the ED of Outbreak Company is a very soothing song and very good to listen to while running.  Both songs give off the vibe that the whole anime is trying to do, make the person watching this very happy.  \\n\\n\r\nThe background music does a great job at carrying the mood, with a very unique song that is used during comical parts, I already quoted the lyrics of it in the beginning of this review.  \\n\\n\r\nCharacter: 8\\n\r\nCharacters are given enough depth to make the memorable, and distinguishable.  This is good since my first impression after looking at the OP was that characters would be easy to mix up.  Character development was great, everyone had development outside of being interested in manga or anime.  \\n\\n\r\nThe only problem I had was the random characters added halfway through, the dwarf and the elf.  These two were added to the story and I was assuming for them to have a pretty big role for upcoming events, but nothing really happened involving them.  \\n\\n\r\nEnjoyment: 8\\n\r\nThis anime was enjoyable because of the otaku humor.  I found humor based around references and other things anime and manga hilarious.  Multiple scenes I have laughed, and the soundtrack makes it even funnier.  I also really enjoyed the one part of seriousness they did in the last episode, the only time this series did the serious business right, which makes the last two episodes worth it.\\n\\n\r\nOverall: 8\\n\r\nGreat anime for the fall season with an amazing soundtrack.  I will be listening to Univer Page for a long time to come, especially when I need a pick me up.\\n\\n",
            "date": "2013-12-27T08:34:00+00:00",
            "helpful_count": 146,
            "mal_id": 125837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686267.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zelot",
                "username": "Zelot"
            },
            "url": "https://myanimelist.net/reviews.php?id=125837"
        },
        {
            "content": "Whoever thought being an otaku can come with so many responsibilities? For Shinchi Kano, his responsibilities just skyrocketed after being set up and sent to a fantasy world. Sounds fun right? Wrong. It seems that some higher powers wants this young boy to spread the otaku culture and expands the Japanese culture in their world like never ever before. Being otaku is often considered a negative influence due to its pure nature. But in Outbreak Company, it plays on different trope. In fact, it’s being an otaku that allowed Shinichi to gain stardom in this new world where his life changes forever. \r\nOutbreak Company isan animated series based off the light novel of the same name written by Ichiro Sakaki. The full title of the series is actually Outbreak Company: The Moe Invader that emphasizes the spread of Japanese culture as an allusion to “invasion”. Shinichi plays the role of the main character and otaku life becomes a pivotal role in shaping such a fantasy world. It almost feels like a dream for Shinichi but that might not seem to be as easy as he thinks. Shinchi quickly realizes that he gets more than what he bargained. It’s an otaku’s wet dream coming true.\\n\\n\r\nThe story of Outbreak Company is quite simple. Shinichi is your average high school boy whom has a crush on a girl. After rejection, he tries to find a way to replace that deep hole in his life. Becoming an otaku isn’t exactly the best way to get over a rejection but he chooses anyways. After he does manage to get a job, it’s here where we find out his in-depth knowledge about various anime, manga, and Japanese culture. In many ways, the show takes this idea and twists it around in a way that is fun and entertaining. The fact that Shinichi plays the role of an otaku can be stereotyped as a boy who spent a lot of time in front of the TV. And in fact, he does but not only in front of a television but also on the web with his knowledge of various anime/manga and even eroge. \\n\\n\r\nAs this series plays fun with the otaku culture, there should be unsuspectingly a lot of references to various anime and manga. Almost every episode has posters or merchandise from other popular animated series with modified artwork. It also makes fun of the otaku culture by having the main male protagonist become a type of instructor to his students. His way of teaching can seem absurd but he has fun with it. His students also seems to enjoy his teaching methods despite its obscenity on several occasions as the product he tries to present tends to be any otaku’s wet dream.  \\n\\n\r\nPart of that dreams comes with a package including an adorable maid named Myucel Foaran. She plays the role of a typical maid with an addition of elf ears and overly politeness. As one of the most innocent characters in the series, she always puts others above herself. This is proven later on when her friends’ lives are in danger. Her action speaks louder than words as she faces on danger straight ahead rather than looking back. But besides her gentleness, Myucel is able to make friends and her relationship with Shinichi is one of the more dynamic pairs of this show. For starters, Shinichi originally sees her as a fantasy fulfillment come true. After all, Myucel refers Shinichi as her master. Surprisingly enough, Shinichi doesn’t abuse or treat her indiscriminately but instead befriends her as if she is a human being. He even goes as far as to teach her about the otaku culture as well as Japanese language. It’s an odd relationship as Myucel is constantly trying to please him and apologizes for any behavior she interprets as misdeed. Surprisingly she is a girl not to be underestimated. Mycuel has astonishing skills in magic and fighting capabilities that can accomplish superhuman feats. Like an old saying goes, “dynamites comes in little packages”.\\n\\n\r\nThroughout his time there, Shinichi also gets involved with other affairs. This includes his encounter with the monarch of the Eldant Empire, Petralka Anne Eldant III. Unlike Mycuel, she represents more of a brat that is initially seen as selfish, stubborn, and only wants things to go her way. She is the perfect example of how an immature child would behave like despite her similar age to Shinichi. But because Shinichi seems to the first person to stand up against her status, she takes an interest him. This lands a “rivalry” with Mycuel as she sees her as competition. This competition often comes as a backlash and jealousy against Mycuel because Petralka sees her getting in the way. At first, it might seems harmless but there are various times when the tension gets heated and Shinichi has to step in to settle the bounds. Later on though, she learns a bit more from her mistakes and starts treating Mycuel with more respect due to certain reasons. \\n\\n\r\nThe trio of these characters makes up the main course of the series but to other characters do come into play with their parts. Most of these characters are direct parodies to the culture of anime such as Minori, a woman with a fujoshi fetish. She is also an otaku and often formulates absurd fantasies in her head with BL tones. Bulk, a lizard man, is designed to fit the role of a fantasy beast but with surprisingly gentle nature. Then, there are also the half-elves, wolf girl species, and even dwarves who doesn't match their age.\\n\\n\r\nI wouldn’t say this series fits within the drama category but there is certainly a lot of tension going on throughout various parts of the show. Among some of the tensions includes a rivalry between the races of elves and dwarves. They have contrasting views on Japanese culture that often results in insults thrown back and forth with nitpickery debates, This is even presented in a more extreme case when both sides decides to settle it in a sports competition to see which side is more dominate. More importantly is the fact that humans are treated as seemingly superior beings. Fortunately, Shinichi often plays the role of a normal human boy and doesn’t take advantage of certain situations.\\n\\n\r\nDespite the fun that Outbreak Company throughout each episode, there are various problems with the show that can turn viewers away. The initial premise itself might cause some heads to turn. After all, the theme of a human being sent to another fantasy world to help others isn’t exactly a new idea. Series such as Dog Days, Problem Children, Familiar of Zero, and Ixion DT also plays on these tropes. Shinichi’s initial introduction can be viewed as a clichéd and stereotypical character as comparable to harem leads. Although he doesn’t technically have a harem, Shinichi is oblivious to the female characters around him. Shinichi does have the behavior of a typical harem lead though with the typical nosebleed upon witnessing any beautiful character of the opposite sex and getting excited about a loli (Petralka) during their first initial meeting. Speaking of Petralka, her tsundere personality can also be hard to endure on various occasions with her constant bickering. The way she treats others (especially Mycuel) is based on greed and jealousy like a spoiled child that can be frustrating to watch. Some of the other characters’ races also makes little sense with dwarves’ ages, the werewolf girl that hardly resembles what she looks like, or the repetitive BL gags. Unlike Genshiken, there’s hardly any realism to it but rather just played out as a ridiculous and senseless fantasy. Finally, the story itself jumps around a bit. Shinichi might be the main focus of the show but some episodes’ ideas becomes larger than himself. There’s no any ongoing plot or arcs but mainly focuses on its main theme of otaku culture spreading. If you get bored of this type of theme then this show will likely not be for you.\\n\\n\r\nArtistic wise, Outbreak Company brings out the fantasy to its greatness with its character designs. Shinichi is probably the only main character designed with human characteristics. Almost every other recurring character has bits of a fantasy touch added to them like Myucel’s elf years, Petralka’s overly made dress, Galious’ knight armor, or Elvia’s wolf-like ears/tail. The castle that Shinichi is bought upon also gives a feeling of fantasy with its internal design. The landscape outside is absent of technology but instead is replaced with fantastical architecture and nature. Feel (Da Capo, Fortune Arterial, Nagasarete Airantou) are known for their production in series involving fantasy/supernatural elements. For Outbreak Company, they definitely delivered a handy dandy job. \\n\\n\r\nSound production might seem off balance a bit. The comedic scenes has an odd theme played most times when there are awkward moments. Because this show isn’t about magical sword fighting, there’s a minimal amount of intense OST. Instead, they are replace with lighthearted soundtrack that tends to bring out a more fun side of Outbreak Company; namely the tone of the ‘Da, da, da’. The OP song “Univer Page” by Suzuko Mimori matches its style quite well with its fantasy elements. The same applies for the ED song that brings out fantasy to a level of credibility. Shinichi’s voice also is performed well that ranges from his otaku craziness to his occasionally maturity during appropriate moments. Regrettably, I find Petralka’s voice to be a sting to my ears that symbolizes the tsundere that she is. As a girl with a bratty voice, I find it not just annoying but also the fact that she herself seems to not even notice it.\\n\\n\r\nSo, how do you plan to watch Outbreak Company? If you’re in for some fun, then definitely watch it that way because this show is floured with silliness. But if engaging story is a factor you’re more interested, then this show could be quite a disappointment. Instead of a deep story with complex elements, Outbreak Company likes to make more fun of the typical otaku culture and community. With an outbreak of references to anime and manga, expect many ideas to be wheeled in from your favorite series. The main character Shinichi can also take quite a bit of time to get used to and some people might not like him even until the very end. With its silly premise comes a long way to bring about the otaku culture in story form and I think this show pulled it off in the right direction. Outbreak Company will bring forth a charming experience of the otaku culture where you’ll learn more than meets the eye.\\n",
            "date": "2013-12-19T20:30:00+00:00",
            "helpful_count": 60,
            "mal_id": 124681,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=124681"
        },
        {
            "content": "Outbreak Company\r\nI didn't know what to expect from this anime, and i was not going to watch it but i decided to give it a try, i'm glad i did because it was funny.\r\nStroy\r\nThe story is about bringing Japanese culture, name it VN games, anime, manga and other things to a fantasy world that the goverment discovered, so that's why our protagonist is sent to this place, because he has the knowdlege of all this things, Shinichi will learn how different this fantasy world is. The thing is that everything was well paced until the last 3 or 2 episodes where they throw a lotof content too fast and too much for two episodes, so it was good.\\n\\n\r\nArt & Animation\\n\r\nThe art style was great, the animation was great, and the references from other animes was enjoyable, the characters were a little simple but still well made.\\n\\n\r\nSound\\n\r\nThe sound was very good, the OP and ED song were great and it matched the theme of the anime, the songs in the comedy parts made it even funnier, overall was very good.\\n\\n\r\nCharacter\\n\r\nThe characters were unique and they were really memorable and were developed deeply enough to know them.\\n\r\n-Shinichi was funny and he was likeable and his facial expression were hilarious, specially his poker face.\\n\r\n-Petrarka was annoying at first but she is more kind later on and more likeable.\\n\r\n-Myucel was my fav. i loved everything about her and she was so sweet and light hearted and i felt she was though for going through hell for being an elf and how they are considered a low class and only serves as militaries.\\n\r\nOverall the characters were very good and very funny.\\n\\n\r\nEnjoyment\\n\r\nThe humor this had to offer was great and the songs were even funnier, the references to other animes were enjoyable.",
            "date": "2015-08-07T12:54:00+00:00",
            "helpful_count": 45,
            "mal_id": 195440,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195440"
        },
        {
            "content": "This anime is the ultimate anime lover's dream. I'm just going to start this review by saying that I have a thing for anime that has a message that I can take away from it. Right off the bat, we have Shinichi, a bro that honestly reminds me of a couple of my friends who just sit and watch anime and read manga all day. In the beginning, we see Sinichi's bad luck set in when he gets kidnapped and brought to some foreign world that has magic and loves Japanese otaku culture. Shinichi is brought in to educate this new world of his otakuculture and to ensure that relations between said world and Japan are good. He starts a school where they teach anime and manga that right away challenges racism and class diversity between the elves and the dwarves. His school does more for these students than teach them to be otakus - it teaches them to live beyond their differences and be friends with each other despite their origins and differences. Soon they begin to have arguments about lolis and eroge games rather than fighting because they are dwarves or elves. I thought that this was absolutely beautiful and it reminded me a great deal of Maouyuu, which is another one of my favorite shows with similar themes.\\n\\n\r\nThe next character that we meet is Miusel, who is my favorite character in the entire show. Miusel presents herself to Shinichi and tells him that she will be the maid taking care of him while he stays in the Eldant empire. As soon as Shinichi sees Miusel, he freaks out at the fact that she is a legitimate maid. This is the thing that I love about Shinichi: Miusel freaks out the moment that he discovers that she is a half-elf, which is something that the citizens in Eldant discriminate against her for, and instead thinks the fact that she is an elf is awesome. This is one of the things that I love Shinichi for: he doesn't discriminate against race, gender, or background because he remembers being outcast because he was an otaku. Miusel at this point I believe begins to fall in love with Shinichi, which wasn't something that the plot synopsis and the genres really talk about.\\n\\n\r\nThe next character you meet is Petralka, the supreme ruler of Eldant that nearly kills Shinichi when he calls her a little girl. Right off the bat, she takes a liking for Shinichi and develops a sort of tsundere personality that really compliments Miusel's personality. As the show progresses, Shinichi helps change her personality for the better with his otaku ways and even helps her become a better leader. I love the idea that a normal person with the right beliefs and intentions can help change those who have a different social class or background than them.\\n\\n\r\nAlright, so for those of you who don't want something as deep or psychologically stimulating as this, this show is very lighthearted and is quite hilarious. I don't have many friends who enjoy anime with deep meaning because most of them don't think about stuff like this like I do. That is perfectly fine and I still think you will love this show if you give it a chance. I would even go as far as saying that this anime is deserving a spot on my top ten anime of the year. So stop reading this and go watch it now!",
            "date": "2014-05-08T15:18:00+00:00",
            "helpful_count": 29,
            "mal_id": 142717,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1511593.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ThatsSoWitty",
                "username": "ThatsSoWitty"
            },
            "url": "https://myanimelist.net/reviews.php?id=142717"
        },
        {
            "content": "At the beginning of this fall anime season, I wasn’t planning on watching Outbreak Company. The synopsis for this anime wasn’t anything exciting nor was it intriguing. However, I decided to watch it anyway, for it was on Crunchyroll and there weren’t too many other anime I was hyped for this fall. After this show finished airing and I finished watching, I, unfortunately felt like I had wasted my time, tuning into this show every Sunday.\r\nFor the most part, the plot of Outbreak Company is nothing special. Our protagonist, Kanou Shinichi, is a reject who hides in his house all day. The reason forthis is silly, but we can’t blame Outbreak Company for it because it was clearly meant to be a parody anime and you can tell right from the beginning.  The show then immediately tosses Shinichi into a fantasy realm (the Eldant Empire) in which he unintentionally starts developing a harem. The harem part was a strange inclusion, as the beginning of this show led me to believe this would be a romantic comedy. Outbreak Co. is, indeed, a comedy, but it occasionally attempts to be serious and it fails miserably. It has plenty of ecchi elements and fits the definition of harem very well, which prevents it from blending well with “plot.” This could direct the focus of the anime towards comedy, but it may bother you when the show tries to be serious.\\n\\n\r\nThankfully, Outbreak Co. does try to be funny for the majority of the time and that is what you should expect when jumping into this anime. Much to the chagrin of many, however, the jokes in this show heavily rely on references and parody. This is awful for new viewers of anime and non-hardcore viewers because it’s hard to understand the jokes without prior knowledge or thorough research. Either that or the show throws around cultural-specific Japaneses terms so it can create a gag that might last until the end of the current episode. Comedy is really all this show has going for it, yet the entirety of Outbreak Co. involves Shinichi trying to teach the residents of the Eldant Empire about “Otaku Culture,” which creates comedy that, again, alienates new viewers. Don’t watch this anime for the plot, and only for the comedy if you’re a hardcore anime lover, or for some reason, striving to be one.\\n\\n\r\nThe animation is fine. Though, like many anime today, the art style makes everything shiny (hair, vehicles, skin, etc.). If you watch for a long time, your head may start to hurt. Don’t marathon this anime; not that I would recommend it otherwise. I do like how fantasy elements, such as dragons and magic are drawn, however. There’s also some ecchi so that might also be a reason to avoid Outbreak Co. By the way, every character tends to have this lower case u-shaped smile as their “default expression.” That annoyed me and may annoy you.\\n\\n\r\nI have no complaints with the audio for the anime. The music was fine. The opening and ending may be sort of catchy, but nothing exceptional. I do have a problem with a lot of the dialogue from the characters Shinichi and Myucel, but that is more of an issue with the story, or characters. The voice actors could annoy you since their character roles are all generic archetypes, but they’re bearable, at least to me.\\n\\n\r\nThe characters are what really and truly mitigate my enjoyment for this anime. Outbreak Co. does what many anime do and builds characters directly from unadulterated tropes. I can summarize my problems with the characters in one sentence: Everyone is unoriginal and possibly so annoying that it’s lethal. The unoriginal characters may not be an issue especially if you anticipate the harem aspect. Plenty of harems are not plot-driven, or very much creative, but they can back-up their quality with comedy, or even quirkiness. Outbreak Co. does not have this leisure and it worsens because of Shinichi and his gang. All the people (and even other creatures) are absolutely obsessed with anime and manga. This could actually be funny if: 1. the show could allow people not familiar with Otaku culture to get its references, 2. not make it seem perfectly reasonable that their obsession does not hinder their work. Shinichi takes every single chance he gets to boost his ego by acting like mister smarty-pants when it comes to “Otaku Culture,” Myucel misunderstand every statement that may be misunderstood, and Petralka acts like a more serious person than she actually is (considering she looks like a little girl). These traits could allow these characters to be hilarious, but the awful dialogue and unfortunate combination of mediocre setting and bad character interactions prevents this. An example being: the show doesn’t alert us when it changes its tone effectively, so we don’t know if dialogue is supposed to be serious or comedic.\\n\\n\r\nTo be as frank as possible, the only reason this show is bad is because of the references that are 90% of this show. It actually isn’t so much that they’re hard to get, but more that they’re omnipresent. Without that problem, high points of Outbreak Co. are salvageable. Though, since it’s included, this anime becomes incredibly hard to enjoy. It’s quite possible for you to enjoy it if you are a hardcore anime viewer. I wouldn’t personally call myself that. The show is obviously made in Japan and therefore targeted toward Japanese viewers, but some of the issues I brought up may prevent you from enjoying it even if you live in Japan.\\n\\n\r\nYou should definitely avoid Outbreak Company entirely. Unless you are an anime enthusiast, it is distracting that every joke in this anime tends to rely on references to other media, or certain cultural elements. It also seems to want to parody, but never goes full force with it. Even if you get all the references, they’re more amusing than funny, and the bad character design and lack of proper storytelling doesn’t give Outbreak Co. much merit. Don’t expect depth from anything in this show and expect a lot of annoying characters as well as the lack of common sense that would be funny if done properly. I wouldn’t say Outbreak Company is a terrible show, but it limits its audience and it tries a little too hard to be what it is not.\\n\\n\r\n4/10",
            "date": "2014-01-02T17:19:00+00:00",
            "helpful_count": 18,
            "mal_id": 126879,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2813025.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ar2000",
                "username": "ar2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=126879"
        },
        {
            "content": "Outbreak Company is a very enjoyable anime to watch. It's one of those series that can have a positive effect on your mood when you're tired and frustrated.\r\nStory: 7\r\nThe story is a bit original, for me at least. Never before have I seen an anime where the main character actually exports the whole otaku culture. It's pretty fun how they implemented this general idea and having such a short amount of time to provide the viewers with enough details/explanations as to why and how this is happening they did a pretty good job.\r\nIn no case you should expect an anime with no holes or arbitrarystories but rest assured assured that the end result is quite enjoyable.\\n\\n\r\nArt : 9\\n\\n\r\nThe art was extremely good, especially when you take into account that it's only 12 episodes. The artist team really did their best to create a very appealing world and beautiful characters. Of course they did not have to wander off into unknown territory and that made their work a bit easier. The races and tribes that reside in this parallel universe are the usual suspects (elfs, dwarfs, humans etc.).That being said the outcome was exceptional. \\n\\n\r\nSound : 6\\n\\n\r\nThe soundtrack could have been better. It seemed that not enough thought was given to the music for this anime. I can not say that it was bad but it was nothing memorable either. In some cases the soundtrack did not complement the scenes and in others it seemed to be perfect. Overall a decent result in regards to music but it had ample room to improve.\\n\\n\r\nCharacter : 8\\n\\n\r\nMost characters were very good although there was a great inequality of available information for some of them (mostly supporting characters). The main protagonist is a hardcore otaku and a hikikomori. Fortunately enough the story explains as to how this came to be. The supporting characters as I stated earlier suffer inequalities between one another since there are some where the viewer knows their background story and others where the flow information is limited at best. As a huge fan of anime I was able to extrapolate certain things from the characters based on their behavior since the maintained a classic character pattern. There is your loli, your BL Pervert, your timid maid and other usual characters. in essence all of them quite good for this type of series.\\n\\n\r\nEnjoyment & Overall : 7\\n\\n\r\nThis anime series was quite enjoyable, easy and fun to watch with no complex story lines or difficult character plots. It is what you would expect from a 12 episode series. I would recommend it to everyone who want to relax watching something fun and easy.",
            "date": "2014-05-06T04:39:00+00:00",
            "helpful_count": 16,
            "mal_id": 142489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=142489"
        },
        {
            "content": "Story: So its a pretty much a every day life for Kanou he basically loves anime, manga and video games than one day take (what i think at least) to be a survey or test for a company soon after seeing Matoba about the job he ends up getting druged and than transport ported to a world called (sorry i forget the place) but when he wakes up to see a maid and also the fact she is a half-elf maid serving him so basically after meeting the princess among others he was sent there to bring there you'd think he would be there ona quest or something like that but nope his task is to bring anime, manga and games to thrive there in the world and that is pretty much his task to bring MOE in this world but he'll also have to deal with certain stuff as well in the world that might be troubling.\\n\\n\r\nArt: the art in this is really well done from the background to the magic that is showing in the anime to character design as well.\\n\\n\r\nSound: the Op is actually pretty decent i liked it after a little awhile as for the Ed eh personally didn't care for it that much also i watched the dub for this anime and i gotta say everyone did a really good job for the dub.\\n\\n\r\nCharacter:  Shinichi is the main person of the anime is a total shut-in but also loves anime, manga and games but he does have a very likeable and nice personality honestly he is a very nice and total cool character for the anime. Myucel is another main character and well she is the maid to Shinichi and his really loyal to him being she is her maid she is easily a likeable character other than that she is a very nice and sweet through the anime. Petralka Anne Eldante III is the last main of the anime and she is the princess to her land she had to take it over (im not gonna spoil why watch the anime to find out why) and she makes sure Shinichi is doing good and what not with his quest to make sure the anime and stuff go good otherwise she can be a angry one at first but later on she opens up and what not pretty good character. Elbia is a supporting character (honestly she should be a main not a supporting one) she is pretty much a wolf and she likes to draw a way of keeping her animal instincts from kicking in she is a pretty nice and and again sweet character like most in the anime. Minori is another supporting character (again like Elbia she should be a main character not supporting) she is the bodyguard to Shinichi and well she does have a thing for boys love and stuff of that nature but otherwise again another likeable character that i liked like the ones here.\\n\\n\r\nEnjoyment: Things that i liked: this anime loved a lot from the characters that i actually liked all of them also that that comedy wasn't great at first but man did it get really funny from there one was a damn funny anime also that the art and sound for the anime was really good and not bad at all everything almost about this anime was good. Things that i didn't like: ill admit like another people for some odd reason the anime starts to get really tense around episode 11-12 which is kinda odd would think maybe that had to rush those 2 out or the story out to get it in (would say episode 3 is tense but yeah) but not a major problem for me.\\n\\n\r\nOverall: im gonna give this a 8 would almost give this a 8.5 to be honest the anime is actually really good from the comedy being really well done and just being really damn funny from the art looking really good and the sound being good also that all the characters are all really good here easily a anime worth the watch for sure.",
            "date": "2017-10-18T22:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 261159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=261159"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nAnime is a medium that is normally looked down upon. Filled with sexualized women, crazy plots, and enough cute little girls to open up a daycare, the culture it has created is definitely unique. It is with this in mind that Outbreak Company aims to look at with a more satirical view in mind.\r\nSTORY\r\nOur story begins with Shinichi, a young guy who, upon scoring a perfect on the \"otaku test\", has been accepted as the new GM of AmuTec. This company's main directive? Apply otaku culture to the newly discovered kingdom of Eldant.\r\nSounds pretty crazy, right? To behonest, it is. Most shows and society look down upon otaku culture (mostly meaning obsession with anime/manga/games). But Outbreak Company takes a positive twist on this idea. The majority of the show actually focuses and explains the different lifestyles, phrases, and mannerisms of otaku. Do you want to know how to be an hikikomori? It has you covered. Don't know certain BL terms? Done. Need definitions for what it means to be \"moe\" and \"tsundere\"? Easy as pie. The show is rife with the culture it intends to parody, and for all intents and purposes (read here as \"as far as I know\"), it does this quite nicely.\\n\\n\r\nThe show's main focus is depicting a world that has never been exposed to something of this magnitude before. Essentially, the people of Eldant are like us before we were ever introduced to anime. They learn about popular shows, what to look out for in manga, and which games are rare to find. But this show is a comedy, and more specifically a parody. It doesn't take itself too seriously (most of the time). I found the comedy itself to be good. By playing off the idea that otaku culture is actually something to strive for, it gives us these situations that wouldn't normally be possible. And because of that, you are laughing a lot at what these people are doing.\\n\\n\r\nMore comedy also stems from the characters. They themselves are also pretty generic, but that's the point. By representing a role from anime, you understand what that character is attempting to portray or at the very least poke fun at.\\n\\n\r\nBecause the comedy works so well, when the show does get into more dramatic territory, it feels rather shallow. In other words, weak. OC is at its best when it is making fun of the otaku culture and the comedy in general. A lot of the dire moments only last for an episode (or even half of one), so they don't feel particularly influential in the long run.\\n\\n\r\nAnother problem with the show is the kingdom of Eldant. I felt a distinct lack of development on its world-building. I never really felt as if I was experiencing this new world. Instead, it felt like any other countryside. I feel as if the show should have done some more exploration into its people and original culture before attempting to instantiate a new one. Perhaps this is due to the pacing of the show, which seems a tad bit too quick for its own good.\\n\\n\r\nANIMATION\\n\\n\r\nOutbreak Company's art style is actually rather pretty, if not a little bit strange. All of the characters have this \"shine\" to them that makes it look as if they took a bath in some oil beforehand. It isn't really a turn-off, just that they seemed to always be glowing.\\n\\n\r\nThe animation itself is a slight problem. To be honest, it was never too stellar, and when it had the chance to be, such as during the soccer match or during certain dire moments, they usually opted for off-screen happenings or repeated use of the same animated sequence.\\n\\n\r\nAs for the character designs, I actually quite liked them. In particular, Myucel's and Petralka's designs were quite nice. The same can be said for Romilda. I would have liked to have seen more racial variety besides just the dwarves and the elves, but perhaps that is just wishful thinking.\\n\\n\r\nCHARACTERS\\n\\n\r\nIt is best to keep in mind that the characters for OC are meant to parody the common tropes of otaku culture. That being said, I still liked the majority of them.\\n\\n\r\nMy favorite by far was Myucel. She has a small bit of back-story to her, but she personifies cuteness, and her actions are without a doubt too adorable to not put a smile on your face constantly. Seriously, she is so \"moe\" that it is impossible not to like her.\\n\\n\r\nPetralka somewhat represents the \"tsundere\" type. She acts authoritatively and loudly around Shinichi, but it becomes clear early on that her affection towards him is more than just royalty and ambassador. One of her funniest moments is definitely at attempting to be the character arch-type she is parodying, but she always provided good laughs because she could read Shinichi oh so well.\\n\\n\r\nSpeaking of the MC, Shinichi himself is the final character of note. Unlike other main protagonists, he is not dense. He understands the situations he gets put in, how the people around him act, and what the outcome of certain situations would be. He is smart, kind, and honest. He isn't afraid to speak his mind, and because of his otaku nature, he also provided some of the best laughs in the series.\\n\\n\r\nBesides these three, I found the other characters to be rather boring or at least under-utilized. Specifically in regards to Elbia and Brooke. These characters are introduced and slightly looked at, but are then for the most part forgotten. I wish we would have seen more connections between them and the world, since this would tie into the world-building itself, but this never happened.\\n\\n\r\nSOUND\\n\\n\r\nThe OP at first wasn't too good, but became at least slightly enjoyable the more I heard it. It has a fantastical feel to it that fits nicely with the fantasy landscaping of the show. Plus, the twinkling part with Elbia and her eyes I particularly liked because it coincided so well together. The ED features Petralka alone in many different areas around Eldant, and the song itself gives us a feeling of wonderment, the same that she feels as she walks along the barren world.\\n\\n\r\nWhen it comes to a soundtrack, it is sometimes hard to leave a memorable mark. However, it is quite easy to do if you have a piece that is quirky and has simpe lyrics. This piece, probably known by everyone who has seen the show, is the \"DA DA DA\" song that gets played a handful of times. You owe it to yourself to check it out, since it is strangely weird yet extremely fun to listen to.\\n\\n\r\nThe voice acting was fine throughout the show. There are no standout performances to be had, but I enjoyed Myucel's, Petralka's, and Shinichi's voice acting.\\n\\n\r\nENJOYMENT\\n\\n\r\nOutbreak Company is a pretty funny show. And its also very sweet. I love to ship couples if they show any signs that they want to be together. So whenever Shinichi and Myucel were alone together, I always had a doofy grin on my face. Romance wasn't really the focus of the show, but I did like the subtle hints and inclusion of it, for it provided tender moments and nice comedy.\\n\\n\r\nEven though the show is rated PG-13, there is actually a heavy amount of fan-service, both of the tame and sexual variety. But this should be expected; after all, the show is attempting to demonstrate the different sides to otaku culture, and you can't talk about that without some naked women. I personally don't mind fan-service, so its inclusion was merely a bonus.\\n\\n\r\nOne of my favorite moments in OC is the \"Swimsuit Council.\" Taking the show into context, it is a masterfully crafted joke and one that I will probably remember for a long time.\\n\\n\r\nThe series ends on a touching moment, leaving us with wanting to have a fulfilling conclusion. Will we get that? I'm not sure. But if the time comes, I will be more than happy to return to the land of Eldant to get my fix of Myucel, Petralka, and Shinichi.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, interesting premise but lacking development\\n\\n\r\nAnimation: Good, shiny and modern with average actual animation\\n\\n\r\nCharacters: Fine, main cast is good but supporting is bad\\n\\n\r\nSound: Fine, okay OP, lacking ED, but good \"DA DA DA\"\\n\\n\r\nEnjoyment: Good, funny, cute, and fan-service to boot\\n\\n\r\nFinal Score: 6/10",
            "date": "2014-09-21T20:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 161509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=161509"
        },
        {
            "content": "When I first started watching this show it didn’t really seem like it would have good characters since they were generic.  I was just there for the premise, but there were many things that it actually did pretty well.\r\nStory: 7/10\r\nThe story in the beginning seemed very generic at first with the usual premise of being trapped in another world, but I really liked the beach scene and the overarching story.  The beach episode felt a bit more representative of the way an otaku would react showing us that he is still the awkward type of person.  It was also cool to seethe mc bring his whole collection of anime and manga and introduce it to everyone, which from my experience is original.  I also really liked the plot twist at the end, which was like the exact opposite of Gate in terms of how the government is viewed.\\n\\n\r\nArt: 6/10\\n\r\nThe art style looks pretty nice in this show with very differentiable characters.  It is very bright and colorful but don’t expect to see good fighting animation.  There were times when it did average but when it came to certain scenes, all you saw were stills, panning on the screen.  Like for the dragon fight all you saw were soldiers aiming at a dragon with nothing moving.  Other than the fights, all the other scenes were consistent.\\n\\n\r\nSound: 6/10\\n\r\nNot really any of the soundtracks were memorable other than that ‘da da da’ one which sounded very strange to me.  But they did match well with the scenes.  Kanou’s tone of voice changed well when going between the comedy and serious moods.  However, I don’t think that there was enough music to fit the serious tones.\\n\\n\r\nCharacter: 7/10\\n\r\nThe characters were the generic archetypes but they did develop a bit as you continue to watch.  I wish they had more of a backstory on how Myucel became Kanou’s maid though.  The main character showed a slightly more realistic approach to how an otaku would react compared to other shows.  He isn’t perfect but still tries his best to help others.  The harem isn’t actually blindly in love with him either which annoys me so much when that’s done in other shows that I watch.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI really enjoyed how this show shared about otaku culture, presenting its pro and cons.  There were tons of references that were put into this series as well like Fate, The Devil is a Part Timer and Madoka Magica.\\n\\n\r\nOverall: 7/10\\n\r\nOverall I would recommend this anime to people who like Gate or The Devil is a Part Timer and vice versa.\\n",
            "date": "2018-02-27T17:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 272617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6850125.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SharockoRAZR",
                "username": "SharockoRAZR"
            },
            "url": "https://myanimelist.net/reviews.php?id=272617"
        },
        {
            "content": "This review is in parts. Part 1 With no spoilers. Part 2 With short and deeper look at the story - spoilers  - reader discretion is advised.\r\nPart 1. \r\nI wish more anime series would be like this. This is one of the balanced ones. I mean, not too much sexistic scenes (Ecchi), not too much weird scenes, its showing how it really was in times of king, knights, princesses etc. (Offcourse things like dragons, birds used to be horses werent in medieval times, but that is minor (i think)). One aspect I like about this anime is showing a real otaku culture (half ofit), a lot of references to games and other animes. And when i say: a lot of, I really mean a huge amount of refenences (at least two in every episode). One aspect i didnt like about it is, the main point of this anime is revealed like nearly at the end, but I have to say in some ways its original (never saw something like that). Would I recommend it? Yes! Some viewers will like it some viewers will just watch it, say something about characters that are kawaii and go watch another anime. So yeah, watch it if you want...\\n\\n\r\nPart 2. As I mentioned earlier this will take a short look at the story.\\n\\n\r\nSo, main character is taken, throught an magical portal, to the magical medieval world where he is tasked to popularize otaku culture, as it looks from outside. But from inside, Japan goverment have something other in their minds, but i dont want to spoil that, only thing I convinced myself to say, as I said in Part 1, is it will be revealed at the end. So our character Shinichi was met with circumstances, in other words, what he have to do. By his side is an maid Myucel (aaah so cute.... i meant KAWAII) what will do everything he want, but she started to be addicted on him, something like she felt in love with him buuuut there will not be any kiss (yes gents, there is no kiss... goddamn!!!). Some scenes are funny, some scenes are something between funny and normal (not too bad actually) and there is not much action sequences. There are a lots of good ideas, like: build a school where Chinichi and others will teach that enthusiastic elves, dwarfs, ware wolfs and humans  of Otaku culture. Soccer between elves and dwarfs etc... There is so much thing that makes this anime so good.                If you made it throught my english to this point... Thanks. But.... there is two goddamn things that wont let Chinichi get laid with girls: 1. That barely teen Majesty Petralka, and, 2. Circumstances...",
            "date": "2016-09-24T14:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 230057,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5713235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ivaaan",
                "username": "Ivaaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=230057"
        },
        {
            "content": "Outbreak Company is one of those anime that has many flaws, but is still very good. It falls into many of the fanservice traps that most harem/comedy anime fall into. Despite this, it has an interesting concept and lovable characters (for the most part.)\r\nOur story starts out in modern Japan, where we learn that a NEET (shut-in) named Kanou Shinichi is looking for a job, and finally finds one that seems too good to be true! He takes an online test about Moe and Otaku culture, and passes it with flying colours. At this point he attends an interview for the anime company that hehas finished applying to and, lucky Shinichi, he gets the job! This is where things get crazy. His new boss has drugged him, and he passes out. When Shinichi reawakens, he’s in a lavish bed and room with the only other person in the room being a maid named Miusel Foaran (or Myusel, depending on the sub group) who we soon learn is a half-elf.\\n\\n\r\nAs it turns out, Shinichi’s new job wasn’t a regular anime company employee, but rather an ambassador to a newly discovered world (or universe, I’m not too picky) and the kingdom of The Holy Eldant Empire, and to improve bonds with it’s citizens and Japan by teaching and promoting Moe and Otaku culture. Hilarity soon ensues with the introduction of a, albeit small, harem, consisting of Petraraca En Eldant III, Miusel, Koganuma Minori, and Erubia Hanaiman. Will our hero be able to successfully spread his culture to the kingdom, or will he be cast out as “The Cultural Invader?” You’ll have to tune in to find out!\\n\\n\r\nFor those of you well versed in romantic comedy, you’ll see that Outbreak Company has many of its archetypes covered. Petraraca being a Tsundere loli character, Miusel being our shy, innocent character (as well as a maid!), Erubia as our happy-go-lucky large-breasted dogirl, and Minori is our yaoi shipper/soldier/tsundere. \\n\\n\r\nAs previously mentioned, I truly enjoyed Outbreak Company, despite the numerous fanservice scenes and “Why on earth would you do/say that, MC?” moments.\\n\\n\r\nNothing in the soundtrack particularly stuck out to me, besides a single track that played during some emotional scenes.\\n\\n\r\nThe ending, however, was less than satisfying. It seems that the writers decided to introduce a problem in the last few episodes just so that they could have a resolution built upon a climax structure. While the show leaves the possibility of a second season open, I highly doubt it happening due to the lack of anything truly different about it, separating Outbreak Company from other fantasy/harem anime.\\n\\n\r\nAll in all, I’d give Outbreak Company a 7.5/10 because of its lack of “oomph” Despite this low critical score; I’d recommend it to any harem/fanservice junkie.\\n\\n\r\nIf you enjoyed this review, please check out my anime review blog at trips-anime-review.tumblr.com/",
            "date": "2014-03-22T15:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 136489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2936623.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/senpizzle",
                "username": "senpizzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=136489"
        },
        {
            "content": "Comedy is, usually, a hit or miss genre for many people. Since there are several different styles of comedy, and several different opinions on exactly which style is the most humorous. Comedy in anime, from what I’ve experienced, usually falls into one of three styles: The slapstick style of comedy, where the humor comes from the clumsy and or stupid decisions and actions made by the characters, the more sarcastic and witty style of comedy, where the humor comes from the characters wit and sharp tongues, and will probably feature a decent amount sarcasm, and, finally, the parody style of comedy, which derives its humorfrom the many references it makes. Usually, those references refer to other anime. Outbreak Company uses the parody style of comedy, a style of comedy that I can’t say I’ve ever been the biggest fan of. Was Outbreak Company’s comedy spot on, or did it just miss the mark?\\n\\n\r\nStory: \\n\\n\r\nThe story revolves around the Shinichi Kanou, a hikkikomori (or shut in) and otaku who, after a period of deep reclusion, has decided to get a get job. After acing an online test, and performing well in his follow up interview, Shinichi was offered a job. Right after accepting the job offer, he is drugged and wakes in an unfamiliar room. He discovers that he’s been transported to an alternate dimension, to new world, by the Japanese government. He has been hired as an ambassador to the Holy Eldant Empire, a kingdom in this new world. His mission is to bring otaku culture, anime, manga, etc., to the Holy Eldant Empire in order to strengthen its relationship with Japan.\\n\\n\r\nAs mentioned earlier, this story is a parody comedy series, and it makes several references to other anime, manga, and other things in otaku culture. The series also pokes fun of, and pays homage to, several anime tropes. These references are not only funny, but they manage to always keep the series interesting. I not only enjoyed the references that Outbreak Company made in its dialogue, but I also liked the more subtle references, such as posters and figures of some of my favorite characters in the background.\\n\\n\r\nWhile this is a comedy series, it actually does have a pretty interesting narrative that touches on several different themes. The story addresses issues like racism, classism, and politics, which makes it that much more entertaining to watch.\\n\\n\r\nUnfortunately, the story doesn’t come to a very satisfying conclusion. While there is an “ending” it still leaves some things unsaid, and some questions unanswered. And the last couple of episodes did feel a little rushed, as they tried to kick the story into high gear.\\n\\n\r\nAnimation: \\n\\n\r\nOutbreak Company’s animation was really well done, with well-defined characters and good-looking background scenery. There are some scenes, specifically some action scenes, that I would’ve liked to actually see the actions taking place, but they decided to just use a shaky background image instead of actually animating it. While the animation isn’t great, it’s definitely good, quality animation.\\n\\n\r\nCharacters:\\n\\n\r\nWhile Shinichi Kanou is the star of Outbreak Company, the series does feature two other main characters, Myucel Foaran, Shinichi’s maid, Petralka Anne Eldante III, the empress of the Holy Eldant Empire, as well as several other supporting characters. Most of the characters in this series suffer from a lack of a proper background story and development, including our main characters. The amount of information we get about each of the characters varies. While some characters will have a fairly detailed backstory, others’ backstories will be only briefly mentioned and explored, if they are ever mentioned at all. Also, while there are some characters that do develop over the course of the series, others tend to either stay the same, or change very little.\\n\\n\r\nWith all of that being said, all of the characters are very likeable and enjoyable to watch. The character’s interactions with one another are also entertaining. The relationships between the characters do have a decent amount of development, and it was entertaining to see how each of the character’s relationships changed over the course of the series.\\n\\n\r\nSound:\\n\\n\r\nOutbreak Company’s soundtrack (OST) is large and varied. It features several orchestral sounding songs, some that are more epic and grand, and others that are more peaceful. The OST also features songs from other genres, from folk sounding pieces to march. It has a good balance of fast and slower paced songs, as well as a good balance between songs that are more grand and complex, and other songs that were incredibly simple. There are also some songs in the OST that are just, for lack of a better word, quirky, but very catchy at the same time. While watching this series the OST can get buried, and you might not even notice how many songs the OST actually has. This isn’t helped by the fact that there are plenty of songs in the OST that sound very similar to one another. But, all in all, Outbreak Company has a very good OST.\\n\\n\r\nEnjoyment:\\n\\n\r\nI had a really fun time watching Outbreak Company. Everything from the funny and interesting references, to poking fun at anime tropes, to the very likeable characters made this series entertaining to watch.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 4/5\\n\\n\r\nAnimation: 3.9/5\\n\\n\r\nCharacters: 3.7/5\\n\\n\r\nSound: 4.2/5\\n\\n\r\nEnjoyment: 4.1/5\\n\\n\r\nVerdict: 4/5\\n\\n\r\nOutbreak Company is a very entreating series, and I would recommend it to anyone who is a fan of anime and or otaku culture.",
            "date": "2015-03-22T14:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 183081,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=183081"
        },
        {
            "content": "Have you ever watched an anime and had that distinguished thought of \"THAT'S what I wan't to do with my life!\" Now I wan't to be an otaku. \r\nThis anime is really good.\r\nThis story introduces a slight feel to it like Spice and Wolf where it teaches you a knowledge of something you may or may not have known about Japanese politics and the Otaku culuture. A boy devoted to being an otaku takes on a new fantasy world, presenting the extravagant anime/manga culture to the Holy Eldant Empire. \r\n The Art is great. This series is not strung around by fan service but yetstill incorporates enough to keep that side of the fans happy. It's bright, beautiful, and keeps the story all the more entertaining. Not to mention, \"Moe.\"\\n\\n\r\n Outbreak Company has a great opening. I can already tell I will start loving an anime right off the bat. An anime with great music enhances the experience.\\n\\n\r\nThe character and subtle romance developments add so much to this flavor. Shinichi isn't dense. There's no greater happiness in my voice that I can scream right now other then, \"Banzai!\" You can clearly tell who has feelings for who during this anime even if it's not blatantly laid out. Every character peaks your interest. There is someone in this anime for everything, be it elves, half-elves, dwarves, humans.... or if lizards are your thing..",
            "date": "2013-12-25T02:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 125471,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1989300.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BentoLegend",
                "username": "BentoLegend"
            },
            "url": "https://myanimelist.net/reviews.php?id=125471"
        },
        {
            "content": "Outbreak company is a wish fulfillment show. There is quite a bit of fanservice. Most of the characters exist to fulfill some sort of fetish. Almost every single troupe popular in the otaku community is utilized and the main hero is a rather useless shut in who saves the day and gains a harem.\r\nSimultaneously Outbreak company provides a parodic meta commentary on the genre of show it stems from, while managing to make allusions to real life issues. The way the main character slowly makes the people of the fantasy world fans of anime/manga goods is something that mirrors the effect those goods have onus foreigners. It also manages to subtly bring up issues of slavery, racism, poverty and imperialism while never putting it on a spotlight.\\n\\n\r\nAll that being said the show is ultimately a dumb wish fulfillment fantasy which consistently manages to be enjoyable. If you want to watch a show from the trapped in another world genre, you might as well watch the one that has some depth.",
            "date": "2017-05-02T12:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 246832,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1365835.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/darkfeatherX",
                "username": "darkfeatherX"
            },
            "url": "https://myanimelist.net/reviews.php?id=246832"
        },
        {
            "content": "Outbreak Company is a wonderful story about love and friendship, differences in cultures, and doing the right thing. \r\nMeet Shinichi, a shut-in otaku who is well-versed in every aspect of otaku culture. While surfing the Internet one day, he applies to join Amu Tech, a company that is looking for someone that fits his description to a \"T\". He lands the job, but wakes up the next day in a different world. He is given the job of General Manager (with a huge salary) and is tasked with introducing and spreading otaku culture to a world with hardly any entertainment and living in a Medieval-likesociety straight out of fantasy fiction. Shinichi must establish friendly relations with the locals, including the young empress, if he has any hopes of getting the job done. Making friends along the way, Shinichi learns more about cultural differences and the repercussions of his and Japan's actions get him into some the occasionally dangerous situation. Outbreak Company is also filled with references to MANY anime, manga, light novels, and visual novels, which will satisfy any otaku. \\n\\n\r\nIf you like ecchi (happens every so often), harem, fantasy stories, taken to another world stories, bits of romance, lots of comedy, the occasional fourth wall break, and otaku culture in general, you'll most likely love this anime. The OP, ED, and OST are all very good and fit the mood well. The voice actors/actresses (Japanese dub) help make the characters enjoyable and match their looks and personalities. The story has a mix of a traditional progressing storyline and slice of life elements that I believe doesn't detract from the enjoyment (some people don't prefer SoL stories, so I feel it's necessary to point this out). \\n\\n\r\nIn the end, Outbreak Company is a great anime and I highly recommend it to ecchi and harem lovers, fantasy lovers, and seasoned anime fans who will recognize and love many of the references and general otaku culture theme.",
            "date": "2016-09-21T19:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 229770,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AKABoy123",
                "username": "AKABoy123"
            },
            "url": "https://myanimelist.net/reviews.php?id=229770"
        },
        {
            "content": "Fun and relaxing comedy anime based in a fantasy setting that tackles the 'Otaku' subject throughout.\r\nAt first you may think this anime is too similar to others in its category and give it a miss, however i recommend you give it a chance.\r\nIt tackles a lot of fairly heavy subjects from politics, governments and rebel factions surprisingly all whilst Shinichi tries to keep both worlds in balance through the incorporation of Anime, Manga and Games.\r\nThe anime is a lot of fun however i do wish they treated the supporting cast with a bit more meaningful screen time where we can learn about them more. \r\nAnexample being 'Erbia' whom i found an interesting character at first and then is almost never used story-wise but instead mainly for fan service. Without given away to much, you will see what i refer to once you start watching.\\n\\n\r\nThe anime contains a lot of supporting members but at best they just fill a specific role and aren't given much of a story. \\n\\n\r\nWhere the Anime lacks in character development (Outside of Shinichi and the main cast) the anime makes up for it with its countless references to Anime, Manga and Games such as 'Da Capo 2' brings it a lot of light heartedness and blends well with the comedy.\\n\\n\r\nI recommend this Anime to anyone who enjoys a fantasy setting with very little combat or detailed story, and instead wants something filled with joy, laughter and light-heartedness. \\n\\n\r\nI personally enjoyed this Anime a lot however can see the further potential that could of been pursued with it.",
            "date": "2016-04-09T07:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 215918,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4755163.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dracosine",
                "username": "Dracosine"
            },
            "url": "https://myanimelist.net/reviews.php?id=215918"
        },
        {
            "content": "Outbreak Company had an iffy start, it started somewhat light-hearted while being extremely generic, but despite that, it managed to have some funny scenes here and there. The comedy of this series is one of the few good points about it, if not the only one.\r\nThe iffy start wasn't only because that the show is generic, but also the fact that it executes drama extremely poorly, or at least something that was meant to be drama.  \r\nThe first time that we see this is in episode 3, where some drama happened and the results were the following. Character A was stabbed defending character B,leading to character B changing the way that she perceived character A. This was all done with the light-hearted theme presented at the beginning of the series and some comedy scenes here and there. Yes, someone got injured but all while having comedy. Which I honestly couldn't care less about either the drama or comedy since it isn’t funny when someone is getting stabbed and isn’t sad when you have a character pushing his face against a woman breasts while being kidnapped and on a life of death situation, all while the woman is moaning. Which is really bad since the comedy is the strong point of this series.\\n\\n\r\nThe second time and last one that we see this is on the last 2 episodes of the series, where after multiples episodes of extremely absurd comedy we get a drama arc. But again, all while being light-hearted and trying to be funny. I won’t go into details about what happened but it was the same exact thing that happened in the beginning drama arc of the series. Drama and comedy altogether. Why wouldn’t work? \\n\\n\r\nThink about this. You are with some people in a life or death situation and from nowhere someone goes and tells a joke. Would you find it funny? I at least wouldn’t. But that’s me, when it exists actual consequences I can’t find it funny. And this series goes and tell us that it indeed it exists consequences, but continues with the comedy and give us absurd situations while something is at stake and that’s why in my opinion it doesn’t work.\\n\\n\r\nWhile I do think that the drama of Outbreak Company is horrible, on the other hand, I do think that the comedy is great. I mean, a 10 years old dwarf with beard attending school and learning hardcore Otaku terms like “Haitenai” is something that I will never forget for the rest of my life. (Which btw is when a female character might not be wearing anything underneath her skirt, but keep in mind that whether she’s actually wearing any or not doesn’t matter).\\n\r\nThe show also makes a lot of references to another anime, which in my opinion is quite funny if you know what they are making references to.\\n\\n\r\nThat’s the type of comedy that this series uses most of the time. Absurd situations, that are only available because of the medieval/magic world that they are. And I do think that it made good use of that for the comedy.\\n\\n\r\nAnd that’s it. It actually had more good episodes than bad ones, but the bad ones were awful. Making this a series that I would never recommend and one when I look back at it will only think of how good it could have been. That said, overall I did enjoy the anime and that’s why I gave it a 6 out of 10 (Fine).\\n\\n\r\nWith that, I conclude my review. If you are looking for an anime that it never takes itself seriously, even when it does, I recommend this series since the comedy is pretty good and despite the plot being complete nonsense, it is an enjoyable anime.\\n",
            "date": "2017-05-17T12:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 247930,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3518119.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/pmf96",
                "username": "pmf96"
            },
            "url": "https://myanimelist.net/reviews.php?id=247930"
        },
        {
            "content": "This review may contain spoilers. Read at your own risk.\r\nImagine we somehow make contact with another world. Imagine you'd like to show the natives of this world a part of our own world's culture, to show that we're friendly. I'm pretty sure \"Otaku Culture\" wouldn't be that high on anyone's list, but it was on this anime! Somehow! This anime's plot is incredibly meta in such a way that it's so bad it loops back around to be somewhat good. The first few episodes will make anyone critically analyzing the anime pull their hairs out from the unbelievably brain-dead lines delivered and plot points. Someof them don't even make that much sense at all. Why would the government want a complete Otaku shut-in to be the ambassador of a whole new alternate world? It even differs completely in that trope: the Main Character doesn't die and get sent to a new fantasy world, or get any magical powers or mystical relics, they aren't anyone of consequence at all, they're literally just a nobody that got brought by the government in order to... spread Otaku Culture to a world that's still on the very beginnings of Medieval Europe with added Magic and fantasy races, such as Elves and Dwarves. There IS a semi-logical reason for this, but it's kept to the very end of the season. Which in of itself is where the main plot actually gets interesting. The beginning of the season was rather dull, overusing Isekai tropes and mixing in a sort of fabricated value to Otaku Culture. It's only in the last 4-5 episodes of the season where things actually take a very interesting and deep turn. Of course, being the finale, there's really not much to go on, but those last episodes really did feel like they were starting to build a truly unique world for the story. Should there ever be a 2nd season, if they somehow manage to expand on that initial world building, it could turn into a somehow decent isekai to watch. But right now, the only message this anime gets across is \"Otaku Culture! Yay! These are references to Otaku Culture things! Enjoy Verbaloid, Destiny/Remain Evening, Blade Art Online, among others! Go Otaku and you too can meet busty Elf Girls in another world! All sponsored by your government!\". It really doesn't go any higher than a brittle base of it's cast, story and setting and that really hampers whatever potential this anime could even begin to have. It's not the worst isekai, but I'm not going to say that it's even near being the best. More like a medium-bad than anything else. You can go ahead and watch it if there's really nothing else to do, but don't go in expecting something revolutionary.",
            "date": "2019-03-13T22:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 303479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2572185.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Mezzo_Vitae",
                "username": "Mezzo_Vitae"
            },
            "url": "https://myanimelist.net/reviews.php?id=303479"
        },
        {
            "content": "So I would guess that my opinion is quite similar to a lot of other people. I feel most of the story was quite good. The comedy was very entertaining, the characters were refreshing, and the art wasn't bad. But just as all good things must come to an end, the end for this show was a little earlier than I was hoping for. Up until episode ten I was very entertained and the story wasn't super generic. However, the last two episodes were terrible. The ending was rushed, and was so cringey. Most of the show was very funny, but the ending hadno comedy and it almost felt as though the writers changed. I would honestly recommend this show, but not for the story. Se ya next time",
            "date": "2019-02-28T20:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 302657,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7510928.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jknightkt22",
                "username": "jknightkt22"
            },
            "url": "https://myanimelist.net/reviews.php?id=302657"
        }
    ],
    [
        {
            "content": "The most typical shut-in you'll get\r\nOnce filled out a survey on the net\r\nHis remarkable score\r\nOpened up a new door\r\nAnd then his new employment was set\r\nSo then after the following night\r\nWhat awaited him gave quite a fright\r\nAs he opened his eyes\r\nHe was seeing new skies\r\nIn a new world, a marvelous sight\r\nHe'd been sent to this realm on a quest\r\nThat would put all his skills to the test\r\nAbout culture he'd preach\r\nAbout manga he'd teach\r\nHe'd explain how Moe is the best\r\nBy his side was a beautiful maid\r\nWho would do anything that he bade\r\nBut the Tsundere Queen\r\nWho was barely a teen\r\nWould at all costs not let him get laid\r\nThena school was established one day\\n\r\nWhere the lessons all looked more like play\\n\r\nBut the Dwarves and the Elves\\n\r\nStarted fighting themselves\\n\r\nOver which was the best eroge\\n\\n\r\nSo the culture was rapidly spread\\n\r\nBut a problem came up in its stead\\n\r\nWho could ever have guessed\\n\r\nThey would all be obsessed\\n\r\nAnd read manga until they'd be dead\\n\\n\r\nIn the end all that matters is this:\\n\r\nIt's a truth you can never dismiss;\\n\r\nSimply no matter what\\n\r\nEnds up happening or not\\n\r\nThe Otaku culture is a bliss!",
            "date": "2013-12-20T10:12:00+00:00",
            "helpful_count": 1242,
            "mal_id": 124763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=124763"
        },
        {
            "content": "This whole anime can be summed up by the lyrics of one of the songs that comes from Outbreak Company.  \"DA. DA DA DA DIN DIN DA DA DA\"\r\nStory: 7\r\nThis anime is a clash of modern day Japan with a fantasy land that has knights, dragons, a loli ruler, elves, dwarfs and dragons.  Just imagine a brighter version of LOTR.  We follow Shinchi as he has to spread otaku culture (Anime and Manga) throughout the lands of Eldant.  That is pretty much the show....\r\nThe pacing of Outbreak Company was fine up until the final two episodes, which the pacing felt toofast as they tried cramming in a lot of seriousness that the other ten episodes lacked.  The ten episodes lacking seriousness wasn't a bad thing, the show was doing a great job with those episodes, but the last two rushed into drama and seriousness.  \\n\\n\r\nArt: 9\\n\r\nArt was great! Something I found enjoyable were all the references to other shows through background art such as a parody poster of Hataraku Maou-sama.    \\n\\n\r\nScenery was amazing as well they made medieval times look happy and splendid.  Castle, fields, mountains, the whole thing was pretty to look at.  \\n\\n\r\nCharacter designs weren't outstanding, but unique enough to separate characters and make them memorable.  \\n\\n\r\nSound: 10\\n\r\nIn my opinion, Univer Page, the OP of Outbreak Company is my favorite song to come out of this fall season of anime.  It is so cheery and the way the song starts, eargasm.  Watashi no Houseibako, the ED of Outbreak Company is a very soothing song and very good to listen to while running.  Both songs give off the vibe that the whole anime is trying to do, make the person watching this very happy.  \\n\\n\r\nThe background music does a great job at carrying the mood, with a very unique song that is used during comical parts, I already quoted the lyrics of it in the beginning of this review.  \\n\\n\r\nCharacter: 8\\n\r\nCharacters are given enough depth to make the memorable, and distinguishable.  This is good since my first impression after looking at the OP was that characters would be easy to mix up.  Character development was great, everyone had development outside of being interested in manga or anime.  \\n\\n\r\nThe only problem I had was the random characters added halfway through, the dwarf and the elf.  These two were added to the story and I was assuming for them to have a pretty big role for upcoming events, but nothing really happened involving them.  \\n\\n\r\nEnjoyment: 8\\n\r\nThis anime was enjoyable because of the otaku humor.  I found humor based around references and other things anime and manga hilarious.  Multiple scenes I have laughed, and the soundtrack makes it even funnier.  I also really enjoyed the one part of seriousness they did in the last episode, the only time this series did the serious business right, which makes the last two episodes worth it.\\n\\n\r\nOverall: 8\\n\r\nGreat anime for the fall season with an amazing soundtrack.  I will be listening to Univer Page for a long time to come, especially when I need a pick me up.\\n\\n",
            "date": "2013-12-27T08:34:00+00:00",
            "helpful_count": 146,
            "mal_id": 125837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686267.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zelot",
                "username": "Zelot"
            },
            "url": "https://myanimelist.net/reviews.php?id=125837"
        },
        {
            "content": "Whoever thought being an otaku can come with so many responsibilities? For Shinchi Kano, his responsibilities just skyrocketed after being set up and sent to a fantasy world. Sounds fun right? Wrong. It seems that some higher powers wants this young boy to spread the otaku culture and expands the Japanese culture in their world like never ever before. Being otaku is often considered a negative influence due to its pure nature. But in Outbreak Company, it plays on different trope. In fact, it’s being an otaku that allowed Shinichi to gain stardom in this new world where his life changes forever. \r\nOutbreak Company isan animated series based off the light novel of the same name written by Ichiro Sakaki. The full title of the series is actually Outbreak Company: The Moe Invader that emphasizes the spread of Japanese culture as an allusion to “invasion”. Shinichi plays the role of the main character and otaku life becomes a pivotal role in shaping such a fantasy world. It almost feels like a dream for Shinichi but that might not seem to be as easy as he thinks. Shinchi quickly realizes that he gets more than what he bargained. It’s an otaku’s wet dream coming true.\\n\\n\r\nThe story of Outbreak Company is quite simple. Shinichi is your average high school boy whom has a crush on a girl. After rejection, he tries to find a way to replace that deep hole in his life. Becoming an otaku isn’t exactly the best way to get over a rejection but he chooses anyways. After he does manage to get a job, it’s here where we find out his in-depth knowledge about various anime, manga, and Japanese culture. In many ways, the show takes this idea and twists it around in a way that is fun and entertaining. The fact that Shinichi plays the role of an otaku can be stereotyped as a boy who spent a lot of time in front of the TV. And in fact, he does but not only in front of a television but also on the web with his knowledge of various anime/manga and even eroge. \\n\\n\r\nAs this series plays fun with the otaku culture, there should be unsuspectingly a lot of references to various anime and manga. Almost every episode has posters or merchandise from other popular animated series with modified artwork. It also makes fun of the otaku culture by having the main male protagonist become a type of instructor to his students. His way of teaching can seem absurd but he has fun with it. His students also seems to enjoy his teaching methods despite its obscenity on several occasions as the product he tries to present tends to be any otaku’s wet dream.  \\n\\n\r\nPart of that dreams comes with a package including an adorable maid named Myucel Foaran. She plays the role of a typical maid with an addition of elf ears and overly politeness. As one of the most innocent characters in the series, she always puts others above herself. This is proven later on when her friends’ lives are in danger. Her action speaks louder than words as she faces on danger straight ahead rather than looking back. But besides her gentleness, Myucel is able to make friends and her relationship with Shinichi is one of the more dynamic pairs of this show. For starters, Shinichi originally sees her as a fantasy fulfillment come true. After all, Myucel refers Shinichi as her master. Surprisingly enough, Shinichi doesn’t abuse or treat her indiscriminately but instead befriends her as if she is a human being. He even goes as far as to teach her about the otaku culture as well as Japanese language. It’s an odd relationship as Myucel is constantly trying to please him and apologizes for any behavior she interprets as misdeed. Surprisingly she is a girl not to be underestimated. Mycuel has astonishing skills in magic and fighting capabilities that can accomplish superhuman feats. Like an old saying goes, “dynamites comes in little packages”.\\n\\n\r\nThroughout his time there, Shinichi also gets involved with other affairs. This includes his encounter with the monarch of the Eldant Empire, Petralka Anne Eldant III. Unlike Mycuel, she represents more of a brat that is initially seen as selfish, stubborn, and only wants things to go her way. She is the perfect example of how an immature child would behave like despite her similar age to Shinichi. But because Shinichi seems to the first person to stand up against her status, she takes an interest him. This lands a “rivalry” with Mycuel as she sees her as competition. This competition often comes as a backlash and jealousy against Mycuel because Petralka sees her getting in the way. At first, it might seems harmless but there are various times when the tension gets heated and Shinichi has to step in to settle the bounds. Later on though, she learns a bit more from her mistakes and starts treating Mycuel with more respect due to certain reasons. \\n\\n\r\nThe trio of these characters makes up the main course of the series but to other characters do come into play with their parts. Most of these characters are direct parodies to the culture of anime such as Minori, a woman with a fujoshi fetish. She is also an otaku and often formulates absurd fantasies in her head with BL tones. Bulk, a lizard man, is designed to fit the role of a fantasy beast but with surprisingly gentle nature. Then, there are also the half-elves, wolf girl species, and even dwarves who doesn't match their age.\\n\\n\r\nI wouldn’t say this series fits within the drama category but there is certainly a lot of tension going on throughout various parts of the show. Among some of the tensions includes a rivalry between the races of elves and dwarves. They have contrasting views on Japanese culture that often results in insults thrown back and forth with nitpickery debates, This is even presented in a more extreme case when both sides decides to settle it in a sports competition to see which side is more dominate. More importantly is the fact that humans are treated as seemingly superior beings. Fortunately, Shinichi often plays the role of a normal human boy and doesn’t take advantage of certain situations.\\n\\n\r\nDespite the fun that Outbreak Company throughout each episode, there are various problems with the show that can turn viewers away. The initial premise itself might cause some heads to turn. After all, the theme of a human being sent to another fantasy world to help others isn’t exactly a new idea. Series such as Dog Days, Problem Children, Familiar of Zero, and Ixion DT also plays on these tropes. Shinichi’s initial introduction can be viewed as a clichéd and stereotypical character as comparable to harem leads. Although he doesn’t technically have a harem, Shinichi is oblivious to the female characters around him. Shinichi does have the behavior of a typical harem lead though with the typical nosebleed upon witnessing any beautiful character of the opposite sex and getting excited about a loli (Petralka) during their first initial meeting. Speaking of Petralka, her tsundere personality can also be hard to endure on various occasions with her constant bickering. The way she treats others (especially Mycuel) is based on greed and jealousy like a spoiled child that can be frustrating to watch. Some of the other characters’ races also makes little sense with dwarves’ ages, the werewolf girl that hardly resembles what she looks like, or the repetitive BL gags. Unlike Genshiken, there’s hardly any realism to it but rather just played out as a ridiculous and senseless fantasy. Finally, the story itself jumps around a bit. Shinichi might be the main focus of the show but some episodes’ ideas becomes larger than himself. There’s no any ongoing plot or arcs but mainly focuses on its main theme of otaku culture spreading. If you get bored of this type of theme then this show will likely not be for you.\\n\\n\r\nArtistic wise, Outbreak Company brings out the fantasy to its greatness with its character designs. Shinichi is probably the only main character designed with human characteristics. Almost every other recurring character has bits of a fantasy touch added to them like Myucel’s elf years, Petralka’s overly made dress, Galious’ knight armor, or Elvia’s wolf-like ears/tail. The castle that Shinichi is bought upon also gives a feeling of fantasy with its internal design. The landscape outside is absent of technology but instead is replaced with fantastical architecture and nature. Feel (Da Capo, Fortune Arterial, Nagasarete Airantou) are known for their production in series involving fantasy/supernatural elements. For Outbreak Company, they definitely delivered a handy dandy job. \\n\\n\r\nSound production might seem off balance a bit. The comedic scenes has an odd theme played most times when there are awkward moments. Because this show isn’t about magical sword fighting, there’s a minimal amount of intense OST. Instead, they are replace with lighthearted soundtrack that tends to bring out a more fun side of Outbreak Company; namely the tone of the ‘Da, da, da’. The OP song “Univer Page” by Suzuko Mimori matches its style quite well with its fantasy elements. The same applies for the ED song that brings out fantasy to a level of credibility. Shinichi’s voice also is performed well that ranges from his otaku craziness to his occasionally maturity during appropriate moments. Regrettably, I find Petralka’s voice to be a sting to my ears that symbolizes the tsundere that she is. As a girl with a bratty voice, I find it not just annoying but also the fact that she herself seems to not even notice it.\\n\\n\r\nSo, how do you plan to watch Outbreak Company? If you’re in for some fun, then definitely watch it that way because this show is floured with silliness. But if engaging story is a factor you’re more interested, then this show could be quite a disappointment. Instead of a deep story with complex elements, Outbreak Company likes to make more fun of the typical otaku culture and community. With an outbreak of references to anime and manga, expect many ideas to be wheeled in from your favorite series. The main character Shinichi can also take quite a bit of time to get used to and some people might not like him even until the very end. With its silly premise comes a long way to bring about the otaku culture in story form and I think this show pulled it off in the right direction. Outbreak Company will bring forth a charming experience of the otaku culture where you’ll learn more than meets the eye.\\n",
            "date": "2013-12-19T20:30:00+00:00",
            "helpful_count": 60,
            "mal_id": 124681,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=124681"
        },
        {
            "content": "Outbreak Company\r\nI didn't know what to expect from this anime, and i was not going to watch it but i decided to give it a try, i'm glad i did because it was funny.\r\nStroy\r\nThe story is about bringing Japanese culture, name it VN games, anime, manga and other things to a fantasy world that the goverment discovered, so that's why our protagonist is sent to this place, because he has the knowdlege of all this things, Shinichi will learn how different this fantasy world is. The thing is that everything was well paced until the last 3 or 2 episodes where they throw a lotof content too fast and too much for two episodes, so it was good.\\n\\n\r\nArt & Animation\\n\r\nThe art style was great, the animation was great, and the references from other animes was enjoyable, the characters were a little simple but still well made.\\n\\n\r\nSound\\n\r\nThe sound was very good, the OP and ED song were great and it matched the theme of the anime, the songs in the comedy parts made it even funnier, overall was very good.\\n\\n\r\nCharacter\\n\r\nThe characters were unique and they were really memorable and were developed deeply enough to know them.\\n\r\n-Shinichi was funny and he was likeable and his facial expression were hilarious, specially his poker face.\\n\r\n-Petrarka was annoying at first but she is more kind later on and more likeable.\\n\r\n-Myucel was my fav. i loved everything about her and she was so sweet and light hearted and i felt she was though for going through hell for being an elf and how they are considered a low class and only serves as militaries.\\n\r\nOverall the characters were very good and very funny.\\n\\n\r\nEnjoyment\\n\r\nThe humor this had to offer was great and the songs were even funnier, the references to other animes were enjoyable.",
            "date": "2015-08-07T12:54:00+00:00",
            "helpful_count": 45,
            "mal_id": 195440,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195440"
        },
        {
            "content": "This anime is the ultimate anime lover's dream. I'm just going to start this review by saying that I have a thing for anime that has a message that I can take away from it. Right off the bat, we have Shinichi, a bro that honestly reminds me of a couple of my friends who just sit and watch anime and read manga all day. In the beginning, we see Sinichi's bad luck set in when he gets kidnapped and brought to some foreign world that has magic and loves Japanese otaku culture. Shinichi is brought in to educate this new world of his otakuculture and to ensure that relations between said world and Japan are good. He starts a school where they teach anime and manga that right away challenges racism and class diversity between the elves and the dwarves. His school does more for these students than teach them to be otakus - it teaches them to live beyond their differences and be friends with each other despite their origins and differences. Soon they begin to have arguments about lolis and eroge games rather than fighting because they are dwarves or elves. I thought that this was absolutely beautiful and it reminded me a great deal of Maouyuu, which is another one of my favorite shows with similar themes.\\n\\n\r\nThe next character that we meet is Miusel, who is my favorite character in the entire show. Miusel presents herself to Shinichi and tells him that she will be the maid taking care of him while he stays in the Eldant empire. As soon as Shinichi sees Miusel, he freaks out at the fact that she is a legitimate maid. This is the thing that I love about Shinichi: Miusel freaks out the moment that he discovers that she is a half-elf, which is something that the citizens in Eldant discriminate against her for, and instead thinks the fact that she is an elf is awesome. This is one of the things that I love Shinichi for: he doesn't discriminate against race, gender, or background because he remembers being outcast because he was an otaku. Miusel at this point I believe begins to fall in love with Shinichi, which wasn't something that the plot synopsis and the genres really talk about.\\n\\n\r\nThe next character you meet is Petralka, the supreme ruler of Eldant that nearly kills Shinichi when he calls her a little girl. Right off the bat, she takes a liking for Shinichi and develops a sort of tsundere personality that really compliments Miusel's personality. As the show progresses, Shinichi helps change her personality for the better with his otaku ways and even helps her become a better leader. I love the idea that a normal person with the right beliefs and intentions can help change those who have a different social class or background than them.\\n\\n\r\nAlright, so for those of you who don't want something as deep or psychologically stimulating as this, this show is very lighthearted and is quite hilarious. I don't have many friends who enjoy anime with deep meaning because most of them don't think about stuff like this like I do. That is perfectly fine and I still think you will love this show if you give it a chance. I would even go as far as saying that this anime is deserving a spot on my top ten anime of the year. So stop reading this and go watch it now!",
            "date": "2014-05-08T15:18:00+00:00",
            "helpful_count": 29,
            "mal_id": 142717,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1511593.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ThatsSoWitty",
                "username": "ThatsSoWitty"
            },
            "url": "https://myanimelist.net/reviews.php?id=142717"
        },
        {
            "content": "At the beginning of this fall anime season, I wasn’t planning on watching Outbreak Company. The synopsis for this anime wasn’t anything exciting nor was it intriguing. However, I decided to watch it anyway, for it was on Crunchyroll and there weren’t too many other anime I was hyped for this fall. After this show finished airing and I finished watching, I, unfortunately felt like I had wasted my time, tuning into this show every Sunday.\r\nFor the most part, the plot of Outbreak Company is nothing special. Our protagonist, Kanou Shinichi, is a reject who hides in his house all day. The reason forthis is silly, but we can’t blame Outbreak Company for it because it was clearly meant to be a parody anime and you can tell right from the beginning.  The show then immediately tosses Shinichi into a fantasy realm (the Eldant Empire) in which he unintentionally starts developing a harem. The harem part was a strange inclusion, as the beginning of this show led me to believe this would be a romantic comedy. Outbreak Co. is, indeed, a comedy, but it occasionally attempts to be serious and it fails miserably. It has plenty of ecchi elements and fits the definition of harem very well, which prevents it from blending well with “plot.” This could direct the focus of the anime towards comedy, but it may bother you when the show tries to be serious.\\n\\n\r\nThankfully, Outbreak Co. does try to be funny for the majority of the time and that is what you should expect when jumping into this anime. Much to the chagrin of many, however, the jokes in this show heavily rely on references and parody. This is awful for new viewers of anime and non-hardcore viewers because it’s hard to understand the jokes without prior knowledge or thorough research. Either that or the show throws around cultural-specific Japaneses terms so it can create a gag that might last until the end of the current episode. Comedy is really all this show has going for it, yet the entirety of Outbreak Co. involves Shinichi trying to teach the residents of the Eldant Empire about “Otaku Culture,” which creates comedy that, again, alienates new viewers. Don’t watch this anime for the plot, and only for the comedy if you’re a hardcore anime lover, or for some reason, striving to be one.\\n\\n\r\nThe animation is fine. Though, like many anime today, the art style makes everything shiny (hair, vehicles, skin, etc.). If you watch for a long time, your head may start to hurt. Don’t marathon this anime; not that I would recommend it otherwise. I do like how fantasy elements, such as dragons and magic are drawn, however. There’s also some ecchi so that might also be a reason to avoid Outbreak Co. By the way, every character tends to have this lower case u-shaped smile as their “default expression.” That annoyed me and may annoy you.\\n\\n\r\nI have no complaints with the audio for the anime. The music was fine. The opening and ending may be sort of catchy, but nothing exceptional. I do have a problem with a lot of the dialogue from the characters Shinichi and Myucel, but that is more of an issue with the story, or characters. The voice actors could annoy you since their character roles are all generic archetypes, but they’re bearable, at least to me.\\n\\n\r\nThe characters are what really and truly mitigate my enjoyment for this anime. Outbreak Co. does what many anime do and builds characters directly from unadulterated tropes. I can summarize my problems with the characters in one sentence: Everyone is unoriginal and possibly so annoying that it’s lethal. The unoriginal characters may not be an issue especially if you anticipate the harem aspect. Plenty of harems are not plot-driven, or very much creative, but they can back-up their quality with comedy, or even quirkiness. Outbreak Co. does not have this leisure and it worsens because of Shinichi and his gang. All the people (and even other creatures) are absolutely obsessed with anime and manga. This could actually be funny if: 1. the show could allow people not familiar with Otaku culture to get its references, 2. not make it seem perfectly reasonable that their obsession does not hinder their work. Shinichi takes every single chance he gets to boost his ego by acting like mister smarty-pants when it comes to “Otaku Culture,” Myucel misunderstand every statement that may be misunderstood, and Petralka acts like a more serious person than she actually is (considering she looks like a little girl). These traits could allow these characters to be hilarious, but the awful dialogue and unfortunate combination of mediocre setting and bad character interactions prevents this. An example being: the show doesn’t alert us when it changes its tone effectively, so we don’t know if dialogue is supposed to be serious or comedic.\\n\\n\r\nTo be as frank as possible, the only reason this show is bad is because of the references that are 90% of this show. It actually isn’t so much that they’re hard to get, but more that they’re omnipresent. Without that problem, high points of Outbreak Co. are salvageable. Though, since it’s included, this anime becomes incredibly hard to enjoy. It’s quite possible for you to enjoy it if you are a hardcore anime viewer. I wouldn’t personally call myself that. The show is obviously made in Japan and therefore targeted toward Japanese viewers, but some of the issues I brought up may prevent you from enjoying it even if you live in Japan.\\n\\n\r\nYou should definitely avoid Outbreak Company entirely. Unless you are an anime enthusiast, it is distracting that every joke in this anime tends to rely on references to other media, or certain cultural elements. It also seems to want to parody, but never goes full force with it. Even if you get all the references, they’re more amusing than funny, and the bad character design and lack of proper storytelling doesn’t give Outbreak Co. much merit. Don’t expect depth from anything in this show and expect a lot of annoying characters as well as the lack of common sense that would be funny if done properly. I wouldn’t say Outbreak Company is a terrible show, but it limits its audience and it tries a little too hard to be what it is not.\\n\\n\r\n4/10",
            "date": "2014-01-02T17:19:00+00:00",
            "helpful_count": 18,
            "mal_id": 126879,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2813025.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ar2000",
                "username": "ar2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=126879"
        },
        {
            "content": "Outbreak Company is a very enjoyable anime to watch. It's one of those series that can have a positive effect on your mood when you're tired and frustrated.\r\nStory: 7\r\nThe story is a bit original, for me at least. Never before have I seen an anime where the main character actually exports the whole otaku culture. It's pretty fun how they implemented this general idea and having such a short amount of time to provide the viewers with enough details/explanations as to why and how this is happening they did a pretty good job.\r\nIn no case you should expect an anime with no holes or arbitrarystories but rest assured assured that the end result is quite enjoyable.\\n\\n\r\nArt : 9\\n\\n\r\nThe art was extremely good, especially when you take into account that it's only 12 episodes. The artist team really did their best to create a very appealing world and beautiful characters. Of course they did not have to wander off into unknown territory and that made their work a bit easier. The races and tribes that reside in this parallel universe are the usual suspects (elfs, dwarfs, humans etc.).That being said the outcome was exceptional. \\n\\n\r\nSound : 6\\n\\n\r\nThe soundtrack could have been better. It seemed that not enough thought was given to the music for this anime. I can not say that it was bad but it was nothing memorable either. In some cases the soundtrack did not complement the scenes and in others it seemed to be perfect. Overall a decent result in regards to music but it had ample room to improve.\\n\\n\r\nCharacter : 8\\n\\n\r\nMost characters were very good although there was a great inequality of available information for some of them (mostly supporting characters). The main protagonist is a hardcore otaku and a hikikomori. Fortunately enough the story explains as to how this came to be. The supporting characters as I stated earlier suffer inequalities between one another since there are some where the viewer knows their background story and others where the flow information is limited at best. As a huge fan of anime I was able to extrapolate certain things from the characters based on their behavior since the maintained a classic character pattern. There is your loli, your BL Pervert, your timid maid and other usual characters. in essence all of them quite good for this type of series.\\n\\n\r\nEnjoyment & Overall : 7\\n\\n\r\nThis anime series was quite enjoyable, easy and fun to watch with no complex story lines or difficult character plots. It is what you would expect from a 12 episode series. I would recommend it to everyone who want to relax watching something fun and easy.",
            "date": "2014-05-06T04:39:00+00:00",
            "helpful_count": 16,
            "mal_id": 142489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=142489"
        },
        {
            "content": "Story: So its a pretty much a every day life for Kanou he basically loves anime, manga and video games than one day take (what i think at least) to be a survey or test for a company soon after seeing Matoba about the job he ends up getting druged and than transport ported to a world called (sorry i forget the place) but when he wakes up to see a maid and also the fact she is a half-elf maid serving him so basically after meeting the princess among others he was sent there to bring there you'd think he would be there ona quest or something like that but nope his task is to bring anime, manga and games to thrive there in the world and that is pretty much his task to bring MOE in this world but he'll also have to deal with certain stuff as well in the world that might be troubling.\\n\\n\r\nArt: the art in this is really well done from the background to the magic that is showing in the anime to character design as well.\\n\\n\r\nSound: the Op is actually pretty decent i liked it after a little awhile as for the Ed eh personally didn't care for it that much also i watched the dub for this anime and i gotta say everyone did a really good job for the dub.\\n\\n\r\nCharacter:  Shinichi is the main person of the anime is a total shut-in but also loves anime, manga and games but he does have a very likeable and nice personality honestly he is a very nice and total cool character for the anime. Myucel is another main character and well she is the maid to Shinichi and his really loyal to him being she is her maid she is easily a likeable character other than that she is a very nice and sweet through the anime. Petralka Anne Eldante III is the last main of the anime and she is the princess to her land she had to take it over (im not gonna spoil why watch the anime to find out why) and she makes sure Shinichi is doing good and what not with his quest to make sure the anime and stuff go good otherwise she can be a angry one at first but later on she opens up and what not pretty good character. Elbia is a supporting character (honestly she should be a main not a supporting one) she is pretty much a wolf and she likes to draw a way of keeping her animal instincts from kicking in she is a pretty nice and and again sweet character like most in the anime. Minori is another supporting character (again like Elbia she should be a main character not supporting) she is the bodyguard to Shinichi and well she does have a thing for boys love and stuff of that nature but otherwise again another likeable character that i liked like the ones here.\\n\\n\r\nEnjoyment: Things that i liked: this anime loved a lot from the characters that i actually liked all of them also that that comedy wasn't great at first but man did it get really funny from there one was a damn funny anime also that the art and sound for the anime was really good and not bad at all everything almost about this anime was good. Things that i didn't like: ill admit like another people for some odd reason the anime starts to get really tense around episode 11-12 which is kinda odd would think maybe that had to rush those 2 out or the story out to get it in (would say episode 3 is tense but yeah) but not a major problem for me.\\n\\n\r\nOverall: im gonna give this a 8 would almost give this a 8.5 to be honest the anime is actually really good from the comedy being really well done and just being really damn funny from the art looking really good and the sound being good also that all the characters are all really good here easily a anime worth the watch for sure.",
            "date": "2017-10-18T22:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 261159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=261159"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nAnime is a medium that is normally looked down upon. Filled with sexualized women, crazy plots, and enough cute little girls to open up a daycare, the culture it has created is definitely unique. It is with this in mind that Outbreak Company aims to look at with a more satirical view in mind.\r\nSTORY\r\nOur story begins with Shinichi, a young guy who, upon scoring a perfect on the \"otaku test\", has been accepted as the new GM of AmuTec. This company's main directive? Apply otaku culture to the newly discovered kingdom of Eldant.\r\nSounds pretty crazy, right? To behonest, it is. Most shows and society look down upon otaku culture (mostly meaning obsession with anime/manga/games). But Outbreak Company takes a positive twist on this idea. The majority of the show actually focuses and explains the different lifestyles, phrases, and mannerisms of otaku. Do you want to know how to be an hikikomori? It has you covered. Don't know certain BL terms? Done. Need definitions for what it means to be \"moe\" and \"tsundere\"? Easy as pie. The show is rife with the culture it intends to parody, and for all intents and purposes (read here as \"as far as I know\"), it does this quite nicely.\\n\\n\r\nThe show's main focus is depicting a world that has never been exposed to something of this magnitude before. Essentially, the people of Eldant are like us before we were ever introduced to anime. They learn about popular shows, what to look out for in manga, and which games are rare to find. But this show is a comedy, and more specifically a parody. It doesn't take itself too seriously (most of the time). I found the comedy itself to be good. By playing off the idea that otaku culture is actually something to strive for, it gives us these situations that wouldn't normally be possible. And because of that, you are laughing a lot at what these people are doing.\\n\\n\r\nMore comedy also stems from the characters. They themselves are also pretty generic, but that's the point. By representing a role from anime, you understand what that character is attempting to portray or at the very least poke fun at.\\n\\n\r\nBecause the comedy works so well, when the show does get into more dramatic territory, it feels rather shallow. In other words, weak. OC is at its best when it is making fun of the otaku culture and the comedy in general. A lot of the dire moments only last for an episode (or even half of one), so they don't feel particularly influential in the long run.\\n\\n\r\nAnother problem with the show is the kingdom of Eldant. I felt a distinct lack of development on its world-building. I never really felt as if I was experiencing this new world. Instead, it felt like any other countryside. I feel as if the show should have done some more exploration into its people and original culture before attempting to instantiate a new one. Perhaps this is due to the pacing of the show, which seems a tad bit too quick for its own good.\\n\\n\r\nANIMATION\\n\\n\r\nOutbreak Company's art style is actually rather pretty, if not a little bit strange. All of the characters have this \"shine\" to them that makes it look as if they took a bath in some oil beforehand. It isn't really a turn-off, just that they seemed to always be glowing.\\n\\n\r\nThe animation itself is a slight problem. To be honest, it was never too stellar, and when it had the chance to be, such as during the soccer match or during certain dire moments, they usually opted for off-screen happenings or repeated use of the same animated sequence.\\n\\n\r\nAs for the character designs, I actually quite liked them. In particular, Myucel's and Petralka's designs were quite nice. The same can be said for Romilda. I would have liked to have seen more racial variety besides just the dwarves and the elves, but perhaps that is just wishful thinking.\\n\\n\r\nCHARACTERS\\n\\n\r\nIt is best to keep in mind that the characters for OC are meant to parody the common tropes of otaku culture. That being said, I still liked the majority of them.\\n\\n\r\nMy favorite by far was Myucel. She has a small bit of back-story to her, but she personifies cuteness, and her actions are without a doubt too adorable to not put a smile on your face constantly. Seriously, she is so \"moe\" that it is impossible not to like her.\\n\\n\r\nPetralka somewhat represents the \"tsundere\" type. She acts authoritatively and loudly around Shinichi, but it becomes clear early on that her affection towards him is more than just royalty and ambassador. One of her funniest moments is definitely at attempting to be the character arch-type she is parodying, but she always provided good laughs because she could read Shinichi oh so well.\\n\\n\r\nSpeaking of the MC, Shinichi himself is the final character of note. Unlike other main protagonists, he is not dense. He understands the situations he gets put in, how the people around him act, and what the outcome of certain situations would be. He is smart, kind, and honest. He isn't afraid to speak his mind, and because of his otaku nature, he also provided some of the best laughs in the series.\\n\\n\r\nBesides these three, I found the other characters to be rather boring or at least under-utilized. Specifically in regards to Elbia and Brooke. These characters are introduced and slightly looked at, but are then for the most part forgotten. I wish we would have seen more connections between them and the world, since this would tie into the world-building itself, but this never happened.\\n\\n\r\nSOUND\\n\\n\r\nThe OP at first wasn't too good, but became at least slightly enjoyable the more I heard it. It has a fantastical feel to it that fits nicely with the fantasy landscaping of the show. Plus, the twinkling part with Elbia and her eyes I particularly liked because it coincided so well together. The ED features Petralka alone in many different areas around Eldant, and the song itself gives us a feeling of wonderment, the same that she feels as she walks along the barren world.\\n\\n\r\nWhen it comes to a soundtrack, it is sometimes hard to leave a memorable mark. However, it is quite easy to do if you have a piece that is quirky and has simpe lyrics. This piece, probably known by everyone who has seen the show, is the \"DA DA DA\" song that gets played a handful of times. You owe it to yourself to check it out, since it is strangely weird yet extremely fun to listen to.\\n\\n\r\nThe voice acting was fine throughout the show. There are no standout performances to be had, but I enjoyed Myucel's, Petralka's, and Shinichi's voice acting.\\n\\n\r\nENJOYMENT\\n\\n\r\nOutbreak Company is a pretty funny show. And its also very sweet. I love to ship couples if they show any signs that they want to be together. So whenever Shinichi and Myucel were alone together, I always had a doofy grin on my face. Romance wasn't really the focus of the show, but I did like the subtle hints and inclusion of it, for it provided tender moments and nice comedy.\\n\\n\r\nEven though the show is rated PG-13, there is actually a heavy amount of fan-service, both of the tame and sexual variety. But this should be expected; after all, the show is attempting to demonstrate the different sides to otaku culture, and you can't talk about that without some naked women. I personally don't mind fan-service, so its inclusion was merely a bonus.\\n\\n\r\nOne of my favorite moments in OC is the \"Swimsuit Council.\" Taking the show into context, it is a masterfully crafted joke and one that I will probably remember for a long time.\\n\\n\r\nThe series ends on a touching moment, leaving us with wanting to have a fulfilling conclusion. Will we get that? I'm not sure. But if the time comes, I will be more than happy to return to the land of Eldant to get my fix of Myucel, Petralka, and Shinichi.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, interesting premise but lacking development\\n\\n\r\nAnimation: Good, shiny and modern with average actual animation\\n\\n\r\nCharacters: Fine, main cast is good but supporting is bad\\n\\n\r\nSound: Fine, okay OP, lacking ED, but good \"DA DA DA\"\\n\\n\r\nEnjoyment: Good, funny, cute, and fan-service to boot\\n\\n\r\nFinal Score: 6/10",
            "date": "2014-09-21T20:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 161509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=161509"
        },
        {
            "content": "When I first started watching this show it didn’t really seem like it would have good characters since they were generic.  I was just there for the premise, but there were many things that it actually did pretty well.\r\nStory: 7/10\r\nThe story in the beginning seemed very generic at first with the usual premise of being trapped in another world, but I really liked the beach scene and the overarching story.  The beach episode felt a bit more representative of the way an otaku would react showing us that he is still the awkward type of person.  It was also cool to seethe mc bring his whole collection of anime and manga and introduce it to everyone, which from my experience is original.  I also really liked the plot twist at the end, which was like the exact opposite of Gate in terms of how the government is viewed.\\n\\n\r\nArt: 6/10\\n\r\nThe art style looks pretty nice in this show with very differentiable characters.  It is very bright and colorful but don’t expect to see good fighting animation.  There were times when it did average but when it came to certain scenes, all you saw were stills, panning on the screen.  Like for the dragon fight all you saw were soldiers aiming at a dragon with nothing moving.  Other than the fights, all the other scenes were consistent.\\n\\n\r\nSound: 6/10\\n\r\nNot really any of the soundtracks were memorable other than that ‘da da da’ one which sounded very strange to me.  But they did match well with the scenes.  Kanou’s tone of voice changed well when going between the comedy and serious moods.  However, I don’t think that there was enough music to fit the serious tones.\\n\\n\r\nCharacter: 7/10\\n\r\nThe characters were the generic archetypes but they did develop a bit as you continue to watch.  I wish they had more of a backstory on how Myucel became Kanou’s maid though.  The main character showed a slightly more realistic approach to how an otaku would react compared to other shows.  He isn’t perfect but still tries his best to help others.  The harem isn’t actually blindly in love with him either which annoys me so much when that’s done in other shows that I watch.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI really enjoyed how this show shared about otaku culture, presenting its pro and cons.  There were tons of references that were put into this series as well like Fate, The Devil is a Part Timer and Madoka Magica.\\n\\n\r\nOverall: 7/10\\n\r\nOverall I would recommend this anime to people who like Gate or The Devil is a Part Timer and vice versa.\\n",
            "date": "2018-02-27T17:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 272617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6850125.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SharockoRAZR",
                "username": "SharockoRAZR"
            },
            "url": "https://myanimelist.net/reviews.php?id=272617"
        },
        {
            "content": "This review is in parts. Part 1 With no spoilers. Part 2 With short and deeper look at the story - spoilers  - reader discretion is advised.\r\nPart 1. \r\nI wish more anime series would be like this. This is one of the balanced ones. I mean, not too much sexistic scenes (Ecchi), not too much weird scenes, its showing how it really was in times of king, knights, princesses etc. (Offcourse things like dragons, birds used to be horses werent in medieval times, but that is minor (i think)). One aspect I like about this anime is showing a real otaku culture (half ofit), a lot of references to games and other animes. And when i say: a lot of, I really mean a huge amount of refenences (at least two in every episode). One aspect i didnt like about it is, the main point of this anime is revealed like nearly at the end, but I have to say in some ways its original (never saw something like that). Would I recommend it? Yes! Some viewers will like it some viewers will just watch it, say something about characters that are kawaii and go watch another anime. So yeah, watch it if you want...\\n\\n\r\nPart 2. As I mentioned earlier this will take a short look at the story.\\n\\n\r\nSo, main character is taken, throught an magical portal, to the magical medieval world where he is tasked to popularize otaku culture, as it looks from outside. But from inside, Japan goverment have something other in their minds, but i dont want to spoil that, only thing I convinced myself to say, as I said in Part 1, is it will be revealed at the end. So our character Shinichi was met with circumstances, in other words, what he have to do. By his side is an maid Myucel (aaah so cute.... i meant KAWAII) what will do everything he want, but she started to be addicted on him, something like she felt in love with him buuuut there will not be any kiss (yes gents, there is no kiss... goddamn!!!). Some scenes are funny, some scenes are something between funny and normal (not too bad actually) and there is not much action sequences. There are a lots of good ideas, like: build a school where Chinichi and others will teach that enthusiastic elves, dwarfs, ware wolfs and humans  of Otaku culture. Soccer between elves and dwarfs etc... There is so much thing that makes this anime so good.                If you made it throught my english to this point... Thanks. But.... there is two goddamn things that wont let Chinichi get laid with girls: 1. That barely teen Majesty Petralka, and, 2. Circumstances...",
            "date": "2016-09-24T14:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 230057,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5713235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ivaaan",
                "username": "Ivaaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=230057"
        },
        {
            "content": "Outbreak Company is one of those anime that has many flaws, but is still very good. It falls into many of the fanservice traps that most harem/comedy anime fall into. Despite this, it has an interesting concept and lovable characters (for the most part.)\r\nOur story starts out in modern Japan, where we learn that a NEET (shut-in) named Kanou Shinichi is looking for a job, and finally finds one that seems too good to be true! He takes an online test about Moe and Otaku culture, and passes it with flying colours. At this point he attends an interview for the anime company that hehas finished applying to and, lucky Shinichi, he gets the job! This is where things get crazy. His new boss has drugged him, and he passes out. When Shinichi reawakens, he’s in a lavish bed and room with the only other person in the room being a maid named Miusel Foaran (or Myusel, depending on the sub group) who we soon learn is a half-elf.\\n\\n\r\nAs it turns out, Shinichi’s new job wasn’t a regular anime company employee, but rather an ambassador to a newly discovered world (or universe, I’m not too picky) and the kingdom of The Holy Eldant Empire, and to improve bonds with it’s citizens and Japan by teaching and promoting Moe and Otaku culture. Hilarity soon ensues with the introduction of a, albeit small, harem, consisting of Petraraca En Eldant III, Miusel, Koganuma Minori, and Erubia Hanaiman. Will our hero be able to successfully spread his culture to the kingdom, or will he be cast out as “The Cultural Invader?” You’ll have to tune in to find out!\\n\\n\r\nFor those of you well versed in romantic comedy, you’ll see that Outbreak Company has many of its archetypes covered. Petraraca being a Tsundere loli character, Miusel being our shy, innocent character (as well as a maid!), Erubia as our happy-go-lucky large-breasted dogirl, and Minori is our yaoi shipper/soldier/tsundere. \\n\\n\r\nAs previously mentioned, I truly enjoyed Outbreak Company, despite the numerous fanservice scenes and “Why on earth would you do/say that, MC?” moments.\\n\\n\r\nNothing in the soundtrack particularly stuck out to me, besides a single track that played during some emotional scenes.\\n\\n\r\nThe ending, however, was less than satisfying. It seems that the writers decided to introduce a problem in the last few episodes just so that they could have a resolution built upon a climax structure. While the show leaves the possibility of a second season open, I highly doubt it happening due to the lack of anything truly different about it, separating Outbreak Company from other fantasy/harem anime.\\n\\n\r\nAll in all, I’d give Outbreak Company a 7.5/10 because of its lack of “oomph” Despite this low critical score; I’d recommend it to any harem/fanservice junkie.\\n\\n\r\nIf you enjoyed this review, please check out my anime review blog at trips-anime-review.tumblr.com/",
            "date": "2014-03-22T15:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 136489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2936623.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/senpizzle",
                "username": "senpizzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=136489"
        },
        {
            "content": "Comedy is, usually, a hit or miss genre for many people. Since there are several different styles of comedy, and several different opinions on exactly which style is the most humorous. Comedy in anime, from what I’ve experienced, usually falls into one of three styles: The slapstick style of comedy, where the humor comes from the clumsy and or stupid decisions and actions made by the characters, the more sarcastic and witty style of comedy, where the humor comes from the characters wit and sharp tongues, and will probably feature a decent amount sarcasm, and, finally, the parody style of comedy, which derives its humorfrom the many references it makes. Usually, those references refer to other anime. Outbreak Company uses the parody style of comedy, a style of comedy that I can’t say I’ve ever been the biggest fan of. Was Outbreak Company’s comedy spot on, or did it just miss the mark?\\n\\n\r\nStory: \\n\\n\r\nThe story revolves around the Shinichi Kanou, a hikkikomori (or shut in) and otaku who, after a period of deep reclusion, has decided to get a get job. After acing an online test, and performing well in his follow up interview, Shinichi was offered a job. Right after accepting the job offer, he is drugged and wakes in an unfamiliar room. He discovers that he’s been transported to an alternate dimension, to new world, by the Japanese government. He has been hired as an ambassador to the Holy Eldant Empire, a kingdom in this new world. His mission is to bring otaku culture, anime, manga, etc., to the Holy Eldant Empire in order to strengthen its relationship with Japan.\\n\\n\r\nAs mentioned earlier, this story is a parody comedy series, and it makes several references to other anime, manga, and other things in otaku culture. The series also pokes fun of, and pays homage to, several anime tropes. These references are not only funny, but they manage to always keep the series interesting. I not only enjoyed the references that Outbreak Company made in its dialogue, but I also liked the more subtle references, such as posters and figures of some of my favorite characters in the background.\\n\\n\r\nWhile this is a comedy series, it actually does have a pretty interesting narrative that touches on several different themes. The story addresses issues like racism, classism, and politics, which makes it that much more entertaining to watch.\\n\\n\r\nUnfortunately, the story doesn’t come to a very satisfying conclusion. While there is an “ending” it still leaves some things unsaid, and some questions unanswered. And the last couple of episodes did feel a little rushed, as they tried to kick the story into high gear.\\n\\n\r\nAnimation: \\n\\n\r\nOutbreak Company’s animation was really well done, with well-defined characters and good-looking background scenery. There are some scenes, specifically some action scenes, that I would’ve liked to actually see the actions taking place, but they decided to just use a shaky background image instead of actually animating it. While the animation isn’t great, it’s definitely good, quality animation.\\n\\n\r\nCharacters:\\n\\n\r\nWhile Shinichi Kanou is the star of Outbreak Company, the series does feature two other main characters, Myucel Foaran, Shinichi’s maid, Petralka Anne Eldante III, the empress of the Holy Eldant Empire, as well as several other supporting characters. Most of the characters in this series suffer from a lack of a proper background story and development, including our main characters. The amount of information we get about each of the characters varies. While some characters will have a fairly detailed backstory, others’ backstories will be only briefly mentioned and explored, if they are ever mentioned at all. Also, while there are some characters that do develop over the course of the series, others tend to either stay the same, or change very little.\\n\\n\r\nWith all of that being said, all of the characters are very likeable and enjoyable to watch. The character’s interactions with one another are also entertaining. The relationships between the characters do have a decent amount of development, and it was entertaining to see how each of the character’s relationships changed over the course of the series.\\n\\n\r\nSound:\\n\\n\r\nOutbreak Company’s soundtrack (OST) is large and varied. It features several orchestral sounding songs, some that are more epic and grand, and others that are more peaceful. The OST also features songs from other genres, from folk sounding pieces to march. It has a good balance of fast and slower paced songs, as well as a good balance between songs that are more grand and complex, and other songs that were incredibly simple. There are also some songs in the OST that are just, for lack of a better word, quirky, but very catchy at the same time. While watching this series the OST can get buried, and you might not even notice how many songs the OST actually has. This isn’t helped by the fact that there are plenty of songs in the OST that sound very similar to one another. But, all in all, Outbreak Company has a very good OST.\\n\\n\r\nEnjoyment:\\n\\n\r\nI had a really fun time watching Outbreak Company. Everything from the funny and interesting references, to poking fun at anime tropes, to the very likeable characters made this series entertaining to watch.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 4/5\\n\\n\r\nAnimation: 3.9/5\\n\\n\r\nCharacters: 3.7/5\\n\\n\r\nSound: 4.2/5\\n\\n\r\nEnjoyment: 4.1/5\\n\\n\r\nVerdict: 4/5\\n\\n\r\nOutbreak Company is a very entreating series, and I would recommend it to anyone who is a fan of anime and or otaku culture.",
            "date": "2015-03-22T14:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 183081,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=183081"
        },
        {
            "content": "Have you ever watched an anime and had that distinguished thought of \"THAT'S what I wan't to do with my life!\" Now I wan't to be an otaku. \r\nThis anime is really good.\r\nThis story introduces a slight feel to it like Spice and Wolf where it teaches you a knowledge of something you may or may not have known about Japanese politics and the Otaku culuture. A boy devoted to being an otaku takes on a new fantasy world, presenting the extravagant anime/manga culture to the Holy Eldant Empire. \r\n The Art is great. This series is not strung around by fan service but yetstill incorporates enough to keep that side of the fans happy. It's bright, beautiful, and keeps the story all the more entertaining. Not to mention, \"Moe.\"\\n\\n\r\n Outbreak Company has a great opening. I can already tell I will start loving an anime right off the bat. An anime with great music enhances the experience.\\n\\n\r\nThe character and subtle romance developments add so much to this flavor. Shinichi isn't dense. There's no greater happiness in my voice that I can scream right now other then, \"Banzai!\" You can clearly tell who has feelings for who during this anime even if it's not blatantly laid out. Every character peaks your interest. There is someone in this anime for everything, be it elves, half-elves, dwarves, humans.... or if lizards are your thing..",
            "date": "2013-12-25T02:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 125471,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1989300.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BentoLegend",
                "username": "BentoLegend"
            },
            "url": "https://myanimelist.net/reviews.php?id=125471"
        },
        {
            "content": "Outbreak company is a wish fulfillment show. There is quite a bit of fanservice. Most of the characters exist to fulfill some sort of fetish. Almost every single troupe popular in the otaku community is utilized and the main hero is a rather useless shut in who saves the day and gains a harem.\r\nSimultaneously Outbreak company provides a parodic meta commentary on the genre of show it stems from, while managing to make allusions to real life issues. The way the main character slowly makes the people of the fantasy world fans of anime/manga goods is something that mirrors the effect those goods have onus foreigners. It also manages to subtly bring up issues of slavery, racism, poverty and imperialism while never putting it on a spotlight.\\n\\n\r\nAll that being said the show is ultimately a dumb wish fulfillment fantasy which consistently manages to be enjoyable. If you want to watch a show from the trapped in another world genre, you might as well watch the one that has some depth.",
            "date": "2017-05-02T12:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 246832,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1365835.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/darkfeatherX",
                "username": "darkfeatherX"
            },
            "url": "https://myanimelist.net/reviews.php?id=246832"
        },
        {
            "content": "Outbreak Company is a wonderful story about love and friendship, differences in cultures, and doing the right thing. \r\nMeet Shinichi, a shut-in otaku who is well-versed in every aspect of otaku culture. While surfing the Internet one day, he applies to join Amu Tech, a company that is looking for someone that fits his description to a \"T\". He lands the job, but wakes up the next day in a different world. He is given the job of General Manager (with a huge salary) and is tasked with introducing and spreading otaku culture to a world with hardly any entertainment and living in a Medieval-likesociety straight out of fantasy fiction. Shinichi must establish friendly relations with the locals, including the young empress, if he has any hopes of getting the job done. Making friends along the way, Shinichi learns more about cultural differences and the repercussions of his and Japan's actions get him into some the occasionally dangerous situation. Outbreak Company is also filled with references to MANY anime, manga, light novels, and visual novels, which will satisfy any otaku. \\n\\n\r\nIf you like ecchi (happens every so often), harem, fantasy stories, taken to another world stories, bits of romance, lots of comedy, the occasional fourth wall break, and otaku culture in general, you'll most likely love this anime. The OP, ED, and OST are all very good and fit the mood well. The voice actors/actresses (Japanese dub) help make the characters enjoyable and match their looks and personalities. The story has a mix of a traditional progressing storyline and slice of life elements that I believe doesn't detract from the enjoyment (some people don't prefer SoL stories, so I feel it's necessary to point this out). \\n\\n\r\nIn the end, Outbreak Company is a great anime and I highly recommend it to ecchi and harem lovers, fantasy lovers, and seasoned anime fans who will recognize and love many of the references and general otaku culture theme.",
            "date": "2016-09-21T19:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 229770,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AKABoy123",
                "username": "AKABoy123"
            },
            "url": "https://myanimelist.net/reviews.php?id=229770"
        },
        {
            "content": "Fun and relaxing comedy anime based in a fantasy setting that tackles the 'Otaku' subject throughout.\r\nAt first you may think this anime is too similar to others in its category and give it a miss, however i recommend you give it a chance.\r\nIt tackles a lot of fairly heavy subjects from politics, governments and rebel factions surprisingly all whilst Shinichi tries to keep both worlds in balance through the incorporation of Anime, Manga and Games.\r\nThe anime is a lot of fun however i do wish they treated the supporting cast with a bit more meaningful screen time where we can learn about them more. \r\nAnexample being 'Erbia' whom i found an interesting character at first and then is almost never used story-wise but instead mainly for fan service. Without given away to much, you will see what i refer to once you start watching.\\n\\n\r\nThe anime contains a lot of supporting members but at best they just fill a specific role and aren't given much of a story. \\n\\n\r\nWhere the Anime lacks in character development (Outside of Shinichi and the main cast) the anime makes up for it with its countless references to Anime, Manga and Games such as 'Da Capo 2' brings it a lot of light heartedness and blends well with the comedy.\\n\\n\r\nI recommend this Anime to anyone who enjoys a fantasy setting with very little combat or detailed story, and instead wants something filled with joy, laughter and light-heartedness. \\n\\n\r\nI personally enjoyed this Anime a lot however can see the further potential that could of been pursued with it.",
            "date": "2016-04-09T07:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 215918,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4755163.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dracosine",
                "username": "Dracosine"
            },
            "url": "https://myanimelist.net/reviews.php?id=215918"
        },
        {
            "content": "Outbreak Company had an iffy start, it started somewhat light-hearted while being extremely generic, but despite that, it managed to have some funny scenes here and there. The comedy of this series is one of the few good points about it, if not the only one.\r\nThe iffy start wasn't only because that the show is generic, but also the fact that it executes drama extremely poorly, or at least something that was meant to be drama.  \r\nThe first time that we see this is in episode 3, where some drama happened and the results were the following. Character A was stabbed defending character B,leading to character B changing the way that she perceived character A. This was all done with the light-hearted theme presented at the beginning of the series and some comedy scenes here and there. Yes, someone got injured but all while having comedy. Which I honestly couldn't care less about either the drama or comedy since it isn’t funny when someone is getting stabbed and isn’t sad when you have a character pushing his face against a woman breasts while being kidnapped and on a life of death situation, all while the woman is moaning. Which is really bad since the comedy is the strong point of this series.\\n\\n\r\nThe second time and last one that we see this is on the last 2 episodes of the series, where after multiples episodes of extremely absurd comedy we get a drama arc. But again, all while being light-hearted and trying to be funny. I won’t go into details about what happened but it was the same exact thing that happened in the beginning drama arc of the series. Drama and comedy altogether. Why wouldn’t work? \\n\\n\r\nThink about this. You are with some people in a life or death situation and from nowhere someone goes and tells a joke. Would you find it funny? I at least wouldn’t. But that’s me, when it exists actual consequences I can’t find it funny. And this series goes and tell us that it indeed it exists consequences, but continues with the comedy and give us absurd situations while something is at stake and that’s why in my opinion it doesn’t work.\\n\\n\r\nWhile I do think that the drama of Outbreak Company is horrible, on the other hand, I do think that the comedy is great. I mean, a 10 years old dwarf with beard attending school and learning hardcore Otaku terms like “Haitenai” is something that I will never forget for the rest of my life. (Which btw is when a female character might not be wearing anything underneath her skirt, but keep in mind that whether she’s actually wearing any or not doesn’t matter).\\n\r\nThe show also makes a lot of references to another anime, which in my opinion is quite funny if you know what they are making references to.\\n\\n\r\nThat’s the type of comedy that this series uses most of the time. Absurd situations, that are only available because of the medieval/magic world that they are. And I do think that it made good use of that for the comedy.\\n\\n\r\nAnd that’s it. It actually had more good episodes than bad ones, but the bad ones were awful. Making this a series that I would never recommend and one when I look back at it will only think of how good it could have been. That said, overall I did enjoy the anime and that’s why I gave it a 6 out of 10 (Fine).\\n\\n\r\nWith that, I conclude my review. If you are looking for an anime that it never takes itself seriously, even when it does, I recommend this series since the comedy is pretty good and despite the plot being complete nonsense, it is an enjoyable anime.\\n",
            "date": "2017-05-17T12:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 247930,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3518119.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/pmf96",
                "username": "pmf96"
            },
            "url": "https://myanimelist.net/reviews.php?id=247930"
        },
        {
            "content": "This review may contain spoilers. Read at your own risk.\r\nImagine we somehow make contact with another world. Imagine you'd like to show the natives of this world a part of our own world's culture, to show that we're friendly. I'm pretty sure \"Otaku Culture\" wouldn't be that high on anyone's list, but it was on this anime! Somehow! This anime's plot is incredibly meta in such a way that it's so bad it loops back around to be somewhat good. The first few episodes will make anyone critically analyzing the anime pull their hairs out from the unbelievably brain-dead lines delivered and plot points. Someof them don't even make that much sense at all. Why would the government want a complete Otaku shut-in to be the ambassador of a whole new alternate world? It even differs completely in that trope: the Main Character doesn't die and get sent to a new fantasy world, or get any magical powers or mystical relics, they aren't anyone of consequence at all, they're literally just a nobody that got brought by the government in order to... spread Otaku Culture to a world that's still on the very beginnings of Medieval Europe with added Magic and fantasy races, such as Elves and Dwarves. There IS a semi-logical reason for this, but it's kept to the very end of the season. Which in of itself is where the main plot actually gets interesting. The beginning of the season was rather dull, overusing Isekai tropes and mixing in a sort of fabricated value to Otaku Culture. It's only in the last 4-5 episodes of the season where things actually take a very interesting and deep turn. Of course, being the finale, there's really not much to go on, but those last episodes really did feel like they were starting to build a truly unique world for the story. Should there ever be a 2nd season, if they somehow manage to expand on that initial world building, it could turn into a somehow decent isekai to watch. But right now, the only message this anime gets across is \"Otaku Culture! Yay! These are references to Otaku Culture things! Enjoy Verbaloid, Destiny/Remain Evening, Blade Art Online, among others! Go Otaku and you too can meet busty Elf Girls in another world! All sponsored by your government!\". It really doesn't go any higher than a brittle base of it's cast, story and setting and that really hampers whatever potential this anime could even begin to have. It's not the worst isekai, but I'm not going to say that it's even near being the best. More like a medium-bad than anything else. You can go ahead and watch it if there's really nothing else to do, but don't go in expecting something revolutionary.",
            "date": "2019-03-13T22:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 303479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2572185.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Mezzo_Vitae",
                "username": "Mezzo_Vitae"
            },
            "url": "https://myanimelist.net/reviews.php?id=303479"
        },
        {
            "content": "So I would guess that my opinion is quite similar to a lot of other people. I feel most of the story was quite good. The comedy was very entertaining, the characters were refreshing, and the art wasn't bad. But just as all good things must come to an end, the end for this show was a little earlier than I was hoping for. Up until episode ten I was very entertained and the story wasn't super generic. However, the last two episodes were terrible. The ending was rushed, and was so cringey. Most of the show was very funny, but the ending hadno comedy and it almost felt as though the writers changed. I would honestly recommend this show, but not for the story. Se ya next time",
            "date": "2019-02-28T20:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 302657,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7510928.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jknightkt22",
                "username": "jknightkt22"
            },
            "url": "https://myanimelist.net/reviews.php?id=302657"
        }
    ],
    [
        {
            "content": "At first i wasnt all that interested in this anime.Neither i am now.The story was well written i give you that.\r\n  This anime is set into a futuristic(not really..maybe a bit..idk) world where in Japan a dimensional rift(or crack..however u want).The gouvernment classified it as a TOP-Secret area thingy and sent teams in there.What they discovered was an anime world.IM NOT EVEN KIDDING.\r\n  Also this anime points out that being an \"otaku\" is actually good.Our MC here is a hardcore otaku who got a chance to see the \"other side\" with the sole purpose of teaching the inhibitants of the other world thejoy of otaku.\\n\\n\r\n  Do we get fanservice?Yes yes we do.At least a little bit.We also get romance between the master and the maid,and a harem.The social discrimination and country matters come in play too.So there's mixed feeling in here,diversity FTW.\\n\\n\r\n  The voices and sounds were good.I enjoyed hearing an invented language.+1 for a new language.\\n\\n\r\n I enjoyed the anime nonetheless.And i do recomend you to watch it.Give it a go and you might be surprised.",
            "date": "2016-01-08T13:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 208067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4972556.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NineNTG",
                "username": "NineNTG"
            },
            "url": "https://myanimelist.net/reviews.php?id=208067"
        },
        {
            "content": "As a harem fan i really enjoyed this series, its a very good anime since years. It could have a second season though since 12 episodes is a bit too short. It is sort of similar to zero no tsukaima and the plot is really great. if they make a second season of this thus expand the story where the main character get to travel to other new countries that will be awesome.  i believe this anime deserves a better score since its a pretty good solid one. unlike some anime where they have very uninteresting plot at all. they could spice up thethings with the romance though, that would make it even more awesome. in my opinion the only thing that this anime lacks is the romance bit but thats just me\\n\\n\r\nrecommeneded for those who don't mind about harem and a fan of otaku.\\n\\n\r\n-not recommended for girls and those who disliked harem.\\n",
            "date": "2014-08-09T16:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 155947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2736891.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TakunDes",
                "username": "TakunDes"
            },
            "url": "https://myanimelist.net/reviews.php?id=155947"
        },
        {
            "content": "The premise for this anime isn't anything new or original but they way they deliver it is really good. Our main dude Kanou Shinichi is an otaku hikkimori. He applies for a job then he gets drugged and sent to another world. His job is to work with the Japanese military and government to spread otaku anime/manga culture to this new world.  My favorite part about this anime is how it touches very deep topics, such as  separation by class/race and government corruption. In the world he is sent to everyone is separated this way. Low class and high class and all theraces. Such as people who belong to the empire in that world/humans are at the top and people in the towns that are non human such as elves, werewolves, dwarfs, lizardmen etc. are at the bottom. Shinichi wants to unite them. Another thing to mention is the massive parodies this anime has. You'll be able to recognize all the anime it parodies. The comedy in this anime will make you laugh, the deep topics it touches will make you feel a lot of emotions, and the girls are just great. His harem includes 3 girls. Myucel, his half elf/half human maid, Petralka the Empresses of the world, and Elbia, a rowdy werewolf girl. Myucel is your \"I'll serve my master with my life\" kinda girl and she is timid, cute and pure. Petralka is your standard Tsundere loli, and Elbia is your tomboy/rowdy girl. Give this anime a shot.",
            "date": "2016-10-16T14:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 231907,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4600871.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yoshihiro56",
                "username": "yoshihiro56"
            },
            "url": "https://myanimelist.net/reviews.php?id=231907"
        },
        {
            "content": "Review #2: Outbreak Company\r\nStory 6/10 -- This is one of those animes storylines while unique, I disagree with. The Japanese government finds a new realm in an abyss, and decides to kidnap an Otaku to sell them their own merchandise. Ignoring finding a new world, I'm not really sold on this plot at all. While it explores major topics today such as social class, and racial discrimination, the show expresses them, but doesn't address or build anything on it afterwards. it focuses more on selling anime and manga, and the lack of hero qualities by the MC is underwhelming in this fantasy series. It's moreof a lighthearted comedy then an engaging series.\\n\\n\r\nArt 8/10 -- The Art was really good, one thing for certain is the high amount of anime/manga references hidden on the walls in the background. I found that to be pretty cool by Studio feel, along with the vibrant color and scenery they put effort into. The majestic castle was pretty nice as well.\\n\\n\r\nSound 8/10 -- Overall the op/ed songs were pretty good, and the background music was better then most series during this season. \\n\\n\r\nCharacter 7/10 --  The character art is average to good, and so are the personalities. Myucel is every man's dream when it comes to maids, she learns everything Shinichi teaches her quickly, and her personality is very cute and enjoyable. Petralka is a demanding majestic loli, 3 words together that can give any anime watcher multiple different reactions, while Shinichi is a rather plain MC, dense and somewhat gullible/follows blindly when being spoken too.\\n\\n\r\nEnjoyment 7/10 -- The story isn't anything special, but this anime is enjoyable to SOL/Fantasy fans, as it doesn't care too much on story, but rather the daily, fun events with doing the job Shinichi does. He's bringing everything he loves into a new world that's deprived, and he's thankful for meeting all these people I'm sure he could never have dreamed of. He becomes more outgoing as the series progresses, and I think this blends well with the atmosphere of the series.\\n\\n\r\nOverall 6/10 -- This anime is a solid 6-7 series, but the art and sound were the best subjects from my review. The characters aren't as special as others I've seen compared to other similar fantasy animes. The story doesn't dig deeper, and that's a disconnect for me. This is a solid mid tier anime, but not of a high priority to watch, you can find better shows, even in the SOL/Fantasy genre mashup.\\n\\n\r\n~Castawayz",
            "date": "2018-02-15T09:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 271561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4700148.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Castawayz",
                "username": "Castawayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=271561"
        },
        {
            "content": "Comedy? Harem? Romance? Uh.. Action? What was this anime again? Highschool maybe? Kinda.\r\nOutbreak Company. Basically it's an Isekai anime, where our MC is a total shut in, but was recruited for some kind of a mission to spread the Otaku culture in a new world that was revealed.\r\nThere, he meets tons of girls and yep, you guessed right- It becomes your generic Isekai harem anime.\r\nStory: 4/10\r\nThe story was really bad, Let's start and say it didn't have any linear plot line, nothing that led to another thing, no twists. Nothing. When the series was about to get a bit serious, it ends in a minute,somehow. It fails to be serious, and therefore I thought \"Well it doesn't matter, at least the comedy should be good\".\\n\\n\r\nWell I was right, for the first few episodes. The jokes were pretty funny at first, but afterwards it just became the \"embarrassing situations with a Harem MC\". Walking into a girl stripping/dressing up, touching a pair of boobs, etc. etc.\\n\\n\r\nSo, I thought maybe I'll see some amazing romantic development. Uhhh I can't say there wasn't. But it was definitely not more than your usual Harems. Well maybe a bit more. Still not satisfying, even a bit frustrating. I won't spoil, though.\\n\\n\r\nArt: 8/10\\n\\n\r\nThe art was pretty good, nothing more, nothing less. Pleasing to the eye.\\n\\n\r\nSound: 4/10\\n\\n\r\nOkay, that was a bit annoying. The OP and the ED songs are forgettable and skippable. I skipped both of them every episode since hearing them once.\\n\\n\r\nNow to the soundtrack- When there's a climax brewing, you should have some intense track right? Well not here. The \"intense\" soundtrack is a person saying \"da dadadada, da, dadada\" with some kind of rhythm.\\n\\n\r\nCharacter: 6/10\\n\\n\r\nHarem show, what can I say. You have the kind person in love with MC, you have the tsundere, you have the girl with the big boobs who slaps MC and the girl with big boobs who doesn't care about MC touching her boobs and such.\\n\\n\r\nI've liked Miyucel(the maid), and she was the only reason I've kept watching this anime. The rest of the cast (Including Shinichi the MC) weren't likable.\\n\\n\r\nEnjoyment/Overall: 6/10.\\n\\n\r\nOutbreak company tried many things, it failed in most of them (if not all). I do not recommend this show, really. There are many other and better shows out there.",
            "date": "2017-08-19T14:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 255833,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262007.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/dadnaya",
                "username": "dadnaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=255833"
        },
        {
            "content": "Ah to be fully praised as an otaku instead of just being called a nerd and being able to use the ever vital acquired knowledge and ways of the otaku for the greater good. Such a dream is realized for our realistic human protagonist, Shinichi Kanou, as he becomes an ambassador of Japan with the mission of cultural exchange in a fantasy world where magic, dragons, knights, kingdoms, elves and etc thrive, teaching what Japanese culture has to offer and you've guessed it, anime! So be expected to see, prince, princesses elves, reptile like people, soldiers and the latter.\r\nOutbreak Company quickly bears it shine andgives the audience a multitude of aspects to look forward to as the series moves on, from a hint of romance, amusing comedy, fan service without being fan service (You'll see what I mean), enjoyable characters and wonderful story/premise. All these factors do not out way each other but rather,  are on an equal level to make it a truly intriguing yet enjoyable anime to watch.\\n\\n\\n\\n\\n\r\nStory - 8.5\\n\\n\r\nWatching the development  differences/comparisons and the soon to happen clash of cultures is a very interesting concept to watch unfold. This actually can shed some light and or gives a very good demonstration of what it would be like to actually try to share a different culture with someone else's, who is vastly different and not even to mention a totally different level of civilization if that isn't tough enough. Obstacles and oppositions start to slowly emerge as the story progresses and greater, more realistic world problems such as race, social status, war, rebellion and politics arise. It is easy to say that our protagonist is faced with a rather difficult conundrum that he must face head on and is up to him to spread the joy of what Japanese culture has to offer.\\n\\n\\n\\n\\n\r\nArt & Animation - 8.5\\n\\n\r\nThe art and animation are up to par with anime this year (2013)  and is detailed but not overly detailed to the extent of each specific object being drawn to detail. I love the subtle detail in palette choice on some of the detail of the characters and some scenes, which becomes noticeable radiant in juxtaposition to the other hues in the scene.\\n\\n\\n\\n\\n\r\nCharacters - 8.5\\n\\n\r\nOne would think that the protagonist of such an anime witch such a plot about otaku-ism would be extremely stark in regards to being pervy, like such characters as Issei of High School Dxd or someone like Takeru Ooyama of Maken-Ki and the latter. Hes more of the in between of both parallels. There is already a excellent amount of character development for most of the characters, however it might be too fast in some eyes and that could very well be true, but it seems there is more to expand on here to not become totally linear. A gracious amount of characters to like here and more will make their debut as the season progresses.\\n\\n\\n\\n\r\nWow Factor - 8.5\\n\\n\r\nThe very beginning moments of Outbreak Company already got me hooked with its not your everyday rather amusing and intriguing plot. I can't stress enough of how amusing the collision of these two cultures is fascinating to watch unfold. I don't think I've ever seen a lizard man playing a Super Nintendo like vintage machine or an elf reading a classic, over dramatic love manga. Have you? The fact that I'm or one's not to sure where the direction of this anime will go or touch on these addressing matters that exist in this world, fascinates me to keep me watching each episode.\\n\\n\\n\\n\\n\\n\\n\r\nFinal Grade - 8.5 -> 8\\n\\n\\n\\n\\n\\n\r\nDo I recommend this series to watch? If you like comedy, fantasy and watching Japanese culture being introduced and inserted to a civilization in a fantasy like world where they have no clue to what it is.\\n\\n\\n\\n\\n\r\n+ Cameo references\\n\r\n+ Intriguing story with a surprising slight dark undertone\\n\\n\\n\\n\\n\r\nReview by: AzurexSky of AniRaters",
            "date": "2014-01-13T14:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 128645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3439279.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/azurexsky",
                "username": "azurexsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=128645"
        },
        {
            "content": "How would you like to go to a fantasy world with castles, knights, magic and, of course, half-elf maids and loli queens? How about a job to talk about and share what you love? To spread your cherished otaku culture to said fantasy world while appearing to be some high and mighty delegate from a culturally advanced world? Sounds fun, and Outbreak Company is exactly that. Episodic, light and comedic in nature, this anime follows our protagonist, a hikimori/shut-in, Shinichi Kanou, who is thoroughly enjoying his time spent in a magical other dimension, watching anime and reading manga, while being waited upon by his veryown busty maid. Once just another nerd in our world, he became the director of Amutec and the man entrusted with the foreign relations between the Eldant Empire and Japan.\\n\\n\r\nI’m sorry, but if you intend to take this series seriously -- do not. The premise itself should scream at you that it is typically light-hearted, silly and fun, if you are looking for an engaging tale with moral complications, deep characters and philosophies... shoo, begone, ye do not belong here. The series does teeter between seriousness and light-hearted, but it is better to treat it as the latter. I will not elaborate more on the story here as you can read it on the MAL page, I’ll reveal as little of it as I can in this review as it is much more fun to discover things by yourself just as Shinichi does coming into this whole new unfamiliar world. In fact, Outbreak Company starts off humorously going into Shinichi’s surprise and reactions to the new developments. If I didn’t imply it heavily or clearly enough in the first paragraph, this is a largely wish-fulfilment anime as I’m sure it would be a dream come true for anyone, especially otakus like Shinichi, to be able to visit another world with all sorts of things you can only dream about while staying at your very own mansion, complete with a servant and a hot but innocent maid.\\n\\n\r\nAt any rate, Shinichi gathers his surroundings and learns about the world before setting his grand plans in motion to bring moe culture to the Eldant Empire. Things do get serious when complications arise, we are faced with the social issues and values of this medieval society, including racism and equality, and Shinichi must also at one point question himself and his place in this foreign world. After the first few episodes, however, the series ditches all “seriousness” and just becomes “the daily life of Shinichi Kanou”. There are no new developments actually shown in his quest to spread moe culture, I actually thought for half the series he was doing almost nothing while apparently in the background, manga and anime caught and became very widespread. We do not see this, instead, we play soccer, we go to the beach, we make movies and etc., before one of the issues brought up in the first episodes is very hastily wrapped up in the very last.\\n\\n\r\nThat is why I say to not treat this show seriously. For most of the show, we simply are met with pure, simple entertainment with the antics of the characters, the fun that they are having engaging various otaku activities and the many, many pop culture references that pop up throughout. Any problems that come up are not particularly meaningful or severe and do not have any lasting consequences, a lot of the time, the “tension” just comes from very heated debates over which anime or character is better. Outbreak Company can be basically considered an episodic comedy set in a fantasy world rather than your traditional high school setting. It did make me laugh, which cannot be said for many other shows, and the references to other anime really did amuse me, however there was nothing that they did that really stood out or set this show apart.\\n\\n\r\nThe characters are not deep in the loosest sense of the word, they are meant to fit snugly into their tropes and roles and let you rejoice in the anime-ness of this anime. There were no characters I particularly liked, none of them were actually all that interesting, but there were none that I particularly disliked either or found too bland. Shinichi is your typical perverted otaku whose meant to reflect the audience, he gets overexcited about his animu and what he does can be cringeworthy to say the least. Nevertheless, he’s actually decently intelligent and was the one who thought up the solutions to many of the problems that came up. Like 99% of anime protagonists, he is a good guy who will risk his life for his friends... and his super rare anime collectables. Moving on, Miusel Foaran is an innocent maid... with a very, very nice rack and elf ears as well as a maid uniform to top it off. She’s the pure maiden who falls in love with the main character, though the series doesn’t actually delve into romance, the perfect wife who can cater to your every need who even shares your love of anime. She is earnest, hardworking and strong, willing to sacrifice herself to save her friends if need be. Serving as the polar opposite to the well-endowed half-elf maid and catering to the other crowd is Petralka, the almighty ruler of the Eldant Empire, apparently sixteen, she looks twelve. Some might find her annoying as she is a bratty, arrogant and spoilt tsundere, but it makes sense since she has nearly no problems in her life. Other characters include a yaoi fangirl, an excitable busty wolf girl and a gay bishounen. One thing I loved was how they showed a character profile with their favorite anime and anime character at the commercial break points.\\n\\n\r\nThe art is very good quality that seems to be the standard these days. It does not stand out or dazzle the spectator but it never detracts from the show and stays consistent throughout unlike some older shows. The castle architecture and the fantasy clothing designs are very nice, though one might have to get used to the way they drew eyes, with their slightly strange, noticeable and solid eyelashes. It isn’t bad, simply slightly different from the norm. The opening isn’t anything impressive, but it suits the anime well and the ending is a good way to conclude each episode. The voice actors suited the characters, bringing out their happy moments and embarrassing ones as well. I really do like the funny sound they play at comedic or awkward moments.\\n\\n\r\nShows like this ultimately fall down to personal enjoyment. Did I like it? Certainly -  it was funny, it was amusing and I don’t regret watching it. It wasn’t engaging or enthralling, but it let me sit back and enjoy myself a little seeing them do nerdy things, while trying to catch as many references as I can. Overall, Outbreak Company is a nice show, it was definitely one of the better titles of this Fall 2013 season. Final verdict is a 7/10 or “Good”.",
            "date": "2013-12-23T09:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 125209,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2705413.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AixDivadis",
                "username": "AixDivadis"
            },
            "url": "https://myanimelist.net/reviews.php?id=125209"
        },
        {
            "content": "I must say that I had really fun watching this series.\r\nNot only they bring the fun part of introducing otaku culture as main topic of it but the form they do so is well planed.\r\nGate tried to do this in a certain way but they were more focused on battles and politics.\r\nStill, this series had its share of comedy that was pretty enjoyable and also the action it self.\r\nIt was well planned and executed on the concept of diplomacy with other worlds and try to introduce a form of entertainment as a ways of dowry.\r\nThe character development also was fun to see.\r\nHonestly, I thought SDFwoman guard was going to be all lovy dovey with the prince but she ended up being a freaking fujoshi! how twisted is that? That was an interesting plot twist.\\n\r\nIf you like something calm and fluffy and enjoyable to see I recommend watching this series, else well... up to you.\\n\r\nBut on my part i would re-watch it again.\\n\\n\r\nEdit-\\n\r\nNow that i think about it... on a serious note. This flick shows people a crude reality... on how Otaku culture can easily invade and hypnotize people and make slaves into it if not controlled. Its a reflection on how otaku culture has invaded other countries and take a firm hold on citizens outside japan that has no defenses against it and control... like japanese people, the creators, does.\\n\r\nIt is sad... how the world can be conquered by anime, manga and games... and this shows it... because it happens for real.\\n\r\nMany reasons why normie Japaneses despises otakus.\\n\r\nMany reasons why other countries sometimes see anime as a nuisance.\\n\r\nIts just as a drug. You get into it and want more and more and more... I my self am a victim of this. And its hard to break out... you just keep going.\\n\r\nAnything, without control... can bring chaos.\\n\r\n-\\n\r\nSpoiler:\\n\r\nIt also shows, like always, how crude a government can be when using someone or something for conquest. I should had known they didn't want to actually be allies.\\n\r\nOnce again in the end, the battle of morals and what you think its right on something you love... or follow in fear corruption and let yourself be used.",
            "date": "2017-05-10T17:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 247406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6237435.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheRandomCritic",
                "username": "TheRandomCritic"
            },
            "url": "https://myanimelist.net/reviews.php?id=247406"
        },
        {
            "content": "Da...dadadadada...da...dadada... \r\nDo you ever just burst out laughing from seeing something so ridiculous? \r\nOutbreak Company can be misjudged from the description, I mean we've seen this before right? I'm talking of course about Zero no Tsukaima, they've even got the maid, elf, tsundere characters in there! \r\nBut man was I wrong about this show. \r\nStory (8/10): The story is unique in its own way because instead of fighting monsters, Shinichi's mission is to spread the Otaku culture. It sounds a little weird, and most people looking for a serious plot may be put off. But It does develop into something deeper as Shinichi starts tolearn about the world he's been transported into.\\n\r\nCharacter (8/10): The character development is a big aspect of this anime, and Shinichi pretty much affects the entire Eldant empire, in a good way. I loved each character, even Darwin (lizard guy) who sadly doesn't get much screen time. Just a fair warning to those sensitive to Moe, every Myucel moment, just tugs at your little Otaku heart.\\n\r\nArt/Sound (10/10): The setting is beautiful and the art is great too, but I have to point out that the intro is amazing. Also did I mention I loved that weird singing that seems to play every time Shinichi is being perverted. \\n\r\nEnjoyment (10/10): I'm not going to go much into the plot, because well, that's not why I rated this anime so highly. Hands down comedy is this anime's strong point. Each episode brought something completely new, I didn't even care if it didn't have anything to do with the plot. Each episode was a new experience and the comedy was memorable.\\n\r\nOverall (10/10): An overall 10 may be a bit much to some but I looked forward to each new episode, it made my day better and it made me laugh, a lot. I'm not gonna defend that this is a unique story and it's not just fanservice, well because it is that. But who cares? If you love to laugh then you'll love this anime.  \\n",
            "date": "2013-12-19T21:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 124693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2813539.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Joe-desu-desu",
                "username": "Joe-desu-desu"
            },
            "url": "https://myanimelist.net/reviews.php?id=124693"
        },
        {
            "content": "When it gets serious, it's actually not being bad, but it's not being good either. It's just that when you occasionally genre hop into somewhat seriousness the expectations grow higher. But then when it drops a silly joke in the midst of it as an actual plot element, just as a reminder not to take it too seriously, you're just not sure what to think anymore, and how you should manage your expectations. So that part about it was a bit weird but not too bad, though overall it was really fun to watch and has a great character cast. \r\nMost of the time it'sjust a clever self aware comedy with a pretty unique setting, and that's what it does best. Sometimes it even splurges into exploring actual meaningful themes, and shows signs of quality writing here and there, just to then drop the act and spend a considerable amount of time just having SoL fun and being enjoyable comedy. So it has a bit of everything, and it's balanced quite nicely, but it's not equally skilled at everything which occasionally makes a particular plot point feel cheap and out of place.\\n\\n\r\nBut it's tons of fun, and even more so to someone knowledgeable about anime tropes and otaku culture, as it's what it's essentially about, though it approaches it in very elegant way, meaning it's much easier to figure out and appreciate than Nyaruko for example. And that might be one of its biggest strengths. Compared to Zero no Tsukaima, it feels more serious and solid while having no blatant fanservice. \\n\\n\r\nCompared to Dog Days 2 it has slightly lower quality production, but that's not to say it's suffers from it. It might be a little less fun, but also feels more serious and concrete than it. It's biggest downfall is that it isn't very compelling (think not as good as HenNeko, but not too far overall), but the fair point can be made that it isn't its point due to it mostly being self aware comedy. The problem only presents itself in a sense that Outbreak Company has a bit of everything, and those few parts that should be compelling, aren't really. But most of the time show is doing what it's good at, it's really fun and enjoyable to watch.",
            "date": "2015-07-11T12:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 193081,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2424123.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Eagleshadow",
                "username": "Eagleshadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=193081"
        },
        {
            "content": "Ok, this is my first time reviewing an ANIME so please correct something if I missed or misinterpreted a part. This is a decent anime with sudden plot change, not in a bad way but in an exciting one! An acceptable harem genre rom-com and so many things to say but I'm afraid I might spoil it.\r\nHere it goes, STORY  : 8/10\r\nThe story maybe appealing to fresh ANIME enthusiast, but for some who havewatched Lot of shounen ANIME may not consider its story or appeal them full-time because of the setting alone. Magical World, Cute Girls, Dragons etc. So I give it an 8due to common setting\\n\\n\r\nArt : 9/10\\n\r\nNeat details on artwork especially on RUNES when someone cast a magic-spell but still not that appealing or fluid\\n\\n\r\nSound : 7/10\\n\r\nHere's the part where I'd been worried about, the music especially the OP Song is not fitting for the ANIME. Enough said.\\n\\n\r\nEnjoyment : 9/10\\n\r\nI had fun overall, its not that irritating harem where the MC was denser than SeaWater. And every Heroines are lovable. And the plot-twist was unexpected.\\n\\n\r\nOverall : 9\\n\r\nI pointed it out, the music didn't sync well with Outbreak Company.\\n\r\nBut the fluidity of story, the well-detailed Artwork and the Love I developed with the Characters we're enjoyable",
            "date": "2014-06-25T01:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 148465,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MakuAren",
                "username": "MakuAren"
            },
            "url": "https://myanimelist.net/reviews.php?id=148465"
        },
        {
            "content": "Lot's of potential, no commitment.\r\nNow as I analyse the story after I've watched the whole series in a day, the story almost starts to fall off.\r\nShinichi is a \"typical\" NEET, plays video games all day, watches anime and reads manga, while being shut in his apartment.\r\nBut when he, for some odd reason, sees a job offer with the salary of 300,000 ¥, (~$2,800) he decides to get a job.\r\nDon't get me wrong, it's acceptable to get a job in an anime, but Shinichi is, at least in my opinion, supposed to be a total shut-in, and is referred to that in the anime.\r\nThe different characters?Outstanding! Lots of different personalities, conflicts between the different races. This isn't your typical harem/ecchi anime, which will be just like the other 100,000 of them.\\n\\n\r\nTo be honest, I enjoyed watching this anime, but in the end, I feel like something was missing. I would've loved to see a romance between Shinichi and Myucel. The potential was there! Instead I got some awkward moments and Shinichi's thought process when seeing Myucel and kind of a rushed ending...\\n\\n\r\nIf they would've made something between Shinichi and Myucel, I feel like this anime would've gotten another season, or multiple. (Or maybe it will get one, since now the manga is finished.)\\n\\n\r\nConclusion: Like I said, a lot of potential, no commitment. Characters were outstanding, but were handicapped by the story. Room for more\\n\\n\r\n~Coffee",
            "date": "2018-03-08T01:14:00+00:00",
            "helpful_count": 0,
            "mal_id": 273314,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6481215.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Uncle",
                "username": "Uncle"
            },
            "url": "https://myanimelist.net/reviews.php?id=273314"
        },
        {
            "content": "Militaristic war can be a deadly thing with the loss of countless lives in the dominance over territory. However there is a kind of warfare that can be even deadlier when used over a period of time but yet doesn't take a single life. Cultural warfare.\r\nThe story of Outbreak Company is japan introducing the culture of the \"otaku\" to a new world they found the portal to one day. Their many efforts had failed as the many managers lacked an immerse knowledge of the \"otaku\" way. So the hired a shut in with a life completely dedicated to manga and anime in hopes to reapa large profit from spawning a Japanese entertainment industry to this new, under developed world they've stumbled across. A very straight forward story with the occasional twist that keeps things interesting and never lacking in entertainment.\\n\\n\r\nStyles for scenery and background are astounding with detail that really capture the environment of a medieval style timeline. However for characters and other minor animated objects, the lack of detail with facial expressions when put at any distance, is very disappointing. even the use of cell shading is limited on things.\\n\\n\r\nSounds for the use of magic are something to be credited for as they are well used and each spell has a very different sound to it. as for background music, its mostly either very faint or blends in to the scene so well you hardly notice it except for lewd/fan service scenes where the music is in your face to the point where the beat of it can ruin the humor value.\\n\\n\r\nCharacters are played out and portrayed decent for the most part but as for back stories, not much at all is explained for anyone other than the single main character. Light topics of explanation are occasionally told but only in scattered spots throughout the 13 episodes and nothing really gives you a clear idea of how from there did they get to where they are today. Other than back stories, the play out of each character bar a few, was well thought out as everyone had their deeper purpose and some didn't find theirs until after other sinister ones were revealed.\\n\\n\r\nEnjoyment factor was, on a personal note, quite high for myself as the references to countless other anime and Japanese idols are so high I would almost think it impossible to count them all. It was played out perhaps too quickly in some parts but its the lesser parts are skimmed over as needed. Many times the main character see's himself as an anime's main protagonist due to all his years of being an otaku shut in, and tends to relate a lot of his experiences with moments from his excessive manga database.\\n",
            "date": "2014-06-03T02:20:00+00:00",
            "helpful_count": 0,
            "mal_id": 145601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=145601"
        },
        {
            "content": "I really enjoyed watching Outbreak company from the beginning up to the end,I enjoyed those scenes where the protagonist introduces the people of Eldant to modern technologies and otaku products.Seeing as they react to those things, makes me enjoy watching it.The characters looks portray to their personalities, which I find really good in an anime.I like the characters personalities, from moe to tsundere, I liked all of them.\r\nOverall this anime will surely make you enjoy watching it with its unique characters and scenes that are both funny and romantic.And it will surely be in your head for a long time.....",
            "date": "2014-04-02T00:09:00+00:00",
            "helpful_count": 0,
            "mal_id": 138283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3668931.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/supercola123",
                "username": "supercola123"
            },
            "url": "https://myanimelist.net/reviews.php?id=138283"
        }
    ]
]