[
    [
        {
            "content": "Kurenai is the 08 spring anime I had the highest hopes for, and I surely wasn't let down by it.\r\nThe artwork in the series is amazing. The main reason for this is the coloring - it's so vivid! It's sharp and varied colors, something which - as of what I've experienced - is unprecedented. The detail may skimp a bit now and then - which drags it down to a 9 (yes, I wanted to give it a 10). Oh, and the OP theme animations is pretty whacky - which is both good and bad.\r\nThe characters are as colorful as the animation is, even theminor characters. I really liked that, because it makes it oh so more realistic. And it's not only the characters as individuals, but also their relationships which I really loved. That does cover well up for the lack of character development that a 12-episode series is pretty much doomed to have.\\n\\n\r\nThe story in itself is very good too. It starts out very slice of life-ish, going with an episode-by-episode format, where Murasaki learns how the real world looks - after all, she's just escaped from being locked into a house with the most woman-discriminating family I've ever heard about, both in fiction and real life. But that being said, the episodes were great, because so much seemed to happen - often they featured parallel stories with Murasaki and someone else (often Shinkurou's two female neighbors) in one, and Shinkurou in another one. Halfway into the series, and a few episodes more, the series takes a drastic turn, and the more dramatic sides of the show starts to unfold, in contrast to the often light and comedic moments of the earlier episodes. It all culminates into two-three episodes with much action and drama, and an end which you're either gonna love or hate - I can't say more without spoiling anything.\\n\\n\r\nThe soundtrack is jazzy, and fits right into the scenes and the mood. Personally, I liked it, but it wasn't anything spectacular, and if you don't like the jazzy type of soundtrack, you can find comfort in the fact that you often don't notice it at all.\\n\\n\r\nI really enjoyed this series, both because of its mix of many genres, special animation and wonderful characters, but also because of the calmness this anime presented. Even during the most intense scenes - either emotional or action-packed - I found it to be very calm. Personally, I think that gave the series that little extra which made me love it so much.\\n\\n\r\nTo 'Not Helpful' voters (and you 'Helpful' voters too): Feedback greatly appreciated =)",
            "date": "2008-07-15T04:52:00+00:00",
            "helpful_count": 261,
            "mal_id": 6293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11081.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheLlama",
                "username": "TheLlama"
            },
            "url": "https://myanimelist.net/reviews.php?id=6293"
        },
        {
            "content": "A couple months ago, I decided to scout out some of the series in the Spring 2008 anime season. I found Kure-nai, and decided to give it a try. The OP scared me, and I almost turned this into an instant \"drop.\" Really glad I didn't, because this show was a rare find.\r\nStory\r\nWith only 12 episodes, it can be difficult to turn out that perfect storyline. Even so, they did a good job. The show is focused around the inner struggles and relationships of and between a seven-year-old aristocrat girl and her bodyguard, a poor, sixteen-year-old high school student. Nothing mind-blowing, but a sufficient premiseall the same. However, it's paced very well, fast when it needs to be and slow when it's appropriate. I never felt the series get dull.\\n\\n\r\nRealize that this is a both a comedy and a drama, and in my opinion, it does an effective job at being both. However, there is some action mixed in. It's enough to give the series an interesting push, but it seldom drives the story. Adrenaline seekers, you will be disappointed. That said, I thought the action was handled quite well, and the fighting that does occur are some of the most intensely emotional scenes within.\\n\\n\r\nArt/Sound\\n\r\nWhile the media of the show was pretty high-quality, it has a tendency to go into estrogen overload mode, and that proved a bit trying for me. Pastel colors, curvy lines, and high heels galore. I got more used to it as I went along, but I still skipped the OP and ED most of the time. But that's an issue of taste, and in all honesty, it really wasn't all that bad. It was actually pretty well-animated, too.\\n\\n\r\nI didn't care for OP/ED songs themselves, and I felt that most of the background music was pretty unmemorable. I say that because I really can't remember much of it at all. I know the music effectively aided the visuals, but it's probably not what I'd listen to standalone. However, there is one song that struck me, one usually played during the most intense moments of the anime, and it has stayed with me the way few can: a lonely, haunting piano playing a melody as beautiful and sad as the tune of an old music box. This alone may be enough for me to get the OST.\\n\\n\r\nCharacter\\n\r\nThe characters were strong. Certainly Shinkurou and Murasaki were done well, but the support cast was also impressive. In only 12 episodes, there wasn't quite enough time to really delve into most of them, and it could be argued that only a handful of the characters actually play any sort of vital role to the story. But even without seeming &quot;significance,&quot; they take the story and make it alive. Shinkurou and Murasaki have friends and neighbors, personal lives, and human bonds with the people around them, and it is those they interact with that gives the series its feel of realism. I found myself interested in the side characters, and I think I could watch Kure-nai again even just to see more of them. I was also impressed with how they took such an overbearingly female cast and a story with romantic undertones and prevented it from taking on &quot;harem&quot; clich&eacute;s. The support characters all seem to represent different aspects of and attitudes toward life, and each gives the series a unique insight into the story.\\n\\n\r\nShinkurou and Murasaki were even stronger characters, though. They, too, were very human, and at times painfully so. Murasaki, the lovable, huggable bundle she is, has led a life that has left her bizarrely mature in some areas and frustratingly impossible in others. Shinkurou, for all the good in his heart, has his own set of shortcomings, and sometimes you find that he's not the fearless hero you want him to be. The relationship between them, however, is the best part of the show, and before you scream pedophilia, know that the relationship does not, at least in my opinion, carry sexual undertones. It's really quite a clean and healthy situation between them. Creepy people, you too will be disappointed.\\n\\n\r\nAs far as my personal opinion on the series as a whole, I'd love to give it a 10/10, but I do feel it wasn't really masterpiece-level as far as sound and story go. Didn't keep me from enjoying it like one, though. Definitely one I'll be buying if/when it ships overseas.\\n\\n\r\nThis isn't a series that I would recommend to everyone, but it is a series that I consider amazing. If you're not sure, pick up the first episode, stay with it until the end, and see if you'd like to watch more. Maybe you'll love it, maybe you'll never touch it again. At any rate, it's definitely one that's worth trying.",
            "date": "2008-06-23T02:08:00+00:00",
            "helpful_count": 127,
            "mal_id": 5712,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mr_utopia_man",
                "username": "mr_utopia_man"
            },
            "url": "https://myanimelist.net/reviews.php?id=5712"
        },
        {
            "content": "::QUICK REVIEW::\r\nStory: 5 (For an ass kicking bodyguard, this guy is feckless)\r\nArt: 8 (Some anim. are laughable but overall its beautiful)\r\nSound: 7 (Sound was good... can't think of anything else)\r\nCharacter: 7 (Shinku X Murasaki are the only 2 worth watching)\r\nEnjoyment: 4 (Don't watch it for the action... you'll get 'boned')\r\nOverall: 31/50 = ~6 (...what is that car doing THERE?!?!?)\r\n::FULL REVIEW::\r\nAfter reading through all the reviews, I have noticed there is nothing but praise about this show, and only one review that doesn't really explain the faults of the show. I'm here to fill in that gap. Personally I felt this show suffered from anime-itis. Don'tknow what that is? Read on dear reader...\\n\\n\r\nKure-nai in essence is, a rom-com of the 'brother/sister' sense. As you already know, Kurenai is supposed to protect Shinkurou from her plutocratic family. On the outside, it sounds like a very serious anime. It even boasts a fairly impressive backstory explaining how everything is run in the Kuhouin family. Specifically in regards to religion, polygamy, and sexism. But don't be fooled. The main story is only found in the first few episodes and the last 3 episodes. So what about the other ~6 episodes? Just typical bodyguard/vip antics and a little shounen on the side. All that is good and fun for a little bit of grins and giggles. But this show is littered with so many bad ends and inconsistencies it starts to become laughable. Bad ends in terms of only a complete idiot that doesn't value his life or the life he's protecting would do something like that. In terms of the many inconsistencies I found, feel free to read the episode discussions and find my name since they're 100% spoilerish. \\n\\n\r\nOn a technical sense, this is a very beautiful looking anime in high definition. It was so great I was actively trying to find faults in the animation and all I'm going to say is that you will laugh out loud when Kurenai puts his 'serious' face on. Other than that, they manage to have a large number of licensed products in this show, namely Maserati and Mercedes-Benz gained my interest. Another thing to notice is how the rooms at the apartment compliment the characters perfectly in style and function. And they did a real good job in making Kurenai's apartment completely dilapidated thats very unfit for a princess. \\n\\n\r\nSpeaking of princess Murasaki sure does act like one. Most people loved her from the beginning, but I'm betting its because she gets naked more than once in the first 3 episodes. As for me, I loved to hate her. The attitude towards others was something I would beat ('time out' for political correctness) my child for. But of course, since its a shounen-ish rom/com, I'm sure you can guess the outcome. The characters are a double edged sword, some you will love, others you will hate, but most you will love and hate at the same time. Thats another strong point of the show though The character chemistry between Shinkurou and Murasaki is something that most viewers don't see very often. Unfortunately, at times, some viewers can feel a little uncomfortable at some of those two's actions but apparently in this day and age its fairly acceptable. You'll know what I'm talking about when you see it. As for the support cast, they are just that... support. The show will act like they're important, but in the grand scheme of things, it just comes down to the Shinkurou and Murasaki show. People can say the support cast are unique, if you can call a poorly dressed emo, a horny college girl, a languid bodyguard, or a plain-sight undercover (oxymoron) agent as unique. \\n\\n\r\nI really, really, REALLY tried to enjoy this show considering how many people kept telling me how great it is. But there are so many episodes going off on a tangent. It also got me disappointed so many times at so many different outcomes that, after a while I just lost faith in rooting for the good guys. And for icing on the cake, 1/2 of the final episode is just pure ridiculousness. I certainly felt gypped, especially when they didn't exploit the back story as well as they should have. \\n\\n\r\nWhy does this suffer from anime-itis? \\n\r\nA) If you show me a fascinating plot with a deep background story, don't bother putting a romantic comedy in as fillers.  \\n\r\nB) The pacifist bodyguard character is played out. \\n\r\nC) Ending takes a crazy turn down unrealistic alley. \\n\r\nD) Short term outcomes becomes very predictable and uninspired. \\n\r\nE) ...ITS 12 EPISODES!! WE DON'T NEED TO SEE A WHOLE EPISODE ON WHY TAMAKI CAN'T GET A BOYFRIEND... (I had to get that off my chest)",
            "date": "2008-07-30T01:50:00+00:00",
            "helpful_count": 101,
            "mal_id": 6698,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=6698"
        },
        {
            "content": "Kure-nai is for the most part, a Slice of life, Action, Comedy, Drama. There are some that will begin this series without knowing what to expect but one thing I can assure you, is to expect a very intriguing and fairly entertaining short series.\r\nThe beginning of this series is fairly confusing and can make it difficult to understand what it&rsquo;s all about, as it seems like a bunch of random events; however what is easy to grasp is the main story. Shinkurou Kurenai is a high school student who undertakes numerous odd jobs and becoming a bodyguard for Murasaki Kuhouin (daughter of a powerful plutocraticfamily) is the newest job he decides to take on. During this time the two grow strong bonds with each other, as Shinkurou becomes sort of a parental guardian, but then something more to Murasaki. Each episode does a fine job in focusing on a random issue, yet sometimes it can seem so random that it doesn&rsquo;t make much sense (the musical). Nevertheless this is a short series that&rsquo;s worth every minute, except the ending, which does leave a few things unclear. \\n\\n\r\nFor a short series, it does boast a strong cast of peculiar characters nevertheless I believe it to be the best thing about this anime. Shinkurou Kurenai is a dispute mediator, with a very troubling background and Murasaki Kuhouin is a secluded pompous girl, who&rsquo;s longed to see the outside world. These two a forced into the current situation they are in, by the enigmatic adults they are involved with. Not to forget the friends of Shinkurou who very interesting and provide a bit more to the show.\\n\\n\r\nWhat stood out to me, in this series, was the lavish animation. The distinctive backgrounds and plush scenery were extraordinarily detailed. Also the character designs were nicely crafted and smoothly animated, however their definitions were very inconsistent when moving around. As for the music, Kure-nai sure has a good calming soundtrack but it is fairly unnoticeable. The appealing OP and ED themes are the tunes that you will notice, not to forget the amazing SFX.\\n\\n\r\nOverall Kure-nai is a very uplifting anime about being bound by customs and wanting to protect someone; although it can be difficult to determine the true nature of this extravagant series. This series provided a good deal of comedy; shown through the characters&rsquo; interactions and also some drama through the characters&rsquo; experienced hardships and gripping dialogue. Surprisingly there&rsquo;s also a great deal of action, in this carefree anime, so there&rsquo;s plenty to satisfy anyone taste. This truly is the type of anime that the average anime viewer wouldn&rsquo;t really consider watching but the experience you get from watching it is one you wouldn&rsquo;t want to forget.\\n\\n\r\n^_^",
            "date": "2008-06-24T13:42:00+00:00",
            "helpful_count": 68,
            "mal_id": 5762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=5762"
        },
        {
            "content": "I was very impressed by this anime. I honestly wasn't expecting all that much, although the screencaps I had seen looked fairly impressive art-wise.\r\nStory: Fairly original, actually, though it definitely reminds me of a darker Aishiteruze Baby. Of course, the show hasn't progressed all that far, but if it continues as it's been going, I'll have no complaints. It looks like some interesting things are up in the next episodes. \r\nArt: Not the standard anime fair, but I'm really liking it. The OP animation was really different. The actual show itself has very fluid and subtle animation, which I happen to enjoy a lot.\r\nSound: Ididn't particularly notice the background music, but the ED was pretty snazzy in my opinion. XD\\n\\n\r\nCharacters: I'm normally not fond of spoiled brats, but the little girl in this one's not that grating, thankfully. It's probably the voice. As for Kurenai, he's pretty sweet, especially when he owns the group of guys in the bar in the second ep. I love seeing the two interact with each other, it's adorable. The other characters have actual personalities, which is a plus. \\n\\n\r\nEnjoyment: I love this so far, I'm definitely keeping my eyes on this, along with Code Geass R2, Soul Eater, and Vampire Knight. (I know. A mecha anime, a shounen anime, a shoujo anime, and now this. What can I say? I have a broad range of tastes. XD)\\n\\n",
            "date": "2008-04-16T18:55:00+00:00",
            "helpful_count": 37,
            "mal_id": 4114,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38798.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ebonyskies",
                "username": "ebonyskies"
            },
            "url": "https://myanimelist.net/reviews.php?id=4114"
        },
        {
            "content": "It is difficult to assign a proper rating to a show as unbalanced as this one. This uneveness isn't even a case of certain elements of the series being handled better than others; Kurenai is both pleasing and disappointing in every one of its aspects. The animation is distinct but marred by noticeable low-quality moments, the characters are as engraging as they are entertaining, and the plot moves from being confusing to entertaining to downright stupid. There are no triumphant highs or deep, dank lows in Kurenai, but this anime does enough seesawing between entertainment and disappointment to lead to a mediocre viewing experience overall.\r\nKurenaidoes do some things right. This show's biggest strength is its complex setting, which the viewer is thrust directly into from the very first episode. The characters and their actions make little sense at first, but each of their personalities and histories is revealed as the series progresses, leaving the viewer with a very thorough understanding of the situation by the time of the climax. Another one of Kurenai's most enjoyable aspects is the relationship between Shinkurou and Murasaki. The boy-suddenly-acquires-loli plot device has been used in other works, but it's handled well here. The most enjoyable moments of this show and found in the midsection of the story, where Shinkurou is simply trying to get through daily life while putting up with Murasaki's eccentric behavior.\\n\\n\r\nIt's a shame that the staff had to throw in some hamfisted attempts at action and heavy drama into the mix as well, because Kurenai does well enough up until these scenes are introduced. It's not that these moments don't belong in the show, because they are most-likely included in the light novel source material as well, but they are handled so poorly that I almost wish they were left out. During these scenes, whatever was interesting about Shinkurou is brushed aside to make way for a bland &quot;I'll protect you&quot; male lead, and towards the end of the show, none of the characters behave consistently. The series finale is especially insulting because it absolutely trashes the intricate plot that was being weaved up until that point with a complete cop-out of an ending. It just might be better to stop watching this two-thirds of the way through.\\n\\n\r\nI wouldn't say that I wasted six hours of my life watching Kurenai, but I wouldn't suggest that you set aside your valuable time for this.",
            "date": "2008-08-05T18:20:00+00:00",
            "helpful_count": 35,
            "mal_id": 6854,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9034.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Slacks",
                "username": "Slacks"
            },
            "url": "https://myanimelist.net/reviews.php?id=6854"
        },
        {
            "content": "Kure-nai is one of the more peculiar shows of the 2008 spring anime season. It's not Kaiba in all its glorious artfaggotry but it's definitely not Soul Eater either. Most viewers can already gather from the first episode that over-the-top shounen battles are not what this show is about. Basically, Kure-nai is a story about two characters growing up, while discovering which kind of power is the kind that really matters. The kind that really matter accroding to Kure-nai is not a Kamehameha or a Rasengan, but the ability to make your own decisions, finding your place in society on your own and upholding yourvalues at any time. You know the deal.\\n\\n\r\nMain character Shinkurou Kurenai could definitely use some of this &quot;power&quot; as he is an orphan, having lost both of his parents in a terrorist attack. He's currently employed by a woman by the name of Benika Juuzawa, working as a so-called &quot;dispute mediator&quot;. Which is a dangerous job; Shinkurou's activities include beating up Yakuza and protecting various people from harm and even though he's only 16 years old, he does a great job of it. In hand-to-hand combat, you do not want to face Shinkurou since he's been trained in a secret, clan-specific type of martial arts and has some type of special weapon in his body to boot. One day he asks Benika to assign him a more complex mission, hoping to impress her and get some extra money out of it while he's at it. Benika then wants Shinkurou to protect a little girl who appears to be the heir to a traditional family called the Kuhouins. Only later Shinkurou finds out about the cruel ways of the Kuhouins and why exactly he was chosen to protect the girl.\\n\\n\r\nNow the one thing which carries this story is the bond between its various characters, most notably between Shinkurou and Murasaki Kuhouin, the seven-year-old girl. This relationship is so touching it really leads you to believe this is a romance anime about these two characters, but as one is only 7 and the other is 16, you can see this is not the case. It is really hard to describe how these characters exactly relate, but it is a very interesting bond they share nonetheless. Both characters possess loveable personalities, Murasaki being the cheeky preschooler with an extraordinary take on modern society and Shinkurou being the caring and somewhat indecisive pushover who slowly takes the form of an strong and admirable parental figure. Kure-nai is a story about its characters and the characters are great. Not to say the rest of the show is bad, but this aspect really saves it from mediocrity.\\n\\n\r\nThe first half of the story is decidedly lighthearted as we see Shinkurou and Murasaki interact with their environment in a slice-of-life sort of fashion. This is where the 8 for &quot;enjoyment&quot; comes in. While even these early episodes aren't particularly humorous I found them very enjoyable, once again thanks to lively characters such as Shinkurou's roommates Tamaki and Yamie. After a while though, the happy-go-lucky atmosphere grows old and especially episode 6 felt particularly forced. From that episode on however, the story turns gritty, new information regarding Murasaki's family comes to light and the family itself shows up as well, in their attempts to take Murasaki back at all costs. Shinkurou's situation becomes pressured and he starts to question his own strength after realizing how this job was probably more than he could handle. After seeing Shinkurou has grown in his determination to finish what he started and protect the ones he cares for most, Benika also finally starts to show her human side. By the end of the story the viewer will also find out a little about what exactly drives her, though it's really kind of an afterthought compared to Shinkurou's story.\\n\\n\r\nThe final episodes however, are undeniably silly at times. At some point there is a carchase in the snow which in my opinion was entirely unnecessary to the plot and really was there just to entertain action-fans who stuck with the show until the very end for some unknown reason. The ending itself was pretty powerful in my opinion because it was unexpected and it made me think if the characters had really made the right decisions, however at the same time it was very unrealistic and it would've been much better once again, if Brain's Base would've just toned down on the violence and ever-apparent murderous intent everywhere in the final episode. There was much more hand-to-hand action than usual near the end, which wouldn't have been bad if it wasn't for two things:\\n\r\nFirstly, it was important to the story the combat was done unarmed, to really see the link between one's physical strength and ones inner strength. This has been done really well overall, but when you really look at just the story and not all the themes woven into it, it really begs the question why not a single person opted for a firearm throughout the show. One 9mm handgun could've easily turned the tables on Shinkurou.\\n\\n\r\nSecondly, this show is not Gurren Lagann. Art-wise, Kure-nai looks excellent, but the animation quality was rather inconsistent. As mentioned before, there weren't a lot of challenges for animators to overcome as the show mainly revolves around its dialogues, but when things heated up, the animation disappointed me greatly. It always caught my attention at the moments that really mattered, and that's never a good thing. At first I was really impressed by Kure-nai's visuals but the aforementioned issues turned my rating down to a low 7.\\n\\n\r\nLastly, let's discuss sound. The first thing that will definitely catch the viewer's attention in Kure-nai is the OP. Not because of the music, but because of the visual style. If you want to know what I'm talking about you really have to go and see it for yourself. My problem with this OP is that while it's certainly not generic (which is almost always a good thing), it doesn't suit the show's feel. At all. The ED is a little better but far from a reason to watch the show in itself. It seems Brain's Base realized this after a while and they decided to fix this. How? By completely removing the OP and ED. That's right. From around episode 7 on, this show has no OP or ED. Which is sort of lazy. The last time I can remember watching an anime with no OP was FLCL.\\n\r\nHowever, FLCL still has its excellent ED and overall J-rocky soundtrack going for it. Kure-nai only has some instrumental tracks which are hard to notice while watching, but most of the time there's just silence. Which also works. In that regard, Kure-nai's &quot;sound&quot; isn't all that bad, but the Kure-nai OST is definitely not a must-have.\\n\\n\\n\r\nOverall, Kure-nai didn't exactly turn out the way I wanted it to. With this show, Brain's Base does some things not many studios have, but the the themes and morales that encompass the entire show sometimes really cause its credibility and plot to suffer. At some point, Kure-nai turns almost Shakespearian in its approach, with long, complex dialogue, even from seven-year-old Murasaki. I'd say these are things that are good to know beforehand, and that is also the reason I write this review. I hope that after reading this review, you will have an idea of what to expect from Kure-nai and perhaps you will be able to enjoy it even more than I did, because I had to figure all this out along the way.\\n\r\nKure-nai's a great change of pace from the more generic shounen and high-school series, but in the end one's opinion of this show is really something personal. Shinkurou and Murasaki's story was touching enough to me, but there's no saying if this goes for all viewers out there. Still, if this sounds like your kind of show, don't miss out.",
            "date": "2008-06-23T23:28:00+00:00",
            "helpful_count": 20,
            "mal_id": 5743,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42168.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PBz0r",
                "username": "PBz0r"
            },
            "url": "https://myanimelist.net/reviews.php?id=5743"
        },
        {
            "content": "Kurenai is a show that blends several different story elements together. It's an action thriller, complete with secret organizations and trained teenage operatives. It's a story of personal growth, with the two main characters learning what is most important to them and how to fight for it. It's a slice-of-life with quirky characters and hints of romance. This all adds up to a 12 episode show that gives you a good taste of each, while managing to tug on your heartstrings from time to time. Yet, unfortunately, for all the juicy morsels it offers up, Kurenai is oddly un-filling. There is a feeling Kurenai couldbe better had it developed some of its ideas further, and cut off some parts that were needless. The result is uneven, yet ultimately rewarding enough to warrant a watch.\\n\\n\r\nSome suspension of disbelief is required to fully accept Kurenai's story, though that can be said for a lot of anime. Our protagonist, the titular Shinkurou Kurenai, is a regular high school student at first glance. However, outside of school, he works as a mediator for an underground organization; a \"problem fixer\" of sorts, as he puts it. His next assignment is a big one, he must look after a precocious 7-year old girl named Murasaki Kuhouin, who escaped the cruel fate of women of the Kuhouin clan with the help of Kurenai's mentor/employer, Benika. This will be no easy task, as the Kuhouin clan is searching for their runaway. The other meddlesome tenants of Kurenai's apartment building don't help matters, either.\\n\\n\r\nThe focal point of Kurenai's plot is the relationship of the two leads. Kurenai and Murasaki are interesting all on their own. Kurenai was orphaned at a young age, when his parents died in a terrorist attack. He has a deep admiration for Benika, and he aspires to be as strong as her one day. He works under her in order to reach that goal. Still, he is rather meek and humble, and doubts himself. Murasaki is articulate and mature for her age, forced to grow up quickly by her clan's traditions. She's also rather haughty from being pampered, and naïve about the outside world which she was raised to have no connection. The bond between the two is one of mutual growth. In the case of Murasaki, she learns from Kurenai (an the other tenants of the apartment building) the mannerisms and ways of common people. She also learns do deal with strong emotions as the relationship between her and Kurenai deepens, as well as how to truly treasure a relationship. For Kurenai, Murasaki becomes someone to fight for, someone to protect. This not only drives him in his attempts to grow stronger, but builds his convictions; even to the point of defying Benika if he must.\\n\\n\r\nIt is good that the relationship between Kurenai and Murasaki is strong, because it is ultimately what holds the show together. The narrative of this show is not the best constructed; it consists of very loosely structured arcs, which can become unfocused. The mid-series episodes in particular are meandering and sort of aimless. This does not mean there is no development, Kurenai and Murasaki's relationship grows slowly, but the plot just sort of comes to a halt. The episodes themselves aren't unenjoyable, there are some fun situations and misadventures. However, the novelty of seeing things like the residents of Kurenai's apartment building practicing for a musical wears thin quickly. It is a godsend when the plot finally gets moving again in the last third, though the use of coincidence in kick starting the plot is a bit irksome. From there, the show delivers some hard-hitting emotional scenes, majority of the show's fights, and a mostly satisfying conclusion.\\n\\n\r\nThe supporting cast is a bit of a mixed bag. The brightest piece in the bag being Benika, who fills her role as Kurenai's mentor and employer very well. Their relationship is somewhere between business and personal. She holds the reins loosely on Kurenai and her other subordinates, but doesn't hesitate to exercise authority when it is necessary. She genuinely cares for Kurenai, but keeps a professional distance from him most of the time. Kurenai's mischievous land-lady, Yamie, is fun comic relief. As is equally as mischievous college student Tamaki. Their shenanigans with Murasaki provide most of the enjoyment in the meandering middle episodes. The same cannot be said for Kurenai's schoolmates/ potential love interests, Yuno and Ginko, who are essentially just window shopping. Both have feelings for Kurenai, and neither goes anywhere. The Kuhouin provide some note-worthy villainy, mostly from Murasaki's menacing older brother Ryuuji and the battle-crazed Lin, but aren't given all that much screen-time.\\n\\n\r\nThis show was animated by Brain's Base, but before they hit the peak of their popularity, and is one of their lesser known works. The show is a testament to the studio's quality work even before it gained notoriety. This show looks really good. The character designs are distinct, vibrant, and expressive. Murasaki's design in particular is fantastic; it hits the right balance of childish youth and demure beauty to illustrate both Murasaki's age and her upbringing. Benika's casual and yet commanding appearance fits her perfectly, as does the very formal look of her subordinate Yayoi. Ryuuji looks every bit the well dressed sleaze he is, and Lin's facial expressions are fittingly deranged. Kurenai's design has a bit of bishounen flavor to it, but is still distinctive compared to the worn generic designs that plague all too many male anime leads. The animation overall is good too, but there are some rough spots. These rough spots are most evident in the show's fighting scenes; characters don't move quite as fluidly as the trained combatants should. Sometimes their movements look kind of unnatural. Editing-wise, the transitions into fights sometimes feel choppy or abrupt, though some of the editing also makes up for the animation short-comings.\\n\\n\r\nThe music is dominated solemn orchestral and jazz pieces. Piano in particular is heavily used in the soundtrack. Usually, a show will have more energetic pieces with high tempos for action sequences. However, with a few rare exceptions, this is not the case in Kurenai. Slow solemn pieces are often used for fights, and remarkably, this actually works. The melancholic tone of the music is used to give gravity to the fights, making them serious and visceral occurrences. At times the music choices can get a bit tiresome as a few tracks are often repeated, many times in the same episode. However, this does what a good soundtrack should do: support the visuals and content of the show.\\n\\n\r\nKurenai is a solid little show worth watching despite its various flaws. At its core is a strong central relationship that carries the show through its rough patches and remains endearing throughout. The middle episodes do drag and lose focus, but once the plot pulls itself together, it delivers some emotionally gripping moments that really accentuate the relationship between the two leads. It even throws in a few good laughs and fights when it is at its best.",
            "date": "2014-04-03T22:42:00+00:00",
            "helpful_count": 19,
            "mal_id": 138569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229558.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeverKnowsBest26",
                "username": "NeverKnowsBest26"
            },
            "url": "https://myanimelist.net/reviews.php?id=138569"
        },
        {
            "content": "This anime is absolutely HORRIBLE!! Okay, to be fair, it only became horrible after episode 8. At the beginning I was rating it a 10 and placing it among my favorite animes. The plot was somewhat unique, and there was the mystery as to exactly what the girl was running from, and shinkuro's past. But as the answers start to become revealed by each episode somehow in the 9th episode the author of the anime has no idea/clue where to take the anime. The action goes downhill, which is disappointing since it is supposed to be an action genre and they turn a possible bourneultimatum-type action genre down to something you see on madtv (basically ridiculous). And just the way it ended was soooo pathetically random, I was just speechless as to how irritating it was. The only part that made my mood any better was the last 2 seconds where the focus was on shinkuro.\\n\r\nAnyways, if you MUST watch this anime watch it to episode 8, and skip to the last episode 12 if you even feel like finding out how it turns out. Otherwise, I recommend not to even waste your time on this anime since you will be horribly disappointed.",
            "date": "2008-06-20T20:04:00+00:00",
            "helpful_count": 18,
            "mal_id": 5658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/31332.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ten6cha",
                "username": "ten6cha"
            },
            "url": "https://myanimelist.net/reviews.php?id=5658"
        },
        {
            "content": "The opening shocked me. It really did. So I was kind of prejudiced against the first episode. But I soon realized, that the opening is the only bad thing so far- everything else is greatly enjoyable.\r\nThe stories are really sweet,the characters authentical, especially Murasaki is a surprisingly pleasant character. The background music supports the animation almost perfectly. Kure-Nai is would be my first-choice-series to watch after an exhausting day of work. It's relaxing but still entertaining and exciting.",
            "date": "2008-05-14T12:58:00+00:00",
            "helpful_count": 11,
            "mal_id": 4721,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/52740.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Po",
                "username": "Po"
            },
            "url": "https://myanimelist.net/reviews.php?id=4721"
        },
        {
            "content": "There are fantastic anime that focus on slice of life such as Usagi Drop or the Aria series, and  there are action based anime such as Black Lagoon or Hellsing Ultimate; then there is Kure-nai, which mixes both genres. This is a difficult task, and if handled improperly, it can tear down the whole story, which in fact happened in this anime. While it executed the slice of life part well, blending in the action was poorly done to say at least, resulting in major plot holes, as well as an unnatural story progression. This anime would have been much better off by focusingon the slice of life aspect, yet sadly didn't.\\n\\n\r\n~Story~\\n\\n\r\nThe premise of Kure-nai is simple: 16-year-old Kurenai Shinkorou, a master martial artist and professional mediator, yearning for better paid jobs, receives a request from his boss Benika to protect the young 7-year-old girl Murasaki Kuhoin. Mystery surrounds both the girl and protagonist himself, which possibly ensures a great story. This sadly not the case, as it jumps from action to a prolonged slice of life setting, than to plunge once again in the action scene; which disturbs the overall continuity of the anime.\\n\\n\r\nAs stated earlier, the slice of life moments in this show were well executed, which in this case was presenting somewhat realistic character relationships in addition to satisfying crafted everyday life events. Viewers observe how these two main characters interact between themselves and their environment, as well providing some background stories for the little Murasaki. These interactions and events can be amusing at times, which is enhances the atmosphere the anime is trying to portray. However, there is often also typical school type situations which viewers are used to see in romcom school comedies, which can be a drawback.\\n\\n\r\nNow as mentioned earlier, Kurenai needs to protect the girl from her powerful family, yet there is a problem to this: the viewer isn't provided with enough knowledge of the family to understand the reason why she even needs to be protected, even after it is revealed nearing the conclusion. Consequently audiences never or hardly ever feel any kind of tension whatsoever whenever something happens to her, be it wandering out on her own, or going out with the protagonist.\\n\\n\r\nThis brings me to the drama aspect of Kure-nai, which was poorly executed and difficult to take seriously due to various reasons: first of all, the fact that a teenager is protecting a little girl from a very rich and powerful family while attending school normally and leaving the kid alone is a huge flaw already. Other issue was the continuity of the show, that either totally focused upon action/drama or just switched to normal everyday life events. Then there is the fact that the protagonist himself is a pretty useless bodyguard, which raises the question why he even was assigned this job. Finally, the motives and characters themselves were shallow, but I will treat this topic below.\\n\\n\r\n~Characters~\\n\\n\r\nThere is a handful of characters present in Kure-nai, naturally being Murasaki and Kurenai of utmost importance. Murasaki is a young, talented martial artist and naturally being young makes it difficult for him to live on his own, consequently working as a professional mediator. His past is explored upon very superficially, and the motives on why he has this particular job are weak as well. Then there is Kurenai, a girl from a rich family with elitist behaviour; she undergoes the most character development and fleshing out of the whole cast, though her sudden change in lifestyle: from a rich environment to a dirty little room.\\n\\n\r\nThe secondary characters are of importance as well, yet these undergo near to zero character development or fleshing out. This jars the narrative of the anime, as they are one-dimensional characters with very lacking motives, which seems to make them out as simple plot devices. The friends of the protagonist, as well as his boss felt redundant in the anime.\\n\\n\r\n~Animation and sound~\\n\\n\r\nThe animation of Kure-nai was well executed, as times very well done with fluid character motions, as well as the environment. This could not be said about the background, which was well drawn in the beginning, towards the end being of lesser quality, especially when comparing it with the character's detail. Character design were slightly different from what anime viewers are used to, but was rather lackluster in fact, being the defining feature their hairstyles, as faces of the main cast were basically the same. This was however a small drawback.\\n\\n\r\nThe voice actors performed their role well, matching with each character voices, though at times emotional states of these didn't come over too well. The soundtrack used was nothing outstanding, yet fulfilled its purpose in creating the different atmospheres it was trying to relay to the viewer.\\n\\n\r\n~Enjoyment~\\n\\n\r\nWhat started as an interesting and amusing anime, changed for the worse as it progressed through a badly handled blending between slice of life and action; the character were no great help either in providing a somewhat realistic story, yet what \"saved\" it from being a disaster were the slice of life moments present its duration. I personally think this would have worked much better if it focused on the slice of life aspect. In addition, the protagonist should have been an adult rather than a teenager, as this makes it very difficult to take the series seriously, in addition to the additional question that arises as how a simple teenager could be taking care of a 7-year-old girl without arising suspicion.\\n\\n\r\nSo do I recommend this anime? Honestly I don't; I have grown to dislike the school-type of setting more and more, which may have influenced significantly. Naturally, for newcomers to the anime scene all this issues wouldn't bother that much, yet for the more seasoned viewers, I would say stay away from it. \\n\\n\r\nThank you for reading.\\n",
            "date": "2015-11-30T10:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 204517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=204517"
        },
        {
            "content": "A few years down the line Kurenai won't be remembered as a classic, hell I doubt many people will remember it now; it deserves more attention. But maybe it should be remembered as a classic. I believe kurenai has the biggest advancement in quality in production of anime ever.\r\nGoing in I didn't know what to expect, when I loaded up the first episode I was a little taken aback by the OP and my expectations were lowered a little, it seemed kurenai wasn't the type of show I might have been looking for at the time. But the OP is deceiving, catchy but deceiving. Thesecond blow to my expectations came in the first few minutes with an apparantly supernatural element. &quot;another crappy super power anime&quot; I thought. But I soldiered on and by the end of episode 2 I was hooked. Kurenai is a breath of fresh air.\\n\\n\r\nAt first I wasn't sure what it was I liked so much about it but eventually it dawns on you. The characters, are having conversations. In every anime up till now, everything I've watched has had statements with arkward pauses inbetween, you might not have noticed it but after watching kurenai you might. The secret is, and to my knowledge kurenai is the first to do this, the show is animated based on the voice actor's recording. Finally the actors are released from the shackles of arkward animation timing, and the result shines. Kurenai is wonderful to listen to, you can hear more emotion in the voices than ever, lines are said at the right pace and I felt like the actors had even been allowed some improvision in the script to fit their characters. The advantages don't stop there, so far kurenai has the best lip syncing of any show i've seen (not so say it's perfect, far from it) but the dialogue flows wonderfully and there are conversations with 3 people at a time (to fansubbers regret) which help give the show so much character.\\n\\n\r\nKurenai isn't a one trick wonder.\\n\\n\r\nThe art is above average, with some varied enviroments beautifully drawn (especially towards the end), although a good amount of the show is set in one or two locations. The animation however, is not amazing. Although usually the characters move quite fluidly in some high movement episodes you can see they were stretching the budget and some of the animation becomes a little arkward. Some of the fight scenes look a little silly as well but in general the show has good art direction. The characters are all very uniquely drawn and you can see some of their personality in how they move, more subtely than other shows.\\n\\n\r\nBefore I talk about the characters, I should explain what type of show kurenai actually is. kurenai is not harem, despite being surrounded by woman. Kurenai is not a super power show, despite Shinkurou arguably having one. Kurenai, to me, is primarily a coming of age story for Murasaki and Shinkurou. It unravels the show using a mixture of comedy, drama and action (to a lesser extent).\\n\\n\r\n The story is good. It uses the past of some characters to explain their motivations while others are revealed as the story progresses. Although the story is initially quite sinister, it lightens up to the Shinkurou - Murasaki relationship for the bulk of the series, before taking a darker dive than I was expecting for the climax. The story is paced well and serves its job well enough, the really great thing about kurenai is the characters. it's a little bit of a shame this show wasn't given a longer run. I know theres more manga material out there (which it follows, except for the ending which they had to improvise). On that subject, the ending wasn't the best ever, without giving too much away it seemed like a compromise was made which didn't really fit with the circumstances and the attiturdes of some of the characters but it does tie up the show and leave some space for a sequel (please?).\\n\\n\r\nDuring the &quot;slice-of-life&quot; part of the show you learn about Murasaki, Shinkurou and his neighbours, friends and &quot;employer&quot;. The character's all have a fun, strong personality without exaggerating to the point of Naruto or something. Infact subtelty is one of my favourite part of the show. It doesn't shout everything at you, rather it treats you like an intelligent viewer more than most and lets you make your own conclusions. The character history is incomplete, and a lot is implied, much of it through dialogue.\\n\\n\r\nThe humour in the series is great, amazing. Cross gender jokes without &quot;haha she fell and you saw her panties&quot; and the most mature humour i've ever seen in an anime. Episode 6 put me to tears actually and the show is littered with funny dialogue.\\n\\n\r\nSo I better end this ridiculous wall of text here. Kurenai is one of the best shows I've ever watched and if other shows took a page out of its book the quality of animes would increase greatly. Huge kudos to brain base, the creators. I refrained from giving it a 10 for its flaws but its definitely close. So in conclusion watch this because it might be the best under appreciated show ever and then get everyone else to watch it so it gets the attention it deserves.",
            "date": "2008-08-04T08:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 6819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sanchez",
                "username": "Sanchez"
            },
            "url": "https://myanimelist.net/reviews.php?id=6819"
        },
        {
            "content": "Once in a while you come across anime from which you expect pretty much nothing to begin with but you see a couple of episodes and find yourself having the urge to continue watching until the very end. ‘Kurenai’ was one of them for me. \r\nThe story revolves around Kurenai Shinkurou, a high school student who works as a dispute mediator. He possesses abundant martial arts skills and accepts requests from his employer Juuzawa Benika to resolve trifling conflicts and the like. When he demands for something more challenging, Benika consigns him the job of protecting a seven year old kid, Kuohouin Murasaki who belongsto a highly influential and plutocratic household- the Kuohouin family. Having no clue about the young girl’s background, he accepts the job after a bit of hesitation. How Murasaki responds to the world of the commoners and forms bonds with the people around her while constantly battling against the depressing memories of her mother and life at the Kuohouin household are the main focus of the story. \\n\\n\r\nWhile the plot, in itself, may not sound much unique or intriguing, the way it is carried out is quite good.  For a short anime with twelve episodes, it was an enjoyable watch.  The premise of the first few episodes is Murasaki learning new things and getting acquainted with the people related to Shinkurou, and how she finds joy in little things which she was devoid of. Every episode was fun to watch and none of them felt boring. Not to forget, there were a few moments which were quite amusing to me.\\n\r\nThe cast is entertaining to say the least. The characters are so vibrant that you can’t help but like them. The protagonist Shinkurou, the cheeky Murasaki and their neighbours— they are such an interesting bunch. One character I personally didn’t like was Houzuki Yuuno, not only because it is infuriating to see people who try hard to gain attention but also because she didn’t seem to have much of a role except that of following around the protagonist. Well, every harem anime needs one I suppose. On that note, this isn’t exactly a harem. While it will be incorrect to say that harem doesn’t exist, it is more or less a side dish which is good in this case at least. \\n\\n\r\nThe OST is average. Most of the soundtracks were barely noticeable. The only soundtrack that I like is ‘Wasureenu Omoi’ (look for it in Youtube) which played during a dramatic scene in the last episode if I remember correctly. The OP is nothing great either and the same goes for the first ED. The second ED on the other hand is catchy and I liked it. \\n\r\nThe art is sharp and vivid, and the animation is done really well. The backgrounds are simple yet attractive.  The character designs are pretty good too.\\n\\n\r\n‘Kurenai’ is not something that I’ll recommend but even so, do give it a shot if you ever feel like. \\n",
            "date": "2012-06-09T04:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 62987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503355.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Rika",
                "username": "_Rika"
            },
            "url": "https://myanimelist.net/reviews.php?id=62987"
        },
        {
            "content": "This anime has good animation and a likable lead character but ultimately is somewhat mediocre.  For one thing, the plot is not believable.  A girl must go into hiding, and thus she is given to a high school student who is absent half the day.  She is freely taken into public places, her appearance is not changed, and frequently there are moments where disbelief cannot be suspended at the actions done with this girl who is supposedly \"in hiding\".  This could be ignored if the characters were very good.  The lead, Shinkurou, was interesting enough, but very few of theother characters are.  Murasaki is alright, but somewhat repetitive.  The female love interest is dull, while another, more interesting female character from Kurenai's school is ignored for the most part.  Frankly the series simply feels a bit aimless.",
            "date": "2009-09-07T20:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 18514,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Theowne",
                "username": "Theowne"
            },
            "url": "https://myanimelist.net/reviews.php?id=18514"
        },
        {
            "content": "For my first ever review, I wanted to give it to the show that showed me the joys of low expectations.\r\nI was watching a bunch of Top 10 Anime videos with a couple of friends just for kicks when one of them recommended this show to me. The guy reviewing the shows was downright embarrassing to listen to, I think it was probably the weird accent, but I guess he must've been pretty good if he got me to watch the show. So with pretty low expectations, I decided to give the show a try.\r\nStory: 8/10\r\nSo to begin, the story was pretty original from whatI've usually seen and you may even learn something about the history of some of the darker parts of Japanese culture. You have the protagonist, Shinkurou Kurenai, a high schooler, who takes on odd-jobs for his employer, Benika Juuzawa. One day Benika brings a young girl named Murasaki Kuhouin to Shinkurou, asking him to take care of her while she is in hiding from her family. Although Shinkurou seems pretty serious about his work and agrees to the job, he doesn't fully understand how hard it is taking care of another person until he comes home from class to find Murasaki missing after her first day away from home. Without spoiling too much, the rest of the story is about the heartwarming relationship Shinkurou and his neighbors have with Murasaki. At the final stretch of the series (which to me was the most satisfying part) the show changes from a lighthearted slice of life, to a melodrama revolving around the dark past of the Kuhouin family.\\n\\n\r\nArt: 8/10\\n\r\nI really appreciate how the anime uses a different style from the source manga to differentiate itself. Although I haven't read the manga myself, from what I've seen, the changes were well called for. I personally enjoyed the dark color pallet used throughout the show and I thought the character designs were great and very fitting for each of the character's personalities. I also really appreciate how Murasaki actually looked like a kid instead of a typical loli-type character (looking at you manga Murasaki).\\n\\n\r\nSound: 10/10\\n\r\nThe performances were incredibly believable, especially Aoi Yuuki's performance as Murasaki. Yuuki seems to capture that immature brattiness of kids really well without making them seem too unlikable. Miyuki Sawashiro is also very talented in most of her roles and Shinkurou is no exception. The supporting cast also does very well with what little screen time they are given.\\n\r\nThe soundtrack is one of my all-time favorites in anime ever. I guarantee you that even if you don't notice it while watching, the dramatic scenes are greatly enhanced with the use of those amazing piano pieces by Ken Muramatsu. From the upbeat slice-of-life tracks to the tempo downed drama tracks, the OST has it all. To this day (at least at the time of the review) I still listen to the OST because it's that good. \\n\\n\r\nCharacter: 9/10\\n\r\nThere was not a single character I disliked, which I think is pretty amazing considering there was only 12 episodes to flesh out each one. Even if the antagonists aren't really the type you're supposed to sympathize with in this show, their motives play a crucial part to the story. Shinkurou's neighbors, Tamaki and Yamie, were the most surprising characters of the story. I don't want to spoil too much, but I think because I didn't really expect much from them, I ended up enjoying their presence and relationship with the kids a lot. A special shout-out to Benkia's assistant, Yayoi, who does a lot more than what she's asked to do.\\n\\n\r\nEnjoyment: 10/10\\n\r\nI love this show with all my heart and even though it's not really smart or special in any way, I was seriously happy watching it. Although it was not long ago when I watch it, I feel a sense of nostalgia just remembering that I had. If I could erase my memories and watch it again with the same low expectations, I would. Sorry to anyone who reads this review though, your expectations might be a little higher because of me.\\n\\n\r\nOverall: 9/10\\n\r\nOn my official list I gave the show a 10/10, simply from the enjoyment and comparison to other shows I've watched, but if I had to rate the show in a vacuum, I'd give it a 9. It would be hard for me to recommend this show to other people simply because I can't guarantee that people will experience the same nostalgic feeling I had when watching it. Even so, I hope that whoever reads this review will give it a shot. Thank you for taking the time to listen to my opinion.",
            "date": "2016-08-17T22:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 227007,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jcrowly",
                "username": "jcrowly"
            },
            "url": "https://myanimelist.net/reviews.php?id=227007"
        },
        {
            "content": "Preface: The Kure-nai anime is a truly underrated gem of the medium; it is a shonen that transcends the limitations and trappings of its demographic into something adult and intelligent, and into what I find to be one of the best shonen anime of all time and it also happens to fall into that 1% of \"anime adaptations that are better than the manga/light novel/visual novel they are based off of.\" \r\n*I would go into length about the differences between the anime and manga, but it would be too extensive for this review, so I'll have it on file if anyone wants clarification later*\r\nWhen Iheard about Kure-nai back in '08 and read up on the premise, my tastes were too underdeveloped at the time and I dismissed it as some dull slice of life (in a laymen sense) story that wouldn't satisfy my adolescent male cravings for boisterous shonen action. A few years later, as my tastes have become more refined and open, I come across a review on the series  and decide to take a look at it and seeing that it was a rather favourable review, I decided to check it out under the assumption that it was almost purely slice of life (again, it a laymen sense) which I was more accepting towards. Ironically, it turns out that Kure-nai does have action in it; some of the most visceral, well choreographed and intense martial arts I've seen in an anime that is. With that said, the action was a great bonus, and for those of you at the very least looking for some quality martial arts battles, then definitely give Kure-nai a shot for the fighting and stay for the story. I think that it can serve as a nice entry way into good storytelling in shonen anime and other anime in general. As to why Kure-nai is such a great anime and happens to be my current #3 top anime, let's dig into the meat of the review shall we?\\n\\n\r\nStory: Kure-nai, at its core, is a simple story; a young man working as a part time mediator is assigned an additional job on the side to take care of the young daughter of an aristocratic family while trying to juggle his job as a mediator, his school life and his home life where he lives in a shoddy apartment with 2 other eccentric patrons. Our titular \"protagonist\" Shinkuro Kurenai is the 16 year old mediator in question whose parents were murdered when he was young and he was rescued by his mentor and fellow mediator Benika Juzawa, who left him in the care of the Hozuki family household where he would learn their style of martial arts and get a special bone blade transplanted into his elbow for emergencies. He eventually moved out of the place and found an apartment on his own with the payments from his job as a mediator to support his stay. Then there's the other most important character in the anime, Murasaki Kuhoin, who is seen being taken (rescued) from her family's manor at the start of the series by Benika and her assistant Yayoi Inuzuka, and being entrusted to Shinkuro. She is initially very impetuous and haughty, speaking in a sophisticated yet arguably archaic prose and believing the world around her to be her personal oyster, like treating a bath house clerk like a servant and not giving thanks, expecting to be given treats and such regularly. Shinkuro begins to teach Murasaki about societal folkways and mores that she is not used to due to her sheltered upbringing in a prestigious family and we see the contrasting lifestyles and norms collide. From there, the series starts to take off. Being predominantly character driven, the story focuses on our 2 characters growing their bond, growing as individuals and growing as members of society with all these different scenarios and characters coming into play to help them blossom with things like Shinkuro trying to negotiate with shady figures that usually end up getting rough, Murasaki trying to occupy her time at the apartment while Shinkuro is at school, the 2 going out shopping or on play dates, and many more. We later learn about Shinkuro's tragic past and the reasons for Murasaki's kidnapping. It's all executed so well due to the exceptional writing that doesn't let things become formulaic, allows for balanced tones and conflicts, creates smart, subtle humour and not crude trite often seen (episode 6 is a riot, don't skip it), doesn't become steeped in melodrama and moves the story at a slower, but more enriching pace to its benefit coupled with some interesting cinematography and things like juxtapositions to add value to certain scenes. The action is interspersed over a few of the earlier episodes before becoming the focus in the last third of the series, but I'll refrain from delving into spoiler territory too much. The fights themselves are visceral in every sense of the word; you can almost feel every little contortion of flesh and bone with each blow, the movements are very fluid and expertly choreographed while making the environment feel like it actually has obstacles to it that get in the way. The characters aren't flying around all over and blasting beams at each other, and typically the place they are fighting in isn't conveniently spacious, so a character might get cut off by a chair, get caved in, etc, it is believable and well executed. Overall the story centralizes character growth and living as aforementioned, so early episodes involve some mundane stuff and a lot of conversation, but the mature dialogue, nuanced emotions, solid interplay, refined prose, natural tension and precise timing all culminate to make for a really engaging and really human drama. Whether it be Shinkuro chatting at school with friends, doing negotiations with people, him and Murasaki doing chores, Murasaki doing stuff by herself or anything else, it is all captured with meticulous detail for realism and not a single event feels superfluous or unnecessary. The final arc also happens to be a tour de force, really bringing the themes home, with Shinkuro questioning his strength in an refreshing and hard-hitting way unlike the typical shonen executions of it, along with the morals behind breaking out of an impersonal worker-client in order to make a change which leads up to a battle not of good and evil, but of freedom of expression for man as an individual v.s. punctual tradition for fortifying a status quo, making for a well constructed grey area as ideals clash as well as the morals behind family and the love shown to members of a family unit (trying to be vague to avoid spoilers) and all topped off with an ending that has reasonable goals and compromises for all sides that may be initially bittersweet, but touching in the end, and overall, I found nary a flaw in the whole thing. To conclude the story portion, I'd like to draw up comparisons to 2 anime: Bunny Drop and Rurouni Kenshin: Trust and Betrayal (moreso the former). I really love Bunny Drop, but I find that Kure-nai balances events better in terms of the child raising, not to say that Bunny Drop is bad by any means at doing its child raising well (quite the contrary) I just find Kure-nai is less linear and is able to show the events of both Shinkuro and Murasaki in an episode where they are apart whereas Bunny Drop will focus on either Daikichi at work or Rin playing in particular episodes besides the scenes where they are together, so I like how Kure-nai is able to handle multiple focal points like that and we aren't kind of left out on certain subplots or events for one side or the other, so it is more cohesive and rounded. As for RuroKen, it is mostly a stylistic thing, but I'd just like to note that Kure-nai's final arc also has a rich, picturesque snow blanketed locale with a very heavy and tense atmosphere due to the content, and things proceed with just as much elegant pacing and tone as Trust and Betrayal, so do be sure to keep going with the series if you are having doubts and/or love Trust and Betrayal to see such a powerful and splendid final act. 10/10\\n\\n\r\nCharacters: Again, being a character driven story, it is all about the characters, and the core duo and most of the supporting cast are multi-layered and believable human characters that you will grow on; although there are some hindrances, they are largely subjective. Shinkuro is a timid, humble and self-sufficient teenage boy just trying to get by in life with having to juggle so many things in his rough life; he is sincere and earnest, but can still be adamant and strict with Murasaki. He lacks some personal confidence, but is nonetheless devoted and compassionate. Murasaki starts out as a spoiled and whiny little girl with a brazen attitude, but over the course of the series, she settles down and blossoms into a very considerate, responsible and mature little 7 year old. Benika tends to be a rather reserved, sometimes stern person but also has a sharp tongue and is very optimistic and caring. Yayoi happens to be a tad thinner in personality than most of the cast, being mostly one note, brazen and subservient to Benika, although she does undergo something of an epiphany learning about strength through Shinkuro to help loosen up a bit. Ginko also is a little lackluster compared to some others, but has some subtle little soft spots beneath her blunt veneer and also happens to have a bit of a backstory with Shinkuro. Yuno is very kind upfront, but equally as assertive and strong with her convictions, being a sweetie with a rough side you don't wanna mess with. Tamaki is the eccentric, promiscuous patron living in the same apartment as Shinkuro, she is somewhat like Yuno only more carefree and playful whereas Yuno is more of a quiet yet passionate person, however, while Tamaki tends to wear her pride and flirtatiousness on her shoulder, she still feels some resentment towards herself for being too loose and not willing to settle down or be able to maintain a long relationship. Yamie is...an enigma really, so you could consider that a flaw in that little is exposed of her, but that is also part of her charm as the cunning witch that she is. Renjo Kuhoin is Murasaki's father, he appears to be a tightwad who simply amounts to the principles of the Kuhoin namesake rather than being a real person, when in actuality he cares deeply for his family and feels there is a bit of injustice in his family's system, but he is too fearful of the burden of being one to go against tradition and listen to his feelings. His son (whose name I'm forgetting) is something of a foil to Renjo, he's extroverted and merciless and puts his pride as a Kuhoin above anything else and is very blatant about it. There's also Renjo's wife Kazuko who is one of the most arrogant and vile individuals in the series with that being the only real feature to her character, however if you want to take into account Western beliefs on characterization for villains or those of a similar ilk, having a real backstory for her and demistifying why she is so cruel would ruin a bit of her presence, similar to how people panned Kevin Smith for making a comic about the Joker's backstory. This is also seen in Lin-Cheng Shin, Renjo's son's bodyguard who is absolutely a psychotic nutcase who only desires for a fight, serving as a byproduct and raw exemplification of the son's spite and cruelty, sans the social and political connections to hold her back, making her a devastating individual. Lastly Souju Kuhoin is Renjo's sister who is the anti-thesis to Kazuko as a sweet-natured person and cared far more for Murasaki than Kazuko did, but she isn't shown too much. All in all the characters all serve a purpose and have well rounded personalities for the most part explored sufficiently while sticking to their more prominent traits to make them stand out, with a lot of subtleties to illuminate on them more which you catch onto after watching. 9-10/10\\n\\n\r\nArt: The artwork for Kure-nai is exceptional. The characters don't have super moe, over the top features and their faces all look well drawn and seriously designed to complement the nature of the series. Settings have a diverse palette with rich colours including lots of sensual reds (heck, Kure-nai translates to 'crimson') and other exquisite tones that give it such an alluring feel. There's stellar use of shadows and lighting to accentuate the fantastic palette and make superb gradience. Backgrounds possess a lot of life evoked by the complements of aforementioned factors to make the mundane settings feel alive and lifelike, and then there's the Kuhoin manor's outside with a heavy atmosphere, great texture and an invigorating air to it all with the almost ethereal snow fields caressing the trees in winter and all the leaves and different things in the frame, and the Kuhoin manor itself which touts the most of those vibrant reds with a nicely stylized old Edo-esque aesthetic and all of these vivid designs to make things really pop. Kure-nai has a lot of eye candy, moreso innately with stuff like the Kuhoin manor, but nonetheless is great to look at. 10/10\\n\\n\r\nAnimation: The animation for the series is a bit inconsistent, but has a lot of high points, evident by the fight scenes which spare no expense and don't use any shortcuts or stylish standalone frames, everything happens real time, non stop and right on camera. Meanwhile it can sometimes render things with kind of a 'soup-y' quality to them, kind of melting off and not being totally clear. Episode 6 seems to have an abundance of it, but it is more for effect in that case and something of a more comedic episode. Still, at times it can look a tad awkward, like this one scene in the final episode involving Shinkuro, it's pretty obvious when you see it, and it comes off as a bit inadvertently comedic for an instant. Overall it still has great highs with special complements to the fight scenes for how stunning they look. 9/10\\n\\n\r\nMusic: I'm no expert on music, but the soundtrack for Kure-nai just sounds lovely, simply put. It further complements the stuff on screen with mesmerizing piano songs that are very romantic and captivating, like going to a ritzy, sophisticated bar or high class outing or cozying by some regal fireplace quality. Refined and relaxing, these songs total justice to the series and are great for savouring and unwinding yourself with. 10/10\\n\\n\r\nEnjoyment: Kure-nai is not for those with short attention spans or those who need something large scaled to happen every couple of minutes, but for myself and others who enjoy anime of a more heart warming and tender nature that's audacity builds gradually, Kure-nai does wonders. The dialogue had life and realism to it, the atmosphere was both enchanting and immense, the pacing was natural, the writing and plot was sharp and investing, the production values were excellent, the fight scenes were breathtaking, the composure was refined, the characters were memorable and the themes were poignant. I have no complaints, Kure-nai was a belly full for my soul. 10/10\\n\\n\r\nIn conclusion, Kure-nai is a seductress, or a tamed lion even; it has all the looks, the composure and the atmosphere to make it a captivating creature and it has bite with its bark. Although it may not always speak loudly, when it does, it is ferocious, and when it is quiet, it is beautiful and touching. The manga can't hold a candle to this adaptation; it is juvenile in comparison, although I still must give thanks to the manga creators for laying the groundwork for this liberal, but far superior adaptation. Despite the anime adapting about 1/5th of the manga, it tells it with a much more resolute passion, and quantity should not take precedence over quality, nor does quantity equate to quality. The 2008 Kure-nai anime is quality. Do yourself a favour and watch it, even if you are big on crazy supernatural shonen fests, if you like a good story, give it a shot and you might get more diversity to your tastes while having the great fights to hold onto. I can't recommend it enough, it is an underrated anime gem and one of the greatest shonen anime of all time, and perhaps even one of the greatest anime period.",
            "date": "2013-11-06T19:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 119523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1999512.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AngelsArcanum",
                "username": "AngelsArcanum"
            },
            "url": "https://myanimelist.net/reviews.php?id=119523"
        },
        {
            "content": "This anime is rather difering from the mainstrem types of stories (I.e Boy meets girl--Girl falls in love with boy--A conflict ocurrs--Conflict is solved--They live toghether happily). \r\nStory: While the concept of a guy guarding a young girl is nothing new, the way in wich the story is presented and developed is rather original. While at first it apears to be a street/underground fighter anime, it is really about the characters personal growth.\r\nArt: The art is one of the first things one can notice in this anime, the image is very sharp with a somewhat dark tone wich give it a realistic look and afluid animation\\n\\n\r\nSound: Ther is no much music apart from the sassy opening and the energetic ending.\\n\\n\r\nCharacters: Characther develoment is the main theme of the anime, all the characthers have a sad/traumatic past or chaotic background  of their own and are striving to improve themselves and (specially in Murasaki's case) understand and the world that surrounds them.\\n\\n\r\nEnjoyment: Although some maturity and taste for true romanticism are required to truly apreciate some of the plot points of the anime, it is virtually  imposible not to enjoy it's unique charactheristics and fast-pacing mainttain the viewer fosused if not captvated untill the very end.",
            "date": "2008-06-23T06:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 5716,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DiGuardian",
                "username": "DiGuardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=5716"
        },
        {
            "content": "Kurenai is about a young girl, Murasaki, on the run from her families' strict traditions, and Shinkurou, a poor student, who also has the job of settling disputes (usually violently), hired to be her bodyguard. (You'd think a dangerous job like that would have decent pay, but whatever)\r\nThe series mostly follows daily life, as Shinkurou learns how to deal with Murasaki, goes to school, and takes a few other jobs. While Murasaki learns about life, and how to have fun, with help from Shinkurou, and the other inhabitants of the apartments where they live.\r\nAll the characters are interesting in their way, and each fits intotheir part of the story well. The humour in the series is all character driven, just watching the way people (particularly young and impressionable Murasaki) act/interact, such as during the 'family' dinners the apartment dwellers have. Whether being dramatic or humerous, I never really felt the characters acted in a way that didn't make some sort of sense.\\n\\n\r\nNear the end, the series switches to mostly action, and it's well done, though it might not be as interesting after the character-based parts. Still, it's hard to imagine the series getting to the end any other way.\\n\\n\r\nThe ending is open, possibly TOO open, and many will probably have a sense of annoyance at the fact. However, in all other aspects, the ending is well done, and avoids being entirely predictable.\\n\\n\r\nThe art is generally nice, but there are times when the animation quality drops, and things get ugly, usually people's faces. Though, when combat kicks in, everything moves fluidly, and looks great.\\n\\n\r\nOverall, this is a good, humerous, character-driven series, with some nice action thrown in for good measure. The fact that the series seems to place the focus on character-development over story might bother some people, however, I think that given the interesting characters, it works well.",
            "date": "2008-11-19T22:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 9688,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25782.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/alx222000",
                "username": "alx222000"
            },
            "url": "https://myanimelist.net/reviews.php?id=9688"
        },
        {
            "content": "Rifling through the anime I had to get through, I remembered that Kure-nai had piqued my interest after the first episode, and in the lull of things, I decided to finish what I started.\r\nNow the story is about young dispute mediator asked to guard a young girl.  Now at first the only thing that came to mind was, there is something deeper afoot.  Sure enough, Kure-nai is rather shy with it's revelations and that just begs for the viewer to continue on until everything is over.  In this regard it is well executed.  As always, some of the scenes may notmake sense until it is later explained but that is to be expected of this offering.\\n\\n\r\nThey went for a realistic approach in Kure-nai, which works well at points but sometimes results are either a victim of the uncanny valley or just plain disturbing.  Especially the a fight scene involving our protagonist and his principle's brother.  Speaking of fight scenes, though they may be brief at points, they are a visual treat thanks to the fluid animation.  What I especially liked as well was the background art.  The hues and lighting really set mood and are very well done.\\n\\n\r\nSound on the other hand, could have been better handled.  The background music is satisfactory already but what I really had a gripe with were the sound effects. Physical contact sounds like they were sprung out of a can of stock sounds or out of a video game (which I must admit I feel as if I've heard them from somewhere else before but I digress).\\n\\n\r\nThe plots is character driven and thus characterisation was given some priority as well.  Our protagonists lives charmingly mature in to real people as they live, struggle and come to grips with each other.  What is really admirable is their courage.  For our protagonist hero it is how he deals with the mistakes of youth and protagonist heroine how she stands up for her freedom.  Our supporting characters are not forgotten as well.  Each have a deeper side to them as it is slowly revealed by others or inferred from what they say and how they say it.\\n\\n\r\nOverall, I enjoyed Kure-nai.  The well written characters and the plot that surrounds it.  And to a lesser extent I enjoy the somewhat more realistically grounded fights.  Personal favourite scene would be the episode involving the musical, which I would describe as classy.  I'm heartily recommending this as something may not be unique to some but well executed.  If you're looking for something nice and quick, this isn't for you since Kure-nai takes good time to enjoy.",
            "date": "2009-02-04T00:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 12118,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109544.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Thaiberium",
                "username": "Thaiberium"
            },
            "url": "https://myanimelist.net/reviews.php?id=12118"
        },
        {
            "content": "Story is between okay and good in the first half, but become literal crap in the later portion of the show. The battle system is broken. You could not tell who is stronger than who. Someone can suddenly become weaker or stronger for the convenience of the plot. Also, it can really cause some frustration with the \"I don't want to use my full power\"-stereotype. \r\nThe art is really unique for a light novel adaption and is pleasant to look at. It is similar to many late-90s anime with its toned down color scheme.\r\nThere is not much to say about the music. It gives theshow an unique vibe, but can be underwhelming during emotionally intense scene.\\n\\n\r\nThe heroine deserved a better a story to be in. She is lovable and realistic up until the last 2 episodes where she became an uninteresting typical tragedy princess trapped in a castle talking things not fitting of her age. The protagonist is good-looking but with annoying personality. Other characters are just generic.\\n\\n\r\nI enjoyed the show up until episode 7 with little complaint. After that, the show progress into its \"climatic\" final arc where characters' intention make no senses.\\n\\n\\n\r\nThe protagonist:\\n\r\n\"I promise I will help you no matter what\" -> \"Someone is taking her away, but I don't want use my full power\" -> \"Nah, it is just a job given by my boss. I learnt valuable lesson from it. I will not make the same mistake again\" -> \"She need my help, let's go help her\"\\n\\n\r\nBenika:\\n\r\nThe most annoying character in the show.\\n\r\n\"I trust him even though he fucked up every time and there is a 98.9125% chance that he will still fucked up\"\\n\\n\r\nYayoi:\\n\r\n\"I don't want to use my full power even though the lives of my boss, a boy and myself is at stake \" -> \"Nah, let's me use my full power\"",
            "date": "2017-12-15T14:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 265285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Nealiam",
                "username": "Nealiam"
            },
            "url": "https://myanimelist.net/reviews.php?id=265285"
        }
    ],
    [
        {
            "content": "Kurenai is the 08 spring anime I had the highest hopes for, and I surely wasn't let down by it.\r\nThe artwork in the series is amazing. The main reason for this is the coloring - it's so vivid! It's sharp and varied colors, something which - as of what I've experienced - is unprecedented. The detail may skimp a bit now and then - which drags it down to a 9 (yes, I wanted to give it a 10). Oh, and the OP theme animations is pretty whacky - which is both good and bad.\r\nThe characters are as colorful as the animation is, even theminor characters. I really liked that, because it makes it oh so more realistic. And it's not only the characters as individuals, but also their relationships which I really loved. That does cover well up for the lack of character development that a 12-episode series is pretty much doomed to have.\\n\\n\r\nThe story in itself is very good too. It starts out very slice of life-ish, going with an episode-by-episode format, where Murasaki learns how the real world looks - after all, she's just escaped from being locked into a house with the most woman-discriminating family I've ever heard about, both in fiction and real life. But that being said, the episodes were great, because so much seemed to happen - often they featured parallel stories with Murasaki and someone else (often Shinkurou's two female neighbors) in one, and Shinkurou in another one. Halfway into the series, and a few episodes more, the series takes a drastic turn, and the more dramatic sides of the show starts to unfold, in contrast to the often light and comedic moments of the earlier episodes. It all culminates into two-three episodes with much action and drama, and an end which you're either gonna love or hate - I can't say more without spoiling anything.\\n\\n\r\nThe soundtrack is jazzy, and fits right into the scenes and the mood. Personally, I liked it, but it wasn't anything spectacular, and if you don't like the jazzy type of soundtrack, you can find comfort in the fact that you often don't notice it at all.\\n\\n\r\nI really enjoyed this series, both because of its mix of many genres, special animation and wonderful characters, but also because of the calmness this anime presented. Even during the most intense scenes - either emotional or action-packed - I found it to be very calm. Personally, I think that gave the series that little extra which made me love it so much.\\n\\n\r\nTo 'Not Helpful' voters (and you 'Helpful' voters too): Feedback greatly appreciated =)",
            "date": "2008-07-15T04:52:00+00:00",
            "helpful_count": 261,
            "mal_id": 6293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11081.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheLlama",
                "username": "TheLlama"
            },
            "url": "https://myanimelist.net/reviews.php?id=6293"
        },
        {
            "content": "A couple months ago, I decided to scout out some of the series in the Spring 2008 anime season. I found Kure-nai, and decided to give it a try. The OP scared me, and I almost turned this into an instant \"drop.\" Really glad I didn't, because this show was a rare find.\r\nStory\r\nWith only 12 episodes, it can be difficult to turn out that perfect storyline. Even so, they did a good job. The show is focused around the inner struggles and relationships of and between a seven-year-old aristocrat girl and her bodyguard, a poor, sixteen-year-old high school student. Nothing mind-blowing, but a sufficient premiseall the same. However, it's paced very well, fast when it needs to be and slow when it's appropriate. I never felt the series get dull.\\n\\n\r\nRealize that this is a both a comedy and a drama, and in my opinion, it does an effective job at being both. However, there is some action mixed in. It's enough to give the series an interesting push, but it seldom drives the story. Adrenaline seekers, you will be disappointed. That said, I thought the action was handled quite well, and the fighting that does occur are some of the most intensely emotional scenes within.\\n\\n\r\nArt/Sound\\n\r\nWhile the media of the show was pretty high-quality, it has a tendency to go into estrogen overload mode, and that proved a bit trying for me. Pastel colors, curvy lines, and high heels galore. I got more used to it as I went along, but I still skipped the OP and ED most of the time. But that's an issue of taste, and in all honesty, it really wasn't all that bad. It was actually pretty well-animated, too.\\n\\n\r\nI didn't care for OP/ED songs themselves, and I felt that most of the background music was pretty unmemorable. I say that because I really can't remember much of it at all. I know the music effectively aided the visuals, but it's probably not what I'd listen to standalone. However, there is one song that struck me, one usually played during the most intense moments of the anime, and it has stayed with me the way few can: a lonely, haunting piano playing a melody as beautiful and sad as the tune of an old music box. This alone may be enough for me to get the OST.\\n\\n\r\nCharacter\\n\r\nThe characters were strong. Certainly Shinkurou and Murasaki were done well, but the support cast was also impressive. In only 12 episodes, there wasn't quite enough time to really delve into most of them, and it could be argued that only a handful of the characters actually play any sort of vital role to the story. But even without seeming &quot;significance,&quot; they take the story and make it alive. Shinkurou and Murasaki have friends and neighbors, personal lives, and human bonds with the people around them, and it is those they interact with that gives the series its feel of realism. I found myself interested in the side characters, and I think I could watch Kure-nai again even just to see more of them. I was also impressed with how they took such an overbearingly female cast and a story with romantic undertones and prevented it from taking on &quot;harem&quot; clich&eacute;s. The support characters all seem to represent different aspects of and attitudes toward life, and each gives the series a unique insight into the story.\\n\\n\r\nShinkurou and Murasaki were even stronger characters, though. They, too, were very human, and at times painfully so. Murasaki, the lovable, huggable bundle she is, has led a life that has left her bizarrely mature in some areas and frustratingly impossible in others. Shinkurou, for all the good in his heart, has his own set of shortcomings, and sometimes you find that he's not the fearless hero you want him to be. The relationship between them, however, is the best part of the show, and before you scream pedophilia, know that the relationship does not, at least in my opinion, carry sexual undertones. It's really quite a clean and healthy situation between them. Creepy people, you too will be disappointed.\\n\\n\r\nAs far as my personal opinion on the series as a whole, I'd love to give it a 10/10, but I do feel it wasn't really masterpiece-level as far as sound and story go. Didn't keep me from enjoying it like one, though. Definitely one I'll be buying if/when it ships overseas.\\n\\n\r\nThis isn't a series that I would recommend to everyone, but it is a series that I consider amazing. If you're not sure, pick up the first episode, stay with it until the end, and see if you'd like to watch more. Maybe you'll love it, maybe you'll never touch it again. At any rate, it's definitely one that's worth trying.",
            "date": "2008-06-23T02:08:00+00:00",
            "helpful_count": 127,
            "mal_id": 5712,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mr_utopia_man",
                "username": "mr_utopia_man"
            },
            "url": "https://myanimelist.net/reviews.php?id=5712"
        },
        {
            "content": "::QUICK REVIEW::\r\nStory: 5 (For an ass kicking bodyguard, this guy is feckless)\r\nArt: 8 (Some anim. are laughable but overall its beautiful)\r\nSound: 7 (Sound was good... can't think of anything else)\r\nCharacter: 7 (Shinku X Murasaki are the only 2 worth watching)\r\nEnjoyment: 4 (Don't watch it for the action... you'll get 'boned')\r\nOverall: 31/50 = ~6 (...what is that car doing THERE?!?!?)\r\n::FULL REVIEW::\r\nAfter reading through all the reviews, I have noticed there is nothing but praise about this show, and only one review that doesn't really explain the faults of the show. I'm here to fill in that gap. Personally I felt this show suffered from anime-itis. Don'tknow what that is? Read on dear reader...\\n\\n\r\nKure-nai in essence is, a rom-com of the 'brother/sister' sense. As you already know, Kurenai is supposed to protect Shinkurou from her plutocratic family. On the outside, it sounds like a very serious anime. It even boasts a fairly impressive backstory explaining how everything is run in the Kuhouin family. Specifically in regards to religion, polygamy, and sexism. But don't be fooled. The main story is only found in the first few episodes and the last 3 episodes. So what about the other ~6 episodes? Just typical bodyguard/vip antics and a little shounen on the side. All that is good and fun for a little bit of grins and giggles. But this show is littered with so many bad ends and inconsistencies it starts to become laughable. Bad ends in terms of only a complete idiot that doesn't value his life or the life he's protecting would do something like that. In terms of the many inconsistencies I found, feel free to read the episode discussions and find my name since they're 100% spoilerish. \\n\\n\r\nOn a technical sense, this is a very beautiful looking anime in high definition. It was so great I was actively trying to find faults in the animation and all I'm going to say is that you will laugh out loud when Kurenai puts his 'serious' face on. Other than that, they manage to have a large number of licensed products in this show, namely Maserati and Mercedes-Benz gained my interest. Another thing to notice is how the rooms at the apartment compliment the characters perfectly in style and function. And they did a real good job in making Kurenai's apartment completely dilapidated thats very unfit for a princess. \\n\\n\r\nSpeaking of princess Murasaki sure does act like one. Most people loved her from the beginning, but I'm betting its because she gets naked more than once in the first 3 episodes. As for me, I loved to hate her. The attitude towards others was something I would beat ('time out' for political correctness) my child for. But of course, since its a shounen-ish rom/com, I'm sure you can guess the outcome. The characters are a double edged sword, some you will love, others you will hate, but most you will love and hate at the same time. Thats another strong point of the show though The character chemistry between Shinkurou and Murasaki is something that most viewers don't see very often. Unfortunately, at times, some viewers can feel a little uncomfortable at some of those two's actions but apparently in this day and age its fairly acceptable. You'll know what I'm talking about when you see it. As for the support cast, they are just that... support. The show will act like they're important, but in the grand scheme of things, it just comes down to the Shinkurou and Murasaki show. People can say the support cast are unique, if you can call a poorly dressed emo, a horny college girl, a languid bodyguard, or a plain-sight undercover (oxymoron) agent as unique. \\n\\n\r\nI really, really, REALLY tried to enjoy this show considering how many people kept telling me how great it is. But there are so many episodes going off on a tangent. It also got me disappointed so many times at so many different outcomes that, after a while I just lost faith in rooting for the good guys. And for icing on the cake, 1/2 of the final episode is just pure ridiculousness. I certainly felt gypped, especially when they didn't exploit the back story as well as they should have. \\n\\n\r\nWhy does this suffer from anime-itis? \\n\r\nA) If you show me a fascinating plot with a deep background story, don't bother putting a romantic comedy in as fillers.  \\n\r\nB) The pacifist bodyguard character is played out. \\n\r\nC) Ending takes a crazy turn down unrealistic alley. \\n\r\nD) Short term outcomes becomes very predictable and uninspired. \\n\r\nE) ...ITS 12 EPISODES!! WE DON'T NEED TO SEE A WHOLE EPISODE ON WHY TAMAKI CAN'T GET A BOYFRIEND... (I had to get that off my chest)",
            "date": "2008-07-30T01:50:00+00:00",
            "helpful_count": 101,
            "mal_id": 6698,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=6698"
        },
        {
            "content": "Kure-nai is for the most part, a Slice of life, Action, Comedy, Drama. There are some that will begin this series without knowing what to expect but one thing I can assure you, is to expect a very intriguing and fairly entertaining short series.\r\nThe beginning of this series is fairly confusing and can make it difficult to understand what it&rsquo;s all about, as it seems like a bunch of random events; however what is easy to grasp is the main story. Shinkurou Kurenai is a high school student who undertakes numerous odd jobs and becoming a bodyguard for Murasaki Kuhouin (daughter of a powerful plutocraticfamily) is the newest job he decides to take on. During this time the two grow strong bonds with each other, as Shinkurou becomes sort of a parental guardian, but then something more to Murasaki. Each episode does a fine job in focusing on a random issue, yet sometimes it can seem so random that it doesn&rsquo;t make much sense (the musical). Nevertheless this is a short series that&rsquo;s worth every minute, except the ending, which does leave a few things unclear. \\n\\n\r\nFor a short series, it does boast a strong cast of peculiar characters nevertheless I believe it to be the best thing about this anime. Shinkurou Kurenai is a dispute mediator, with a very troubling background and Murasaki Kuhouin is a secluded pompous girl, who&rsquo;s longed to see the outside world. These two a forced into the current situation they are in, by the enigmatic adults they are involved with. Not to forget the friends of Shinkurou who very interesting and provide a bit more to the show.\\n\\n\r\nWhat stood out to me, in this series, was the lavish animation. The distinctive backgrounds and plush scenery were extraordinarily detailed. Also the character designs were nicely crafted and smoothly animated, however their definitions were very inconsistent when moving around. As for the music, Kure-nai sure has a good calming soundtrack but it is fairly unnoticeable. The appealing OP and ED themes are the tunes that you will notice, not to forget the amazing SFX.\\n\\n\r\nOverall Kure-nai is a very uplifting anime about being bound by customs and wanting to protect someone; although it can be difficult to determine the true nature of this extravagant series. This series provided a good deal of comedy; shown through the characters&rsquo; interactions and also some drama through the characters&rsquo; experienced hardships and gripping dialogue. Surprisingly there&rsquo;s also a great deal of action, in this carefree anime, so there&rsquo;s plenty to satisfy anyone taste. This truly is the type of anime that the average anime viewer wouldn&rsquo;t really consider watching but the experience you get from watching it is one you wouldn&rsquo;t want to forget.\\n\\n\r\n^_^",
            "date": "2008-06-24T13:42:00+00:00",
            "helpful_count": 68,
            "mal_id": 5762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=5762"
        },
        {
            "content": "I was very impressed by this anime. I honestly wasn't expecting all that much, although the screencaps I had seen looked fairly impressive art-wise.\r\nStory: Fairly original, actually, though it definitely reminds me of a darker Aishiteruze Baby. Of course, the show hasn't progressed all that far, but if it continues as it's been going, I'll have no complaints. It looks like some interesting things are up in the next episodes. \r\nArt: Not the standard anime fair, but I'm really liking it. The OP animation was really different. The actual show itself has very fluid and subtle animation, which I happen to enjoy a lot.\r\nSound: Ididn't particularly notice the background music, but the ED was pretty snazzy in my opinion. XD\\n\\n\r\nCharacters: I'm normally not fond of spoiled brats, but the little girl in this one's not that grating, thankfully. It's probably the voice. As for Kurenai, he's pretty sweet, especially when he owns the group of guys in the bar in the second ep. I love seeing the two interact with each other, it's adorable. The other characters have actual personalities, which is a plus. \\n\\n\r\nEnjoyment: I love this so far, I'm definitely keeping my eyes on this, along with Code Geass R2, Soul Eater, and Vampire Knight. (I know. A mecha anime, a shounen anime, a shoujo anime, and now this. What can I say? I have a broad range of tastes. XD)\\n\\n",
            "date": "2008-04-16T18:55:00+00:00",
            "helpful_count": 37,
            "mal_id": 4114,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38798.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ebonyskies",
                "username": "ebonyskies"
            },
            "url": "https://myanimelist.net/reviews.php?id=4114"
        },
        {
            "content": "It is difficult to assign a proper rating to a show as unbalanced as this one. This uneveness isn't even a case of certain elements of the series being handled better than others; Kurenai is both pleasing and disappointing in every one of its aspects. The animation is distinct but marred by noticeable low-quality moments, the characters are as engraging as they are entertaining, and the plot moves from being confusing to entertaining to downright stupid. There are no triumphant highs or deep, dank lows in Kurenai, but this anime does enough seesawing between entertainment and disappointment to lead to a mediocre viewing experience overall.\r\nKurenaidoes do some things right. This show's biggest strength is its complex setting, which the viewer is thrust directly into from the very first episode. The characters and their actions make little sense at first, but each of their personalities and histories is revealed as the series progresses, leaving the viewer with a very thorough understanding of the situation by the time of the climax. Another one of Kurenai's most enjoyable aspects is the relationship between Shinkurou and Murasaki. The boy-suddenly-acquires-loli plot device has been used in other works, but it's handled well here. The most enjoyable moments of this show and found in the midsection of the story, where Shinkurou is simply trying to get through daily life while putting up with Murasaki's eccentric behavior.\\n\\n\r\nIt's a shame that the staff had to throw in some hamfisted attempts at action and heavy drama into the mix as well, because Kurenai does well enough up until these scenes are introduced. It's not that these moments don't belong in the show, because they are most-likely included in the light novel source material as well, but they are handled so poorly that I almost wish they were left out. During these scenes, whatever was interesting about Shinkurou is brushed aside to make way for a bland &quot;I'll protect you&quot; male lead, and towards the end of the show, none of the characters behave consistently. The series finale is especially insulting because it absolutely trashes the intricate plot that was being weaved up until that point with a complete cop-out of an ending. It just might be better to stop watching this two-thirds of the way through.\\n\\n\r\nI wouldn't say that I wasted six hours of my life watching Kurenai, but I wouldn't suggest that you set aside your valuable time for this.",
            "date": "2008-08-05T18:20:00+00:00",
            "helpful_count": 35,
            "mal_id": 6854,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9034.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Slacks",
                "username": "Slacks"
            },
            "url": "https://myanimelist.net/reviews.php?id=6854"
        },
        {
            "content": "Kure-nai is one of the more peculiar shows of the 2008 spring anime season. It's not Kaiba in all its glorious artfaggotry but it's definitely not Soul Eater either. Most viewers can already gather from the first episode that over-the-top shounen battles are not what this show is about. Basically, Kure-nai is a story about two characters growing up, while discovering which kind of power is the kind that really matters. The kind that really matter accroding to Kure-nai is not a Kamehameha or a Rasengan, but the ability to make your own decisions, finding your place in society on your own and upholding yourvalues at any time. You know the deal.\\n\\n\r\nMain character Shinkurou Kurenai could definitely use some of this &quot;power&quot; as he is an orphan, having lost both of his parents in a terrorist attack. He's currently employed by a woman by the name of Benika Juuzawa, working as a so-called &quot;dispute mediator&quot;. Which is a dangerous job; Shinkurou's activities include beating up Yakuza and protecting various people from harm and even though he's only 16 years old, he does a great job of it. In hand-to-hand combat, you do not want to face Shinkurou since he's been trained in a secret, clan-specific type of martial arts and has some type of special weapon in his body to boot. One day he asks Benika to assign him a more complex mission, hoping to impress her and get some extra money out of it while he's at it. Benika then wants Shinkurou to protect a little girl who appears to be the heir to a traditional family called the Kuhouins. Only later Shinkurou finds out about the cruel ways of the Kuhouins and why exactly he was chosen to protect the girl.\\n\\n\r\nNow the one thing which carries this story is the bond between its various characters, most notably between Shinkurou and Murasaki Kuhouin, the seven-year-old girl. This relationship is so touching it really leads you to believe this is a romance anime about these two characters, but as one is only 7 and the other is 16, you can see this is not the case. It is really hard to describe how these characters exactly relate, but it is a very interesting bond they share nonetheless. Both characters possess loveable personalities, Murasaki being the cheeky preschooler with an extraordinary take on modern society and Shinkurou being the caring and somewhat indecisive pushover who slowly takes the form of an strong and admirable parental figure. Kure-nai is a story about its characters and the characters are great. Not to say the rest of the show is bad, but this aspect really saves it from mediocrity.\\n\\n\r\nThe first half of the story is decidedly lighthearted as we see Shinkurou and Murasaki interact with their environment in a slice-of-life sort of fashion. This is where the 8 for &quot;enjoyment&quot; comes in. While even these early episodes aren't particularly humorous I found them very enjoyable, once again thanks to lively characters such as Shinkurou's roommates Tamaki and Yamie. After a while though, the happy-go-lucky atmosphere grows old and especially episode 6 felt particularly forced. From that episode on however, the story turns gritty, new information regarding Murasaki's family comes to light and the family itself shows up as well, in their attempts to take Murasaki back at all costs. Shinkurou's situation becomes pressured and he starts to question his own strength after realizing how this job was probably more than he could handle. After seeing Shinkurou has grown in his determination to finish what he started and protect the ones he cares for most, Benika also finally starts to show her human side. By the end of the story the viewer will also find out a little about what exactly drives her, though it's really kind of an afterthought compared to Shinkurou's story.\\n\\n\r\nThe final episodes however, are undeniably silly at times. At some point there is a carchase in the snow which in my opinion was entirely unnecessary to the plot and really was there just to entertain action-fans who stuck with the show until the very end for some unknown reason. The ending itself was pretty powerful in my opinion because it was unexpected and it made me think if the characters had really made the right decisions, however at the same time it was very unrealistic and it would've been much better once again, if Brain's Base would've just toned down on the violence and ever-apparent murderous intent everywhere in the final episode. There was much more hand-to-hand action than usual near the end, which wouldn't have been bad if it wasn't for two things:\\n\r\nFirstly, it was important to the story the combat was done unarmed, to really see the link between one's physical strength and ones inner strength. This has been done really well overall, but when you really look at just the story and not all the themes woven into it, it really begs the question why not a single person opted for a firearm throughout the show. One 9mm handgun could've easily turned the tables on Shinkurou.\\n\\n\r\nSecondly, this show is not Gurren Lagann. Art-wise, Kure-nai looks excellent, but the animation quality was rather inconsistent. As mentioned before, there weren't a lot of challenges for animators to overcome as the show mainly revolves around its dialogues, but when things heated up, the animation disappointed me greatly. It always caught my attention at the moments that really mattered, and that's never a good thing. At first I was really impressed by Kure-nai's visuals but the aforementioned issues turned my rating down to a low 7.\\n\\n\r\nLastly, let's discuss sound. The first thing that will definitely catch the viewer's attention in Kure-nai is the OP. Not because of the music, but because of the visual style. If you want to know what I'm talking about you really have to go and see it for yourself. My problem with this OP is that while it's certainly not generic (which is almost always a good thing), it doesn't suit the show's feel. At all. The ED is a little better but far from a reason to watch the show in itself. It seems Brain's Base realized this after a while and they decided to fix this. How? By completely removing the OP and ED. That's right. From around episode 7 on, this show has no OP or ED. Which is sort of lazy. The last time I can remember watching an anime with no OP was FLCL.\\n\r\nHowever, FLCL still has its excellent ED and overall J-rocky soundtrack going for it. Kure-nai only has some instrumental tracks which are hard to notice while watching, but most of the time there's just silence. Which also works. In that regard, Kure-nai's &quot;sound&quot; isn't all that bad, but the Kure-nai OST is definitely not a must-have.\\n\\n\\n\r\nOverall, Kure-nai didn't exactly turn out the way I wanted it to. With this show, Brain's Base does some things not many studios have, but the the themes and morales that encompass the entire show sometimes really cause its credibility and plot to suffer. At some point, Kure-nai turns almost Shakespearian in its approach, with long, complex dialogue, even from seven-year-old Murasaki. I'd say these are things that are good to know beforehand, and that is also the reason I write this review. I hope that after reading this review, you will have an idea of what to expect from Kure-nai and perhaps you will be able to enjoy it even more than I did, because I had to figure all this out along the way.\\n\r\nKure-nai's a great change of pace from the more generic shounen and high-school series, but in the end one's opinion of this show is really something personal. Shinkurou and Murasaki's story was touching enough to me, but there's no saying if this goes for all viewers out there. Still, if this sounds like your kind of show, don't miss out.",
            "date": "2008-06-23T23:28:00+00:00",
            "helpful_count": 20,
            "mal_id": 5743,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42168.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PBz0r",
                "username": "PBz0r"
            },
            "url": "https://myanimelist.net/reviews.php?id=5743"
        },
        {
            "content": "Kurenai is a show that blends several different story elements together. It's an action thriller, complete with secret organizations and trained teenage operatives. It's a story of personal growth, with the two main characters learning what is most important to them and how to fight for it. It's a slice-of-life with quirky characters and hints of romance. This all adds up to a 12 episode show that gives you a good taste of each, while managing to tug on your heartstrings from time to time. Yet, unfortunately, for all the juicy morsels it offers up, Kurenai is oddly un-filling. There is a feeling Kurenai couldbe better had it developed some of its ideas further, and cut off some parts that were needless. The result is uneven, yet ultimately rewarding enough to warrant a watch.\\n\\n\r\nSome suspension of disbelief is required to fully accept Kurenai's story, though that can be said for a lot of anime. Our protagonist, the titular Shinkurou Kurenai, is a regular high school student at first glance. However, outside of school, he works as a mediator for an underground organization; a \"problem fixer\" of sorts, as he puts it. His next assignment is a big one, he must look after a precocious 7-year old girl named Murasaki Kuhouin, who escaped the cruel fate of women of the Kuhouin clan with the help of Kurenai's mentor/employer, Benika. This will be no easy task, as the Kuhouin clan is searching for their runaway. The other meddlesome tenants of Kurenai's apartment building don't help matters, either.\\n\\n\r\nThe focal point of Kurenai's plot is the relationship of the two leads. Kurenai and Murasaki are interesting all on their own. Kurenai was orphaned at a young age, when his parents died in a terrorist attack. He has a deep admiration for Benika, and he aspires to be as strong as her one day. He works under her in order to reach that goal. Still, he is rather meek and humble, and doubts himself. Murasaki is articulate and mature for her age, forced to grow up quickly by her clan's traditions. She's also rather haughty from being pampered, and naïve about the outside world which she was raised to have no connection. The bond between the two is one of mutual growth. In the case of Murasaki, she learns from Kurenai (an the other tenants of the apartment building) the mannerisms and ways of common people. She also learns do deal with strong emotions as the relationship between her and Kurenai deepens, as well as how to truly treasure a relationship. For Kurenai, Murasaki becomes someone to fight for, someone to protect. This not only drives him in his attempts to grow stronger, but builds his convictions; even to the point of defying Benika if he must.\\n\\n\r\nIt is good that the relationship between Kurenai and Murasaki is strong, because it is ultimately what holds the show together. The narrative of this show is not the best constructed; it consists of very loosely structured arcs, which can become unfocused. The mid-series episodes in particular are meandering and sort of aimless. This does not mean there is no development, Kurenai and Murasaki's relationship grows slowly, but the plot just sort of comes to a halt. The episodes themselves aren't unenjoyable, there are some fun situations and misadventures. However, the novelty of seeing things like the residents of Kurenai's apartment building practicing for a musical wears thin quickly. It is a godsend when the plot finally gets moving again in the last third, though the use of coincidence in kick starting the plot is a bit irksome. From there, the show delivers some hard-hitting emotional scenes, majority of the show's fights, and a mostly satisfying conclusion.\\n\\n\r\nThe supporting cast is a bit of a mixed bag. The brightest piece in the bag being Benika, who fills her role as Kurenai's mentor and employer very well. Their relationship is somewhere between business and personal. She holds the reins loosely on Kurenai and her other subordinates, but doesn't hesitate to exercise authority when it is necessary. She genuinely cares for Kurenai, but keeps a professional distance from him most of the time. Kurenai's mischievous land-lady, Yamie, is fun comic relief. As is equally as mischievous college student Tamaki. Their shenanigans with Murasaki provide most of the enjoyment in the meandering middle episodes. The same cannot be said for Kurenai's schoolmates/ potential love interests, Yuno and Ginko, who are essentially just window shopping. Both have feelings for Kurenai, and neither goes anywhere. The Kuhouin provide some note-worthy villainy, mostly from Murasaki's menacing older brother Ryuuji and the battle-crazed Lin, but aren't given all that much screen-time.\\n\\n\r\nThis show was animated by Brain's Base, but before they hit the peak of their popularity, and is one of their lesser known works. The show is a testament to the studio's quality work even before it gained notoriety. This show looks really good. The character designs are distinct, vibrant, and expressive. Murasaki's design in particular is fantastic; it hits the right balance of childish youth and demure beauty to illustrate both Murasaki's age and her upbringing. Benika's casual and yet commanding appearance fits her perfectly, as does the very formal look of her subordinate Yayoi. Ryuuji looks every bit the well dressed sleaze he is, and Lin's facial expressions are fittingly deranged. Kurenai's design has a bit of bishounen flavor to it, but is still distinctive compared to the worn generic designs that plague all too many male anime leads. The animation overall is good too, but there are some rough spots. These rough spots are most evident in the show's fighting scenes; characters don't move quite as fluidly as the trained combatants should. Sometimes their movements look kind of unnatural. Editing-wise, the transitions into fights sometimes feel choppy or abrupt, though some of the editing also makes up for the animation short-comings.\\n\\n\r\nThe music is dominated solemn orchestral and jazz pieces. Piano in particular is heavily used in the soundtrack. Usually, a show will have more energetic pieces with high tempos for action sequences. However, with a few rare exceptions, this is not the case in Kurenai. Slow solemn pieces are often used for fights, and remarkably, this actually works. The melancholic tone of the music is used to give gravity to the fights, making them serious and visceral occurrences. At times the music choices can get a bit tiresome as a few tracks are often repeated, many times in the same episode. However, this does what a good soundtrack should do: support the visuals and content of the show.\\n\\n\r\nKurenai is a solid little show worth watching despite its various flaws. At its core is a strong central relationship that carries the show through its rough patches and remains endearing throughout. The middle episodes do drag and lose focus, but once the plot pulls itself together, it delivers some emotionally gripping moments that really accentuate the relationship between the two leads. It even throws in a few good laughs and fights when it is at its best.",
            "date": "2014-04-03T22:42:00+00:00",
            "helpful_count": 19,
            "mal_id": 138569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229558.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeverKnowsBest26",
                "username": "NeverKnowsBest26"
            },
            "url": "https://myanimelist.net/reviews.php?id=138569"
        },
        {
            "content": "This anime is absolutely HORRIBLE!! Okay, to be fair, it only became horrible after episode 8. At the beginning I was rating it a 10 and placing it among my favorite animes. The plot was somewhat unique, and there was the mystery as to exactly what the girl was running from, and shinkuro's past. But as the answers start to become revealed by each episode somehow in the 9th episode the author of the anime has no idea/clue where to take the anime. The action goes downhill, which is disappointing since it is supposed to be an action genre and they turn a possible bourneultimatum-type action genre down to something you see on madtv (basically ridiculous). And just the way it ended was soooo pathetically random, I was just speechless as to how irritating it was. The only part that made my mood any better was the last 2 seconds where the focus was on shinkuro.\\n\r\nAnyways, if you MUST watch this anime watch it to episode 8, and skip to the last episode 12 if you even feel like finding out how it turns out. Otherwise, I recommend not to even waste your time on this anime since you will be horribly disappointed.",
            "date": "2008-06-20T20:04:00+00:00",
            "helpful_count": 18,
            "mal_id": 5658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/31332.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ten6cha",
                "username": "ten6cha"
            },
            "url": "https://myanimelist.net/reviews.php?id=5658"
        },
        {
            "content": "The opening shocked me. It really did. So I was kind of prejudiced against the first episode. But I soon realized, that the opening is the only bad thing so far- everything else is greatly enjoyable.\r\nThe stories are really sweet,the characters authentical, especially Murasaki is a surprisingly pleasant character. The background music supports the animation almost perfectly. Kure-Nai is would be my first-choice-series to watch after an exhausting day of work. It's relaxing but still entertaining and exciting.",
            "date": "2008-05-14T12:58:00+00:00",
            "helpful_count": 11,
            "mal_id": 4721,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/52740.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Po",
                "username": "Po"
            },
            "url": "https://myanimelist.net/reviews.php?id=4721"
        },
        {
            "content": "There are fantastic anime that focus on slice of life such as Usagi Drop or the Aria series, and  there are action based anime such as Black Lagoon or Hellsing Ultimate; then there is Kure-nai, which mixes both genres. This is a difficult task, and if handled improperly, it can tear down the whole story, which in fact happened in this anime. While it executed the slice of life part well, blending in the action was poorly done to say at least, resulting in major plot holes, as well as an unnatural story progression. This anime would have been much better off by focusingon the slice of life aspect, yet sadly didn't.\\n\\n\r\n~Story~\\n\\n\r\nThe premise of Kure-nai is simple: 16-year-old Kurenai Shinkorou, a master martial artist and professional mediator, yearning for better paid jobs, receives a request from his boss Benika to protect the young 7-year-old girl Murasaki Kuhoin. Mystery surrounds both the girl and protagonist himself, which possibly ensures a great story. This sadly not the case, as it jumps from action to a prolonged slice of life setting, than to plunge once again in the action scene; which disturbs the overall continuity of the anime.\\n\\n\r\nAs stated earlier, the slice of life moments in this show were well executed, which in this case was presenting somewhat realistic character relationships in addition to satisfying crafted everyday life events. Viewers observe how these two main characters interact between themselves and their environment, as well providing some background stories for the little Murasaki. These interactions and events can be amusing at times, which is enhances the atmosphere the anime is trying to portray. However, there is often also typical school type situations which viewers are used to see in romcom school comedies, which can be a drawback.\\n\\n\r\nNow as mentioned earlier, Kurenai needs to protect the girl from her powerful family, yet there is a problem to this: the viewer isn't provided with enough knowledge of the family to understand the reason why she even needs to be protected, even after it is revealed nearing the conclusion. Consequently audiences never or hardly ever feel any kind of tension whatsoever whenever something happens to her, be it wandering out on her own, or going out with the protagonist.\\n\\n\r\nThis brings me to the drama aspect of Kure-nai, which was poorly executed and difficult to take seriously due to various reasons: first of all, the fact that a teenager is protecting a little girl from a very rich and powerful family while attending school normally and leaving the kid alone is a huge flaw already. Other issue was the continuity of the show, that either totally focused upon action/drama or just switched to normal everyday life events. Then there is the fact that the protagonist himself is a pretty useless bodyguard, which raises the question why he even was assigned this job. Finally, the motives and characters themselves were shallow, but I will treat this topic below.\\n\\n\r\n~Characters~\\n\\n\r\nThere is a handful of characters present in Kure-nai, naturally being Murasaki and Kurenai of utmost importance. Murasaki is a young, talented martial artist and naturally being young makes it difficult for him to live on his own, consequently working as a professional mediator. His past is explored upon very superficially, and the motives on why he has this particular job are weak as well. Then there is Kurenai, a girl from a rich family with elitist behaviour; she undergoes the most character development and fleshing out of the whole cast, though her sudden change in lifestyle: from a rich environment to a dirty little room.\\n\\n\r\nThe secondary characters are of importance as well, yet these undergo near to zero character development or fleshing out. This jars the narrative of the anime, as they are one-dimensional characters with very lacking motives, which seems to make them out as simple plot devices. The friends of the protagonist, as well as his boss felt redundant in the anime.\\n\\n\r\n~Animation and sound~\\n\\n\r\nThe animation of Kure-nai was well executed, as times very well done with fluid character motions, as well as the environment. This could not be said about the background, which was well drawn in the beginning, towards the end being of lesser quality, especially when comparing it with the character's detail. Character design were slightly different from what anime viewers are used to, but was rather lackluster in fact, being the defining feature their hairstyles, as faces of the main cast were basically the same. This was however a small drawback.\\n\\n\r\nThe voice actors performed their role well, matching with each character voices, though at times emotional states of these didn't come over too well. The soundtrack used was nothing outstanding, yet fulfilled its purpose in creating the different atmospheres it was trying to relay to the viewer.\\n\\n\r\n~Enjoyment~\\n\\n\r\nWhat started as an interesting and amusing anime, changed for the worse as it progressed through a badly handled blending between slice of life and action; the character were no great help either in providing a somewhat realistic story, yet what \"saved\" it from being a disaster were the slice of life moments present its duration. I personally think this would have worked much better if it focused on the slice of life aspect. In addition, the protagonist should have been an adult rather than a teenager, as this makes it very difficult to take the series seriously, in addition to the additional question that arises as how a simple teenager could be taking care of a 7-year-old girl without arising suspicion.\\n\\n\r\nSo do I recommend this anime? Honestly I don't; I have grown to dislike the school-type of setting more and more, which may have influenced significantly. Naturally, for newcomers to the anime scene all this issues wouldn't bother that much, yet for the more seasoned viewers, I would say stay away from it. \\n\\n\r\nThank you for reading.\\n",
            "date": "2015-11-30T10:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 204517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=204517"
        },
        {
            "content": "A few years down the line Kurenai won't be remembered as a classic, hell I doubt many people will remember it now; it deserves more attention. But maybe it should be remembered as a classic. I believe kurenai has the biggest advancement in quality in production of anime ever.\r\nGoing in I didn't know what to expect, when I loaded up the first episode I was a little taken aback by the OP and my expectations were lowered a little, it seemed kurenai wasn't the type of show I might have been looking for at the time. But the OP is deceiving, catchy but deceiving. Thesecond blow to my expectations came in the first few minutes with an apparantly supernatural element. &quot;another crappy super power anime&quot; I thought. But I soldiered on and by the end of episode 2 I was hooked. Kurenai is a breath of fresh air.\\n\\n\r\nAt first I wasn't sure what it was I liked so much about it but eventually it dawns on you. The characters, are having conversations. In every anime up till now, everything I've watched has had statements with arkward pauses inbetween, you might not have noticed it but after watching kurenai you might. The secret is, and to my knowledge kurenai is the first to do this, the show is animated based on the voice actor's recording. Finally the actors are released from the shackles of arkward animation timing, and the result shines. Kurenai is wonderful to listen to, you can hear more emotion in the voices than ever, lines are said at the right pace and I felt like the actors had even been allowed some improvision in the script to fit their characters. The advantages don't stop there, so far kurenai has the best lip syncing of any show i've seen (not so say it's perfect, far from it) but the dialogue flows wonderfully and there are conversations with 3 people at a time (to fansubbers regret) which help give the show so much character.\\n\\n\r\nKurenai isn't a one trick wonder.\\n\\n\r\nThe art is above average, with some varied enviroments beautifully drawn (especially towards the end), although a good amount of the show is set in one or two locations. The animation however, is not amazing. Although usually the characters move quite fluidly in some high movement episodes you can see they were stretching the budget and some of the animation becomes a little arkward. Some of the fight scenes look a little silly as well but in general the show has good art direction. The characters are all very uniquely drawn and you can see some of their personality in how they move, more subtely than other shows.\\n\\n\r\nBefore I talk about the characters, I should explain what type of show kurenai actually is. kurenai is not harem, despite being surrounded by woman. Kurenai is not a super power show, despite Shinkurou arguably having one. Kurenai, to me, is primarily a coming of age story for Murasaki and Shinkurou. It unravels the show using a mixture of comedy, drama and action (to a lesser extent).\\n\\n\r\n The story is good. It uses the past of some characters to explain their motivations while others are revealed as the story progresses. Although the story is initially quite sinister, it lightens up to the Shinkurou - Murasaki relationship for the bulk of the series, before taking a darker dive than I was expecting for the climax. The story is paced well and serves its job well enough, the really great thing about kurenai is the characters. it's a little bit of a shame this show wasn't given a longer run. I know theres more manga material out there (which it follows, except for the ending which they had to improvise). On that subject, the ending wasn't the best ever, without giving too much away it seemed like a compromise was made which didn't really fit with the circumstances and the attiturdes of some of the characters but it does tie up the show and leave some space for a sequel (please?).\\n\\n\r\nDuring the &quot;slice-of-life&quot; part of the show you learn about Murasaki, Shinkurou and his neighbours, friends and &quot;employer&quot;. The character's all have a fun, strong personality without exaggerating to the point of Naruto or something. Infact subtelty is one of my favourite part of the show. It doesn't shout everything at you, rather it treats you like an intelligent viewer more than most and lets you make your own conclusions. The character history is incomplete, and a lot is implied, much of it through dialogue.\\n\\n\r\nThe humour in the series is great, amazing. Cross gender jokes without &quot;haha she fell and you saw her panties&quot; and the most mature humour i've ever seen in an anime. Episode 6 put me to tears actually and the show is littered with funny dialogue.\\n\\n\r\nSo I better end this ridiculous wall of text here. Kurenai is one of the best shows I've ever watched and if other shows took a page out of its book the quality of animes would increase greatly. Huge kudos to brain base, the creators. I refrained from giving it a 10 for its flaws but its definitely close. So in conclusion watch this because it might be the best under appreciated show ever and then get everyone else to watch it so it gets the attention it deserves.",
            "date": "2008-08-04T08:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 6819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sanchez",
                "username": "Sanchez"
            },
            "url": "https://myanimelist.net/reviews.php?id=6819"
        },
        {
            "content": "Once in a while you come across anime from which you expect pretty much nothing to begin with but you see a couple of episodes and find yourself having the urge to continue watching until the very end. ‘Kurenai’ was one of them for me. \r\nThe story revolves around Kurenai Shinkurou, a high school student who works as a dispute mediator. He possesses abundant martial arts skills and accepts requests from his employer Juuzawa Benika to resolve trifling conflicts and the like. When he demands for something more challenging, Benika consigns him the job of protecting a seven year old kid, Kuohouin Murasaki who belongsto a highly influential and plutocratic household- the Kuohouin family. Having no clue about the young girl’s background, he accepts the job after a bit of hesitation. How Murasaki responds to the world of the commoners and forms bonds with the people around her while constantly battling against the depressing memories of her mother and life at the Kuohouin household are the main focus of the story. \\n\\n\r\nWhile the plot, in itself, may not sound much unique or intriguing, the way it is carried out is quite good.  For a short anime with twelve episodes, it was an enjoyable watch.  The premise of the first few episodes is Murasaki learning new things and getting acquainted with the people related to Shinkurou, and how she finds joy in little things which she was devoid of. Every episode was fun to watch and none of them felt boring. Not to forget, there were a few moments which were quite amusing to me.\\n\r\nThe cast is entertaining to say the least. The characters are so vibrant that you can’t help but like them. The protagonist Shinkurou, the cheeky Murasaki and their neighbours— they are such an interesting bunch. One character I personally didn’t like was Houzuki Yuuno, not only because it is infuriating to see people who try hard to gain attention but also because she didn’t seem to have much of a role except that of following around the protagonist. Well, every harem anime needs one I suppose. On that note, this isn’t exactly a harem. While it will be incorrect to say that harem doesn’t exist, it is more or less a side dish which is good in this case at least. \\n\\n\r\nThe OST is average. Most of the soundtracks were barely noticeable. The only soundtrack that I like is ‘Wasureenu Omoi’ (look for it in Youtube) which played during a dramatic scene in the last episode if I remember correctly. The OP is nothing great either and the same goes for the first ED. The second ED on the other hand is catchy and I liked it. \\n\r\nThe art is sharp and vivid, and the animation is done really well. The backgrounds are simple yet attractive.  The character designs are pretty good too.\\n\\n\r\n‘Kurenai’ is not something that I’ll recommend but even so, do give it a shot if you ever feel like. \\n",
            "date": "2012-06-09T04:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 62987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503355.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Rika",
                "username": "_Rika"
            },
            "url": "https://myanimelist.net/reviews.php?id=62987"
        },
        {
            "content": "This anime has good animation and a likable lead character but ultimately is somewhat mediocre.  For one thing, the plot is not believable.  A girl must go into hiding, and thus she is given to a high school student who is absent half the day.  She is freely taken into public places, her appearance is not changed, and frequently there are moments where disbelief cannot be suspended at the actions done with this girl who is supposedly \"in hiding\".  This could be ignored if the characters were very good.  The lead, Shinkurou, was interesting enough, but very few of theother characters are.  Murasaki is alright, but somewhat repetitive.  The female love interest is dull, while another, more interesting female character from Kurenai's school is ignored for the most part.  Frankly the series simply feels a bit aimless.",
            "date": "2009-09-07T20:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 18514,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Theowne",
                "username": "Theowne"
            },
            "url": "https://myanimelist.net/reviews.php?id=18514"
        },
        {
            "content": "For my first ever review, I wanted to give it to the show that showed me the joys of low expectations.\r\nI was watching a bunch of Top 10 Anime videos with a couple of friends just for kicks when one of them recommended this show to me. The guy reviewing the shows was downright embarrassing to listen to, I think it was probably the weird accent, but I guess he must've been pretty good if he got me to watch the show. So with pretty low expectations, I decided to give the show a try.\r\nStory: 8/10\r\nSo to begin, the story was pretty original from whatI've usually seen and you may even learn something about the history of some of the darker parts of Japanese culture. You have the protagonist, Shinkurou Kurenai, a high schooler, who takes on odd-jobs for his employer, Benika Juuzawa. One day Benika brings a young girl named Murasaki Kuhouin to Shinkurou, asking him to take care of her while she is in hiding from her family. Although Shinkurou seems pretty serious about his work and agrees to the job, he doesn't fully understand how hard it is taking care of another person until he comes home from class to find Murasaki missing after her first day away from home. Without spoiling too much, the rest of the story is about the heartwarming relationship Shinkurou and his neighbors have with Murasaki. At the final stretch of the series (which to me was the most satisfying part) the show changes from a lighthearted slice of life, to a melodrama revolving around the dark past of the Kuhouin family.\\n\\n\r\nArt: 8/10\\n\r\nI really appreciate how the anime uses a different style from the source manga to differentiate itself. Although I haven't read the manga myself, from what I've seen, the changes were well called for. I personally enjoyed the dark color pallet used throughout the show and I thought the character designs were great and very fitting for each of the character's personalities. I also really appreciate how Murasaki actually looked like a kid instead of a typical loli-type character (looking at you manga Murasaki).\\n\\n\r\nSound: 10/10\\n\r\nThe performances were incredibly believable, especially Aoi Yuuki's performance as Murasaki. Yuuki seems to capture that immature brattiness of kids really well without making them seem too unlikable. Miyuki Sawashiro is also very talented in most of her roles and Shinkurou is no exception. The supporting cast also does very well with what little screen time they are given.\\n\r\nThe soundtrack is one of my all-time favorites in anime ever. I guarantee you that even if you don't notice it while watching, the dramatic scenes are greatly enhanced with the use of those amazing piano pieces by Ken Muramatsu. From the upbeat slice-of-life tracks to the tempo downed drama tracks, the OST has it all. To this day (at least at the time of the review) I still listen to the OST because it's that good. \\n\\n\r\nCharacter: 9/10\\n\r\nThere was not a single character I disliked, which I think is pretty amazing considering there was only 12 episodes to flesh out each one. Even if the antagonists aren't really the type you're supposed to sympathize with in this show, their motives play a crucial part to the story. Shinkurou's neighbors, Tamaki and Yamie, were the most surprising characters of the story. I don't want to spoil too much, but I think because I didn't really expect much from them, I ended up enjoying their presence and relationship with the kids a lot. A special shout-out to Benkia's assistant, Yayoi, who does a lot more than what she's asked to do.\\n\\n\r\nEnjoyment: 10/10\\n\r\nI love this show with all my heart and even though it's not really smart or special in any way, I was seriously happy watching it. Although it was not long ago when I watch it, I feel a sense of nostalgia just remembering that I had. If I could erase my memories and watch it again with the same low expectations, I would. Sorry to anyone who reads this review though, your expectations might be a little higher because of me.\\n\\n\r\nOverall: 9/10\\n\r\nOn my official list I gave the show a 10/10, simply from the enjoyment and comparison to other shows I've watched, but if I had to rate the show in a vacuum, I'd give it a 9. It would be hard for me to recommend this show to other people simply because I can't guarantee that people will experience the same nostalgic feeling I had when watching it. Even so, I hope that whoever reads this review will give it a shot. Thank you for taking the time to listen to my opinion.",
            "date": "2016-08-17T22:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 227007,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jcrowly",
                "username": "jcrowly"
            },
            "url": "https://myanimelist.net/reviews.php?id=227007"
        },
        {
            "content": "Preface: The Kure-nai anime is a truly underrated gem of the medium; it is a shonen that transcends the limitations and trappings of its demographic into something adult and intelligent, and into what I find to be one of the best shonen anime of all time and it also happens to fall into that 1% of \"anime adaptations that are better than the manga/light novel/visual novel they are based off of.\" \r\n*I would go into length about the differences between the anime and manga, but it would be too extensive for this review, so I'll have it on file if anyone wants clarification later*\r\nWhen Iheard about Kure-nai back in '08 and read up on the premise, my tastes were too underdeveloped at the time and I dismissed it as some dull slice of life (in a laymen sense) story that wouldn't satisfy my adolescent male cravings for boisterous shonen action. A few years later, as my tastes have become more refined and open, I come across a review on the series  and decide to take a look at it and seeing that it was a rather favourable review, I decided to check it out under the assumption that it was almost purely slice of life (again, it a laymen sense) which I was more accepting towards. Ironically, it turns out that Kure-nai does have action in it; some of the most visceral, well choreographed and intense martial arts I've seen in an anime that is. With that said, the action was a great bonus, and for those of you at the very least looking for some quality martial arts battles, then definitely give Kure-nai a shot for the fighting and stay for the story. I think that it can serve as a nice entry way into good storytelling in shonen anime and other anime in general. As to why Kure-nai is such a great anime and happens to be my current #3 top anime, let's dig into the meat of the review shall we?\\n\\n\r\nStory: Kure-nai, at its core, is a simple story; a young man working as a part time mediator is assigned an additional job on the side to take care of the young daughter of an aristocratic family while trying to juggle his job as a mediator, his school life and his home life where he lives in a shoddy apartment with 2 other eccentric patrons. Our titular \"protagonist\" Shinkuro Kurenai is the 16 year old mediator in question whose parents were murdered when he was young and he was rescued by his mentor and fellow mediator Benika Juzawa, who left him in the care of the Hozuki family household where he would learn their style of martial arts and get a special bone blade transplanted into his elbow for emergencies. He eventually moved out of the place and found an apartment on his own with the payments from his job as a mediator to support his stay. Then there's the other most important character in the anime, Murasaki Kuhoin, who is seen being taken (rescued) from her family's manor at the start of the series by Benika and her assistant Yayoi Inuzuka, and being entrusted to Shinkuro. She is initially very impetuous and haughty, speaking in a sophisticated yet arguably archaic prose and believing the world around her to be her personal oyster, like treating a bath house clerk like a servant and not giving thanks, expecting to be given treats and such regularly. Shinkuro begins to teach Murasaki about societal folkways and mores that she is not used to due to her sheltered upbringing in a prestigious family and we see the contrasting lifestyles and norms collide. From there, the series starts to take off. Being predominantly character driven, the story focuses on our 2 characters growing their bond, growing as individuals and growing as members of society with all these different scenarios and characters coming into play to help them blossom with things like Shinkuro trying to negotiate with shady figures that usually end up getting rough, Murasaki trying to occupy her time at the apartment while Shinkuro is at school, the 2 going out shopping or on play dates, and many more. We later learn about Shinkuro's tragic past and the reasons for Murasaki's kidnapping. It's all executed so well due to the exceptional writing that doesn't let things become formulaic, allows for balanced tones and conflicts, creates smart, subtle humour and not crude trite often seen (episode 6 is a riot, don't skip it), doesn't become steeped in melodrama and moves the story at a slower, but more enriching pace to its benefit coupled with some interesting cinematography and things like juxtapositions to add value to certain scenes. The action is interspersed over a few of the earlier episodes before becoming the focus in the last third of the series, but I'll refrain from delving into spoiler territory too much. The fights themselves are visceral in every sense of the word; you can almost feel every little contortion of flesh and bone with each blow, the movements are very fluid and expertly choreographed while making the environment feel like it actually has obstacles to it that get in the way. The characters aren't flying around all over and blasting beams at each other, and typically the place they are fighting in isn't conveniently spacious, so a character might get cut off by a chair, get caved in, etc, it is believable and well executed. Overall the story centralizes character growth and living as aforementioned, so early episodes involve some mundane stuff and a lot of conversation, but the mature dialogue, nuanced emotions, solid interplay, refined prose, natural tension and precise timing all culminate to make for a really engaging and really human drama. Whether it be Shinkuro chatting at school with friends, doing negotiations with people, him and Murasaki doing chores, Murasaki doing stuff by herself or anything else, it is all captured with meticulous detail for realism and not a single event feels superfluous or unnecessary. The final arc also happens to be a tour de force, really bringing the themes home, with Shinkuro questioning his strength in an refreshing and hard-hitting way unlike the typical shonen executions of it, along with the morals behind breaking out of an impersonal worker-client in order to make a change which leads up to a battle not of good and evil, but of freedom of expression for man as an individual v.s. punctual tradition for fortifying a status quo, making for a well constructed grey area as ideals clash as well as the morals behind family and the love shown to members of a family unit (trying to be vague to avoid spoilers) and all topped off with an ending that has reasonable goals and compromises for all sides that may be initially bittersweet, but touching in the end, and overall, I found nary a flaw in the whole thing. To conclude the story portion, I'd like to draw up comparisons to 2 anime: Bunny Drop and Rurouni Kenshin: Trust and Betrayal (moreso the former). I really love Bunny Drop, but I find that Kure-nai balances events better in terms of the child raising, not to say that Bunny Drop is bad by any means at doing its child raising well (quite the contrary) I just find Kure-nai is less linear and is able to show the events of both Shinkuro and Murasaki in an episode where they are apart whereas Bunny Drop will focus on either Daikichi at work or Rin playing in particular episodes besides the scenes where they are together, so I like how Kure-nai is able to handle multiple focal points like that and we aren't kind of left out on certain subplots or events for one side or the other, so it is more cohesive and rounded. As for RuroKen, it is mostly a stylistic thing, but I'd just like to note that Kure-nai's final arc also has a rich, picturesque snow blanketed locale with a very heavy and tense atmosphere due to the content, and things proceed with just as much elegant pacing and tone as Trust and Betrayal, so do be sure to keep going with the series if you are having doubts and/or love Trust and Betrayal to see such a powerful and splendid final act. 10/10\\n\\n\r\nCharacters: Again, being a character driven story, it is all about the characters, and the core duo and most of the supporting cast are multi-layered and believable human characters that you will grow on; although there are some hindrances, they are largely subjective. Shinkuro is a timid, humble and self-sufficient teenage boy just trying to get by in life with having to juggle so many things in his rough life; he is sincere and earnest, but can still be adamant and strict with Murasaki. He lacks some personal confidence, but is nonetheless devoted and compassionate. Murasaki starts out as a spoiled and whiny little girl with a brazen attitude, but over the course of the series, she settles down and blossoms into a very considerate, responsible and mature little 7 year old. Benika tends to be a rather reserved, sometimes stern person but also has a sharp tongue and is very optimistic and caring. Yayoi happens to be a tad thinner in personality than most of the cast, being mostly one note, brazen and subservient to Benika, although she does undergo something of an epiphany learning about strength through Shinkuro to help loosen up a bit. Ginko also is a little lackluster compared to some others, but has some subtle little soft spots beneath her blunt veneer and also happens to have a bit of a backstory with Shinkuro. Yuno is very kind upfront, but equally as assertive and strong with her convictions, being a sweetie with a rough side you don't wanna mess with. Tamaki is the eccentric, promiscuous patron living in the same apartment as Shinkuro, she is somewhat like Yuno only more carefree and playful whereas Yuno is more of a quiet yet passionate person, however, while Tamaki tends to wear her pride and flirtatiousness on her shoulder, she still feels some resentment towards herself for being too loose and not willing to settle down or be able to maintain a long relationship. Yamie is...an enigma really, so you could consider that a flaw in that little is exposed of her, but that is also part of her charm as the cunning witch that she is. Renjo Kuhoin is Murasaki's father, he appears to be a tightwad who simply amounts to the principles of the Kuhoin namesake rather than being a real person, when in actuality he cares deeply for his family and feels there is a bit of injustice in his family's system, but he is too fearful of the burden of being one to go against tradition and listen to his feelings. His son (whose name I'm forgetting) is something of a foil to Renjo, he's extroverted and merciless and puts his pride as a Kuhoin above anything else and is very blatant about it. There's also Renjo's wife Kazuko who is one of the most arrogant and vile individuals in the series with that being the only real feature to her character, however if you want to take into account Western beliefs on characterization for villains or those of a similar ilk, having a real backstory for her and demistifying why she is so cruel would ruin a bit of her presence, similar to how people panned Kevin Smith for making a comic about the Joker's backstory. This is also seen in Lin-Cheng Shin, Renjo's son's bodyguard who is absolutely a psychotic nutcase who only desires for a fight, serving as a byproduct and raw exemplification of the son's spite and cruelty, sans the social and political connections to hold her back, making her a devastating individual. Lastly Souju Kuhoin is Renjo's sister who is the anti-thesis to Kazuko as a sweet-natured person and cared far more for Murasaki than Kazuko did, but she isn't shown too much. All in all the characters all serve a purpose and have well rounded personalities for the most part explored sufficiently while sticking to their more prominent traits to make them stand out, with a lot of subtleties to illuminate on them more which you catch onto after watching. 9-10/10\\n\\n\r\nArt: The artwork for Kure-nai is exceptional. The characters don't have super moe, over the top features and their faces all look well drawn and seriously designed to complement the nature of the series. Settings have a diverse palette with rich colours including lots of sensual reds (heck, Kure-nai translates to 'crimson') and other exquisite tones that give it such an alluring feel. There's stellar use of shadows and lighting to accentuate the fantastic palette and make superb gradience. Backgrounds possess a lot of life evoked by the complements of aforementioned factors to make the mundane settings feel alive and lifelike, and then there's the Kuhoin manor's outside with a heavy atmosphere, great texture and an invigorating air to it all with the almost ethereal snow fields caressing the trees in winter and all the leaves and different things in the frame, and the Kuhoin manor itself which touts the most of those vibrant reds with a nicely stylized old Edo-esque aesthetic and all of these vivid designs to make things really pop. Kure-nai has a lot of eye candy, moreso innately with stuff like the Kuhoin manor, but nonetheless is great to look at. 10/10\\n\\n\r\nAnimation: The animation for the series is a bit inconsistent, but has a lot of high points, evident by the fight scenes which spare no expense and don't use any shortcuts or stylish standalone frames, everything happens real time, non stop and right on camera. Meanwhile it can sometimes render things with kind of a 'soup-y' quality to them, kind of melting off and not being totally clear. Episode 6 seems to have an abundance of it, but it is more for effect in that case and something of a more comedic episode. Still, at times it can look a tad awkward, like this one scene in the final episode involving Shinkuro, it's pretty obvious when you see it, and it comes off as a bit inadvertently comedic for an instant. Overall it still has great highs with special complements to the fight scenes for how stunning they look. 9/10\\n\\n\r\nMusic: I'm no expert on music, but the soundtrack for Kure-nai just sounds lovely, simply put. It further complements the stuff on screen with mesmerizing piano songs that are very romantic and captivating, like going to a ritzy, sophisticated bar or high class outing or cozying by some regal fireplace quality. Refined and relaxing, these songs total justice to the series and are great for savouring and unwinding yourself with. 10/10\\n\\n\r\nEnjoyment: Kure-nai is not for those with short attention spans or those who need something large scaled to happen every couple of minutes, but for myself and others who enjoy anime of a more heart warming and tender nature that's audacity builds gradually, Kure-nai does wonders. The dialogue had life and realism to it, the atmosphere was both enchanting and immense, the pacing was natural, the writing and plot was sharp and investing, the production values were excellent, the fight scenes were breathtaking, the composure was refined, the characters were memorable and the themes were poignant. I have no complaints, Kure-nai was a belly full for my soul. 10/10\\n\\n\r\nIn conclusion, Kure-nai is a seductress, or a tamed lion even; it has all the looks, the composure and the atmosphere to make it a captivating creature and it has bite with its bark. Although it may not always speak loudly, when it does, it is ferocious, and when it is quiet, it is beautiful and touching. The manga can't hold a candle to this adaptation; it is juvenile in comparison, although I still must give thanks to the manga creators for laying the groundwork for this liberal, but far superior adaptation. Despite the anime adapting about 1/5th of the manga, it tells it with a much more resolute passion, and quantity should not take precedence over quality, nor does quantity equate to quality. The 2008 Kure-nai anime is quality. Do yourself a favour and watch it, even if you are big on crazy supernatural shonen fests, if you like a good story, give it a shot and you might get more diversity to your tastes while having the great fights to hold onto. I can't recommend it enough, it is an underrated anime gem and one of the greatest shonen anime of all time, and perhaps even one of the greatest anime period.",
            "date": "2013-11-06T19:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 119523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1999512.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AngelsArcanum",
                "username": "AngelsArcanum"
            },
            "url": "https://myanimelist.net/reviews.php?id=119523"
        },
        {
            "content": "This anime is rather difering from the mainstrem types of stories (I.e Boy meets girl--Girl falls in love with boy--A conflict ocurrs--Conflict is solved--They live toghether happily). \r\nStory: While the concept of a guy guarding a young girl is nothing new, the way in wich the story is presented and developed is rather original. While at first it apears to be a street/underground fighter anime, it is really about the characters personal growth.\r\nArt: The art is one of the first things one can notice in this anime, the image is very sharp with a somewhat dark tone wich give it a realistic look and afluid animation\\n\\n\r\nSound: Ther is no much music apart from the sassy opening and the energetic ending.\\n\\n\r\nCharacters: Characther develoment is the main theme of the anime, all the characthers have a sad/traumatic past or chaotic background  of their own and are striving to improve themselves and (specially in Murasaki's case) understand and the world that surrounds them.\\n\\n\r\nEnjoyment: Although some maturity and taste for true romanticism are required to truly apreciate some of the plot points of the anime, it is virtually  imposible not to enjoy it's unique charactheristics and fast-pacing mainttain the viewer fosused if not captvated untill the very end.",
            "date": "2008-06-23T06:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 5716,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DiGuardian",
                "username": "DiGuardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=5716"
        },
        {
            "content": "Kurenai is about a young girl, Murasaki, on the run from her families' strict traditions, and Shinkurou, a poor student, who also has the job of settling disputes (usually violently), hired to be her bodyguard. (You'd think a dangerous job like that would have decent pay, but whatever)\r\nThe series mostly follows daily life, as Shinkurou learns how to deal with Murasaki, goes to school, and takes a few other jobs. While Murasaki learns about life, and how to have fun, with help from Shinkurou, and the other inhabitants of the apartments where they live.\r\nAll the characters are interesting in their way, and each fits intotheir part of the story well. The humour in the series is all character driven, just watching the way people (particularly young and impressionable Murasaki) act/interact, such as during the 'family' dinners the apartment dwellers have. Whether being dramatic or humerous, I never really felt the characters acted in a way that didn't make some sort of sense.\\n\\n\r\nNear the end, the series switches to mostly action, and it's well done, though it might not be as interesting after the character-based parts. Still, it's hard to imagine the series getting to the end any other way.\\n\\n\r\nThe ending is open, possibly TOO open, and many will probably have a sense of annoyance at the fact. However, in all other aspects, the ending is well done, and avoids being entirely predictable.\\n\\n\r\nThe art is generally nice, but there are times when the animation quality drops, and things get ugly, usually people's faces. Though, when combat kicks in, everything moves fluidly, and looks great.\\n\\n\r\nOverall, this is a good, humerous, character-driven series, with some nice action thrown in for good measure. The fact that the series seems to place the focus on character-development over story might bother some people, however, I think that given the interesting characters, it works well.",
            "date": "2008-11-19T22:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 9688,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25782.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/alx222000",
                "username": "alx222000"
            },
            "url": "https://myanimelist.net/reviews.php?id=9688"
        },
        {
            "content": "Rifling through the anime I had to get through, I remembered that Kure-nai had piqued my interest after the first episode, and in the lull of things, I decided to finish what I started.\r\nNow the story is about young dispute mediator asked to guard a young girl.  Now at first the only thing that came to mind was, there is something deeper afoot.  Sure enough, Kure-nai is rather shy with it's revelations and that just begs for the viewer to continue on until everything is over.  In this regard it is well executed.  As always, some of the scenes may notmake sense until it is later explained but that is to be expected of this offering.\\n\\n\r\nThey went for a realistic approach in Kure-nai, which works well at points but sometimes results are either a victim of the uncanny valley or just plain disturbing.  Especially the a fight scene involving our protagonist and his principle's brother.  Speaking of fight scenes, though they may be brief at points, they are a visual treat thanks to the fluid animation.  What I especially liked as well was the background art.  The hues and lighting really set mood and are very well done.\\n\\n\r\nSound on the other hand, could have been better handled.  The background music is satisfactory already but what I really had a gripe with were the sound effects. Physical contact sounds like they were sprung out of a can of stock sounds or out of a video game (which I must admit I feel as if I've heard them from somewhere else before but I digress).\\n\\n\r\nThe plots is character driven and thus characterisation was given some priority as well.  Our protagonists lives charmingly mature in to real people as they live, struggle and come to grips with each other.  What is really admirable is their courage.  For our protagonist hero it is how he deals with the mistakes of youth and protagonist heroine how she stands up for her freedom.  Our supporting characters are not forgotten as well.  Each have a deeper side to them as it is slowly revealed by others or inferred from what they say and how they say it.\\n\\n\r\nOverall, I enjoyed Kure-nai.  The well written characters and the plot that surrounds it.  And to a lesser extent I enjoy the somewhat more realistically grounded fights.  Personal favourite scene would be the episode involving the musical, which I would describe as classy.  I'm heartily recommending this as something may not be unique to some but well executed.  If you're looking for something nice and quick, this isn't for you since Kure-nai takes good time to enjoy.",
            "date": "2009-02-04T00:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 12118,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109544.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Thaiberium",
                "username": "Thaiberium"
            },
            "url": "https://myanimelist.net/reviews.php?id=12118"
        },
        {
            "content": "Story is between okay and good in the first half, but become literal crap in the later portion of the show. The battle system is broken. You could not tell who is stronger than who. Someone can suddenly become weaker or stronger for the convenience of the plot. Also, it can really cause some frustration with the \"I don't want to use my full power\"-stereotype. \r\nThe art is really unique for a light novel adaption and is pleasant to look at. It is similar to many late-90s anime with its toned down color scheme.\r\nThere is not much to say about the music. It gives theshow an unique vibe, but can be underwhelming during emotionally intense scene.\\n\\n\r\nThe heroine deserved a better a story to be in. She is lovable and realistic up until the last 2 episodes where she became an uninteresting typical tragedy princess trapped in a castle talking things not fitting of her age. The protagonist is good-looking but with annoying personality. Other characters are just generic.\\n\\n\r\nI enjoyed the show up until episode 7 with little complaint. After that, the show progress into its \"climatic\" final arc where characters' intention make no senses.\\n\\n\\n\r\nThe protagonist:\\n\r\n\"I promise I will help you no matter what\" -> \"Someone is taking her away, but I don't want use my full power\" -> \"Nah, it is just a job given by my boss. I learnt valuable lesson from it. I will not make the same mistake again\" -> \"She need my help, let's go help her\"\\n\\n\r\nBenika:\\n\r\nThe most annoying character in the show.\\n\r\n\"I trust him even though he fucked up every time and there is a 98.9125% chance that he will still fucked up\"\\n\\n\r\nYayoi:\\n\r\n\"I don't want to use my full power even though the lives of my boss, a boy and myself is at stake \" -> \"Nah, let's me use my full power\"",
            "date": "2017-12-15T14:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 265285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Nealiam",
                "username": "Nealiam"
            },
            "url": "https://myanimelist.net/reviews.php?id=265285"
        }
    ],
    [
        {
            "content": "on the shell, kure-nai is a very dull anime. the music is boring especially when the next episode is previewed and there are lots of local fanservice made to mention. however, after watching it, you would surprisingly find the anime deep. every episode rarely has relation with one another but it features lots of things reflecting culture, beliefs, change, and resolve. take the simple squabbles between murasaki and shinkurou. they always quarrel over petty things but they are only acting on their belief of their own right. they who live on different cultures and circumstances, when given before a problem or a point of discussion,they would fight over what they believed in.\\n\\n\r\nthe same goes for all other characters within the story. i believe that there's no such thing as &quot;minor&quot; in this anime.  the playgirl tamaki, the emo yamie, the flirt yuno, the stern ginko, the carefree benika, up to the serious yayoi. everyone lives in their own principle, guided by their own circumstance and belief and i think that factor makes this anime a success.\\n\\n\r\nan anime coated with boredom and differences but gives everyone a sweet taste of understanding and appreciation of life. that's the true strength of kure-nai",
            "date": "2008-07-05T06:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 6014,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29094.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/edgewalker00",
                "username": "edgewalker00"
            },
            "url": "https://myanimelist.net/reviews.php?id=6014"
        },
        {
            "content": "One of the hardest things I have to do as “reviewer” is try and justify why I thought a show was good. Sometimes it’s easy as hell because there’s so many things I can easily point to and say, “This. This is the reason I like this show.” Other times the things that make a show good are a lot less evident and normally lead to me having to say something like, “It’s just good because.” Kure-nai is definitely one of those anime that belong in the latter category, and as hard as it may be I’ll try to justify my point.\r\nThe Short Version:\r\n(+)The charactersare well rounded.\\n\r\n(+)The art is splendid (Except the OP, I don’t even know what that was).\\n\r\n(-)There’s not exactly much of a story.\\n\r\n(-)The sound isn’t anything special.\\n\\n\r\nThe Story (6/10): The set up for the story is simple, the MC is a peacekeeper of sorts and has been hired by someone to do some peacekeeping, namely acting as a bodyguard to an important child, (I made the leap in logic that she’s an heiress to one of those extremely rich and old-timey corporations or something like that) and that’s kind of it. The MC needs to protect this child and as the audience, we follow through said body-guarding and follow the characters in meeting people along the way. That, and we meet the MC’s friends for school. Up until the latter half of the show when it starts to pick up, thus becoming a bit more interesting for the action-heads among us, there are also a lot of supernatural undertones throughout the show and those undertones are the reasons why he knows one of his friends at school. Well, that and a certain *cough* that he possesses. The ending, while I understood why characters did what they did, didn’t really sit well with me. But then again I would’ve really only changed one thing. Apart from that though, it was peachy.\\n\\n\r\nThe Characters (8/10): One of the things I can always appreciate in anime is a tight cast of characters, because that gives me time to, you know...give a fuck. If you throw 50 different characters that you’ve been telling me to follow for an entire show, I’m not going to give much of a toss if some of them die. But if the main cast consists of about 8 people and you throw them into a dire situation, then I’ll probably be biting my fingers down to the bone. With that little thing out of the way, onto the mains.\\n\\n\r\nShinkurou Kurenai: The MC and not the standard archetype of protagonist.\\n\\n\r\nMurasaki Kuhouin: The plot device more or less and a lot stronger than I initially though.\\n\\n\r\nGinko Murakami: An information broker and the less obvious love interest.\\n\\n\r\nYuuno Houzuki: The more obvious love interest and the closest person to Shin.\\n\\n\r\nThe characters are really well done considering I went into this anime expecting the bog standard archetypes for each person, ie. The Tsundere, the Childhood friend, the wimpy protagonist, and I got some of those but they put enough of a spin on them that they felt new. All that and the characters acted like people would act in some given situations.\\n\\n\r\nThe Art & Sound (7/10) & (7/10): DON”T BE FOOLED BY THE OP! The art in this show is halfway decent, it’s fluid and kinda unique. This is one of the problems I mention at the start, I know its good I just don’t know how to put it apart from, “It’s not janky and it’s good to look at.”(For the most part) That and the characters are a lot more properly proportioned than other shows I’ve seen.\\n\\n\r\nThe sound is alright, the voice acting across the board is well done as the voices of each person felt like they belonged to that person. The sound design and the OST however aren’t exactly much to speak of, however there is an entire half of one episode where the cast sang a beautiful choir number. That part *tick of approval*.\\n\\n\r\nWhat do you think of this anime?\\n\\n\r\nIt’s alright to kill some time; not going to buy it though.\\n\\n\r\nWould you recommend this anime?\\n\\n\r\nYeah if you’re looking for a show to watch after work to fill that gap between getting home from work, dinner, and going to bed, then sure, watch this show.\\n\\n\r\nGoodbye my brethren, see you in the next.",
            "date": "2015-10-07T19:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 200734,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4180693.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SirHellfire",
                "username": "SirHellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=200734"
        },
        {
            "content": "Kurenai was an incredibly enjoyable anime.\r\nThe characters were done really well.  The design was good and the animation was pretty fluid.  There&rsquo;s also a wonderful amount of character development.  And I definitely can&rsquo;t forget to mention the great voice acting.\r\nThe story was different.  There were several conflicts building into one major conflict.  Kurenai is full of action, a suspenseful drama with intense fights, yet at different times, it can be light-hearted and just hilarious.\r\nThe peeps really did a good job putting together this anime into a short but satisfying 12 episodes.\r\nThe music was okay.  I personally thought it fitthe anime well.  It wasn&rsquo;t absolutely amazing, but it matched the moments of the anime and that&rsquo;s what&rsquo;s important.  And yeah&hellip;the opening is definitely one of a kind x)\\n\\n\r\nKurenai was enjoyable, cute, powerful, funny, exciting.  \\n\r\nIt was a great anime.  I recommend it to EVERYONE.\\n",
            "date": "2008-06-22T10:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 5692,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LaughingDuck",
                "username": "LaughingDuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=5692"
        },
        {
            "content": "I know my reviews aren't helpful, but I figure putting in my 2 cents is still worth it.\r\nKurenai is short and sweet, and I feel provides a bit of something for everyone. Whether it be slice of life, action, comedy, mobster/gangster style family drama, it gives a comprehensive experience in a short and sweet package.\r\nI at NO POINT felt like it was dragging on, and the ending was satisfying, unlike so many shows that are amazing UP UNTIL the ending.\r\nThat's my review, comprehensively short n sweet. Just like Kurenai.\r\nWHOA, almost forgot to add; the musical score is one of the best I've heard, barring theobligatory goofy opening and ending typical anime songs.\\n\\n\r\nMerrilin",
            "date": "2009-09-11T22:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 18614,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/226805.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/merrilin",
                "username": "merrilin"
            },
            "url": "https://myanimelist.net/reviews.php?id=18614"
        },
        {
            "content": "Meh i don't really have a straight opinion of this anime. The entire show aside from the ending was for me a solid 10. The comedy and deep story mix really well and provide a binge worthy combo for the viewer. However i can tell you this now the ending for me was over the top unsatisfying. \r\nI liked all the characters and they all worked well for the type on anime it was. There was also a good mix of action involved. \r\nI guess if you can put up with a half baked ending then give it a go, i just really wish theending was as good as the main show.",
            "date": "2017-03-28T17:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 243851,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450983.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Tanya-Project",
                "username": "Tanya-Project"
            },
            "url": "https://myanimelist.net/reviews.php?id=243851"
        },
        {
            "content": "This is one of those anime where you just find it randomly, but let me say that this was a fantastic find. The story itself is a bit different than any anime you would watch today. At the beginning of this I wasn't to sure but as I got 2 episodes in I realized that this was easily one of the best anime I have ever watched in my life. One of my problems though (though it wasn't a big one) was that the story didn't give you a lot about the main characters past, but that was about it for me personally speaking. Ithink that everyone should give this a try I believe that most people would enjoy this.",
            "date": "2016-06-27T23:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 222217,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4800509.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kesichjo",
                "username": "kesichjo"
            },
            "url": "https://myanimelist.net/reviews.php?id=222217"
        },
        {
            "content": "I personally enjoyed it greatly. It gets you thinking about what it would be like to live like Murasaki as well as being able to relate to what was going in terms to what society (family, tradition Etc) views as right compared to what is actually right. Its a very heartwarming story that gets you thinking. If you want something which really makes your heart tingle then this anime is for you. The fact that the two main characters are so similar yet so different makes it all the more enjoyable. This anime is highly under rated and deserves to be higher on both thepopular and top rated anime list. It has everything someone would want if they don't know what to watch. Something that isn't long and is extemely enjoyable. I highly sugest you watch this anime even if my review may make it look bad. Im not that good at writing :( The older looking animation may put some people off as the year it was made has many other anime with greatly superior animation quality however i think that the older looking animation adds to how great this is. I would recommend it for both veterans as well a newer anime watchers however if you are a veteran you MUST WATCH this anime if you are to call yourself a veteren. I wouldn't say no to anothe season of this anime although there will never be one it would have to be in the same art style. I wanted to see if i could get the novels for it so i can continue the story. I anyone knows where i can find them in english i will give you a cookie.\\n\r\n-Otaku Joe",
            "date": "2016-06-11T04:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 220479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5306134.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Otaku_Joe",
                "username": "Otaku_Joe"
            },
            "url": "https://myanimelist.net/reviews.php?id=220479"
        },
        {
            "content": "As many have already said, kurenai wasn't a show I was expecting to fall in love with. It looked like fairly standard anime fare from the mid-2000s, but it turned out to be much more than that. \r\nSTORY: The plot of kurenai is good, but that's pretty much all you can say about it. It's dark, but also a little outlandish and goofy ( meek highschool boy has large blade in his right arm, and works for the Yakuza.) And it is very vague in the beginning. But it serves as a fine setting to hang the characters, which are the main draw of thisseries.\\n\\n\r\nCHARACTER: The characters in kurenai are excellent. They are all 3 dimensional and complex, and seeing them interact makes this show a joy to watch. Murasaki is addorably stubborn, shinkurou is a quiet badass, yamie and tamaki are a riot, and it's all pulled together with outstanding voice acting.( Though if you've watched HXH all you'll hear is kurapika from the MC) another very admirable thing is the lack of outright fanservice. No one ever does anything out of character to pander to the viewer.\\n\\n\r\nART:  The art is another area where kurenai shines. You can tell that this wasn't the highest budget production, but everyone making it wanted it to be perfect. Whether it be the beautiful character designs, gorgeous colors, lush backgrounds, or occasional burst of great sakuga. This is a good looking show, and it has aged and will continue to age very well.\\n\\n\r\nSOUND: not much to discuss here, the OST is alright, but not very memorable, and the sound design is fine.\\n\\n\r\nENJOYMENT: This show could have been the most generic, obnoxious thing ever put to animation, but such great care was taken with the direction and execution that it ended up being fantastic. The dialogue in this show is extremely natural and fun, the comedic timing is surprisingly on point, and you'll be itching to watch the next episode.\\n\\n\r\nOVERALL: The only thing keeping me from giving this show a 9 is the ending, though while not terrible, nor gut wrenchingly sad, left me wanting, and slightly disappointed. I almost think I would've been happier if the story didn't really have a conclusion and just sort of ended after the slice of life stuff, but oh well. You should still watch this show.\\n\\n\\n\r\n8/10",
            "date": "2016-12-17T09:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 235625,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5328083.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bango-skank",
                "username": "bango-skank"
            },
            "url": "https://myanimelist.net/reviews.php?id=235625"
        },
        {
            "content": "This anime essentially has two core storylines. The first is the one involving Shinkarou exposing Murasaki to the outside world, her experiencing many things for the first time, and slowly growing up along side it. This also involves the many side characters in the series, though they weren't developed that much. On the other hand, there was some very strong character development in Murasaki as can be expected, but there is also some noticeable development in Shinkarou as well. Watching Murasaki was the best part of the anime as she was presented in a very interesting way, where she looked through the world with alot of curiosity and innocence, but had some level of wisdom and was caring and kind at heart, all of which came through very well. Strangely enough however, despite that, the relationship between the Murasaki and Shinkarou felt kind off for the entire show, especially the ending, which is related to the other story line. The other story line is related to Murasaki's family and their drama with how they want to capture her while she wants to be free, as well as the background on that related to their strange customers and Murasaki's mother. This plot line felt a lot weaker than simply watching Murasaki encounter the world. A core part of this plot line was the action, but overall the action felt quite weak, not having any depth to it, nor being flashy. Rather, I would say that it was mostly pretty dull. On top of that, while the overall plot line was somewhat interesting, it seemed to get far too melodramatic, especially towards the end. This is because while it was suggested that there may be more to the story, the anime still ends at a place that feels like a complete ending to the story, and that ending feels incredibly unsatisfying in that it separates the two, and not just not resolving key issues, but rather even acknowledging how key issues weren't resolved. Hence, I felt the story line related to the background arc was quite weak.\\n\\n\r\nThe art and animation were pretty good and fit well but they were kind of dreary. The OP/ED had good songs. The visuals on first for the most part I got used to and liked, but the ED visuals felt weak all the way through. There was also a random different ED song for no real reason at 8 as far as I can tell.\\n\\n\r\nAn anime that is quite good in half of what its about, but that is rather weak in the other half.",
            "date": "2018-10-08T14:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 291281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=291281"
        },
        {
            "content": "This is gonnna be a very short review... the overall show is pretty good but the last few episodes really where just bad if you ask me. The problem that this show had was first of the mc kinda beein a pussy (doesn't help that he was voiced by a woman) and then that it tried to be a good action and slice of life show at the same time but well the slice of life parts are just great and really adorable seein Murasaki get used to living in normal society but the last few ep's that are just action are just not enjoyabledue to just not having satisfying action and the story beein rushed... so basically the last few episodes ruined it's score for me otherwise I recommend it though I would advise to stop watching when the slice of life stops",
            "date": "2018-04-06T19:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 277180,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829922.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sir_Applejuice",
                "username": "Sir_Applejuice"
            },
            "url": "https://myanimelist.net/reviews.php?id=277180"
        },
        {
            "content": "For me a good anime is one that stays with you after you have seen it. Kure-nai does this.\r\nKure-nai follows the brooding 16 year old orphan and martial arts expert Shinkuro Kure-nai, by day a 2nd year high school student and by night a dispute mediator. Being a dispute mediator means working for an organisation where if you have a problem and no one else can help maybe you can hire Kure-nai.\r\nShinkuro mainly deals with low level disputes and low level criminals. After begging his boss Benika for a bigger job he his given the task of protecting Murasaki Kuhoin, the 7 year old daughterof a minor aristocratic family who was destined to be kept as a prisoner in a guilded cage and give birth to her brothers children to keep the Kuhoin bloodline pure.\\n\\n\r\nDespite some some initial problems Shinkuro shows Murasaki the outside world with the help of his neighbours the student Tamaki and the swindler Yamie developing an attachment in the process.\\n\\n\r\nIt is not a flawless anime. The main problem is that at 12 episodes it is too short. The relationship between Shinkuro and Murasaki develops too quickly. There is huge scope for this to develop overtime with Murasaki's initial bratish behaviour lasting a number of episodes instead of one. Far too quickly Murasaki adjusts to living from luxury to a small dirty apartment and sleeping on a smelly futon. The anime probably needed 24 episodes.\\n\\n\r\nThe story itself quite good without being brilliant and not falling into the trap of total implausibility like a lot of animes do.\\n\\n\r\nWhere it comes in to its own is the characters despite their being a harum feel to it. I can't really fault any of them. The middle episodes are really enjoyable as the anime stops being action based and more slice of life as Murasaki spends her time hanging out with Shinkuro, Tamaki, and Yamie visiting schools, university, supermarket and festivals even taking part in a musical as she learns about love and the outside world in general.\\n\\n\r\nThere are romantic interests for Shinkuro with his sparring partner Yuuno and Ginko who collects the information for his cases (both are girls by the way), however, this is not really explored again because the series is too short.\\n\\n\r\nShinkuro's boss Banika is mysterious, decisive and cares deeply for her employees but won't take crap from nobody. His colleague Yayoi thinks protecting Murasaki should be left to a more experienced person but all her complaints fall to Banika fal on deaf ears. Yayoi is quite a lonely person and is found musing on her loneliness whilst watching Shinkuro protect Murasaki. She is also shown to have a very good singing voice.\\n\\n\r\nThe ending is very good. Its not a everybody lives happily ever after but a everybody feels more able to face the challengers life has in store for them. For Murasaki its challenging and not yielding to her families traditions and for Shinkuro realising he is not a lone in the world and being stronger for it.\\n\\n\r\nThis really an anime you should at the very least check out.\\n\\n",
            "date": "2012-05-24T09:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 61817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=61817"
        },
        {
            "content": "08 Season, Remember patiently waiting for the V1 of the season list to see all the new shows, At the bottom with No image and a very short description was Kure Nai, It intrigued me as it had little to on i made a bold move to watch this series, From Episode 1 i was hooked, and look back to this series with fondness, From one i took a punt on with nothing to go on it turned out to be one of my favorite Anime series.\r\nKure-Nai centres around Kurenai Shinkurou, a 16 year old who is already both a master of an arcane martialart and an experienced professional mediator with a long track record of resolving disputes, His new mission is to \"Protect\" young Murasaki Kuhoin and the story follows this mission + his bonding with Murasaki and other people involved in Kurenai's life.\\n\\n\r\nThe progression is fantastic, Great to see the key characters grow as the series continues. They incorporate the \"Harem/Romance\" side into the series, but only a very little, just enough for you to know its there in the background.\\n\\n\r\nArt style has this \"Gritty\" edge to it, I for one am a fan of this suited the sort of dark undercurrent this show had.\\n\r\nSound and Music is really good, Voices for each character were spot on. Even didn't mind the OP/ED Which for most i skip.\\n\\n\r\nMy bias for this series would say its a 10, but more realistically i've marked it down to 9, Its an incredible series, it won't be a series everyone will like but if you are a fan of Usagi Drop (Shows like that) you will love Kure Nai, Its like Usagi just Darker & Martial Arts thrown in for good measure.\\n\\n\r\nAll i can end this with is this, there is a reason this is my only \"Favorite Series\" on my Profile, It's that good in my opinion.",
            "date": "2013-03-12T19:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 89563,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1514017.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lukas10",
                "username": "Lukas10"
            },
            "url": "https://myanimelist.net/reviews.php?id=89563"
        },
        {
            "content": "5 episodes in so far and I have to say, very well done so far. This anime exceeded my expectations. Everyone's characters fit their personalities, you will get lots of enjoyment out of this anime. This anime has a great plot and is very intriguing. Art is very well done, especially the cities/cars/schools/playgrounds/training areas.\r\nI really suggest anyone who likes an anime that has a guy who is somewhat responsible and curb stomps bad guys without an issue and look badass, than this is your anime.\r\nI will update this review once I finish watching the anime. However just don't skip a single episode and watch closelywhen the flashbacks occur or things will not make sense in this.\\n\\n\r\nUPDATE: Finished watching and the end is such a great ending for this series. No cliffhangers none of that and it will leave you feeling happy in the end.",
            "date": "2017-05-10T13:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 247380,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6235853.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Reconceptions",
                "username": "Reconceptions"
            },
            "url": "https://myanimelist.net/reviews.php?id=247380"
        },
        {
            "content": "*SPOILERS AHEAD, READ AT YOUR OWN RISK*\r\nI am writing this review after I finished Kurenai (Or \"Kure-nai\"), to be sure not to forget or omit anything. This is for sure one of the most beautiful anime I have ever seen, a hidden gem, a precious and rare flower that is hidden by an intrinsic thorn forest. It's a masterpiece hidden by so much more popular but mediocre and boring stuff. In the past days I have often wondered if there were anime which could still be interesting, this is a period that all the anime I watch end up disappointing me. And maybe it's myfault, I'm choosing the wrong one to watch, but this made me a bit lose interest in anime, at that point I realized I had to do something. But what? Kurenai was the answer. I've been wanting to see this anime for awhile as it was old enough (and the plot did not made me curious) I had not a lot of expectations about it. \"Perfect!\" I thought, \"so I will not be disappointed.\"\\n\r\nI was wrong. Kurenai is an anime that was done very well, where every little detail, as it seems meaningless, ends up being essential to the plot. For me, the main characters: Murasaki and Shinkurou are the only ones to be really interesting, but the cast of secondary characters is composed of characters that let the viewer like them, being stereotypical or not, they are essential in their own way.\\n\\n\\n\r\nStory | Vote: 10 \\n\r\nKurenai's story isn't original but at the same time it is. I've seen already plot like this but I've just loved how it was developed. Every episode makes you love more the characters, the relationship between Murasaki and Shinkuro becomes increasingly deep and real, nothing is forced, there are no boring scenes from \"harem\", the scenes that may seem lolicon stereotypes end up just to touch your heart! Every scene, every event, everything is able to get you and not let you go. I'm used to pause anime when I watch an episode after another, because at some point I'm bored, but with Kurenai this has not happened, in fact, I could not wait to go on with the story. I wanted to know, I needed to know what would happen. The plot itself is original but if you see other anime is repeated, the traditionalist and elitaria family trying to maintain their hidden  secret, claiming to be right, but being aware of the fact that they are not. Victims who can not rebel against their fate, victims who become brave and fight against it. Everything is repeated, everything is not original, but everything is studied in detail and everything makes you love it. If I have to make a note to the plot that I didn't like, it is that perhaps we should know more about what happened to the body of Shintarou and maybe, we could know more about his past.\\n\\n\r\nArt | Vote:8\\n\r\nThe art is really nice, you rarely see it nowadays, especially the expressions, that are my favorite part of the animation in general in anime, were really beautifully done. There were some parts in which it wasn't the best but overall it was really nice.\\n\\n\r\nSound | Vote:6\\n\r\nI am not a huge fan of OSTs so I don't honestly judge them, I think I couldn't but for me they weren't so great that you will remember them, yet they were perfect for the moments they were used for. I wasn't a huge fan of the OP & the ED but I couldn't care at all about them as I was into the story more.\\n\\n\r\nCharacter | Vote: 8\\n\r\nI loved Kurenai's characters, but as I said before some of them were pretty much useless, mmnh for the story maybe no, because they were used to make things lightly but I think that the story would have been the same without them.\\n\r\nInstead, I want to focus on Murasaki, whom I think it's the REAL protagonist of the anime. I loved Murasaki more than any other character in the anime. She was perfect, every line she spoke, every action she took, everything was amazing. She stayed true to herself even when she looked inconsistent, she was just being herself. I think it's really impossible for a seven years old girl to be as she's but yet I think she's awesome just for that. She is brave, yet weak. She is strong, yet a coward. She was right, yet ignorant. She was truly one of the best girls I've ever witness in anime. I am not a huge fan of anime girls, most of them look like idiots and they can't do anything, especially in anime like these - instead - every decision she took, everything she did - she did it for her own sake. She fought and struggled to archive her future. I love Kurenai, I love how deep her character was and I don't think my words were enough to express the beauty within her character.\\n\r\nI am not going to talk about any other character, as no one of them really impressed me, not even the main protagonist.\\n\\n\r\nEnjoyment | Vote: 10\\n\r\nI really enjoyed Kurenai and I wouldn't mind re-watching it any time sooner (and I don't normally re watch anime). It was an amazing trip and I don't regret picking this anime at all. It made me gain again trust in anime and it made me think that if I look carefully I will find some hidden masterpieces.\\n\\n\r\nOverall | Vote: 9\\n\r\nI couldn't give 10 to Kurenai because the Sound wasn't so good, the plot had some holes and the characters (besides Murasaki) didn't touch me at all. They weren't bad, they were good characters but they won't be stay in my memory as this girl did.\\n\\n\r\nI hope everyone will try to watch this anime, that you'll like it or not it's up to you, but yet it's not something you should miss in my own accord.",
            "date": "2016-12-19T15:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 235849,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kirinopants",
                "username": "kirinopants"
            },
            "url": "https://myanimelist.net/reviews.php?id=235849"
        },
        {
            "content": "There is one way I would surmise what the essence of Kurenai – what a ‘good life’ really is. The reason/motivation a person has to wake up each day and do what they do. The little things/moments in a day that made it worth living. Most of all, it makes you consider what life would be like without them.\r\nTry imagining this – from the moment you were born, your whole life is planned out. You will have no rights. You will be kept inside for your whole life. You are not allowed to speak to others. Only material possessions will be allowed – those devoidof emotional value and life. Now compare that to your current life. Feeling a bit more fortunate?\\n\\n\r\nThis is the bleak reality for Murasaki Kuhoin, a 7 year old girl in the mighty Kuhoin family. Following strict traditions from centuries ago, females in the Kuhoin family and employ are forced to live in the ‘Inner Sanctuary’ for life. Her life completely manipulated for her by her cold, cruel father – she is barely a shell of a person. Until Benika, a former female security agent of the Kuhoin family, takes Murasaki from her confines and places her in the care of her apprentice – 16 year old Shinkurou Kurenai. (hence the series name) Learning his way as a ‘dispute mediator’ under Benika’s direction, Shinkurou is a person with little motivation or direction. He has more than his hands full being the protector of Murasaki. But gradually, Shinkurou and Murasaki end up bonding and filling the voids in each others’ lives.\\n\\n\r\nI need to point out something now before one gets too deep in – Kurenai is not an action series, so don’t go looking for action. There is a coherent plot in this story, but this is not the crux of it. This is a series that is about EVERY moment that the characters live through and what they take from it. Yes, this is an unusual emphasis, but this is where Kurenai’s strength as a series comes from. One’s patience/desire for action may hinder them from being able to appreciate this style. So be warned about this style – it won’t be for everyone. This will depend on your values and what you expect to gain from Kurenai. My advice – have no expectations. At all. Let the story do its work.\\n\\n\r\nBrains Base, a younger studio with titles like Kamichu and Baccano under its belt, have proven to consistently provide quality production values. This is their best effort yet. The animation is simply spellbinding. The caricature-like nature of the opening sequence is a laugh and very well done. It acts as a good foil to remind the viewer that while this is a somewhat serious series with some darker moments, you need to lighten up as well. The in-episode animation is gorgeous. Characters, backgrounds, moving objects and the like all get equal attention. The colours and line details are spot-on, making for very pleasing, fluid viewing. The faces are some of the best I’ve ever seen. To say that the quality is top-notch would be an understatement. The music in-episode is a very sedate, ambient affair that suits the series.\\n\\n\r\nMusically, this series does a decent job but I wouldn’t call it stellar. Both the opening and ending songs are light, bouncy songs with messages of value, everyday life and memories. In-episode music is mainly for mood purposes. The voice acting is of a very good standard. Of particular note is the ease in which the voice actors are able to properly emobdy the emotions and psyche of the character at that particular moment. One can feel Shinkurou’s confusion or his sudden passion, Murasaki’s snappy mood or her affection, the eternal bitterness of the Kuhoin head, Benika’s constant struggle and her frustration at seeing Shinkurou not reach his potential.\\n\\n\r\nThe story is not very complex. Murasaki has been taken from the Kuhoins. The Kuhoins want her back at all costs. Benika and Shinkurou have something they have to do for Murasaki before they will let that happen. But once again, the story is not the emphasis of this series. It is on the characters. Still, the story felt like one that had enough purpose and plot within it to justify this series. The seemingly simple events like taking a bath, walking around school, playing out a musical are made to be special and meaningful because they really are. An experience that is had under freedom and that is a positive one should be valued and not taken for granted. That is one of the core messages of Kurenai. Loaded with many classic one-liners (including the funniest payout of lolicons ever [yes, Kurenai can even parody itself!]) and many gripping scenes, there is plenty to enjoy and be moved by.\\n\\n\r\nKurenai’s characters are what the series live and die on. It excels with them. Shinkurou makes for a very unlikely hero. He’s somewhat strong but not very. Initially he is unable to converse well with people and lacks confidence in himself. (Considering he watched his parents die in a terrorist attack, that can be forgiven somewhat.) His female classmates intimidate him and almost act as pseudo-parents, not to mention graudally falling for him. But this is what is so interesting about the guy – he has flaws and he knows it, but he wants to be stronger. He just doesn’t quite know how. But through Murasaki’s difficult and demanding nature, Shinkurou is forced to draw upon himself to be a responsible minder for Murasaki and make her understand that the outside world is a very different place. He isn’t the most ideal/qualified minder for Murasaki – or so he thinks. His ability to see Murasaki as what she really is – a manipulated girl who wants to live live but doesn’t know how, as well as having selfish behaviour programmed into her by her family – provides Shinkurou with something he didn’t have before – motivation/raison d’etre. Everything up to this point has offered Shinkurou little reason to feel good about his life. But once Murasaki enters it, Shinkurou knows that someone has to save that little girl, which he takes upon himself. Not to mention being more grateful for the basic freedoms and choices he once took for granted. To say ‘Kid, your life isn’t over. There’s a whole world out there with so many things to experience and see. And I won’t let anyone deny you those experiences.’\\n\\n\r\nBy the time Shinkurou reaches the end of this story, he no longer doubts himself. He interacts properly with others, he wakes up with a purpose. Most importantly, regardless of the outcome of this part of his life, he is ready to live the rest of it with passion, to cherish every moment and to enjoy the times with his friends. He is now a person that demands respect and can hold his own with anyone. His metamorphosis through the series is a real delight, for few males in anime display the true strength to be a man with dignity when needed and to be tough when needed. A perfect antidote to the mass of weak/emo male leads that plague anime today.\\n\\n\r\nMurasaki – what an amazing little girl. I rarely like kids but Murasaki stole my heart. Her ways with others are a mixture of insane hilarity and heart-warming moments that make for very entertaining, moving viewing. When she first enters the frame, she is a shell of a person who simply expects others to do what is necessary to maintain her empty existence. It becomes a very intense journey for Murasaki and Shinkurou to change her into someone who is respectful of others, grateful for what she has and to place true value on things. To be taken from comfortable, confined surroundings to a simple yet free environment is a major shock for her. But her inquisitive nature and the sudden jolt of feeling alive compel Murasaki to explore this strange new world that her family has continually condemned. Gradually, the girl learns how to smile, to laugh, along with a plethora of experiences and emotions she never would have experienced in her sheltered confines.\\n\\n\r\nAs much as Shinkurou is a catalyst for Murasaki to grow and experience life, Murasaki is as much the exact same catalyst for Shinkurou. Murasaki wants to explore this world she has suddenly been exposed to but is too little and sheltered to know how. She is essentially saying ‘I want to live but I don’t know how. If you care about me, please show me how.’ Although Murasaki’s initial defiance and brat-like behaviour may mask it, she is always asking that from Shinkurou. So once Murasaki gains some form of self-empowerment and feels alive for the first time in her life, she is able to repay Shinkurou by helping him grow into what a man is supposed to be. This is the true magic of their bond. Two people who find the strength from the other to be there for each other, to grow and to develop a purpose in life. So when Murasaki reaches the end of this story, she is no longer weak, without a purpose or submissive. She is able to find strength within herself to do what only she can. Once Murasaki has played out her part, you can’t help but admire her and be amazed by how much she was able to achieve. Her ending is hardly idealistic, but it is the most appropriate. Murasaki and Shinkurou reach a point where the two are now able to rely on themselves but are forever grateful for what each of them was able to show the other, allowing them to move on and remember the other fondly. It is a bond that is quite mature and inspiring.\\n\\n\r\nThe other parts of the cast are very solid. Benika is a very formidable woman with a scarred past of her own that fuels her to take Shinkurou under her wing and to take Murasaki into the real world, regardless of what it may cost her. Once Benika’s character is properly fleshed out, it becomes very apparent why she took Shinkurou as her pupil and her motivations to do such a daring thing as take Murasaki from the Inner Sanctuary. She has class, muscle, attitude and passion. A very capable woman worthy of respect. Yayoi, her semi-androygnous female subordinate, is a person who takes life and all aspects of it seriously, never allowing herself to enjoy it or to be happy. Initially begrudging having to watch over Shinkurou and help when needed, Yayoi begins to value the freedoms she has taken for granted once she appreciates the gravity of Murasaki’s life and is able to develop the ability to enjoy moments that make her fulfilled. Shinkurou and Yayoi develop a gradual respect for each other as they realise that thy may be able to learn from what the other has to offer, which proves to be very telling in the final part of the series.\\n\\n\r\nShinkurou’s flatmates and friends make for amusing times. The grieving widow, Yamie, gains a strange satisfaction from seeing Shinkurou initially struggle then is compelled to climb out of her sorrow through her interactions with Murasaki. Tamaki, a very promiscuous female university student who neglects her studies and is overly harsh on men she gets involved with, gradually recognises her own faults from helping mind Murasaki and realises it’s not too late to turn her life around. Ginko, a clever glasses-girl, firmly keeps Shinkurou in line at school and acts as his informant, but even she would admit she actually enjoys the role. Yuno, the female classmate who actively wants to be Shinkurou’s girlfriend, provides some good laughs when coupled with Murasaki and also acts as a good way for Shinkurou to be able to communicate with females better. Renji, the head of the Kuhoins, trapped in family tradition and forever angry at himself for turning his one true love into a broken woman who lost the will to love, makes for a person that initially seems like a villian, or at the very least the ideal person to vent feelings on. But even his own demons he tries to deny will eventually be confronted through Murasaki as he is forced to consider what his own life as become as well as those he has helped destroy. His trials heavily shape the outcome but end up being more worthy of intrigue rather than hate. He is easy to criticise but that would diminish and deny the point of his role. Make sure you reserve proper judgement of Renji until the tale is done. You may be surprised as to what he ends up doing.\\n\\n\r\nA bit of impact may be lost on rewatch, but Kurenai is still such an enthralling series with stellar production values and a character cast that may have the most depth of any ever. Enjoyment of Kurenai is dependent on the ability to appreciate a character-driven series that values all moments equally and the interactions between people. Its unique approach and good mix of humour and reality had me captivated from start to finish.\\n\\n\r\nKurenai is a very unique, refreshing series. To value moments, people and the experiences freedom brings is something no other series has accomplished to the degree this series has. With strong characters and equally strong bonds, this series will entertain, enthrall and evoke everything that is good and bad about reality. But really, isn’t the fact that we get to experience these things what is so magical about life itself?",
            "date": "2011-10-04T22:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 44873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/455146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Last_Sinner",
                "username": "Last_Sinner"
            },
            "url": "https://myanimelist.net/reviews.php?id=44873"
        },
        {
            "content": "it gave me a nice feeling, that Kurenai Shinkurou boy and Kuhouin Murasaki was somewhat the same, both cute, nice and sweet, i don't know how to say how i feel abot them, but i really liked both of them. The art was really good, and the writer had some really good ideas to add in the story, for characters. In some other anime's there are lots of characters that seems like they don't have their own life, just becouse they are not the main characters. i hate it, so i loved this anime for having that. Ah, but i don't really like things likeyakuza , and fighting, and hings like this, so there was pieces that i didin'd enjoyed. but there also was one episode where I was laughing dead ;D . the sixth one , i guess. that was ossum!!  And I really am thankfull for the writer that he added somethin like this, the anime needed it.\\n\r\nWhile watchin this anime i always knew how it'll end, but still wanted to watch further and further!! And i really don't have any regrets that I watched it.\\n\r\nHope This review will be usefull to you, and you'l like the anime!",
            "date": "2009-11-07T09:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 20330,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_makoto_",
                "username": "_makoto_"
            },
            "url": "https://myanimelist.net/reviews.php?id=20330"
        },
        {
            "content": "Awful opening and closing. However, the actual show is really impressive, particularly the art and animation.The show keeps you in the dark for these first few episodes, but the characters definitely make it worth watching. Shinkuro is refreshingly mature for his age and Murasaki is outrageously cute, not to mention 20 years wiser than the average 7 year old, but I personally like that, it continues the japanese 'tradition' of idealizing youth.\r\nThe dialogue and characters are one of the best apects of the show, if you're a fan of dialogue heavy shows, you won't be diapointed.",
            "date": "2012-09-12T03:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 72165,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1507861.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheLostProphet",
                "username": "TheLostProphet"
            },
            "url": "https://myanimelist.net/reviews.php?id=72165"
        },
        {
            "content": "Through out the series of Kure-nai I was always attached. It has characters with substance, an interesting story, and the action scenes were always intriguing. I also enjoy when the watcher has no idea what is going on, and little by little we are allowed to understand what happens, sort of a mystery. \r\nIt's a refreshing anime, with a different story than a lot of action animes. The only downfall Kure-nai has is an unsatisfying ending for some, it has a lot of questions at the end. Although sometimes it's fun to assume what happens in the future for them.",
            "date": "2010-04-02T08:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 24573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150374.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/onigiridango",
                "username": "onigiridango"
            },
            "url": "https://myanimelist.net/reviews.php?id=24573"
        },
        {
            "content": "Well I saw this series last night hoping to watch something that was fun to watch and a bit different than other anime in its listed genres I must say I was not disappointed.\r\nThe characters were vivid but I gave character rating 7 because I think they could have done more, but the overall enjoyment rating is 10 because it is that much good I began with the 1st episode and was gripped to my seat till I finished the last episode and I loved every bit of it.\r\nThe plot is well kinda over the top, but hey this an anime. The characters are vivid,the setting is good. There are things that are enjoyable. In Shinkurou's character we can see how twisted his dual life is as a student ad who does odd jobs (couldn't find any other way to put it), Murasaki's character is just lovable although you may find it creepy that a 7 year old can act this mature but although having a tragic background you don't actually find it too yearning to be pitied, although you may feel a bit of pity but you just get drawn towards her, not to mention she's just too cute. Even the side characters Yamie, Tamaki, Benika and Yayoi although they lack depth, but they seem vibrant and likeable and although they may seem to lack depth and background they are just feel right in the story and they play a major part in the story. \\n\\n\r\nI can go on statin all the good points and I know no one has enough patience to read a long review. \\n\\n\r\nTo sum it all up just watch it.",
            "date": "2013-05-16T03:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 97343,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1219029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/anupkumar_ak47",
                "username": "anupkumar_ak47"
            },
            "url": "https://myanimelist.net/reviews.php?id=97343"
        },
        {
            "content": "Lets get to this;\r\nKure-nail is a series that i hesitated to watch tbh, it was something that didn't quite appeal to me after reading the synopsis but i dove in anyway.  And let me say that I don't regret it.\r\nI think the premise was fantastic, the writing and subtlety of the story was very realistic even though some of the elements are clearly not.  And that's not a bad thing.  I was hooked pretty quick, i ran through this show savoring the potential, it becomes obvious that its one of those shows that lead you in a certain, straight forward direction andclimaxes. \\n\\n\r\nI thought it had all the right elements as well, blended well above average.  There's mystery, fantasy, slice of life, drama, good and interesting characters and their relationships, intrigue and the art was above average as well.  In fact they really tried to push the boundries imo in art direction.\\n\\n\r\nSo with the positives out of the way, and minor spoilers ahead, let me say that you should definitely give it a go.  I, however, was disappointed for reasons of taste.\\n\\n\r\nWhen you build a series up to a single climax, pacing the story and pushing it towards an inevitable and yet refreshingly unknown conclusion, certain expectations will arise.  These expectations are dictated by personal preference.\\n\\n\r\nFor me, it was a little bitter sweet.  What i wanted and what i got miserably clashed at the end.  Even throughout the show in its execution.  It was, to put it mildly, weak.\\n\\n\r\nThe climax delivered in some ways, but failed, imo, horribly in others.  Namely how the stage was set for a violent confrontation, which occured, but ended in a very sub par, shounen-esque way.  I wanted the MC to open a can of whoop ass that would reverberate throughout the halls of the MAL community, kicking ass in a tornado of epicness.  Instead it fizzled most unexpectedly.  It almost seemed like the entirety of the earlier episodes were just wasted.  That's how it made me feel.\\n\\n\r\nSo what's the problem?  I clearly enjoyed the ride, but was slighted at the over hyped destination.  The MC was really setup to be an ass kicking machine the moral prerogative to deliver sweet just desserts.  Instead we got an anti climactic moral which in hindsight seemed foreign to the initial trajectory.  In more spoilery terms, the reward was insufficient and laced with obscene naivety.\\n\\n\r\nNothing you can say can reconcile what happens at the ill fitting end.  Which rendered the character dynamics almost worthless.  Don't build a race car to drive it 20 miles under the speed limit or only use it to go to the grocery store.",
            "date": "2014-04-16T00:59:00+00:00",
            "helpful_count": 0,
            "mal_id": 140121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/149637.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Marthgun",
                "username": "Marthgun"
            },
            "url": "https://myanimelist.net/reviews.php?id=140121"
        }
    ],
    [
        {
            "content": "First, I want to clear that the only reason why I watched this was because I thought Murasaki was so cute and the story behind her might be interesting so I thought “Let’s give it a try”. However, along the way I was extremely pissed.\r\nI am very much aware that there are lots of custom like this one since ancient times and unfortunately until now. I know very well that we should respect others’ opinions and beliefs and what they do with their lives but I really can’t understand such customs. Sometimes I genuinely can’t comprehend what’s on rich people’s mind or any other peoplefor that matter. This was beyond abnormal but absolutely insane. While poor people struggle to have money, rich people struggle to keep their lives so damn complicated. This is the problem with rich and powerful people they always thinks that they are so special from others and have the privilege to do pretty much everything they want and that usually within their own brethren. This is one of the reasons why I am very much thankful that I am not that rich. Setting aside the story, I know a lot of people who have the same problems and they are all rich. The truth is, rather than be mad at them I pity them most of the time. I rather work my ass off with jobs to have money than be in this insane situation. At the end of the day, the only person who was most affected was the child. Murasaki, at a very young age was so mature already because of the adults around her. She should be a child playing and doing things that children should be doing. Because of the insane minds of the adults, the child suffered so much already even though she’s very young. By the way, she’s the only character who was genuinely effective. I like how cute she can be when she’s so naïve with the outside world and this was not because she’s rich but because she was literally kept from the outside world.\\n\\n\r\nAnyways, regardless of that issue, there were still too much cliché in the story and main plot. A typical story about modern day damsel in distress and knight shining armor. I knew that this was a slightly romantic type of story but I felt that it was more of brother/sister love. I guess that was because of the girl’s age. Perhaps, if she was 10 years older and even with the same age difference it would’ve been more of a romance between boy and girl.\\n\\n\r\nIt would’ve been a great anime with such potential but unfortunately rather than be entertain I was extremely pissed and disappointed with the whole thing. I believe the manga form is slightly better than the anime form.\\n",
            "date": "2012-12-09T07:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 79614,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79614"
        },
        {
            "content": "To preface, I shop by reading both the negative reviews, the ones where you can feel the animosity emanating off the screen, you know, really taste the salt, and the good, the ones that get you real excited like.  That being said, I feel like I was tricked into watching this.\r\nPros: The show tackles some pretty heavy material including how to tackle problems in the family, finding yourself, child captivity, overcoming your past, and many others\r\n-The music in the series\r\n-The art (for it's time)\r\n-A lot of strong female character roles\r\nCons: It's really hit and miss with characters (poor development and such)\r\n-The inability to tacklethe said heavy material\\n\r\n-Nothing but female characters (the genres for the show are comedy, drama, martial arts, but the genres for the manga are much more telling with the inclusion of romance, harem, and supernatural.  I mean those are clearly visible in the show, but maybe just the opacity is set to something like 99%)\\n\r\n-Lot's of dialogue that doesn't do anything\\n\r\n-Throws you into the story right away and doesn't offer any explanations about what is anything (kind of a, \"Here's a new important character...Yeah.\")\\n\\n\r\nI couldn't find any (and opted for, \"Heavy material\") themes because I couldn't find the characters.  I couldn't find them because I didn't know who, what, are why certain characters were even there.  When anything happened it was just kind of a, \"Okay,' sort of response.  The show has all the right elements, you know, there were glimpses of backstory, people coming together for a common cause, friends abound, glimpses of what could be some sort of any relationship of any kind *expectations rising*.......nada thing happened with any of those possible outlets *complete deflation.*  Everything sort of happens as if time only flows when the MC is present, so the neighbors never seem to have a life, the friends don't seem to do very much, and everybody thus seems to be confused about how old they are; we've got the seven year old appearing as if she's a possible girlfriend for the MC, the adults acting like the seven year old should, and the high school students, well, at least they got those right.  The show never played up to its strengths, I mean I was at least hoping for the relationship between Shinkurou and Murasaki to resemble that of  the MC's and their youngsters in Barakamon, or Darker Than Black II, but it just didn't feel as momentous.  Haven't read the source material, so perhaps it was just a bad transition.  \\n\\n\r\nFor the best optimal viewing of this show I'd recommend simply googling the ost and reading the summary.  You can pretty much say you you've seen it after that.  One last thing (grain of salt if you will), the male characters in the story?  Nonexistent.  The mathematical equation representing this (especially in any fight scene) is, \"All the male characters ≤ one decent female character.\"  (I mean plenty of other shows do it just fine though, but this one just doesn't work because of everything else)\\n\\n\r\n-This review is meant to be clearly negative in the hopes of helping anyone who shops like me",
            "date": "2018-12-31T12:50:00+00:00",
            "helpful_count": 0,
            "mal_id": 297605,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6063730.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/RomajiMaster",
                "username": "RomajiMaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=297605"
        }
    ]
]