[
    [
        {
            "content": "Kodomo no Jikan is a heavily controversial title, and with good reason. But like most controversial titles, its subject matter is not exploited in vain, and the end result is something that can be credited, at the very least, as a decent series in its own right.\r\nNo series has dared to tell the story KoJikan tells and gotten away with it, but for all the underage fanservice it provides, the heartwarming drama beneath the disturbing ecchi comedy ultimately shines. Had KoJikan been solely about the fanservice, this series would deserve all the negative criticism it has received, but there's a heavy dollop of character-driven dramaand unique relationships, the context of which have never been explored up until now. One of its more important plot aspects is the recognition of children as having the same emotional needs as the rest of us. It's a touchy subject, but handled with precision and never crossing the line, though toeing it on occasion. Though KoJikan still handles issues it brings up head-on, it does so in an abrupt and awkward presentation, constantly and abruptly switching between drama and comedy. It may flawed in its execution, but its heart is in the right place.\\n\\n\r\nLikewise, no series has dared to have characters like KoJikan's and gotten away with it. This is in great part to the main character being far more than she appears on the surface, especially when her laudably deep and complex emotions are explored. Unfortunately for most characters, they are relegated to often insulting cliche traits substitued as personalities, though this may change in future seasons. For now, the only real depth is in Rin and her cousin Reiji. However, the series should be commended on portraying 8-year-old girls with relative intelligence while acknowledging that they are still physically and mentally children. It's territory anime often skips in favor of taking the \"moe\" way out and its nice to see a series that portrays kids as kids.\\n\\n\r\nThe art is bright and cute, though the character designs are a little off-putting, especially Rin and Mimi's hair. Outside of this flaw, everything looks nice and neat. It's a slightly above-average job all around.\\n\\n\r\nThe music didn't stick to me but I don't remember it intruding in any way. The OP is one of my favorites, not for being a good song, but because the lyrics fit the tone of the series to a T. The ED is a hyperactive J-pop number that the audience this kind of show often attracts will enjoy greatly.\\n\\n\r\nFor me, KoJikan was a mixed bag. It is not anywhere near the horror that it was constantly advertised as prior to its release, nor is it entirely redeemable due to its abrupt swings between the drama and its uncomfortable brand of comedy. The end result is quite commendable though, assuming one watches this without a die-hard need to find as many disturbing details as they can.\\n\\n\r\nOverall, I give Kodomo no Jikan an 8 out of 10.",
            "date": "2008-10-25T20:33:00+00:00",
            "helpful_count": 256,
            "mal_id": 8960,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8731.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Splitter",
                "username": "Splitter"
            },
            "url": "https://myanimelist.net/reviews.php?id=8960"
        },
        {
            "content": "What can I say about this show that isn't absurd, offensive, or down right politically incorrect? As a forewarning to those who are offended by lolicon-esque (kids in ecchi situations) anime DO NOT WATCH THIS SHOW. \r\nWith that aside, for what its worth, the show minus the loli porn wouldn't be that bad BUT there are ALOT of things wrong with the show in the technical sense. From episode one, you can tell this is only worth watching if you got the DVD version (if there is such a thing). Alot of jokes don't get off the ground because they're bleeped out and i don'tthink i need to mention about the lolicon/comedy situations. I don't mind them censoring the scenes but at least leave the speech in tact. Having whole sentences at a time bleeped out, funny words or emotions replaced with a duck or a dog sound or even the fabled comedy car horn definitely kills most of the shows main ingredient, shock comedy. \\n\\n\r\nSo you get past how perverted a set of 3rd grade the girls are, how are their personalities? Well it seems like they borrowed a few character types from a few popular anime of previous airings. For instance Mimi is very moe and has large breasts especially for the age group she is supposed to be in. Kagamine Rin's other friend Kurogame pretty much Rin's polar opposite, very conservative, conceited, and mean. She is also in charge of pulling in the viewers that love the nekomimi girls (whereas Mimi pulls in the moe viewers). Lastly, Kagamine Rin can be easily labeled into the 'tsundere' fan base but her personality is more unique than what you normally see in an anime. She basically displays the oppositie traits from Kuro-chan most of the time but she does have her good moments and ecchi moments. Rin is a very unpredictable character that you will either learn to love, hate, or even both. Although they don't cover Kuro's or Mimi's background as much, you will come to know all about Rin and how she's become how she is today which is rather interesting. \\n\\n\r\nCharacter styles isn't the main draw for this anime in my opinion, but rather the artwork is very top notch. Not only is the animation is very clean and detailed. The girls get different (and detailed) outfits for every episode. Their eyes  in this show is some of the best eyes i have ever seen drawn in an anime. Not just because of their general size, but in detail and color variation. The classroom children ALL look different from each other, complete with different types of clothing and hair styles. There are so many variations in this show its hard not to notice the hard work the staff has put into this anime. Theres even a scene when the kids have their cellphones and DS's out and they all looked unique from each other. They even take use of distance blur to an effect which is impressive itself. If there was any blemish about the artwork of the show would be the lack of different scene locations. It was either at school or one of three different homes (the automatic beach episode doesn't count). Also, some people will not care for the hair at all. Their hair is a very hit and miss subject, and as for me, i couldn't care less after episode two. I cared vary little about the story or the ecchiness of the show but the main reason i watched this was simply because of how high quality the artwork is. \\n\\n\r\nThe story is easily forgettable but most of the time you'll pay more attention to what is going on at the moment than the overall story, all though the overall story wont kick in for a while.  But for the most part, you start to feel alot of things for Aoki-sensei. Sometimes you'll get mad at him, or wonder why he's so stupid, or how he can do something so reckless, or even wonder why he would bother to put himselves in certain situations. But for the most part you'll be worrying about him more than anything else. Also if you look past all the ecchiness, the three girls are really cute in their own way. And not because of their moe-ness but their voice acting is perfect and their range in emotions are spot on. Its hard to pick who my favorite seiyu would be out of the three because they are all that good of a seiyu. \\n\\n\r\nThat brings me to another great part of the show, sound and music. Elementary school sounds just like school with rowdy children. Even when theres scenes when the school halls are empty, you can hear the bustling of the over sized air conditioning unit. Basically what I'm trying to say is that the environmental sounds are pretty spot on. Its kinda sad that not most anime can't copy this much detail in environmental sounds as they do in here. It really brings out an anime from being a cut and paste low budget series. Even the music (mood or background) is very high quality. And the music varies in type as well, at times there would be techno and at times a comedy flute and also the suspenseful string quartet is even here. And since this is first and foremost a comedy anime, all the comedy bells and whistles are there, but not as much as you would expect. Lastly, the OP/ED songs are very catchy and energetic just like how the girls are. They fit the anime very well and its been a while since i actually appreciated a good OP and ED song from one anime. \\n\\n\r\nIt's a shame that so many things get censored out, specifically the audio. Also it didn't help that the fansub didn't bother to translate some on screen text. But thats not the anime's fault. So what do you get when you plan to air a non-TV friendly show on TV? You get a lost in translation TV show. Although it would make a hell of a lot more sense if the school in question was high school instead of elementary school but then it wouldn't appeal to the lolicons right? Not many anime appeal to the lolicons so im sure this was made as a niche anime to seize that market. Most shows with little girls are supposed to appeal to little girls (Ichigo Mashimaro, Moetan, etc, etc) but this one is so obviously blatant with its use of ecchi its ridiculous. It tests a fine line between serious drama and ecchi comedy that it actually works. If it didn't, why would there be a second season? It would definitely be more understandable if it was a direct to DVD instead of airing on TV.",
            "date": "2008-04-19T15:40:00+00:00",
            "helpful_count": 115,
            "mal_id": 4168,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4168"
        },
        {
            "content": "I went on a quest into the depths of Hell to find the worst anime of all time. I sampled the usual suspects like MD Geist and Kite, only to find myself wanting to find something more obscure and truly, unspeakably horrible. I didn't just want to find the punching bags that everyone already knows are terrible. I wasn't looking for the well known atrocity like the Plan 9 of anime, but for the Manos of anime. What I found, was so horrible that words can't even describe it. I have literally lost my faith in humanity. Turn back now if you have any semblanceof sanity that you value. For those of you already driven insane by the boundless depths of mankind's depravity...This is Kodomo no Jikan.\\n\\n\r\nThe following was my reaction to finding out this anime exists:\\n\\n\r\nThe madman jumped into their midst and pierced them with his eyes. \"Whither is God?\" he cried; \"I will tell you. We have killed him -- you and I. All of us are his murderers. But how did we do this? How could we drink up the sea? Who gave us the sponge to wipe away the entire horizon? What were we doing when we unchained this earth from its sun? Whither is it moving now? Whither are we moving? Away from all suns? Are we not plunging continually? Backward, sideward, forward, in all directions? Is there still any up or down? Are we not straying, as through an infinite nothing? Do we not feel the breath of empty space? Has it not become colder? Is not night continually closing in on us? Do we not need to light lanterns in the morning? Do we hear nothing as yet of the noise of the gravediggers who are burying God? Do we smell nothing as yet of the divine decomposition? Gods, too, decompose. God is dead. God remains dead. And we have killed him.\\n\\n\r\nThe \"plot\" is that a 3rd grade girl is hellbent on seducing her 25 year old teacher, which makes her cousin jealous, because he wants to bang her. This follows the pedophile assertion that \"pedophilia is caused by naughty children seducing weak, helpless adults\". Apparently the author of Kodomo ignored Nabokov's advice and took Humbert Humbert at his word. If there was justice, Nabokov would have to watch this pile of shit and suffer for the unholy genre he unleashed onto the world when he unintentionally became an icon and god to pedophiles everywhere. However, there is no justice! Why? Because this pedophile jerkoff series got 3 GOD DAMN SEASONS. Let me fucking repeat that for you, 3 GOD DAMN SEASONS!!! Most of the greatest anime ever created got 1 or 2 seasons. Spice and Wolf left us with most of the visual novel never to be adapted. This was what apparently deserved the animation funding that could have made a 3rd season of Spice and Wolf or 2nd season of Elfen Lied. We really needed more Kodomo.\\n\\n\r\nArt: 1/10\\n\\n\r\nThe drawing is decent, but when that drawing is used to graphically portray pedophilia in an erotic manner for the pleasure of the depraved...can it get higher than a 1?\\n\\n\r\nOverall: 1/10\\n\\n\r\nThis is the only anime I have ever seen where not only did I hate every second with every fiber of my being, I honestly questioned if every member of this production crew deserved to die. The producer, director, writers, artists, voice actors. Do any of them truly deserve to live after unleashing Kodomo on to the world? I'm not sure. I'm just not sure.",
            "date": "2014-09-19T23:26:00+00:00",
            "helpful_count": 113,
            "mal_id": 161117,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=161117"
        },
        {
            "content": "After being recommended by a friend, I decided to check out this series during a lull in my hectic anime watching schedule. I wish I could’ve come up with a better introduction, but I’m writing this in between clacking away in a race against time to finish a 4,000 word creative piece about a magical girl forced to defend a town in Ukraine from radioactive zombies by Monday. I would wait, but I have a feeling that if I did, these thoughts would just poof from my head and wouldn’t come back nearly as easily.\r\nKodomo no Jikan is a show that raises several interesting pointsthrough a superb blend of drama and comedy about the nature of children’s emotions, and how they tend to be rather hyperbolic in nature. As we all know, children don’t learn self constraint on their own. By age 8, which is the age of the main children in KodoJikan, emotional control hasn’t fully developed, and there are still tendencies toward feeling strongly one way or the other that can sometimes overlap into precocious infatuation.\\n\\n\r\nKodomo no Jikan is a show that follows Aoki Daisuke, a third grade teacher fresh out of college, eager to teach his new class. He has to deal with all the frustrations of fostering learning in elementary school students still in the prime stage of emotional growth: Complaints, balancing friendliness and strictness, spoiled brats… and a precocious girl with a Lolita Complex, named Kokonoe Rin, who lusts after him.\\n\\n\r\nYes, from that synopsis, you will likely gather that KodoJikan is an ecchi-fest of monumental proportions that will make lolicons the world over cheer in jubilation. However, before you write it off as nothing more than pointless fanservice, I’m going to take away your pen and smack you hypothetically for making presumptions based on that overly simple synopsis.\\n\\n\r\nYou’d be correct in assuming that this is heavy on the fanservice, but there’s an entirely different point to be made here: Not only does this series relish in the comedy of such an uncomfortable situation, but it does well at analyzing all the factors involved. And, happily enough, Daisuke doesn’t eventually fall for Rin. Not going to spoil anything here, but it ends on a very happy note, and Rin turns from a manipulative little succubus into a wholly sympathetic character with a tragic past, whose lust is somewhat justified.\\n\r\n Notice that I only said somewhat, since it’s still a little creepy how much she likes Daisuke.\\n\\n\r\nThe story is wonderfully told and occasionally heart wrenching, the events of Episode 6 even more so, and there’s hardly ever a lull, even in some of the fluffier episodes.\\n\\n\r\nThe only complaint that I have with KodoJikan is the censorship. In order to get the series aired, quite a lot had to be censored, through use of Rin kicking a giant ‘No’ symbol round and round and various animal noises. Strangely enough, some lewd things got through that were a little worse than what was censored. If at all possible, find it uncensored somewhere or read the manga to catch what you missed due to the irritating bird cheeps blocking things out.\\n\\n\r\nAesthetically, the series is functional. The art style doesn’t impress, though the opening and closing songs are amazingly catchy, especially the overly-energetic J-Pop number at the end, so we’ll call it a wash.\\n\\n\r\nOf course there’s objectionable content; it’d be weird if a show about a girl eager to sex up a teacher 15 years her senior didn’t have any. However, it’s done with a purpose. There’s plentiful fanservice, but it isn’t done just for the sake of doing it. I’m going to likely get odd looks for this, and I don’t blame you, but I actually believe the underage fanservice helps drive the point home at times in ways that it wouldn’t if fanservice were avoided. It’s a main element, but it’s an element crucial to developing the plot to its fullest.\\n\\n\r\nTo wrap things up, Kodomo no Jikan is a good series that elegantly makes the point that children have as many, if not more, complex emotional needs as adults do, and they need to be nurtured properly in order to grow up emotionally healthy. If you enjoy a show with a moral that isn’t beaten into your skull, even if it’s stated in a way that’s hard to bear at times, I couldn’t think of a better series to watch. It may just surprise you at the end by the depth and breadth of the matter covered.",
            "date": "2011-05-28T10:15:00+00:00",
            "helpful_count": 66,
            "mal_id": 37391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=37391"
        },
        {
            "content": "Kodomo no Jikan, where do I begin.\r\nAfter seeing this title pop up absolutely everywhere, outlining it's weird, disgusting, awkward and just extremely wrong storyline, i had to check it out. Rin Kokonoe is a 3rd grade elementary student, who forms mature (very mature) feelings for her 23 year old home room teacher, Sensei Aoki. The relationship between the two is quite hilarious, and just a little bit scary to put it lightly.\r\nAt first I was expecting this to be some weirdly perverted anime, made by a weird person, just for a lame excuse to create lolita porn type episodes, but boy was I wrong. Thestoryline is quite detailed, and very interesting. Kokonoe, without giving any spoilers, is lonely, and very misunderstood. She craves the attention of someone older, someone kind and someone who understands her, which turns her attention to Daisuke Aoki. Her attempts to seduce Daisuke are not even a bit subtle, writing inappropriate messages, sending flirty photos and continuously showing off her sexy lingerie. But it's not the perverted and disgusting anime people make it out to be. The stories behind every character are very interesting, making the relationships unique, and great to analyse and follow. \\n\\n\r\nOverall, i really enjoyed watching Kodomo no Jikan, it never failed to surprise me, and always gave me a good laugh.",
            "date": "2015-04-24T03:45:00+00:00",
            "helpful_count": 61,
            "mal_id": 186348,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bly_",
                "username": "bly_"
            },
            "url": "https://myanimelist.net/reviews.php?id=186348"
        },
        {
            "content": "Kodomo no Jikan is a hilarious and highly controversial anime however all the censorship, makes this less enjoyable to watch and it does make me wonder why certain TV networks decided to ban it. ^_^\r\nKodomo no Jikan (Child&rsquo;s Time) is a School, Ecchi, Romantic, Comedy about Daisuke Aoki, the new homeroom teacher to a 3rd Grade class at elementary. He is very inexperienced and proves to have a problem teacher however his biggest problem is a girl in his class Rin Kokonoe, how happens to have a crush on him. The story is surprisingly great for this kind of anime nevertheless it ends up followingthe usual trend by starting of happy and fun before getting too serious. There is plenty of drama but it never gets in the way of the fun nature of the show.\\n\\n\r\nEven though this anime may lack characters, all of the main characters are great; with their own personal traits, quirks and personalities. However it isn&rsquo;t the na&iuml;ve and thoughtless Daisuke Aoki that stands but in fact it is Rin Kokonoe. She is probably the most interesting &ldquo;loli&rdquo; character out there as she happens to be the main focus of the story, with plenty of revealing developments to be made on her alone.\\n\\n\r\nThe quality of the animation isn&rsquo;t amazing but is pretty good as it is able to show the cuteness of the girls and it could have proven been better, if it wasn&rsquo;t for the annoying censorship during ecchi moments. The music is pretty average and suits the show well however it suits it so well that it is barely noticeable.\\n\\n\r\nOverall Kodomo no Jikan managed to be an enjoyable school comedy, full of hilarious sexual innuendos however due to how controversial this show was, most of the really good jokes where b*****d out. Also another thing that proved annoying was how they censored anything remotely ecchi, by covering it with the &ldquo;no&rdquo; hiragana, taking away all the fun from this show. Other than that this was still a good anime with very well defined characters and with a good amount of developments from the story. This anime is good if you want a laugh yet it would better if an &ldquo;uncut&rdquo; version is released, then I may consider increasing my score.\\n\\n\r\n^_^\\n",
            "date": "2007-12-26T06:23:00+00:00",
            "helpful_count": 36,
            "mal_id": 1700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=1700"
        },
        {
            "content": "Well, of all things today I'm writing a review of Kodomo no Jikan. I thought I was going to be writing a review of Higurashi no Naku Koro ni next, but time changes moods it would appear.\r\nAnyway, Kodomo no Jikan is a show that has created a lot of buzz for it's content and I assume for mostly it's content is it popular or notorious. It is by far not a very unheard of anime and manga, but there are a few things I think are undersaid about this anime and manga, or since I have only seen this anime, and this is the animesection, the anime. So I'm writing this review. Not that I needed a justification for doing so.\\n\\n\r\nThis done one thing I have never seen done so much so in my life. And that is it's representation and extreme focus on child sexuality. This is what makes this show so notorious and so well known. It also in my opinion gives this show extreme artists merit. Well I have a lot more to say, and it's about time I leave my preface, but there will be a lot of such things in the coming review, as well as discussion of those so called undersaid things and misconceptions.\\n\\n\r\n1. Story\\n\r\nGoing by the book and numbered order again, I now discuss story. Though it feels like I left something out in my preface, it was already large. And hopefully I'll come across my thoughts again here.\\n\\n\r\nThis story is an emotional mess and better labeled a drama instead of a comedy for such. The student in said anime description above, is exactly as sounds. The situation is of a underaged girl, who harassingly hits on her teacher constantly, and due to his position, understands to keep it at a distance. For obvious reasons. So her attraction and unrequited love only leave for loads of tension in the supposedly comedic &quot;ecchi&quot; situations.\\n\\n\r\nAnd to stack on top of this constant paranoia and fear you feel for the teacher. There this loads of drama about the past of the students. Which only creates more drama for the unrequited love of the student given the constant misunderstanding of their relationship. I do hope that's not a spoiler, in my opinion it is not. And it was required to properly go into detail about the drama of this show.\\n\\n\r\nThese so called &quot;comedic&quot; situations, as I have mentioned before in quotes, have so much underlying drama it's hard to truly get any comedic value out of them. You might eek out a tense laugh at best from nervousness. But it's no laugh out loud comedy for sure. The one time I laughed at this show was hardly a situation between student and teacher, but teacher and teacher or student and student. The rest was extremely cringeworthy.\\n\\n\r\nAnd now to mention the ecchi, pretty much goes in line with the other things said. At best, these so called &quot;child ecchi&quot; situations are comedic but not very ecchi, and at worst, cringeworthy and pure remnants of drama. They're not meant to arouse you or make you fancy over the female human body like Moetan does, they're meant to shock you into some laughter hopefully, but fail to do so any mostly make you cringe for the whole situation. You feel sorry for the teacher the whole time, and even a little bit sorry for the student at the same time.\\n\\n\r\nThat being said, it's mislabeled but not bad. This is an amazing breakthrough in animation and revolutionary. This is a drama romance lolicon anime. And it takes a hardcore, hardline stance on child sexuality. It doesn't exactly have the most intricate or complicated story, but it's a groundbreaking drama that deserves it's merit it's been given. And it's notoriety.\\n\\n\r\nI can give this at the very least a Nine.\\n\\n\r\n2. Art.\\n\r\nI've said a lot of good things about the art of shows I've been reviewing lately. Well here's where I review a show with bad art. Okay maybe bad is too harsh of a word, but it's not so good. The art is dated, and is easily inferior to many of the animes during it's time and even before it's time. It's blocky, clunky, and not so pretty. And it's above average at best. They take traditional style, and they don't go anywhere with it. Don't watch this show expecting to see the most dazzling artwork you've ever seen.\\n\\n\r\n3. Sound\\n\r\nTo be honest, I didn't notice the sound all that much. Which is probably a pretty negative thing. The OP song is somewhat grabbing, the voices aren't lacking, and any music that I don't remember at this point, was probably pretty good. But there's nothing grabbing or spectacular about the music.\\n\\n\r\n4. Character\\n\r\nI think connected to the story, character development is one of the best parts of the show. I mean it IS the show. I mean I may not like the personality of all the characters, but they put the show forward. They easily make up for any character design and artwork with very vivid personalities. You'll love them, you'll hate them, but they'll make the show. If you're not watching the show for story and character development, well, then I don't know what you're watching the show for.\\n\\n\r\n5. Enjoyment.\\n\r\nI think overall it has it's flaws, and it's most entertaining gripping anime ever. But overall, it's darn worth the watch. It's a work of beauty and a true piece of art. You have to be in the mood to watch it because it doesn't have extreme fast pace, just like it looks like. And it's not a jack of all trades, it's a school romance drama with a couple very boring scenes. But my if it's not just the most fresh, thoughtful, controversial, and well paced enough anime that you just, I wasn't, able to get it out of my system.\\n\\n\r\nIt's an extremely ugly rock with a piece of uranium inside. But look past the dangers of uranium, and it's an absolutely essential, while dangerous and controversial thing. It is an utter gem in that light. And I think you'll just be drawn to it's highly radioactive uranium. I'd say this deserves a seven at least. I'm giving an eight.\\n\\n\r\n6. Overall.\\n\r\nI think overall, even the overall is better than the enjoyment in this case. Because with it's any flaws, it's a work of art. Of magnificent proportions. It is an extremely unique, extremely beautiful, absolutely essential piece of controversial art that I think everyone should see. And if it shocks you, maybe that's a good thing. And it should most certainly be licensed in your country and bought.\\n\\n\r\nWe treat A Modest Proposal as a classic piece of Western literature, to sensitize the rich to the plight of the poor. And Kodomo no Jikan is this anime for child sexuality. It will shock you of your cultural norm, and actually make you THINK about child sexuality.\\n\r\nYou may not think of it as a beautiful rock or gem. It's not. It's a piece of uranium. And now you can either let this energy go to waste, or use it.\\n\\n\r\nAn overall nine seems about perfect for this. And fits the mood I feel for it. I impulsively feel it's a nine. And that's what I will give it. And giving it thought, it seems no less as well. I will stick with my nine rating. And I hope you will give this anime a chance if you haven't thus far. It is worth your time, energy, and money.",
            "date": "2008-12-16T10:23:00+00:00",
            "helpful_count": 33,
            "mal_id": 10427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64644.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ukonkivi",
                "username": "ukonkivi"
            },
            "url": "https://myanimelist.net/reviews.php?id=10427"
        },
        {
            "content": "Now that the first season is over, a damage assessment is in order.  Look for criticisms in the usual places, the points against this series should be legion.  It's pointless loli-fanservice trash. It panders to pedophiles.  It's yet another retread of overly precocious kids whose dialogues are contrived by writers who have no least idea how normal kids would interact. And as a prominent blogger puts it, even if you thought the series wasn't half bad, the other half is censored.\r\nI won't sugarcoat or paper over the fact that the show revolves around a nine-year-old continuously making mature sexual advances against hertwenty-three-year-old teacher, some of which would be actionable by law even if she is of age. It is what it is.  I understand and respect the position of those of you who simply will not entertain that aspect of the show.  The boundaries that the show puts up that might give the brave viewer at least partial absolution in watching the show would be the fact that none of the adults neither make nor return any of the propositions, all the adults in the series have the kids' best interests at heart, and even if Rin were to encounter an adult that might pose a threat to her, she has shown time and again that she can stand up for herself and take them down.\\n\\n\r\nIt is the psychology behind the actions that brings me back to the series every week, despite the censorship and the remaining fanservice that serves to give the show notoriety.  Rin may be more sexually aware than a girl her age has any right to be, but when it comes to relating to adults, she is still like a kid who has just learned a new swearword: she simply doesn't know when it's  appropriate to put such knowledge to use and she seems to think that purience is the only way to win love.  And like a child, she can be easily hurt if she feels the love she gives is not reciprocated\\n\\n\r\nAs a result, Aoki Daisuke finds himself in a bind that he in part created for himself.  In his quest to become Great Teacher Aoki, he wants to be on friendly terms with his students and avoids antagonizing them unnecessarily.  But in closing the gap between the student-teacher relationship, he allowed Rin to get close enough so that if he unequivocally rejects her sexual overtures, he risks irrevocably hurting her.  Hurting her is not an option for Daisuke since he truly cares for her well-being, despite the daily discomfort she puts him through.  It also doesn't help that he has little to no experience in the practice of love which prevents him from adequately dealing with Rin's behavior.\\n\\n\r\nWatching the interactions between Rin and Daisuke and seeing their complexities of their relationship manifest themselves really carries the show.  However the show would have been stronger if some time were spent developing the side characters instead of using them as simple foils.  I would like to see more of why Mimi, Kuro and Rin need each other in their lives and more of what makes Shirai-sensei and Hoin-sensei tick.  Also I am disappointed in how they made Reiji into a dislikable character towards the end.  Also, the removal of the distracting censorship would help the series tremendously.\\n\\n\r\nThe technical aspects of the show were so-so.  If every episode were animated as brightly, as detailed, and as fluidly like the OVA, we would encounter little criticisms here.  But the way animation budgets are, we watch the series that we have, not the series that we wish.  The sound could be summarized by any of one of three backqrouund music: xylophones, a recorder, or a violin piece.  The OP and ED were standard J-pop fare that are not the least bit memorable.  All in all, the anime adaptation of the manga still passed the test and I would highly recommend the series.",
            "date": "2007-12-31T01:10:00+00:00",
            "helpful_count": 33,
            "mal_id": 1767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/27677.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kokujin-kun",
                "username": "Kokujin-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=1767"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nNow, let me start off this review by saying that I hate myself.  I guess that's why I chose to watch this in the first place.  I wasn't expecting much from this show, but I sure wasn't expecting it to be this AIDS-y.  \r\nI know this show is directed towards pedophiles, so I suppose that's why I didn't enjoy it.  But that aside, the writing was awful.  It's just a slutty toddler trying to fuck her teacher.  Romance is fine, but the teacher decided he 1. \"Loved\" this little girl, and 2. Decided he COULD \"love\"little girls, all in the second episode of the show.  Don't you think it would take a little longer than that?  Someone who never had the thought of being a kiddy fiddler just decided that his morals were wrong and that it's absolutely fine to love children that way?  I guess not.\\n\\n\r\nNow the weirder part of this, is that right after the episode where he said he \"loved\" her, he went right back to being a huge pussy.  That angered me.  Don't lie to a child and say you love them like that.  If you say that, you fuck that grade schooler, you fuck them good.\\n\\n\r\nAll of the episodes really just blended together in this huge pile of masturbatory material for men who enjoy the sausage wallets of young girls.  There was one episode that I saw which was actually not that bad.  It explained the past of the main loli, and there was incest, but it wasn't disgusting or anything.  Her mother ended up dying, and it was admittedly pretty sad.  It was cool to do that, but then it went back to the regular shit it was doing before.\\n\\n\r\nThe music was very ok.  I liked it enough, definitely the best part of the show, but it also wasn't anything mind blowing.  The Art was fine (I don't particularly care too much about that, just me), and then the story was pretty much non-existent.\\n\\n\r\nNow, I do recommend this show.  Only for two possible reasons though.  Either 1 - You're a pedophile and you like this sort of thing.\\n\r\nor 2 - You want to have a good laugh at a below average tv show.\\n\\n\r\nIn all seriousness, I enjoyed watching this, because it was really bad, and I'm a masochist.  This isn't anything ground breaking, and usually I'll say stay away from this show, but I don't really care what other people do.  If you enjoyed this, good for you, but this is just my opinion through the experiences that I've had.",
            "date": "2014-09-23T10:39:00+00:00",
            "helpful_count": 22,
            "mal_id": 161741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4119327.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TheGrassSaysMooo",
                "username": "TheGrassSaysMooo"
            },
            "url": "https://myanimelist.net/reviews.php?id=161741"
        },
        {
            "content": "I'll admit, when I first read what this show was about immediately started to underestimate it, belittle it, and was expected the worst show ever. However, when I completed it I found myself saying MORE MORE MORE! Absolutely amazing story although a bit cliche here and there. What I like most was that every time I thought something negative about the story or characters something intense or dramatic would happen that would shut me up lol. Now your main characters are three typical \"moe\" loli's \"Big eyes\" \"big hair\" etc who are supposed to be in grade school however when you watch it, their characteristics,personalities and behavior as show by the anime makes it a bit difficult to believe. Lastly, one (that teacher in every other anime) whose a loser and virgin and is easily annoyed etc. The relationship between the characters is what also makes the story so great! The art is your average late 2000's-2005 quality. Acceptable for its time. The character designs as I said before are \"big hair\" \"big eyes\" nothing that really stands out too much other than Rin's hair accessories that make her look like she got hit in the head and bumps came out. Overall I would highly recommend you check this series out there's OAD'S and OVA'S you can watch also if you want MORE! Finally thoughts, 8/10 show at best! nothing more nothing less.",
            "date": "2015-11-20T09:13:00+00:00",
            "helpful_count": 22,
            "mal_id": 203780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=203780"
        },
        {
            "content": "At first, i just tough this was an excuse for a VERY line-crossing Lolicon anime, even for japanese standarts.\r\nNow i've watched some episodes, i tend to think about it differently.\r\nI think this anime will be like for its genre, like school days was for romance.\r\nThey are daring, and prolly will manage to reach its goals because, they want to cause an uproar on how we see love, and the limits of it, and prolly some darker side we all hide underneath us.\r\nStudent <--> Teacher love?\r\nWe NOT talking about High school girl <--> Sensei\r\nWe talking 3rd primary grader <--> Sensei\r\nShe is a tomboy, but she loveshim? Find out in this anime that might have a very unlikely and very daring ending.",
            "date": "2007-11-01T13:18:00+00:00",
            "helpful_count": 18,
            "mal_id": 1189,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lang2004",
                "username": "lang2004"
            },
            "url": "https://myanimelist.net/reviews.php?id=1189"
        },
        {
            "content": "CONTAINS SPOILERS\r\nComplete pedophilia with a plot that isn't very interesting, and a slight hint of incest.\r\nIt's literally just a story about a third grader who wants to have sex with her 20 year old teacher and her making advances on him. It's disgusting and not even very entertaining. \r\nThere's also story about the person who takes care of her at home and he basically slept with a fellow family member and as a result the child was born. So there's the incest. Might explain why she is so messed up in the head\r\nWould recommend to people who are screwed up in the head",
            "date": "2016-06-28T11:55:00+00:00",
            "helpful_count": 14,
            "mal_id": 222266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5494148.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rasheedgames",
                "username": "Rasheedgames"
            },
            "url": "https://myanimelist.net/reviews.php?id=222266"
        },
        {
            "content": "My first review was about the notorious School Days, so it was obvious that my next review will be about another piece of junk... Well not really, I intended to make  Agame Ga Kill, but I was reading Horimiya, I took a brake and entered on MAL to check the original manga, and I dont know how, I found thise series at recomandation, and discovered that it has really great scoores: 8,9,10... WTF ?! So to save some pure souls from watching this series and maybe end up becoming lolicons (it can happen), I chose to leave Akame ga Kill for later and reviewthis  mediocre piece of shi... fan service...I must start by saying that I didnt finish the anime, I drop it after 3 episodes, then I read a little of manga, really fast between chapters, and spend a day reading summarys...Yep, I discovered that the manga was popular so because I am an M, I studied the story because my heart cant bear reading directly immoral stuffs or NTR. Just like I did with another series Cross and Roses, or something, about a beiach who is raped for 50 chapters, and she fall in love with the rapist... ah and she break up with the nice guy that loved her a lot to be with him - and i suffered for a week TT.TT...\\n\\n\r\nBack to our review... Kodomo no Jikan is a story about horny 7-11 years girls who tires to seduce their teacher. This would be the story on short. You have this little girl who develops a crush on her teacher, a pretty normal thing (I dont know about girls, but boys had, and I had a crush for a female teacher or 2)... so is something that every normal kid would do, the problem is that this girl unlike a normal child ends up trying to get his di_k, in other words to seduce him, and she even does stuffs like blackmailing... Is pretty difficult to talk about something else, because this is the story.... Sure many would say: ''Is more than this, is a deep and dramatic story... that has some ecchi moments.'' WRONG! KnJ is an ECCHI manga about the sexualization of childrens that has some dramatic elements too - not a dramatic story that has ecchi elements... Basically, the cheap and forced drama is put there just to make this series a little more acceptable. What is really shocking is that the mangaka is actually a woman - and that is the reason why Knj has some drama, this is why KnJ wasnt just an ecchi comedy for phedophiles... Even so that doesent really help, because the series - for commercial purpouse or because of the editor - was transformed in a ecchi shouen. This series would had been much much better, maybe even become a classic, if it was a Seinen, without ecchi elements (or at least they could had been done in a mature and realistic way, not as fan-service and comedy), the ideea wasnt 100% bad, but the way it was done is horrible (90% lolicon fan-service and 10% some good elements). So why is the story done bad ? Well, in an ecchi comedy, something like a scene of masturbation for example, becomes fan-service - you will have a 7-8 years old loli rubing her pu#@y watching porns, and in the real world the Faps will be strong. That is the difference between this and Seinen, this would be seen not as erotic but as something natural, and the sturggle of a growing child, etc (of course there are some who would fap even to cracked walls, but here i am talking about responsable peoples). \\n\r\n Lets talk a little about, CHARACTERS. You have the horny manipulative and too mature for her age (mentally, not phisically), 7-11 years old, (that because the story follows 4 years of their life) and has a dramatic story, a lesbian loli who has a bad mounth and knows what a virgin is at her age, a too well developed girl (she has oppai... now, the problem is that I live in Europe, here girls develop fast, my sister had really big boobs at 13, another sister that is 12 now, she start do develop her boobs pretty well too...  but they did it after the age of 11, and was seen as EARLY... I never, ever heard of a 7 years old with boobs - maybe only a sick one... Japnese womans are flat like a surf board, they look at 40 like Europeans at 16, so in an anime, a 7-10 years old gil with boobs, can only be seen as a fetish not reality), and the all known Male protagonist who is boring and shady like fuck, has nothing special and at 23+ is still a virgin... and a guy with a trauma. Basically the characters arent that bad, especially a 7 years girl who seem to be lesbian, in a more serious story, this would be interesting and dramatic, but is not the case here...\\n\r\n To keep this shorter, KnJ is a story made for phedophiles, for peoples with sick fetish about assertive little girls, who would be ready to trow in a sexual relationshp, and maybe even be experts. The difference is the protagonist, who try to keep the distance.. but in the end he falls in love with a 11 years old. And all the drama and shit wont change this fact, I see them as excuses. I actually find this offensive to great anime that got severe critics for having some 'bad'' elements... Like SAO for example (averge anime, but good example), where everyone said it suck because it had incest (- a girl in love with her cousin, who didnt feel the same. Nothing happened, he didnt sake the butty, but it was incest -_-), and on the other side anime like KissxSis or Oreimo, who are about incest are great and popular... or No Game No Life, who scared the shit of the anime fans, because of the sexualization of childrens (there where some panty shots of Shiro), it doesent matter the great plot, characters, world, artbehind the anime - there is child sexualization so it sucks, but an anime about the sexualization of childrens like this one, is great because has something deeper in it (well  Rin had something deep in her in the list chapter, so...), is just like how a 10 years girl in bikini licking a banana, is Art in U15 Japanese magazine for the middle age mans who buy them.. And Yeah, ATENTION SPOILER, in the end, in manga, Aoki fuck the children on her 16th birthday... you could say is acceptable, in parts of Japan the consent age is 13, so he didnt brake the law, and he waited for her to grow up and become more mature, he is not a phedophile.. well, here is the problem, in the 5 years in which they didnt meet (but they remained in love and loyal to each other by a miracle), she didnt grow at all, she still had the body of a 9 years old, so all the phedo.. fans, recived their expected fan service with Rin over Aoki trying to fit his Alpha Male mature di@K in her little undeveloped pu@#y... and yes, she was still flat chested.\\n\r\n This anime doesent bring anything extraordinary to the industry, is far from being a masterpiece, is far from being even average, is a dumb an ecchi comedy, that tries to bring some serious issues and drama, but it fails, because the mangaka chose the wrong genre. The comedy even trough a main genre, is dumb, you will actually laugh at how weak and average it is, the only comedy you will get will the the lesby loli calling the MC a virgin, pantsu and ecchi stuffs, and some dumb ''funny'' situation that are still erotic (like Rin sending the MC a photo of her pu@#y by mistake). The Romance is.... you have an 11 years girl who for some reason is able to wait 5 years to be with the one she love, be loyal and give him her virginity in the end, even trough at the age of 7 she was horny like a rabbit - and yet, at the age we all get horny, our little pervert is a good future waifu... and a 23-27 guy, who wait for his 11 years old love interest to grow up and lose his virginity at 32 with her (and is unable to get a damn woman in 5 years)... More importantly you have an 7-11 years old, who is able to chose the man with which she wants to spend the rest of her life, and is able to get over some difficulties to be with him =_=... I was mature and smart at her age, and yet I would fap on playboy magazines and I was in love with the most popular girl in my class, whose name I dont even remeber now... Drama, there is drama, but is really forced, sometimes too dark, and it really feels out of the story... is to serious fo the non-serious story. In 7 years I saw many anime (my anime list is far from complete, and there is no real category for incomplete anime), I think every anime has its magic, but Kodomo no Jikan is the first anime I trought it suck, right next to KissxSis (the series).\\n\\n\r\n If I recomand ? Well, you can watch this if you are someone who cant get a boner if the naked girl in front of him isnt under 12... You will most definetly enjoy, even if you arent a phedophile but you are a lolicon (boner for 2D girls under 13), you have here naked loli, masturbation, end even more at the final + tons of pantsu, so. You wont enjoy, if like me you are a normal human being with morality and normal sexual orientation (I mean towards a normal ages). \\n\r\n Finnal Score: 3.",
            "date": "2014-12-23T11:20:00+00:00",
            "helpful_count": 13,
            "mal_id": 173813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4328401.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/kronopy",
                "username": "kronopy"
            },
            "url": "https://myanimelist.net/reviews.php?id=173813"
        },
        {
            "content": "I'll be honest  here, Kodomo no Jikan is not the most normal animes I've ever seen but it is worthy of a review. Now this anime does takes sexual innuendo and pushes a lot and puts it onto a level of adult and child and even a little of incest in between which is where I found it to be somewhat weird.\r\nStory 2/10\r\nWhat can I say, this anime doesn't really have any major conflict or plot development. Its mostly just about the three girls: Kagami, Kokonoe and Usa harrassing there teacher Aoki ever day. When I said the sexual innuendo was present I meantit was coming from the children not the adult in question which just makes it even weirder than it already is.\\n\\n\r\nArt 7/10\\n\r\nIt was good and very realistic indeed. It wasn't too heavy and it usually fit itself into every situation. Can't really say whats holding it back but meh, it just seems generic though thats not to say that it was bad just generic.\\n\\n\r\nSound 8/10\\n\r\nMusic for intro and credits were very good to be honest. They fit into the anime but I didn't really felt moved by them after listening in  a couple of times through but damn that little rolling sound of their logo at the intro scares the shit out of me every time.\\n\\n\r\nCharacter 7/10\\n\r\nHmm the characters here are quite unusual. Our  three main girls are in the third grade but seem very affiliated with sexual slang and terms which I don't know means anything but it really bothered me. It makes me wonder, where did they even acquire such knowledge. However they were still somewhat of an enjoyable bunch of friends. Kokonoe is in love with the teacher Aoki and forces herself upon him with harrasment and even goes as far as kissing him on the lips its kind of disgusting but yet at the same time I found myself laughing at some of this stuff. It beats me but they did a really good job of modeling child-like shenanigans. Other than that the character development was present but I didn't really feel like it took off any until the final episode.\\n\\n\r\nOverall 6/10\\n\r\nKodomo no Jikan is one of those animes that sticks holes in your morals if you got any but I did find it enjoyable to say the least. At first glance I was actually not going to watch it when I thought most of the character relationships were going to be the other way around [man on child] but was relieved when it was a child's doing. Though I do feel like there is something missing in this anime. The story if any, just didn't feel fulfilling at all and everything I saw was kind of expected from the git go. If you wanna watch something a little different for once I totally recommend this for you but don't take any of this anime to heart.",
            "date": "2014-11-22T22:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 169573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4131017.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TheAfroNinja",
                "username": "TheAfroNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=169573"
        },
        {
            "content": "One of the things that can ultimately impede a show's commercial success is whether it really appears to be what it actually is. Case in point: Kodomo no Jikan. There are many people who perhaps glance at this anime, and maybe even check out the first episode, and come to the conclusion that it's a perverted lolicon series with no plot and all the depth and character of a spoon. See, this is where the ability to overlook fanservice, even if you aren't particularly attracted to it, is beneficial. In doing so, you'll push further and further into this series, and discover that it reallyisn't what it looks like.\\n\\n\r\nSo is it a shallow ecchi series? No. It is ecchi. It is loli. And it is also one of the most remarkably deep and moving dramas I've ever watched.\\n\\n\r\nIn terms of plot, it's pretty basic. But it was never a plot series. This is the kind of show where the characters are the real focus. And aside from a somewhat bland everyman protagonist, the characters are incredibly good. There are layers of depth to them that allow you to interpret their motivations and read beyond what they are saying. Is Rin, the female lead, really in love with her teacher? Or is she simply deprived for attention, and seeking recognition, whether it be good or bad, from one of the few adult figures in her life? These levels of depth exist in all of the characters, with the primary exception being one of the main lead's colleagues, who doesn't serve a huge purpose beyond aiding the development of Daisuke and Rin, and isn't particularly interesting at all. There are some great character moments (episode 6 being my highlight of the entire series) and, if you're into it, there is some lighter ecchi (which, admittedly, becomes a bit stronger in the disappointingly short second season).\\n\\n\r\nIn terms of art and animation, it's nothing special. The character designs are pretty good, but it certainly isn't the highpoint of the entire series. I can't say I have a lot to say about sound, other than the fact that it serves its purpose and doesn't put you off, which is a always good.\\n\\n\r\nI'll give a definite recommendation to this series, and suggest that those who question this series try and overcome your prejudices a little. Yes, there is fanservice, but it's not the driving force of the show. Think about it: by ignoring this show simply because it features a more controversial form of fanservice that you're prejudiced against, aren't you just depriving yourself access to one of the most fantastic drama anime ever?\\n\\n\r\nGod, this really isn't my best review.",
            "date": "2013-03-18T15:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 90099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1644981.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/smileyboyrocks",
                "username": "smileyboyrocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=90099"
        },
        {
            "content": "Ok, so to begin, there's a few things I must mention.\r\nFirst of all, probably like most of you, I began this series as a joke after seeing it on a list of most f***ed up anime, so I definitely wasn't expecting anything out of this.\r\nSecondly, this show, like most other reviewers said, takes advantage of shock comedy. This is definitely not for everyone, and if you don't like that, or are very timid of lolis, then I'm afraid this show is not for you.\r\nNow, let's begin the review.\r\nAt first glance, Kodomo no Jikan seems like a pedophile's anime; this is because of the ecchi scenesthe kids cause, and how the teacher fails to react appropriately to these situations, making him appear like a lolicon. This is understandable, because the first 5 episodes are basically that, just 3rd graders teasing a teacher and getting him into compromising situations. However, if you can bulldoze past that and watch the rest, you'll see it is so much more than that.\\n\\n\r\nKodomo no Jikan is actually an anime demonstrating two things: the psychological aspect of a child, and the inability for adults to understand children in the way they want to be understood. \\n\\n\r\nI know this sounds weird, but at about the 6th episode, you'll see what I'm talking about. What most people don't understand, is that children have a much different thought process compared to adults. Because adults don't understand this, they naturally conform the children to behave and act just like what the adults deem is right. However, this could not be more incorrect.\\n\\n\r\nChildren are very vulnerable to influence compared to adults, because they are just beginning to learn how the world works. The two main sources of influence tend to be their home environment, and their school environment. As newcomers to school, children are at their most creative - they are not limited by reality until later into school, usually middle school. The reason their imagination becomes limited is because adults don't understand how children think, and refuse to even attempt to do so; instead, they force them to conform to the rigid rules of society. \\n\\n\r\nAll of this is shown in this anime. The teacher (Aoki-sensei) is a brand new teacher, and therefore not accustomed to the way school works. Therefore, he has great ideas, unhindered by the school's rules. The foil of his character is depicted by Shirai-sensei, the typical old school strict teacher. She constantly belittles Aoki for his methods of teaching and handling his kids, and tries to force him into the traditional style of teaching.\\n\\n\r\nHowever, alongside this, he also has interactions with the three 3rd graders who make his life much more difficult. During these many interactions, the teacher Aoki misunderstands what the children are trying to tell him, because he views them as kids, as most adults do, and this is a problem in society. As we cast away children's thoughts as insignificant and worthless, we give them the mentality that they are insignificant and worthless, and this hurts a child so much. Luckily, our heroines are very defiant and try to fix this problem by trying to explain their thoughts to Aoki.\\n\\n\r\nAs \"relationship\" problems began to occur, we end up seeing Aoki finally grasp the meaning of what the children are trying to say, albeit after many tears have been shed from responses made without thinking. \\n\\n\r\nWe also see the fickle nature of children as they desperately attract attention, because children cannot be neglected – they need love at that time of their life more than any other time. Many of the people who watch this fail to see past the ecchi nature of the 3rd graders, and into their minds to see why they are doing this. This show does very well in mimicking the thought process of a child, and really opens your eyes to the world around us.  I cannot say more about this without spoilers, but just think about it deeper than what you simply see. \\n\\n\r\nThis ended up becoming much longer than what I had actually wanted, but I hope this convinces you to watch this great show. Please try to look past the cover, and focus on the inner meaning of this anime, as it does have a very good story. Thanks for reading.\\n",
            "date": "2015-12-14T09:44:00+00:00",
            "helpful_count": 7,
            "mal_id": 205526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437457.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DaAwesomePwner",
                "username": "DaAwesomePwner"
            },
            "url": "https://myanimelist.net/reviews.php?id=205526"
        },
        {
            "content": "I'm going to start out by saying that this series does NOT deserve the bad name it has.  Yes... it is incredibly controversial, yes... I am disgusted at how frustrated I am that there wasn't more fan service.\r\nLets go:\r\nStory: 7.   While the story is, on the surface, unique.  It is just another slice of life with a very unique twist.  There's a yandere and tsundere character.  One guy becomes the object of affection, the whole \"will they/won't they\" thing is replaced by \"should he/shouldn't he?\"  \r\nI think the reason I gave this show a 7 for story insteadof a higher score is because, while it does a good job of it, it doesn't really give you a sense of moral ambiguity which I was kind of looking for.  The whole, it is wrong but should it be, but it is, but why, and why not.  It doesn't do a very good job of asking the *big* questions related to the subject matter, overall though, the story is much deeper than you would assume.  No spoilers.\\n\r\nI laughed, I cried, and I got very confused in the pants.\\n\\n\r\nArt:  8\\n\r\nAbove average, better than a lot but nothing special.  Definitely not a 10.  The backgrounds are fully realized.  The outfits and clothing are well put together, the character designs are quite good,  the body fluidity and hair movements are quite life like.\\n\\n\r\nSound :9\\n\r\nI watched this as a blueray rip the sound quality was great.\\n\\n\r\nCharacter: 7\\n\r\nLike I said in my story section, this series is very similar to many others with a very very unique twist.\\n\r\nThat said,  the characters are fully realized,  they are not shallow or one dimensional.  Each character has a deep backstory and and the show does a good job of fleshing them out over 12 episodes.  \\n\r\nI enjoy that the motives behind the characters are left up to personal interpretation to a degree.  The show gives you the backstory to work with and you let your imagination fill in the blanks.  I would give this a higher score, honestly just for character development but it lost a few points for having standard tropes.  The tsundere character, the shy character and the boisterous to hide her insecurity character... the backstory made them unique and enjoyable but they are pretty standard.  \\n\\n\r\nEnjoyment: 6\\n\r\nThis.\\n\r\nShow.\\n\r\nWill.\\n\r\nTest.\\n\r\nYou.\\n\r\nYou know it's wrong to root for their relationship, you know it's wrong to get frustrated at Aoki for doing the \"right\" thing.  The characters are developed in a way that forces you to reconsider your stance, or at least... in this one case, compels you to make a moral exception.\\n\r\nI would have enjoyed this series much more if it didn't cast doubt on everything I knew to be right and proper.  Should a sexual relationship develop?  Fuck no.  Is intimacy with a 3rd grader and love possible?  Do they deserve it?  A character like Rin is so mature in so many ways and has been through so much that forced her to be beyond her years.  \\n\r\nThe whole series will challenge you... that's why it got a 6, even though I really really really enjoyed the series (including the short season 2 and the OVAs)  for that and that alone I scored my enjoyment quiet low.\\n\\n\r\nOverall: 8\\n\r\nIf you can get past the subject matter and enter this series with an open mind.  Do it.  It is an emotional roller-coaster that will blind side you with left turns, flips and corkscrews.",
            "date": "2015-12-14T14:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 205544,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5020720.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lothloran",
                "username": "Lothloran"
            },
            "url": "https://myanimelist.net/reviews.php?id=205544"
        },
        {
            "content": "It's safe to say that Kodomo No Jikan is not for those who are unable to see past what the show is perceived to be like, in other words if lolicon scares you, you shall not pass!\r\nBut i digress, i became more acquainted with the show as i watched, because at the start i too was prepared for the worst. However this anime with its brilliant character design, and very personal slice of life - type presentation surpassed my expectations. I kid you not, the show is teetering on a fine line of ethics, but over time i came to understand more about the backstory through the show's various information dumping and eventually came to find that the real theme behind this is tragedy. The bold way in which Kodomo No Jikan is presented may hinder people from noticing the connections it makes to many tragic and well narrated real life issues. Which is a shame because the story that you will be told should you decide to watch is a beautiful one.\\n\\n\r\nMoving away from the deep stuff though... The show can also be quite comedic, often this is in the form of seeing Daisuke being in awkward situations. And all in all, it is a fairly pleasant anime to watch all things considered.\\n\\n\r\nI'm not fully confident in my above generalization though, because there are so many aspects available for me to analyse and lead you to thinking something completely different, so you really must watch it if you want to pick up this unique story... The more i did so, the more i learned about the show, and my own open mindedness.\\n",
            "date": "2014-09-19T16:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 161059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=161059"
        },
        {
            "content": "Kodomo no Jikan was an anime that came to me out of nowhere. My friend suggested it to me as a joke due to the fact that there is somewhat of a needlessly large amount of ecchiness involved in the story. But the more I watched, the more I was engrossed in the actual plot of it all. \r\nThe love triangles and awkward situations that made certain things impossible to overcome by certain characters made it all that much more fascinating. Mimi being lonely without her friends and having a love interest in Reji. Kuro being a lesbian and having a love interest in Rinalong with looking up to the Shrew Shirai. And Rin herself, being the orphaned youngster who seemingly has an unrelenting and unbreakable love for Akoi. \\n\\n\r\nNot only the connections of the characters makes it interesting, the revelations, that the anime and the manga gives to us, upon their motivations for why they do what they do. I became slightly obsessed with all of it and read the entire manga within a few days wanting to know how it ended. \\n\\n\r\nSPOILER!!!!!!\\n\\n\r\nThe ending is the only problem that I have with everything. It basically states that Akoi was to embarrassed to ashamed to speak to Rin over the course of three years. But when they finally meet, they fuck...THEN END. \\n\\n\r\nGranted, it does show some really touching parts with Kuro and Shirai, and Mimi with Reji. But all three situations are left somewhat open. It never explained how Kuro overcame her jealousy of Akoi or her love for Rin, Mimi wasn't shown while confronting her mother for being to strict on her and deciding to live with Reji, and it didn't show the foreshadowing wedding of Akoi and Rin that was mention a few episodes before the ending. \\n\\n\r\nAll things that I wished to see were not there and I ended the story sad and incomplete. I just personally felt that the ending made the entire manga wasteful compared to everything. \\n\\n\r\nBut it is what it is and life must go on. If It had a better ending, it probably would have come close to the top of my favorite animes. But sadly it fell through at the end. :(\\n",
            "date": "2013-04-26T03:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 94975,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Batsmithpro",
                "username": "Batsmithpro"
            },
            "url": "https://myanimelist.net/reviews.php?id=94975"
        },
        {
            "content": "I guess you can say Kodomo no Jikan is defiantly something unique. Its not what you expect from the title, and not what you expect from pictures, small clips or AMVs you may have seen. In fact its probably all of that combined.\r\nOn first impression it seams kind of like lolicon, so basically a pervy anime with no back story at all. but the art is good, it begins in a humors way, and keeps you interested with nothing other but the introduction to a back story :D\r\nThe further along you go, the deeper you dig into the surprisingly difficult lives of Rin, Mimi, Kuroand Reiji, and how a barely experienced teacher can get through to them and learn a couple things himself.\\n\r\nI guess to even consider watching this anime you'd have to be lacking what i would probably call \"Anime Prude.\" and be willing to encounter not some, but a lot of pedo bear related things... that ultimately help build the story line as well.. and also i guess a romance, an awkward romance.. if you're into that stuff, like me. :)\\n\r\nKodomo no Jikan has some tragedy, comedy, ecchi, school life, romance/shojo (especially in its art) etc, it has something for almost everyone :)",
            "date": "2012-07-08T03:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 65665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/252506.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/eurekaloverenton",
                "username": "eurekaloverenton"
            },
            "url": "https://myanimelist.net/reviews.php?id=65665"
        }
    ],
    [
        {
            "content": "Kodomo no Jikan is a heavily controversial title, and with good reason. But like most controversial titles, its subject matter is not exploited in vain, and the end result is something that can be credited, at the very least, as a decent series in its own right.\r\nNo series has dared to tell the story KoJikan tells and gotten away with it, but for all the underage fanservice it provides, the heartwarming drama beneath the disturbing ecchi comedy ultimately shines. Had KoJikan been solely about the fanservice, this series would deserve all the negative criticism it has received, but there's a heavy dollop of character-driven dramaand unique relationships, the context of which have never been explored up until now. One of its more important plot aspects is the recognition of children as having the same emotional needs as the rest of us. It's a touchy subject, but handled with precision and never crossing the line, though toeing it on occasion. Though KoJikan still handles issues it brings up head-on, it does so in an abrupt and awkward presentation, constantly and abruptly switching between drama and comedy. It may flawed in its execution, but its heart is in the right place.\\n\\n\r\nLikewise, no series has dared to have characters like KoJikan's and gotten away with it. This is in great part to the main character being far more than she appears on the surface, especially when her laudably deep and complex emotions are explored. Unfortunately for most characters, they are relegated to often insulting cliche traits substitued as personalities, though this may change in future seasons. For now, the only real depth is in Rin and her cousin Reiji. However, the series should be commended on portraying 8-year-old girls with relative intelligence while acknowledging that they are still physically and mentally children. It's territory anime often skips in favor of taking the \"moe\" way out and its nice to see a series that portrays kids as kids.\\n\\n\r\nThe art is bright and cute, though the character designs are a little off-putting, especially Rin and Mimi's hair. Outside of this flaw, everything looks nice and neat. It's a slightly above-average job all around.\\n\\n\r\nThe music didn't stick to me but I don't remember it intruding in any way. The OP is one of my favorites, not for being a good song, but because the lyrics fit the tone of the series to a T. The ED is a hyperactive J-pop number that the audience this kind of show often attracts will enjoy greatly.\\n\\n\r\nFor me, KoJikan was a mixed bag. It is not anywhere near the horror that it was constantly advertised as prior to its release, nor is it entirely redeemable due to its abrupt swings between the drama and its uncomfortable brand of comedy. The end result is quite commendable though, assuming one watches this without a die-hard need to find as many disturbing details as they can.\\n\\n\r\nOverall, I give Kodomo no Jikan an 8 out of 10.",
            "date": "2008-10-25T20:33:00+00:00",
            "helpful_count": 256,
            "mal_id": 8960,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8731.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Splitter",
                "username": "Splitter"
            },
            "url": "https://myanimelist.net/reviews.php?id=8960"
        },
        {
            "content": "What can I say about this show that isn't absurd, offensive, or down right politically incorrect? As a forewarning to those who are offended by lolicon-esque (kids in ecchi situations) anime DO NOT WATCH THIS SHOW. \r\nWith that aside, for what its worth, the show minus the loli porn wouldn't be that bad BUT there are ALOT of things wrong with the show in the technical sense. From episode one, you can tell this is only worth watching if you got the DVD version (if there is such a thing). Alot of jokes don't get off the ground because they're bleeped out and i don'tthink i need to mention about the lolicon/comedy situations. I don't mind them censoring the scenes but at least leave the speech in tact. Having whole sentences at a time bleeped out, funny words or emotions replaced with a duck or a dog sound or even the fabled comedy car horn definitely kills most of the shows main ingredient, shock comedy. \\n\\n\r\nSo you get past how perverted a set of 3rd grade the girls are, how are their personalities? Well it seems like they borrowed a few character types from a few popular anime of previous airings. For instance Mimi is very moe and has large breasts especially for the age group she is supposed to be in. Kagamine Rin's other friend Kurogame pretty much Rin's polar opposite, very conservative, conceited, and mean. She is also in charge of pulling in the viewers that love the nekomimi girls (whereas Mimi pulls in the moe viewers). Lastly, Kagamine Rin can be easily labeled into the 'tsundere' fan base but her personality is more unique than what you normally see in an anime. She basically displays the oppositie traits from Kuro-chan most of the time but she does have her good moments and ecchi moments. Rin is a very unpredictable character that you will either learn to love, hate, or even both. Although they don't cover Kuro's or Mimi's background as much, you will come to know all about Rin and how she's become how she is today which is rather interesting. \\n\\n\r\nCharacter styles isn't the main draw for this anime in my opinion, but rather the artwork is very top notch. Not only is the animation is very clean and detailed. The girls get different (and detailed) outfits for every episode. Their eyes  in this show is some of the best eyes i have ever seen drawn in an anime. Not just because of their general size, but in detail and color variation. The classroom children ALL look different from each other, complete with different types of clothing and hair styles. There are so many variations in this show its hard not to notice the hard work the staff has put into this anime. Theres even a scene when the kids have their cellphones and DS's out and they all looked unique from each other. They even take use of distance blur to an effect which is impressive itself. If there was any blemish about the artwork of the show would be the lack of different scene locations. It was either at school or one of three different homes (the automatic beach episode doesn't count). Also, some people will not care for the hair at all. Their hair is a very hit and miss subject, and as for me, i couldn't care less after episode two. I cared vary little about the story or the ecchiness of the show but the main reason i watched this was simply because of how high quality the artwork is. \\n\\n\r\nThe story is easily forgettable but most of the time you'll pay more attention to what is going on at the moment than the overall story, all though the overall story wont kick in for a while.  But for the most part, you start to feel alot of things for Aoki-sensei. Sometimes you'll get mad at him, or wonder why he's so stupid, or how he can do something so reckless, or even wonder why he would bother to put himselves in certain situations. But for the most part you'll be worrying about him more than anything else. Also if you look past all the ecchiness, the three girls are really cute in their own way. And not because of their moe-ness but their voice acting is perfect and their range in emotions are spot on. Its hard to pick who my favorite seiyu would be out of the three because they are all that good of a seiyu. \\n\\n\r\nThat brings me to another great part of the show, sound and music. Elementary school sounds just like school with rowdy children. Even when theres scenes when the school halls are empty, you can hear the bustling of the over sized air conditioning unit. Basically what I'm trying to say is that the environmental sounds are pretty spot on. Its kinda sad that not most anime can't copy this much detail in environmental sounds as they do in here. It really brings out an anime from being a cut and paste low budget series. Even the music (mood or background) is very high quality. And the music varies in type as well, at times there would be techno and at times a comedy flute and also the suspenseful string quartet is even here. And since this is first and foremost a comedy anime, all the comedy bells and whistles are there, but not as much as you would expect. Lastly, the OP/ED songs are very catchy and energetic just like how the girls are. They fit the anime very well and its been a while since i actually appreciated a good OP and ED song from one anime. \\n\\n\r\nIt's a shame that so many things get censored out, specifically the audio. Also it didn't help that the fansub didn't bother to translate some on screen text. But thats not the anime's fault. So what do you get when you plan to air a non-TV friendly show on TV? You get a lost in translation TV show. Although it would make a hell of a lot more sense if the school in question was high school instead of elementary school but then it wouldn't appeal to the lolicons right? Not many anime appeal to the lolicons so im sure this was made as a niche anime to seize that market. Most shows with little girls are supposed to appeal to little girls (Ichigo Mashimaro, Moetan, etc, etc) but this one is so obviously blatant with its use of ecchi its ridiculous. It tests a fine line between serious drama and ecchi comedy that it actually works. If it didn't, why would there be a second season? It would definitely be more understandable if it was a direct to DVD instead of airing on TV.",
            "date": "2008-04-19T15:40:00+00:00",
            "helpful_count": 115,
            "mal_id": 4168,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4168"
        },
        {
            "content": "I went on a quest into the depths of Hell to find the worst anime of all time. I sampled the usual suspects like MD Geist and Kite, only to find myself wanting to find something more obscure and truly, unspeakably horrible. I didn't just want to find the punching bags that everyone already knows are terrible. I wasn't looking for the well known atrocity like the Plan 9 of anime, but for the Manos of anime. What I found, was so horrible that words can't even describe it. I have literally lost my faith in humanity. Turn back now if you have any semblanceof sanity that you value. For those of you already driven insane by the boundless depths of mankind's depravity...This is Kodomo no Jikan.\\n\\n\r\nThe following was my reaction to finding out this anime exists:\\n\\n\r\nThe madman jumped into their midst and pierced them with his eyes. \"Whither is God?\" he cried; \"I will tell you. We have killed him -- you and I. All of us are his murderers. But how did we do this? How could we drink up the sea? Who gave us the sponge to wipe away the entire horizon? What were we doing when we unchained this earth from its sun? Whither is it moving now? Whither are we moving? Away from all suns? Are we not plunging continually? Backward, sideward, forward, in all directions? Is there still any up or down? Are we not straying, as through an infinite nothing? Do we not feel the breath of empty space? Has it not become colder? Is not night continually closing in on us? Do we not need to light lanterns in the morning? Do we hear nothing as yet of the noise of the gravediggers who are burying God? Do we smell nothing as yet of the divine decomposition? Gods, too, decompose. God is dead. God remains dead. And we have killed him.\\n\\n\r\nThe \"plot\" is that a 3rd grade girl is hellbent on seducing her 25 year old teacher, which makes her cousin jealous, because he wants to bang her. This follows the pedophile assertion that \"pedophilia is caused by naughty children seducing weak, helpless adults\". Apparently the author of Kodomo ignored Nabokov's advice and took Humbert Humbert at his word. If there was justice, Nabokov would have to watch this pile of shit and suffer for the unholy genre he unleashed onto the world when he unintentionally became an icon and god to pedophiles everywhere. However, there is no justice! Why? Because this pedophile jerkoff series got 3 GOD DAMN SEASONS. Let me fucking repeat that for you, 3 GOD DAMN SEASONS!!! Most of the greatest anime ever created got 1 or 2 seasons. Spice and Wolf left us with most of the visual novel never to be adapted. This was what apparently deserved the animation funding that could have made a 3rd season of Spice and Wolf or 2nd season of Elfen Lied. We really needed more Kodomo.\\n\\n\r\nArt: 1/10\\n\\n\r\nThe drawing is decent, but when that drawing is used to graphically portray pedophilia in an erotic manner for the pleasure of the depraved...can it get higher than a 1?\\n\\n\r\nOverall: 1/10\\n\\n\r\nThis is the only anime I have ever seen where not only did I hate every second with every fiber of my being, I honestly questioned if every member of this production crew deserved to die. The producer, director, writers, artists, voice actors. Do any of them truly deserve to live after unleashing Kodomo on to the world? I'm not sure. I'm just not sure.",
            "date": "2014-09-19T23:26:00+00:00",
            "helpful_count": 113,
            "mal_id": 161117,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=161117"
        },
        {
            "content": "After being recommended by a friend, I decided to check out this series during a lull in my hectic anime watching schedule. I wish I could’ve come up with a better introduction, but I’m writing this in between clacking away in a race against time to finish a 4,000 word creative piece about a magical girl forced to defend a town in Ukraine from radioactive zombies by Monday. I would wait, but I have a feeling that if I did, these thoughts would just poof from my head and wouldn’t come back nearly as easily.\r\nKodomo no Jikan is a show that raises several interesting pointsthrough a superb blend of drama and comedy about the nature of children’s emotions, and how they tend to be rather hyperbolic in nature. As we all know, children don’t learn self constraint on their own. By age 8, which is the age of the main children in KodoJikan, emotional control hasn’t fully developed, and there are still tendencies toward feeling strongly one way or the other that can sometimes overlap into precocious infatuation.\\n\\n\r\nKodomo no Jikan is a show that follows Aoki Daisuke, a third grade teacher fresh out of college, eager to teach his new class. He has to deal with all the frustrations of fostering learning in elementary school students still in the prime stage of emotional growth: Complaints, balancing friendliness and strictness, spoiled brats… and a precocious girl with a Lolita Complex, named Kokonoe Rin, who lusts after him.\\n\\n\r\nYes, from that synopsis, you will likely gather that KodoJikan is an ecchi-fest of monumental proportions that will make lolicons the world over cheer in jubilation. However, before you write it off as nothing more than pointless fanservice, I’m going to take away your pen and smack you hypothetically for making presumptions based on that overly simple synopsis.\\n\\n\r\nYou’d be correct in assuming that this is heavy on the fanservice, but there’s an entirely different point to be made here: Not only does this series relish in the comedy of such an uncomfortable situation, but it does well at analyzing all the factors involved. And, happily enough, Daisuke doesn’t eventually fall for Rin. Not going to spoil anything here, but it ends on a very happy note, and Rin turns from a manipulative little succubus into a wholly sympathetic character with a tragic past, whose lust is somewhat justified.\\n\r\n Notice that I only said somewhat, since it’s still a little creepy how much she likes Daisuke.\\n\\n\r\nThe story is wonderfully told and occasionally heart wrenching, the events of Episode 6 even more so, and there’s hardly ever a lull, even in some of the fluffier episodes.\\n\\n\r\nThe only complaint that I have with KodoJikan is the censorship. In order to get the series aired, quite a lot had to be censored, through use of Rin kicking a giant ‘No’ symbol round and round and various animal noises. Strangely enough, some lewd things got through that were a little worse than what was censored. If at all possible, find it uncensored somewhere or read the manga to catch what you missed due to the irritating bird cheeps blocking things out.\\n\\n\r\nAesthetically, the series is functional. The art style doesn’t impress, though the opening and closing songs are amazingly catchy, especially the overly-energetic J-Pop number at the end, so we’ll call it a wash.\\n\\n\r\nOf course there’s objectionable content; it’d be weird if a show about a girl eager to sex up a teacher 15 years her senior didn’t have any. However, it’s done with a purpose. There’s plentiful fanservice, but it isn’t done just for the sake of doing it. I’m going to likely get odd looks for this, and I don’t blame you, but I actually believe the underage fanservice helps drive the point home at times in ways that it wouldn’t if fanservice were avoided. It’s a main element, but it’s an element crucial to developing the plot to its fullest.\\n\\n\r\nTo wrap things up, Kodomo no Jikan is a good series that elegantly makes the point that children have as many, if not more, complex emotional needs as adults do, and they need to be nurtured properly in order to grow up emotionally healthy. If you enjoy a show with a moral that isn’t beaten into your skull, even if it’s stated in a way that’s hard to bear at times, I couldn’t think of a better series to watch. It may just surprise you at the end by the depth and breadth of the matter covered.",
            "date": "2011-05-28T10:15:00+00:00",
            "helpful_count": 66,
            "mal_id": 37391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=37391"
        },
        {
            "content": "Kodomo no Jikan, where do I begin.\r\nAfter seeing this title pop up absolutely everywhere, outlining it's weird, disgusting, awkward and just extremely wrong storyline, i had to check it out. Rin Kokonoe is a 3rd grade elementary student, who forms mature (very mature) feelings for her 23 year old home room teacher, Sensei Aoki. The relationship between the two is quite hilarious, and just a little bit scary to put it lightly.\r\nAt first I was expecting this to be some weirdly perverted anime, made by a weird person, just for a lame excuse to create lolita porn type episodes, but boy was I wrong. Thestoryline is quite detailed, and very interesting. Kokonoe, without giving any spoilers, is lonely, and very misunderstood. She craves the attention of someone older, someone kind and someone who understands her, which turns her attention to Daisuke Aoki. Her attempts to seduce Daisuke are not even a bit subtle, writing inappropriate messages, sending flirty photos and continuously showing off her sexy lingerie. But it's not the perverted and disgusting anime people make it out to be. The stories behind every character are very interesting, making the relationships unique, and great to analyse and follow. \\n\\n\r\nOverall, i really enjoyed watching Kodomo no Jikan, it never failed to surprise me, and always gave me a good laugh.",
            "date": "2015-04-24T03:45:00+00:00",
            "helpful_count": 61,
            "mal_id": 186348,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bly_",
                "username": "bly_"
            },
            "url": "https://myanimelist.net/reviews.php?id=186348"
        },
        {
            "content": "Kodomo no Jikan is a hilarious and highly controversial anime however all the censorship, makes this less enjoyable to watch and it does make me wonder why certain TV networks decided to ban it. ^_^\r\nKodomo no Jikan (Child&rsquo;s Time) is a School, Ecchi, Romantic, Comedy about Daisuke Aoki, the new homeroom teacher to a 3rd Grade class at elementary. He is very inexperienced and proves to have a problem teacher however his biggest problem is a girl in his class Rin Kokonoe, how happens to have a crush on him. The story is surprisingly great for this kind of anime nevertheless it ends up followingthe usual trend by starting of happy and fun before getting too serious. There is plenty of drama but it never gets in the way of the fun nature of the show.\\n\\n\r\nEven though this anime may lack characters, all of the main characters are great; with their own personal traits, quirks and personalities. However it isn&rsquo;t the na&iuml;ve and thoughtless Daisuke Aoki that stands but in fact it is Rin Kokonoe. She is probably the most interesting &ldquo;loli&rdquo; character out there as she happens to be the main focus of the story, with plenty of revealing developments to be made on her alone.\\n\\n\r\nThe quality of the animation isn&rsquo;t amazing but is pretty good as it is able to show the cuteness of the girls and it could have proven been better, if it wasn&rsquo;t for the annoying censorship during ecchi moments. The music is pretty average and suits the show well however it suits it so well that it is barely noticeable.\\n\\n\r\nOverall Kodomo no Jikan managed to be an enjoyable school comedy, full of hilarious sexual innuendos however due to how controversial this show was, most of the really good jokes where b*****d out. Also another thing that proved annoying was how they censored anything remotely ecchi, by covering it with the &ldquo;no&rdquo; hiragana, taking away all the fun from this show. Other than that this was still a good anime with very well defined characters and with a good amount of developments from the story. This anime is good if you want a laugh yet it would better if an &ldquo;uncut&rdquo; version is released, then I may consider increasing my score.\\n\\n\r\n^_^\\n",
            "date": "2007-12-26T06:23:00+00:00",
            "helpful_count": 36,
            "mal_id": 1700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=1700"
        },
        {
            "content": "Well, of all things today I'm writing a review of Kodomo no Jikan. I thought I was going to be writing a review of Higurashi no Naku Koro ni next, but time changes moods it would appear.\r\nAnyway, Kodomo no Jikan is a show that has created a lot of buzz for it's content and I assume for mostly it's content is it popular or notorious. It is by far not a very unheard of anime and manga, but there are a few things I think are undersaid about this anime and manga, or since I have only seen this anime, and this is the animesection, the anime. So I'm writing this review. Not that I needed a justification for doing so.\\n\\n\r\nThis done one thing I have never seen done so much so in my life. And that is it's representation and extreme focus on child sexuality. This is what makes this show so notorious and so well known. It also in my opinion gives this show extreme artists merit. Well I have a lot more to say, and it's about time I leave my preface, but there will be a lot of such things in the coming review, as well as discussion of those so called undersaid things and misconceptions.\\n\\n\r\n1. Story\\n\r\nGoing by the book and numbered order again, I now discuss story. Though it feels like I left something out in my preface, it was already large. And hopefully I'll come across my thoughts again here.\\n\\n\r\nThis story is an emotional mess and better labeled a drama instead of a comedy for such. The student in said anime description above, is exactly as sounds. The situation is of a underaged girl, who harassingly hits on her teacher constantly, and due to his position, understands to keep it at a distance. For obvious reasons. So her attraction and unrequited love only leave for loads of tension in the supposedly comedic &quot;ecchi&quot; situations.\\n\\n\r\nAnd to stack on top of this constant paranoia and fear you feel for the teacher. There this loads of drama about the past of the students. Which only creates more drama for the unrequited love of the student given the constant misunderstanding of their relationship. I do hope that's not a spoiler, in my opinion it is not. And it was required to properly go into detail about the drama of this show.\\n\\n\r\nThese so called &quot;comedic&quot; situations, as I have mentioned before in quotes, have so much underlying drama it's hard to truly get any comedic value out of them. You might eek out a tense laugh at best from nervousness. But it's no laugh out loud comedy for sure. The one time I laughed at this show was hardly a situation between student and teacher, but teacher and teacher or student and student. The rest was extremely cringeworthy.\\n\\n\r\nAnd now to mention the ecchi, pretty much goes in line with the other things said. At best, these so called &quot;child ecchi&quot; situations are comedic but not very ecchi, and at worst, cringeworthy and pure remnants of drama. They're not meant to arouse you or make you fancy over the female human body like Moetan does, they're meant to shock you into some laughter hopefully, but fail to do so any mostly make you cringe for the whole situation. You feel sorry for the teacher the whole time, and even a little bit sorry for the student at the same time.\\n\\n\r\nThat being said, it's mislabeled but not bad. This is an amazing breakthrough in animation and revolutionary. This is a drama romance lolicon anime. And it takes a hardcore, hardline stance on child sexuality. It doesn't exactly have the most intricate or complicated story, but it's a groundbreaking drama that deserves it's merit it's been given. And it's notoriety.\\n\\n\r\nI can give this at the very least a Nine.\\n\\n\r\n2. Art.\\n\r\nI've said a lot of good things about the art of shows I've been reviewing lately. Well here's where I review a show with bad art. Okay maybe bad is too harsh of a word, but it's not so good. The art is dated, and is easily inferior to many of the animes during it's time and even before it's time. It's blocky, clunky, and not so pretty. And it's above average at best. They take traditional style, and they don't go anywhere with it. Don't watch this show expecting to see the most dazzling artwork you've ever seen.\\n\\n\r\n3. Sound\\n\r\nTo be honest, I didn't notice the sound all that much. Which is probably a pretty negative thing. The OP song is somewhat grabbing, the voices aren't lacking, and any music that I don't remember at this point, was probably pretty good. But there's nothing grabbing or spectacular about the music.\\n\\n\r\n4. Character\\n\r\nI think connected to the story, character development is one of the best parts of the show. I mean it IS the show. I mean I may not like the personality of all the characters, but they put the show forward. They easily make up for any character design and artwork with very vivid personalities. You'll love them, you'll hate them, but they'll make the show. If you're not watching the show for story and character development, well, then I don't know what you're watching the show for.\\n\\n\r\n5. Enjoyment.\\n\r\nI think overall it has it's flaws, and it's most entertaining gripping anime ever. But overall, it's darn worth the watch. It's a work of beauty and a true piece of art. You have to be in the mood to watch it because it doesn't have extreme fast pace, just like it looks like. And it's not a jack of all trades, it's a school romance drama with a couple very boring scenes. But my if it's not just the most fresh, thoughtful, controversial, and well paced enough anime that you just, I wasn't, able to get it out of my system.\\n\\n\r\nIt's an extremely ugly rock with a piece of uranium inside. But look past the dangers of uranium, and it's an absolutely essential, while dangerous and controversial thing. It is an utter gem in that light. And I think you'll just be drawn to it's highly radioactive uranium. I'd say this deserves a seven at least. I'm giving an eight.\\n\\n\r\n6. Overall.\\n\r\nI think overall, even the overall is better than the enjoyment in this case. Because with it's any flaws, it's a work of art. Of magnificent proportions. It is an extremely unique, extremely beautiful, absolutely essential piece of controversial art that I think everyone should see. And if it shocks you, maybe that's a good thing. And it should most certainly be licensed in your country and bought.\\n\\n\r\nWe treat A Modest Proposal as a classic piece of Western literature, to sensitize the rich to the plight of the poor. And Kodomo no Jikan is this anime for child sexuality. It will shock you of your cultural norm, and actually make you THINK about child sexuality.\\n\r\nYou may not think of it as a beautiful rock or gem. It's not. It's a piece of uranium. And now you can either let this energy go to waste, or use it.\\n\\n\r\nAn overall nine seems about perfect for this. And fits the mood I feel for it. I impulsively feel it's a nine. And that's what I will give it. And giving it thought, it seems no less as well. I will stick with my nine rating. And I hope you will give this anime a chance if you haven't thus far. It is worth your time, energy, and money.",
            "date": "2008-12-16T10:23:00+00:00",
            "helpful_count": 33,
            "mal_id": 10427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64644.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ukonkivi",
                "username": "ukonkivi"
            },
            "url": "https://myanimelist.net/reviews.php?id=10427"
        },
        {
            "content": "Now that the first season is over, a damage assessment is in order.  Look for criticisms in the usual places, the points against this series should be legion.  It's pointless loli-fanservice trash. It panders to pedophiles.  It's yet another retread of overly precocious kids whose dialogues are contrived by writers who have no least idea how normal kids would interact. And as a prominent blogger puts it, even if you thought the series wasn't half bad, the other half is censored.\r\nI won't sugarcoat or paper over the fact that the show revolves around a nine-year-old continuously making mature sexual advances against hertwenty-three-year-old teacher, some of which would be actionable by law even if she is of age. It is what it is.  I understand and respect the position of those of you who simply will not entertain that aspect of the show.  The boundaries that the show puts up that might give the brave viewer at least partial absolution in watching the show would be the fact that none of the adults neither make nor return any of the propositions, all the adults in the series have the kids' best interests at heart, and even if Rin were to encounter an adult that might pose a threat to her, she has shown time and again that she can stand up for herself and take them down.\\n\\n\r\nIt is the psychology behind the actions that brings me back to the series every week, despite the censorship and the remaining fanservice that serves to give the show notoriety.  Rin may be more sexually aware than a girl her age has any right to be, but when it comes to relating to adults, she is still like a kid who has just learned a new swearword: she simply doesn't know when it's  appropriate to put such knowledge to use and she seems to think that purience is the only way to win love.  And like a child, she can be easily hurt if she feels the love she gives is not reciprocated\\n\\n\r\nAs a result, Aoki Daisuke finds himself in a bind that he in part created for himself.  In his quest to become Great Teacher Aoki, he wants to be on friendly terms with his students and avoids antagonizing them unnecessarily.  But in closing the gap between the student-teacher relationship, he allowed Rin to get close enough so that if he unequivocally rejects her sexual overtures, he risks irrevocably hurting her.  Hurting her is not an option for Daisuke since he truly cares for her well-being, despite the daily discomfort she puts him through.  It also doesn't help that he has little to no experience in the practice of love which prevents him from adequately dealing with Rin's behavior.\\n\\n\r\nWatching the interactions between Rin and Daisuke and seeing their complexities of their relationship manifest themselves really carries the show.  However the show would have been stronger if some time were spent developing the side characters instead of using them as simple foils.  I would like to see more of why Mimi, Kuro and Rin need each other in their lives and more of what makes Shirai-sensei and Hoin-sensei tick.  Also I am disappointed in how they made Reiji into a dislikable character towards the end.  Also, the removal of the distracting censorship would help the series tremendously.\\n\\n\r\nThe technical aspects of the show were so-so.  If every episode were animated as brightly, as detailed, and as fluidly like the OVA, we would encounter little criticisms here.  But the way animation budgets are, we watch the series that we have, not the series that we wish.  The sound could be summarized by any of one of three backqrouund music: xylophones, a recorder, or a violin piece.  The OP and ED were standard J-pop fare that are not the least bit memorable.  All in all, the anime adaptation of the manga still passed the test and I would highly recommend the series.",
            "date": "2007-12-31T01:10:00+00:00",
            "helpful_count": 33,
            "mal_id": 1767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/27677.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kokujin-kun",
                "username": "Kokujin-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=1767"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nNow, let me start off this review by saying that I hate myself.  I guess that's why I chose to watch this in the first place.  I wasn't expecting much from this show, but I sure wasn't expecting it to be this AIDS-y.  \r\nI know this show is directed towards pedophiles, so I suppose that's why I didn't enjoy it.  But that aside, the writing was awful.  It's just a slutty toddler trying to fuck her teacher.  Romance is fine, but the teacher decided he 1. \"Loved\" this little girl, and 2. Decided he COULD \"love\"little girls, all in the second episode of the show.  Don't you think it would take a little longer than that?  Someone who never had the thought of being a kiddy fiddler just decided that his morals were wrong and that it's absolutely fine to love children that way?  I guess not.\\n\\n\r\nNow the weirder part of this, is that right after the episode where he said he \"loved\" her, he went right back to being a huge pussy.  That angered me.  Don't lie to a child and say you love them like that.  If you say that, you fuck that grade schooler, you fuck them good.\\n\\n\r\nAll of the episodes really just blended together in this huge pile of masturbatory material for men who enjoy the sausage wallets of young girls.  There was one episode that I saw which was actually not that bad.  It explained the past of the main loli, and there was incest, but it wasn't disgusting or anything.  Her mother ended up dying, and it was admittedly pretty sad.  It was cool to do that, but then it went back to the regular shit it was doing before.\\n\\n\r\nThe music was very ok.  I liked it enough, definitely the best part of the show, but it also wasn't anything mind blowing.  The Art was fine (I don't particularly care too much about that, just me), and then the story was pretty much non-existent.\\n\\n\r\nNow, I do recommend this show.  Only for two possible reasons though.  Either 1 - You're a pedophile and you like this sort of thing.\\n\r\nor 2 - You want to have a good laugh at a below average tv show.\\n\\n\r\nIn all seriousness, I enjoyed watching this, because it was really bad, and I'm a masochist.  This isn't anything ground breaking, and usually I'll say stay away from this show, but I don't really care what other people do.  If you enjoyed this, good for you, but this is just my opinion through the experiences that I've had.",
            "date": "2014-09-23T10:39:00+00:00",
            "helpful_count": 22,
            "mal_id": 161741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4119327.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TheGrassSaysMooo",
                "username": "TheGrassSaysMooo"
            },
            "url": "https://myanimelist.net/reviews.php?id=161741"
        },
        {
            "content": "I'll admit, when I first read what this show was about immediately started to underestimate it, belittle it, and was expected the worst show ever. However, when I completed it I found myself saying MORE MORE MORE! Absolutely amazing story although a bit cliche here and there. What I like most was that every time I thought something negative about the story or characters something intense or dramatic would happen that would shut me up lol. Now your main characters are three typical \"moe\" loli's \"Big eyes\" \"big hair\" etc who are supposed to be in grade school however when you watch it, their characteristics,personalities and behavior as show by the anime makes it a bit difficult to believe. Lastly, one (that teacher in every other anime) whose a loser and virgin and is easily annoyed etc. The relationship between the characters is what also makes the story so great! The art is your average late 2000's-2005 quality. Acceptable for its time. The character designs as I said before are \"big hair\" \"big eyes\" nothing that really stands out too much other than Rin's hair accessories that make her look like she got hit in the head and bumps came out. Overall I would highly recommend you check this series out there's OAD'S and OVA'S you can watch also if you want MORE! Finally thoughts, 8/10 show at best! nothing more nothing less.",
            "date": "2015-11-20T09:13:00+00:00",
            "helpful_count": 22,
            "mal_id": 203780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=203780"
        },
        {
            "content": "At first, i just tough this was an excuse for a VERY line-crossing Lolicon anime, even for japanese standarts.\r\nNow i've watched some episodes, i tend to think about it differently.\r\nI think this anime will be like for its genre, like school days was for romance.\r\nThey are daring, and prolly will manage to reach its goals because, they want to cause an uproar on how we see love, and the limits of it, and prolly some darker side we all hide underneath us.\r\nStudent <--> Teacher love?\r\nWe NOT talking about High school girl <--> Sensei\r\nWe talking 3rd primary grader <--> Sensei\r\nShe is a tomboy, but she loveshim? Find out in this anime that might have a very unlikely and very daring ending.",
            "date": "2007-11-01T13:18:00+00:00",
            "helpful_count": 18,
            "mal_id": 1189,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lang2004",
                "username": "lang2004"
            },
            "url": "https://myanimelist.net/reviews.php?id=1189"
        },
        {
            "content": "CONTAINS SPOILERS\r\nComplete pedophilia with a plot that isn't very interesting, and a slight hint of incest.\r\nIt's literally just a story about a third grader who wants to have sex with her 20 year old teacher and her making advances on him. It's disgusting and not even very entertaining. \r\nThere's also story about the person who takes care of her at home and he basically slept with a fellow family member and as a result the child was born. So there's the incest. Might explain why she is so messed up in the head\r\nWould recommend to people who are screwed up in the head",
            "date": "2016-06-28T11:55:00+00:00",
            "helpful_count": 14,
            "mal_id": 222266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5494148.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rasheedgames",
                "username": "Rasheedgames"
            },
            "url": "https://myanimelist.net/reviews.php?id=222266"
        },
        {
            "content": "My first review was about the notorious School Days, so it was obvious that my next review will be about another piece of junk... Well not really, I intended to make  Agame Ga Kill, but I was reading Horimiya, I took a brake and entered on MAL to check the original manga, and I dont know how, I found thise series at recomandation, and discovered that it has really great scoores: 8,9,10... WTF ?! So to save some pure souls from watching this series and maybe end up becoming lolicons (it can happen), I chose to leave Akame ga Kill for later and reviewthis  mediocre piece of shi... fan service...I must start by saying that I didnt finish the anime, I drop it after 3 episodes, then I read a little of manga, really fast between chapters, and spend a day reading summarys...Yep, I discovered that the manga was popular so because I am an M, I studied the story because my heart cant bear reading directly immoral stuffs or NTR. Just like I did with another series Cross and Roses, or something, about a beiach who is raped for 50 chapters, and she fall in love with the rapist... ah and she break up with the nice guy that loved her a lot to be with him - and i suffered for a week TT.TT...\\n\\n\r\nBack to our review... Kodomo no Jikan is a story about horny 7-11 years girls who tires to seduce their teacher. This would be the story on short. You have this little girl who develops a crush on her teacher, a pretty normal thing (I dont know about girls, but boys had, and I had a crush for a female teacher or 2)... so is something that every normal kid would do, the problem is that this girl unlike a normal child ends up trying to get his di_k, in other words to seduce him, and she even does stuffs like blackmailing... Is pretty difficult to talk about something else, because this is the story.... Sure many would say: ''Is more than this, is a deep and dramatic story... that has some ecchi moments.'' WRONG! KnJ is an ECCHI manga about the sexualization of childrens that has some dramatic elements too - not a dramatic story that has ecchi elements... Basically, the cheap and forced drama is put there just to make this series a little more acceptable. What is really shocking is that the mangaka is actually a woman - and that is the reason why Knj has some drama, this is why KnJ wasnt just an ecchi comedy for phedophiles... Even so that doesent really help, because the series - for commercial purpouse or because of the editor - was transformed in a ecchi shouen. This series would had been much much better, maybe even become a classic, if it was a Seinen, without ecchi elements (or at least they could had been done in a mature and realistic way, not as fan-service and comedy), the ideea wasnt 100% bad, but the way it was done is horrible (90% lolicon fan-service and 10% some good elements). So why is the story done bad ? Well, in an ecchi comedy, something like a scene of masturbation for example, becomes fan-service - you will have a 7-8 years old loli rubing her pu#@y watching porns, and in the real world the Faps will be strong. That is the difference between this and Seinen, this would be seen not as erotic but as something natural, and the sturggle of a growing child, etc (of course there are some who would fap even to cracked walls, but here i am talking about responsable peoples). \\n\r\n Lets talk a little about, CHARACTERS. You have the horny manipulative and too mature for her age (mentally, not phisically), 7-11 years old, (that because the story follows 4 years of their life) and has a dramatic story, a lesbian loli who has a bad mounth and knows what a virgin is at her age, a too well developed girl (she has oppai... now, the problem is that I live in Europe, here girls develop fast, my sister had really big boobs at 13, another sister that is 12 now, she start do develop her boobs pretty well too...  but they did it after the age of 11, and was seen as EARLY... I never, ever heard of a 7 years old with boobs - maybe only a sick one... Japnese womans are flat like a surf board, they look at 40 like Europeans at 16, so in an anime, a 7-10 years old gil with boobs, can only be seen as a fetish not reality), and the all known Male protagonist who is boring and shady like fuck, has nothing special and at 23+ is still a virgin... and a guy with a trauma. Basically the characters arent that bad, especially a 7 years girl who seem to be lesbian, in a more serious story, this would be interesting and dramatic, but is not the case here...\\n\r\n To keep this shorter, KnJ is a story made for phedophiles, for peoples with sick fetish about assertive little girls, who would be ready to trow in a sexual relationshp, and maybe even be experts. The difference is the protagonist, who try to keep the distance.. but in the end he falls in love with a 11 years old. And all the drama and shit wont change this fact, I see them as excuses. I actually find this offensive to great anime that got severe critics for having some 'bad'' elements... Like SAO for example (averge anime, but good example), where everyone said it suck because it had incest (- a girl in love with her cousin, who didnt feel the same. Nothing happened, he didnt sake the butty, but it was incest -_-), and on the other side anime like KissxSis or Oreimo, who are about incest are great and popular... or No Game No Life, who scared the shit of the anime fans, because of the sexualization of childrens (there where some panty shots of Shiro), it doesent matter the great plot, characters, world, artbehind the anime - there is child sexualization so it sucks, but an anime about the sexualization of childrens like this one, is great because has something deeper in it (well  Rin had something deep in her in the list chapter, so...), is just like how a 10 years girl in bikini licking a banana, is Art in U15 Japanese magazine for the middle age mans who buy them.. And Yeah, ATENTION SPOILER, in the end, in manga, Aoki fuck the children on her 16th birthday... you could say is acceptable, in parts of Japan the consent age is 13, so he didnt brake the law, and he waited for her to grow up and become more mature, he is not a phedophile.. well, here is the problem, in the 5 years in which they didnt meet (but they remained in love and loyal to each other by a miracle), she didnt grow at all, she still had the body of a 9 years old, so all the phedo.. fans, recived their expected fan service with Rin over Aoki trying to fit his Alpha Male mature di@K in her little undeveloped pu@#y... and yes, she was still flat chested.\\n\r\n This anime doesent bring anything extraordinary to the industry, is far from being a masterpiece, is far from being even average, is a dumb an ecchi comedy, that tries to bring some serious issues and drama, but it fails, because the mangaka chose the wrong genre. The comedy even trough a main genre, is dumb, you will actually laugh at how weak and average it is, the only comedy you will get will the the lesby loli calling the MC a virgin, pantsu and ecchi stuffs, and some dumb ''funny'' situation that are still erotic (like Rin sending the MC a photo of her pu@#y by mistake). The Romance is.... you have an 11 years girl who for some reason is able to wait 5 years to be with the one she love, be loyal and give him her virginity in the end, even trough at the age of 7 she was horny like a rabbit - and yet, at the age we all get horny, our little pervert is a good future waifu... and a 23-27 guy, who wait for his 11 years old love interest to grow up and lose his virginity at 32 with her (and is unable to get a damn woman in 5 years)... More importantly you have an 7-11 years old, who is able to chose the man with which she wants to spend the rest of her life, and is able to get over some difficulties to be with him =_=... I was mature and smart at her age, and yet I would fap on playboy magazines and I was in love with the most popular girl in my class, whose name I dont even remeber now... Drama, there is drama, but is really forced, sometimes too dark, and it really feels out of the story... is to serious fo the non-serious story. In 7 years I saw many anime (my anime list is far from complete, and there is no real category for incomplete anime), I think every anime has its magic, but Kodomo no Jikan is the first anime I trought it suck, right next to KissxSis (the series).\\n\\n\r\n If I recomand ? Well, you can watch this if you are someone who cant get a boner if the naked girl in front of him isnt under 12... You will most definetly enjoy, even if you arent a phedophile but you are a lolicon (boner for 2D girls under 13), you have here naked loli, masturbation, end even more at the final + tons of pantsu, so. You wont enjoy, if like me you are a normal human being with morality and normal sexual orientation (I mean towards a normal ages). \\n\r\n Finnal Score: 3.",
            "date": "2014-12-23T11:20:00+00:00",
            "helpful_count": 13,
            "mal_id": 173813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4328401.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/kronopy",
                "username": "kronopy"
            },
            "url": "https://myanimelist.net/reviews.php?id=173813"
        },
        {
            "content": "I'll be honest  here, Kodomo no Jikan is not the most normal animes I've ever seen but it is worthy of a review. Now this anime does takes sexual innuendo and pushes a lot and puts it onto a level of adult and child and even a little of incest in between which is where I found it to be somewhat weird.\r\nStory 2/10\r\nWhat can I say, this anime doesn't really have any major conflict or plot development. Its mostly just about the three girls: Kagami, Kokonoe and Usa harrassing there teacher Aoki ever day. When I said the sexual innuendo was present I meantit was coming from the children not the adult in question which just makes it even weirder than it already is.\\n\\n\r\nArt 7/10\\n\r\nIt was good and very realistic indeed. It wasn't too heavy and it usually fit itself into every situation. Can't really say whats holding it back but meh, it just seems generic though thats not to say that it was bad just generic.\\n\\n\r\nSound 8/10\\n\r\nMusic for intro and credits were very good to be honest. They fit into the anime but I didn't really felt moved by them after listening in  a couple of times through but damn that little rolling sound of their logo at the intro scares the shit out of me every time.\\n\\n\r\nCharacter 7/10\\n\r\nHmm the characters here are quite unusual. Our  three main girls are in the third grade but seem very affiliated with sexual slang and terms which I don't know means anything but it really bothered me. It makes me wonder, where did they even acquire such knowledge. However they were still somewhat of an enjoyable bunch of friends. Kokonoe is in love with the teacher Aoki and forces herself upon him with harrasment and even goes as far as kissing him on the lips its kind of disgusting but yet at the same time I found myself laughing at some of this stuff. It beats me but they did a really good job of modeling child-like shenanigans. Other than that the character development was present but I didn't really feel like it took off any until the final episode.\\n\\n\r\nOverall 6/10\\n\r\nKodomo no Jikan is one of those animes that sticks holes in your morals if you got any but I did find it enjoyable to say the least. At first glance I was actually not going to watch it when I thought most of the character relationships were going to be the other way around [man on child] but was relieved when it was a child's doing. Though I do feel like there is something missing in this anime. The story if any, just didn't feel fulfilling at all and everything I saw was kind of expected from the git go. If you wanna watch something a little different for once I totally recommend this for you but don't take any of this anime to heart.",
            "date": "2014-11-22T22:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 169573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4131017.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TheAfroNinja",
                "username": "TheAfroNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=169573"
        },
        {
            "content": "One of the things that can ultimately impede a show's commercial success is whether it really appears to be what it actually is. Case in point: Kodomo no Jikan. There are many people who perhaps glance at this anime, and maybe even check out the first episode, and come to the conclusion that it's a perverted lolicon series with no plot and all the depth and character of a spoon. See, this is where the ability to overlook fanservice, even if you aren't particularly attracted to it, is beneficial. In doing so, you'll push further and further into this series, and discover that it reallyisn't what it looks like.\\n\\n\r\nSo is it a shallow ecchi series? No. It is ecchi. It is loli. And it is also one of the most remarkably deep and moving dramas I've ever watched.\\n\\n\r\nIn terms of plot, it's pretty basic. But it was never a plot series. This is the kind of show where the characters are the real focus. And aside from a somewhat bland everyman protagonist, the characters are incredibly good. There are layers of depth to them that allow you to interpret their motivations and read beyond what they are saying. Is Rin, the female lead, really in love with her teacher? Or is she simply deprived for attention, and seeking recognition, whether it be good or bad, from one of the few adult figures in her life? These levels of depth exist in all of the characters, with the primary exception being one of the main lead's colleagues, who doesn't serve a huge purpose beyond aiding the development of Daisuke and Rin, and isn't particularly interesting at all. There are some great character moments (episode 6 being my highlight of the entire series) and, if you're into it, there is some lighter ecchi (which, admittedly, becomes a bit stronger in the disappointingly short second season).\\n\\n\r\nIn terms of art and animation, it's nothing special. The character designs are pretty good, but it certainly isn't the highpoint of the entire series. I can't say I have a lot to say about sound, other than the fact that it serves its purpose and doesn't put you off, which is a always good.\\n\\n\r\nI'll give a definite recommendation to this series, and suggest that those who question this series try and overcome your prejudices a little. Yes, there is fanservice, but it's not the driving force of the show. Think about it: by ignoring this show simply because it features a more controversial form of fanservice that you're prejudiced against, aren't you just depriving yourself access to one of the most fantastic drama anime ever?\\n\\n\r\nGod, this really isn't my best review.",
            "date": "2013-03-18T15:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 90099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1644981.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/smileyboyrocks",
                "username": "smileyboyrocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=90099"
        },
        {
            "content": "Ok, so to begin, there's a few things I must mention.\r\nFirst of all, probably like most of you, I began this series as a joke after seeing it on a list of most f***ed up anime, so I definitely wasn't expecting anything out of this.\r\nSecondly, this show, like most other reviewers said, takes advantage of shock comedy. This is definitely not for everyone, and if you don't like that, or are very timid of lolis, then I'm afraid this show is not for you.\r\nNow, let's begin the review.\r\nAt first glance, Kodomo no Jikan seems like a pedophile's anime; this is because of the ecchi scenesthe kids cause, and how the teacher fails to react appropriately to these situations, making him appear like a lolicon. This is understandable, because the first 5 episodes are basically that, just 3rd graders teasing a teacher and getting him into compromising situations. However, if you can bulldoze past that and watch the rest, you'll see it is so much more than that.\\n\\n\r\nKodomo no Jikan is actually an anime demonstrating two things: the psychological aspect of a child, and the inability for adults to understand children in the way they want to be understood. \\n\\n\r\nI know this sounds weird, but at about the 6th episode, you'll see what I'm talking about. What most people don't understand, is that children have a much different thought process compared to adults. Because adults don't understand this, they naturally conform the children to behave and act just like what the adults deem is right. However, this could not be more incorrect.\\n\\n\r\nChildren are very vulnerable to influence compared to adults, because they are just beginning to learn how the world works. The two main sources of influence tend to be their home environment, and their school environment. As newcomers to school, children are at their most creative - they are not limited by reality until later into school, usually middle school. The reason their imagination becomes limited is because adults don't understand how children think, and refuse to even attempt to do so; instead, they force them to conform to the rigid rules of society. \\n\\n\r\nAll of this is shown in this anime. The teacher (Aoki-sensei) is a brand new teacher, and therefore not accustomed to the way school works. Therefore, he has great ideas, unhindered by the school's rules. The foil of his character is depicted by Shirai-sensei, the typical old school strict teacher. She constantly belittles Aoki for his methods of teaching and handling his kids, and tries to force him into the traditional style of teaching.\\n\\n\r\nHowever, alongside this, he also has interactions with the three 3rd graders who make his life much more difficult. During these many interactions, the teacher Aoki misunderstands what the children are trying to tell him, because he views them as kids, as most adults do, and this is a problem in society. As we cast away children's thoughts as insignificant and worthless, we give them the mentality that they are insignificant and worthless, and this hurts a child so much. Luckily, our heroines are very defiant and try to fix this problem by trying to explain their thoughts to Aoki.\\n\\n\r\nAs \"relationship\" problems began to occur, we end up seeing Aoki finally grasp the meaning of what the children are trying to say, albeit after many tears have been shed from responses made without thinking. \\n\\n\r\nWe also see the fickle nature of children as they desperately attract attention, because children cannot be neglected – they need love at that time of their life more than any other time. Many of the people who watch this fail to see past the ecchi nature of the 3rd graders, and into their minds to see why they are doing this. This show does very well in mimicking the thought process of a child, and really opens your eyes to the world around us.  I cannot say more about this without spoilers, but just think about it deeper than what you simply see. \\n\\n\r\nThis ended up becoming much longer than what I had actually wanted, but I hope this convinces you to watch this great show. Please try to look past the cover, and focus on the inner meaning of this anime, as it does have a very good story. Thanks for reading.\\n",
            "date": "2015-12-14T09:44:00+00:00",
            "helpful_count": 7,
            "mal_id": 205526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437457.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DaAwesomePwner",
                "username": "DaAwesomePwner"
            },
            "url": "https://myanimelist.net/reviews.php?id=205526"
        },
        {
            "content": "I'm going to start out by saying that this series does NOT deserve the bad name it has.  Yes... it is incredibly controversial, yes... I am disgusted at how frustrated I am that there wasn't more fan service.\r\nLets go:\r\nStory: 7.   While the story is, on the surface, unique.  It is just another slice of life with a very unique twist.  There's a yandere and tsundere character.  One guy becomes the object of affection, the whole \"will they/won't they\" thing is replaced by \"should he/shouldn't he?\"  \r\nI think the reason I gave this show a 7 for story insteadof a higher score is because, while it does a good job of it, it doesn't really give you a sense of moral ambiguity which I was kind of looking for.  The whole, it is wrong but should it be, but it is, but why, and why not.  It doesn't do a very good job of asking the *big* questions related to the subject matter, overall though, the story is much deeper than you would assume.  No spoilers.\\n\r\nI laughed, I cried, and I got very confused in the pants.\\n\\n\r\nArt:  8\\n\r\nAbove average, better than a lot but nothing special.  Definitely not a 10.  The backgrounds are fully realized.  The outfits and clothing are well put together, the character designs are quite good,  the body fluidity and hair movements are quite life like.\\n\\n\r\nSound :9\\n\r\nI watched this as a blueray rip the sound quality was great.\\n\\n\r\nCharacter: 7\\n\r\nLike I said in my story section, this series is very similar to many others with a very very unique twist.\\n\r\nThat said,  the characters are fully realized,  they are not shallow or one dimensional.  Each character has a deep backstory and and the show does a good job of fleshing them out over 12 episodes.  \\n\r\nI enjoy that the motives behind the characters are left up to personal interpretation to a degree.  The show gives you the backstory to work with and you let your imagination fill in the blanks.  I would give this a higher score, honestly just for character development but it lost a few points for having standard tropes.  The tsundere character, the shy character and the boisterous to hide her insecurity character... the backstory made them unique and enjoyable but they are pretty standard.  \\n\\n\r\nEnjoyment: 6\\n\r\nThis.\\n\r\nShow.\\n\r\nWill.\\n\r\nTest.\\n\r\nYou.\\n\r\nYou know it's wrong to root for their relationship, you know it's wrong to get frustrated at Aoki for doing the \"right\" thing.  The characters are developed in a way that forces you to reconsider your stance, or at least... in this one case, compels you to make a moral exception.\\n\r\nI would have enjoyed this series much more if it didn't cast doubt on everything I knew to be right and proper.  Should a sexual relationship develop?  Fuck no.  Is intimacy with a 3rd grader and love possible?  Do they deserve it?  A character like Rin is so mature in so many ways and has been through so much that forced her to be beyond her years.  \\n\r\nThe whole series will challenge you... that's why it got a 6, even though I really really really enjoyed the series (including the short season 2 and the OVAs)  for that and that alone I scored my enjoyment quiet low.\\n\\n\r\nOverall: 8\\n\r\nIf you can get past the subject matter and enter this series with an open mind.  Do it.  It is an emotional roller-coaster that will blind side you with left turns, flips and corkscrews.",
            "date": "2015-12-14T14:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 205544,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5020720.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lothloran",
                "username": "Lothloran"
            },
            "url": "https://myanimelist.net/reviews.php?id=205544"
        },
        {
            "content": "It's safe to say that Kodomo No Jikan is not for those who are unable to see past what the show is perceived to be like, in other words if lolicon scares you, you shall not pass!\r\nBut i digress, i became more acquainted with the show as i watched, because at the start i too was prepared for the worst. However this anime with its brilliant character design, and very personal slice of life - type presentation surpassed my expectations. I kid you not, the show is teetering on a fine line of ethics, but over time i came to understand more about the backstory through the show's various information dumping and eventually came to find that the real theme behind this is tragedy. The bold way in which Kodomo No Jikan is presented may hinder people from noticing the connections it makes to many tragic and well narrated real life issues. Which is a shame because the story that you will be told should you decide to watch is a beautiful one.\\n\\n\r\nMoving away from the deep stuff though... The show can also be quite comedic, often this is in the form of seeing Daisuke being in awkward situations. And all in all, it is a fairly pleasant anime to watch all things considered.\\n\\n\r\nI'm not fully confident in my above generalization though, because there are so many aspects available for me to analyse and lead you to thinking something completely different, so you really must watch it if you want to pick up this unique story... The more i did so, the more i learned about the show, and my own open mindedness.\\n",
            "date": "2014-09-19T16:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 161059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=161059"
        },
        {
            "content": "Kodomo no Jikan was an anime that came to me out of nowhere. My friend suggested it to me as a joke due to the fact that there is somewhat of a needlessly large amount of ecchiness involved in the story. But the more I watched, the more I was engrossed in the actual plot of it all. \r\nThe love triangles and awkward situations that made certain things impossible to overcome by certain characters made it all that much more fascinating. Mimi being lonely without her friends and having a love interest in Reji. Kuro being a lesbian and having a love interest in Rinalong with looking up to the Shrew Shirai. And Rin herself, being the orphaned youngster who seemingly has an unrelenting and unbreakable love for Akoi. \\n\\n\r\nNot only the connections of the characters makes it interesting, the revelations, that the anime and the manga gives to us, upon their motivations for why they do what they do. I became slightly obsessed with all of it and read the entire manga within a few days wanting to know how it ended. \\n\\n\r\nSPOILER!!!!!!\\n\\n\r\nThe ending is the only problem that I have with everything. It basically states that Akoi was to embarrassed to ashamed to speak to Rin over the course of three years. But when they finally meet, they fuck...THEN END. \\n\\n\r\nGranted, it does show some really touching parts with Kuro and Shirai, and Mimi with Reji. But all three situations are left somewhat open. It never explained how Kuro overcame her jealousy of Akoi or her love for Rin, Mimi wasn't shown while confronting her mother for being to strict on her and deciding to live with Reji, and it didn't show the foreshadowing wedding of Akoi and Rin that was mention a few episodes before the ending. \\n\\n\r\nAll things that I wished to see were not there and I ended the story sad and incomplete. I just personally felt that the ending made the entire manga wasteful compared to everything. \\n\\n\r\nBut it is what it is and life must go on. If It had a better ending, it probably would have come close to the top of my favorite animes. But sadly it fell through at the end. :(\\n",
            "date": "2013-04-26T03:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 94975,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Batsmithpro",
                "username": "Batsmithpro"
            },
            "url": "https://myanimelist.net/reviews.php?id=94975"
        },
        {
            "content": "I guess you can say Kodomo no Jikan is defiantly something unique. Its not what you expect from the title, and not what you expect from pictures, small clips or AMVs you may have seen. In fact its probably all of that combined.\r\nOn first impression it seams kind of like lolicon, so basically a pervy anime with no back story at all. but the art is good, it begins in a humors way, and keeps you interested with nothing other but the introduction to a back story :D\r\nThe further along you go, the deeper you dig into the surprisingly difficult lives of Rin, Mimi, Kuroand Reiji, and how a barely experienced teacher can get through to them and learn a couple things himself.\\n\r\nI guess to even consider watching this anime you'd have to be lacking what i would probably call \"Anime Prude.\" and be willing to encounter not some, but a lot of pedo bear related things... that ultimately help build the story line as well.. and also i guess a romance, an awkward romance.. if you're into that stuff, like me. :)\\n\r\nKodomo no Jikan has some tragedy, comedy, ecchi, school life, romance/shojo (especially in its art) etc, it has something for almost everyone :)",
            "date": "2012-07-08T03:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 65665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/252506.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/eurekaloverenton",
                "username": "eurekaloverenton"
            },
            "url": "https://myanimelist.net/reviews.php?id=65665"
        }
    ],
    [
        {
            "content": "I actually felt like I NEEDED to write a review about this because I really got changed and supreised with this anime.\r\nKnJ, when I heard of it, and watched some \"Out-of-context\" Videos, I just thought:\r\n\"Hey, another lolicon anime filled with tons of fan-service. Another example of how disgusting people can be\"\r\n   Honestly, I kinda have a prejudice against Ecchi Stuff. Because it's most of the times, usless and annoying. If I wanna see boobies and titties, I might aswell watch a hentai. \r\nThe exception is when the Anime has something far more interesting to offer, besides the fan-service, and boy,I gotta admit, Kodomo No Jikan is one of this exceptions.\\n\\n\r\nKodomo No Jikan is a funny anime to watch. It has a pretty cool art-style, comedy and interesting characters and plot.\\n\r\nIf you are a person that can turn a blind eye to all the the ecchi even if you don't like it, and focus on what the anime has to offer besides it, you will see that it will be really worth watching it.\\n\\n\r\nI started watching it because... I actually don't know for sure.\\n\r\nEven don't liking Ecchi, the humor kinda sounded cool, and I thought:\\n\r\n\"Well, Why not?\"\\n\\n\r\nI started watching for Fun in the \"fuck it\" mode, but as I watched more episodes, I got involved with the plot and it ended as somethign I never thought it would be.\\n\\n\r\nThe final answer is: Kodomo No Jikan is really not what it seems like\\n\r\n. It IS worth watching if you like some adult-like story. It can be either Fun and Dark at the same time, and that's amazing.\\n\r\nAnd Since the anime doesn't end the story, I suggest you to read the Manga after it, in case you liked the plot, as I did.\\n\r\nIt is worth.",
            "date": "2017-09-02T12:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 256737,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5635842.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DkClaude",
                "username": "DkClaude"
            },
            "url": "https://myanimelist.net/reviews.php?id=256737"
        },
        {
            "content": "I must say that this anime has all the characteristics to be promptly sent in the department \"souls who will never see,\" I hate the ecchi and lolicon stories and these are usually cataloged as I avoid like a contagious disease, but there is a but ...\r\nThe story is a mixture of \"ecchi\" and \"lolicon\" as the rest of his class, anything, I was really taken by the hidden meaning that the soul hides.\r\nIt makes you realize that children are human beings weak and brittle and must be defended, but nevertheless they, with their peers, are able to create deep and lasting legal, which ultimatelyadults can no longer do, meaning is profound and should be examined, puts the fragility of a human being, which in this case is represented by a girl, against all the world and the problems it can create, but in his own way to understand that not everything can always go wrong and that we should not be discouraged.\\n\r\nAdmit I jumped and looked the part against his romantic just for the reasons mentioned above but have been affected by strong emotions, especially the story of Rei and Rin, there really was upset because unfortunately there are difficulties such as these exist and seeks to address this anime all hiding under a vein of a screwball romance.\\n\\n\r\nThe designs ... I must say that the drawings are monstrous, hate the moe genre (you too) but I really liked how they were cared for many details, such as clothing kuro or landscapes, especially the part of the fireworks. For the character, unfortunately I can not be so excited as hair style and absurd super eyes, but we gladly pass on.\\n\\n\\n\r\nThe acronyms I can not comment having seen the anime through fansubs \"TCJ\" who cut opening and Eding.\\n\\n\\n\r\nThe rest is a really cute anime if you can amuse over the vein of lolicon and we focus on the issues that it offers us and reasoning.",
            "date": "2012-04-23T07:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 59471,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266759.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 0,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rera",
                "username": "Rera"
            },
            "url": "https://myanimelist.net/reviews.php?id=59471"
        },
        {
            "content": "Story:\r\nHonestly, a lot better than I expected. While it totally wasn't my thing, at first, I enjoyed the transition into a more serious story. It becomes a little too serious for itself in the end, but still, I was attentive and that's all that matters.\r\nThe narrative is strictly about Aoki and Rin as the two are definitely the more fleshed out characters. It dabbles a little into Reiji's history (who is Rin's older brother) but it still remains primarily about the strange relationship that Aoki and Rin have.\r\nWhile aggressive and offensive, the story finds a good balance between unnecessary fanservice and compelling storytelling. Aoki's stressover being a young teacher while also having to deal with very confused students, Rin and her posse, makes for a relatable story arc of someone who is new to their job and at risk of losing it. Of course, the show takes liberties to use this for fanservice, but it still balances a way to make it a very serious risk and something that isn't necessarily glorified.\\n\\n\r\nRin's arc is also quite interesting as we get to watch someone who at first seems unrealistically sexually frustrated but is merely misplacing the love she feels for a parental figure with the sort of intimate love you show one's partner. While it's definitely abused for the sake of fanservice, I found it to be a very interesting watch despite that fact.\\n\\n\r\nSince the show is mostly episodic, the narrative finds itself to be boring and stunted. Like most shows like this, the last 3 or so episodes find themselves following their own closed arc. That's when things get a little ridiculous, and the tone changes to one that probably would have made the story much more believable and compelling. The error is that these two tones - the one from the beginning and the one from the end - do not compliment each other. It's like watching two different stories unfold.\\n\\n\\n\r\nArt:\\n\r\nEveryone looks like they are a stage back on the evolutionary scale. This may be close to the original character designs, but it's stupid and I can't help but laugh every time I become conscious of it.\\n\\n\r\nThe show mostly takes place in a school. At this point, I shouldn't have to explain why this is a negative. It's boring, uninspiring, and there's very little you can do when setting up decent scenes when everything under the sun has been used in a school setting at this point.\\n\\n\r\nWhen there are scenes not in the school, they're devoid of life and of little interest. Completely forgettable.\\n\\n\\n\r\nSound:\\n\r\nSome of the songs were okay (NOTE: Okay is rated below 'kinda good'). I don't remember anything specific, but I do believe there was one song that I found quite good. Only one, and it wasn't used much.\\n\\n\r\nVA work is good. That's to be expected from an industry that pays their VA's higher than anyone else. I wasn't wowed by anyone's performance, and there isn't anything unique within this work that demands VA's go above and beyond, so it feels like this is the kind of show where the Voice Actor's (and sound coordinators) merely jumped on the project because they needed pocket change and everything else was booked.\\n\\n\\n\r\nCharacter:\\n\r\nAgain, while unfortunately cluttered by unnecessary fanservice, a weak soundtrack, and bare-minimum VA work, I felt the arcs that Aoki and Rin had, both separately and in unison, were very good. Had the show limited itself to them, or even limited itself to less than 5 episodes, or even gone so far as to release as a 45 minute OVA, then the story could have omitted all of the useless stuff beyond their character arcs and have been much better.\\n\\n\\n\r\nEnjoyment:\\n\r\nIt's unfortunate that I restrict myself from suggesting this anime solely because of the unnecessary fanservice. \"Well why did you watch it if not for the fanservice?\" you may ask. I watched it because of morbid curiosity. It's the sort of thing where you curiously look at a car accident knowing that you may see a dead body but you do it anyway because you've never actually SEEN a dead body. The difference here is that this anime is a car wreck, sure, but everyone lived and the only losses are material. It's an event that you wish didn't happen, but something good still came from it.\\n\\n\\n\r\n((If you liked this review, friend me for new reviews on other works, both manga and anime!))",
            "date": "2016-03-06T18:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 212408,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655715.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Paraturtle",
                "username": "Paraturtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=212408"
        },
        {
            "content": "What is Kodomo no Jikan, really? Does it want to be a comedy following a school teacher's ridiculous misadventures? Does it want to be a pornographic show about children? Does it want to be the tragic tale of a poor schoolgirl's sad, lonely life so far? \r\nWell, this show certainly doesn't know the answer!\r\nI really mean it, I don't recommend this, even just because of the uproar surrounding it. It's confusing and really not worth the watch. \r\nPositive aspects:\r\n1. Some scenes can be rather funny, the teacher's reactions are priceless.\r\n2. The show at least LOOKS good.\r\n3. The characters are actually rather well done for somethingthat looks from the outside like Jared Fogle's favorite porno. \\n\\n\\n\r\nNegative aspects:\\n\\n\r\n1. It's basically softcore child porn.\\n\\n\r\n2. The show doesn't seem to want to make it's mind up on what it wants to be about. It's going in multiple directions at once.\\n\\n\r\n3. Too much time spent on character development. If you've watched this, you'll probably know what episode I'm talking about.\\n\\n\\n\r\nAnd that's about it. It really, really seemed like it was trying to be appealing, but it just wasn't all that great in the end.\\n\\n\r\n2/10",
            "date": "2015-12-24T12:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 206695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5064372.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/simonh2000",
                "username": "simonh2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=206695"
        },
        {
            "content": "An anime that is no fool to wrangling, this one manages to trick the viewer in every way imaginable.\r\nOn a level of explicit content? Oh, the very least.\r\nJust like the last anime I reviewed not too long ago, that is now one of my favorites, this one does not fail at delivering a good story in the slightest.\r\nWhat you will see is the story of Rin, a gerontophillic young girl that tries to swoon her homeroom teacher, Daisuke; alongside the companionship of her two friends Kuro and Mimi. What this anime delivers and what you think it delivers are definitely two entirely different things.\r\nFor mostAmericans, the controversial subject at hand is its extreme nature of lolicon behavioral patterns from Rin; some of which can successfully garner the anime an NC-17 rating outside of Japan in a few matters. But, look past it, and you get an unexpectedly emotional story.\\n\\n\r\nWithout stating too much, but also not saying too less, this anime reflects on broken bonds, tethered relationships and other things amongst the girls. The teacher has his own morals to follow as well as he is awkward around girls for the most part when it comes to sexual matters.\\n\\n\r\nThe problem is that Rin is intensively on about this and taunts Daisuke in every way imaginable to the point where his sanity is questioned. However, he does successfully avoid all of her advances and is very stern about the whole matter; as you would not have anticipated.\\n\\n\r\nI mostly spoil that part so that the common person will not look at this like \"this anime is probably just gonna have some porn scenes in it with the girl and the man\" and so I have to spoil that little chunk to get those derogatory statements out of the way.\\n\\n\r\nYes, I mentioned NC-17 earlier, but it is not for that reason. It is mostly the humor in general that everyone outside of Japan would thrown upon, alongside some of its intense and heartwarming moments. Both of which, are very rewarding to watch.\\n\\n\r\nIf you really want to get your head out of the gutter for good, there is a scene with some action in it; and even more so than the usual onscreen kiss, but not up to sex. And it is also not with the man and another little girl, either. So, hope you are out of it now.\\n\\n\r\nJust watch this one for what it delivers in its moral, storytelling and nature. It is not nearly as memorable as the last one I reviewed, but it delivers enough where I would look back on it one day and remember all of the good that came from it.\\n\\n\r\nAnd I suggest that you give it a chance, as it does make you feel like an adult for watching something that goes beyond R-rated content; the rating of which, means that no children are even allowed to watch, regardless of accompaniment with an adult.\\n\\n\r\nAnd, of course, you are also obviously watching for all of the stuff I said before. Well, for what little I did say, as I figured it would be best to just review why everyone WOULDN'T be watching it instead so that you can have a better outlook of the anime.\\n\\n\r\nSo to sum it up: you will get a deep, emotional story, some scenes of discomfort where a vast majority of viewers would actually stop watching altogether and some intense moments that will make your heart race. All neatly packaged in an anime that will deliver the unexpected.",
            "date": "2015-09-12T04:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 198385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=198385"
        },
        {
            "content": "This anime is literally about kids with PTSD/Parental issues, and depicts greatly all the cases a social worker needs to be called.\r\nIt doesn't even classify as a lolicon anime like most viewers reported. It's barely just some lolicon fan service;no story, no plot ( and I don't mean ecchi scenes ).\r\nBut if this was under the sci-fi tab or even was a pure lolicon anime, I'd give it an 8. Now it doesn't even fit in any category, even the drama was forced.\r\nI'd suggest this anime only if you want to fill up your time and have no other planned anime to watch\r\n2/10",
            "date": "2016-09-22T11:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 229819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/278327.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Sotosyeah",
                "username": "Sotosyeah"
            },
            "url": "https://myanimelist.net/reviews.php?id=229819"
        },
        {
            "content": "(OPTIONAL INTRO)\r\n(So, to be honest, I had a really hard time judging and scoring this show. I can tell you right off the bat that it can be well-deserving of a 1/10, but I wouldn't bat an eye at someone giving it a really good score, like a 7 or an 8/10. This just goes to show how controversial this can become. So I'm about to explain why I scored this a 6: something that was thoroughly enjoyable / easy to watch, despite being so for a myriad of reasons.\r\nI MYSELF go \"WTF is this guy thinking, writing a reiview this big?! No onegives a shit\", but I now understand what's the feeling of having such urge to say so much about something - even if it's about this dumb lil' show)\\n\\n\r\n-------------------------------------------------\\n\\n\r\nSTART OF THE REVIEW\\n\\n\r\n The main problem presented here is: this anime lacks identity. The first half is entirely what you probably signed up for when you saw the tags \"ecchi, comedy, school\", read the description and saw three very young little girls on the cover - like the good MAL user you are - and so, that's what you get: a third grader hitting up on a new, 23 year old teacher - Aoki sensei - who has that clueless, dumb and generic look of a typical 2000s school anime character. \\n\\n\r\n The important thing to note here is the attitude of the main girl (Rin) right in the first couple of episodes: she shows her panties to the dude, asks him for kisses, to hold her tightly, etc., and, with that smug face of hers adds a \"what if I screamed right now?\" to the mix. She's one cunning little bastard, I tell ya. Of course, the dumb man just does not know how to react to this, because he most likely just came out of college without friends, bullied and not knowing what's it like having a girl on his lap - just kidding, there actually is some sort of reasoning behind this, but more on that later.\\n\\n\r\n THIS is where the \"fun\" really kicks in: episode 6. One could watch this episode by itself, and I can tell you it'd still be a pretty damn good episode. When did this turn into a full-on drama?? The pure shock made me stay glued to the screen...\\n\\n\r\n[Not that I think it matters but SPOILERS AHEAD]\\n\\n\r\n...Rin's cousin, Reiji, lost his parents young, and went to live with his own cousin Aki, Rin's mother. He eventually developed feelings for Aki and they were working very well as a family of 3, but then Aki got cancer, and died - hey, that was pretty sad - right after Reiji settled as an adult capable of sustaining his own family. The words he remembers the most from Aki: \"protect Rin for me\".\\n\\n\r\n Alright, so, after an entire episode of drama, I had to know where this was going, and the short answer is - it went down a mostly dramatic route. These are the ideas presented here, and the core of the series:\\n\\n\r\n>Rin and her cousin Reiji have a dark past, and to sustain her, he has to work, leaving her alone at home a lot;\\n\r\n>This leads to Rin being in need of affection*;\\n\r\n>Reiji treats her in a quite mature way for her age (this isn't very fleshed out);\\n\r\n>This supposedly leads Rin to have such attitudes with Aoki-sensei;\\n\r\n>Because Aoki-sensei is a sad lil' pussy (who gets called \"virgin\" by his own 8 years old students) he can't react accordingly, as an adult, around Rin because she acts in a mature way;\\n\r\n>This means he doesn't stop Rin from being on top of him, or from showing him her panties constantly, from kissing him, etc.\\n\r\n>Reiji, due to his obsession with protecting Rin, snaps when he sees she is so affectionate with Aoki-sensei;\\n\r\n>After some conflict, Aoki-sensei learns to act in a more mature way around his students (ambiguous), Rin is not that horny anymore, and Reiji snaps out of his yandere mode.\\n\\n\r\nThis is the core \"message\" of the anime, and I'm gonna tell you: it's not THAT bad. The teacher is a loser, and that's made VERY clear throughout the series: he has a cute as hell, busty teacher always clinging up to him and he doesn't make a single move, cringey as fuck; he is completely dominated by 8 years old girls, letting them mock him and control his actions, you get the picture, so, when it's also made VERY clear that Rin isn't just another lil' kiddo that just wants a smooch from a grown-up to see what it feels like, it's understandable how flustered he gets around her actions.\\n\\n\r\n *This is important, and it's a flaw the anime has, as well as the lack of identity I mentioned earlier: Rin acts as an adult - she goes out shopping with her friends, knows very well what sex is and teases an adult by using transparent nightwear - so, sure, it kinda justifies her teacher's attitude towards her (kinda), but that doesn't mean she'd logically try to kiss him, get so intimate with him, flash her panties and act all girlfriend-ish around him in such extreme ways(the ecchi). For this to be acceptable even for comedic purposes, she'd need to have an even darker past, where she'd be teased by her dad to do lewd things for her as he explored her innocence in a very creepy way, or something like that. Without such criteria, the ecchi/comedy parts of the show turn out to be shallow and lack real purpose other than appealing to lolicons or enjoying it for pure shock value - one could literally skip the first half of the series and come out with a more positive impression of the plot of the series, I'd say.\\n\\n\r\nKodomo no Jikan goes from a dumb pedo ecchi comedy to a full-on character drama with snippets of - actually kind of appealing - psychological tension, always with a generous dose of cringe to the mix, and that makes for a very weird, \"hard to judge how I feel\" experience.\\n\\n\r\nNow that the main things have been said, I'll make it very clear - I had a fun time watching this: \\n\r\nThe comedy made me go \"WTF, NO WAY! THAT DIDN'T JUST HAPPEN!\" mixed with uncontrollable laughter EVERY single episode (except for episode 6); its midway point made me actually care a respectable bit for the characters (Rin and Reiji) and it actually had a decent sort of psychological approach that I enjoyed, especially for the fact of not seeing it coming.\\n\\n\r\nDo I recommend this? Yeah. Totally. The amount of reactions this show can pull out from any person is insane - be it despising it with all your heart, making you laugh a whole ton, or getting sexually confused (xD) - and that by itself makes it worth the shot.\\n",
            "date": "2017-06-03T19:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 249222,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962828.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Nostalgik",
                "username": "Nostalgik"
            },
            "url": "https://myanimelist.net/reviews.php?id=249222"
        },
        {
            "content": "This review is probably going to be really short as I dropped this on episode 5 after reading a bit of what happens further in the manga and it's ending.\r\nSo, Kodomo No Jikan is a show that contains fan-service of little children (8 years old).\r\nI was disgusted by that but the people that recommended me this said that if I can look past the disgusting fan service that the plot is pretty good... which is true for the most part.\r\nSome episodes had terrible plot and some were good with the most prominent example being Episode 5.\r\nIt detailed Reiji's sad past and was well written. Sowell that it actually surprised me it was in this show.\\n\r\nHe was such a good character. Unfortunately he is ruined by the author's fetish for pedophilia.\\n\r\nHe turns him into someone who goes after his own 8 year old step-child simply cause she looks like his deceased wife. That's forced melodrama 101 right there.\\n\\n\r\nThe protagonist is a teacher and is 23 years old when the series begin and Rin is 7. At the end of the series she is 16 so that makes him 32... okay... Reiji's case even if it's still wrong is more acceptable than this.\\n\r\nAs a teacher and an intelligent adult he must realize what it means for a 32 years old man to be with a 16 years old. That's another one of the things that put me off.\\n\\n\r\nThe bothersome part is that the sexualized parts are not when she is 16... it's when she is 7.\\n\r\nThis ruined the whole thing for me as I genuinely enjoyed some of the character's stories and struggles.\\n\\n\r\nAlso, the main female lead (Rin) is extremely annoying.\\n\\n\r\nIt's a show with enough potential but does everything wrong.",
            "date": "2016-07-26T14:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 225080,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4466415.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SigmaticDoc",
                "username": "SigmaticDoc"
            },
            "url": "https://myanimelist.net/reviews.php?id=225080"
        },
        {
            "content": "When I read the title of the anime at first I thought it was one of those kids-shows so I never initially thought I would pick it up. About a year later my friend came to me and said that this show was hilarious so I watched the first episode only to be incredibly surprised not once, but twice! See, after hearing the storyline from my friend (basically he was giving me spoilers) I figured it wasn't a kids-show but just one of those ecchis where the perverted protagonist tries to get a lot of attention from the female characters. I was surprised that myguess was slightly wrong. I will try not to spoil much of the story. I hope I succeed.\\n\\n\\n\r\nKodomo no Jikan follows a young 3th grade teacher, Aoki Daisuke, and his first class, Class 3-1. When the story begins the nervous teacher walks into the classroom only to find the girls in the middle of changing into their gym-clothes, which does not work well with the teachers confidence and the kid's impression of him. One girl, however, thought of it as interesting. Kokonoe Rin, the female protagonist, decides to test this new teacher in ways most of you wouldn't have guessed. Rin is possibly around 9-13 years old and the lilttle devil decides to test him through seduction. In the process of this the little Rin even fell for her teacher and so a most awkward relationship was born. It however does not end there since Rin's best friend, Kagami Kuro, a small girl with an intense liking for cosplay, apparently has a crush on Rin and does not like the relationship that is developing between Rin and her teacher and so will do anything to torture Aoki-sensei. Aoki, who has no ill intentions towards the girls, has his hands full with the little trouble makers.\\n\\n\\n\\n\r\nThat kinda covers the basic idea of the main story. Now you might be saying that this story may be just one of those typical ecchi stories. Wrong. It is not. This anime has quite a few twists in the story, which make the anime even that more attractive than it already was for it attractive artwork and comedy. Aoki-sensei soon finds out that there is more to these little girls than he thought and even more, there is more to his job than he ecpected. Also the anime talks about a relation between a minor and an adult, which is pretty much inconceivable and therefor all the more fun. You will find that I am a fan of the What If ideas. in this anime I found my answer to \"What if the female student was perverted and not the male teacher?\".\\n\\n\\n\r\nThe genres that fit right with this anime would be ecchi, comedy, drama and slice of life. If I have to compare it to other anime I would say it comes close to the twisty way of story-telling of the Key animes. Imagine llight perversion mixed with a few moments of Clannad. Not as tear jerking but enough to satisfy any fan of the Key animes.\\n\r\nAs I said earlier the artwork and voice acting is fantastic. This anime is what I like to call pure evil. The kids are drawn and voiced to express ultimate cuteness that will make you go \"awe\" every now and again. Why pure evil? I am a sucker for cuteness leave me alone ;~;\\n\r\nI am a fan of openings and endings and like when they are catchy. Kodomo no Jikan doesn't fail you.\\n\r\nThe opening is called \"Rettsu! Ohime-sama Dakko\" (れっつ!おひめさまだっこ) by Kitamura Er , Shindō Kei, and Kadowaki Mai, the voice actresses for Kokonoe Rin, Kagami Kuro, and *Usa Mimi, respectively and the ending song \"Hanamaru Sensation\" (ハナマル☆センセイション Hanamaru☆Senseishon) by Little Non. These songs are the main OP/ED. High paced songs with just the right attitude to reflect the series.\\n\\n\r\n* (Mimi is one of the main female protagonists. I did not mention her since I would spoil the storyline in doing so. Mimi is basically the shy smart kid with the over developed body.)\\n\\n\r\nSo in a nutshell, are you searching for an anime that has not too much perversion in it, has a real and convincing storyline, has great artwork, amazing characters and quality cuteness in the mix? Kodomo no Jikan is a story you can't miss. However, if you are more of an action, adventure lover (basically shounen) who doesnt care much for cuteness or other peoples problems, you can skip it although I still recommend it.\\n\\n\r\nI hope this was informative enough. It was my first review so spare me but please do comment if you want to see some changes or something. My English is grammatically bad, I know. Sorry for that xD:",
            "date": "2011-07-23T11:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 39787,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/249578.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DeviousSiddy",
                "username": "DeviousSiddy"
            },
            "url": "https://myanimelist.net/reviews.php?id=39787"
        },
        {
            "content": "Kodomo no Jikan is by far my favorite anime. The characters feel like real and unique individuals. The story deals with light-hearted loli fun as well as serious issues faced in many lives from a child's perspective. I only hope that it one day gets a Blu Ray release and more episodes. I would love to see the entire manga in anime form. The manga may cover the story better, but the anime has a very unique appeal to it that the manga can't capture.",
            "date": "2013-10-21T13:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 117767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3277525.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/flutterjedi1",
                "username": "flutterjedi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=117767"
        },
        {
            "content": "Well, I'm going to be fast. This anime fails because it started as a loli-ecchi anime, but right in the middle ep. 5 of 6 it turns to be a dramatic anime. \r\nIn general the anime is an average loli anime, with enough fan service for the ones looking for it and a simple story line. The teacher tempted to like/love a student, the conflicts and the moral involved etc... But as I said before, it fails when involves a new dramatic background just because :\r\n1. There's no enough development of the story.\r\n2. The characters are not design for this kind of anime.\r\n3. There isa marked stereotype of every character, and when they try to change them the whole anime explodes.\\n\\n\r\nOver all I enjoyed the anime, is kind of entertaining.",
            "date": "2014-03-18T23:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 136077,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3595039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/rojajumo",
                "username": "rojajumo"
            },
            "url": "https://myanimelist.net/reviews.php?id=136077"
        },
        {
            "content": "This show is not a fantastic show. It has many flaws, and also has the aged animation you'd expect from a 2007 anime. However, it massively exceeded my expectations. I expected a terrible show, but actually found myself enjoying it. In the end, the show was a fairly decent slice of life.\r\nWhile I would call it average, the fact that my expectations were set so low from the beginning made it feel more as though it was the greatest thing I'd ever seen. I'm sure that effect wouldn't carry over through a rewatch, but it made for an extremely enjoyable experience while it lasted.",
            "date": "2018-06-28T12:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 282457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339959.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GamerCyclops",
                "username": "GamerCyclops"
            },
            "url": "https://myanimelist.net/reviews.php?id=282457"
        },
        {
            "content": "This anime is the weirdest thing that happened upon me recently, not because of the amount of loli blackmail contained but because of how this anime will take you from holding a knife to your eyes to trying to deal with the amount of emotional weight that is dropped onto you. \r\nIt is a good story, if you can get to that. Every character is given a backstory that fits them and defines why they are the way they are, except our main character who is just this boring guy who really needs to figure out what he wants to do with his teaching career.\r\nThereare two different kinds of episodes in this series, the kind that will follow the same trend of:\\n\r\n1:Teacher guy gets yelled at by someone and told to toughen up \\n\r\n2: He toughens up \\n\r\n3: Kids make fun of him and the loli blackmail begins \\n\r\n4:Teacher guy doesn't want kids to make fun of him and lightens up \\n\r\n5: Class gets good grades \\n\r\n6: Teacher girl fails at asking out Teacher Guy\\n\r\n7: repeat.\\n\r\nThen there are the second kind of episodes that decide they want to rip out your heart then give you a bionic heart so you can live a little longer so they can tear out some other organ you need to live. The mothers backstory was one of the most shocking and unexpected things I have seen in an anime in a long time and now have a permanent fear of paper swans.\\n\r\nThe characters were the best part of the series, as it didn't really have a plot besides \"Go to school and try to seduce your teacher\" I feel like all the characters were given time to become important, as long as you watch the OVA and second season to show you the past of some of the less important characters. Renji is probably one of my favorite normally insane people in anime but he needs to get over his fear of scissors, this isn't Kill la Kill she isn't going to hurt you with those things.\\n\r\nThe intro and ending themes were really good, they had me hyped up for every single episode with that giant spinning e in the beginning. \\n\r\nOverall this series is great and gives a pretty strong message about not looking down on kids for just being young but their past and how mentally stable they are, you just have to look past the rather large amount of sexual jokes made by third graders, which i recommend because watching Renji fall apart is one of the best things I've seen in a while.",
            "date": "2016-07-10T19:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 223687,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5100143.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BenjaminRogers",
                "username": "BenjaminRogers"
            },
            "url": "https://myanimelist.net/reviews.php?id=223687"
        },
        {
            "content": "THIS REVIEW IS SPOILER FREE!\r\nWhat can I say that hasn't already been said about Kodomo no Jikan?\r\nProbably not much.. but I love the characters so much, both the teachers, as well as Kuro, Mimi, and Rin (I love those names as well). I initially started the series out of sheer curiosity, and I got a little worse than I had expected. It kind of felt like the demonic love-child of Toradora and Boku no Pico.\r\nIt took me a very long time to complete Kodomo no Jikan even though I had the full first season plus the OVAs readily accessible for at least a month beforeI completed it. I just couldn't take such high doses of children my baby brother's age being so lewd.. but what got me through the series was the comedy. If I wasn't crying, I was laughing. Not many anime have made me literally laugh out loud more than once or twice. I laughed at least once per episode; sometimes it was because of the absurd situations, or Kuro-chan's elaborate name-calling. \\n\\n\r\nTowards the end of the season, I was loving all the serious background story! \\n\\n\r\nOverall, I really had a love-hate relationship with this series. I still am not entirely sure how I feel about it, but I can say I wouldn't change the fact that I completed it.",
            "date": "2016-05-28T04:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 219474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642280.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kurokitty-mimi",
                "username": "kurokitty-mimi"
            },
            "url": "https://myanimelist.net/reviews.php?id=219474"
        },
        {
            "content": "This story is about a third grade class in Japan that has three precocious girls in it, and a new young male teacher, Aoki Sensei. The girls are naughty and inappropriately flirtatious and conspire to make Aoki's life as a school teacher a living hell.\r\nI viewed the 12 episode original TV series, the OVA, and the (first?) five second season episodes. I was really surprised at how good this series was. I was expecting a lot of fan service, and indeed this show has it -- I would give it at least a soft R rating. But the story was anything but childish. It hadquite a bit of heavy drama that captivated my attention to the end.\\n\\n\r\nThis show exceeded my expectations in a number of ways. The story was a true comedy drama all the way through. All the main characters are developed well, and we learn to understand what makes each of them tick because we are exposed to flash backs that explain past traumas. Once we understand the complexities of each of the characters, every new event becomes meaningful, and we are sucked into the story completely. The voice acting was wonderful, even for a non-Japanese speaker, the character portrayals were rich and evocative.\\n\\n\r\nI give this show 8/10. My only disappointments are that the show seemed to end without tying up some obvious loose ends, and no one's emotional struggles are truly resolved. This seems typical of Japanese story-telling. There is always a sense that each person's grief work should be resolved privately or alone. This is definitely unsatisfying to Americans who pride themselves in working through their grief with other people. Bottom line -- a definite recommendation if you can live with the inevitable questions left at the end of the series -- and the lolita-themed fan service...",
            "date": "2014-08-22T10:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 157543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3075337.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bearvarine",
                "username": "bearvarine"
            },
            "url": "https://myanimelist.net/reviews.php?id=157543"
        },
        {
            "content": "I absolutely loved this anime! I can see how it can be controversial, but at the same time it is just a show and should be taken as that. I found it extremely humorous and to my surprise, very dark at times. This anime touches on subjects that are taboo to most people, if not all. I normally do not watch animes that are subbed and not dubbed, but made an exception for this one. The fact that the subtitles didn't bother me is a big deal, but I enjoyed the anime that much! I loved it and don't have a bad thing to say!",
            "date": "2014-07-19T15:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 152793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819929.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LadyWolfwood",
                "username": "LadyWolfwood"
            },
            "url": "https://myanimelist.net/reviews.php?id=152793"
        },
        {
            "content": "(This is my first review co-written by my friend whom I watched this with)\r\nWell I watched with this anime with my friend for a laugh cause why not? What did I get? Emotional scarring and questioning life choices. Kodomo no Jikan has the potential to be a good anime but nope... It's about a 3rd grader who has the hots for her teacher and makes lewd remarks and actions. Now the first 10 episodes were quite repetitive (apart from the flashback episode) Rin Kokonoe being a little cheeky child and messing with her teacher, Aoki Daisuke, in ways no 8 year old should. Now thelast 2 episodes are quite interesting and made me question what I was watching many times. If this anime was set in high school or when Rin is more mature then this anime has the potential to actually be something you shouldn't have to be worried about your parents walking in and seeing but no. Some person decides you know what? LET'S SET IT IN GRADE SCHOOL. Now, if you're into something a little different or something just to laugh at with a friend by all means watch Kodomo no Jikan. However if you want to watch a serious anime leave no. My, and my friends, overall enjoyment was quite high actually - we laughed (for all the wrong reasons) and questioned what on earth was happening multiple times.",
            "date": "2017-08-07T10:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 254908,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5974077.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 3,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stitch927",
                "username": "Stitch927"
            },
            "url": "https://myanimelist.net/reviews.php?id=254908"
        },
        {
            "content": "I wouldn't recommend it for younger audiences though, mainly due to the sexual references that are constantly displayed on the show. I would certainly recommend it for anyone who understands these things and is mature enough not to be horrified by them. \r\nI personally enjoyed it as i became interested in Rin's past and what happened in it. I also think that the evolution of Aoki as a person throughout the anime is very well thought out as it helps develop the story more.\r\nOverall this is a fairly enjoyable anime. But to fully enjoy it you must be able to see what is truly goingon behind the scenes as well as the obvious things. There are many sudden realizations and plot twists that happen constantly in every episode.",
            "date": "2017-05-17T10:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 247919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6049861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tri_Ph3on1x",
                "username": "Tri_Ph3on1x"
            },
            "url": "https://myanimelist.net/reviews.php?id=247919"
        },
        {
            "content": "Ok, lets make an easy review that can make people choose if watch or not this anime. In my opion reading the manga would be the best option since this 12 episodes doesn't end the plot, yeah because there is a plot, and is even a good one.\r\nKodomo no Jikan is known for the loli aspect, and yes it was very disturbing the first 5 episodes, I was giving up until I watched the 6 ep, there start the good things about this anime. P.S. should be added drama genre!\r\nStory: (8)\r\nAoki Daisuke is and avarage guy, doesnt have any kind of experience in life, butnow he's becoming a grade school teacher and he want to be a really responsable and reliable. Here now we meet our other 3 main character, all girls(child?), and one of them Rin Kokonoe seems to have fallen in love with him since the first day. There' s also a really cute teacher that have a crush in Daisuke, but since he doesnt have any kind of experience he doesnt give a sh..\\n\\n\r\nYeah... now  the first 5 episode are all ecchi/ (\"comedy\") moments with a 7 y o girl that do things... do things, you know what I mean... to make him fall in love with her.\\n\r\nI found it really disturbing but you should hang on and watch it beacause then you can't understand the other 7 episodes that are quite enjoyable, yes there still those ecchi moments(less) but now our teacher seem that have grown up a bit and try to put some distance between them.\\n\\n\r\nArt: (7)\\n\r\nWell drawn and not wearisome for the eyes.\\n\r\nClearly could be way better, but overall is not that bad.\\n\\n\r\nSound: (6)\\n\r\nBackground music was putted to improve the feelings, but sometimes it wasnt great or didn't worked well on some scenes.\\n\r\nOp and Ed, I didn't liked them that much, but they were fine.\\n\\n\r\nCharacter: (8)\\n\r\nThis is one of the strongest, along with the story, point of this anime.\\n\r\nWe see that something is changing, Daisuke is becoming the kind of person that he wished to be, the kids love him, and now he can handle our 3 MC girls way better, specially Kokonoe.\\n\\n\r\nKokone grow up too, at least at the final ep, she decide to wait for him.\\n\\n\r\nOther characters changes too, but we need to focus on our MC.\\n\\n\r\nEnjoyment: (6)\\n\r\nThe first 5 eps, like I said, are really bad, there's nothing, only fanservice of little girls, than start the drama part and we can see a plot along with some character development. I raccomend this anime for ppl that like drama genre.\\n\\n\r\nOverall: (7)\\n\r\nIt's not bad, I was expecting to give up at the 6 ep because I couldn't handle anymore, there was nothing, luckly I watched the 6 ep and than things started to go better.\\n\\n\r\nEnjoy. \\n\r\nP.s. I'm not english, hope you can understand and apreciate my review.\\n",
            "date": "2016-01-20T15:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 209008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4702655.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/4b3",
                "username": "4b3"
            },
            "url": "https://myanimelist.net/reviews.php?id=209008"
        },
        {
            "content": "At first it seemed to be the usual harem thing with a lolicon teacher in a class of sexual harassing students. But as i continued watching it, it unveiled its real side and showed that there was much more to it. The characters are well characterized and their role in the story is well structured either. Believe me when i say that it really surprised me in a good way. You'll get surprised at discovering what's hiding behind every of the characters.",
            "date": "2013-06-28T14:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 102827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2138953.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KasaneD",
                "username": "KasaneD"
            },
            "url": "https://myanimelist.net/reviews.php?id=102827"
        }
    ],
    [
        {
            "content": "Kodomo no Jikan is…strange. In one respect it is typical loli fair; loli, for those who don’t know, essentially being underage anime girls doing either cute things, or in this case most of the time, sexual things. If you hear someone be referred to or refer to themselves as a lolicon, it means they get off on underage anime girls. And for those lolicons reading this review, I can assure you you’ll more than likely love this anime. Now get off my review you sick, sick person!\r\nBack to the topic at hand. Kodomo no Jikan is loli fair that comes across as rather funny becauseof how insane the main character, Rin Kokonoe, is. She falls in love with her new teacher, Mr. Aoki, and pretty much sexually exploits herself to him at any given opportunity. Through twelve episodes we see three different types of moods. Serious, loli, and cute. The loli can come across as funny though. That’s the only reason I wasn’t one hundred percent creeped out by this show. That, and a chick created it.\\n\\n\r\nAnd on a totally unrelated note I watched the subbed version and noticed it was done by Loli subs. Okay, that’s rather expected…oh, Suck-Suck Subs also helped. That’s not disturbing.\\n\\n\r\nStory\\n\r\nThe story revolves around new teacher Mr. Aoki. He’s twenty-three, single, and apparently one sexy mama…or papa. One of the students, Rin Kokonoe falls in love with her new sensei and is suddenly taking every opportunity she can to have intercourse with him. I swear to God, I am not kidding when I tell you that this third grader tries to give him BJ’s. Her best friend is a rich bitchy goth-ish girl with an outfit for every fetish. She’s also a lesbian who really loves Kokonoe and wishes she were a guy. Add to that the third friend, a girl with glasses who is apparently hitting puberty at age ten and is shy about everything, and we have ourselves a crazy love story. As the series progresses we learn why Kokonoe is the way she is and we see a lot more of a serious plot appear beneath the gratuitous (but funny) loli. This plot isn’t really thick and is actually rather basic when you get right down to it, but it works. We feel a lot more for the characters toward the very end.\\n\\n\r\nThe romance may be unorthodox but comes across as cute as it is the girl who wants it. Mr. Aoki is a weird character. I don’t think he wants a romance with her, but he sees himself more as a father figure to her. Though at the end of the series (SPOILER) I get the feeling that his words to her meant that he would always be by her side and she would wait until she was old enough to finally get with him. It’s actually rather cute. The series has a way of taking something as disturbing as loli and making it kind of cute, which scares the shit out of me. I shouldn’t like this. I shouldn’t. But I do.\\n\\n\r\nAnimation\\n\r\nThe animation is alright. Characters look good (NOT LIKE THAT!) but are not amazing in the grand scheme of things. Animation is smooth and emotion is conveyed well through character expression. Backgrounds look good. Not much to say in this area.\\n\\n\r\nCharacters\\n\r\nThe characters of the series are all rather basic and flat except for Rin Kokonoe. She is the standout character, not because of her continual panty shots and lolicon masturbation material, but because she’s rather more complex than the rest of the characters. She does the things she does for a reason that is explained later and it’s a good enough reason. I can see my younger self in her position to a lesser extent. The relationship between Aoki-sensei and her is really even more complex than those in most romance anime. There is a lot going on, Aoki doesn’t understand Rin at all, Rin really loves sensei. Aoki slowly begins to understand and wants to help and Rin just wishes she were older as she realizes all she is is a child. At the same time, Aoki realizes he’s an adult and has more responsibility than ever before. So we see the two extremes, one a child who wants to be an adult; one an adult who more than likely wishes he were a child once again. It’s effective. The relationship is actually quite effective and while it is taken to extremes that make me uncomfortable (on Kokonoe’s part, Aoki never does anything) it is a very cute relationship.\\n\\n\r\nThe two friends are different. The shy friend is typical, quiet, and boring. The only reason she was any good was she saw Aoki sensei naked when the girls sneaked into the hot spring and it started a string of jokes about his wing-wang-diddily-dang. The other friend who I can only assume was created for every loli fetishist ever, is funny as well, calling Aoki virgin at every opportunity, but I still didn’t like her. She was just too flat for me.\\n\\n\r\nAll the teacher characters, especially the teacher who falls for Mr. Aoki, are all flat as well. None of them have any development and I just didn’t care about what they had to say in the teacher’s lounge.\\n\\n\r\nSound\\n\r\nThe music is good. The opening isn’t bad, nor is the ending. The music during the show is good. All the voice actors are great and convey emotion well. Sound effects are fine. Blah, blah, blah.\\n\\n\r\nOverall\\n\r\nSo you’ve made it through my review and you’re probably scratching your head and wondering: “Hey Ratchet, what the hell?” Well, I asked myself the same thing for the past three days I’ve watched this. While one half of my head is actually rather surprised at how cute the show was, the other half is spinning with the pure insanity of how nasty it was. It was downright uncomfortable to watch a lot of the time. I mean, it was funny, but I still felt wrong watching it. Which I shouldn’t feel when watching an anime. There was probably a better way to convey the story than through all the sex jokes and insanity, but I guess it was built to appeal to loli enthusiasts and those who aren’t alike. It’s like being on a wall where one side is loli and the other is cute romance and the show sways toward either side but stays balanced on top of the wall.\\n\\n\r\nI shouldn’t like this. I should hate this. I should be sitting down and giving this show an angry review. But I actually thought it was good. It wasn’t great, it wasn’t bad. It conveyed a story, used an extreme to convey it better, and came across as partly cute, partly disgusting. How can something do that, I don’t know!\\n\\n\r\nLet me end this before my brain oozes from my ears.",
            "date": "2015-05-22T11:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 188540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188540"
        },
        {
            "content": "I can see why people might be wary of Kodomo no Jikan, but I would ask that you give it a chance. While at first it may just seem like a barely legal lolicon fanservice extravaganza, it isn't. The characters are actually incredibly interesting, and I genuinely feel like this is a good anime that is worth watching.\r\nIt's not even just the main girl (Kokonoe Rin), the other two girls, the teachers, her brother, all of them are interesting in themselves. In who they are, WHY they are how they are, how they interact with each other. There is also a fair share of humourin there too, so don't think it's all deep-thinking drama.\\n\\n\r\nI would definitely recommend that you at least watch an episode or two before you judge it, you might realise why it really is a captivating series.",
            "date": "2016-10-20T04:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 232149,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5687020.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nightshade19",
                "username": "nightshade19"
            },
            "url": "https://myanimelist.net/reviews.php?id=232149"
        },
        {
            "content": "Funny as Hell!!!\r\nLol, can you believe what these girls do and talk about!?!?!?\r\nXD they're in grade 3! lololol what were you doing back in grade 3?\r\nTrying to marry your teacher? Flash people? Be sexy? LOLOL So amazing.\r\nIt's just hilarious. I'd reccommend it~ \r\nYou'll laugh, feel sad, and go WTF alot of times~\r\n^o^",
            "date": "2012-01-11T21:32:00+00:00",
            "helpful_count": 0,
            "mal_id": 51581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1096637.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Zetsubou_Matt",
                "username": "Zetsubou_Matt"
            },
            "url": "https://myanimelist.net/reviews.php?id=51581"
        },
        {
            "content": "Kodomo No Jikan is about a 8yo little girl named Rin Kokonoe who fells in love with her teacher Daisuke Aoki and tries to get into a relationship/sexual activities with him.\r\nOkay, I gotta say right off the bat... Even tho the plot seems... weird. It has a lot more to it. It has good romance and it even has feels in it, plus, the comedy in it is pretty good too if you're into ecchi clichés. The art-style is kinda old... well, 2000's old but it's really cute. All of the characters are pretty lovable and you end up falling for the little girls, evenif you're not a lolicon, trust me, you will fall for Rin.\\n\r\nIf you're a huge lolicon like me, give it a go. Try it even if you're not couse this anime isn't bad at all",
            "date": "2015-12-17T11:34:00+00:00",
            "helpful_count": 0,
            "mal_id": 205809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205809"
        },
        {
            "content": "This is a very situationally funny show.  If you know japanese and can understand the title or have seen any pictures you know this show revolves around all things loli.  The idea of a teacher having possible feelings or even relations with his student (who is in 3rd grade :P ) is very taboo indeed, but this is meant as a purely comical show, not a hentai.  There is plenty of (loli) fan service if you are lucky enough to see the uncensored version.  \r\nThere is really no plot to this, just one of those \"day to day school life withrelationships&quot; type shows but where it lacks in plot, it makes up for with extreme character development and interactions.  \\n\\n\r\nThe artwork is done really well and the voice actors do an excellent job (especially the three lead girls).  And the opening theme is nice and upbeat, always a plus.\\n\\n\r\nWatch this for a good time but dont expect to be WOWed.  \\n\\n\r\nAnd supposedly there are plans for a season two so keep your eye out if you liked season one.",
            "date": "2008-06-08T11:16:00+00:00",
            "helpful_count": 0,
            "mal_id": 5329,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/34574.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kawaiimisato",
                "username": "kawaiimisato"
            },
            "url": "https://myanimelist.net/reviews.php?id=5329"
        }
    ]
]