[
    [
        {
            "content": "There's something inexplicable about Yuyushiki that makes it a difficult sell. Frankly, the premise of \"three girls goofing off\" is about as original as \"three guys walk into a bar\". Furthermore, a considerable number of the jokes are patently unfunny, and the characters will probably find themselves laughing more often than the audience will. On paper, Yuyushiki sounds like every other largely forgettable 4-koma slice of life adaptation out there. So what makes Yuyushiki stand out in a veritable sea of similarly themed shows? Quite a lot, actually.\r\nTo start, good character dynamics are paramount in these plotless slice of life shows, and in that respect,Yuyushiki delivers in spades. Yuzuko is a somewhat typical, perpetually ebullient character, and is often the instigator of Yuyushiki's humorous situations, while Yukari is more of an airhead and quick to get caught up in Yuzuko's antics. Yui, the tsukkomi to Yuzuko and Yukari's boke, is the more serious of the three, and generally the one to keep the conversations somewhat grounded. Respectively, none of the girls really stand out from the ilk of their genre, but the sum of their personalities constitute a very natural and thoroughly entertaining rapport with one another.\\n\\n\r\nThe bulk of Yuyushiki is dedicated to the frankly inane conversations among these three friends. The way their conversations veer wildly, often at the whims of Yuzuko, from one nonsensical topic to the next is always surprisingly natural. They change their cadence in an attempt to make one another laugh, pull innocuous little pranks on each other, and repeat meaningless phrases until they become funny; all typical things that most kids would be guilty of, but it's more in the way that Yuyushiki portrays them that makes it special. An illogical joke suddenly becomes infectiously hilarious when all three girls, even the comparably stern Yui, burst into unwarranted and uncontrollable laugher. Heck, even something as commonplace as the word \"potato\" is enough to set them off. \\n\\n\r\nDespite all the goofiness, Yuyushiki is perhaps at its best when the girls exhibit moments of genuine introspection. Lurches in the girls' conversation frequently lead to surprisingly serious topics, ranging from their plans for the future to their thoughts on death. These moments serve as subtle yet invaluable reminders that the girls are more than mere comedic devices, adding more depth to these small understated moments. Of course, it isn't long until the show shifts back to its pervasive silliness, but these fleeting moments are particularly memorable nonetheless. All of this conversational inanity and brief stints of sincerity culminate as an experience that is surprisingly realistic and easy to relate to. There's something particularly endearing about the way Yuyushiki effortlessly draws you into its lackadaisical atmosphere; it's simply a delight to spend time with these characters.\\n\\n\r\nWith that said, Yuyushiki's sense of humor certainly won't appeal to everyone. A large portion of the jokes simply aren't funny, as the emphasis is often on the absurd journey it took to get to the punchline rather than the actual destination. In fact, many of the jokes don't even have a punchline - which in the context of Yuyushiki's jocular gait could even be seen as the punchline - so those looking for a more traditional joke/punchline structure might be left dissatisfied. However, for those able to embrace the unusual comedic stylings of Yuyushiki, they will be rewarded with a truly unique and charming experience.\\n\\n\r\nYuyushiki pulls through with formal excellence as well. Every little detail contributes to the joke. The colorful palette lends itself well to the genial atmosphere, and the animation, while unassuming, reveals marked craftsmanship upon close examination. Great care was taken into making small gestures and slight cues in body language as fluid and authentic as possible. Simple jokes are often elevated by a unique framing of the shot or a perfectly timed change in perspective. In many ways, Yuyushiki's production values are inextricably linked with the actual content of the show, but it does so in a very unobtrusive manner that can be easy to miss providing one isn't looking for it; ideal for this type of show, really.\\n\\n\r\nIn closing, Yuyushiki takes a simple premise and adds its own signature flair. It's easy to forget you're watching a show that is essentially about nothing when the experience is as fun as Yuyushiki is. With a wonderfully laid-back mood, some of the best character dynamics in recent memory, and topnotch production values, Yuyushiki is a show that is head and shoulders above most of the genre. Give it a chance! You won't regret your time spent goofing off with the cast of Yuyushiki.\\n\\n\r\n...\"potato\"",
            "date": "2013-06-27T21:32:00+00:00",
            "helpful_count": 165,
            "mal_id": 102747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1212363.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NotDolphy",
                "username": "NotDolphy"
            },
            "url": "https://myanimelist.net/reviews.php?id=102747"
        },
        {
            "content": "Yuyushiki is like the main course for a comedy slice of fun. When you have breakfast, you're ready for the day. After lunch, you feel good and ready to tackle the afternoon. Then, there's the dinner as main course as Yuyushiki where it will complete your day with a good dose of laughter and fun. Indeed, the fun never stops with three adorable girls. This show only has less than 8000 people watching according to statistics at the time this review was completed. Let's try to raise that a bit higher, shall we?\r\nThe anime series is based off of a 4-panel manga written by KomataMikami. The details for the show is rather simple. You see that promotional poster with those three adorable girls? Yup, Yuyushiki is what the series is all about – three girls who are members of the Data Processing Club. They have fun in their lives and I'm glad alive to see them in this show.\\n\\n\r\nAt first, I wasn't too keen on checking out Yuyushiki. In fact, the show wasn't even on my radar until I saw this trailer a week before it aired. In that very trailer, there were three girls, Yuzuko Nonohara, Yui Ichii, and Yukari Hinata. I'm not a big fan of slice of life series especially involving Chinese cartoons with girls doing cute things. However, when I watched that trailer, I noticed this strange sense of nostologia that bought me back to when I was in school. In fact, this show is more than just about cute girls doing cute things. It's about enjoying the life at school with your friends and making the most of it. There's no battle shounen sequences, gory violence, or shock fan service. Rather, it's adorable in its own way and that's something I am thankful for.\\n\\n\r\nThe show is a little different from what I usually watch. I'm not sure exactly the right word to describe but adorable is definitely one of them. The show has this feeling of charming magnet that hooks you more and more. For the main characters, this is focused on the activities the girls do in their everyday lives. Indeed, we have three main characters who are girls. In fact, the majority of this show is made up of girls. Their names seems to be some sort of parody or reference to the title, Yuyushiki as all their names begin with the two letter “Yu”. Together, the girls forms a club known as the Data Processing Club. The club itself isn't any special but the girls sure takes their names to make the most about their school lives. Among the cast, there's Yukari and Yuzuko. The duo makes up the majority of the awkwardness but of course fun part of the series. Their fun gags often comes into the opposite of Yui who seems to be more of a serious person. The trio seems to be best friends and makes the most of their time in the club doing random things on the Internet. Oh wait, I thought girls aren't usually into this type of stuff. The stuff they do “research” on the web also seems to be random and for little purpose. It doesn't really matter though since the show is random in its own right.\\n\\n\r\nThere's many fun gags and later on implied yuri vibes. In fact, most of this seems to be aimed at Yui, the cool chick of the trio. It's hard to tell if they're really serious or not considering the show itself is marked by comedy. However, it's quite amusing to watch as Yui often acts indifferent or even at times perplexed during various situations. Yui herself also seems to be one of the major points in the episodes as her figure seems more dominant with her eye features and gestures. As the target of Yukari and Yuzuko's teases, she has to endure most of it through her ways. They all end well and good though as the trio are friends anyways.\\n\\n\r\nThroughout the series, I also noticed that there's a lack of adolescence dominance. The show is entirely dominated by the younger casts. In fact, one of the only teachers who gets screen time in the show is Matsumomo (Oka-san). Among other cast members who gets screen time are Chiho, Fumi, and Kei. They seem to be more in the backgrounds though as the the majority of the series is dominated by the three Yu's.\\n\\n\r\nYuyushiki follows a slice of life format so don't expect any sort of significant story building. What you should expect though are the everyday antics that are employed in each episode as we see personally though the eyes of the Data Processing Club and what they do. Although lacking a true purpose, the show sometimes raises eyebrows related to questions related to 'death'. It creates a strange tension on whether if the show has any sort of purpose beyond just random fun. Whatever the case though, it sure achieved curiosity; a good well job done at creating that to say the least.\\n\\n\r\nThe dialogues of this series might not be so memorable but watching the girls talk about their daily lives sparkles a smiles to my face. This could have different results for everyone but sometimes, it does drag out quite a bit. It seems to be repetitive and some of the jokes gets old. Additionally, the amount of yuri vibes gets stronger and stronger later on in particular with our adorable Yui. Her reactions is always predicable though as given her more straight out personality. But perhaps a problem of this show is the dragged out conversations. It's rather difficult to watch a random show such as this with it being length of 22 minutes each week for some people. Also, some of the jokes makes no sense. For me though, it's enjoyable but I'm not sure about others. Needless to say, the pace and randomness of this show might not be an appeal for everyone.\\n\\n\r\nAs for artwork, Yuyushiki adapts a lighthearted dose of comedy. The characters' designs are obviously designed to look adorable. Their moe eyes features reflects on the cuteness of the main characters. The backgrounds of the school and other areas are simple and straight to the point. In fact, some of the backgrounds are designed to reflect that silliness with cartoonish patterns and aesthetics.\\n\\n\r\nThe soundtrack is also simple. Both the OP and ED songs shows our main trio doing fun activities while making various silly poses in silly outfits. The voices of the characters showers the fun that the characters have. In fact, most of them are hardly ever angry or emotional. Rather, their laughter brings joy and that puts a smile on my face as well.\\n\\n\r\nAll in all, Yuyushiki is not just adorable but a show to relax and enjoy for viewers of all ages. Don't take it seriously. The show doesn't so there should be no reason to. What I do advise to do is watch Yuyushiki and think back when you had random fun with your friends at school. Maybe it won't be about randomly searching for stuff on the Internet, but it definitely brings back some nostologia at least for me. The series should be a crime to be this cute and adorable at many cases. At other times though, it does feel a bit more dragged out. Regardless though, this show was an enjoyable ride and I think one to at least give a shot at. It's not just cute, it's Yuyushiki.",
            "date": "2013-06-25T15:00:00+00:00",
            "helpful_count": 78,
            "mal_id": 102391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=102391"
        },
        {
            "content": "Yuyushiki is a feel good show and a half. At the same time I really started to get into this I was listening to a ton of David Bowie when I thought up of a weird analogy: Yuyushiki is to Slice of Life what Scary Monsters is to David Bowie's 70's career. It's a perfect combination of all the best elements with a fresh execution put into a neat package. Granted, I put Scary Monsters as the greatest Bowie album of all time but I don't put Yuyushiki as the greatest Slice of Life of all time, and Slice of Life Anime is no DavidBowie in itself.\\n\\n\r\n... Where was I? Oh, yeah. Yuyushiki was just something I eagerly anticipated and enjoyed each and every week. It felt familiar. It felt like Azumanga Daioh, it felt like Lucky Star, it felt like Hidamari Sketch, it felt like K-ON! and it felt like Yuru Yuri all at the same time. It was like a beautiful homage to Slice of Life Anime, and yet it felt like a new experience. Some will call this blatantly ripping them off, but it feels like it aspires to pay tribute to the genre in mimicking the humour, atmosphere and slight boredom of the aforementioned Slice of Life's.\\n\\n\r\nStory:\\n\r\nI uh... what should I say... it's a typical Slice of Life situation... I guess I'll give it 6/10.\\n\\n\r\nArt:\\n\r\nA lot of people were bothered by the art, but not me. I thought it looked nice and had plenty of nice colour and personality. To me a real sight for sore eyes it is.\\n\r\n9/10\\n\\n\r\nSound:\\n\r\nThe sound gives the nice subtle touches to the atmosphere. Love the opening and ending songs,. I absolutely adore Minami Tsuda's voice, especially her singing voice.\\n\r\n9/10\\n\\n\r\nCharacter:\\n\r\nCharacter is the most important part of a Slice of Life, and Yuyushiki has plenty of that. Yui Ichii feels a lot like another character Tsuda voices, Yui Funami, only she feels a little softer and easier to crack than Yui Funami. Yuzuko and Yukari perfectly compliment this character in their goofy antics, and together all three lead girls really feel like they have a real genuine and fun friendship.\\n\r\n9/10\\n\\n\r\nEnjoyment:\\n\r\nMuch like any quality Slice of Life. Sometimes you laugh, sometimes you'll love the atmosphere and sometimes you feel a content boredom watching it. All in all, just simple fun.\\n\r\n9/10\\n\\n\r\nSo that's all I have to say about Yuyushiki. It's everything Slice of Life Anime is. If that's your bag, then this is worth a go. If it's not your thing... perhaps you should stay away.\\n\\n\r\nOverall: 9/10",
            "date": "2013-07-12T07:32:00+00:00",
            "helpful_count": 52,
            "mal_id": 104993,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1455417.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Bristle",
                "username": "Bristle"
            },
            "url": "https://myanimelist.net/reviews.php?id=104993"
        },
        {
            "content": "Adorable pink hair idiot ✓ \r\nThe shy Tsundere ✓\r\nRich airhead ✓\r\nif I had a nickel... Ehh Hmm, That aside, Yuyushiki was exceptionally good despite the overused character types. I think my favorite thing about the show was the characters. Yuyushiki is full of common \"archtypes\" and have \"typical\" character personalities that are as stated before, overused. So I had a very difficult time at first, maybe around episodes 1-5 to get into the show because of this. That aside, what I found great about the characters was that it turned out to be one of those shows where despite their character types, the girls stillmanaged to maintain their own unique individuality, along with being really cute no matter what they are doing. They are likable for the most part, annoying at times however the characters redeem themselves every once in a while through hilariously well put comedic moments.\\n\\n\r\nThe story, plots, pretty typical. It's your average.. slice of life that focuses on the lives of three high school girls so not too much of importance when it comes to story or plot development.  Lastly, let me add that it can be said that you've probably already seen shows like this a little over 100 or so times however I want to say that if you do decide to give it a watch you'll notice that the characters in Yuyushiki stand out from the norm. Again, this depends on if you're familiar with shows similar to Yuyushiki.\\n\\n\r\nArt and animation in this show, I feel like it is lacking strongly in good character designs. However, after doing a bit more research via Google and... well the damn description on the page, I see that it's originally a 4-koma manga and depending on the artist most don't... well the artist I know like Midori Endō, Tozen Ujiie, etc don't care too much about character apperances as long as they look friendly and can have faces that look great during reaction scenes which is something that happens a lot in Yuyushiki.. \"reaction faces the anime.\" Actually, I think that title belongs to Nichijou... Mmhhh.\\n\\n\r\nMoving along I didn't care too much for the soundtrack, BGM, OP and EDs. Nothing stood out too me. Voice acting was great, seiyuu's did a perfect job bringing their characters to life.\\n\\n\r\nMy overall enjoyment of Yuyushiki was minimal at first however when I re-watched it this week it kind of grew on me. Lots of fun moments and more importantly friendship to go around, yes. Overall I had to give this show an 8/10 because it's one of those shows that become really heart-warming at times. In a way it reminds me of K-On! a group of moe girls just having fun just enjoying their youth. Give it a watch, and a chance, Yuyushiki is worth it.\\n\\n",
            "date": "2016-04-18T06:51:00+00:00",
            "helpful_count": 38,
            "mal_id": 216633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=216633"
        },
        {
            "content": "The schoolgirl comedy genre has become somewhat over-saturated of late, but it remains something I very much enjoy when done right. I approached Yuyushiki with mild optimism, not really sure how it would stand up to the better entires in the genre. After delving into it, I'm quite happy to say it does very well. It's a thoroughly enjoyable series thus far.\r\nIt looks nice. The animation doesn't seem cheap as some anime in the genre can at times. The character designs are very cute but not too overstated. The voice actors deliver the lines naturally and believably. The OP and ED are also quite charming,I find. It's a well made series. \\n\\n\r\nThere isn't much in the way of plot, but that's natural for the genre. Nevertheless, I think the setup lends itself well to the genre. The girls of the \"Data Processing Club\" spend club time surfing random things on the internet, which opens up the possibilities to even more topics for bizarre elliptical comic dialogues than the entirely aimless Amusement Club in Yuru Yuri, the anime this one most responds me of. Giving the cast of silly high school girls the internet to amuse themselves with proves to be an inspired way to expand upon just what can reasonably be discussed. Other than that, however, it's mostly the typical points in Japanese high school life we've seen other places before. \\n\\n\r\nThe characters make everything work though. They're very silly, but a whole lot of fun. Yukari is an adorable airhead. Yuzu is more excitable but equally ditzy and weird. Yui is the straight man of the group, but has her moments of silliness and really does seem to get along with her weird friends. Their teacher is also a very adorable, fun character. The other classmate characters aren't at this point as stand out, but they don't really have to be as it's content to stay focused on the main girls.\\n\\n\r\nFor my tastes, the show has a lot of great humor. If the jokes don't make me laugh outright they make me smile more often then not. The group dynamics are also pretty fun. Like Yuru Yuri, the anime isn't afraid to offer up lots of blatant yuri subtext, which to me is always a plus. I find quite a lot to like watching the series. Fans of other schoolgirl comedy anime should definitely check this one out too.\\n\\n\r\nUpdate: Having now completed it, I'd say Yuyushiki continued to remain quite the exceptional anime following the point at which I originally reviewed it. Watching the second half, it was easy to see just why the series works. It just all feels so genuine. The characters play off of each other so well and believably it's hard not to be charmed. It's irreverent and its joyful, and watching it it really becomes just infectious. It's the kind of show I could watch several times just to make me smile. I sincerely hope that, like Yuru Yuri, it is given a sequel. Highly recommended.",
            "date": "2013-05-27T00:05:00+00:00",
            "helpful_count": 31,
            "mal_id": 98579,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=98579"
        },
        {
            "content": "This is honestly my most favorite anime of all time, but it is definitely far from a masterpiece, even though I love it to death, I genuinely cannot give it more than an 8 (and this is a really biased and generous score).\r\nI found Yuyushiki through mountains of 音MADs that exist for this anime on Youtube and as a fan of Generic-4-koma-Slice-of-Life-with-3-to-4-Highschool-Girls anime/manga, I think this one's enjoyable to watch. The plot of the story (as if there is any) is just 3 girls in a club where they just ask weird questions, look up Wikipedia or just hanging out in or out of school.\r\nForthe main characters, we got Yuzuko Nonohara - smart girl with a funny personality, Yukari Hinata - rich and kind hearted airhead with a cute laugh, and Yui Ichi - the typical tsukkomi character (aka Best Girl). There is no main topic in each episode, it's just them going about their daily routine and having random conversations which lead to inside jokes and tsukkomi-boke moments.\\n\\n\r\nThe art style and animation is simplistic, nothing notable but I find that it helps make the characters themselves standout and be more memorable. \\n\\n\r\nSoundtrack-wise? LOVE IT \\n\r\nThe music matches the mood (\"Fresh\" is a good example) and each character specific song (especially \"TekiPaki\", use it as your alarm, trust me it works) is very fitting and memorable. The voice acting is also pretty good, they nailed each of the main character's personality and even made some pretty good meme-worthy materials (SEPTEMBAAA)\\n\\n\r\nSome minor drawbacks are that:\\n\r\n1. Unless you are an avid fan of 4-koma/slice-of-life, most of the gags are gonna be a miss because it's just 3 girls doing everyday things and laughing at random comments they make (IE: The \"potato\" scene, it's pretty good but I just didn't find it funny)\\n\r\n2. Some puns are pretty hard/impossible to translate over to English\\n\\n\r\nAside from having an amazing soundtrack, a small cast of really likable main and side characters, there really is nothing I can say to recommend this anime. It is without a doubt one of the most generic slice-of-life anime, but I can say that it excels in that genre\\n\\n\\n\r\nTL;DR\\n\r\nYou like slice-of-life/4-koma or want somewhere to start? I'd recommend this anime to fans of the genre and newcomers alike (and when you're done with that, go look up: OtoMADs of this anime on Youtube, you're welcome in advance)",
            "date": "2018-12-01T02:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 295023,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7597767.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PIZZACHEEZE",
                "username": "PIZZACHEEZE"
            },
            "url": "https://myanimelist.net/reviews.php?id=295023"
        },
        {
            "content": "Honestly, at first I was very wary about Yuyushiki due to the fact that the anime and story itself is really, really simple. But, I made the right choice in giving this anime a try. Of course as the majority of Animes focusing on girls in High School, you've got a crazy girl, a dumb and slow girl and a girl that is the most sane out of the three. Though their really isn't a development to the plot, it is very enjoying to be able to see all the misadventures of the three girls and the episodes are all very humorous. I recommend ithighly to those that are in the mood for some humor or want to get rid of their depression. Their really isn't much to say about this anime overall just the fact that it will make you laugh. Perhaps I am being too kind but I give Yuyushiki for now a strong 7 and look forward to watching the rest of the episodes.",
            "date": "2013-05-14T08:11:00+00:00",
            "helpful_count": 13,
            "mal_id": 97167,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1993280.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kev_Vigoroth",
                "username": "Kev_Vigoroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=97167"
        },
        {
            "content": "Yuyushiki is a comedy SoL anime about 3 high school girls talking about random topics, not much else to say about this series. \r\nStory: 5/10\r\nWhat story? It's a SoL anime, ain't much of a story in here. The episodes are mainly about the random conversations of the 3 main characters, one good thing is that the conversations feel natural or realistic to me, this could be a good thing or a bad thing, I found it quite boring because I don't find high school girls talking about random things very entertaining,  but I'm sure some people would find it enjoyable.\r\nArt: 6/10\r\n If you're likeme, the art doesn't bother you too much unless it's spectacularly bad or good. If you're not like me, I'd say the art in this anime is pretty average, nothing special to me. \\n\\n\r\nSound: 6/10\\n\r\nThe OP and ED song are fitting for an anime like this. Personally, I found the OP song catchy and fun, but it's nothing to write home about.\\n\\n\r\nCharacter: 5/10\\n\r\nThe three main characters are Yukari, Yui, and Yuzuko. Nothing much special about them, Yukari is your average airhead, Yui is the more normal girl among the two, and Yuzuko is your average hyper character. As for the background characters, I don't really feel the need to talk about them because they're not as important as the main characters.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI didn't really enjoy it much, mostly because I didn't find the random conversations between main characters entertaining, I mostly found them boring. The characters were nothing special, so I didn't really enjoy them too much either.\\n\\n\r\nOverall: 5/10\\n\r\nOverall, I found this show to be very mediocre, nothing outstanding or unique about it.\\n\\n",
            "date": "2013-06-21T03:44:00+00:00",
            "helpful_count": 11,
            "mal_id": 101781,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2141807.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/catfish24",
                "username": "catfish24"
            },
            "url": "https://myanimelist.net/reviews.php?id=101781"
        },
        {
            "content": "~Just kidding Just slipped out...~\r\nYuyushiki sat on my PTW list for a considerable amount of time.\r\nWhy? \r\nWell i hate to judge a show by its cover, but when i'm looking for possible anime to watch: the cover, blurb and some words from strangers are all i generally have for investigating...\r\nYuyushiki is a prime example of an anime that can't be fully expressed by words. At a glance, many will be deterred from the relentlessly rehashed premise of \"a bunch a schoolgirls being schoolgirls\" - combine this with a cartoon-esque animation style and a vibrant colour scheme, and yeah, you've got pretty much every Slice ofLife ever... \\n\\n\r\nIn terms of competition, Yuyushiki has to stand out above the rest with something unique, to really get credit where credit is due - and its because of this formulaic-looking layout that not enough people will get around to appreciating it  - so consider yourself one of the lucky 30,000 who managed to stumble upon this genuinely entertaining franchise! \\n\\n\r\nOnto the analysis...\\n\r\nI'm not going to lie to you, Yuyushiki is exactly what it advertises. It's a deadly simple slice of life concept - and so SoL haters: you've been warned!\\n\r\nI've always thought of Yuyushiki as a really refreshing take on life. By nature it's charming, and due to its frequent comedy outbursts - it's upbeat, entertaining, and will make you laugh - at least, it did for me...\\n\\n\r\nSomething great about it, is the way it accurately represents mindless real life thought processes and procrastination. While these are often wrongly deemed as insignificant, seeing the often chaotic and random nature of our minds presented in such a lighthearted manor, is really comforting. The spontaneity of the trio's actions actually adds some anticipation as to \"what are they gonna do next?\" (a seldom achieved attribute by a pure SoL) \\n\r\nEven though we can all be perfectly aware that no major plot-shaping events take place; Yuyushiki brings about a great casual, care-free atmosphere, making it easy to watch, and surprisingly addictive.\\n\\n\r\nWhat is it that has people coming back for more?\\n\r\nAlike most anime of the genre, Yuyushiki is character, as opposed to plot-based - now that's not to imply that they all have breathtaking back stories - because they don't, and yet their design is quite something to behold. It seems that Geneon knew what they were doing when they pieced the visible trio together... We've got \\n\r\nYukari - the lovable airhead, \\n\r\nYui - the more cynical subject to embarassment, \\n\r\nand Yuzuko - the spontaneous one...\\n\\n\r\nSimple, right? And it's this beautiful simplicity that makes the characters so relatable, and likable.\\n\\n\r\nTo you those may be just random names, but due to the realism in the chaos of the trio's conversations that make up the body of the show... To me, i feel like i know them personally, without having their life stories relayed...\\n\\n\r\nThe conversations that go on all seem true to life. \\n\r\nThey're always well integrated into the situation to flow seamlessly together. \\n\r\nThe best part is their intimate nature - no i don't mean intimacy...\\n\r\nYuyushiki incorporates a lot of charming details, and often uses verbal disclosure to add small, intimate, fragments to each character's portfolio - and so you get to know them, on a similar rate as to how they get to know each other.\\n\\n\r\nThe combinations of these methods... realistic characters, realistically crazy thought processes, and realistic converse, and dedicated SoL approach - makes Yuyushiki very relatable, enjoyable and relaxing. From this (on top of character attachment) -  the show strives to entertain, and does so with ease!\\n\\n\r\nI found that Yuyushiki wields an intimately charming method of life documenting, that i haven't seen since K-ON (which i adored). I've got to stick to an 8 for this one, as i would still have liked to see more character depth, and some sort of conclusion. \\n\r\nBut i digress... If you're a SoL fan, or looking for something PLEASANT, and carefree to watch after a long day's work - Yuyushiki is for you!\\n\r\n(P.S. That's a lot of \"u\" sounds)\\n\\n\r\n~Juuuust kidding Just slipped out...~\\n\r\n~Juuust kidding Just slipped out..~\\n\r\n~Just kidding Just slipped out~\\n\r\n~Just kidding Just slipped out!~\\n\r\n~JUST KIDDING JUST SLIPPED OUT!~\\n\\n\\n",
            "date": "2015-03-07T15:22:00+00:00",
            "helpful_count": 8,
            "mal_id": 181909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=181909"
        },
        {
            "content": "Work days can be exhausting. Solution? A light-hearted anime to help you unwind!\r\nUnfortunately, this isn't the right anime for me. It consists of three friends bantering and goofing off, which would be fine if they were witty and interesting individuals, but alas! they are dull as wallpaper. Their bantering is downright banal - in fact, the high point for me was the pun \"mochi-vated\". And I'm a person who LIKES banter!\r\nThe characters were: a normal, straight-laced kid; her two lesbian best friends who want to fondle her; and a big-busted teacher, who her friends also want to fondle. I am pro-LGBT, and it's annoying tosee lesbian characters used purely as fanservice/objects of comedy. I wish the creators had used more quirky, unusual, bizarre, and even grotesque characters.\\n\\n\r\n[In Secret Code: Ja sam zapravo odgledala samo dve epizode, ali ovi jebeni birokrati brisu moje komentare o serijama zatosto \"nisam dovoljno odgledala za pisanje\". Moram negde da priznam da sam samo odgledala dve (citav sat ovoga!), pa cu da napisem ovde i mozda ce neko da koristi Gugl Prevodilac. U ovakvim serijama, cak i jedna epizoda ti kaze sve sto trebas da znas.]",
            "date": "2015-02-07T18:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 179901,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4193825.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LadyMillenia",
                "username": "LadyMillenia"
            },
            "url": "https://myanimelist.net/reviews.php?id=179901"
        },
        {
            "content": "As far as I'm concerned, don't watch Yuyushiki if you're going to take it seriously. That's not the point.\r\nEverything is random, yet fun. Take this is as the main standpoint from watching it. Laugh at the humour of course, but don't treat it as something that's going to have a real story behind it. It doesn't. However this doesn't matter. It's meant to be relaxing to watch and if you're not going to see it this way, you're not going to enjoy it.\r\nEverything can be commented on positively. Although it isn't amazing there is nothing I can fault. Everything is just right, and what thewriters obviously set out seems to have been achieved in my opinion.\\n\\n\r\nYuyushiki is from start to finish, something you can enjoy without enormous expectations. There is nothing that makes it really stand out, but that's the reason why it does what it is meant to well. When you expect only what is presented in front of you every episode, you enjoy that episode to the fullest. That's Yuyushiki for you. It hides nothing. It is a simple, and fun series that you can enjoy without having to be disappointed at the end because of something not happening, or something like that. Stick with it, it's a pleasant surprise.",
            "date": "2013-06-25T14:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 102383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2314987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Reflex96",
                "username": "Reflex96"
            },
            "url": "https://myanimelist.net/reviews.php?id=102383"
        },
        {
            "content": "Boke and Tsukkomi: The Anime\r\nIt may not have many ROFL moments, but Yuyushiki gave me more sharp chuckles than any other anime I've seen. It kept a smile on my face through every episode. And the characters have that quality that makes you laugh just by looking at them. Not because they look funny, but because they have a certain quirky charm to them.\r\nI've heard the show likened to a group of crackheads formulating ideas and laughing at theirselves, and I'd have to say that's pretty spot-on.\r\nOf course, this is a slice-of-life, so don't expect much plot or any deeper meaning behind anything. Even thepremise of the show -- about girls being in a data processing club -- is just barely touched upon. This anime is really about three goofy friends and their often nonsensical conversations. More accurately, two goofy friends and their level-headed friend who attempts to bring some normalcy to the group.\\n\\n\r\nThough relatively tame in comparison to other \"random\" slice-of-lifes, the dialogue alone makes it pretty wacky. That being said, it's one of the most realistic slice-of-lifes out there. I could easily place myself in that group and laugh along with them, because I had friends just like them in school. The ones I questioned myself for being around, but still hung out with anyway because they provided so much enjoyment. Yuyushiki is pretty much the embodiment of those friends.\\n\\n\r\nI'll admit, around episode 8 or 9 I started to feel like I had seen enough and grew a little tired of it. You could very well watch the first 3 episodes and know enough about the show to write a review about it. But again, Yuyushiki is that group of friends I just couldn't let go of. Even in the final episodes I was still smiling throughout and enjoying the company of Yui, Yukari, and Yuzuko.\\n\\n\r\nSo if you're looking for a realistic slice-of-life with plenty \"hey, wouldn't it be neat if...\" conversations and knee-slapping gags (which, admittedly, is not everyone's cup of tea), Yuyushiki is the show for you. You might even learn a few random facts along the way.",
            "date": "2015-07-29T11:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 194628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4333545.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lizard23",
                "username": "Lizard23"
            },
            "url": "https://myanimelist.net/reviews.php?id=194628"
        },
        {
            "content": "Clever, Humorous, and Random.\r\nThose are the words that best describe Yuyushiki.\r\nIt doesnt have any story to follow at all, but the random events of 3 high school girls.  Its funny to see all the different facial expressions that they show when they are paranoid, excited, or just plain lazy.  Their laughing is contagious, and I laugh every time they Tehehehe... Because as they continue with their he-he-he's it goes up in pitch, and it ends as if it were a question.\r\nMost of the jokes are hard to understand, but when they do something funny, its funny.\r\nArt and sound were very good, because itwas funny to watch and hear all the different stuff that went on.\\n\\n\r\nCharacters were funny, and random, and thats what made this very funny.\\n\\n\r\nI enjoyed the hell out of it, because I would wait for the next episode with great anticipation, and hum the theme song every time i heard it.  I would laugh when they laughed, and would smile when they were plotting something.\\n\\n\r\nOverall it was very good to watch, and i enjoyed every bit of it.  Its sad to see it ending so soon, but every great anime must end.  The ending was great, even tho it was random as hell, and it felt like the true cherry on top was there.\\n\\n\r\nI Highly recommend it for when your looking for a good laugh.",
            "date": "2013-06-25T17:30:00+00:00",
            "helpful_count": 7,
            "mal_id": 102407,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1122179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DustPotato",
                "username": "DustPotato"
            },
            "url": "https://myanimelist.net/reviews.php?id=102407"
        },
        {
            "content": "\"Do you like towels? I love love towels! Love love.. Love love. Love love milk? Love love! Love love does sound good.\"\r\nI can't help but want to write a review for this anime although it hasn't yet been finished, Ii think there's enough material to create a pretty consistent opinion.\r\nThis is one of those light hearted animes that you watch when you're just taking a break, after you've seen some more intense things on TV, or just for you to relax and enjoy the pureness of anime with these loving girls.\r\nThe Story:\r\nThere's no story development around some concept, the episodes tend to be random andeach of them revolve around a series of topics from Blue Whales to Death (not in a very serious way of course, but it depicts the range of topics pretty well). This fits pretty nicely with these kinds of anime as this is not supposed to be watched in a marathon form where you watch all episodes in a row. This is for you to watch occasionaly. There's 3 main female characters and all of them with their unique personalities, they start attending highschool and soon start using the Data Process Club for all kinds of purposes, under the guidance of \"Mom\" which is how they start referring to their teacher as, and just make jokes and discuss random topics that always lead to humurous conclusions.\\n\r\nA bit like \"Yuru  Yuri\"? Maybe but not in the Yuri way but in the easygoing one, it's just overall enjoyable to wach these girls and their gags.\\n\r\nFor me it deserves a 7/10.\\n\\n\r\nThe Art:\\n\r\nThis was a bit of a let down, the character design in my oppinion is just not appealing, their heads are oddly shaped, their mouths apparently have all kinds of shapes and the head/body proportion is just overall not really fitting in today's anime standards, not that an anime has to follow those but to be honest the characters look a bit ugly which is such a let down for such a series that's fun and cute. But appart from the character shape, the colors are bright and cheerful and that really brings out the warmness of this show, it's a 6/10 for me.\\n\\n\r\nThe Sound:\\n\r\nNot much to say about this, the opening and ending themes are fitting enough and there isn't really much music in the actual episode so i can only judge the sound by those 2 criteria, since it wasn't an awful intro or ending it gets an 8/10\\n\\n\r\nThe Characters:\\n\r\nThe series gets all my points in this category. We have 3 girls, each with their own unique qualities, maybe a bit stereotypical but defenitely loveable ones that you know you'll enjoy in these types of show. We have Yui, the normal one who can't understand the other 2's ridiculousness but has a warming side to her and is that helpful type of character too. Then we have Yukari, the complete airhead which does really random things most of the times and half of those no one really knows why, you can't hate on such an innocent character, despite her being an airhead she can remember something from the far away past, except that something never fits with what they're talking about. Last but not least we have Yuzuko, the one that causes all the trouble and comes up with the weirdest topics or games to play, without her this show would not be complete and it's the combination of these 3 characters that makes the show good. You get indulged in their games and jokes and enjoy a nice episode about 3 girls in their humurous school life talking about the weirdest subjects. As far as Shoujo Ai, it is true the characters cnstantly say \"I love you\" (except for Yui) and they try to grope Yui as well (poor Yui) but it doesn't even get that far so this is not a crazy Yuri like show, rest assured (if this was worrying you) but it does have the essential girl love.\\n\r\nFor all these reasons the characters for me get a 10/10\\n\\n\r\nEnjoyment:\\n\r\nThis series so far has been pretty enjoyable, i love coming home on thursdays and watch the newest episode so i can relax and not watch something intense on TV, it's just simple and fun and it works fine.\\n\\n\r\nOverall:\\n\r\nThe show works and does what it is supposed to do, and although the art isn't the best ever the theme and the subjects in each episode just don't make you hate it and it's defenitely an anime you can watch 1 or 2 episodes a day and don't feel the need to watch it in a marathon.\\n\r\nMy overall score for this anime is a 7/10 which  is equivalent Good.",
            "date": "2013-05-31T15:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 99153,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1950132.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/IdleSheep",
                "username": "IdleSheep"
            },
            "url": "https://myanimelist.net/reviews.php?id=99153"
        },
        {
            "content": "I just can't describe how absolutely horrible this anime was for me.\r\nI like little sister anime, cringe with charm. \r\nTHIS however was cringe for the sake of \"comedy\" and they failed miserably.\r\nThey recognise their own stupidity and try to make it a Cligé \"oh that girl is dumb but cute\" moments and that is what angers me.\r\nthe art is pretty okay, nothing great. but the characters are dumb as a potato and not cute as they try to make them to be.\r\nPlease if you want to want better anime go watch \"Boku no pico\" i found that more enjoyable than this.\r\nJudge me how you want,i don't care",
            "date": "2017-06-17T19:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 250174,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4878915.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Falonthorne",
                "username": "Falonthorne"
            },
            "url": "https://myanimelist.net/reviews.php?id=250174"
        },
        {
            "content": "yuyushiki is really about making someone smile and laugh which is the true form of happiness,and the anime does a great job with that logic.,an anime with slice of life and comedy just like nichijou…the only difference is that yuyuhiki is a seinen anime and filled with more mature themes,so is this mature version of nichijou worth it..?\r\nContent- As of now the anime only has 12 episodes,with a possible second season eventually,Yuyushiki is based off a manga that uses the 4-panel design of comics as seen in many other mangas of the same genre. speaking of genre this anime is more of a peaceful animewith little conflict at all,and at times its just a playful joke or the characters annoying each other.Yuyushiki is a slice of life,that not only takes place in school but outside as well,some episodes aren’t even at school at all,it is also a comedic one,instead of a drama based anime,and lastly the anime is a sienen one,meaning it is for older audiences (mostly males) while nichijou was for younger audiences,so it is normal to expect mature themes in this anime,but thankfully its not filled with ecchi or crude humor and for the most part its safe to watch. The anime also contains some yuri jokes and a lot of randomness which can be enjoyable since it makes the anime unpredictable.\\n\\n\r\nPlot-  the plot is simple high shcool life,as in japanese high school the best times are from clubs so the main characters,yui the main girl who is smart with blonde hair and deals with the other two girls who always tease her,yuzuko the pink haired one who makes up most of the jokes,including the yuri ones.and yukari the blue haired who acts silly in a way like osaka from azumanga daioh. they join a club called the data processing club where they write down information even tho there is already a wikipedia.there the first in the club and so far are the only ones. Later in the anime more characters are introduced such as the teacher who is referred to as “mom” by the main girls,and a secondary group of girls who befriend the main group.\\n\\n\r\nMusic/voice-  the opening is standard and nothing special,not bad but not great,the ending song is good too,they made the opening hyperactive while the ending is slower paced,which is good when an anime does this letting you know that the anime is over.the anime also uses themes for characters as well which is also good and they can enhance the anime.  As for the voice acting,it is what you expect ,it is great and very well done.with yuzuko being the best,having changes in her voice to show her emotions or to mimic voices to create jokes.and yui for having her i’m always angry voice but knowing when to change it to happy or sad when needed.\\n\\n\r\nAnimation/Art- the animation and art seem a bit outdated and nothing compared to recent animes,so you may get the feeling this anime is from 2004 or something,however the art is great and can be detailed when needed. the anime also has a similar art style to that of nichijou and lucky star but still has its own unique style which makes it awesome.\\n\\n\r\nAppeal- its too early to say what appeal the anime has yet,but the animations can make for some great gifs,and various clips are on youtube,i think the anime will get slightly more popular over time but since the anime is also short it may not happen at all.yuyushiki can still be appealing if you just want a simple,but random anime that will make you laugh and enjoy.\\n\\n\r\nFinal opinion - if you are into slice of life like azumanga and nichijou then this is a good anime.the best i can say about it,is that its trying to be cute and mature at the same time.really good anime are actually only 12-14 episodes\\n\\n\r\nbut this shouldnt be the case with this anime\\n\\n\r\nthis anime has endless comedic possibilities and scenarios which can get at least 5 season,similar to polar bear cafe. which had a lot of seasons for a slice of life comedy.\\n\r\nanother thing i didn’t like is how fast the anime went in the timeline. the first episode they enter high school as freshmen,but a few episodes later they are on summer vacation,and celebrating new years and much later they finish that school ,so the pacing is a bit fast,in a way it felt rushed. which sadly stops the anime from becoming as great as nichijou or azumanga,hopefully the anime will get a second season in the near future.\\n\\n\r\nand as always\\n\\n\r\narigatou ^_^",
            "date": "2013-12-02T19:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 122379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3341903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ReimuNuggets",
                "username": "ReimuNuggets"
            },
            "url": "https://myanimelist.net/reviews.php?id=122379"
        },
        {
            "content": "A normal school life is a boring school life. But you will always have those friends who make it fun and interesting with occasionally going so far off the original conversation topic you don't even remember how it started or how it got so random. Regardless, it's a time you wont forget.\r\nThe story of Yuyushiki could not me more of a typical school slice of life story. Apart from the overly random pieces put throughout the anime, it could not be any more of a normal life story of the high school lives of the three main characters from the start of their first yearuntil the start of their third year. Nothing major ever happens and the entire anime as its filled with that of what starts out as a normal conversation and always ends up getting out of hand, sometimes in ridiculously humor filled ways.\\n\\n\r\nThe art style of this anime is a very basic, almost childish one as it's never anything too fancy or complex and everything is kept simple but fitting to the scene. Anyone other than main or secondary characters don't even have a hope of getting color to them and even then to portray different facial expressions they more than a few times will drop the color of a characters eyes or change it to a heavy gradient. Apart from this everything is cell shaded with only little to none in the way of tones for anything but afternoon scenes and clouds.\\n\\n\r\nMusic and sound also keeps a very childish feel to it as whenever sounds are played that aren't an object moving or being placed, they seem like something right out of a gag reel. The music when used always manages to keep a mellow mood unless one of the characters is going off on a random tangent that had nothing to do with anything else but for humor purposes. If anything it keeps the viewer calm and readies them for a laugh or a giggle when topic derailing happens.\\n\\n\r\nCharacter is one of a let down topic. We find out about how far back the relationship is between two of the main characters but not of the third. All we know is that they all knew each other before high school but how far back and how the final member came in is not explained. Other side characters are left with noting more than \"They are class mates\" leaving the viewer knowing little to nothing about most of characters in the show and are just expected to enjoy as is.\\n\\n\r\nOverall enjoyment wavers constantly as some episodes were slow and boring while others had a continuation of one - two knock out humor lines that span and entire episode, producing at least a chuckle from the viewer as they wonder what the hell are they even watching. A few times humor is attempted but is so poorly executed to the point where when it moves on you wonder \"What that a joke? Was that even meant to be funny?\" and this makes you miss out of the first few opening lines on the next scene/skit they attempt.",
            "date": "2014-07-01T04:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 149761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=149761"
        },
        {
            "content": "Occasionally entertaining dialogue between characters is a hallmark of slice of life series. In Yuyushiki's case, the series consists almost entirely of that. Compound it with the fact that characters are constantly either in/near school or in Yui's house, and you get a considerably static anime.\r\nEven in Lucky Star, commonly criticized for having bland dialogue between characters, or in Joshiraku, which pokes fun at itself for being made into an anime although it's a dialogue-heavy series; there are numerous occasions where characters are shown in environments that differ from the usual school/house setting (shops, school trips, camping trips, city trips, other outings, the beach etc.).The change of environment both presents new dialogue material to the cast, and gives something to look at to the viewer. \\n\\n\r\nIn Yuyushiki's case, changes of environment are rare and the dialogue stems from topics they research on the net, jokes between the characters, or everyday matters that characters happen to talk about. And about eight times out of ten, whatever the dialogue is devolves into Yuzuko flirting with/teasing Yui and Yukari laughing at whatever Yuzuko is saying (And Yui retorting at everything). Unless you like Yuzuko's out of the blue jokes and teasings, the typical Yuyushiki-dialogue can get old pretty fast.\\n\\n\r\nLeaving verbal content aside, the rest of the anime is largely attractive; in that  it has smooth animation, simple but cute character design, a lively soundtrack, and great sound acting (especially from Ookubo Rumi; the many random shouts of Yuzuko are very well done).\\n\\n\r\nWhat is also kind of a negative point in my opinion is that the cast is too limited. There are only 7 girls that get enough screentime, and the main trio takes about 85% of it. Given that they don't have so many character traits, this adds to the show's repetitiveness.\\n\\n\r\nTo summarize: you'll probably like Yuyushiki if you don't mind fixed environments, don't easliy tire of the \"tease-laugh-tsukkomi\" formula, and find absurd high school girl humour entertaining.",
            "date": "2015-10-21T21:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 201725,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1156747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Sombrefloe",
                "username": "Sombrefloe"
            },
            "url": "https://myanimelist.net/reviews.php?id=201725"
        },
        {
            "content": "I was a bit curious about this one. When I jumped on board, the first thing I noticed was how similar it was to Lucky Star. But, BOY, did that QUICKLY change.\r\nRight off the bat, the anime starts off awkwardly with the main protagonist, Yuzuko, being awestruck by a cat on a motorcycle. From there, the progression of weirdness slowly, but surely, finds its way to make you laugh your ass off right off the first episode.\r\nThe last anime I watched that was enjoyable right off the bat was Pani Poni Dash, so this anime ALMOST came close to perfect scores. But, upon further analysis,it still did not live up to the level of enjoyment I had from watching that anime. The weirdness is factored in very well, though. The characters make the anime so good that the setting almost does not matter, though for the setting they are in, it is simplistically detailed.\\n\\n\r\nYou have the aforesaid protagonist, Yuzuko, whom says so many random things that I hope you are not a very serious anime viewer to harshly criticize. Her very nature and essence breathes so much breathe into the anime that, without her, it would almost feel like a very casual slice of life experience. Despite her crazy nature, though, she is the smarted of her friend group...YUP. She is the most intelligent one, and actually has the most expansive vocabulary, too. When you hear her talk casually (which is rare), she actually says some pretty logical things at times. Hey eyes are frequently redrawn in comedic situations, with one of the versions actually making Yui go into a fit of uncontrolled laughter for about a minute of the scene when she gazed into the distance with them after Yui told her something. Try and see how many changes to her eyes you can count.\\n\\n\r\nThen, there is her (pretty much) best friend, Yukari, whom plays along with nearly ALL of her antics, but stole the show halfway through with her very unique style that is actually on a completely different scale from Yuzuko. It's not as crazy as Yuzuko's, but her airheadedness is different enough for you to call her a different character. Combined with her eyes being drawn in a way that I have not seen in an anime before, being unusually vertical, and drawn as two squares when she is confused, enjoying herself or is just in a trance; and you have the second funniest character in the anime.\\n\\n\r\nAnd then, there is the (most attractive to the majority of viewers) plaything, Yui, whom has so many idiosyncrasies that you could probably annoy her by breathing in a slightly different way. She is ticklish everywhere, of which Yuzuko and Yukari take advantage of on frequent occasions; and she is easily annoyed by randomness, which Yuzuko puts into her game quite a bit. She is the most logical one in the entire group, usually stopping Yuzuko from getting too crazy by hitting her, but usually does not hit Yukari for acting similar due to their childhood together. But, I do not wish to elaborate on that story as that story was very cute and I recommend you watch it yourself. Yui shares a few eye patterns that are similar to Yuzuko, but she never smiles in any of them. Speaking of not smiling, she is probably the most mellow in their group and almost always has a neutral expression on her face, occasionally smiling whenever everyone else is or actually manages to enjoy some of Yuzuko's craziness; even to the point of the aforesaid uncontrolled laughing.\\n\\n\r\nThe anime feels like it exclusively centers on the three characters, given everyone else is a silhouette or a detailed sketch without color; being one of similarities to the aforementioned Pani Poni Dash that I loved about it.\\n\\n\r\n(REMAINING REVIEW MIGHT SPOIL SOME OF THE EXPERIENCE)\\n\\n\r\nThen, their teacher, Yoriko, steps into the light and, if you picked up on the character formula already, she is fully drawn! So, as soon as you see her show up in the scene and notice her being colorized and detailed from the other background characters, you already spotted another character that will be involved in the anime! All recurring characters are still drawn, even if they are in the background, so keep this in mind when looking for new characters.\\n\\n\r\nI forgot to mention this in the beginning, but the three protagonists joined a club, the Data Processing Club, though they process data in very hilarious ways and offer little to no benefit to the school for their \"research\" duties. They draw a summary of the day, usually of a word, sentence or fact they thought was funny, or just something that annoys Yui. The teacher then comes in to check on it and gives a rating occasionally on what she thought of the summary, hinting that the club may not necessarily be needing to gather actual data, or that the teacher is an airhead.\\n\\n\r\nBut, do not worry, the fun does not stop here. At first glance, there is a repetitive formula of just the three girls and, occasionally, their teacher. But, if you were doing what I said before, you probably noticed a certain girl standout out of the many background sketches. This girl is one that wishes to be friends with Yui, but is scared of Yuzuko and Yukari (for good reason), and, at first glance, she seems to look like a minor character, but thanks to her having a voice actor and being fully drawn, this is a hint that she is not!\\n\\n\r\nSimilar to Yui, she is also pretty mellow. However, she is in a more cheerful manner; usually always smiling and is extremely innocent. She is the head honcho of her group, though not in terms of comedy. She really does not standout at all enough to be the star of her group in the comedy department, of which you know this anime delivers very heavily; but she is used as Yuzuko and Yukari's plaything occasionally.\\n\\n\r\nShe, too, has two of her own friends that, once AGAIN somehow, have very unique personalities. Well, one of them, anyway. One, Kei, has a generic tsundere attitude and is nothing too special, though she adores Chiho quite a bit; the aforesaid happy shy girl that I forgot to give the name of. She is usually pretty pessimistic, always frowning, but she has eavesdropped on Yuzuko's stories a few times and even interrupted one of them as she came up laughing, exclaiming how dumb her story was and wanted to know what they were even talking about at all.\\n\\n\r\nThe third girl in their group, Fumi, ultimately takes advantage of Kei's love for Chiho and overall pessimism iin the most hilariously unimaginable way that I have never seen in an anime before. Her personality alone should make her the standout comedy of the entire group due to her eyes almost never being drawn in full detail, combined with her jokes and timing almost always leaving me with a laugh, if not in tears! Her story is not that significant at all and her sole purpose is to add a ton of flavor to her group, which she does very successfully.\\n\\n\r\nOnly seven characters in all, a very light amount for an anime, but they might as well serve as a normal amount of characters due to how well their personalities standout from one another, with only a few being pretty simple.\\n\\n\r\nI was talking mostly, well only, about the characters, but this anime pretty much IS the characters. The setting itself matters not, as you will only be focusing on the wild antics of Yuzuko, the aiding to them of Yukari and the various reactions from the rest of the cast; namely, Yui.\\n\\n\r\nIf I had to go on about anything else, the background music in this anime is very simplistic, but it actually fits right into the atmosphere of it all! It is simple enough for you to hear it and composed well enough to enjoy it. It really does aid everything that goes on in the anime very well, though it would sound unfitting to listen to it after you watch it.\\n\\n\r\nIf you are not someone that can handle extreme amounts of comedy, then this anime is not for you. But, if you want something that is a combination of Pani Poni Dash and Lucky Star in the best imaginable way, I think Yuyushiki might very well be what you are looking for. This one has a very remarkable spot in my list due to its random nature being very different from most anime I have seen and it will not fail to entertain even the most pessimistic viewer. Because, truth is, this anime has NO dull moments. Pretty much all of it is pure comedic delight. I wish it had another season! But, it only did just begin two years ago, the manga is still going and YuruYuri proved that you can still make a new season years after another.\\n\\n\r\nSo, next chance you have to watch a random comedy, give this one a go. You will not regret it at all.",
            "date": "2015-10-25T00:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 201913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=201913"
        },
        {
            "content": "Hmmm... I'm not sure what should I think of this anime.\r\nI stumbled upon Yuyushiki searching for something similar to my high school/SoL/comedy favorite, Azumanga Daioh. So I gave this a shot. And I watched the whole thing through. Does that mean I liked it? Well... let's say I did, but...\r\nWe have three high school friends: Yukari, Yuzuko and Yui. Yui is mature and rational (well, most of the time), but the other two are everything but that; they're silly, random and pretty weird. They talk about most random things, that sometimes lead to pretty banal conversations.\r\nOkay, so what did I like about Yuyushiki? First, it'sthe cuteness of the girls, especially Yukari, who's my favorite. Then, it's their ability to make every conversation silly and funny. Even when they talk about dark themes such as death, it doesn't seem as dark as you think it should be.\\n\\n\r\nAnother thing I liked is the educational part. Being members of the Data Processing club, the girls reveal some interesting information about various topics (planets, animals, food, etc.) that you might not know.\\n\\n\r\nWhat did I not like? Definitely the fact that this anime sometimes gets too weird and/or random for my taste. At times it's just awkward. The relations between the characters, both main and supporting ones, aren't clearly defined. The yuri element is also present in some episodes, but it's very mild, and in my honest opinion, completely unnecessary. And that comes from me, a yuri fan.\\n\\n\r\nSpeaking of character relations that aren't defined, their teacher also confused me a bit. She's their teacher, but they keep calling her \"Mom\"? I'm not sure how common is it in Japan, but to me, it seemed a little odd.\\n\\n\r\nSo, in short: not bad \"cute girls doing cute things\" anime for those who like that sort of stuff. If you don't mind lots of weirdness, randomness and general silliness, give it a shot, you might like it. And you might learn a thing or two about planets or animals on the way.",
            "date": "2015-07-21T14:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 194010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4704003.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/daky-kun",
                "username": "daky-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=194010"
        }
    ],
    [
        {
            "content": "There's something inexplicable about Yuyushiki that makes it a difficult sell. Frankly, the premise of \"three girls goofing off\" is about as original as \"three guys walk into a bar\". Furthermore, a considerable number of the jokes are patently unfunny, and the characters will probably find themselves laughing more often than the audience will. On paper, Yuyushiki sounds like every other largely forgettable 4-koma slice of life adaptation out there. So what makes Yuyushiki stand out in a veritable sea of similarly themed shows? Quite a lot, actually.\r\nTo start, good character dynamics are paramount in these plotless slice of life shows, and in that respect,Yuyushiki delivers in spades. Yuzuko is a somewhat typical, perpetually ebullient character, and is often the instigator of Yuyushiki's humorous situations, while Yukari is more of an airhead and quick to get caught up in Yuzuko's antics. Yui, the tsukkomi to Yuzuko and Yukari's boke, is the more serious of the three, and generally the one to keep the conversations somewhat grounded. Respectively, none of the girls really stand out from the ilk of their genre, but the sum of their personalities constitute a very natural and thoroughly entertaining rapport with one another.\\n\\n\r\nThe bulk of Yuyushiki is dedicated to the frankly inane conversations among these three friends. The way their conversations veer wildly, often at the whims of Yuzuko, from one nonsensical topic to the next is always surprisingly natural. They change their cadence in an attempt to make one another laugh, pull innocuous little pranks on each other, and repeat meaningless phrases until they become funny; all typical things that most kids would be guilty of, but it's more in the way that Yuyushiki portrays them that makes it special. An illogical joke suddenly becomes infectiously hilarious when all three girls, even the comparably stern Yui, burst into unwarranted and uncontrollable laugher. Heck, even something as commonplace as the word \"potato\" is enough to set them off. \\n\\n\r\nDespite all the goofiness, Yuyushiki is perhaps at its best when the girls exhibit moments of genuine introspection. Lurches in the girls' conversation frequently lead to surprisingly serious topics, ranging from their plans for the future to their thoughts on death. These moments serve as subtle yet invaluable reminders that the girls are more than mere comedic devices, adding more depth to these small understated moments. Of course, it isn't long until the show shifts back to its pervasive silliness, but these fleeting moments are particularly memorable nonetheless. All of this conversational inanity and brief stints of sincerity culminate as an experience that is surprisingly realistic and easy to relate to. There's something particularly endearing about the way Yuyushiki effortlessly draws you into its lackadaisical atmosphere; it's simply a delight to spend time with these characters.\\n\\n\r\nWith that said, Yuyushiki's sense of humor certainly won't appeal to everyone. A large portion of the jokes simply aren't funny, as the emphasis is often on the absurd journey it took to get to the punchline rather than the actual destination. In fact, many of the jokes don't even have a punchline - which in the context of Yuyushiki's jocular gait could even be seen as the punchline - so those looking for a more traditional joke/punchline structure might be left dissatisfied. However, for those able to embrace the unusual comedic stylings of Yuyushiki, they will be rewarded with a truly unique and charming experience.\\n\\n\r\nYuyushiki pulls through with formal excellence as well. Every little detail contributes to the joke. The colorful palette lends itself well to the genial atmosphere, and the animation, while unassuming, reveals marked craftsmanship upon close examination. Great care was taken into making small gestures and slight cues in body language as fluid and authentic as possible. Simple jokes are often elevated by a unique framing of the shot or a perfectly timed change in perspective. In many ways, Yuyushiki's production values are inextricably linked with the actual content of the show, but it does so in a very unobtrusive manner that can be easy to miss providing one isn't looking for it; ideal for this type of show, really.\\n\\n\r\nIn closing, Yuyushiki takes a simple premise and adds its own signature flair. It's easy to forget you're watching a show that is essentially about nothing when the experience is as fun as Yuyushiki is. With a wonderfully laid-back mood, some of the best character dynamics in recent memory, and topnotch production values, Yuyushiki is a show that is head and shoulders above most of the genre. Give it a chance! You won't regret your time spent goofing off with the cast of Yuyushiki.\\n\\n\r\n...\"potato\"",
            "date": "2013-06-27T21:32:00+00:00",
            "helpful_count": 165,
            "mal_id": 102747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1212363.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NotDolphy",
                "username": "NotDolphy"
            },
            "url": "https://myanimelist.net/reviews.php?id=102747"
        },
        {
            "content": "Yuyushiki is like the main course for a comedy slice of fun. When you have breakfast, you're ready for the day. After lunch, you feel good and ready to tackle the afternoon. Then, there's the dinner as main course as Yuyushiki where it will complete your day with a good dose of laughter and fun. Indeed, the fun never stops with three adorable girls. This show only has less than 8000 people watching according to statistics at the time this review was completed. Let's try to raise that a bit higher, shall we?\r\nThe anime series is based off of a 4-panel manga written by KomataMikami. The details for the show is rather simple. You see that promotional poster with those three adorable girls? Yup, Yuyushiki is what the series is all about – three girls who are members of the Data Processing Club. They have fun in their lives and I'm glad alive to see them in this show.\\n\\n\r\nAt first, I wasn't too keen on checking out Yuyushiki. In fact, the show wasn't even on my radar until I saw this trailer a week before it aired. In that very trailer, there were three girls, Yuzuko Nonohara, Yui Ichii, and Yukari Hinata. I'm not a big fan of slice of life series especially involving Chinese cartoons with girls doing cute things. However, when I watched that trailer, I noticed this strange sense of nostologia that bought me back to when I was in school. In fact, this show is more than just about cute girls doing cute things. It's about enjoying the life at school with your friends and making the most of it. There's no battle shounen sequences, gory violence, or shock fan service. Rather, it's adorable in its own way and that's something I am thankful for.\\n\\n\r\nThe show is a little different from what I usually watch. I'm not sure exactly the right word to describe but adorable is definitely one of them. The show has this feeling of charming magnet that hooks you more and more. For the main characters, this is focused on the activities the girls do in their everyday lives. Indeed, we have three main characters who are girls. In fact, the majority of this show is made up of girls. Their names seems to be some sort of parody or reference to the title, Yuyushiki as all their names begin with the two letter “Yu”. Together, the girls forms a club known as the Data Processing Club. The club itself isn't any special but the girls sure takes their names to make the most about their school lives. Among the cast, there's Yukari and Yuzuko. The duo makes up the majority of the awkwardness but of course fun part of the series. Their fun gags often comes into the opposite of Yui who seems to be more of a serious person. The trio seems to be best friends and makes the most of their time in the club doing random things on the Internet. Oh wait, I thought girls aren't usually into this type of stuff. The stuff they do “research” on the web also seems to be random and for little purpose. It doesn't really matter though since the show is random in its own right.\\n\\n\r\nThere's many fun gags and later on implied yuri vibes. In fact, most of this seems to be aimed at Yui, the cool chick of the trio. It's hard to tell if they're really serious or not considering the show itself is marked by comedy. However, it's quite amusing to watch as Yui often acts indifferent or even at times perplexed during various situations. Yui herself also seems to be one of the major points in the episodes as her figure seems more dominant with her eye features and gestures. As the target of Yukari and Yuzuko's teases, she has to endure most of it through her ways. They all end well and good though as the trio are friends anyways.\\n\\n\r\nThroughout the series, I also noticed that there's a lack of adolescence dominance. The show is entirely dominated by the younger casts. In fact, one of the only teachers who gets screen time in the show is Matsumomo (Oka-san). Among other cast members who gets screen time are Chiho, Fumi, and Kei. They seem to be more in the backgrounds though as the the majority of the series is dominated by the three Yu's.\\n\\n\r\nYuyushiki follows a slice of life format so don't expect any sort of significant story building. What you should expect though are the everyday antics that are employed in each episode as we see personally though the eyes of the Data Processing Club and what they do. Although lacking a true purpose, the show sometimes raises eyebrows related to questions related to 'death'. It creates a strange tension on whether if the show has any sort of purpose beyond just random fun. Whatever the case though, it sure achieved curiosity; a good well job done at creating that to say the least.\\n\\n\r\nThe dialogues of this series might not be so memorable but watching the girls talk about their daily lives sparkles a smiles to my face. This could have different results for everyone but sometimes, it does drag out quite a bit. It seems to be repetitive and some of the jokes gets old. Additionally, the amount of yuri vibes gets stronger and stronger later on in particular with our adorable Yui. Her reactions is always predicable though as given her more straight out personality. But perhaps a problem of this show is the dragged out conversations. It's rather difficult to watch a random show such as this with it being length of 22 minutes each week for some people. Also, some of the jokes makes no sense. For me though, it's enjoyable but I'm not sure about others. Needless to say, the pace and randomness of this show might not be an appeal for everyone.\\n\\n\r\nAs for artwork, Yuyushiki adapts a lighthearted dose of comedy. The characters' designs are obviously designed to look adorable. Their moe eyes features reflects on the cuteness of the main characters. The backgrounds of the school and other areas are simple and straight to the point. In fact, some of the backgrounds are designed to reflect that silliness with cartoonish patterns and aesthetics.\\n\\n\r\nThe soundtrack is also simple. Both the OP and ED songs shows our main trio doing fun activities while making various silly poses in silly outfits. The voices of the characters showers the fun that the characters have. In fact, most of them are hardly ever angry or emotional. Rather, their laughter brings joy and that puts a smile on my face as well.\\n\\n\r\nAll in all, Yuyushiki is not just adorable but a show to relax and enjoy for viewers of all ages. Don't take it seriously. The show doesn't so there should be no reason to. What I do advise to do is watch Yuyushiki and think back when you had random fun with your friends at school. Maybe it won't be about randomly searching for stuff on the Internet, but it definitely brings back some nostologia at least for me. The series should be a crime to be this cute and adorable at many cases. At other times though, it does feel a bit more dragged out. Regardless though, this show was an enjoyable ride and I think one to at least give a shot at. It's not just cute, it's Yuyushiki.",
            "date": "2013-06-25T15:00:00+00:00",
            "helpful_count": 78,
            "mal_id": 102391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=102391"
        },
        {
            "content": "Yuyushiki is a feel good show and a half. At the same time I really started to get into this I was listening to a ton of David Bowie when I thought up of a weird analogy: Yuyushiki is to Slice of Life what Scary Monsters is to David Bowie's 70's career. It's a perfect combination of all the best elements with a fresh execution put into a neat package. Granted, I put Scary Monsters as the greatest Bowie album of all time but I don't put Yuyushiki as the greatest Slice of Life of all time, and Slice of Life Anime is no DavidBowie in itself.\\n\\n\r\n... Where was I? Oh, yeah. Yuyushiki was just something I eagerly anticipated and enjoyed each and every week. It felt familiar. It felt like Azumanga Daioh, it felt like Lucky Star, it felt like Hidamari Sketch, it felt like K-ON! and it felt like Yuru Yuri all at the same time. It was like a beautiful homage to Slice of Life Anime, and yet it felt like a new experience. Some will call this blatantly ripping them off, but it feels like it aspires to pay tribute to the genre in mimicking the humour, atmosphere and slight boredom of the aforementioned Slice of Life's.\\n\\n\r\nStory:\\n\r\nI uh... what should I say... it's a typical Slice of Life situation... I guess I'll give it 6/10.\\n\\n\r\nArt:\\n\r\nA lot of people were bothered by the art, but not me. I thought it looked nice and had plenty of nice colour and personality. To me a real sight for sore eyes it is.\\n\r\n9/10\\n\\n\r\nSound:\\n\r\nThe sound gives the nice subtle touches to the atmosphere. Love the opening and ending songs,. I absolutely adore Minami Tsuda's voice, especially her singing voice.\\n\r\n9/10\\n\\n\r\nCharacter:\\n\r\nCharacter is the most important part of a Slice of Life, and Yuyushiki has plenty of that. Yui Ichii feels a lot like another character Tsuda voices, Yui Funami, only she feels a little softer and easier to crack than Yui Funami. Yuzuko and Yukari perfectly compliment this character in their goofy antics, and together all three lead girls really feel like they have a real genuine and fun friendship.\\n\r\n9/10\\n\\n\r\nEnjoyment:\\n\r\nMuch like any quality Slice of Life. Sometimes you laugh, sometimes you'll love the atmosphere and sometimes you feel a content boredom watching it. All in all, just simple fun.\\n\r\n9/10\\n\\n\r\nSo that's all I have to say about Yuyushiki. It's everything Slice of Life Anime is. If that's your bag, then this is worth a go. If it's not your thing... perhaps you should stay away.\\n\\n\r\nOverall: 9/10",
            "date": "2013-07-12T07:32:00+00:00",
            "helpful_count": 52,
            "mal_id": 104993,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1455417.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Bristle",
                "username": "Bristle"
            },
            "url": "https://myanimelist.net/reviews.php?id=104993"
        },
        {
            "content": "Adorable pink hair idiot ✓ \r\nThe shy Tsundere ✓\r\nRich airhead ✓\r\nif I had a nickel... Ehh Hmm, That aside, Yuyushiki was exceptionally good despite the overused character types. I think my favorite thing about the show was the characters. Yuyushiki is full of common \"archtypes\" and have \"typical\" character personalities that are as stated before, overused. So I had a very difficult time at first, maybe around episodes 1-5 to get into the show because of this. That aside, what I found great about the characters was that it turned out to be one of those shows where despite their character types, the girls stillmanaged to maintain their own unique individuality, along with being really cute no matter what they are doing. They are likable for the most part, annoying at times however the characters redeem themselves every once in a while through hilariously well put comedic moments.\\n\\n\r\nThe story, plots, pretty typical. It's your average.. slice of life that focuses on the lives of three high school girls so not too much of importance when it comes to story or plot development.  Lastly, let me add that it can be said that you've probably already seen shows like this a little over 100 or so times however I want to say that if you do decide to give it a watch you'll notice that the characters in Yuyushiki stand out from the norm. Again, this depends on if you're familiar with shows similar to Yuyushiki.\\n\\n\r\nArt and animation in this show, I feel like it is lacking strongly in good character designs. However, after doing a bit more research via Google and... well the damn description on the page, I see that it's originally a 4-koma manga and depending on the artist most don't... well the artist I know like Midori Endō, Tozen Ujiie, etc don't care too much about character apperances as long as they look friendly and can have faces that look great during reaction scenes which is something that happens a lot in Yuyushiki.. \"reaction faces the anime.\" Actually, I think that title belongs to Nichijou... Mmhhh.\\n\\n\r\nMoving along I didn't care too much for the soundtrack, BGM, OP and EDs. Nothing stood out too me. Voice acting was great, seiyuu's did a perfect job bringing their characters to life.\\n\\n\r\nMy overall enjoyment of Yuyushiki was minimal at first however when I re-watched it this week it kind of grew on me. Lots of fun moments and more importantly friendship to go around, yes. Overall I had to give this show an 8/10 because it's one of those shows that become really heart-warming at times. In a way it reminds me of K-On! a group of moe girls just having fun just enjoying their youth. Give it a watch, and a chance, Yuyushiki is worth it.\\n\\n",
            "date": "2016-04-18T06:51:00+00:00",
            "helpful_count": 38,
            "mal_id": 216633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=216633"
        },
        {
            "content": "The schoolgirl comedy genre has become somewhat over-saturated of late, but it remains something I very much enjoy when done right. I approached Yuyushiki with mild optimism, not really sure how it would stand up to the better entires in the genre. After delving into it, I'm quite happy to say it does very well. It's a thoroughly enjoyable series thus far.\r\nIt looks nice. The animation doesn't seem cheap as some anime in the genre can at times. The character designs are very cute but not too overstated. The voice actors deliver the lines naturally and believably. The OP and ED are also quite charming,I find. It's a well made series. \\n\\n\r\nThere isn't much in the way of plot, but that's natural for the genre. Nevertheless, I think the setup lends itself well to the genre. The girls of the \"Data Processing Club\" spend club time surfing random things on the internet, which opens up the possibilities to even more topics for bizarre elliptical comic dialogues than the entirely aimless Amusement Club in Yuru Yuri, the anime this one most responds me of. Giving the cast of silly high school girls the internet to amuse themselves with proves to be an inspired way to expand upon just what can reasonably be discussed. Other than that, however, it's mostly the typical points in Japanese high school life we've seen other places before. \\n\\n\r\nThe characters make everything work though. They're very silly, but a whole lot of fun. Yukari is an adorable airhead. Yuzu is more excitable but equally ditzy and weird. Yui is the straight man of the group, but has her moments of silliness and really does seem to get along with her weird friends. Their teacher is also a very adorable, fun character. The other classmate characters aren't at this point as stand out, but they don't really have to be as it's content to stay focused on the main girls.\\n\\n\r\nFor my tastes, the show has a lot of great humor. If the jokes don't make me laugh outright they make me smile more often then not. The group dynamics are also pretty fun. Like Yuru Yuri, the anime isn't afraid to offer up lots of blatant yuri subtext, which to me is always a plus. I find quite a lot to like watching the series. Fans of other schoolgirl comedy anime should definitely check this one out too.\\n\\n\r\nUpdate: Having now completed it, I'd say Yuyushiki continued to remain quite the exceptional anime following the point at which I originally reviewed it. Watching the second half, it was easy to see just why the series works. It just all feels so genuine. The characters play off of each other so well and believably it's hard not to be charmed. It's irreverent and its joyful, and watching it it really becomes just infectious. It's the kind of show I could watch several times just to make me smile. I sincerely hope that, like Yuru Yuri, it is given a sequel. Highly recommended.",
            "date": "2013-05-27T00:05:00+00:00",
            "helpful_count": 31,
            "mal_id": 98579,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=98579"
        },
        {
            "content": "This is honestly my most favorite anime of all time, but it is definitely far from a masterpiece, even though I love it to death, I genuinely cannot give it more than an 8 (and this is a really biased and generous score).\r\nI found Yuyushiki through mountains of 音MADs that exist for this anime on Youtube and as a fan of Generic-4-koma-Slice-of-Life-with-3-to-4-Highschool-Girls anime/manga, I think this one's enjoyable to watch. The plot of the story (as if there is any) is just 3 girls in a club where they just ask weird questions, look up Wikipedia or just hanging out in or out of school.\r\nForthe main characters, we got Yuzuko Nonohara - smart girl with a funny personality, Yukari Hinata - rich and kind hearted airhead with a cute laugh, and Yui Ichi - the typical tsukkomi character (aka Best Girl). There is no main topic in each episode, it's just them going about their daily routine and having random conversations which lead to inside jokes and tsukkomi-boke moments.\\n\\n\r\nThe art style and animation is simplistic, nothing notable but I find that it helps make the characters themselves standout and be more memorable. \\n\\n\r\nSoundtrack-wise? LOVE IT \\n\r\nThe music matches the mood (\"Fresh\" is a good example) and each character specific song (especially \"TekiPaki\", use it as your alarm, trust me it works) is very fitting and memorable. The voice acting is also pretty good, they nailed each of the main character's personality and even made some pretty good meme-worthy materials (SEPTEMBAAA)\\n\\n\r\nSome minor drawbacks are that:\\n\r\n1. Unless you are an avid fan of 4-koma/slice-of-life, most of the gags are gonna be a miss because it's just 3 girls doing everyday things and laughing at random comments they make (IE: The \"potato\" scene, it's pretty good but I just didn't find it funny)\\n\r\n2. Some puns are pretty hard/impossible to translate over to English\\n\\n\r\nAside from having an amazing soundtrack, a small cast of really likable main and side characters, there really is nothing I can say to recommend this anime. It is without a doubt one of the most generic slice-of-life anime, but I can say that it excels in that genre\\n\\n\\n\r\nTL;DR\\n\r\nYou like slice-of-life/4-koma or want somewhere to start? I'd recommend this anime to fans of the genre and newcomers alike (and when you're done with that, go look up: OtoMADs of this anime on Youtube, you're welcome in advance)",
            "date": "2018-12-01T02:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 295023,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7597767.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PIZZACHEEZE",
                "username": "PIZZACHEEZE"
            },
            "url": "https://myanimelist.net/reviews.php?id=295023"
        },
        {
            "content": "Honestly, at first I was very wary about Yuyushiki due to the fact that the anime and story itself is really, really simple. But, I made the right choice in giving this anime a try. Of course as the majority of Animes focusing on girls in High School, you've got a crazy girl, a dumb and slow girl and a girl that is the most sane out of the three. Though their really isn't a development to the plot, it is very enjoying to be able to see all the misadventures of the three girls and the episodes are all very humorous. I recommend ithighly to those that are in the mood for some humor or want to get rid of their depression. Their really isn't much to say about this anime overall just the fact that it will make you laugh. Perhaps I am being too kind but I give Yuyushiki for now a strong 7 and look forward to watching the rest of the episodes.",
            "date": "2013-05-14T08:11:00+00:00",
            "helpful_count": 13,
            "mal_id": 97167,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1993280.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kev_Vigoroth",
                "username": "Kev_Vigoroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=97167"
        },
        {
            "content": "Yuyushiki is a comedy SoL anime about 3 high school girls talking about random topics, not much else to say about this series. \r\nStory: 5/10\r\nWhat story? It's a SoL anime, ain't much of a story in here. The episodes are mainly about the random conversations of the 3 main characters, one good thing is that the conversations feel natural or realistic to me, this could be a good thing or a bad thing, I found it quite boring because I don't find high school girls talking about random things very entertaining,  but I'm sure some people would find it enjoyable.\r\nArt: 6/10\r\n If you're likeme, the art doesn't bother you too much unless it's spectacularly bad or good. If you're not like me, I'd say the art in this anime is pretty average, nothing special to me. \\n\\n\r\nSound: 6/10\\n\r\nThe OP and ED song are fitting for an anime like this. Personally, I found the OP song catchy and fun, but it's nothing to write home about.\\n\\n\r\nCharacter: 5/10\\n\r\nThe three main characters are Yukari, Yui, and Yuzuko. Nothing much special about them, Yukari is your average airhead, Yui is the more normal girl among the two, and Yuzuko is your average hyper character. As for the background characters, I don't really feel the need to talk about them because they're not as important as the main characters.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI didn't really enjoy it much, mostly because I didn't find the random conversations between main characters entertaining, I mostly found them boring. The characters were nothing special, so I didn't really enjoy them too much either.\\n\\n\r\nOverall: 5/10\\n\r\nOverall, I found this show to be very mediocre, nothing outstanding or unique about it.\\n\\n",
            "date": "2013-06-21T03:44:00+00:00",
            "helpful_count": 11,
            "mal_id": 101781,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2141807.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/catfish24",
                "username": "catfish24"
            },
            "url": "https://myanimelist.net/reviews.php?id=101781"
        },
        {
            "content": "~Just kidding Just slipped out...~\r\nYuyushiki sat on my PTW list for a considerable amount of time.\r\nWhy? \r\nWell i hate to judge a show by its cover, but when i'm looking for possible anime to watch: the cover, blurb and some words from strangers are all i generally have for investigating...\r\nYuyushiki is a prime example of an anime that can't be fully expressed by words. At a glance, many will be deterred from the relentlessly rehashed premise of \"a bunch a schoolgirls being schoolgirls\" - combine this with a cartoon-esque animation style and a vibrant colour scheme, and yeah, you've got pretty much every Slice ofLife ever... \\n\\n\r\nIn terms of competition, Yuyushiki has to stand out above the rest with something unique, to really get credit where credit is due - and its because of this formulaic-looking layout that not enough people will get around to appreciating it  - so consider yourself one of the lucky 30,000 who managed to stumble upon this genuinely entertaining franchise! \\n\\n\r\nOnto the analysis...\\n\r\nI'm not going to lie to you, Yuyushiki is exactly what it advertises. It's a deadly simple slice of life concept - and so SoL haters: you've been warned!\\n\r\nI've always thought of Yuyushiki as a really refreshing take on life. By nature it's charming, and due to its frequent comedy outbursts - it's upbeat, entertaining, and will make you laugh - at least, it did for me...\\n\\n\r\nSomething great about it, is the way it accurately represents mindless real life thought processes and procrastination. While these are often wrongly deemed as insignificant, seeing the often chaotic and random nature of our minds presented in such a lighthearted manor, is really comforting. The spontaneity of the trio's actions actually adds some anticipation as to \"what are they gonna do next?\" (a seldom achieved attribute by a pure SoL) \\n\r\nEven though we can all be perfectly aware that no major plot-shaping events take place; Yuyushiki brings about a great casual, care-free atmosphere, making it easy to watch, and surprisingly addictive.\\n\\n\r\nWhat is it that has people coming back for more?\\n\r\nAlike most anime of the genre, Yuyushiki is character, as opposed to plot-based - now that's not to imply that they all have breathtaking back stories - because they don't, and yet their design is quite something to behold. It seems that Geneon knew what they were doing when they pieced the visible trio together... We've got \\n\r\nYukari - the lovable airhead, \\n\r\nYui - the more cynical subject to embarassment, \\n\r\nand Yuzuko - the spontaneous one...\\n\\n\r\nSimple, right? And it's this beautiful simplicity that makes the characters so relatable, and likable.\\n\\n\r\nTo you those may be just random names, but due to the realism in the chaos of the trio's conversations that make up the body of the show... To me, i feel like i know them personally, without having their life stories relayed...\\n\\n\r\nThe conversations that go on all seem true to life. \\n\r\nThey're always well integrated into the situation to flow seamlessly together. \\n\r\nThe best part is their intimate nature - no i don't mean intimacy...\\n\r\nYuyushiki incorporates a lot of charming details, and often uses verbal disclosure to add small, intimate, fragments to each character's portfolio - and so you get to know them, on a similar rate as to how they get to know each other.\\n\\n\r\nThe combinations of these methods... realistic characters, realistically crazy thought processes, and realistic converse, and dedicated SoL approach - makes Yuyushiki very relatable, enjoyable and relaxing. From this (on top of character attachment) -  the show strives to entertain, and does so with ease!\\n\\n\r\nI found that Yuyushiki wields an intimately charming method of life documenting, that i haven't seen since K-ON (which i adored). I've got to stick to an 8 for this one, as i would still have liked to see more character depth, and some sort of conclusion. \\n\r\nBut i digress... If you're a SoL fan, or looking for something PLEASANT, and carefree to watch after a long day's work - Yuyushiki is for you!\\n\r\n(P.S. That's a lot of \"u\" sounds)\\n\\n\r\n~Juuuust kidding Just slipped out...~\\n\r\n~Juuust kidding Just slipped out..~\\n\r\n~Just kidding Just slipped out~\\n\r\n~Just kidding Just slipped out!~\\n\r\n~JUST KIDDING JUST SLIPPED OUT!~\\n\\n\\n",
            "date": "2015-03-07T15:22:00+00:00",
            "helpful_count": 8,
            "mal_id": 181909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=181909"
        },
        {
            "content": "Work days can be exhausting. Solution? A light-hearted anime to help you unwind!\r\nUnfortunately, this isn't the right anime for me. It consists of three friends bantering and goofing off, which would be fine if they were witty and interesting individuals, but alas! they are dull as wallpaper. Their bantering is downright banal - in fact, the high point for me was the pun \"mochi-vated\". And I'm a person who LIKES banter!\r\nThe characters were: a normal, straight-laced kid; her two lesbian best friends who want to fondle her; and a big-busted teacher, who her friends also want to fondle. I am pro-LGBT, and it's annoying tosee lesbian characters used purely as fanservice/objects of comedy. I wish the creators had used more quirky, unusual, bizarre, and even grotesque characters.\\n\\n\r\n[In Secret Code: Ja sam zapravo odgledala samo dve epizode, ali ovi jebeni birokrati brisu moje komentare o serijama zatosto \"nisam dovoljno odgledala za pisanje\". Moram negde da priznam da sam samo odgledala dve (citav sat ovoga!), pa cu da napisem ovde i mozda ce neko da koristi Gugl Prevodilac. U ovakvim serijama, cak i jedna epizoda ti kaze sve sto trebas da znas.]",
            "date": "2015-02-07T18:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 179901,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4193825.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LadyMillenia",
                "username": "LadyMillenia"
            },
            "url": "https://myanimelist.net/reviews.php?id=179901"
        },
        {
            "content": "As far as I'm concerned, don't watch Yuyushiki if you're going to take it seriously. That's not the point.\r\nEverything is random, yet fun. Take this is as the main standpoint from watching it. Laugh at the humour of course, but don't treat it as something that's going to have a real story behind it. It doesn't. However this doesn't matter. It's meant to be relaxing to watch and if you're not going to see it this way, you're not going to enjoy it.\r\nEverything can be commented on positively. Although it isn't amazing there is nothing I can fault. Everything is just right, and what thewriters obviously set out seems to have been achieved in my opinion.\\n\\n\r\nYuyushiki is from start to finish, something you can enjoy without enormous expectations. There is nothing that makes it really stand out, but that's the reason why it does what it is meant to well. When you expect only what is presented in front of you every episode, you enjoy that episode to the fullest. That's Yuyushiki for you. It hides nothing. It is a simple, and fun series that you can enjoy without having to be disappointed at the end because of something not happening, or something like that. Stick with it, it's a pleasant surprise.",
            "date": "2013-06-25T14:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 102383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2314987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Reflex96",
                "username": "Reflex96"
            },
            "url": "https://myanimelist.net/reviews.php?id=102383"
        },
        {
            "content": "Boke and Tsukkomi: The Anime\r\nIt may not have many ROFL moments, but Yuyushiki gave me more sharp chuckles than any other anime I've seen. It kept a smile on my face through every episode. And the characters have that quality that makes you laugh just by looking at them. Not because they look funny, but because they have a certain quirky charm to them.\r\nI've heard the show likened to a group of crackheads formulating ideas and laughing at theirselves, and I'd have to say that's pretty spot-on.\r\nOf course, this is a slice-of-life, so don't expect much plot or any deeper meaning behind anything. Even thepremise of the show -- about girls being in a data processing club -- is just barely touched upon. This anime is really about three goofy friends and their often nonsensical conversations. More accurately, two goofy friends and their level-headed friend who attempts to bring some normalcy to the group.\\n\\n\r\nThough relatively tame in comparison to other \"random\" slice-of-lifes, the dialogue alone makes it pretty wacky. That being said, it's one of the most realistic slice-of-lifes out there. I could easily place myself in that group and laugh along with them, because I had friends just like them in school. The ones I questioned myself for being around, but still hung out with anyway because they provided so much enjoyment. Yuyushiki is pretty much the embodiment of those friends.\\n\\n\r\nI'll admit, around episode 8 or 9 I started to feel like I had seen enough and grew a little tired of it. You could very well watch the first 3 episodes and know enough about the show to write a review about it. But again, Yuyushiki is that group of friends I just couldn't let go of. Even in the final episodes I was still smiling throughout and enjoying the company of Yui, Yukari, and Yuzuko.\\n\\n\r\nSo if you're looking for a realistic slice-of-life with plenty \"hey, wouldn't it be neat if...\" conversations and knee-slapping gags (which, admittedly, is not everyone's cup of tea), Yuyushiki is the show for you. You might even learn a few random facts along the way.",
            "date": "2015-07-29T11:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 194628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4333545.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lizard23",
                "username": "Lizard23"
            },
            "url": "https://myanimelist.net/reviews.php?id=194628"
        },
        {
            "content": "Clever, Humorous, and Random.\r\nThose are the words that best describe Yuyushiki.\r\nIt doesnt have any story to follow at all, but the random events of 3 high school girls.  Its funny to see all the different facial expressions that they show when they are paranoid, excited, or just plain lazy.  Their laughing is contagious, and I laugh every time they Tehehehe... Because as they continue with their he-he-he's it goes up in pitch, and it ends as if it were a question.\r\nMost of the jokes are hard to understand, but when they do something funny, its funny.\r\nArt and sound were very good, because itwas funny to watch and hear all the different stuff that went on.\\n\\n\r\nCharacters were funny, and random, and thats what made this very funny.\\n\\n\r\nI enjoyed the hell out of it, because I would wait for the next episode with great anticipation, and hum the theme song every time i heard it.  I would laugh when they laughed, and would smile when they were plotting something.\\n\\n\r\nOverall it was very good to watch, and i enjoyed every bit of it.  Its sad to see it ending so soon, but every great anime must end.  The ending was great, even tho it was random as hell, and it felt like the true cherry on top was there.\\n\\n\r\nI Highly recommend it for when your looking for a good laugh.",
            "date": "2013-06-25T17:30:00+00:00",
            "helpful_count": 7,
            "mal_id": 102407,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1122179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DustPotato",
                "username": "DustPotato"
            },
            "url": "https://myanimelist.net/reviews.php?id=102407"
        },
        {
            "content": "\"Do you like towels? I love love towels! Love love.. Love love. Love love milk? Love love! Love love does sound good.\"\r\nI can't help but want to write a review for this anime although it hasn't yet been finished, Ii think there's enough material to create a pretty consistent opinion.\r\nThis is one of those light hearted animes that you watch when you're just taking a break, after you've seen some more intense things on TV, or just for you to relax and enjoy the pureness of anime with these loving girls.\r\nThe Story:\r\nThere's no story development around some concept, the episodes tend to be random andeach of them revolve around a series of topics from Blue Whales to Death (not in a very serious way of course, but it depicts the range of topics pretty well). This fits pretty nicely with these kinds of anime as this is not supposed to be watched in a marathon form where you watch all episodes in a row. This is for you to watch occasionaly. There's 3 main female characters and all of them with their unique personalities, they start attending highschool and soon start using the Data Process Club for all kinds of purposes, under the guidance of \"Mom\" which is how they start referring to their teacher as, and just make jokes and discuss random topics that always lead to humurous conclusions.\\n\r\nA bit like \"Yuru  Yuri\"? Maybe but not in the Yuri way but in the easygoing one, it's just overall enjoyable to wach these girls and their gags.\\n\r\nFor me it deserves a 7/10.\\n\\n\r\nThe Art:\\n\r\nThis was a bit of a let down, the character design in my oppinion is just not appealing, their heads are oddly shaped, their mouths apparently have all kinds of shapes and the head/body proportion is just overall not really fitting in today's anime standards, not that an anime has to follow those but to be honest the characters look a bit ugly which is such a let down for such a series that's fun and cute. But appart from the character shape, the colors are bright and cheerful and that really brings out the warmness of this show, it's a 6/10 for me.\\n\\n\r\nThe Sound:\\n\r\nNot much to say about this, the opening and ending themes are fitting enough and there isn't really much music in the actual episode so i can only judge the sound by those 2 criteria, since it wasn't an awful intro or ending it gets an 8/10\\n\\n\r\nThe Characters:\\n\r\nThe series gets all my points in this category. We have 3 girls, each with their own unique qualities, maybe a bit stereotypical but defenitely loveable ones that you know you'll enjoy in these types of show. We have Yui, the normal one who can't understand the other 2's ridiculousness but has a warming side to her and is that helpful type of character too. Then we have Yukari, the complete airhead which does really random things most of the times and half of those no one really knows why, you can't hate on such an innocent character, despite her being an airhead she can remember something from the far away past, except that something never fits with what they're talking about. Last but not least we have Yuzuko, the one that causes all the trouble and comes up with the weirdest topics or games to play, without her this show would not be complete and it's the combination of these 3 characters that makes the show good. You get indulged in their games and jokes and enjoy a nice episode about 3 girls in their humurous school life talking about the weirdest subjects. As far as Shoujo Ai, it is true the characters cnstantly say \"I love you\" (except for Yui) and they try to grope Yui as well (poor Yui) but it doesn't even get that far so this is not a crazy Yuri like show, rest assured (if this was worrying you) but it does have the essential girl love.\\n\r\nFor all these reasons the characters for me get a 10/10\\n\\n\r\nEnjoyment:\\n\r\nThis series so far has been pretty enjoyable, i love coming home on thursdays and watch the newest episode so i can relax and not watch something intense on TV, it's just simple and fun and it works fine.\\n\\n\r\nOverall:\\n\r\nThe show works and does what it is supposed to do, and although the art isn't the best ever the theme and the subjects in each episode just don't make you hate it and it's defenitely an anime you can watch 1 or 2 episodes a day and don't feel the need to watch it in a marathon.\\n\r\nMy overall score for this anime is a 7/10 which  is equivalent Good.",
            "date": "2013-05-31T15:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 99153,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1950132.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/IdleSheep",
                "username": "IdleSheep"
            },
            "url": "https://myanimelist.net/reviews.php?id=99153"
        },
        {
            "content": "I just can't describe how absolutely horrible this anime was for me.\r\nI like little sister anime, cringe with charm. \r\nTHIS however was cringe for the sake of \"comedy\" and they failed miserably.\r\nThey recognise their own stupidity and try to make it a Cligé \"oh that girl is dumb but cute\" moments and that is what angers me.\r\nthe art is pretty okay, nothing great. but the characters are dumb as a potato and not cute as they try to make them to be.\r\nPlease if you want to want better anime go watch \"Boku no pico\" i found that more enjoyable than this.\r\nJudge me how you want,i don't care",
            "date": "2017-06-17T19:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 250174,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4878915.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Falonthorne",
                "username": "Falonthorne"
            },
            "url": "https://myanimelist.net/reviews.php?id=250174"
        },
        {
            "content": "yuyushiki is really about making someone smile and laugh which is the true form of happiness,and the anime does a great job with that logic.,an anime with slice of life and comedy just like nichijou…the only difference is that yuyuhiki is a seinen anime and filled with more mature themes,so is this mature version of nichijou worth it..?\r\nContent- As of now the anime only has 12 episodes,with a possible second season eventually,Yuyushiki is based off a manga that uses the 4-panel design of comics as seen in many other mangas of the same genre. speaking of genre this anime is more of a peaceful animewith little conflict at all,and at times its just a playful joke or the characters annoying each other.Yuyushiki is a slice of life,that not only takes place in school but outside as well,some episodes aren’t even at school at all,it is also a comedic one,instead of a drama based anime,and lastly the anime is a sienen one,meaning it is for older audiences (mostly males) while nichijou was for younger audiences,so it is normal to expect mature themes in this anime,but thankfully its not filled with ecchi or crude humor and for the most part its safe to watch. The anime also contains some yuri jokes and a lot of randomness which can be enjoyable since it makes the anime unpredictable.\\n\\n\r\nPlot-  the plot is simple high shcool life,as in japanese high school the best times are from clubs so the main characters,yui the main girl who is smart with blonde hair and deals with the other two girls who always tease her,yuzuko the pink haired one who makes up most of the jokes,including the yuri ones.and yukari the blue haired who acts silly in a way like osaka from azumanga daioh. they join a club called the data processing club where they write down information even tho there is already a wikipedia.there the first in the club and so far are the only ones. Later in the anime more characters are introduced such as the teacher who is referred to as “mom” by the main girls,and a secondary group of girls who befriend the main group.\\n\\n\r\nMusic/voice-  the opening is standard and nothing special,not bad but not great,the ending song is good too,they made the opening hyperactive while the ending is slower paced,which is good when an anime does this letting you know that the anime is over.the anime also uses themes for characters as well which is also good and they can enhance the anime.  As for the voice acting,it is what you expect ,it is great and very well done.with yuzuko being the best,having changes in her voice to show her emotions or to mimic voices to create jokes.and yui for having her i’m always angry voice but knowing when to change it to happy or sad when needed.\\n\\n\r\nAnimation/Art- the animation and art seem a bit outdated and nothing compared to recent animes,so you may get the feeling this anime is from 2004 or something,however the art is great and can be detailed when needed. the anime also has a similar art style to that of nichijou and lucky star but still has its own unique style which makes it awesome.\\n\\n\r\nAppeal- its too early to say what appeal the anime has yet,but the animations can make for some great gifs,and various clips are on youtube,i think the anime will get slightly more popular over time but since the anime is also short it may not happen at all.yuyushiki can still be appealing if you just want a simple,but random anime that will make you laugh and enjoy.\\n\\n\r\nFinal opinion - if you are into slice of life like azumanga and nichijou then this is a good anime.the best i can say about it,is that its trying to be cute and mature at the same time.really good anime are actually only 12-14 episodes\\n\\n\r\nbut this shouldnt be the case with this anime\\n\\n\r\nthis anime has endless comedic possibilities and scenarios which can get at least 5 season,similar to polar bear cafe. which had a lot of seasons for a slice of life comedy.\\n\r\nanother thing i didn’t like is how fast the anime went in the timeline. the first episode they enter high school as freshmen,but a few episodes later they are on summer vacation,and celebrating new years and much later they finish that school ,so the pacing is a bit fast,in a way it felt rushed. which sadly stops the anime from becoming as great as nichijou or azumanga,hopefully the anime will get a second season in the near future.\\n\\n\r\nand as always\\n\\n\r\narigatou ^_^",
            "date": "2013-12-02T19:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 122379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3341903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ReimuNuggets",
                "username": "ReimuNuggets"
            },
            "url": "https://myanimelist.net/reviews.php?id=122379"
        },
        {
            "content": "A normal school life is a boring school life. But you will always have those friends who make it fun and interesting with occasionally going so far off the original conversation topic you don't even remember how it started or how it got so random. Regardless, it's a time you wont forget.\r\nThe story of Yuyushiki could not me more of a typical school slice of life story. Apart from the overly random pieces put throughout the anime, it could not be any more of a normal life story of the high school lives of the three main characters from the start of their first yearuntil the start of their third year. Nothing major ever happens and the entire anime as its filled with that of what starts out as a normal conversation and always ends up getting out of hand, sometimes in ridiculously humor filled ways.\\n\\n\r\nThe art style of this anime is a very basic, almost childish one as it's never anything too fancy or complex and everything is kept simple but fitting to the scene. Anyone other than main or secondary characters don't even have a hope of getting color to them and even then to portray different facial expressions they more than a few times will drop the color of a characters eyes or change it to a heavy gradient. Apart from this everything is cell shaded with only little to none in the way of tones for anything but afternoon scenes and clouds.\\n\\n\r\nMusic and sound also keeps a very childish feel to it as whenever sounds are played that aren't an object moving or being placed, they seem like something right out of a gag reel. The music when used always manages to keep a mellow mood unless one of the characters is going off on a random tangent that had nothing to do with anything else but for humor purposes. If anything it keeps the viewer calm and readies them for a laugh or a giggle when topic derailing happens.\\n\\n\r\nCharacter is one of a let down topic. We find out about how far back the relationship is between two of the main characters but not of the third. All we know is that they all knew each other before high school but how far back and how the final member came in is not explained. Other side characters are left with noting more than \"They are class mates\" leaving the viewer knowing little to nothing about most of characters in the show and are just expected to enjoy as is.\\n\\n\r\nOverall enjoyment wavers constantly as some episodes were slow and boring while others had a continuation of one - two knock out humor lines that span and entire episode, producing at least a chuckle from the viewer as they wonder what the hell are they even watching. A few times humor is attempted but is so poorly executed to the point where when it moves on you wonder \"What that a joke? Was that even meant to be funny?\" and this makes you miss out of the first few opening lines on the next scene/skit they attempt.",
            "date": "2014-07-01T04:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 149761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=149761"
        },
        {
            "content": "Occasionally entertaining dialogue between characters is a hallmark of slice of life series. In Yuyushiki's case, the series consists almost entirely of that. Compound it with the fact that characters are constantly either in/near school or in Yui's house, and you get a considerably static anime.\r\nEven in Lucky Star, commonly criticized for having bland dialogue between characters, or in Joshiraku, which pokes fun at itself for being made into an anime although it's a dialogue-heavy series; there are numerous occasions where characters are shown in environments that differ from the usual school/house setting (shops, school trips, camping trips, city trips, other outings, the beach etc.).The change of environment both presents new dialogue material to the cast, and gives something to look at to the viewer. \\n\\n\r\nIn Yuyushiki's case, changes of environment are rare and the dialogue stems from topics they research on the net, jokes between the characters, or everyday matters that characters happen to talk about. And about eight times out of ten, whatever the dialogue is devolves into Yuzuko flirting with/teasing Yui and Yukari laughing at whatever Yuzuko is saying (And Yui retorting at everything). Unless you like Yuzuko's out of the blue jokes and teasings, the typical Yuyushiki-dialogue can get old pretty fast.\\n\\n\r\nLeaving verbal content aside, the rest of the anime is largely attractive; in that  it has smooth animation, simple but cute character design, a lively soundtrack, and great sound acting (especially from Ookubo Rumi; the many random shouts of Yuzuko are very well done).\\n\\n\r\nWhat is also kind of a negative point in my opinion is that the cast is too limited. There are only 7 girls that get enough screentime, and the main trio takes about 85% of it. Given that they don't have so many character traits, this adds to the show's repetitiveness.\\n\\n\r\nTo summarize: you'll probably like Yuyushiki if you don't mind fixed environments, don't easliy tire of the \"tease-laugh-tsukkomi\" formula, and find absurd high school girl humour entertaining.",
            "date": "2015-10-21T21:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 201725,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1156747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Sombrefloe",
                "username": "Sombrefloe"
            },
            "url": "https://myanimelist.net/reviews.php?id=201725"
        },
        {
            "content": "I was a bit curious about this one. When I jumped on board, the first thing I noticed was how similar it was to Lucky Star. But, BOY, did that QUICKLY change.\r\nRight off the bat, the anime starts off awkwardly with the main protagonist, Yuzuko, being awestruck by a cat on a motorcycle. From there, the progression of weirdness slowly, but surely, finds its way to make you laugh your ass off right off the first episode.\r\nThe last anime I watched that was enjoyable right off the bat was Pani Poni Dash, so this anime ALMOST came close to perfect scores. But, upon further analysis,it still did not live up to the level of enjoyment I had from watching that anime. The weirdness is factored in very well, though. The characters make the anime so good that the setting almost does not matter, though for the setting they are in, it is simplistically detailed.\\n\\n\r\nYou have the aforesaid protagonist, Yuzuko, whom says so many random things that I hope you are not a very serious anime viewer to harshly criticize. Her very nature and essence breathes so much breathe into the anime that, without her, it would almost feel like a very casual slice of life experience. Despite her crazy nature, though, she is the smarted of her friend group...YUP. She is the most intelligent one, and actually has the most expansive vocabulary, too. When you hear her talk casually (which is rare), she actually says some pretty logical things at times. Hey eyes are frequently redrawn in comedic situations, with one of the versions actually making Yui go into a fit of uncontrolled laughter for about a minute of the scene when she gazed into the distance with them after Yui told her something. Try and see how many changes to her eyes you can count.\\n\\n\r\nThen, there is her (pretty much) best friend, Yukari, whom plays along with nearly ALL of her antics, but stole the show halfway through with her very unique style that is actually on a completely different scale from Yuzuko. It's not as crazy as Yuzuko's, but her airheadedness is different enough for you to call her a different character. Combined with her eyes being drawn in a way that I have not seen in an anime before, being unusually vertical, and drawn as two squares when she is confused, enjoying herself or is just in a trance; and you have the second funniest character in the anime.\\n\\n\r\nAnd then, there is the (most attractive to the majority of viewers) plaything, Yui, whom has so many idiosyncrasies that you could probably annoy her by breathing in a slightly different way. She is ticklish everywhere, of which Yuzuko and Yukari take advantage of on frequent occasions; and she is easily annoyed by randomness, which Yuzuko puts into her game quite a bit. She is the most logical one in the entire group, usually stopping Yuzuko from getting too crazy by hitting her, but usually does not hit Yukari for acting similar due to their childhood together. But, I do not wish to elaborate on that story as that story was very cute and I recommend you watch it yourself. Yui shares a few eye patterns that are similar to Yuzuko, but she never smiles in any of them. Speaking of not smiling, she is probably the most mellow in their group and almost always has a neutral expression on her face, occasionally smiling whenever everyone else is or actually manages to enjoy some of Yuzuko's craziness; even to the point of the aforesaid uncontrolled laughing.\\n\\n\r\nThe anime feels like it exclusively centers on the three characters, given everyone else is a silhouette or a detailed sketch without color; being one of similarities to the aforementioned Pani Poni Dash that I loved about it.\\n\\n\r\n(REMAINING REVIEW MIGHT SPOIL SOME OF THE EXPERIENCE)\\n\\n\r\nThen, their teacher, Yoriko, steps into the light and, if you picked up on the character formula already, she is fully drawn! So, as soon as you see her show up in the scene and notice her being colorized and detailed from the other background characters, you already spotted another character that will be involved in the anime! All recurring characters are still drawn, even if they are in the background, so keep this in mind when looking for new characters.\\n\\n\r\nI forgot to mention this in the beginning, but the three protagonists joined a club, the Data Processing Club, though they process data in very hilarious ways and offer little to no benefit to the school for their \"research\" duties. They draw a summary of the day, usually of a word, sentence or fact they thought was funny, or just something that annoys Yui. The teacher then comes in to check on it and gives a rating occasionally on what she thought of the summary, hinting that the club may not necessarily be needing to gather actual data, or that the teacher is an airhead.\\n\\n\r\nBut, do not worry, the fun does not stop here. At first glance, there is a repetitive formula of just the three girls and, occasionally, their teacher. But, if you were doing what I said before, you probably noticed a certain girl standout out of the many background sketches. This girl is one that wishes to be friends with Yui, but is scared of Yuzuko and Yukari (for good reason), and, at first glance, she seems to look like a minor character, but thanks to her having a voice actor and being fully drawn, this is a hint that she is not!\\n\\n\r\nSimilar to Yui, she is also pretty mellow. However, she is in a more cheerful manner; usually always smiling and is extremely innocent. She is the head honcho of her group, though not in terms of comedy. She really does not standout at all enough to be the star of her group in the comedy department, of which you know this anime delivers very heavily; but she is used as Yuzuko and Yukari's plaything occasionally.\\n\\n\r\nShe, too, has two of her own friends that, once AGAIN somehow, have very unique personalities. Well, one of them, anyway. One, Kei, has a generic tsundere attitude and is nothing too special, though she adores Chiho quite a bit; the aforesaid happy shy girl that I forgot to give the name of. She is usually pretty pessimistic, always frowning, but she has eavesdropped on Yuzuko's stories a few times and even interrupted one of them as she came up laughing, exclaiming how dumb her story was and wanted to know what they were even talking about at all.\\n\\n\r\nThe third girl in their group, Fumi, ultimately takes advantage of Kei's love for Chiho and overall pessimism iin the most hilariously unimaginable way that I have never seen in an anime before. Her personality alone should make her the standout comedy of the entire group due to her eyes almost never being drawn in full detail, combined with her jokes and timing almost always leaving me with a laugh, if not in tears! Her story is not that significant at all and her sole purpose is to add a ton of flavor to her group, which she does very successfully.\\n\\n\r\nOnly seven characters in all, a very light amount for an anime, but they might as well serve as a normal amount of characters due to how well their personalities standout from one another, with only a few being pretty simple.\\n\\n\r\nI was talking mostly, well only, about the characters, but this anime pretty much IS the characters. The setting itself matters not, as you will only be focusing on the wild antics of Yuzuko, the aiding to them of Yukari and the various reactions from the rest of the cast; namely, Yui.\\n\\n\r\nIf I had to go on about anything else, the background music in this anime is very simplistic, but it actually fits right into the atmosphere of it all! It is simple enough for you to hear it and composed well enough to enjoy it. It really does aid everything that goes on in the anime very well, though it would sound unfitting to listen to it after you watch it.\\n\\n\r\nIf you are not someone that can handle extreme amounts of comedy, then this anime is not for you. But, if you want something that is a combination of Pani Poni Dash and Lucky Star in the best imaginable way, I think Yuyushiki might very well be what you are looking for. This one has a very remarkable spot in my list due to its random nature being very different from most anime I have seen and it will not fail to entertain even the most pessimistic viewer. Because, truth is, this anime has NO dull moments. Pretty much all of it is pure comedic delight. I wish it had another season! But, it only did just begin two years ago, the manga is still going and YuruYuri proved that you can still make a new season years after another.\\n\\n\r\nSo, next chance you have to watch a random comedy, give this one a go. You will not regret it at all.",
            "date": "2015-10-25T00:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 201913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=201913"
        },
        {
            "content": "Hmmm... I'm not sure what should I think of this anime.\r\nI stumbled upon Yuyushiki searching for something similar to my high school/SoL/comedy favorite, Azumanga Daioh. So I gave this a shot. And I watched the whole thing through. Does that mean I liked it? Well... let's say I did, but...\r\nWe have three high school friends: Yukari, Yuzuko and Yui. Yui is mature and rational (well, most of the time), but the other two are everything but that; they're silly, random and pretty weird. They talk about most random things, that sometimes lead to pretty banal conversations.\r\nOkay, so what did I like about Yuyushiki? First, it'sthe cuteness of the girls, especially Yukari, who's my favorite. Then, it's their ability to make every conversation silly and funny. Even when they talk about dark themes such as death, it doesn't seem as dark as you think it should be.\\n\\n\r\nAnother thing I liked is the educational part. Being members of the Data Processing club, the girls reveal some interesting information about various topics (planets, animals, food, etc.) that you might not know.\\n\\n\r\nWhat did I not like? Definitely the fact that this anime sometimes gets too weird and/or random for my taste. At times it's just awkward. The relations between the characters, both main and supporting ones, aren't clearly defined. The yuri element is also present in some episodes, but it's very mild, and in my honest opinion, completely unnecessary. And that comes from me, a yuri fan.\\n\\n\r\nSpeaking of character relations that aren't defined, their teacher also confused me a bit. She's their teacher, but they keep calling her \"Mom\"? I'm not sure how common is it in Japan, but to me, it seemed a little odd.\\n\\n\r\nSo, in short: not bad \"cute girls doing cute things\" anime for those who like that sort of stuff. If you don't mind lots of weirdness, randomness and general silliness, give it a shot, you might like it. And you might learn a thing or two about planets or animals on the way.",
            "date": "2015-07-21T14:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 194010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4704003.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/daky-kun",
                "username": "daky-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=194010"
        }
    ],
    [
        {
            "content": "\"potato\"\r\nAt a glance this show appears to have a huge hole in its non-existent plot, and is just a group of three high school girls goofing off. BUT to continue to have this view is a mistake. This show (no doubt not being able to fulfil  everyones needs) made me feel amazing.\r\nIt was such a pleasure to come back into the world of 'yuyushiki' and just goof off myself. I feel that a standard type of review (story, character, art, plot, etc) doesn't fit this series. It is obvious that the producers have thrown a curve ball into the anime world just to seewhat happens. And, in my opinion, they results are wonderful. \\n\\n\r\nThe three main characters: Hinata Yukari, Ichii Yui, and Nonohara Yuzuko will no doubt put a smile on your face.\\n\r\nGuaranteed.\\n\r\nWhat this shows lacks in actual plot devices and techniques, it more than makes up for in sheer enjoyment. The most important thing to the show itself, is its characters. The three live in their own world, and literally do not care what other people think of them. I find this to be a key feature that drew me into the show in the first few episodes. \\n\r\nA standard act of strange behaviour is usually accompanied by a rain of apologies and down-cast expressions, but these girls (especially Nonohara) completely disregard these notions and act out of impulse only with the intention of brightening up the days of their friends. \\n\\n\r\nEach episode follows its own theme or idea. The three girls are part of the 'data processing club', but as the name doesn't suggest, they just Google search random things as they think of them. It is in this way that each episode has a 'direction' that the characters base their behaviour around. These ideas range from whales to potatoes to stars and many other topics. \\n\\n\r\nAn immensely enjoyable feature of this anime is its art. Personally, the character's faces really did it for me. Even with such simple styling, they made me giggle and, more often than not, laugh out loud. I knew that each new episode I watched I would undoubtedly have a smile on my face. \\n\r\nWho can deny a show that will undeniably make you happy? What kind of person doesn't want that. \\n\\n\r\nLooking for something refreshing?\\n\r\nWatch Yuyushiki.",
            "date": "2013-11-12T22:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 120099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3291441.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Bheaze",
                "username": "Bheaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=120099"
        },
        {
            "content": "I have made a video review of Yuyushiki, available here: https://www.youtube.com/watch?v=Y0KQY24homk\r\nBut for those of you not interested in watching the video, here's the text-version of my review:\r\n    At first glance, Yuyushiki seems to be about as standard as they come. There isn’t much of anything to the characters’ personalities outside of the basic Boke/Tsukomi slice-of-life relationship. And there’s nothing exciting or interesting about the setting, which really is just a highschool. But as I watched more, its unique traits began to shine through. Yuyushiki has a special sense of humor in the slice-of-life genre in that most of the jokes come rightout of the dialogue between the characters. Most shows rely on putting their characters in bizarre situations or using an over-the-top animation style, but in Yuyushiki, the funniest scenes are just the characters sitting around a table and talking. A conversation may start ordinarily enough, but they quickly devolve into absurdity. Sometimes they’ll come up with really weird ideas, sometimes they get strangely profound, most of the time though, they just end in giggle fits over completely meaningless things. The dialogue is certainly weird and hilarious, but I was amazed to find that it was also uncannily realistic. The conversations sound like conversations between real people...or…at least real highschoolers. They go on tangents, they forget where they were going, they make small, inconsequential, remarks, they develop their own inside jokes. And there is never any sort of “end goal” in their conversations. They’re just enjoying talking to each other, regardless of how absurd or off-beat the conversation gets. I’ve never seen a show more accurately portray the sort of conversations I tend to have with my friends. \\n\r\n\tOn top of the excellent dialogue, Yuyushiki boasts a great visual style. The character designs are unique and cute, but not excessive. The jokes are often accentuated with the help of some snappy editing, and the characters are endlessly expressive. Yuyushiki is particularly fond of playing with the eyes of its characters. Nearly every joke is accompanied by someone doing something weird with their eyes, which often makes me laugh more than the dialogue itself. It’s also clear that Yuyushiki put a great amount of care into the way the characters move. Sometimes it can be as simple as their body language while talking, but even the more movement-oriented scenes show a remarkable fluidity and realism in the animation. In particular, the legs and walk-cycles in this show are exceptionally well-animated. Which is just as well really, because the skirts are also exceptionally short. On that note, the show is relatively light on fan service, but not completely devoid of it. I suppose that could be either a pro or a con depending on your personal preference. Really, for a dialogue-centered show, I suppose it’s only logical that most of the fan service is in the dialogue. The group’s conversations will occasionally drift into lewd topics, but you rarely actually see much of anything lewd.\\n\r\n\tYuyushiki is not without its faults, of course. There a lot of jokes that rely on word-play in Japanese. The subtitles I had tried their best to explain some of them. But there were still a large amount of jokes that simply failed to make it over the language barrier. Or at least I assume so. It’s either that, or some of the jokes just make literally no sense. By far my biggest complaint about the series however is the fact that the teacher in the series has the nickname of “Mom” from the students. I thought I’d get used to it, but the awkwardness of calling a teacher “Mom” continued to make me cringe slightly every single time throughout the whole series.\\n\r\n    All in all, Yuyushiki isn't the best slice-of-life out there, but it is definitely not the worst. If you're a fan of slice-of-life and are looking for your next fix, then I highly recommend you watch Yuyushiki.\\n\\n",
            "date": "2016-02-28T15:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 211899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925961.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JpnsCultureGreg",
                "username": "JpnsCultureGreg"
            },
            "url": "https://myanimelist.net/reviews.php?id=211899"
        },
        {
            "content": "Yuyushiki looks like a cookie cutter SoL anime on the surface and in many ways it kinda is. High school setting, main trio is the classic combination of a straight man, rich airhead and a goofy airhead, simple designs that reflect these traits and so on. Despite that however I think it's a very enjoyable and relaxing thanks to execution and sense of humor.\r\nA lot of the time whether you find jokes funny and girls cute will make or break this type of show for you. Humor here mostly consists of wordplay, yuri innuendos and just how amusing idiots perspective on things and train ofthought can be. It's all fired at you at a steady pace so even when the joke doesn't quite land the show moves fast enough to the next one to not get bored and get a laugh. Aside from that there are some low key scenes more focused around the vital cute girl doing cute things parts of SoLs which can be pretty nice. As I said it's a cookie cutter show in many ways but despite that some of the scenarios and jokes while not far from normal SoL affair, can still be refreshing and clever. \\n\\n\r\nDirecting tied it all together quite nicely and even though credits show a lot of different people directing the show it doesn't really feel like there's much of a change. There's always a nice flow from one joke to another and interesting shots to make it nice to look at in the meanwhile. One thing I found weird though is that even though I was engrossed the whole way thought and enjoyed the show, whenever I checked the time it felt like twice as much time should've passed which probably speaks about density of content more than anything.\\n\\n\r\nArt while not that outstanding compared to dozens of other SoL shows is still really nice. It's consistent, colorful and just plain nice to look at. Animation is less of a factor for this genre but it's there and used primarily for moments heavy on character animation and are done without excessive exaggeration which personally made these personal moments feel nice and genuine. Music is not particularly notable but it's mellow and upbeat which helps to build a relaxing mood.\\n\\n\r\nOverall if you like cute girls, slice of life and comedy there's no reason not to give this a change.",
            "date": "2016-09-02T11:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 228122,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4063579.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gundroog",
                "username": "Gundroog"
            },
            "url": "https://myanimelist.net/reviews.php?id=228122"
        },
        {
            "content": "I really liked this anime more than its slice of life predecessors, and I feel like there's reason behind that.\r\nStory: 7/10\r\nThe story is your usual slice of life anime plot. The plot was in the synopsis, so I'm not going into detail. The story has its usual setting at school, and in a school club, to be exact. I wouldn't suggest skipping episodes, as new characters appear throughout.\r\nArt: 7/10\r\nThese character designs are pretty adorable. They match the characters' personalities. This anime has a very happy feel, and the lighter colors and cute characters help establish that.\r\nSound: 9/10\r\nI really liked the opening of this anime, andthe fact that the seiyuus provided the vocals for the songs in the anime only made it better because they were able to put their own character's voice tones into it (if that made sense). The voices really matched their characters.\\n\\n\r\nCharacters: 8/10\\n\r\nMan, I loved these characters. Yuzuko never failed to make me laugh, Yukari was just adorable and at times funny, and Yui was able to deal with their crazy antics and balance out the group while still being a friendly person. Most of the characters were probably homosexual, but hey. It brought some pretty awesome comedy to the playing field.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI really enjoyed this anime because it made me happy and gave me good laughs throughout. I honestly don't think that would be very good dubbed because some of the jokes are fueled by puns that are only understandable when hearing them in their own original language. I think I'm probably going to watch a few more episodes of it sometime soon. I'm hoping for a second season!",
            "date": "2013-11-23T13:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 121191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3328183.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KyubeyDesu",
                "username": "KyubeyDesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=121191"
        },
        {
            "content": "what I like about Yuyushiki anime:\r\n-Slice of Life - Comedy combo.\r\n-good humor, very good humor.\r\n-it's slice-of-life-ness is very good.\r\nother aspects:\r\n-Story (7/10): it's a slice of life! not much story, but that's how a slice of life should be!, if it has a deep story, I would lower it's score.\r\n-Art (8/10): not bad, really, not bad...\r\n-Sound (7/10): I can't say much since I don't pay attention to it's sound. well, they're not bad, if they are bad I should have noticed it, and if they are very good I should have noticed it too. at least, it's got a good opening song.\r\n-Character (10/10): it's good, verygood actually, but, that's not what makes this anime great.\\n\r\n-Enjoyment (10/10): well, I just enjoyed this anime very much.\\n\\n\r\nwhat makes Yuyushiki a great anime is it's great humor, and also it's great slice-of-life-ness. I mean, this is how a slice of life anime should be. I have watched many slice of life anime, and Yuyushiki is number 1 in terms of slice-of-life-ness.",
            "date": "2014-04-02T14:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 138357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1212417.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/silvarion",
                "username": "silvarion"
            },
            "url": "https://myanimelist.net/reviews.php?id=138357"
        },
        {
            "content": "Yuyushiki is, without a doubt, the masterpiece of this generation. Now, I may be biased in that statement, as I may enjoy this series over all others, but there is very good reason for this. I also do believe myself to either be the most, or least qualified to write a review, for I have watched this series, no less than 15 times.\r\nLet's start with the bad parts. The art is not perfect. While the art style is perfect, sometimes the drawings on Yuzuko's could be more refined and fit her character more. This is the only minor complaint I have. Otherwise, the cheerful andplain but not boring art keeps the series alive, but does not distract so much as to take away from the experience.\\n\\n\r\nThe story is exactly what one might think of it to be. Three girls in high school, making jokes and laughing, along with a healthy but not excessive amount of yuri undertones. There are small bits of plot development that create some sort of theme throughout a few episodes, but, there is not enough story to distract from the anime. See, one should be able to pull up any episode of this anime at any time, and be able to laugh at the high quality jokes and puns. That is the epitome of a perfect anime -> For each episode to be perfect, with or without another.\\n\\n\r\nIn the sound department, our three characters do this thing I like to refer to as a \"Yuyu moment\", in which one person will say a word or phrase with an interesting flow or sound, and this phrase will be repeated as the intensity rises. There is without a doubt no greater an application of sound in any anime I have watched. The Yuyu moment is the pinnacle of audio engineering, and will, without fail, make the watcher laugh and enjoy every single time.\\n\\n\r\nCharacter wise, Yuyushiki contains the basic 4koma characters, however, using the dynamic of Yui and Ai, creates enough contrast to liven up any scene and create hilarious situations. Yukari's \"Dreamy and aloof rich but humble and clueless\" character has been magnified so much so that she has become her own character, apart from the others. Yuzuko however stays true to her character, and allows one to stay grounded in the average 4koma humor. This sharp contrast of interaction between Yui and Yukari and Yui and Yuzuko is without a doubt ideal, and I personally have never seen a dynamic as perfect as this.\\n\\n\r\nFinally, enjoyment. There is not much to say. As I watch each and every episode of Yuyushiki, I find myself either smiling or laughing the entire time. There is no form of enjoyment that exists in the world other than watching yuyushiki for the first time, and for some reason, the 10th is just as good at the first.\\n\\n\r\nOverall, this is the pinnacle of anime. Without a doubt the perfect comedy. If three girls making stupid puns and jokes for 4 hours sounds fun to you (as it should everybody), I would recommend you (I am recommending everybody), to watch and enjoy this masterpiece of animation and humor.",
            "date": "2017-01-09T14:34:00+00:00",
            "helpful_count": 0,
            "mal_id": 237888,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3489179.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/imnoteddy",
                "username": "imnoteddy"
            },
            "url": "https://myanimelist.net/reviews.php?id=237888"
        }
    ]
]