[
    [
        {
            "content": "Yahoo! I get the first review... Of this... Anime... Suddenly I feel way less excited.\r\n\"My skin melted, my powers disappeared and suddenly I was nothing but a shadow, weaker than the most humble of ghosts.\"\r\nTo get the technical staff out of the way, the anime is a three minute short with lively animation, funny music exploring completely sexual themes. You could say it's Nekoyama's deranged psychotic sister... Or maybe brother. At this point I can't tell.\r\nWell to begin with, we see an insanely cute girl assaulted by 2 Yakuza members, trying to make her pay off the debt her parents had left behind by sellingher body. One even wants to do her on the spot. Pretty ordinary staff for Japan's standards. Until the other Yakuza guy says \"Dude, you know that's a guy right?!\" \\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nWell, the anime already crushed one of my dreams, that sure didn't take long. As you have it our protagonist is a high-school trap. He is also disturbingly familiar with crossdressing and being sexually harassed. \\n\\n\r\nBut suddenly the student council of his school arrives to save the day! Consisting of three girls whose names&stereotypes you won't bother remembering they beat the Yakuza members (again, pretty typical staff for Japan) and rescue the protagonist in order to recruit her as the council's mascot and to have something to harass (oh yeah, all 3 are major perverts). They discover the trap but decide to recruit the protagonist nonetheless, making it (I refuse to call that thing a \"he\") act as the council's dog, in exchange for paying off its debt. Obviously part of the job is practically fanservicing everyone in school and leaving the \"best-of\" for the student council. They also make it announce in front of everyone that its gender is male (highly questionable).\\n\\n\r\nSo let me make things clear: We have 3 horny high school girls that were looking for yuri harassment, fell for a trap, and then entered an S&M exhibitionist relationship with said trap. \\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nDo you realise on how many levels of f£%$ed up we are here?\\n\\n\r\nThe second episode, introducing the rest of the notable cast actually made my soul sink even deeper into despair than the first had.The tired protagonist goes back home where he's greeted by his cute immouto (younger sister) wearing only her bath towel and rubbing herself on him to comfort him. Well, perhaps things aren't as bad as they looked in the sta it's a trap, isn't it?\\n\r\nApparently crossdressing and looking more feminine than the females is in the family's genes.\\n\\n\r\nAnyway, as the protagonist finds more and more ways to get sexually assaulted by everyone regardless of gender, his little sis... Brother, meets someone who has sworn to replace the current student council and therefore save the protagonist from constant humiliation. The head of the public morals commity... A LOLI! Oh, the most wonderful of sights to behold in an anime where the protagonist is a trap. Whoever has read my previous reviews or knows me irl knows that I have a certain weakness to lolis (as in,  I absolutely adore them). And she is exactly as all lolis should be. Slightly tsundere, incredibly cutely shy, absolutely, 180 degrees, washboard-level, completely wallish, flat, with an adorable mini skirt, with the cute striped panties that hide a tiny bu...\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nSON OF A BITCH!! It wasn't enough was it? You just had to ruin the loli too!\\n\\n\r\nThe rest of the episodes are filled with chances for the protagonist to give fanservice to various people, with the ending of the most recent one (ep 4) being truly disturbing.\\n\\n\r\nIf you liked Boku no Pico or enjoy watching messed up things try it out.\\n\\n\\n\r\nThis is a continuation of the review above, 11 episodes have been released by now. I had thought that the series couldn't get anymore disturbing. Boy was I wrong...\\n\\n\r\nAt the end of each episode that passes the viewer will experience... Revelations to the protagonist that he rather enjoys being treated as a female. You could practically say that with the ending of each episode its gender changes more from \"undefinable\" to \"female\". And I won't lie, that's disturbing as f\"$%. Also disturbing as f£%^ is how it was revealed that the maid of the public morals committee, a busty blonde (maid: my second fetish, ranked right after loliconnesss)... Is a dude with an overstuffed bra... Yes, there was actually another trap... Mere words cannot begin to describe the psychological trauma of having BOTH my dreams crushed so mercilessly. Oh and the protagonist's sister's (...) friend which appeared to be a boy always hiding his face? It's a girl crossdressing as a boy.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n One can only raise his hands to the heavens and scream to whatever twisted god allowed the creation of this abomination... \"WHAT THE F£%K?\"\\n\\n\r\nAfter watching episode 12: 1)Men who are men are rapists, that's today's lesson. 2)Women who are women are cruel inconsiderate jerks. 3)Men who are women are the only pure people in this world (...yes I find it as rediculous as you do). 4)If you quit the student council WHY ARE YOU STILL CROSSDRESSING?!",
            "date": "2014-08-01T13:26:00+00:00",
            "helpful_count": 77,
            "mal_id": 154765,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=154765"
        },
        {
            "content": "If you read my other review before, well nothing much changed, I say pretty much the same stuff, I still feel for how it is, and I still have my similar opinion.\r\nAnyways....\r\nHimegoto, is a gender-bender anime that came out in the Summer 2014, and was one of the 'shorts' anime where it's like a few minutes or so. While watching this anime I couldn't really say I really liked it or enjoyed it a lot, even though I really really like the gender-bender genre. Seeing other animes like Ouran Host Club, Ranma 1/2 (didn't finish), and other ones like that one filler episode of LittleBusters! was great to watch, but not really Himegoto.\\n\\n\r\nThe story is about a boy named Hime Arikawa who is forced to join the Student Council and to cross-dress. As he joins he is basically the dog for it, or shall we call, the b*tch for the student council. I mean like basically he was for the entire series, because our guy is pretty submissive. Hime just falls into the student council's hands and they do WHATEVER THEY WANT. MHMM...anyways...\\n\\n\r\nWhen it comes to the art, I'd say it's pretty normal...nothing great or bad, it's okay I'd say. Like they do make characters cute at those times etc. As for the sound, I actually like the OP and ED, it's not amazing, but it's okay to good. \\n\\n\r\nAnd as Anime is weird as it is, we all accept how it is.\\n\r\nFor me, there's few minor problems towards to show, some in my opinion I did not like and some was okay. Fan-service may be a huge turn off to the audience as most of the fan-service is more towards Hime, who is a guy, and well, you'll see some bulges and undie-shots.....(the feeling where this may be loli, but it's like OH WAIT, IT'S A GUY, SO IT'S TOTALLY FINE)\\n\r\nAlso, some people may like submissive character, I'm honestly not the biggest fan, but it's okay....\\n\r\nWeirdest thing I'd say from the show is how both genders fine him really attractive. Like to the point, GUY WOULD RAPE HIM...LIKE, THEY LIKE, I DON'T CARE, IT'S GOING TO BE DAIJOUBOU, HUEHUEHUEHUEHUE.....\\n\r\n._.\\n\\n\r\nEntertainment wise though, I actually enjoyed many parts rather than getting creeped out. There are many parts that are funny because of the gender bender, which was something I was looking for.  :D Also, may be considered spoiler, how you see it....I also liked the unexpected gender benders tho'! xD\\n\\n\r\nWell, I give this anime a 5.5, because nothing much stood out to me, but entertainment was okay-good. If you like the review you can press it was helpful, if you didn't like it or didn't agree you can press it wasn't helpful, but if it wasn't helpful, doo tell me why, I'd like to try to get better at reviewing ^_^ \\n\r\n-pop102\\n",
            "date": "2014-08-05T23:55:00+00:00",
            "helpful_count": 69,
            "mal_id": 155473,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3233653.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pop102",
                "username": "pop102"
            },
            "url": "https://myanimelist.net/reviews.php?id=155473"
        },
        {
            "content": "This anime is a catastrophic attempt at humor, and a callous one with rose tinted glasses towards what is veritably a whole slew of sex crimes. Yes, he is apparently a male who does initially to consent to crossdressing to pay off a debt, though it seems the student council gets off to putting him into embarrassing situations, knowing full well the consequences that will entail, which is usually at least a panty shot, if not worst, without his knowledge beforehand or his consent. \r\nFor all the episodes I watched, I kept thinking \"Where is the punchline?\" Then I realize that the situations are thepunchline, and I shook my head and realize that is a bottom of a barrel title that indulges in the same tier of cruelty as Watamote without the deep introspection and characterization of someone like Tomoko. It is just a gag anime who thinks the idea of a man, or a cross dressing man, being harassed and shamed, is a novel idea in itself, and one likely to garner laughs. \\n\\n\r\nWell woop-de-doo, look at how many people think this is a decent anime, or even a progressive one. Ha, seriously? This anime does nothing other than show the student council doing things to Hime that go far beyond reasonable work contracts, even for someone is paid to crossdress (Especially so), and his consent or lack thereof, made obvious by his expressions and pleads episode after episode. The student council are responsible for creating situations that would allow such public displays of embarrassment in the first place, with morally unreasonable and insidious actions that were intended to do so. There is no punchline. I am suppose to find all this funny in nature, like the slapstick of The Three Stooges. No, it is cruel and a backwards trivialization of men or cross dressers in general concerning sexual consent.\\n\\n\r\nI am not opposed to the idea of humor surrounding a serious topic of sexual assaults, but all this anime amounts to is a mix of cringe comedy and sadism. No meta commentary, nothing but the situation itself. It slaps on happy music while Hime is in fact, sexually harassed, assaulted, and at least one point, nearly raped.\\n\\n\r\nPoint being that because he is a cross dresser, because he is a man, that I am suppose to take this humorously. Seriously? Can we stop laughing about poop jokes and realize that this problem concerning these demographics, male or crossdresser, are very real, and should be taken with some serious caution?\\n\\n\r\nI mean, if the genders were reversed, would anyone praise it?\\n\\n\r\nIf there is anything to praise about the anime, it is the last few episodes, beginning with Hime nearly getting raped, something that the show acknowledges for what it is, for once, while the student council sits by and does nothing, whereas Hime gives them a satisfying \"reason you suck speech\". \\n\\n\r\nThis is the only reasonable part, because it actually paints the student council as vicious voyeurs and Hime as someone who demands respect. Though it is not 2 episodes later that Hime forgives them, and all is happy.\\n\\n\r\nWait, what? You acknowledges that 18-san and friends were willing to let Hime get raped just so they can film it, yet he forgives them? Freaking forgives them? What the hell?\\n\\n\r\nI am sorry, I need a break. Honestly, if you like this anime, I am not sure I can respect that opinion, but to paint it as a mark of progression for such people is not only to stymie progress, but to contribute to the issue's regression.",
            "date": "2017-04-01T19:06:00+00:00",
            "helpful_count": 30,
            "mal_id": 244295,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2250133.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/PeripheralVision",
                "username": "PeripheralVision"
            },
            "url": "https://myanimelist.net/reviews.php?id=244295"
        },
        {
            "content": "Warning this anime has more Dangos than there are in Clannad so you have been warned\r\nHey everyone it is I MrRecklessPenguin about to do the impossible and try to review Himegoto critically.  Well, let's get this penis bulge on the road shall we?  Done by studio Asahi Production Directed by Yanase, Takeyuki, script written by the mastermind behind Robot Girls Z.......\r\nTHE STORY\r\nHimegoto is the story Hime Arikawa who is a second-year student at Shimoshina High School. One day Booker Dewi-err-i-mean-um Hime is forced to pay a large amount of debt but Hime is saved by the three girls of the student council afterbeing chased down by horny debt collectors. As payment for this debt, Hime has to spend his high school life dressed as a girl.  From there we encounter penis bulges larger than the Eiffel tower and more traps than an Indiana Jones Movie.\\n\\n\r\nNow I do understand this anime isn't serious.  In fact based on enjoyment I'd give the anime a 7/10.  But lets go on the more critical side and actually analyze this story.\\n\\n\r\nFor the most part, Himegoto delivers comedy, not through well thought out jokes though.  Himegoto mostly relies on shock value as well as throwing Love Muscles at your face.  Don't get me wrong, I love my Main Vein, but they overused the Tallywhacker jokes so much that sometimes the jokes became old and staler than Dominoes Pizza.  The show is fun though, don't get me wrong, I couldn't imagine Himegoto with a story, lie how I can't imagine Jay Leno without his chin.  But basically if you keep reusing the. Trouser Snake jokes, the quote on quote story and comedy become overused.  Also the anime likes to through in traps and when i say traps I mean this anime is basically trap service.  Tom and jerry would have a field day in this anime.  Every girl you think is a girl is probably a dude so when watching this anime I'd advice you to keep your hand away from your Baloney Pony.\\n\\n\r\nBut there is some light to be found within the last 2 episodes, the series builds up with Hime keep on getting inda tortured by the student council and decides he has had enough with them and leaves which brings me to the characters\\n\\n\\n\r\nTHE CHARACTERS\\n\r\nHime is the only character that gets a shred of development and in a short anime that's to be expected.  He in the last 2 episodes becomes sick of the torturing by the student council to the point where he stands up for himself and says I'm sick of it and I'd rather be treated better.  And girls who are watching, please keep in mind, we aren't talking about 50 shades type of torture, no no, that's ummm something I don't want to talk about so I'll adjust the crop around my mouth.  The torture includes normal things Japanese students do like taking pictures of him in different sexy outfits, and having him be a part of a beauty show. Anyways, this helps give Hime a special touch rather than just having his One Eyed Monster center of attention all the time because my god, I saw more bulges from him than there are flabs on Honey Boo Boo's belly.\\n\\n\r\nAlbertina II is part of the student council is actually a manga artist and is legitimately a girl with an actual vagina.  She's ummm, interesting to say the least, to say the most she is more self conscious of her flat chest than Jennifer Lawrence is with her money tits.\\n\\n\r\nUnko is another ACTUAL girl from this show and is a part of the student council.  She's just very energetic and fun like how Susan Boyle is in bed.  She's just a fun excited character, that's all.\\n\\n\r\n18-Kin...Yeah, that's umm her actual name.  She's the one who always starts Hime's torture and is well in short a pretty schemish character.  All I can say is she's one of the bustiest of the show so she equals out the boob to Salami ratio in this show.\\n\\n\r\nKaguya is Hime's sibling.  Guess what, she's actually a he...Yeah, big shocker.  He is nice to see onscreen and adds to the comedy, literally I laughed way too hard when he was introduced so i had to applaud the anime for that.\\n\\n\r\nAnd there is Oda who is....Also...A..Trap.  You know this anime could've been a Saw film and there wouldn't be a difference, traps and torture, yeah seems about right.\\n\\n\r\nSo the characters were fun but just 2 dimensional, nothing real about them.\\n\\n\\n\r\nTHE ART/ANIMTAION\\n\r\nThe Art for the show is cute but a little rough around the edges for it's character models.  They sure do love to draw them bulges though.  They drew more bulges on here than there were flaws in George Bush's Presidency.  The animation is very choppy though and inst that great.  But for a short like this it gets the job don\\n\\n\\n\r\nTHE SOUND\\n\r\nAs for the Ost, haha what ost?  The music in the show at points sound like something I'd hear in Mario.  The soundtrack isn't special at all, it fits but it's pretty bad and not memorable at all.  you're better off listening to Captain Underpants Pizza Party than this.\\n\\n\r\nSo All and all I enjoyed Himegoto a lot, it knew what it wanted to be and it delivered.  But as a critic i must say this show has more problems than the Kardashian family.\\n\r\nBut what I can say is the comedy was pretty funny and it had me laughing\\n\r\nSo giving the story a 3\\n\r\nCharacters a 2.5\\n\r\nArt/Animation a 3.75\\n\r\nThe OST a 2\\n\\n\r\nHimegoto gets a score of 2.8 without enjoyment and with my enjoyment of a 7 gets a score of 3.65 for a reccomendation of watch it for Man Meat.\\n\\n\\n\\n\\n",
            "date": "2014-12-29T10:43:00+00:00",
            "helpful_count": 46,
            "mal_id": 175039,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3349065.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RecklessPeggy",
                "username": "RecklessPeggy"
            },
            "url": "https://myanimelist.net/reviews.php?id=175039"
        },
        {
            "content": "Himegoto is a short anime with 13 episodes, 4 minutes each and most of it deals with male trap fanservice and jokes that are mostly about cross-dressing.\r\nStory: 2/10\r\nHimegoto begins with the main character, Hime, in a quite bad situation, when the three girls of his school's student counsil come to his rescue! But it's not going to be that simple. In return for their helping him, he has to become the counsil's ''dog''. And that's were the story ends and the trap fanservice begins!\r\nCharacters: 2/10\r\nApart from the protagonist, Hime, the other 3 important characters are the three girls of the student counsil, 18-kin, Unko andAlbertina II (yeah, those seem to be their actual names), who do nothing, but continiuously put the protagonist into embarrassing situations. \\n\r\nThe rest of the cast doesn't really matter, since they are all male traps (with one exception of a female trap!) who are just there for awkward fanservice as well.\\n\r\nEven though this anime is just a short and is meant to be taken as a comedy, the fact that so many of the students have cross-dressing issues makes me wonder: Are there no parents around? What about teachers? Someone? Anyone? No...? SOMEBODY, PLEASE, HELP THEM!\\n\\n\r\nArt: 5/10\\n\r\nThe art of Himegoto is the kind of art that suits a short anime like that. It is simple and with nothing really special. There are also plenty of pretty panty shots, yayyyno....\\n\\n\r\nSound: 5/10\\n\r\nThe music is just ok, I guess, not much was expected from shorts anyway.\\n\\n\r\nEnjoyment: 2/10\\n\r\nI can't really say that I got any enjoyment while I was watching this, even when the scenes weren't kind of appalling. You might only enjoy this if you really like watching traps or something.\\n\\n\r\nOverall: 2/10\\n\r\nAnyway, you may find this review a bit harsh, but I guess it's a matter of opinion. You know, whether you find the whole ''traps everywhere'' concept intresting and funny or not. \\n\r\nYou can give it a try if you have some free time and want to watch something short that doesn't require much focus and thinking and see for yourselves if it was enjoyable, or not. Although I would recommend you to not even bother checking it out.",
            "date": "2016-04-13T09:07:00+00:00",
            "helpful_count": 24,
            "mal_id": 216306,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5083261.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Melody",
                "username": "Melody"
            },
            "url": "https://myanimelist.net/reviews.php?id=216306"
        },
        {
            "content": "For an anime with 4 minute episodes, it is safe to assume that reading reviews for Himegoto will not result in anything much being ruined except maybe the punchline of a few jokes. \r\nHimegoto is currently airing, but at episode 11 I can confidently say I have a feel for the series. Our main character Arikawa Hime is chased by debt collectors and is about to be sold off into the sex industry, before the rest of the main cast come to his rescue. These 3 are part of the student council, and are hugely rich. They decide to pay his way out of debt(from the kindness of their heart) and take him in as the school council's dog. \\n\\n\r\nThis is about as far as the plot goes so far. The rest of the series is basically the day-to-day life of a school full of crossdressers and/or perverts. It's by no means realistic, so if you want an idea of life in Japanese schooling please do not watch this anime! It is however a fun and interesting look at life in a school that is run by a team of perverted high schoolers.\\n\\n\r\nThe characters themselves are very well established considering there are only 4 minute episodes. Each one is visually very unique, and their personalities are all individual. The wants and aspirations of each character is consistent and their speaking patterns are also consistent.\\n\\n\r\nThe art style is simple and pleasant, with interesting and varied backdrops which do not swallow the characters with their colouring or line work. The characters themselves are animated very well, with a lot of movement and the effects of physics being displayed in simple ways like uniform creases or hair bounce. It is wonderfully composed and a delight to look at.\\n\\n\r\nThe humor itself could be described as shock humor I suppose, with the random spontaneous nature of scenes and punch lines that smack you in the face by coming far out of left field, but it is genuinely amusing to watch. It is packed full of interesting characters that work well together in comedic situations. It will make you laugh, but can not be equated to humor like Nichijou which is much more intentional and feels very different.\\n\\n\r\nIt is not hentai, but does have a lot of trap exposure in the chest area. Technically SFW, but a lot of scenes would not impress your boss if he was looking over your shoulder on your average work day. This show is definitely for older audiences, at least 18 for most countries. That being said, it has not yet got any on-screen sex scenes, nor does it have many intense sexual harassment being shown. It is sometimes implied, however, or even threatened by characters to one another. \\n\\n\r\nThe sort of audience this anime would most likely appeal to are those who have few boundaries, and no problems with \"trap\" characters being put into awkward situations or appearing in scenes with heavy sexual overtones. There are a lot of people who will refuse to watch Himegoto as it can appear to cross many boundaries, especially in the Western World. However, if all you want from an anime is an enjoyable, even sexy short show to watch inbetween study sessions or anime marathons, Himegoto is the anime for you.\\n\r\nIt has already been subtitled by many groups, and I highly recommend supporting the official release when it finishes airing.\\n\\n\r\n[This has been my first review written for this website, please be kind if there is anything I need to fix!]",
            "date": "2014-09-20T00:45:00+00:00",
            "helpful_count": 21,
            "mal_id": 161125,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778657.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Isischan",
                "username": "Isischan"
            },
            "url": "https://myanimelist.net/reviews.php?id=161125"
        },
        {
            "content": "Every dude in this show is a girl, every girl is a dude. The whole show is a trap, this curious predicament really makes a man wonder, are traps really gay? is it really so wrong to be attracted to a drawing of a girl that happens to have a bulge between its legs where in reality there should be none? these are questions a man must ask himself, as he watches a show such as Himegoto. Sir William Smith once said \"It appears, in fact, from this, as well as from the extant fragments, that the first book of the work contained a generalaccount of the origin and arrangement of the universe. The second book appears to have been an exposition of the nature of numbers, which in the Pythagorean theory are the essence and source of all things.\" this perfectly arranged bundle of words with no meaning, perfectly encapsulates my feelings toward the show, a bundle of things thrown together for laughs, with no real meaning towards them. There is nothing original here, and yet i cannot look away, like a trainwreck is persists my mind and penis, as i sit here confused wondering whether its really ok for me to fap to this or not. According to legend,  Pythagoras' followers threw the man who discovered irrational numbers off the boat, as it really made no sense in their day and age. Similarily, i want to throw myself off a boat, for taking so much time out of my free time to write this, when really it doesn't matter in the slightest. I did ironically enjoy it though, no not the boat thing, i cant swim. I meant the show, irony is the spice of life they say, now you may be wondering who out there actually says this, well i do, silly face, and therefore everyone else will as well, because my word is law. Ironically i dont actually believe any of what i just wrote and neither should you. Watch the show for all i care, but if a member of the student counsil tries to dress YOU in girly clothes against your will, you say no, and get the heck out of there, cause that is No Good.\\n\\n",
            "date": "2017-08-30T06:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 256539,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3467245.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ribbreaker",
                "username": "Ribbreaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=256539"
        },
        {
            "content": "Story:\r\nThe only thing more disgusting than this animation is that there's someone who actually created this. It's horrendous in every sense, completely implausible and unrelatable to anyone, and exploitive material for the most depraved minds. I hated the fact that I went into this blind, and I also am having complete second guesses about my personal rule that \"I must finish what I start.\"\r\nThe 'story' doesn't have any other purpose than to excite the viewer in the most disgusting of ways, and it doesn't matter that they replaced a female with a male for the majority of these 'action shots.' This sort of exploitive materialis disgusting regardless of who is at the helm. It's 100% gender neutral, at this point. I feel terribly sorry for the animation team that would rather create something worthwhile and the musician who had to create an OST for a work with no inherent value.\\n\\n\r\nMy critique on the story is so tangential because there is no story, and nothing matters at all. The end of this work is a punch in the face with existentialism and I cannot recommend it to anyone. You don't even have to read the rest of this review. Just avoid this anime like the plague.\\n\\n\\n\r\nArt:\\n\r\nThe animation is fairly good, and I appreciate the fact that, despite it being a 3-minute per episode production, backgrounds were somewhat varied, even if it was a boring school setting just like every other work out there.\\n\\n\r\nNothing felt disproportionate, and while we get some ridiculous phallic physics, everything else seems to move rather naturally. Also, characters look unique and expressions are, while abused like the plague, somewhat varied.\\n\\n\\n\r\nSound:\\n\r\nOne of the voice actors sounded like their voice was thrown through a modulator. However, I think that was me just perceiving it wrong. Everyone else was fairly good.\\n\\n\r\nOST was hackneyed but, I mean, it works.\\n\\n\\n\r\nCharacter:\\n\r\nNobody is realistic, everyone follows tropes. In other words, nothing original and nothing interesting. You won't get anything special out of these guys. Their types are boring and predictable.\\n\\n\\n\r\nEnjoyment:\\n\r\n...\\n\\n\\n\r\n((If you liked this review, check out my other reviews by going to my profile and clicking the 'reviews' tab. I review virtually all anime and manga I find!))",
            "date": "2016-07-09T12:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 223576,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655715.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Paraturtle",
                "username": "Paraturtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=223576"
        },
        {
            "content": "As, I've finish watching this omake............I'm guessing that what animes were called that only runs for a maximum of 4 mins, ok, I just gonna get straight to the point, so here are my ratings for this omake:\r\nWarning, contains slight spoilers. \r\nGood 7:\r\nStory: Himegoto or Secret Princess is a gender bender and the first one I've watched, I'd probably say that it was quite unique, when the story plot focuses on a girly boy who was left with a mountain of debt by his no good parents and has to be the student councils's dog since they're the ones who had settled it, now itmaybe a kinda of Cinderella thingy, except in this case the guy went from the frying pan to the fire kinda of a problem That he has to dress as a girl, that to me was something that I find funny.\\n\\n\r\nOverall: Well, such uniqueness did delivered this anime well, since at first I may have been annoyed by the Guy's pussyness and yet got lodes of laugh as get's himself to a lot of awkward situation that his masters (Student council members) put on him, but, for this anime to be called \"Himegoto\" or Secret Princess doesn't really jive with this omake, and if I were the original creator, Norio Tsukudani, I'd probably title it \" Okama  de Sentokai\" or the cross-dresser in the student council.\\n\\n\\n\r\nPoor 3. \\n\\n\r\nArt: Ok, so I kinda like that Hime Arikawa is a crossdresser and so as most of the public morals as cute, but I also want to see Hime wearing a boy's uniform, fortunately it never happen, in fact he should be wearing a boy's school uniform in episode 12, let's not for get that he quit the student council in that episode, for that I hereby declared this anime's art as poor, co'z I'm disappointed to not see his manly side.\\n\\n\\n\r\nVery Good 8.\\n\\n\r\nSound: I like the seiyuu who did Hime, 18kin, Unko and Kaguya's voice, what I really love was the opening song, so the score is for the opening song.\\n\\n\r\nDecent 4.\\n\\n\r\nCharacter:\\n\\n\r\nHime Arikawa, may seemly be annoying for being a pussy, frankly there were time that I would like to hit him on the head, but it was his girly side that has balanced out my annoyance for him, so it was one of the raeson why the character category deserve a 4.\\n\\n\r\nNow for the student council like 18kin, Unko and Albertina II, they my biggest annoyance which is one reason why I can't give this character category a high score. Basically them putting Hime in such appalling situation was pretty much unbecoming of a student council, also for the two members of the student council to be 18, I guess I can't never understnd why this anime director  Yūji Yanase have to portray them as 18 years of age, I don't about you, but shouldn't high-school student of that age be gradates already? I'm thinking that anime director  Yūji Yanase may have been a repeat student. Eh whatever, even so, them student council did add up to the comedy genre of this omake, which is another reason why this category should be \"Decent \" enough.\\n\\n\r\nFair 6.\\n\\n\r\nEnjoyment : Thought, I may have given this omake's overall a \"Good\" score, it wasn't really that enjoyable since there were situations that irritates me to see Hime to be this dumb and a pussy, though  the anime was funny, my reaction to it is mixed between this omake's comedy and my disappointment for Hime, but seeing him having his first kiss with 18kin that probably was one moment that I should give this category a fair and that the way I enjoy this omake, so should I say more? \\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-10-02T11:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 163297,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=163297"
        },
        {
            "content": "Himegoto is an enlightening piece of modern masterpiece that provides insight into the biases of society.\r\nEpisode 12 has undoubtedly a few of the most emotional scenes in animation history. The poignancy is unparalleled by any other. Me and a few homies cried for hours before resuming masturbation. No wonder battle-hardened Himegoto fans sneer at the childish themes of \"Your Name\".\r\nAll the way up to the final episode, the student council has been intentionally depicted as an oppressive and corrupt force that exercises their dominance through power and wealth. The characters embody TV (especially anime) cliches that seemingly deem the show as \"tasteless\". Yet brainless normiesare unable to fathom the intricacies of bland characterization, which absolute draw attention to the ingenious plot line.\\n\\n\r\nWhile I am not a hardcore feminist, I am still admire the efforts put in by the creators outline the polarity of control that exists between genders. It saddens me that no one else experiences that sharp melancholy. Dongers out for Hime, boys.\\n\\n\r\nThe story constantly repeats situations where the gender roles are reversed. However repulsed audiences may be, one cannot judge art through a narrow and confined perspective. If an alien species is observing Earth from afar, they would deem this as the peak of human evolution. \\n\\n\r\nOn the outside, Himegoto seems like a show full of fan service, appealing only to fans of trap characters. Yet upon closer investigation, many would find a carefully-crafted critique of authoritarian regimes and gender norms.\\n\\n\r\nMoments such as Episode 12's (again, one of the greatest) molester sequence will go down as animation's most romantic scenes.\\n\\n\r\n-Stunning",
            "date": "2018-12-17T03:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 295940,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7199587.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 10,
                    "sound": 4,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FructIango",
                "username": "FructIango"
            },
            "url": "https://myanimelist.net/reviews.php?id=295940"
        },
        {
            "content": "Alright, so Himegoto is a gender-bender anime, that detail is something that caught my attention before I even knew about this series given I'd seen images of the protagonist around the web a good bit. Once I'd given this anime a chance, I was mildly amused at the show for...around three episodes, but by the end of it I can't say I enjoyed it all that much given that it kinda played it's gimmick out by the last episode. \r\nAlright, let's look at the plot\r\nEpisode 1: the plot starts off with the trap protagonist getting harassed by some guys because his parents supposedly travel allaround building on debt, so with him being their son he is victim to harassment. But after an encounter with the oh-so generous student council, they decide to \"protect their student\" by paying off his parent's debt, but in turn make him join the student council to be their \"toy\". After this happens, the show just uses the whole \"he has a penis\" thing as much as it can. The student council almost forcefully gets him involved in a series of emasculating activities, one in particular being having him put on girl clothing most of the time & others being something that has to have him show off the fact...that he has a penis. And those things happen. For the rest of the show.\\n\\n\r\nThere was only one moment in this where it could've taken a small step somewhere, and that was near the end, where Hime is getting upright harassed & almost raped by two dudes and the student council sits there and watches up until the disciplinary committee stops it. At that moment Hime seemed to finally get the message that they were clearly just using him almost entirely for their own sake, but of course to end the show with a happy ending, everyone makes up after they save him from another perv in a park because now they apparently think they were friends the whole time without showing much sign of that, and happy ending. They at least make it look like the student council got the message to stop soloing on Hime and ease off on em in the end, but still, the show had almost no progression.\\n\\n\r\nAs for the art & the OST, there isn't anything to say, it's just basic stuff you'd find in your average anime: the art looks just fine and the OSt isn't supposed to have much of a role in this, being a short series of course.\\n\\n\r\nThe idea of humor in this show is to put a male in the position that girls in your average anime would or could end up in at some point: panty-shots, wearing skimpy clothing, that kind of stuff,  but that felt like that was all this had going for it because nothing but moments of situations of such would occur.\\n\\n\r\nOther than the student council, the others aren't much of a big deal. I mean, you learn that the supporting characters are also entirely a group of traps & they have this little rivalry with the student council, but that's it.\\n\r\nThe student council members themselves also don't have much going on other than the fact that they're the only primary characters who are actually the gender they claim to be.\\n\r\n18 is the vice-president, and the one who is the most into the idea of playing with him,\\n\r\nUnko, is kinda just there, even though she is the president\\n\r\nAnd Albertina, the only one with at least something to go with her character is a popular manga author, but she only got one episode where they explore that.\\n\\n\r\nAnd that's pretty much it. I don't think this show was particularly interesting, I mean it was a decent little series that maybe some will get a quick chuckle or two out of, but it isn't really something interesting enough for you to care about after you've sat through it all, as I'm sure you'll forget most of what you'd seen in it anyway other than the protagonist. I'd rate this show with maybe a high 5.",
            "date": "2018-08-12T12:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 286292,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6038145.jpg",
                "scores": {
                    "animation": 0,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Asasphinx",
                "username": "Asasphinx"
            },
            "url": "https://myanimelist.net/reviews.php?id=286292"
        },
        {
            "content": "A while ago I wrote a review for the series \"Shishunki Bitter Change\" which acted as a deconstruction of what would happen if two people had their genders unintentionally changed by playing the premise realistically, exploring the psychological ramifications of living in someone's else's body that is not your own and in a completely different gender. It was a good series overall, though some may wonder what this has to do with Himegoto. \r\nIn Taoism, there is a symbol known as the \"Taijitu.\" More well-known as the Ying-Yang, it is a symbol of duality. Everything has an opposite which compliments each other. For war, thereis peace. For sadness, there is happiness. For every Shishunki Bitter Change, there is Himegoto, a show that is quite awful and very, very creepy. \\n\\n\r\nThe plot premise is simple. His parents had a lot of debt and being the assholes they are, they left the debt on the main character Hime Arikawa. Pursued by loan sharks, he's bailed out by the head of the Student Council. Because somehow the Yakuza pales in comparison to a bunch of high school students, am I right? They are also inexplicably able to pay off the debt, but in exchange for Hime becoming their cosmic plaything by passing off as a girl. And thus begins an exercise in masochism as he is forced into many questionable situations. \\n\\n\r\nTraps as they are called are often played up for comedic purposes. Understandable however. After all, comedy is awkward. Finding out that a beautiful girl is actually male can also be awkward with little prior warning as well, and as such it is a natural fit. Comedy is what Himegoto tries, but it instead aims for masochism and downright abuse by the hands of the Student Council as they force Hime into incredibly exploitative situations in which he's downright abused, objectified, and near-rape scenes. Instead of his predicament being played for drama, it is instead played up for comedic purposes. If you're 21, here is a fun (if you like being drunk that is) drinking game: Take a shot every time you see a panty shot of Hime. You won't survive. And he's not exactly being consenting with this either. That's probably one of the big issues I do have with this whole ordeal. \\n\\n\r\nIn High School DxD (a harem infamous for copious fanservice) the main character Issei literally wants a harem, and is incredibly perverted. However, he's not exploitive. Rias allows Issei to copiously grope her with her consent, and the same goes for most of the girls in his harem. It wasn't an issue since both parties were fairly comfortable and on board with whatever zany antics Issei wanted to indulge himself in. In Himegoto however, he has no desire to crossdress. Kinda. He's initially on board with him crossdressing so that he can pay off his debt. It goes further when he's also forced into embarassing situations that he is very clearly uncomfortable with, and as such the audience is uncomfortable when the show goes like \"Hey, you want to see another panty shot of this guy? No? Too bad! Even if he doesn't like it, he's still cute right?\" \\n\\n\r\nI think it would have been interesting if they took the premise seriously. How would the life of a Japanese male teen look like if he continually went to school crossdressing? How would that affect his social life? His relationships? His psychological state? These questions aren't really explored here. I know that the premise is different, but these are still topics that could have been explored. Though even if it would have been explored, it probably wouldn't have mattered considering how everyone else is either a girl, or a guy who crossdresses as a girl. \\n\\n\r\nSigh. \\n\\n\r\nIt's a very cheap series overall. Little substance to it, very creepy and exploitative. Sexual harassment like this is passed off as something arousing. I can't really get the appeal of this show when the cute guy who looks like a girl is treated horribly. I'm not a masochist either. And I doubt even masochists will like this. \\n\\n\\n",
            "date": "2016-10-07T13:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 231270,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5183208.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/_Sofi_",
                "username": "_Sofi_"
            },
            "url": "https://myanimelist.net/reviews.php?id=231270"
        },
        {
            "content": "Helped me with my intro C++ programming class. I learned about allocating memory on the stack as well as appending nodes to the tails of linked lists. If there were to be a second season I would like them to cover Huffman trees as it is something that I am looking forward to going over in my discrete math classes. Overall I believe every CS major should partake in this 10/10 masterpiece. Seeing the spillage has awoken me.\r\nHelped me with my intro C++ programming class. I learned about allocating memory on the stack as well as appending nodes to the tails of linked lists. Ifthere were to be a second season I would like them to cover Huffman trees as it is something that I am looking forward to going over in my discrete math classes. Overall I believe every CS major should partake in this 10/10 masterpiece. Seeing the spillage has awoken me.\\n\r\nHelped me with my intro C++ programming class. I learned about allocating memory on the stack as well as appending nodes to the tails of linked lists. If there were to be a second season I would like them to cover Huffman trees as it is something that I am looking forward to going over in my discrete math classes. Overall I believe every CS major should partake in this 10/10 masterpiece. Seeing the spillage has awoken me.\\n",
            "date": "2018-04-01T03:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 276230,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7113868.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sparf",
                "username": "sparf"
            },
            "url": "https://myanimelist.net/reviews.php?id=276230"
        },
        {
            "content": "This is a comedic series about a trap.\r\nNot too much to say about it. It's sort of one dimensional in that most episodes are basically about hime being exposed or embarassed about being a trap. Still, they are pulled off well enough to be enjoyable. There are other jokes as well, but they're not the main focus; they're more witty one-liner type ones. Also, there's a decent amount of trap fanservice if you're into that. First time I've ever seen panty shots of guy's bulges. I think this anime would get a lower score, but I haven't seen much stuff about traps, so that givesit some uniqueness. That said, it's not the type of anime you can marathon. Most I've done is 4 episodes. \\n\\n\r\nThe series also had hidden potential. Over time, hime goes from being very against the idea of crossdressing to being ambivalent to clearly enjoying it. That could've been explored indepth. 18+ is interested in him so there was romantic potential as well. Almost all of the characters had a lot of potential for being fleshed out.  It's a very big shame that it was only 3.5 minutes long and not made into less of a comedic series.\\n\\n\r\nBeing 3.5 minutes per episode, it's not a massive investment to try it. I'd recommend this to anyone who likes traps or wants to check out something different.",
            "date": "2018-02-23T15:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 272266,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3128533.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/oappo",
                "username": "oappo"
            },
            "url": "https://myanimelist.net/reviews.php?id=272266"
        },
        {
            "content": "\"There are no women in Yugioh, only men! Sexy men!\" This also applies to Himegoto (maybe or maybe not excluding the sexy part...) Basically, everyone is a guy, sorry everyone \"IS A TRAP!\" (oh my god what an original joke!)\r\nStory: I'll give it a 5.5/10 for story, so like a 6/10. It's not, *bad*, but it isn't exactly good either. More of a so so, I did like the premise when I heard about the not gay story of traps though.\r\nArt: The animation is fluid, but simplistic for the most part. 6/10.\r\nSound: It's 4 minutes of a sorta comedyish anime, so it doesn't have thebest time demonstrating its soundtrack. 5/10, cause I like the OP and ED songs.\\n\\n\r\nCharacter: I actually like the like 2 female characters the best, and they aren't really impressed upon much (the characters as a whole). It's closer to every character has a character trait and that defines their existence. 5/10, almost a 6.\\n\\n\r\nEnjoyment: I guess like... a 6/10. It wasn't bad, per say, but it wasn't the best thing out there. It was enjoyable though.\\n\\n\r\nOverall: A 6/10. This show is not bland overall, and can be fun to watch for the most part. It really uses its short episodes to its advantage, as this would wear real thin real fast if it was elongated into a couple full episodes. In the end though, I will say that I did not consider this anime a waste of time.",
            "date": "2018-02-05T01:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 270699,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6559723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Springball64",
                "username": "Springball64"
            },
            "url": "https://myanimelist.net/reviews.php?id=270699"
        },
        {
            "content": "The quality of the show doesn't matter if you enjoyed it. That's what I believe. Yes, Himegoto lacks any sort of plot and has completely static and forgettable characters. Yes, it contains a lot of \"casual\" sexual assault throughout the entire series, which obviously isn't right. I very much enjoyed it, however, though that's probably just because I'm a fan of the cross-dressing genre. The OP and ED are super catchy and once you view the series in a more laid-back perspective, I'm sure you'll learn to appreciate this anime more.\r\n(why my pp feel weird??)\r\nStory: 4/10\r\nArt: 4/10\r\nSound: 6/10\r\nCharacters: 4/10\r\nEnjoyment: 7/10\r\nOverall: 6/10",
            "date": "2019-04-21T17:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 306856,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/eveeno",
                "username": "eveeno"
            },
            "url": "https://myanimelist.net/reviews.php?id=306856"
        },
        {
            "content": "I hate my friends for introducing this to me. \r\nSo this series heavily focuses on the idea of sexualizing traps and really terrible but laughable comedy. It's not too much but for 4 minutes per episode, i don't see how this series can be any more detailed than short snippets of school life. It's fine i guess, it's not a great story line but it's able to be intresting enough to keep me not too bored especially considering the short length. Great use of terrible comedy. I hated myself for somewhat laughing at some terrible jokes like male students still sexualizing and falling in lovewith the \"girl\" or the student council and their ridiculous idea of keeping \"her\" as a pet. \\n\\n\r\nOverall the bare fundamentals are there but i don't think there's more than that. \\n\\n\r\nThe artwork is decently good, somewhat convincing, especially the main character, i somewhat got convinced at times that it's an actual girl for once. As usual the bare fundamentals like drawing a face and making everything looking cutsey and stuff is there however it lacks for shading and certain distinct features that make the art look rather animated. Colours were sort of ok, most of the time ignoring background lighting but maintains a nice accurate colour for the clothing. But it's fine i guess. It's convincing and bearable and i somewhat have a soft spot for cute characters so it scores decently.\\n\\n\r\nSound was what got me impressed. Or should i say impressed from this series. Most of the audio is fine, maybe the \"girls\" should have more distinct differentiation from the actual girls. It seems at times that these \"girls\" have a female voice actress speaking which makes it a bit odd but nonetheless convincing. There is still the lack of space in the audio but it's not a major problem since most anime can barely replicate it anyways. What got me impressed was the existence of an opening and closing song, which for 4 minutes series is kind of surprising for me.\\n\\n\r\nI don't expect much from character development as of now. No 4 minute series has ever convinced me that somehow they can bring characters to that much detail. And this is no exception. There is a lack of distinct character personality with somewhat everyone just has the same idea of sexualizing \"her\". Most of the personalities are somewhat generic at best but they can sometimes be quite bubbly and fun to watch despite being rather shallow and repetitive. It's not hateful, it's just good. It fairs good compared to other short series but are no match for longer titles.\\n\\n\r\nI got to say. I kind of enjoyed it. It's hell of confusing, making me question myself on my soft spot for traps and cute stuff. It's a fun and enjoyable series despite the terrible storyline and average art and characters. Overall i didn't think it's bad at all, it's rather enjoyable having the question myself. \\n\\n\r\n6/10\\n\\n\r\nPS: Traps are gay.",
            "date": "2017-10-10T00:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 260367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050639.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/UltimateKud",
                "username": "UltimateKud"
            },
            "url": "https://myanimelist.net/reviews.php?id=260367"
        },
        {
            "content": "Analysing a piece of fiction often begins with understanding the author's intentions; specifically, why this piece of work was made. Sometimes this is easy and can be done from the synopsis - for example, Shawshank Redemption is an example of the injustices of the American social system in terms of justice and rehabilitation. Others, it is not so easy, such as is the case for Mawaru Penguindrum or this anime, Himegoto.\r\nBeing an anime about a crossdressing girl with heaps of up-skirt dick-shots and short episode runtimes, you roll your eyes and presume the basest of intentions: fetish. You would expect a demographic of trap-fans, right?However, we see the show through Hime's perspective, and watch them (we will get onto gender identity later) be teased and sexually assaulted on multiple, hard to watch occasions. This unique view vilifies trap-lovers as perverts and rapists, and it must be quite the masochistic viewing for somebody looking for a quick-fix of up-skirt dick.\\n\\n\r\nSo, Himegoto is a poor excuse of demographic targeting and is a failure of a show. Perhaps, or perhaps it's something more complex. Satire, describing the extended LGBT issues of society through their flaws.\\n\\n\r\nThe wonderful Hourou Musuko shows a transgender girl coming to terms with her gender identity, and the problems with which she faces in society. Himegoto is not much different, though much more subtle in its approach and using the facets of society that condemn Hime's gender identity to describe it.\\n\\n\r\nThere are no words, no conversations to determine an answer. Not once do they ask Hime \"are you a girl?\", because they find out before they ask each time. Only once does Hime say they are a guy, and it's not a convincing act. It's an interesting question to ask at the end of the series. Is Hime a girl? They certainly look like a girl, and enjoy looking like a girl, they sound like a girl and they act like a girl. In fact, not once does Hime even dress like a guy. There is constant affirmation of their penis, but Hime has plenty of opportunities to revert back acting like a guy, such as at home, and doesn't. Perhaps I should sit down and discuss this phenomenon with some LGBT experts, but from my perspective, Hime is a girl.\\n\\n\r\nAnd what's interesting, is how that affects the co-cast.\\n\\n\r\nThe school-council is essentially a group of perverts that treat Hime like a doll, but most notable of all is their leader, 18 (named as such because, well, she's 18). In episode 1, and several times after, 18 mentions and stresses how attractive she finds Hime, but chooses to punish them sexually and emotionally throughout the series. It is quite clear - 18 is a lesbian (the \"Gold Star\" variety - she describes Hime's penis as \"an evil thing down there\"), but struggling to cope with what it means; this newfound attraction to somebody she can't identify the gender of. It's not an uncommon thing to see in the 21st century, either - many people are struggling to understand if they can still be attracted to somebody that their outdated, middle school views of biology tell them that they aren't. Not only do we watch 18 struggling with the fruits of her sexuality, we see her punishment affecting Hime and elicits such sympathy.\\n\\n\r\nConclusively, the two leads of Himegoto are sending a message:\\n\\n\r\n1) You're perverts\\n\\n\r\n2) It's okay to be attracted to people based on how they act. That is who they are, not what's in their pants.\\n\\n\r\n3) If you're judging people by what's in their pants, you're perverts.\\n\\n\r\nThese are surprisingly positive messages that many LGBT activists are trying to teach. It's surprising to see it bundled with so much fanservice, but that's because instead of making children's comics it is aiming straight at the source. Let's go straight to the source of people watching trap-shows - that is, heterosexual men, and teach them the LGBT issues by making them feel uncomfortable with their own actions.\\n\\n\r\nIt's like Clockwork Orange with sexual fetishes. Then again, I might just be reading into all of this wrong and Himegoto is actually misjudging it's demographic massively and selling them stuff they don't want to see.\\n\\n\r\nWho knows? \\n\\n\r\nAll we can do is ask them.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-05-23T05:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 248345,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5530406.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SpaceWhales",
                "username": "SpaceWhales"
            },
            "url": "https://myanimelist.net/reviews.php?id=248345"
        },
        {
            "content": "(For starters, don't ask why I watched this cause honestly, I cannot give you an answer in any way shape or form.)  In every anime season, there's always going to be shows that are grouped up together in terms of expectancy.  There will always be the shows that EVERYONE is hyped for, there will also be the shows that may not be as hyped but, still have some sort of audience to watch it, and then there's that entry that just makes you say...WTF?  And for the summer season, it was Himegoto, or Secret Princess Hime.  Let's begin.\r\nStory (6.06/10):  Tobe completely honest, there is no story to this.  Since this is an anime that consists of four minute shorts, there's not really very much material that will be covered, and therefore not very much actual story that you'll have.  The basic \"premise\" basically revolves around the life of a boy named \"Hime\" (No, not kidding, his name actually is Princess) who gets some random debt payed by members of the student council.  And so, as repayment for saying him from creepy debt collectors, Hime is forced to become part of the student council and cross-dress.  \\n\\n\r\nThe basic premise of the show really is just putting our main \"heroine\" Hime into random situations that would seem funny due to the fact that our main character is a boy being forced to be dressed up as a girl or do all sorts of \"girl\" things like buying female undergarments or cheerleading.  Beyond that, there's nothing that you'll REALLY get out of this, as there is no character development, no story progression, and mostly just a bunch of \"my penis is confused\" moments.  \\n\\n\r\nNow, I have to congratulate this show on just how shameless it is in showing what it's about.  It's a gender bender that KNOWS it's a gender bender and doesn't hide the fact in any way, shape or form.  Does this mean it's a good show?  Well, it's entertaining for sure, but I wouldn't consider it beyond just something to waste an hour on.  (Since you can actually finish the series in about an hour, although personally, not recommended.)\\n\\n\r\nOverview:\\n\r\n+  Very confident in telling what the show is\\n\r\n-  Nothing that a real anime would have (it's a short, so don't expect much.)\\n\\n\r\nCharacters (6.46/10): As for characters, well, you don't really get much information out of them.  Aside from Hime, who is the main victim of the show, being forced to cross dress on a daily basis, we have the three student council girls Unko, Albertina, and 18+ (I am not kidding.  18+ is actually the girl's name).  And beyond them we have the stereotypical \"student Disciplinary committee\" which consists of Hime's brother, someone named #1 (seriously, who named these characters?) a maid, and the president of the committee.  None of these characters really get any development and are the way they are presented for the whole of the show.  It's not bad by any means, but it doesn't make them completely memorable.\\n\\n\r\nThere is however a \"quirk\" of sorts that makes this show reiterate the phrase \"My penis is confused\".  Every character you see except for the three student council girls Albertina, Unko, and 18+, is cross-dressing.  (Let that sink in.)  Literally, every other character is.  Now, while the character personalities themselves didn't make this short memorable, this certain quality did in some sense.  (Maybe not in the best sense.)\\n\\n\r\nOverview:\\n\r\n+/-  \"Interesting\" trait to put on most characters\\n\r\n-  Forgettable character personalities\\n\\n\r\nArt and Sound (6.33/10 and 6.34/10):  For art, well, the show just looks average.  There's nothing really noteworthy that stands out to me in terms of \"this looks amazing\" and overall, it doesn't really have much of a complicated animation.  It's really more of a comedy anime style animation and it does fit the show.  \\n\\n\r\nHowever, the art does sport a little...oddity within it.  You know the normal panty shots that you see in a normal ecchi anime?  Yeah, now think that with boys.  (Sorry for the mental scarring, but this is what this show does.)\\n\\n\r\nAnd for music, the tracks for the show are nothing special.  They're generic and actually somewhat catchy, but they're not tracks I consider to be out of this world and worth a listen to beyond the taste you are given in the anime.  \\n\\n\r\nOverview:\\n\r\n+/-  Decent art\\n\r\n+/-  Average music\\n\r\n-  Scarring ecchi moments\\n\\n\r\nPersonal Enjoyment (6.21/10):  To be honest, I don't even know what I was thinking when I put this on my list.  I guess I thought to myself, hey, this shouldn't be so bad, right?  Well, in a sense, I was right.  Himegoto is shameless to present itself as what it is, a show about a cross-dressing male.  It doesn't shy away from that idea which I actually find quite commendable.  However, as a side effect of that, it leads to some very...uncomfortable moments as the positive of the show showing what it actually is no holds barred, is a double-edged sword.  \\n\\n\r\nDid I like this show?\\n\\n\r\nTo be honest, kinda.  Don't get me wrong here, I would NEVER watch this show again, but for a four minute run-time, it did give me a lot to think about and never have a facepalmed so much at my life decisions, ever.  \\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nHonestly, there really isn't any actual complaints about this show that I have.  For a short, there weren't many flaws as it really just wanted to be a short bit of fun and present that to the viewer.  Of course it did have moments where it went a bit overboard for my taste, but there really isn't much to say as to why I didn't like this show in the grand scheme of things.\\n\\n\r\nWould I recommend this to anyone?\\n\\n\r\nWell, that's a toughie.  If you really want to kill about an hour of your time, and you don't mind whatever horrors await, go ahead and watch this.  Himegoto really is just a piece of anime short fluff that stays true to what it was supposed to be in the first place.  If you can handle what it presents to you, you may get a laugh or two out of this show.  (I certainly did)  However, if you want something serious, this thing is a far cry from that.  I can't really discredit this show for being what it is because in all fairness, it really does stick with its gender bending schtick for the entire run-time.  Overall, if you just want to have a bit of mindless fun, check this show out.  (Just make sure you're watching this alone, or other people might pose some questions.)\\n\\n\r\nOverall Score:  (6.12/10)",
            "date": "2014-10-06T20:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 163921,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=163921"
        },
        {
            "content": "Oh boy. I....I don't even...I don't even know where to begin with this crap. I don't. I really don't.\r\nWell got to try I guess. Hellos people I am Josh and today I am reviewing the gender-bender anime Himegoto....Yeah.\r\nStory- The story is about a guy who cross dresses who is in debt thanks to his parents. He gets saved by three middle school council members and basically becomes there bitch in exchange for them paying his huge debt.\r\n.............*Takes sip of water*\r\n....What? You thought there more? You thought I go more into detail? Well I hate to break it to you but that is really the onlystory in this. The dude has to dress like a girl and become there bitch and do what they say. If you want me say more I guess I can say they are rivaled by some other council full of crossdressers. That's...That is all I got people.\\n\\n\r\nArt- The art is pretty good especially for something this short. It's nice to look at minus the fan services shots, but these shots would be disturbing and uncomfortable no matter what, female or male but it is definetly something I want to un-see \\n\\n\r\nSound- The sound is alright. Nothing particular horrible but nothing amazing or that good to be honest.\\n\\n\r\nCharacters- Yeah I'll cut straight to the point on this one, the characters are forgettable as hell. Basically common tropes you have seen in likely a dozen anime. A majority of the main ones are crossdressers include the MC's little brother. Hell the show highlighted them as traps. Really that not me saying that the anime flat out said it. Then there are like 2 other cross dressers, one dressed as a maid and some chick dressed as a dude. Then you got the 3 council member girls who are about as perverted as you can getting excitement out of his dude crossdressing and him being there bitch.\\n\\n\r\nEnjoyment- I mean I seen worse. It isn't the worst thing I seen. I was more or less bored then I was creeped out watching this but it was still bad to watch from beginning to end.\\n\\n\r\nOverall- I would mostly recommend this series for those that are fans of crossdressing and gender bender stuff I guess. That is obviously the target demographic so if your like me and don't like this stuff, you might not enjoy this at all\\n\\n\r\nWith that being said, peace people",
            "date": "2016-07-14T18:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 224042,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5378004.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/JoshuaJones16",
                "username": "JoshuaJones16"
            },
            "url": "https://myanimelist.net/reviews.php?id=224042"
        }
    ],
    [
        {
            "content": "Yahoo! I get the first review... Of this... Anime... Suddenly I feel way less excited.\r\n\"My skin melted, my powers disappeared and suddenly I was nothing but a shadow, weaker than the most humble of ghosts.\"\r\nTo get the technical staff out of the way, the anime is a three minute short with lively animation, funny music exploring completely sexual themes. You could say it's Nekoyama's deranged psychotic sister... Or maybe brother. At this point I can't tell.\r\nWell to begin with, we see an insanely cute girl assaulted by 2 Yakuza members, trying to make her pay off the debt her parents had left behind by sellingher body. One even wants to do her on the spot. Pretty ordinary staff for Japan's standards. Until the other Yakuza guy says \"Dude, you know that's a guy right?!\" \\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nWell, the anime already crushed one of my dreams, that sure didn't take long. As you have it our protagonist is a high-school trap. He is also disturbingly familiar with crossdressing and being sexually harassed. \\n\\n\r\nBut suddenly the student council of his school arrives to save the day! Consisting of three girls whose names&stereotypes you won't bother remembering they beat the Yakuza members (again, pretty typical staff for Japan) and rescue the protagonist in order to recruit her as the council's mascot and to have something to harass (oh yeah, all 3 are major perverts). They discover the trap but decide to recruit the protagonist nonetheless, making it (I refuse to call that thing a \"he\") act as the council's dog, in exchange for paying off its debt. Obviously part of the job is practically fanservicing everyone in school and leaving the \"best-of\" for the student council. They also make it announce in front of everyone that its gender is male (highly questionable).\\n\\n\r\nSo let me make things clear: We have 3 horny high school girls that were looking for yuri harassment, fell for a trap, and then entered an S&M exhibitionist relationship with said trap. \\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nDo you realise on how many levels of f£%$ed up we are here?\\n\\n\r\nThe second episode, introducing the rest of the notable cast actually made my soul sink even deeper into despair than the first had.The tired protagonist goes back home where he's greeted by his cute immouto (younger sister) wearing only her bath towel and rubbing herself on him to comfort him. Well, perhaps things aren't as bad as they looked in the sta it's a trap, isn't it?\\n\r\nApparently crossdressing and looking more feminine than the females is in the family's genes.\\n\\n\r\nAnyway, as the protagonist finds more and more ways to get sexually assaulted by everyone regardless of gender, his little sis... Brother, meets someone who has sworn to replace the current student council and therefore save the protagonist from constant humiliation. The head of the public morals commity... A LOLI! Oh, the most wonderful of sights to behold in an anime where the protagonist is a trap. Whoever has read my previous reviews or knows me irl knows that I have a certain weakness to lolis (as in,  I absolutely adore them). And she is exactly as all lolis should be. Slightly tsundere, incredibly cutely shy, absolutely, 180 degrees, washboard-level, completely wallish, flat, with an adorable mini skirt, with the cute striped panties that hide a tiny bu...\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nSON OF A BITCH!! It wasn't enough was it? You just had to ruin the loli too!\\n\\n\r\nThe rest of the episodes are filled with chances for the protagonist to give fanservice to various people, with the ending of the most recent one (ep 4) being truly disturbing.\\n\\n\r\nIf you liked Boku no Pico or enjoy watching messed up things try it out.\\n\\n\\n\r\nThis is a continuation of the review above, 11 episodes have been released by now. I had thought that the series couldn't get anymore disturbing. Boy was I wrong...\\n\\n\r\nAt the end of each episode that passes the viewer will experience... Revelations to the protagonist that he rather enjoys being treated as a female. You could practically say that with the ending of each episode its gender changes more from \"undefinable\" to \"female\". And I won't lie, that's disturbing as f\"$%. Also disturbing as f£%^ is how it was revealed that the maid of the public morals committee, a busty blonde (maid: my second fetish, ranked right after loliconnesss)... Is a dude with an overstuffed bra... Yes, there was actually another trap... Mere words cannot begin to describe the psychological trauma of having BOTH my dreams crushed so mercilessly. Oh and the protagonist's sister's (...) friend which appeared to be a boy always hiding his face? It's a girl crossdressing as a boy.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n One can only raise his hands to the heavens and scream to whatever twisted god allowed the creation of this abomination... \"WHAT THE F£%K?\"\\n\\n\r\nAfter watching episode 12: 1)Men who are men are rapists, that's today's lesson. 2)Women who are women are cruel inconsiderate jerks. 3)Men who are women are the only pure people in this world (...yes I find it as rediculous as you do). 4)If you quit the student council WHY ARE YOU STILL CROSSDRESSING?!",
            "date": "2014-08-01T13:26:00+00:00",
            "helpful_count": 77,
            "mal_id": 154765,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=154765"
        },
        {
            "content": "If you read my other review before, well nothing much changed, I say pretty much the same stuff, I still feel for how it is, and I still have my similar opinion.\r\nAnyways....\r\nHimegoto, is a gender-bender anime that came out in the Summer 2014, and was one of the 'shorts' anime where it's like a few minutes or so. While watching this anime I couldn't really say I really liked it or enjoyed it a lot, even though I really really like the gender-bender genre. Seeing other animes like Ouran Host Club, Ranma 1/2 (didn't finish), and other ones like that one filler episode of LittleBusters! was great to watch, but not really Himegoto.\\n\\n\r\nThe story is about a boy named Hime Arikawa who is forced to join the Student Council and to cross-dress. As he joins he is basically the dog for it, or shall we call, the b*tch for the student council. I mean like basically he was for the entire series, because our guy is pretty submissive. Hime just falls into the student council's hands and they do WHATEVER THEY WANT. MHMM...anyways...\\n\\n\r\nWhen it comes to the art, I'd say it's pretty normal...nothing great or bad, it's okay I'd say. Like they do make characters cute at those times etc. As for the sound, I actually like the OP and ED, it's not amazing, but it's okay to good. \\n\\n\r\nAnd as Anime is weird as it is, we all accept how it is.\\n\r\nFor me, there's few minor problems towards to show, some in my opinion I did not like and some was okay. Fan-service may be a huge turn off to the audience as most of the fan-service is more towards Hime, who is a guy, and well, you'll see some bulges and undie-shots.....(the feeling where this may be loli, but it's like OH WAIT, IT'S A GUY, SO IT'S TOTALLY FINE)\\n\r\nAlso, some people may like submissive character, I'm honestly not the biggest fan, but it's okay....\\n\r\nWeirdest thing I'd say from the show is how both genders fine him really attractive. Like to the point, GUY WOULD RAPE HIM...LIKE, THEY LIKE, I DON'T CARE, IT'S GOING TO BE DAIJOUBOU, HUEHUEHUEHUEHUE.....\\n\r\n._.\\n\\n\r\nEntertainment wise though, I actually enjoyed many parts rather than getting creeped out. There are many parts that are funny because of the gender bender, which was something I was looking for.  :D Also, may be considered spoiler, how you see it....I also liked the unexpected gender benders tho'! xD\\n\\n\r\nWell, I give this anime a 5.5, because nothing much stood out to me, but entertainment was okay-good. If you like the review you can press it was helpful, if you didn't like it or didn't agree you can press it wasn't helpful, but if it wasn't helpful, doo tell me why, I'd like to try to get better at reviewing ^_^ \\n\r\n-pop102\\n",
            "date": "2014-08-05T23:55:00+00:00",
            "helpful_count": 69,
            "mal_id": 155473,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3233653.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pop102",
                "username": "pop102"
            },
            "url": "https://myanimelist.net/reviews.php?id=155473"
        },
        {
            "content": "This anime is a catastrophic attempt at humor, and a callous one with rose tinted glasses towards what is veritably a whole slew of sex crimes. Yes, he is apparently a male who does initially to consent to crossdressing to pay off a debt, though it seems the student council gets off to putting him into embarrassing situations, knowing full well the consequences that will entail, which is usually at least a panty shot, if not worst, without his knowledge beforehand or his consent. \r\nFor all the episodes I watched, I kept thinking \"Where is the punchline?\" Then I realize that the situations are thepunchline, and I shook my head and realize that is a bottom of a barrel title that indulges in the same tier of cruelty as Watamote without the deep introspection and characterization of someone like Tomoko. It is just a gag anime who thinks the idea of a man, or a cross dressing man, being harassed and shamed, is a novel idea in itself, and one likely to garner laughs. \\n\\n\r\nWell woop-de-doo, look at how many people think this is a decent anime, or even a progressive one. Ha, seriously? This anime does nothing other than show the student council doing things to Hime that go far beyond reasonable work contracts, even for someone is paid to crossdress (Especially so), and his consent or lack thereof, made obvious by his expressions and pleads episode after episode. The student council are responsible for creating situations that would allow such public displays of embarrassment in the first place, with morally unreasonable and insidious actions that were intended to do so. There is no punchline. I am suppose to find all this funny in nature, like the slapstick of The Three Stooges. No, it is cruel and a backwards trivialization of men or cross dressers in general concerning sexual consent.\\n\\n\r\nI am not opposed to the idea of humor surrounding a serious topic of sexual assaults, but all this anime amounts to is a mix of cringe comedy and sadism. No meta commentary, nothing but the situation itself. It slaps on happy music while Hime is in fact, sexually harassed, assaulted, and at least one point, nearly raped.\\n\\n\r\nPoint being that because he is a cross dresser, because he is a man, that I am suppose to take this humorously. Seriously? Can we stop laughing about poop jokes and realize that this problem concerning these demographics, male or crossdresser, are very real, and should be taken with some serious caution?\\n\\n\r\nI mean, if the genders were reversed, would anyone praise it?\\n\\n\r\nIf there is anything to praise about the anime, it is the last few episodes, beginning with Hime nearly getting raped, something that the show acknowledges for what it is, for once, while the student council sits by and does nothing, whereas Hime gives them a satisfying \"reason you suck speech\". \\n\\n\r\nThis is the only reasonable part, because it actually paints the student council as vicious voyeurs and Hime as someone who demands respect. Though it is not 2 episodes later that Hime forgives them, and all is happy.\\n\\n\r\nWait, what? You acknowledges that 18-san and friends were willing to let Hime get raped just so they can film it, yet he forgives them? Freaking forgives them? What the hell?\\n\\n\r\nI am sorry, I need a break. Honestly, if you like this anime, I am not sure I can respect that opinion, but to paint it as a mark of progression for such people is not only to stymie progress, but to contribute to the issue's regression.",
            "date": "2017-04-01T19:06:00+00:00",
            "helpful_count": 30,
            "mal_id": 244295,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2250133.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/PeripheralVision",
                "username": "PeripheralVision"
            },
            "url": "https://myanimelist.net/reviews.php?id=244295"
        },
        {
            "content": "Warning this anime has more Dangos than there are in Clannad so you have been warned\r\nHey everyone it is I MrRecklessPenguin about to do the impossible and try to review Himegoto critically.  Well, let's get this penis bulge on the road shall we?  Done by studio Asahi Production Directed by Yanase, Takeyuki, script written by the mastermind behind Robot Girls Z.......\r\nTHE STORY\r\nHimegoto is the story Hime Arikawa who is a second-year student at Shimoshina High School. One day Booker Dewi-err-i-mean-um Hime is forced to pay a large amount of debt but Hime is saved by the three girls of the student council afterbeing chased down by horny debt collectors. As payment for this debt, Hime has to spend his high school life dressed as a girl.  From there we encounter penis bulges larger than the Eiffel tower and more traps than an Indiana Jones Movie.\\n\\n\r\nNow I do understand this anime isn't serious.  In fact based on enjoyment I'd give the anime a 7/10.  But lets go on the more critical side and actually analyze this story.\\n\\n\r\nFor the most part, Himegoto delivers comedy, not through well thought out jokes though.  Himegoto mostly relies on shock value as well as throwing Love Muscles at your face.  Don't get me wrong, I love my Main Vein, but they overused the Tallywhacker jokes so much that sometimes the jokes became old and staler than Dominoes Pizza.  The show is fun though, don't get me wrong, I couldn't imagine Himegoto with a story, lie how I can't imagine Jay Leno without his chin.  But basically if you keep reusing the. Trouser Snake jokes, the quote on quote story and comedy become overused.  Also the anime likes to through in traps and when i say traps I mean this anime is basically trap service.  Tom and jerry would have a field day in this anime.  Every girl you think is a girl is probably a dude so when watching this anime I'd advice you to keep your hand away from your Baloney Pony.\\n\\n\r\nBut there is some light to be found within the last 2 episodes, the series builds up with Hime keep on getting inda tortured by the student council and decides he has had enough with them and leaves which brings me to the characters\\n\\n\\n\r\nTHE CHARACTERS\\n\r\nHime is the only character that gets a shred of development and in a short anime that's to be expected.  He in the last 2 episodes becomes sick of the torturing by the student council to the point where he stands up for himself and says I'm sick of it and I'd rather be treated better.  And girls who are watching, please keep in mind, we aren't talking about 50 shades type of torture, no no, that's ummm something I don't want to talk about so I'll adjust the crop around my mouth.  The torture includes normal things Japanese students do like taking pictures of him in different sexy outfits, and having him be a part of a beauty show. Anyways, this helps give Hime a special touch rather than just having his One Eyed Monster center of attention all the time because my god, I saw more bulges from him than there are flabs on Honey Boo Boo's belly.\\n\\n\r\nAlbertina II is part of the student council is actually a manga artist and is legitimately a girl with an actual vagina.  She's ummm, interesting to say the least, to say the most she is more self conscious of her flat chest than Jennifer Lawrence is with her money tits.\\n\\n\r\nUnko is another ACTUAL girl from this show and is a part of the student council.  She's just very energetic and fun like how Susan Boyle is in bed.  She's just a fun excited character, that's all.\\n\\n\r\n18-Kin...Yeah, that's umm her actual name.  She's the one who always starts Hime's torture and is well in short a pretty schemish character.  All I can say is she's one of the bustiest of the show so she equals out the boob to Salami ratio in this show.\\n\\n\r\nKaguya is Hime's sibling.  Guess what, she's actually a he...Yeah, big shocker.  He is nice to see onscreen and adds to the comedy, literally I laughed way too hard when he was introduced so i had to applaud the anime for that.\\n\\n\r\nAnd there is Oda who is....Also...A..Trap.  You know this anime could've been a Saw film and there wouldn't be a difference, traps and torture, yeah seems about right.\\n\\n\r\nSo the characters were fun but just 2 dimensional, nothing real about them.\\n\\n\\n\r\nTHE ART/ANIMTAION\\n\r\nThe Art for the show is cute but a little rough around the edges for it's character models.  They sure do love to draw them bulges though.  They drew more bulges on here than there were flaws in George Bush's Presidency.  The animation is very choppy though and inst that great.  But for a short like this it gets the job don\\n\\n\\n\r\nTHE SOUND\\n\r\nAs for the Ost, haha what ost?  The music in the show at points sound like something I'd hear in Mario.  The soundtrack isn't special at all, it fits but it's pretty bad and not memorable at all.  you're better off listening to Captain Underpants Pizza Party than this.\\n\\n\r\nSo All and all I enjoyed Himegoto a lot, it knew what it wanted to be and it delivered.  But as a critic i must say this show has more problems than the Kardashian family.\\n\r\nBut what I can say is the comedy was pretty funny and it had me laughing\\n\r\nSo giving the story a 3\\n\r\nCharacters a 2.5\\n\r\nArt/Animation a 3.75\\n\r\nThe OST a 2\\n\\n\r\nHimegoto gets a score of 2.8 without enjoyment and with my enjoyment of a 7 gets a score of 3.65 for a reccomendation of watch it for Man Meat.\\n\\n\\n\\n\\n",
            "date": "2014-12-29T10:43:00+00:00",
            "helpful_count": 46,
            "mal_id": 175039,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3349065.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RecklessPeggy",
                "username": "RecklessPeggy"
            },
            "url": "https://myanimelist.net/reviews.php?id=175039"
        },
        {
            "content": "Himegoto is a short anime with 13 episodes, 4 minutes each and most of it deals with male trap fanservice and jokes that are mostly about cross-dressing.\r\nStory: 2/10\r\nHimegoto begins with the main character, Hime, in a quite bad situation, when the three girls of his school's student counsil come to his rescue! But it's not going to be that simple. In return for their helping him, he has to become the counsil's ''dog''. And that's were the story ends and the trap fanservice begins!\r\nCharacters: 2/10\r\nApart from the protagonist, Hime, the other 3 important characters are the three girls of the student counsil, 18-kin, Unko andAlbertina II (yeah, those seem to be their actual names), who do nothing, but continiuously put the protagonist into embarrassing situations. \\n\r\nThe rest of the cast doesn't really matter, since they are all male traps (with one exception of a female trap!) who are just there for awkward fanservice as well.\\n\r\nEven though this anime is just a short and is meant to be taken as a comedy, the fact that so many of the students have cross-dressing issues makes me wonder: Are there no parents around? What about teachers? Someone? Anyone? No...? SOMEBODY, PLEASE, HELP THEM!\\n\\n\r\nArt: 5/10\\n\r\nThe art of Himegoto is the kind of art that suits a short anime like that. It is simple and with nothing really special. There are also plenty of pretty panty shots, yayyyno....\\n\\n\r\nSound: 5/10\\n\r\nThe music is just ok, I guess, not much was expected from shorts anyway.\\n\\n\r\nEnjoyment: 2/10\\n\r\nI can't really say that I got any enjoyment while I was watching this, even when the scenes weren't kind of appalling. You might only enjoy this if you really like watching traps or something.\\n\\n\r\nOverall: 2/10\\n\r\nAnyway, you may find this review a bit harsh, but I guess it's a matter of opinion. You know, whether you find the whole ''traps everywhere'' concept intresting and funny or not. \\n\r\nYou can give it a try if you have some free time and want to watch something short that doesn't require much focus and thinking and see for yourselves if it was enjoyable, or not. Although I would recommend you to not even bother checking it out.",
            "date": "2016-04-13T09:07:00+00:00",
            "helpful_count": 24,
            "mal_id": 216306,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5083261.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Melody",
                "username": "Melody"
            },
            "url": "https://myanimelist.net/reviews.php?id=216306"
        },
        {
            "content": "For an anime with 4 minute episodes, it is safe to assume that reading reviews for Himegoto will not result in anything much being ruined except maybe the punchline of a few jokes. \r\nHimegoto is currently airing, but at episode 11 I can confidently say I have a feel for the series. Our main character Arikawa Hime is chased by debt collectors and is about to be sold off into the sex industry, before the rest of the main cast come to his rescue. These 3 are part of the student council, and are hugely rich. They decide to pay his way out of debt(from the kindness of their heart) and take him in as the school council's dog. \\n\\n\r\nThis is about as far as the plot goes so far. The rest of the series is basically the day-to-day life of a school full of crossdressers and/or perverts. It's by no means realistic, so if you want an idea of life in Japanese schooling please do not watch this anime! It is however a fun and interesting look at life in a school that is run by a team of perverted high schoolers.\\n\\n\r\nThe characters themselves are very well established considering there are only 4 minute episodes. Each one is visually very unique, and their personalities are all individual. The wants and aspirations of each character is consistent and their speaking patterns are also consistent.\\n\\n\r\nThe art style is simple and pleasant, with interesting and varied backdrops which do not swallow the characters with their colouring or line work. The characters themselves are animated very well, with a lot of movement and the effects of physics being displayed in simple ways like uniform creases or hair bounce. It is wonderfully composed and a delight to look at.\\n\\n\r\nThe humor itself could be described as shock humor I suppose, with the random spontaneous nature of scenes and punch lines that smack you in the face by coming far out of left field, but it is genuinely amusing to watch. It is packed full of interesting characters that work well together in comedic situations. It will make you laugh, but can not be equated to humor like Nichijou which is much more intentional and feels very different.\\n\\n\r\nIt is not hentai, but does have a lot of trap exposure in the chest area. Technically SFW, but a lot of scenes would not impress your boss if he was looking over your shoulder on your average work day. This show is definitely for older audiences, at least 18 for most countries. That being said, it has not yet got any on-screen sex scenes, nor does it have many intense sexual harassment being shown. It is sometimes implied, however, or even threatened by characters to one another. \\n\\n\r\nThe sort of audience this anime would most likely appeal to are those who have few boundaries, and no problems with \"trap\" characters being put into awkward situations or appearing in scenes with heavy sexual overtones. There are a lot of people who will refuse to watch Himegoto as it can appear to cross many boundaries, especially in the Western World. However, if all you want from an anime is an enjoyable, even sexy short show to watch inbetween study sessions or anime marathons, Himegoto is the anime for you.\\n\r\nIt has already been subtitled by many groups, and I highly recommend supporting the official release when it finishes airing.\\n\\n\r\n[This has been my first review written for this website, please be kind if there is anything I need to fix!]",
            "date": "2014-09-20T00:45:00+00:00",
            "helpful_count": 21,
            "mal_id": 161125,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778657.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Isischan",
                "username": "Isischan"
            },
            "url": "https://myanimelist.net/reviews.php?id=161125"
        },
        {
            "content": "Every dude in this show is a girl, every girl is a dude. The whole show is a trap, this curious predicament really makes a man wonder, are traps really gay? is it really so wrong to be attracted to a drawing of a girl that happens to have a bulge between its legs where in reality there should be none? these are questions a man must ask himself, as he watches a show such as Himegoto. Sir William Smith once said \"It appears, in fact, from this, as well as from the extant fragments, that the first book of the work contained a generalaccount of the origin and arrangement of the universe. The second book appears to have been an exposition of the nature of numbers, which in the Pythagorean theory are the essence and source of all things.\" this perfectly arranged bundle of words with no meaning, perfectly encapsulates my feelings toward the show, a bundle of things thrown together for laughs, with no real meaning towards them. There is nothing original here, and yet i cannot look away, like a trainwreck is persists my mind and penis, as i sit here confused wondering whether its really ok for me to fap to this or not. According to legend,  Pythagoras' followers threw the man who discovered irrational numbers off the boat, as it really made no sense in their day and age. Similarily, i want to throw myself off a boat, for taking so much time out of my free time to write this, when really it doesn't matter in the slightest. I did ironically enjoy it though, no not the boat thing, i cant swim. I meant the show, irony is the spice of life they say, now you may be wondering who out there actually says this, well i do, silly face, and therefore everyone else will as well, because my word is law. Ironically i dont actually believe any of what i just wrote and neither should you. Watch the show for all i care, but if a member of the student counsil tries to dress YOU in girly clothes against your will, you say no, and get the heck out of there, cause that is No Good.\\n\\n",
            "date": "2017-08-30T06:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 256539,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3467245.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ribbreaker",
                "username": "Ribbreaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=256539"
        },
        {
            "content": "Story:\r\nThe only thing more disgusting than this animation is that there's someone who actually created this. It's horrendous in every sense, completely implausible and unrelatable to anyone, and exploitive material for the most depraved minds. I hated the fact that I went into this blind, and I also am having complete second guesses about my personal rule that \"I must finish what I start.\"\r\nThe 'story' doesn't have any other purpose than to excite the viewer in the most disgusting of ways, and it doesn't matter that they replaced a female with a male for the majority of these 'action shots.' This sort of exploitive materialis disgusting regardless of who is at the helm. It's 100% gender neutral, at this point. I feel terribly sorry for the animation team that would rather create something worthwhile and the musician who had to create an OST for a work with no inherent value.\\n\\n\r\nMy critique on the story is so tangential because there is no story, and nothing matters at all. The end of this work is a punch in the face with existentialism and I cannot recommend it to anyone. You don't even have to read the rest of this review. Just avoid this anime like the plague.\\n\\n\\n\r\nArt:\\n\r\nThe animation is fairly good, and I appreciate the fact that, despite it being a 3-minute per episode production, backgrounds were somewhat varied, even if it was a boring school setting just like every other work out there.\\n\\n\r\nNothing felt disproportionate, and while we get some ridiculous phallic physics, everything else seems to move rather naturally. Also, characters look unique and expressions are, while abused like the plague, somewhat varied.\\n\\n\\n\r\nSound:\\n\r\nOne of the voice actors sounded like their voice was thrown through a modulator. However, I think that was me just perceiving it wrong. Everyone else was fairly good.\\n\\n\r\nOST was hackneyed but, I mean, it works.\\n\\n\\n\r\nCharacter:\\n\r\nNobody is realistic, everyone follows tropes. In other words, nothing original and nothing interesting. You won't get anything special out of these guys. Their types are boring and predictable.\\n\\n\\n\r\nEnjoyment:\\n\r\n...\\n\\n\\n\r\n((If you liked this review, check out my other reviews by going to my profile and clicking the 'reviews' tab. I review virtually all anime and manga I find!))",
            "date": "2016-07-09T12:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 223576,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655715.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Paraturtle",
                "username": "Paraturtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=223576"
        },
        {
            "content": "As, I've finish watching this omake............I'm guessing that what animes were called that only runs for a maximum of 4 mins, ok, I just gonna get straight to the point, so here are my ratings for this omake:\r\nWarning, contains slight spoilers. \r\nGood 7:\r\nStory: Himegoto or Secret Princess is a gender bender and the first one I've watched, I'd probably say that it was quite unique, when the story plot focuses on a girly boy who was left with a mountain of debt by his no good parents and has to be the student councils's dog since they're the ones who had settled it, now itmaybe a kinda of Cinderella thingy, except in this case the guy went from the frying pan to the fire kinda of a problem That he has to dress as a girl, that to me was something that I find funny.\\n\\n\r\nOverall: Well, such uniqueness did delivered this anime well, since at first I may have been annoyed by the Guy's pussyness and yet got lodes of laugh as get's himself to a lot of awkward situation that his masters (Student council members) put on him, but, for this anime to be called \"Himegoto\" or Secret Princess doesn't really jive with this omake, and if I were the original creator, Norio Tsukudani, I'd probably title it \" Okama  de Sentokai\" or the cross-dresser in the student council.\\n\\n\\n\r\nPoor 3. \\n\\n\r\nArt: Ok, so I kinda like that Hime Arikawa is a crossdresser and so as most of the public morals as cute, but I also want to see Hime wearing a boy's uniform, fortunately it never happen, in fact he should be wearing a boy's school uniform in episode 12, let's not for get that he quit the student council in that episode, for that I hereby declared this anime's art as poor, co'z I'm disappointed to not see his manly side.\\n\\n\\n\r\nVery Good 8.\\n\\n\r\nSound: I like the seiyuu who did Hime, 18kin, Unko and Kaguya's voice, what I really love was the opening song, so the score is for the opening song.\\n\\n\r\nDecent 4.\\n\\n\r\nCharacter:\\n\\n\r\nHime Arikawa, may seemly be annoying for being a pussy, frankly there were time that I would like to hit him on the head, but it was his girly side that has balanced out my annoyance for him, so it was one of the raeson why the character category deserve a 4.\\n\\n\r\nNow for the student council like 18kin, Unko and Albertina II, they my biggest annoyance which is one reason why I can't give this character category a high score. Basically them putting Hime in such appalling situation was pretty much unbecoming of a student council, also for the two members of the student council to be 18, I guess I can't never understnd why this anime director  Yūji Yanase have to portray them as 18 years of age, I don't about you, but shouldn't high-school student of that age be gradates already? I'm thinking that anime director  Yūji Yanase may have been a repeat student. Eh whatever, even so, them student council did add up to the comedy genre of this omake, which is another reason why this category should be \"Decent \" enough.\\n\\n\r\nFair 6.\\n\\n\r\nEnjoyment : Thought, I may have given this omake's overall a \"Good\" score, it wasn't really that enjoyable since there were situations that irritates me to see Hime to be this dumb and a pussy, though  the anime was funny, my reaction to it is mixed between this omake's comedy and my disappointment for Hime, but seeing him having his first kiss with 18kin that probably was one moment that I should give this category a fair and that the way I enjoy this omake, so should I say more? \\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-10-02T11:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 163297,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=163297"
        },
        {
            "content": "Himegoto is an enlightening piece of modern masterpiece that provides insight into the biases of society.\r\nEpisode 12 has undoubtedly a few of the most emotional scenes in animation history. The poignancy is unparalleled by any other. Me and a few homies cried for hours before resuming masturbation. No wonder battle-hardened Himegoto fans sneer at the childish themes of \"Your Name\".\r\nAll the way up to the final episode, the student council has been intentionally depicted as an oppressive and corrupt force that exercises their dominance through power and wealth. The characters embody TV (especially anime) cliches that seemingly deem the show as \"tasteless\". Yet brainless normiesare unable to fathom the intricacies of bland characterization, which absolute draw attention to the ingenious plot line.\\n\\n\r\nWhile I am not a hardcore feminist, I am still admire the efforts put in by the creators outline the polarity of control that exists between genders. It saddens me that no one else experiences that sharp melancholy. Dongers out for Hime, boys.\\n\\n\r\nThe story constantly repeats situations where the gender roles are reversed. However repulsed audiences may be, one cannot judge art through a narrow and confined perspective. If an alien species is observing Earth from afar, they would deem this as the peak of human evolution. \\n\\n\r\nOn the outside, Himegoto seems like a show full of fan service, appealing only to fans of trap characters. Yet upon closer investigation, many would find a carefully-crafted critique of authoritarian regimes and gender norms.\\n\\n\r\nMoments such as Episode 12's (again, one of the greatest) molester sequence will go down as animation's most romantic scenes.\\n\\n\r\n-Stunning",
            "date": "2018-12-17T03:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 295940,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7199587.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 10,
                    "sound": 4,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FructIango",
                "username": "FructIango"
            },
            "url": "https://myanimelist.net/reviews.php?id=295940"
        },
        {
            "content": "Alright, so Himegoto is a gender-bender anime, that detail is something that caught my attention before I even knew about this series given I'd seen images of the protagonist around the web a good bit. Once I'd given this anime a chance, I was mildly amused at the show for...around three episodes, but by the end of it I can't say I enjoyed it all that much given that it kinda played it's gimmick out by the last episode. \r\nAlright, let's look at the plot\r\nEpisode 1: the plot starts off with the trap protagonist getting harassed by some guys because his parents supposedly travel allaround building on debt, so with him being their son he is victim to harassment. But after an encounter with the oh-so generous student council, they decide to \"protect their student\" by paying off his parent's debt, but in turn make him join the student council to be their \"toy\". After this happens, the show just uses the whole \"he has a penis\" thing as much as it can. The student council almost forcefully gets him involved in a series of emasculating activities, one in particular being having him put on girl clothing most of the time & others being something that has to have him show off the fact...that he has a penis. And those things happen. For the rest of the show.\\n\\n\r\nThere was only one moment in this where it could've taken a small step somewhere, and that was near the end, where Hime is getting upright harassed & almost raped by two dudes and the student council sits there and watches up until the disciplinary committee stops it. At that moment Hime seemed to finally get the message that they were clearly just using him almost entirely for their own sake, but of course to end the show with a happy ending, everyone makes up after they save him from another perv in a park because now they apparently think they were friends the whole time without showing much sign of that, and happy ending. They at least make it look like the student council got the message to stop soloing on Hime and ease off on em in the end, but still, the show had almost no progression.\\n\\n\r\nAs for the art & the OST, there isn't anything to say, it's just basic stuff you'd find in your average anime: the art looks just fine and the OSt isn't supposed to have much of a role in this, being a short series of course.\\n\\n\r\nThe idea of humor in this show is to put a male in the position that girls in your average anime would or could end up in at some point: panty-shots, wearing skimpy clothing, that kind of stuff,  but that felt like that was all this had going for it because nothing but moments of situations of such would occur.\\n\\n\r\nOther than the student council, the others aren't much of a big deal. I mean, you learn that the supporting characters are also entirely a group of traps & they have this little rivalry with the student council, but that's it.\\n\r\nThe student council members themselves also don't have much going on other than the fact that they're the only primary characters who are actually the gender they claim to be.\\n\r\n18 is the vice-president, and the one who is the most into the idea of playing with him,\\n\r\nUnko, is kinda just there, even though she is the president\\n\r\nAnd Albertina, the only one with at least something to go with her character is a popular manga author, but she only got one episode where they explore that.\\n\\n\r\nAnd that's pretty much it. I don't think this show was particularly interesting, I mean it was a decent little series that maybe some will get a quick chuckle or two out of, but it isn't really something interesting enough for you to care about after you've sat through it all, as I'm sure you'll forget most of what you'd seen in it anyway other than the protagonist. I'd rate this show with maybe a high 5.",
            "date": "2018-08-12T12:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 286292,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6038145.jpg",
                "scores": {
                    "animation": 0,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Asasphinx",
                "username": "Asasphinx"
            },
            "url": "https://myanimelist.net/reviews.php?id=286292"
        },
        {
            "content": "A while ago I wrote a review for the series \"Shishunki Bitter Change\" which acted as a deconstruction of what would happen if two people had their genders unintentionally changed by playing the premise realistically, exploring the psychological ramifications of living in someone's else's body that is not your own and in a completely different gender. It was a good series overall, though some may wonder what this has to do with Himegoto. \r\nIn Taoism, there is a symbol known as the \"Taijitu.\" More well-known as the Ying-Yang, it is a symbol of duality. Everything has an opposite which compliments each other. For war, thereis peace. For sadness, there is happiness. For every Shishunki Bitter Change, there is Himegoto, a show that is quite awful and very, very creepy. \\n\\n\r\nThe plot premise is simple. His parents had a lot of debt and being the assholes they are, they left the debt on the main character Hime Arikawa. Pursued by loan sharks, he's bailed out by the head of the Student Council. Because somehow the Yakuza pales in comparison to a bunch of high school students, am I right? They are also inexplicably able to pay off the debt, but in exchange for Hime becoming their cosmic plaything by passing off as a girl. And thus begins an exercise in masochism as he is forced into many questionable situations. \\n\\n\r\nTraps as they are called are often played up for comedic purposes. Understandable however. After all, comedy is awkward. Finding out that a beautiful girl is actually male can also be awkward with little prior warning as well, and as such it is a natural fit. Comedy is what Himegoto tries, but it instead aims for masochism and downright abuse by the hands of the Student Council as they force Hime into incredibly exploitative situations in which he's downright abused, objectified, and near-rape scenes. Instead of his predicament being played for drama, it is instead played up for comedic purposes. If you're 21, here is a fun (if you like being drunk that is) drinking game: Take a shot every time you see a panty shot of Hime. You won't survive. And he's not exactly being consenting with this either. That's probably one of the big issues I do have with this whole ordeal. \\n\\n\r\nIn High School DxD (a harem infamous for copious fanservice) the main character Issei literally wants a harem, and is incredibly perverted. However, he's not exploitive. Rias allows Issei to copiously grope her with her consent, and the same goes for most of the girls in his harem. It wasn't an issue since both parties were fairly comfortable and on board with whatever zany antics Issei wanted to indulge himself in. In Himegoto however, he has no desire to crossdress. Kinda. He's initially on board with him crossdressing so that he can pay off his debt. It goes further when he's also forced into embarassing situations that he is very clearly uncomfortable with, and as such the audience is uncomfortable when the show goes like \"Hey, you want to see another panty shot of this guy? No? Too bad! Even if he doesn't like it, he's still cute right?\" \\n\\n\r\nI think it would have been interesting if they took the premise seriously. How would the life of a Japanese male teen look like if he continually went to school crossdressing? How would that affect his social life? His relationships? His psychological state? These questions aren't really explored here. I know that the premise is different, but these are still topics that could have been explored. Though even if it would have been explored, it probably wouldn't have mattered considering how everyone else is either a girl, or a guy who crossdresses as a girl. \\n\\n\r\nSigh. \\n\\n\r\nIt's a very cheap series overall. Little substance to it, very creepy and exploitative. Sexual harassment like this is passed off as something arousing. I can't really get the appeal of this show when the cute guy who looks like a girl is treated horribly. I'm not a masochist either. And I doubt even masochists will like this. \\n\\n\\n",
            "date": "2016-10-07T13:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 231270,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5183208.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/_Sofi_",
                "username": "_Sofi_"
            },
            "url": "https://myanimelist.net/reviews.php?id=231270"
        },
        {
            "content": "Helped me with my intro C++ programming class. I learned about allocating memory on the stack as well as appending nodes to the tails of linked lists. If there were to be a second season I would like them to cover Huffman trees as it is something that I am looking forward to going over in my discrete math classes. Overall I believe every CS major should partake in this 10/10 masterpiece. Seeing the spillage has awoken me.\r\nHelped me with my intro C++ programming class. I learned about allocating memory on the stack as well as appending nodes to the tails of linked lists. Ifthere were to be a second season I would like them to cover Huffman trees as it is something that I am looking forward to going over in my discrete math classes. Overall I believe every CS major should partake in this 10/10 masterpiece. Seeing the spillage has awoken me.\\n\r\nHelped me with my intro C++ programming class. I learned about allocating memory on the stack as well as appending nodes to the tails of linked lists. If there were to be a second season I would like them to cover Huffman trees as it is something that I am looking forward to going over in my discrete math classes. Overall I believe every CS major should partake in this 10/10 masterpiece. Seeing the spillage has awoken me.\\n",
            "date": "2018-04-01T03:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 276230,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7113868.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sparf",
                "username": "sparf"
            },
            "url": "https://myanimelist.net/reviews.php?id=276230"
        },
        {
            "content": "This is a comedic series about a trap.\r\nNot too much to say about it. It's sort of one dimensional in that most episodes are basically about hime being exposed or embarassed about being a trap. Still, they are pulled off well enough to be enjoyable. There are other jokes as well, but they're not the main focus; they're more witty one-liner type ones. Also, there's a decent amount of trap fanservice if you're into that. First time I've ever seen panty shots of guy's bulges. I think this anime would get a lower score, but I haven't seen much stuff about traps, so that givesit some uniqueness. That said, it's not the type of anime you can marathon. Most I've done is 4 episodes. \\n\\n\r\nThe series also had hidden potential. Over time, hime goes from being very against the idea of crossdressing to being ambivalent to clearly enjoying it. That could've been explored indepth. 18+ is interested in him so there was romantic potential as well. Almost all of the characters had a lot of potential for being fleshed out.  It's a very big shame that it was only 3.5 minutes long and not made into less of a comedic series.\\n\\n\r\nBeing 3.5 minutes per episode, it's not a massive investment to try it. I'd recommend this to anyone who likes traps or wants to check out something different.",
            "date": "2018-02-23T15:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 272266,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3128533.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/oappo",
                "username": "oappo"
            },
            "url": "https://myanimelist.net/reviews.php?id=272266"
        },
        {
            "content": "\"There are no women in Yugioh, only men! Sexy men!\" This also applies to Himegoto (maybe or maybe not excluding the sexy part...) Basically, everyone is a guy, sorry everyone \"IS A TRAP!\" (oh my god what an original joke!)\r\nStory: I'll give it a 5.5/10 for story, so like a 6/10. It's not, *bad*, but it isn't exactly good either. More of a so so, I did like the premise when I heard about the not gay story of traps though.\r\nArt: The animation is fluid, but simplistic for the most part. 6/10.\r\nSound: It's 4 minutes of a sorta comedyish anime, so it doesn't have thebest time demonstrating its soundtrack. 5/10, cause I like the OP and ED songs.\\n\\n\r\nCharacter: I actually like the like 2 female characters the best, and they aren't really impressed upon much (the characters as a whole). It's closer to every character has a character trait and that defines their existence. 5/10, almost a 6.\\n\\n\r\nEnjoyment: I guess like... a 6/10. It wasn't bad, per say, but it wasn't the best thing out there. It was enjoyable though.\\n\\n\r\nOverall: A 6/10. This show is not bland overall, and can be fun to watch for the most part. It really uses its short episodes to its advantage, as this would wear real thin real fast if it was elongated into a couple full episodes. In the end though, I will say that I did not consider this anime a waste of time.",
            "date": "2018-02-05T01:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 270699,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6559723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Springball64",
                "username": "Springball64"
            },
            "url": "https://myanimelist.net/reviews.php?id=270699"
        },
        {
            "content": "The quality of the show doesn't matter if you enjoyed it. That's what I believe. Yes, Himegoto lacks any sort of plot and has completely static and forgettable characters. Yes, it contains a lot of \"casual\" sexual assault throughout the entire series, which obviously isn't right. I very much enjoyed it, however, though that's probably just because I'm a fan of the cross-dressing genre. The OP and ED are super catchy and once you view the series in a more laid-back perspective, I'm sure you'll learn to appreciate this anime more.\r\n(why my pp feel weird??)\r\nStory: 4/10\r\nArt: 4/10\r\nSound: 6/10\r\nCharacters: 4/10\r\nEnjoyment: 7/10\r\nOverall: 6/10",
            "date": "2019-04-21T17:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 306856,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/eveeno",
                "username": "eveeno"
            },
            "url": "https://myanimelist.net/reviews.php?id=306856"
        },
        {
            "content": "I hate my friends for introducing this to me. \r\nSo this series heavily focuses on the idea of sexualizing traps and really terrible but laughable comedy. It's not too much but for 4 minutes per episode, i don't see how this series can be any more detailed than short snippets of school life. It's fine i guess, it's not a great story line but it's able to be intresting enough to keep me not too bored especially considering the short length. Great use of terrible comedy. I hated myself for somewhat laughing at some terrible jokes like male students still sexualizing and falling in lovewith the \"girl\" or the student council and their ridiculous idea of keeping \"her\" as a pet. \\n\\n\r\nOverall the bare fundamentals are there but i don't think there's more than that. \\n\\n\r\nThe artwork is decently good, somewhat convincing, especially the main character, i somewhat got convinced at times that it's an actual girl for once. As usual the bare fundamentals like drawing a face and making everything looking cutsey and stuff is there however it lacks for shading and certain distinct features that make the art look rather animated. Colours were sort of ok, most of the time ignoring background lighting but maintains a nice accurate colour for the clothing. But it's fine i guess. It's convincing and bearable and i somewhat have a soft spot for cute characters so it scores decently.\\n\\n\r\nSound was what got me impressed. Or should i say impressed from this series. Most of the audio is fine, maybe the \"girls\" should have more distinct differentiation from the actual girls. It seems at times that these \"girls\" have a female voice actress speaking which makes it a bit odd but nonetheless convincing. There is still the lack of space in the audio but it's not a major problem since most anime can barely replicate it anyways. What got me impressed was the existence of an opening and closing song, which for 4 minutes series is kind of surprising for me.\\n\\n\r\nI don't expect much from character development as of now. No 4 minute series has ever convinced me that somehow they can bring characters to that much detail. And this is no exception. There is a lack of distinct character personality with somewhat everyone just has the same idea of sexualizing \"her\". Most of the personalities are somewhat generic at best but they can sometimes be quite bubbly and fun to watch despite being rather shallow and repetitive. It's not hateful, it's just good. It fairs good compared to other short series but are no match for longer titles.\\n\\n\r\nI got to say. I kind of enjoyed it. It's hell of confusing, making me question myself on my soft spot for traps and cute stuff. It's a fun and enjoyable series despite the terrible storyline and average art and characters. Overall i didn't think it's bad at all, it's rather enjoyable having the question myself. \\n\\n\r\n6/10\\n\\n\r\nPS: Traps are gay.",
            "date": "2017-10-10T00:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 260367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050639.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/UltimateKud",
                "username": "UltimateKud"
            },
            "url": "https://myanimelist.net/reviews.php?id=260367"
        },
        {
            "content": "Analysing a piece of fiction often begins with understanding the author's intentions; specifically, why this piece of work was made. Sometimes this is easy and can be done from the synopsis - for example, Shawshank Redemption is an example of the injustices of the American social system in terms of justice and rehabilitation. Others, it is not so easy, such as is the case for Mawaru Penguindrum or this anime, Himegoto.\r\nBeing an anime about a crossdressing girl with heaps of up-skirt dick-shots and short episode runtimes, you roll your eyes and presume the basest of intentions: fetish. You would expect a demographic of trap-fans, right?However, we see the show through Hime's perspective, and watch them (we will get onto gender identity later) be teased and sexually assaulted on multiple, hard to watch occasions. This unique view vilifies trap-lovers as perverts and rapists, and it must be quite the masochistic viewing for somebody looking for a quick-fix of up-skirt dick.\\n\\n\r\nSo, Himegoto is a poor excuse of demographic targeting and is a failure of a show. Perhaps, or perhaps it's something more complex. Satire, describing the extended LGBT issues of society through their flaws.\\n\\n\r\nThe wonderful Hourou Musuko shows a transgender girl coming to terms with her gender identity, and the problems with which she faces in society. Himegoto is not much different, though much more subtle in its approach and using the facets of society that condemn Hime's gender identity to describe it.\\n\\n\r\nThere are no words, no conversations to determine an answer. Not once do they ask Hime \"are you a girl?\", because they find out before they ask each time. Only once does Hime say they are a guy, and it's not a convincing act. It's an interesting question to ask at the end of the series. Is Hime a girl? They certainly look like a girl, and enjoy looking like a girl, they sound like a girl and they act like a girl. In fact, not once does Hime even dress like a guy. There is constant affirmation of their penis, but Hime has plenty of opportunities to revert back acting like a guy, such as at home, and doesn't. Perhaps I should sit down and discuss this phenomenon with some LGBT experts, but from my perspective, Hime is a girl.\\n\\n\r\nAnd what's interesting, is how that affects the co-cast.\\n\\n\r\nThe school-council is essentially a group of perverts that treat Hime like a doll, but most notable of all is their leader, 18 (named as such because, well, she's 18). In episode 1, and several times after, 18 mentions and stresses how attractive she finds Hime, but chooses to punish them sexually and emotionally throughout the series. It is quite clear - 18 is a lesbian (the \"Gold Star\" variety - she describes Hime's penis as \"an evil thing down there\"), but struggling to cope with what it means; this newfound attraction to somebody she can't identify the gender of. It's not an uncommon thing to see in the 21st century, either - many people are struggling to understand if they can still be attracted to somebody that their outdated, middle school views of biology tell them that they aren't. Not only do we watch 18 struggling with the fruits of her sexuality, we see her punishment affecting Hime and elicits such sympathy.\\n\\n\r\nConclusively, the two leads of Himegoto are sending a message:\\n\\n\r\n1) You're perverts\\n\\n\r\n2) It's okay to be attracted to people based on how they act. That is who they are, not what's in their pants.\\n\\n\r\n3) If you're judging people by what's in their pants, you're perverts.\\n\\n\r\nThese are surprisingly positive messages that many LGBT activists are trying to teach. It's surprising to see it bundled with so much fanservice, but that's because instead of making children's comics it is aiming straight at the source. Let's go straight to the source of people watching trap-shows - that is, heterosexual men, and teach them the LGBT issues by making them feel uncomfortable with their own actions.\\n\\n\r\nIt's like Clockwork Orange with sexual fetishes. Then again, I might just be reading into all of this wrong and Himegoto is actually misjudging it's demographic massively and selling them stuff they don't want to see.\\n\\n\r\nWho knows? \\n\\n\r\nAll we can do is ask them.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-05-23T05:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 248345,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5530406.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SpaceWhales",
                "username": "SpaceWhales"
            },
            "url": "https://myanimelist.net/reviews.php?id=248345"
        },
        {
            "content": "(For starters, don't ask why I watched this cause honestly, I cannot give you an answer in any way shape or form.)  In every anime season, there's always going to be shows that are grouped up together in terms of expectancy.  There will always be the shows that EVERYONE is hyped for, there will also be the shows that may not be as hyped but, still have some sort of audience to watch it, and then there's that entry that just makes you say...WTF?  And for the summer season, it was Himegoto, or Secret Princess Hime.  Let's begin.\r\nStory (6.06/10):  Tobe completely honest, there is no story to this.  Since this is an anime that consists of four minute shorts, there's not really very much material that will be covered, and therefore not very much actual story that you'll have.  The basic \"premise\" basically revolves around the life of a boy named \"Hime\" (No, not kidding, his name actually is Princess) who gets some random debt payed by members of the student council.  And so, as repayment for saying him from creepy debt collectors, Hime is forced to become part of the student council and cross-dress.  \\n\\n\r\nThe basic premise of the show really is just putting our main \"heroine\" Hime into random situations that would seem funny due to the fact that our main character is a boy being forced to be dressed up as a girl or do all sorts of \"girl\" things like buying female undergarments or cheerleading.  Beyond that, there's nothing that you'll REALLY get out of this, as there is no character development, no story progression, and mostly just a bunch of \"my penis is confused\" moments.  \\n\\n\r\nNow, I have to congratulate this show on just how shameless it is in showing what it's about.  It's a gender bender that KNOWS it's a gender bender and doesn't hide the fact in any way, shape or form.  Does this mean it's a good show?  Well, it's entertaining for sure, but I wouldn't consider it beyond just something to waste an hour on.  (Since you can actually finish the series in about an hour, although personally, not recommended.)\\n\\n\r\nOverview:\\n\r\n+  Very confident in telling what the show is\\n\r\n-  Nothing that a real anime would have (it's a short, so don't expect much.)\\n\\n\r\nCharacters (6.46/10): As for characters, well, you don't really get much information out of them.  Aside from Hime, who is the main victim of the show, being forced to cross dress on a daily basis, we have the three student council girls Unko, Albertina, and 18+ (I am not kidding.  18+ is actually the girl's name).  And beyond them we have the stereotypical \"student Disciplinary committee\" which consists of Hime's brother, someone named #1 (seriously, who named these characters?) a maid, and the president of the committee.  None of these characters really get any development and are the way they are presented for the whole of the show.  It's not bad by any means, but it doesn't make them completely memorable.\\n\\n\r\nThere is however a \"quirk\" of sorts that makes this show reiterate the phrase \"My penis is confused\".  Every character you see except for the three student council girls Albertina, Unko, and 18+, is cross-dressing.  (Let that sink in.)  Literally, every other character is.  Now, while the character personalities themselves didn't make this short memorable, this certain quality did in some sense.  (Maybe not in the best sense.)\\n\\n\r\nOverview:\\n\r\n+/-  \"Interesting\" trait to put on most characters\\n\r\n-  Forgettable character personalities\\n\\n\r\nArt and Sound (6.33/10 and 6.34/10):  For art, well, the show just looks average.  There's nothing really noteworthy that stands out to me in terms of \"this looks amazing\" and overall, it doesn't really have much of a complicated animation.  It's really more of a comedy anime style animation and it does fit the show.  \\n\\n\r\nHowever, the art does sport a little...oddity within it.  You know the normal panty shots that you see in a normal ecchi anime?  Yeah, now think that with boys.  (Sorry for the mental scarring, but this is what this show does.)\\n\\n\r\nAnd for music, the tracks for the show are nothing special.  They're generic and actually somewhat catchy, but they're not tracks I consider to be out of this world and worth a listen to beyond the taste you are given in the anime.  \\n\\n\r\nOverview:\\n\r\n+/-  Decent art\\n\r\n+/-  Average music\\n\r\n-  Scarring ecchi moments\\n\\n\r\nPersonal Enjoyment (6.21/10):  To be honest, I don't even know what I was thinking when I put this on my list.  I guess I thought to myself, hey, this shouldn't be so bad, right?  Well, in a sense, I was right.  Himegoto is shameless to present itself as what it is, a show about a cross-dressing male.  It doesn't shy away from that idea which I actually find quite commendable.  However, as a side effect of that, it leads to some very...uncomfortable moments as the positive of the show showing what it actually is no holds barred, is a double-edged sword.  \\n\\n\r\nDid I like this show?\\n\\n\r\nTo be honest, kinda.  Don't get me wrong here, I would NEVER watch this show again, but for a four minute run-time, it did give me a lot to think about and never have a facepalmed so much at my life decisions, ever.  \\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nHonestly, there really isn't any actual complaints about this show that I have.  For a short, there weren't many flaws as it really just wanted to be a short bit of fun and present that to the viewer.  Of course it did have moments where it went a bit overboard for my taste, but there really isn't much to say as to why I didn't like this show in the grand scheme of things.\\n\\n\r\nWould I recommend this to anyone?\\n\\n\r\nWell, that's a toughie.  If you really want to kill about an hour of your time, and you don't mind whatever horrors await, go ahead and watch this.  Himegoto really is just a piece of anime short fluff that stays true to what it was supposed to be in the first place.  If you can handle what it presents to you, you may get a laugh or two out of this show.  (I certainly did)  However, if you want something serious, this thing is a far cry from that.  I can't really discredit this show for being what it is because in all fairness, it really does stick with its gender bending schtick for the entire run-time.  Overall, if you just want to have a bit of mindless fun, check this show out.  (Just make sure you're watching this alone, or other people might pose some questions.)\\n\\n\r\nOverall Score:  (6.12/10)",
            "date": "2014-10-06T20:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 163921,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=163921"
        },
        {
            "content": "Oh boy. I....I don't even...I don't even know where to begin with this crap. I don't. I really don't.\r\nWell got to try I guess. Hellos people I am Josh and today I am reviewing the gender-bender anime Himegoto....Yeah.\r\nStory- The story is about a guy who cross dresses who is in debt thanks to his parents. He gets saved by three middle school council members and basically becomes there bitch in exchange for them paying his huge debt.\r\n.............*Takes sip of water*\r\n....What? You thought there more? You thought I go more into detail? Well I hate to break it to you but that is really the onlystory in this. The dude has to dress like a girl and become there bitch and do what they say. If you want me say more I guess I can say they are rivaled by some other council full of crossdressers. That's...That is all I got people.\\n\\n\r\nArt- The art is pretty good especially for something this short. It's nice to look at minus the fan services shots, but these shots would be disturbing and uncomfortable no matter what, female or male but it is definetly something I want to un-see \\n\\n\r\nSound- The sound is alright. Nothing particular horrible but nothing amazing or that good to be honest.\\n\\n\r\nCharacters- Yeah I'll cut straight to the point on this one, the characters are forgettable as hell. Basically common tropes you have seen in likely a dozen anime. A majority of the main ones are crossdressers include the MC's little brother. Hell the show highlighted them as traps. Really that not me saying that the anime flat out said it. Then there are like 2 other cross dressers, one dressed as a maid and some chick dressed as a dude. Then you got the 3 council member girls who are about as perverted as you can getting excitement out of his dude crossdressing and him being there bitch.\\n\\n\r\nEnjoyment- I mean I seen worse. It isn't the worst thing I seen. I was more or less bored then I was creeped out watching this but it was still bad to watch from beginning to end.\\n\\n\r\nOverall- I would mostly recommend this series for those that are fans of crossdressing and gender bender stuff I guess. That is obviously the target demographic so if your like me and don't like this stuff, you might not enjoy this at all\\n\\n\r\nWith that being said, peace people",
            "date": "2016-07-14T18:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 224042,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5378004.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/JoshuaJones16",
                "username": "JoshuaJones16"
            },
            "url": "https://myanimelist.net/reviews.php?id=224042"
        }
    ],
    [
        {
            "content": "Before I actually begin I'd like to clarify some stuff. First off I am a straight man, not that's there anything with being gay. Second I'm actually a fan of traps and gender benders. (I'm a man damn it I have needs.) Finally I've read the manga which is a lot better than the anime (but still pretty bad.)\r\nAs far as storylines going the show begins as a knock off of Hayate no Gotoku being that he parents ran off leaving behind a debt with the Yakuza. (Japan's Mafia) His debt is paid off by the student councils of the terms of him living therest of his school life as a trap.\\n\r\nAside from the whole beginning I'd say it was pretty original a concept. However its only good concept wise. There is no actual plot, and most of the show is trappy fanservice goodness. Though the writer went overboard with the traps. I know there's like six cross dressing students at that school which ended up being just annoying.\\n\\n\r\nAnimation and character design were pretty mediocre, especially with guys crotchs moving around like its some kinda jello. I know my crotch has never moved like that and I'm sure even if I wore some panties it still wouldn't move like that!\\n\\n\r\nMusic was forgettable especially since I had to watch a three minute commercial to watch a two minute video, I pretty much skipped past it after the first watch.\\n\\n\r\nThe only character development was how the protagonist Hime slowly went from I hate cross dressing and being a trap to women pride!... Okay, slight exaggeration but still he his his chest as a man. Yeah I swim with a T-shirt on but if I got somehow removed I wouldn't cover myself. Especially in such a feminine way.\\n\\n\r\nOverall the only reason I can see someone watching this is if they're A. Paid to watch anime and review them, or B. A fan of traps or believe said traps are actually girls. (Sweet ignorance) I myself genuinely enjoyed it, but unless your A., or B. I wouldn't watch it.",
            "date": "2014-10-05T04:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 163681,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3658019.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/GoodLuck",
                "username": "GoodLuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=163681"
        },
        {
            "content": "Himegoto, adaptation of the same name, is a short little mini series about traps. Really clean cut and dry; lots of traps to be more specific. The summer season was riddled with this theme and frankly it was bad. I am not 100% sure what the industry is attempting to do by banking on gender bender adaptations, but this was something they probably should have put on the shelf.\r\nI won't lie; I like traps. The gender bender genre has become one of my favorite targets when a title is released, so naturally Himegoto was on the top of my list. The first problem I hadwith this series is that the studio opted for a short mini series rather than a full half-hour block which is similar to most TV serializations. The plot was non existent; not saying there was a plot to being with, but the studio attempted to cram what could have been a longer animation block into a short episode. The short episodes did fit the awkward humor one would associate with a trap character, but no other purposes were served beyond character interaction.\\n\\n\r\nThe characters and character themes were mediocre at best. The idea of the trap is that the character isn't distinguishable between the line of man or woman. This show fell flat on its face using the gender bender tagline because it introduced practically every character as a trap. A plus and negative if your fetish is trap. The character personalities were dull; I have nothing more to say but boring.\\n\\n\r\nI did like the animation studio's simple technique. The style felt more chibi-esque in appearance. The color choices were bright and fit the overall happy tone of the story. The voice actors were poor and couldn't act out a line for shit and it ruined the colorful atmosphere. Fairly typical for new voice actors in my opinion.  The character designs were a bit tricky. I admit I was deceived for some part on the identities of certain characters. The usual animated dick-bulge-out-of-panties seemed like a forced habit to get jokes across and was rarely needed. Unfortunately, the animators choose to animate every character as a female and it ruined the opportunity to really milk a true gender bender. \\n\\n\r\nBeyond a colorful sets of strokes; a poorly executed gender bender theme; obvious exploitation of an up and coming character model; Himegoto does not stand out even as a ''normal'' show. This is simply an average or below average mini series to kill some time and get a few laughs.",
            "date": "2014-10-08T17:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 164129,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=164129"
        },
        {
            "content": "I've noticed so many negative reviews that I decided to write my own to point out important details which many watchers have missed. Traps, allegedly fan-service, lack of story and repetitive jokes made many watchers to give negative reviews.\r\nFirst of all, Himegoto is a sexual-harassment story wrapped up in a slice of life comedy, so it's not for everyone. It's a short anime (also manga doesn't have much more material either) which means that main role is creating enjoyment, all elements besides fun are less developed and it's understandable that such short anime doesn't have much story development (a guy bribed to dress up asa female and suffers sexual harassment), sound and art are nothing special and characters may seem blunt, but connections between characters, their reactions and motifs can be understood if attention is paid to conversations. \\n\r\nWhole story is to make jokes about traps, people being trilled and obsessed with them,  jokes follow similar pattern to put protagonist in awkward situations, but they differ (though outcome is the same, cannot disagree with that).  About \"fan-service\", I believe those scenes were meant to be a joke, not just to please fans. For example [[*SPOILER* the moment when Albertina II was measuring Himegoto with tailors' tape and he made yaoi sound and weird pose *SPOILER*]] which most likely means that such \"fan-services\" are overreactions to boost jokes.\\n\r\nHimegoto may be just quick entertainment, but I got impression that bullying and sexual harassment can be researched after comedy layers are removed and all what remains are relations between characters, conversations and tasks Himegoto had to do. Characters' nature can be noticed, to pretend and hide real intentions, which brings some depth to this show.\\n\\n\r\nIf you like short, quirky and controversial comedy which includes sexual harassment and jokes about traps, look further no more. Though it doesn't have much of story, art and sound, it's brilliant in enjoyment and you will surely have a good time if this show fits your taste, otherwise you'll be like many others and write negative things after show didn't match your expectancy.\\n\\n\\n\r\n****SPOILERS****\\n\r\nI will add few more thoughts on core of Himegoto, don't read further if you haven't finished it.\\n\r\nDespite being short, this show can bring strong message that anyone can be a douche and manipulate others. Having paid Himegoto's debt, student council didn't put him in any better situation, using him for gathering money (nobody admitted to him it was all about the money) and treating him worse than a slave, placing him in all kinds of awkward situations. Public morals committee members are Himegoto's only allies, even though its president (Mitsunaga or \"Mittan\") may seem annoying or rude, he actually cares for Himegoto and tries to stop student council bullying. I think Mittan said that he was bullied by student council, which means student council targets young and weak boys who don't stand up for themselves and allow others to use them. 18+ caring to profit from Himegoto, Albertina II to get more inspiration for manga and make Himegoto cosplay, while Unko is more childish and isn't rude to Himegoto but follows the group so she doesn't stand up for him. No matter how much I enjoyed this show, ending was a letdown. The problem is that Himegoto was portrayed always as a weak character (remained the same from start to the end) and in the end student council came to the rescue and then like everything came back to start which would ruin the message, but it's just short fun and it's understandable, though it had a lot of potential to show that sexual harassment can happen to men and that women can be awful people who manipulate others and seek profit and fun no matter how others are hurt. If ending was different, view on this should would have been much different, but despite this drawback the show is still enjoyable. \\n",
            "date": "2017-05-27T08:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 248634,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/valtiel01",
                "username": "valtiel01"
            },
            "url": "https://myanimelist.net/reviews.php?id=248634"
        },
        {
            "content": "Absolute garbage. And that's not coming from some salty moe-hating weeb who thinks any anime with a pink color scheme is trash. This review is coming from an ACTUAL TRAP. I am a professional cosplayer/crossplayer who finds the gender-bender genre amusing for obvious reasons. I went into this wanting to see an entertaining trap anime, but was instead treated to the abuse, sexual assault, and rape of an innocent boy who wanted no part in this. The protagonist, Hime, is the only likable character and his internal character development from hating crossdressing to enjoying it reminds me of myself. Too bad he gets groped, humiliated,and effectively raped throughout the 52 minute runtime. Halfway through I turned up the playback speed to double because it couldn't go fast enough. Instead it got worse and worse and an anime that could have been uproariously funny or provided an interesting take on self-discovery turned into sheer child abuse. It made me very uncomfortable and I just felt bad for the protagonist by the end. The main supporting characters excepting the Public Morals Committee were shallow, cruel, and downright gross. The soundtrack was dull, and very cliche. The visual design was nice, although a bit typical for the genre. The only redeeming quality of this flaming garbage dump is the interesting character development in the protagonist, that is, all 5 minutes of it. It's really too bad that this went the way it did, relying on sexual humor and harassment in a cheap bid for laughs. This could have been wonderful, but turned out to be a depressing story about an abused boy.",
            "date": "2019-02-20T12:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 302084,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7782917.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SpetzisnotaWeeb",
                "username": "SpetzisnotaWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=302084"
        },
        {
            "content": "This anime had a lot of potential as a ecchi comedy, but they made a lot of mistakes:\r\nThe humour is way too fast and is basically shoved down your throat, if each ep was like 10 min instead of 4 min then it could have done that.\r\nThe jokes themselves are actually kinda boring and awkward.\r\nThe MC who is the most, let's say \"sane\" person out of everyone, doesn't act that role well. He comes off as half nuts and half sensible.\r\nThe good stuff are:\r\nTraps\r\nAnd more traps\r\nAlong with trap fanservice which any cultured person could enjoy\r\nThe characters are actually somewhat likeable though most of the timethey're just sexually harrasing the MC.\\n\r\nIn the last 2 eps the show just leapt from comedy to serious and kinda set me off, I'm not saying that the MC acknowledging the weird shit happening around him is bad but it was done wrong. If we take a look at Zombieland Saga, another comedy which was extremely funny and had good jokes, even that show got somewhat serious at the last eps, but this was done right as it was built up from ep 1 unlike Himegoto which made no foreshadowing and other stuff whatsoever.\\n\\n\r\nI can express the entire anime in just under 10 words:\\n\r\nIt had potential, it could've been great.",
            "date": "2018-12-23T22:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 296674,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6925900.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Draco_the_Dragon",
                "username": "Draco_the_Dragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=296674"
        },
        {
            "content": "Himegoto is something. It's trap heaven; like 50% of the cast are traps. Actually I decided to watch this cuz it has trap fanservice (don't look at me, it's a thing). Also I did this review since I found no female perspective on the show. The jokes are quite trashy and only a few are considered smart like when one of the girls tried to take Hime's clothes off in an art room. Another problem is that Hime and most of the other traps are well cross-dressing against their will. I can get past that, but it would be so much better if most ofthe traps are quite willing to cross-dress. (like Hideyoshi from Baka and Test, and Kuronosuke from Princess Jellyfish). Overall, this is a pretty meh show, and I suggest it if you are into traps or trap jokes.",
            "date": "2015-08-26T20:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 197161,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1100351.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 1,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ClicheReviewer",
                "username": "ClicheReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=197161"
        },
        {
            "content": "If it's a guy it doesn't matter, that's what the series all it was...\r\nHUH?\r\nHere we do called TRAPS... More like A boy who crossdress in order to be a girl or A boy who's trapped in a female body but with-- GOHUUM you know THAT? xD\r\nPrecisely Having a normal life in a school treating you as a Hime Type.. who rubs you in a wrong way.. Man aren't they a teaser.. PFFT \r\nWOOPSS Hey you Jr!!! don't even think of hardening my ERYNGUS.. Damn did i get a weird b*ner alert..\r\nBack to the Plot..\r\nShould I just summarized it\r\n\"Arikawa Hime\"\r\nThe mannerism and voice a bishoujo kanojo\r\nNo..More feminine than any woman\\n\r\nBut he's a TRAP\\n\\n\r\nMost of the girls in his council are quite jealous of his ahmm i mean her and so thin \\n\r\nbut he's a TRAP\\n\\n\r\nLooking good on his/her school uniform\\n\r\nBut he's a TRAP\\n\\n\r\nThe sun rise up\\n\r\nand yet still Hott\\n\r\nThe birds are chirping\\n\\n\r\nBUT....\\n\\n\r\nHe's a TRAP\\n\\n\r\nEnd of the story...\\n",
            "date": "2016-12-05T07:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 234927,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5472966.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HikiNEET021",
                "username": "HikiNEET021"
            },
            "url": "https://myanimelist.net/reviews.php?id=234927"
        },
        {
            "content": "Before I talk about the show there is one thing I want to mention. The pun in the title is actually kind of clever and made me laugh when I realized it. Okay on to the review.\r\nThe story is about a poor, feminine boy named Hime being paid by rich people to whore out and cross dress for them and he agrees to this because his parents are assholes and left all of their debt in his name. And when I say 'whore out' I mean it, you see his penis wobble around a lot in this show, don't worry they cover it up withhis panties (which he wears even before he cross dresses for them... for whatever reason).\\n\\n\r\nThe art and sound are all that you would expect from a 5-minute episode kind of show. Not good, not bad, enough. Except for the penis physics, they're surprisingly well animated compared to everything else, it's always bobbing up and down and the world just seems to aligned perfectly so you see it constantly, that's where all the budget went, huh?\\n\\n\r\nNow here's the part that really bugs me about this show, the part that really grinds my gears: the characters. All the main characters in this show (except for Hime) are all horrible, maybe not Makoto Itou from 'School Days' horrible, but up there. Unko, Belle, and 18+ (I don't remember her real name, I don't care enough) are complete assholes. There is a scene near the end, that I won't spoil, but my jaw dropped while watching it, I couldn't fathom what was happening or at how horrible these people are... just watching  it and smiling and even recording it. That's when it clicked in my head that it's not just a slightly sadistic cute show, but a slightly cute Sadistic show. The side characters aren't much better, Hime's little brother, Kaguya, tries constantly to have sex with his brother which was funny in \"I Can't Understand What My Husband Is Saying\" and cute in 'Candy Boys' but here it's just weird and uncomfortable. All the other people are forgettable with the only feature that stands out is that they all cross-dress. \\n\r\n'No. 1' is the only other character I like in this show. She gets verbally abused a lot by Kaguya though, poor girl. I think Kaguya does it out of sexual frustration, but I'm not certain.\\n\\n\r\nNow the only question left is: Why do I like this show? That's a great question and I'll give you the conclusion that I came to after rewatching the show a lot: \\n\\n\r\nHime Arikawa is such a likable character. He's cute, he's not dumb but no genius so he can know what's he talking about and be stupidly cute. He's always nice and tries to put his best foot forward (except for certain moments), he wants to make other people happy even if it's not in his best interest. When he cries you kind of want to hold him and make him feel better, the only bad thing about him is that he doesn't know when to cross the line until it's too late and his entire family is horrible. He's a lot like a puppy actually and contrary to popular belief puppies are cuter than kittens. \\n\\n\r\nPorn could be the reason too, but that answer doesn't really make me look good now does?\\n\\n\r\nGive the show a watch, I want people to suffer with me. Cheers.",
            "date": "2016-12-03T03:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 234790,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5701865.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Cam1922",
                "username": "Cam1922"
            },
            "url": "https://myanimelist.net/reviews.php?id=234790"
        },
        {
            "content": "I quiet enjoyed this short 4-min. episode anime. Its plot was good nothing much, but then again short series like these don't ever really have one. For a short series the plot was still good compared to others. I am very picky when it comes to art, but this anime had very good art. I usually find myself cringing when I come across these short series because of how crappy the art is,but the animation was great. The characters were fitting and the voices matched with the theme and plot of the story, no complain there. It was a fun ride and would definitely recommendthis to someone who is looking for a quick laugh and, obviously, is into the cross-dressing thing. \\n\\n\\n\r\nSorry if this was a crappy review, it was my first. Sorry and thank you (^ _ ^)b",
            "date": "2015-12-29T10:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 207224,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4499515.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/my_own_nightmare",
                "username": "my_own_nightmare"
            },
            "url": "https://myanimelist.net/reviews.php?id=207224"
        },
        {
            "content": "While I usually do not write reviews...this anime was just too funny not to write one about.\r\nHimegoto is a cross dressing/ecchi anime and when starting this anime you should expect just that. While the story is quite cliche, what is lacks in plot it makes up in comedy. Now, do NOT go into this anime thinking that its going to be anything more than a cross dressing/ecchi anime. You will be disappointed. Himegoto is practically just one big dirty joke. But if you just want a short, funny and quite lewd anime to pass time with, Himegoto is your gal (or maybe guy who knowsanymore). I overall enjoyed this anime, I didn't really have to pay attention per say, I could just laugh and kill time. Himegoto is not for everyone and if you want a cross dressing anime with an actual plot and/or less lewdness, Ouran Highschool Host Club is a classic and if you are looking for an anime like Himegoto, MM! is very good one of the same caliber.",
            "date": "2017-07-29T15:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 254164,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4531532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/elizawolf22",
                "username": "elizawolf22"
            },
            "url": "https://myanimelist.net/reviews.php?id=254164"
        },
        {
            "content": "Himegoto is served in 13 eps, which is each ep duration around 3mins (so sad it's so short -sobs-). After gave brief description about the story, I will start the review from the story itself. The story seems so grim for the hero who's forced to be a girl, dressed as a girl, and bullied because of it. The funny moments gently flows from that misfortune of the hero-in-debt. Based on quite simple probs, the school life turns into scenes full of laughter. Honestly, it isn't enough to enjoy the series in 3mins. There are also lessons from the series, especially on the last twoeps of cherish the friendship.\\n\\n\r\n    Now, about the characters (wwww~ I even laugh when type this paragraph). The story centers around 8 characters involved, 4 of them are student council members, include the hero, named Hime Arikawa. 4 others are from public morals committee, who never get along w/ student council. Collision of opinions and acts between them happens frequently, so absurd (゜ν`(∋─━┌(｀・ڡ・´ ┌)! Uniqueness among all of the members is the tastiest reason why you should try to watch this one! Don't jump to conclusion so fast, you'll reveal the hidden truths of the characters one by one, not to mention, in a humorous way.\\n\\n\r\n    How about the music? So lively I could say! When I usually skip the OP after watched it once, I didn't treat Himegoto series OP the same as others. I wait it patiently and stemed-up to the song. I personally don't know and never had to search before whether there are characters song available or not. But I can say by the OP itself, it's nice and fit the series.\\n\\n\r\n    The last aspect may be the graphics. Not much to say from the graphics use for the series. No special or superior thing on it, but please note that the anime is well prepared, different from some short series w/ somewhat below average for graphics. The colours are mixing right, not too bright, tends to emphasize the prominent colours. The details and movements of scenes or characters are good.\\n\\n\r\n    Summary, for the trap genre as the main points which is rare to be animated, I really idolize it. Override the plus points from my point of view, I give 8 for Himegoto series. ╰( ´・ω・)つ──☆\\n\r\nPros:\\n\r\nTrap as main dish\\n\r\nThe characters which bring joy\\n\r\nSounds lively the music\\n\\n\r\nCons:\\n\r\nMostly trap topics\\n\r\nSomewhat average graphics (and censored, well I watched the non Blu-Ray ver wwwwww~)",
            "date": "2016-07-23T23:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 224811,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224811"
        }
    ]
]