[
    [
        {
            "content": "When one gets to point where they begin disregarding anime because they have too many girls on their front poster, it's probably time to take moment and re-evaluate. Granted, I've forced myself to sit through so many generic harems, rom-coms and ecchis these past few years that it has almost become reflexive of me to steer clear of any anime which possibly looks like it may contain any one of the aforementioned three. It was only natural then when I saw the poster of The Idolm@ster, an ensemble of 13 cute girls gawking up at me, that alarm bells tripped off in my head likefire sirens at a pyromaniac's convention. Only due to vigorous recommendations did I reluctantly pick up the series later on.\\n\\n\r\nProverbial justice looks down on the pretentiously knowledgeable, or so it would seem. My transition from skepticism to fanboyism was swift. Within episodes I was converted, all preconceived doubts I harboured for the series unfounded or long forgotten. I almost felt ashamed, my predictions of meaningless plot and mindless ecchi not only completely wrong, but also reflected the conceited critic that I had become. The Idolm@ster humbled me, never again shall I judge an anime at face value.\\n\\n\r\nThe Idolm@ster follows story of 765 productions, a small time idol agency and their road to stardom and success. The narrative of each episode are alike but flexible, each one generally focuses on the backstory of one character, but also contains plenty of interwoven exposition of various other characters so that no episode can really be considered standalone. The general theme of each episode often revolves around a character issue or weakness, some form drama arises from this issue, which is then eventually resolved with the character experiencing some kind of revelation or growth. In many episodes the show cleverly relates the story to a broader context; for example the episode \"Everything Starts with One Courageous Step\" refers both to Yukiho's small step in facing her phobia, and the day's events as 765 production's first step towards their future. \\n\\n\r\nThere are times where the structure of each episode feels a little formulaic, however this is largely offset by the large variety of different stories the show offers. The tone of the stories are what I like to call very PG-13 esque, many of the problems and struggles are grounded in realism, but airbrushed with a heavy hint of optimism. Whilst the drama does get quite heavy towards the later stages of the anime, you can always rest assured that there will be a happy conclusion. In fact, the entire overarching theme of the anime seem to revolve the simple ideas of happiness and optimism which it conveys well, sometimes to a fault.\\n\\n\r\nThe characters of course are, quite literally, the stars of the show. It quickly becomes apparent how unexpectedly deep the characterization for these girls go. Each character is unique and Idolm@ster goes out of it's way to make sure these girls all interesting and memorable, which it does a surprisingly good job of. Idolm@ster features an amazing ensemble of voice actors that do a fantastic job of bringing these characters to life, both on stage singing as idols or off stage exchanging playful banter with each other.\\n\\n\r\nIronically, the true unsung hero is actually the main protagonist. Given a largely clean slate, the nameless \"producer\" remains very undeveloped and uncharacterized, acting as a role of sorts for the viewer to jump into, (if one was interested in that sort of stuff). What it also meant was that the spotlight always on the girls, never stolen away to implicate or relate the girls with a largely support figure character, romantically or otherwise. Funny how irrelevant the titular character ended up being.\\n\\n\r\nThere are many standout qualities The Idolm@ster offers, but the gem of the glitter has to go to the cinematography. In many ways the cinematic progression of the show reflects the characters themselves. While 'offstage' the production value is reasonable at best, easy to look at but not spectacular. The anime goes about it's daily business, not hinting at the show that's about to come. \\n\\n\r\nThen, as stage is set and the music cues, here's when you finally realize that all bets are off. Explosions of lights and sound ensue, magnificently choreographed sequences aided by thrilling transitions, zooms, pans and cinematic techniques I didn't even think Japan knew existed, all cumulating in an electrify experience that's really putting my vocabulary limit to the test. The contrast of onstage and off really allows you to appreciate the level of workmanship devoted into these few minutes of animation. And then there's the ED sequences, which being unique to each episode itself is already unprecedented, also offers some great imagineative style backed with wonderfully fitting music. I have nothing more to say about The Idolm@ster's production value, other than two giant thumbs up of approval.\\n\\n\r\nThe Idolm@ster is in many ways a neat little snippet into a prominent Japanese idol subculture. Though perhaps not entirely accurate and/or realistic, The Idolm@ster takes a risk with it's presentation, using what could easy come off as a simplistic and childish tone, and instead delivering on a show that has both enthusiasm, energy and character.\\n\\n\r\nWatch Idolm@ster with an open heart, and you'll quickly discover the sparkle that is perhaps one of the most underrated anime this season.",
            "date": "2011-12-26T02:55:00+00:00",
            "helpful_count": 362,
            "mal_id": 50173,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321647.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Ryhzuo",
                "username": "Ryhzuo"
            },
            "url": "https://myanimelist.net/reviews.php?id=50173"
        },
        {
            "content": "I'm sort of a strange fan of the iDOLM@STER series. In terms of experience with the series, i've only seen Xenoglossia myself, which I also enjoyed very much, even though the other people I talked to about it didn't really seem to like it. Aside from that, i've never played any of the games associated with it, so I can't say I have any experience with them.\r\nThat being said, The iDOLM@STER so far has been quite an enjoyable experience for me.\r\n(Please note that all things said below are my opinion only! Also, most of the things I talk about are already subjective in nature, sonot everyone will agree with the verdicts that I lay out for it. I respect everyone's opinion and it's ultimately up to you as the reader/viewer to decide if you agree or disagree with the points I discuss. With that being said, enjoy the review!)\\n\\n\r\nStory;\\n\r\nIn terms of the story, I can attest that, so far, they have done a great job at keeping it consistent. The story as you may already know, is about a group of amateur idols (the main cast) and their journey towards reaching their goals. \\n\\n\r\nKeep in mind that this isn't just restricted to becoming a successful idol. While (nearly) every character in the cast wishes to become a popular, there are also a number of other goals that the characters are aiming to achieve alongside their journey through the industry. These goals are unique to those specific characters, and, in showing that, the show adds a side to it that increases the variety the of plot material as you are able to see that the cast isn't just a group of people aiming to do the same exact thing.\\n\\n\r\nAlthough there is no real central plot to the story aside from them wanting to become popular idols, the show supplements that fact by adding in sub-conflicts that different members of the cast face while they progress and grow. This is also made more interesting in that it shows how being an idol interacts with the character's lives and how it may sometimes get in the way of or complement their other objectives.\\n\\n\r\nFor the most part, there hasn't been any heavy drama yet, but this may change in the future. There were some specific dramatic parts for some of the characters (Don't want to spoil.) which I thought were done well for the most part. Nothing that made me break down crying, but still legit and reasonably believable/enjoyable. The episode hid a glaring chekhov gun in early on so there is probably something large waiting over the horizon.\\n\\n\r\nThe comedy of the show has been mostly just light comedy, nothing that made you burst out laughing like Nichijou, but nothing that made you cringe in disgust like you've been told a really bad joke either. Most of the comedy is usually good enough to put a smile on your face and elicit a few giggles, which is good enough for me.\\n\\n\r\nThe show is, for the most part, separated into specific character-centric episodes where they choose one of the cast and focus on a slice of their life. This hasn't been followed strictly seeing as some episodes have been shown to focus on multiple characters, or even the whole cast equally to some degree, but so far, there have been a decent number (3? I think.) of character-specific episodes. So far, the show has done a good job of doing it both ways, by giving a reasonable chunk of the screen-time to specific characters for their spotlight episodes, and also treating the cast fairly equally in episodes that feature them all.\\n\\n\r\nThe show does a very good job of keeping a steady balance between idol-related business, normal everyday life trials, and also catering to each character's equally important side-goals as well. In my opinion, the story is very solid so far, and I can attest that it is accomplishing what it had set out to do and not straying too far from the main path.\\n\\n\r\nArt;\\n\r\nIn terms of Art, I can at least say that I enjoy it. The characters are designed very well and they all look nice. I don't have much to say about the art because this subject is incredibly subjective, right alongside music, so I can't really explain whether it's good or not. You either enjoy the style or you don't.\\n\\n\r\nSound;\\n\r\nI guess this category could be attributed to the overall music for the show. In my opinion, the music included in the show so far has been very good. The opening sounds great, and also does a good job in getting you into the mood to watch the show. The ending themes are very good as well, aside from them being enjoyable music, the songs are tailored to specific characters of the cast, making for a heightened experience that complements the characters when viewing their spotlight episodes. The insert songs are fine, and the BGM is fine as well. Other then the specifics mentioned above, there wasn't anything that stood out as particularly \"bad\" in terms of music to me.\\n\\n\r\nCharacter;\\n\r\nOh boy, this section was actually going to be pretty big, but I think I already covered a majority of it in the story section. Due to the nature of the show's lack of a centralized conflict, it's obviously going to have its main focus be character development.\\n\r\nThat being said, the show succeeds in presenting the characters in ways that make them unique and interesting.\\n\r\nThere are a number of different personalities to identify with and explore. \\n\r\nThe characters also come from a variety of different backgrounds, ranging from the poor to the rich, to the average every-woman to the mysterious others.\\n\r\nIn terms of character development, the show doesn't slack in making sure that all of the cast has a their own, unique and interesting set of traits, goals, personalities, incentives, and probably more.\\n\\n\r\nEnjoyment & Overall;\\n\r\nIn my opinion, it's a very solid show that knows what it is aiming to accomplish and isn't hesitant to go for it while also providing a very enjoyable experience to those who want to lend their time to watching it. As a small side-note too, I really enjoy shows that give you a look into the life of another while also teaching you things as well. If I ever decide to become an idol, I can always look back and see that, while this show is probably idealized in some aspects, it is still a fun look at what the life of an aspiring idol would be like.\\n\\n\r\nSome people may be questioning why I gave the show 10's in everything. Well, here's the thing, the show so far hasn't really done anything for me to actually say it's bad. It's basically that kid in school that's doing everything he's supposed to do. I don't feel right taking points off of the score of a show if I don't even have anything reasoning behind taking them off. The show is for those who are interesting in hearing a story about the lives of a group of aspiring idols and their journey to success. If you are not interested in watching a show like that, you can always just watch something else. \\n\\n\r\nThe show knows what it whats to do and is doing it well. It's developing it's characters, keeping a steady pace on the main plot, making sure every character in the cast is diverse and interesting, and for the most part, making your viewing of it worthwhile. I would recommend this to anyone who is interested looking for a light-hearted slice of idol life show to just be able to relax and enjoy.",
            "date": "2011-08-15T06:58:00+00:00",
            "helpful_count": 120,
            "mal_id": 41533,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/545575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/saikanokiseki",
                "username": "saikanokiseki"
            },
            "url": "https://myanimelist.net/reviews.php?id=41533"
        },
        {
            "content": "There are some anime series that you desperately want to love. You’re either drawn in by the premise, one of the characters will strike your fancy for some reason and you’ll begin a furious Pixiv binge in search of any fanart of them to the point that your computer crashes and you’re declared legally dead, or you see some shimmer of pure gold underneath that thick sheen of shit and mediocrity and want to see if it’ll be more evident later on. The Idolmaster was one of the latter series, and it left me feeling entirely unsatisfied from start to finish.\r\nThe premise is simple enough:Twelve girls of questionable talent with single-note personalities and insecurities all vie for the chance to become idols with the help of their talent company and their ever-faithful producer. This single idea takes them all over Japan as their popularity inexplicably soars and they learn important things like trust, friendship, and synchronized dancing. Say what you will about the overall quality, it sticks to this premise throughout without ever losing the spirit of the idea. If you’re not in the market for a show all about the power of friendship or supposedly catchy pop music, there won’t be much for you here. \\n\\n\r\nFor me, the most important thing in any show is how the characters develop and interact. Something with a fantastic plot or great production won’t leave much of an impression if the characters don’t; see Madoka Magica. Unfortunately, this is the first and gravest misstep that the Idolmaster makes. \\n\\n\r\nThough it really can’t be helped with such a large cast of main characters, there isn’t much gravity to how the characters develop or interact. One minute, soliloquies are dropped regarding what problems a certain character has on their rocky road to idol stardom, the next the plot tousles them on the head, tells them to move on with their lives, and it’s never brought up again. While I understand that everybody is supposed to develop, it still feels awkwardly crammed in when it shouldn’t be. \\n\\n\r\nThis would be acceptable if all of the characters were memorable in some way, but some quite simply shine over the many others, leading to some intimate moments feeling resolved much too quickly in order to get back to what the Idolmaster perceives to be the most important characters. Haruka and the Futami twins seem to take up the most time, leaving the likes of Azusa and Makoto in the background for all but a few scant moments when they could have been fleshed out and humanized much more. \\n\\n\r\nThese overly-sentimental bits are punctuated every so often by the meddling of a rival talent company, 961 Pro, led by the conniving Takao Kuroi, which essentially play out the same each time. While they’re a welcome distraction from the slew of halfhearted character developments, these scenes could have easily been left out without the series suffering in any way. Don’t get me wrong, these were the only episodes in which I believed that the 765 Pro girls would come out more mature and fleshed out in the end, but I acknowledge their overall pointlessness. They take away nothing from the experience, but they add very little in return. \\n\\n\r\nWhere the Idolmaster came closest to breaking out of mediocrity was in the last few episodes, as Haruka dealt with everyone’s newfound success and consequential estrangement. It’s well paced and actually competent, leading to a complete departure from the episodic format of before.\\n\\n\r\nStory and character-wise, the Idolmaster falls a bit flat for me, even with the competently strung together drama in the final episodes. However, if there is one area where it shines, it’s definitely the production. The animation is crisp, the character designs are pleasing to the eye and soft by comparison, the dancing is wonderfully choreographed, the music could actually be confused for something thrown onto the market to be bought by thousands of impressionable Japanese teens and otaku of all sorts… in short, the Idolmaster went all out to bring the games to life, and that’s something to be admired. \\n\\n\r\nYet, for all the dazzling displays and occasional moments of interesting storytelling, the Idolmaster fails to be anything more than a flashy series that’s ultimately completely forgettable. Yet I can say without a shadow of a doubt that this is the best adaptation of the game series that anybody’s ever going to make. I tried to like the Idolmaster for what it was, and I did enjoy it every now and then, but overall it was a disappointing experience that I wouldn’t in good faith recommend.",
            "date": "2011-12-23T19:33:00+00:00",
            "helpful_count": 113,
            "mal_id": 49971,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=49971"
        },
        {
            "content": "The Idolm@ster is an ecchi anime with tons of fanservice but don't worry, your parents won't get mad because there is never any sex! A Producer enters a world with tons of lonely models and they get into many panty-revealing, nose bleeding adventures. The harem increases one by one and soon, all the girls just want the producer to touch their boobs. If you are a man, I definitely recommend this anime. Why should we ever bother with hentai anymore? That's all Idolm@ster is about.... \r\n....Or so you thought. \r\nWell then, sorry to disappoint you but I lied. For some reason, Idolm@ster tries to sellitself in a way that strays from its true focus. It's probably a conscious decision for the director to choose a poster that screams \"ECCHI\". However, it doesn't stop there because while Idolm@ster is a fun slice of life that tosses around cliche characters with smiles and jokes that make you feel warm it, ultimately rolls out two of the most intense drama arcs I've come to enjoy.    \\n\\n\r\nAt a first glance, the characters seem to be the strongest point of the show. The show emphasizes this by dedicating episodes to each of them. Yet the characters are where I have my most complaints. Each idol represents a typical character trait - from a friendly klutz, to playful twins, a prince who tries to be a princess - we've seen them all. Also, some of the characters just feel less important, which is understandable because there are 13 main idols, but not really an excuse because you wouldn't attempt such a show if you didn't have the confidence in developing 13 characters.  \\n\\n\r\nStill, despite the flaws, Idolm@ster somehow is able to make each character memorable and fresh. The way they react with each other is extremely important in achieving this. Yayoi's episode would not have been so enjoyable if it wasn't for Iori. Chihaya and Haruka's relationship is a joy to watch and Miki's relationship with \"Honey\" is very fun. They are just side stories that continue throughout the whole series even though the series is episodic. We end up with a very heartwarming series as the characters support each other to achieve their dreams.  \\n\\n\r\nI also quite enjoyed the variety of ideas. Sometimes we get almost pointless episodes like Hibiki's and Azusa's that just make you laugh but then we suddenly get serious ones like Miki's. The most important episodes are the last 4 towards the end of the series where it unravels into a melodrama that really pulls some emotional strings. The directing was also varied as the first episode was all shown through a camera all the way through and episode 15 was a whole show that the idols were hosting.  \\n\\n\r\nYet what I love about this anime most is how everything seemed so simple, so happy, but there were tons of rather dark and complicated moments. The president's background with the antagonist president was enough to get you thinking. The whole introduction of \" Ryūgū Komachi\" made me feel extremely uncomfortable, because I just couldn't help feeling how jealous all the rest of the girls must have felt which was most apparent in Miki. The Futami twins episode made me feel even more uncomfortable because while it looked as if Mami was unhappy because she wanted to be with Ami, I really felt a bit of jealousy in her tone. The foreshadowing of Chihaya's past in many of the episodes really piqued my interest. It's funny how even in a beach episode with 13 idols, you get a small scene which ends up with a discussion about what if fame doesn't end with what you actually wanted. Haruka's feelings in her last arc, are actually quite dark. Realizing that what she wants is selfish, she keeps it all to herself but in the end it's too much for her. And don't forget about Iori's blackmailing. There are many hidden emotions that never are being said, most notably Chihaya's anger towards Miki for abandoning practice even though she was the one who kept the group together when they all were worried. They are all little things, but when you put them together, you realize that this is no coincidence and they were scattered throughout the show on purpose. It adds an extra layer. \\n\\n\r\nI'm not that great in talking about animation and sound but I feel this anime definitely deserves some sort of recognition for it. The music was definitely fun and fitting but it really wouldn't have made an impact if it wasn't for those live performances. Those music videos were gorgeous. There is something special about the camera angles, the lights that explode, the choreography and uniforms, its just plain eye candy. They really put a lot of effort into making them - the details to the flying hair, few recycled scenes - I loved them all. \\n\\n\r\nYou see, Idolm@ster sells itself as a simple slice of life but if you pay enough attention, you'll notice the complex ideas hidden away in the story. Its easy to compare Idolm@ster to K-On!, as both seem to be a character-focused shows about girls having fun, yet I feel Idolm@ster tries to trick the watcher into thinking that while it dashes small hints of jealousy and sadness in the background. Its almost like a real show, because your idols are gorgeous on stage, but they are just humans behind the scenes. \\n\\n\r\nOh, and I wouldn't mind marrying Haruka.\\n",
            "date": "2012-06-03T07:02:00+00:00",
            "helpful_count": 90,
            "mal_id": 62543,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/226763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sanagami",
                "username": "Sanagami"
            },
            "url": "https://myanimelist.net/reviews.php?id=62543"
        },
        {
            "content": "Story: 3 (no impact. Mostly episodic, and while episode 08 is the only one that i like, the rest was boring for me)\r\nArt: 8 (moe-moe cute girls)\r\nSound: 7\r\nCHaracter: 2 (annoying and childish) \r\nEnjoyment: 2\r\nOverall: 2 (don't bother this at all)\r\nBefore proceeding to review sentence, allow me to apologize for my harsh overall ratings. \r\nThe Idol Master has potential to be the most entertaining idol anime because it was adopted by A-1 Picture that notably has abundant budget to create appealing animation, art, and music/OST. Unfortunately it falls apart from the expectation due to that it diverges its way from being realistic in idol topic...or notso serious if you like. The reason i prefer idol anime to be more serious nuance is because idol anime heavily involved in, not only in character development from childish to more mature idol-like person, but also frequent engagement in business commercial that may connect to political things.\\n\\n\r\nBelow is a quick bird view for screening purpose. If you don't want to see those things, please see the other two idol anime out there.\\n\\n\r\nThings that are lack of: \\n\r\n- Very little internal conflict exists within group members and individual \\n\r\n- Very little competition, and thus conflict, between idol group\\n\r\n- No idols scandal at all\\n\r\n- Mediocre Lack of management, marketing, networking story of how to lift the idol group to the top \\n\r\n- Although there are some internal problems needed to be solved by idol group member, most of problems are trivial, which don't need to have manager for that. It is just as if the manager and director in idol master is represented just for the sake of completeness, without further development. \\n\r\n- No interesting characteristics or traits of idol members. Worse, most characters are annoying as hell\\n\\n\r\nIdol Master could be said to be similar just like school club activity (slice-of-life), except it was flavored with idol taste. So it's just sad that, while art and choreography are sparkling, it's not be complemented with more mature and non-mediocre story, the things that i'm looking for, hence ripping off the balance of interesting dimensions of idol topic.",
            "date": "2016-07-31T06:59:00+00:00",
            "helpful_count": 67,
            "mal_id": 225505,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4786637.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/KUNYIT",
                "username": "KUNYIT"
            },
            "url": "https://myanimelist.net/reviews.php?id=225505"
        },
        {
            "content": "The story revolves around 10 wannabe idols and the staff at their agency 765 Productions. The anime includes all the characters from the games along with their original voice actors making this series great for the original fans of the franchise. The first episode which aired in Japan on July 7th this year introduces the audience to the characters via interviews with each idol and member of staff, giving us an insight into their reason for becoming idols and working for 765 Productions. This was a very original introduction to the series and seemed like a great way of telling a story while keeping thedating sim feel of the original game. I don't know if the whole series will be done like this but my guess from seeing the sneak preview is that it won't and I fear that this original concept may be scraped for something more typical of this genre. Visually IDOLM@STERS is great! Like A-1 Pictures previous animes, it's well animated and the backgrounds (though digitally done) look spectacular. The characters are as peppy and lively as they are in the games with each idol having their own different personalities and fan appeal from the large boin to the mysterious type.  Over all, I'm looking forward to seeing where this series goes from here and I expect there will be a lot more song and dance in the future.\\n\\n\r\nRough review by Charles Shepherd\\n\r\nwww.electricbloomwebzine.blogspot.com\\n",
            "date": "2011-07-10T01:41:00+00:00",
            "helpful_count": 30,
            "mal_id": 38918,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510334.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/electricbloom",
                "username": "electricbloom"
            },
            "url": "https://myanimelist.net/reviews.php?id=38918"
        },
        {
            "content": "I was thinking about giving this a quick spin but im gonna keep it short, since thats my thing.\r\nSo someone decided to make this video game into an anime, the story is about girls trying to be idols. Well I don't really see many game/anime adaptations go well and I can't really say im enjoying this series all that well. The plots kinda like a generic moe blobfest, and I think theres too much of that going around now. \r\nThe story consists of many different arcs with each idol being dug into deeper, their person and abilities are shown very vaguely and its a bithard to keep up with each one since a linear story line is non existent. Simply put, its about each girl and how everyone showcases their different talents to become famous idols. But whats the point in having so many characters, if you still don't know who is who when you're halfway through the series? Thats my take anyways, too many characters.\\n\\n\r\nNow lets try and look at it from the monitor and tune in with your stereo or mono.\\n\\n\r\nThe art itself isn't groundbreaking in any right what so ever, its simple. Maybe simple is good, sometimes art itself can take away the bads. Not having played the game you don't know the soundtracks, this is where the adaptation goes bad, in my opinion anyways. As I said before with art, sound can do the same. Lets take a walk back to 2010 with Inception. Many would say that the soundtrack itself made the movie that much better and that the movie itself would have sucked without the soundtracks. The series lacks music during each episode itself, while the ED tracks may be different too many people don't actually view ED's.\\n\\n\r\nThe characters are pretty generic, can't even make a full section off that. It doesn't meet the par for moe standard that shows like Azumanga Daioh and K-ON! set.\\n\\n\r\nOverall it fails to keep my interest enough, enjoyment isn't the word I would use. Rather on hold simply because its just too much.\\n\\n\r\nHey now, if you're into musical adaptations give it a go.\\n",
            "date": "2011-08-13T00:38:00+00:00",
            "helpful_count": 23,
            "mal_id": 41401,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=41401"
        },
        {
            "content": "So this is the first time watching an \"Idol\" themed anime, and because of that I may be rating this better than I should, but all in all this is a great anime and I doubt I would change the rating even if I had experience with similar animes.\r\nStory: 9/10\r\nThe story really wasn't anything special to be honest. There were two main parts to the story (they can be differentiated by the opening changing). The first part consisted on the girls really trying to just get themselves out there and known to the world and while that may seem sorta boring, it really wasn't. Everyepisode was VERY engaging and it just made you want to know what would happen next. The second part is after they become more well known then what happens? While I can't spoil anything, I can tell you that the show does become a little more serious especially near the last few episodes, but it still keeps that really  nice, and fun atmosphere. I was really surprised by how realistic it became at the end to be honest and if you ever think that being a big celebrity group means that it's all fun and games, then you haven't seen this anime.\\n\r\nP.S. From episode 20 and on, tissues are a must (unless you are a stone cold person with no soul :P). It gets ridiculously emotional at the end like I was Yukiho at the end.\\n\\n\r\nArt: 9/10\\n\r\nIf you thought that the art was bad then I'm Harry Potter. Since this is a idol anime, good artwork is a must and The iDOLM@STER certainly doesn't disappoint. The characters were drawn out very nicely and I applause this anime for not depending on fanservice from the characters to sell the show. I guess it's just a nice change of pace from panty shots or revealing bras that are in many animes nowadays.\\n\\n\r\nSound: 9/10\\n\r\nThere's a good amount of singing that happens during the performances and while I didn't find many particularly special, I give serious props to the people that came up to the lyrics for the songs. It really must have been hard to write them especially to fit the mood of whatever was happening. One of the best examples is the song \"Promise\" sung by Chihaya Kisaragi in episode 20 (tissues!). It's a very sad/happy/powerful song that fit the tragic atmosphere.\\n\\n\r\nCharacter: 10/10\\n\r\nNow I know there's going to be those people that say that these characters were \"unmemorable\" or something, but I have to disagree. This was actually one of the few animes where I took my time and memorized every character's name just so I could get to know each character better. Plus can I just mention the character development? From start to finish, so many characters have been able to grow and learn, some being able to conquer fears to others trying to forget a dark past.\\n\\n\r\nOverall: 10/10\\n\r\nWell considering that this is one of my highest ranked animes should say what I thought about it. It's quite a ride from the beginning to the end and all I can say is to enjoy it. From the beautifully written songs to the characters, this won't be an anime you'll be disappointed in. And when the ride's finally over, you'll wish it had just started.",
            "date": "2015-06-21T13:35:00+00:00",
            "helpful_count": 23,
            "mal_id": 190845,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554963.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/King_Of_Light",
                "username": "King_Of_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=190845"
        },
        {
            "content": "Nearly plotless, fluffy as hell, and still pretty good. No CGI unlike Love Live!, which might be good or bad depending on who you are. Somehow manages to have each character be a character despite there being 15 or so.\r\nSuuuuuuuper homosexual, though. Single most gay thing I've ever watched, and I watched Boku no Pico, man. Not that it's a bad thing, just incredibly homo. Every character is a lesbian or Miki, the only confirmed straight one there.",
            "date": "2015-03-01T19:42:00+00:00",
            "helpful_count": 20,
            "mal_id": 181496,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scrambled1432",
                "username": "Scrambled1432"
            },
            "url": "https://myanimelist.net/reviews.php?id=181496"
        },
        {
            "content": "Short Tips:\r\nIn one word: Vibrant\r\nGood for: Light-hearted fun, colorful pretty art, watching to unwind and relax\r\nOther notes: De-stressing, motivating, makes you smile!  Cute girls and personalities :D\r\nFull Review:\r\nWith a name like IDOLM@STER, I confess I really didn't expect much out of this anime when I first started.  But after watching a few episodes, I was really really taken by the vibrant art and the colorful characters.  To me, watching IDOLM@STER is like eating colorful fruit candy-- it's just so vibrant and sweet and there's nothing unpleasant about it at all!\r\nThe story of IM@S isn't much to be honest, 12 girls striving tobecome celebrities (Idols) in Japan.  They start out very unpopular/not well known in a Production Agency, and this anime chronicles their rise to fame.  The story is rather predictable in many ways, but gives you a solidly feel-good type of vibe, as they start out as underdogs and gradually work their way up.  \\n\\n\r\nOne of the lower points of the anime features an arc with a really really stereotypical \"bad guy\" rival production company, and to be honest, the whole \"evil, greedy production mastermind\" came off as really really cheesy.  The story of that arc was pretty meh. \\n\\n\r\nBut I find their best episodes to be the ones where there's not so much of a driving plot, but more of a observation episode of what happens to a group of characters on a given day.  And this is because the characters in Idolmaster are absolutely outstanding.  They're fun, vibrant, colorful-- the voice acting is superb and the songs are enjoyable and catchy~   One girl in particular, Miki, has really really great charisma as a character and her VA has done a great job.  You can't help but like her and everything she does, because she does it all so well!\\n\\n\r\nIt's been a while since I've found an anime that's just so darn FUN and adorable to watch.  There's no real drama or angst (Or is there, in Episode 23?!), not really enough to make a viewer/watcher feel stressed or anxious or sad.  It's a really fun, vibrant and light-hearted anime, and will definitely cheer up or add a bit of pep to any day~",
            "date": "2011-12-14T13:54:00+00:00",
            "helpful_count": 14,
            "mal_id": 49177,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104423.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tealeafkitty",
                "username": "tealeafkitty"
            },
            "url": "https://myanimelist.net/reviews.php?id=49177"
        },
        {
            "content": "The IDOLM@STER is one of the best anime I watched. I love this anime because a lot of people can relate to some of the storyline. The girls also have various personalities. I also like it because their singing is amazing and the artwork is really good. Their dancing is amazing too.  The anime is one of the best I watched.",
            "date": "2012-04-22T10:10:00+00:00",
            "helpful_count": 14,
            "mal_id": 59413,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266335.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lovely-Chan_6",
                "username": "Lovely-Chan_6"
            },
            "url": "https://myanimelist.net/reviews.php?id=59413"
        },
        {
            "content": "Story: 9/10 - I love how the story progresses each episode. It wasn't focused on one-person's life only but everybody's. every character touch my heart. \r\nSound: 10/10 - I love the sound effects and fitted in every scence in each episode. Most of all, I LOVE the music. I am having so much fun listening to them. I loved J-pop more.\r\nCharacter: 10/10 - Every character left impact on me. They have different personalities and I enjoy watching them. All I am saying while I watched is \"This girls are kawaii!\"\r\nEnjoyment: 10/10. I SIMPLY LOVE THIS ANIME. Nothing less. \r\nOverall: 10/10. This anime is very funto watch. I am inlove.",
            "date": "2018-12-23T11:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 296630,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jd2281",
                "username": "jd2281"
            },
            "url": "https://myanimelist.net/reviews.php?id=296630"
        },
        {
            "content": "Being an idol is far from easy. On the surface, it may seem like the job is all fun and games. However, as shown in THE iDOLM@STER, unexpected twists and turns make this job a very stressful one. Despite this, being an idol is like a dream come true for many of these girls as they would undoubtedly give everything they have to stay as one. Based on the popular raising simulation and rhythm game of the same name, THE iDOLM@STER had previously been unknown to the vast majority of the anime universe. Before continuing on to the main section of the review, take notethat this adaption is my first experience with the iDOLM@STER franchise. \\n\\n\r\nArt (9/10)\\n\r\nI'm a big fan of well-choreographed stage performances and the ones in THE iDOLM@STER definitely don't disappoint. Considering that they generally suck up a lot of the show's budget it's surprising, but good to see, that there were TWO, as opposed to one, large-scale concerts that were shown. In both of these, I found the animation to be top-notch and the use of camera panning and angling enhanced my viewing experience greatly. The characters themselves were also visually unique which I thought was a nice treat. However, like virtually all anime series that have scenes of breathtaking animation, there are also times where the drop in quality is noticeable. Although this barely affected my viewing experience, the fact that it happened prevents me from giving a perfect score in this category. \\n\\n\r\nCharacters (10/10)\\n\r\nI came into THE iDOLM@STER knowing none of the 13 idols and having no idea which ones I'll end up liking or hating. However, after the 25 episodes, I can say one thing for sure: all the girls are likeable and interesting in their own ways. Although some got less screentime than others, I felt they all were developed reasonably well considering that most of them only had one episode that focused on them. The development for the \"main three\" (Miki, Chihaya and Haruka) was anything but unnoticeable. If one were to compare their characters from when they were first introduced to the final few episodes, it is evident that there was a great deal of change that occurred. Aside from individual character development, the idols, as a group, also show signs of growth and bonding throughout the series. A big contributing factor of all this development can be attributed to the surprising amount of drama that was present; more on that later. \\n\\n\r\nSound (10/10)\\n\r\nI'm quite sure that almost everyone will agree with me when I say the sounds category for this episode definitely deserves a perfect 10. Not only are there 25 different EDs and 2 catchy OPs, but also a slew of insert songs (at least one for each episode). With this much content, I find it unbelievable if one were to tell me that none of the songs were, at minimum, \"good.\" The BGM was also quite decent, especially the perfectly placed piano pieces of various songs at the right times. The seiyūs, although many of whom are not popular, did a great job with their roles as each character's voice seemed to fit their personality. On top of being able to voice their characters well, they showed great deal of skill by being able to sing decently as well, an ability that not all seiyū have. \\n\\n\r\nStory (9/10)\\n\r\nLet's be honest here - not for one second did I expect THE iDOLM@STER to have a story or plot. And for the first half or so of the series, I looked to be correct. However, once drama started appearing on the horizon, things took an unexpected turn. My image of THE iDOLM@STER suddenly transformed from one of \"my weekly dose of moe idols living their lives\" to \"an exciting and gripping drama surrounding moe idols\". Even so, I greatly welcomed this surprising turn of events and, in no time, the series won my heart; the best of both worlds - moe girls and intense drama - all wrapped up into a nice package that is THE iDOLM@STER. \\n\\n\r\nOverall (10/10)\\n\r\nWhat can I say? I absolutely loved THE iDOLM@STER. I know there are many out there who are skeptical about this adaption but I ask that you remember these familiar words of advice: \"Don't judge a book by its cover.\" Sure, on the surface, THE iDOL@MASTER may look like it only appeals to the hardcore otaku fanbase but underneath all the singing, dancing, and moe girls, there's a great story waiting to present itself. So whether you're a fan of moe or drama anime, I highly recommend you sit back, relax and enjoy yourself some THE iDOLM@STER; it definitely wouldn't hurt to give it a try!",
            "date": "2011-12-27T19:12:00+00:00",
            "helpful_count": 12,
            "mal_id": 50269,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=50269"
        },
        {
            "content": "This is the most memorable idol animes I've seen. I watched this when I was young and even now I can remember everything about this anime. Like what happened in each episode, the voice of each characters, their hobbies, personality, pet, appearance, song, backstory... And it's been many years since I've watched this, so it really takes a lot for me to remember them so well. That's what makes this the best idol anime (imo) ever.\r\nStory 7/10: The story is simple. A producer helping an idol group from a poor company rise to the top. There is no rival idol groups, or media scandals, ormany inner conflicts between members, but this story doesn't need all that. That's for more serious, seinen idol animes like Perfect Blue. Not every story needs to be depressing and remind you how the real world is a horrible place in order to be a \"good\" idol story. A simple story depicting 12 girls struggling with their own life and their idol career can also be amazing and enjoyable.\\n\\n\r\nArt 8/10: Character designs are perfect for their personality and they're very memorable too. They're simple (especially the eyes) but somehow each member manages to stand out from the others. It's like Mob Psycho 100. The art isn't the best but it fits the story perfectly.\\n\\n\r\nSound 9/10: Voice actors are great. Songs are great. I still have the opening song in my phone right now lol\\n\\n\r\nCharacter 8/10: Each characters have their own struggles. Even though all 12 members of the idol group were introduced in a single episode, I didn't feel overwhelmed and each of them have one or two quirks that make them very distinguishable and memorable. Their development and backstory were brought to light as the story goes on. And in just 12 episodes, the anime managed to get me attached to every single one of them (even the producer lol). There's no best girl. All of them are best girls! I also like how this anime isn't afraid to bring physical pain to the characters xD\\n\\n\r\nEnjoyment 9/10: I've watched this anime who knows how many times, not just for the songs, but also for the characters. I love watching Yayoi's episode when I eat because watching her eat makes me hungry every time. I love Azusa's episode because of how ridiculous it is and that makes me laugh every single time. I love whenever Miki shows up because she just has that aura to her that makes her really likeable. I love Hibiki and her hamster and watching them communicate is one of the best part about this show. I love the twins, the tsundere Iori, Takane, Makoto...etc, hell, even the boy idol group and faceless president and the producer himself. All of them are amazing.\\n\\n\r\nOverall 9/10: This is the first idol anime I've watched and the best. I don't know why Love Live is so popular. From what I've seen, it really isn't all that great compared to this. Their songs are good but their characters aren't as memorable as this. The best part about this show is its characters. You will fall in love with every one of them.",
            "date": "2019-03-05T04:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 302937,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4264843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ttcchen",
                "username": "ttcchen"
            },
            "url": "https://myanimelist.net/reviews.php?id=302937"
        },
        {
            "content": "This is my first review, so please mind my unprofessionalism.\r\nOriginally, I watched the first episode as a mere joke, but by the end of the first episode, it left me wanting more. The IDOLM@STER was the first idol anime I had ever watched, and it opened up an entire new type of anime to me. I had taken a liking to idol animes upon completion of this one. As I watched this anime of 13 idols grow bigger and bigger in popularity, it made me feel somewhat proud. Remembering them as beginners just in the first few episodes and top idols in the last fewhad me very satisfied that they had gone a long way.\\n\\n\r\nStory: 7/10\\n\r\nThe story overall, would be unique and different to me, compared to others. The whole story revolves around 15 year old idols that work their way up to the big stage. Unlike many other animes, this story takes place at the 765 production office and does not show any of the character's school lives. Along with some fillers, each episode was dedicated to one character, and hence great character development in my own opinion. Many animes leave me with an empty feeling; I felt that I would have wanted a better ending, but this anime, however, made me feel complete, and I didn't really want to watch anymore, it was a great ending to me.\\n\\n\r\nArt: 8/10 \\n\r\nThe art in this one might not be THAT great to some. However, as I am watching this in 2015, I feel that for a 2011 anime, it has greatly exceeded my expectations. I even would prefer this art then some of the art in this year. \\n\r\nThe art has a moe feel to it to me. It's simple and unique. Although the characters from certain angles might be a bit strange, it the art was amazing nonetheless.\\n\\n\r\nSound: 7/10\\n\r\nThe voice acting was good, it matched with the animation and was clear. The background music and sound effects was good, but not that good. In some parts of the anime, some did not fit, but imo doesn't really effect me overall. Im not excellent at judging sounds, but if I were to rate it without any criticism, I would give it a 7/10.\\n\\n\r\nOverall: 8/10\\n\r\nFirst, It was me trying to watch this idol anime as a joke, but in the end it had been one of my favourites of all time, and made me take a liking to idol animes. Each episode kept me locked on the screen and didn't make me feel bored at all, and upon completion made me feel complete and fulfilled. It's a happy, and sometimes sad anime, and if you haven't watched it yet. I highly recommend you should.",
            "date": "2015-10-19T04:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 201561,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PoorKid",
                "username": "PoorKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=201561"
        },
        {
            "content": "HONESTLY... When I heard of this show, all I expected were girls performing at concerts. What I did NOT expect was the journey towards performing, any problems that occurred, nor any backstory (yes, we get a lot)... The character development is insane. Both openings 1 and 2 (Ready and Change respectively) are really fantastic, and the animations are fantastic for both. The art style for the characters, the background, posters, concerts, everything is amazing. The music is fantastic, and the backstories of the characters we get the backstories for are amazing. I enjoyed this anime so much, and I did not expect an anime likethis to make me cry so much; 3 times in one episode I cried. I easily recommend this anime to ANYONE, this show is such a masterpiece.",
            "date": "2018-09-05T15:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 288219,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sip_of_Mercury",
                "username": "Sip_of_Mercury"
            },
            "url": "https://myanimelist.net/reviews.php?id=288219"
        },
        {
            "content": "I’d like to think that I’ve made plenty of ventures into different genres and styles of anime. Part of the fun in consuming the medium for me is finding something new to explore, and throwing myself in the deep end at times has proven to be a worthwhile experience. However, I’d found myself shying away from the realm of idol anime and I’m not too sure why. There was not much that appealed to me or reached out to say ‘you really need to give this a go’. I had to push myself to take a leap of faith and decided to use The Idolm@sterto do just that.\\n\\n\r\nThe Idolm@ster provided me with a bumpy ride but formed itself into something pleasant by the time the 25 episodes had come to a close. Was I blown away by the visuals, the choreography or the music? Sure, but the reason I enjoyed The Idolm@ster far more than I thought I would is because the show really isn’t about the music and dancing. It’s about the teamwork needed to make that all happen. That really caught me by surprise. It must be said that I’m not really one for the brand of music depicted, with its overly mushy lyrics and the fact that most songs come off as sounding the same to me. I went into the show expecting that to be the focus and have the characterisation poorly tacked on. I was wrong. Even though the cast is pretty much designed to cover all the ranges of emotions and personality types (i.e. the snotty one, the shy one, the mysterious one, the androgynous one etc.) they’re usually fun to watch. The Idolm@ster does a solid job of creating a cast you want to cheer on, even if some of them irritated me to no end. \\n\\n\r\nThe Idolm@ster follows 12 girls looking to make their big break in glitzy and glamourous world of idols. They dance, act and sing under the guidance of their producer as they desperately seek out a way to make a bigger name for not only themselves but also their production studio, 765. In the way of a story, as you could imagine, it’s pretty simple. The group take on jobs wherever they can while trying to better understand each other and industry that lays ahead of them. Trouble often strikes in some form, whether it be a wardrobe concern or someone out to sabotage their name. Early on I started to get worried because everything felt so aimless. There all these issues befalling everyone but even when things get resolved it’s back to square one, like nothing has really changed amongst the group as a collective. The comedy seemed to fall flat and the show tended to rely on it too much for its own good. My leap into the genre wasn’t off to the most comfortable of starts.\\n\\n\r\nIt’s the latter story arcs of The Idolm@ster that make sitting through the tedious opening half of the show worthwhile. These parts start to actually flesh out the characters, delve into their past and - above all - actually show the importance of depending upon each other. The struggles aren’t just simple filming but instead they create consequences for the group as a whole – and that’s much more engaging for the viewer. The questions the characters ask start to steer away from “How can I improve my image?” to “How can I make sure I’m not letting anyone down?”. While it can be fun to watch the cast act cute, it’s much more impactful and rewarding to watch them all resolve their personal problems. The drama is never overbearing though, thankfully. The show always maintains this sense of optimism without being dark or too serious for its own good. The balance is just right. Because we get to know all the cast that little bit more, watching them battle their way to the show’s conclusion is a fun experience.\\n\\n\r\nThe 12 girls themselves are a mixed bag. A handful of them came across as interesting, because you could actually see something holding them back and I was left wondering what it could be. Some are there to provide a bit of comedy. Some I feel were just making up the numbers. It would be fruitless to really harp on about what are ‘strong’ and ‘weak’ characters in the 765 group. Everyone will pick a favourite and latch themselves onto their story and cheer them on. That’s the beauty of a show like this. There will be at least one of them that will strike you as likeable or interesting. Some of them I couldn’t stand but that’s to be expected when you are writing to cover as many personalities as possible to appease to the widest possible audience. Some side characters feel irrelevant, including one comically evil villain, who does a better job at dragging down my enjoyment as opposed to being of great value.\\n\\n\r\nThe visuals are a treat. Performances look and sound the part – you can certainly see where the bulk of the budget was directed towards by A-1 Pictures. The vocals are top notch, both in and out of musical performances. The VA work helps breathe distinct identities into the large main cast. Biggest praise from me goes towards Asami Imai (Chihaya Kisaragi) and also Kenji Akabane who is the perfect choice for the loveable and often bumbling Producer.\\n\\n\r\nFor all its annoying quirks and characters, The Idolm@ster eventually becomes something a slight cut above average. Edging through the often unbearable opening half of the show at least helped pave the way for something more interesting to come. There’s nothing exactly memorable or mind blowing about The Idolm@ster. If you can come to terms with its often cheesy 'friendship conquers all' mentality then there will be enjoyment to be found. Give the show a try if you want something really simple and easy to watch and might just have you nodding your head along. It’s just a bit of colourful, melodic fun.",
            "date": "2016-03-13T03:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 212825,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3966203.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Tozzy",
                "username": "Tozzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=212825"
        },
        {
            "content": "I've heard a lot of things about Idolmaster prior to watching it. In fact, I heard a lot about the hasegawa model airplanes they came up some time ago. That kind of caught my attention and well, ironically about the same time this anime popped up so I decided to watch and see what it was about.\r\nBasically this show is about a bunch of girls from different backgrounds wanting to be idols with the help from their producer who remains nameless. \r\nStory\r\nThe anime starts off very slow. You are introduced to the characters and you aren't given much information on them until several episodes in.It really feels like a slice of life type of format, just replacing the \"school\" aspect of it with the \"idol\" one. It isn't particularly strong, but some episodes can be entertaining. The addition of the rival 965 firm makes things more interesting though, but at times though I felt like dosing off, which in my opinion signifies repeated story lines I've probably seen before. Not particularly great or really bad, but pretty mediocre. I give it a 6.\\n\\n\r\nArt\\n\r\nHmm...It's not particularly bad and it's not particularly great. There is a lot of moeness, which pretty much does nothing for me unless it's very unique; which it isn't. I'm not particularly bothered by the moeness like I was for other animes (like K-On for example). Character designs are ok, animation is decent and backgrounds are pretty good. Unfortunately, not something I'd consider noteworthy. I give a 6. \\n\\n\r\nSound\\n\r\nMost of the songs are j-pop, which aren't particularly good or memorable. They sound a lot like the stuff you'd hear on the radio for like a month and then never hear it again. Singing wise it's good, some of the voice actors do a very decent job. Not really much else to say about it. I give it a 5.\\n\\n\r\nCharacters\\n\r\nThe shows characters tend to be the more interesting part of everything. Most of them aren't quite what they seem. Some characters have gone through some very tough situations, others face difficult circumstances and for the show that's a good thing to convey to the audience. Unfortunately, it doesn't do much of it thorough for you to really appreciate or relate to the characters which makes it fall just short. I give it a low 7.\\n\\n\r\nEnjoyment/Overall\\n\r\nOverall it's a pretty average show. If you are into moeness you'll probably love it and if you hate moeness, you'll definitely hate it. I'm not in either camp, so I say it's pretty average. Characters can be memorable, but so far through 17 episodes the show hasn't really taken off in my opinion. The slice of life story line can be too boring at times and too predictable which just hurts the show overall. I give it a 6.\\n\\n\r\n------------\\n\r\nUpdate.\\n\\n\r\nSince the last time I wrote this review, the anime has improved storywise and character wise. You learn a lot more about 965 pro and why the boss does what he does and you learn a lot more about the characters. I believe it was episode 20  was probably the best episode of the entire series. It was very well done and very moving (you learn a lot about Chihaya's past) and I equate it to other famous anime moments like that in Clannad when Tomoya finally accepts his daughter. It was a dramatic episode that really just stood out from all the rest of the anime. \\n\r\nIt doesn't stop there though. We got to know more about a few other characters and the episodes just suddenly got a whole lot better. It's a shame they couldn't show us these great episodes until the ending part of the anime because it would have made the anime a lot stronger overall. Luckily I think they did enough to really make this anime stand out a bit more. In all I give it a high 7. The last few episodes really saved this show.",
            "date": "2011-11-02T02:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 46683,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=46683"
        },
        {
            "content": "Watching The IDOLM@STER was an experience similar to eating a Big Mac. It’s delicious and a joy to eat … until you discover a Whopper. The previously unrivaled now Big Mac tastes cheap and bland when compared to the Whopper, but still remains edible. My point I am trying to get across is this: The IDOLM@STER is fun to watch, but don’t expect too much from the series.\r\nStory – 7/10\r\nThe plot in The IDOLM@STER is a simple one. It revolves around the lives of the 13 girls who aim to become prospective idols. The IDOLM@STER manages to tackle the entertainment industry quite accurately. Episodes inThe IDOLM@STER feels divided into two separate types of episodes; the first being episodes revolving around a single character and the development of her personality and traits etc.; and the second episodes which focus on building the characters as a unit rather than individual’s. Unfortunately the majority of episodes are focused on building the individual’s. Why would I consider this something negative in the anime, especially when considering that The IDOLM@STER is a slice of life anime which are mainly character driven?  The problem I have is that the majority of characters get a single episode dedicated to them as characters, after which they only feel significant whenever the plot calls for it. It is near impossible to have the audience immediately care for a character when they are given so little screen time to show us their motivations for becoming an idol, or just explaining why the character possesses some kind of quirk. The only characters who I believe got a backstory which actually meant something, was Yayoi and Chihaya. Both of these characters had to deal with issues which affect their lives, in addition to being idols.\\n\\n\r\nArt – 7/10\\n\\n\r\nUnfortunately the trend of being mediocre is something which this anime adaptation and its creators – A1-Pictures – have in common. I would describe the art style as average, because nothing stands out to me. Thankfully there was nothing about the art which was badly done either. The character designs are diverse and colorful, and work well with the characters personalities and their occupation as idols. Both the openings are vibrantly done and a joy to watch.\\n\\n\r\nSound – 8/10\\n\\n\r\nNow if there is one thing an idol anime should excel, it has to be the music. The IDOLM@STER has some great tracks throughout the run of the anime. The only thing which annoyed me regarding the sound was Yayoi’s vocalist and the fact that we only heard snippets of the largest number of tracks throughout the anime. I have to applaud the vocalists for each of the idols as all of them –except Yayoi – was a true pleasure to listen to individually. Where they excelled at the most, were during songs performed as a group as much like the characters they were meant to portray, they complimented each other’s strengths and weaknesses. The ending character-/group songs are really fun to listen to and the openings even more so.\\n\\n\r\nCharacter – 7/10\\n\\n\r\nWith a large cast, it is usually really hard to develop the entire cast and not neglect a few characters. Unfortunately The IDOLM@STER doesn’t succeed in creating a well-developed cast, as the characters don’t get enough screen-time. Producer was the character which made me hesitant to watch the anime, as I was expecting a bland character which every male in existence can fantasize about becoming – much like the protagonist from the games. I was pleasantly surprised to see that Producer was a kind-hearted individual who wants to help his idols accomplish their dreams. Heck, I enjoyed him so much that I felt sorry for him when my least favorite character – Miki – fell in love with the guy. How he doesn’t contemplate murder on a daily basis is a truly amazing feat. Other than Producer, other characters I enjoyed were: Makoto, because of she is awesome; Azusa, because she has a motherly charm surrounding her; Iori, because she is a cute tsundere loli; Chihaya, because her character arc made me cry and lastly President Kuroi, because he was unexpected and has a fantastic seiyuu.\\n\\n\r\nEnjoyment – 7/10\\n\\n\r\nThe main reason I usually find myself watching idol anime is simple, they make me smile. IDOLM@STER had some genuinely fun moments throughout the anime, but unfortunately only four scenes actually made me feel something. Love Live, for example, is a fun anime to watch, because of the interactions between the characters which at times feel more like a family than close friends.  Even though the music was pretty good, the lack of interaction between characters other than Producer made the anime less enjoyable.\\n\\n\r\nOverall – 7.5/10\\n\\n\r\nIf pick-a-waifu anime is appealing to you, I guarantee that you will enjoy The IDOLM@STER. With the majority of episodes focused on developing a single character it should be easy to decide which of the characters you find most appealing. However if you are looking for a slice of life anime with well-developed characters, I suggest that you look elsewhere. As good as the music is, the rest of the anime unfortunately doesn’t manage to measure up to the high standards of the soundtrack.\\n\\n\r\nThanks for taking the time to read my review!",
            "date": "2018-03-14T13:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 273812,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4981708.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TiaanM777",
                "username": "TiaanM777"
            },
            "url": "https://myanimelist.net/reviews.php?id=273812"
        },
        {
            "content": "The core concept behind a Japanese Idol is “heart” and then projecting that heart onto their audience. Likewise, an Idol-anime must emulate this same sensation of heart and project it onto the viewer. This emulation can be a task easier said than done and thankfully \"The iDOLM@STER\" accomplishes this with flying colors.\r\n    Idol Master follows the story of 12 would-be idols and their amazing production team on their journey from borderline bankruptcy to stardom. Along the way we get to see every up and down in the idol process. This includes stories ranging from quirky and often times veryfunny character-on-character encounters to deep, life lessons. The same lessons that are often reflected inside of the music they produce, almost as if to summarize what we’ve just seen. Each episode is outfitted with its own unique still image sequence and ED(this is almost worth a free point on its own).\\n\\n\r\n    Arguably the most important challenge presented to an anime of this nature is making sure that all of the idols feel very Distinguished and likeable. Every girl needs to have her own personality, her own likes and dislikes, her own life and backstory, her own very unique presence on the screen. Idol Master spares no expense breathing life into each of its characters and, almost as if boasting, lets you experience each of the characters both alone and together in a group enviroment. By the end of the 26th episode you will feel as if you personally know each and every one of the characters you have met.",
            "date": "2016-01-24T14:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 209297,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4332091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sawt0othGrin",
                "username": "Sawt0othGrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=209297"
        }
    ],
    [
        {
            "content": "When one gets to point where they begin disregarding anime because they have too many girls on their front poster, it's probably time to take moment and re-evaluate. Granted, I've forced myself to sit through so many generic harems, rom-coms and ecchis these past few years that it has almost become reflexive of me to steer clear of any anime which possibly looks like it may contain any one of the aforementioned three. It was only natural then when I saw the poster of The Idolm@ster, an ensemble of 13 cute girls gawking up at me, that alarm bells tripped off in my head likefire sirens at a pyromaniac's convention. Only due to vigorous recommendations did I reluctantly pick up the series later on.\\n\\n\r\nProverbial justice looks down on the pretentiously knowledgeable, or so it would seem. My transition from skepticism to fanboyism was swift. Within episodes I was converted, all preconceived doubts I harboured for the series unfounded or long forgotten. I almost felt ashamed, my predictions of meaningless plot and mindless ecchi not only completely wrong, but also reflected the conceited critic that I had become. The Idolm@ster humbled me, never again shall I judge an anime at face value.\\n\\n\r\nThe Idolm@ster follows story of 765 productions, a small time idol agency and their road to stardom and success. The narrative of each episode are alike but flexible, each one generally focuses on the backstory of one character, but also contains plenty of interwoven exposition of various other characters so that no episode can really be considered standalone. The general theme of each episode often revolves around a character issue or weakness, some form drama arises from this issue, which is then eventually resolved with the character experiencing some kind of revelation or growth. In many episodes the show cleverly relates the story to a broader context; for example the episode \"Everything Starts with One Courageous Step\" refers both to Yukiho's small step in facing her phobia, and the day's events as 765 production's first step towards their future. \\n\\n\r\nThere are times where the structure of each episode feels a little formulaic, however this is largely offset by the large variety of different stories the show offers. The tone of the stories are what I like to call very PG-13 esque, many of the problems and struggles are grounded in realism, but airbrushed with a heavy hint of optimism. Whilst the drama does get quite heavy towards the later stages of the anime, you can always rest assured that there will be a happy conclusion. In fact, the entire overarching theme of the anime seem to revolve the simple ideas of happiness and optimism which it conveys well, sometimes to a fault.\\n\\n\r\nThe characters of course are, quite literally, the stars of the show. It quickly becomes apparent how unexpectedly deep the characterization for these girls go. Each character is unique and Idolm@ster goes out of it's way to make sure these girls all interesting and memorable, which it does a surprisingly good job of. Idolm@ster features an amazing ensemble of voice actors that do a fantastic job of bringing these characters to life, both on stage singing as idols or off stage exchanging playful banter with each other.\\n\\n\r\nIronically, the true unsung hero is actually the main protagonist. Given a largely clean slate, the nameless \"producer\" remains very undeveloped and uncharacterized, acting as a role of sorts for the viewer to jump into, (if one was interested in that sort of stuff). What it also meant was that the spotlight always on the girls, never stolen away to implicate or relate the girls with a largely support figure character, romantically or otherwise. Funny how irrelevant the titular character ended up being.\\n\\n\r\nThere are many standout qualities The Idolm@ster offers, but the gem of the glitter has to go to the cinematography. In many ways the cinematic progression of the show reflects the characters themselves. While 'offstage' the production value is reasonable at best, easy to look at but not spectacular. The anime goes about it's daily business, not hinting at the show that's about to come. \\n\\n\r\nThen, as stage is set and the music cues, here's when you finally realize that all bets are off. Explosions of lights and sound ensue, magnificently choreographed sequences aided by thrilling transitions, zooms, pans and cinematic techniques I didn't even think Japan knew existed, all cumulating in an electrify experience that's really putting my vocabulary limit to the test. The contrast of onstage and off really allows you to appreciate the level of workmanship devoted into these few minutes of animation. And then there's the ED sequences, which being unique to each episode itself is already unprecedented, also offers some great imagineative style backed with wonderfully fitting music. I have nothing more to say about The Idolm@ster's production value, other than two giant thumbs up of approval.\\n\\n\r\nThe Idolm@ster is in many ways a neat little snippet into a prominent Japanese idol subculture. Though perhaps not entirely accurate and/or realistic, The Idolm@ster takes a risk with it's presentation, using what could easy come off as a simplistic and childish tone, and instead delivering on a show that has both enthusiasm, energy and character.\\n\\n\r\nWatch Idolm@ster with an open heart, and you'll quickly discover the sparkle that is perhaps one of the most underrated anime this season.",
            "date": "2011-12-26T02:55:00+00:00",
            "helpful_count": 362,
            "mal_id": 50173,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321647.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Ryhzuo",
                "username": "Ryhzuo"
            },
            "url": "https://myanimelist.net/reviews.php?id=50173"
        },
        {
            "content": "I'm sort of a strange fan of the iDOLM@STER series. In terms of experience with the series, i've only seen Xenoglossia myself, which I also enjoyed very much, even though the other people I talked to about it didn't really seem to like it. Aside from that, i've never played any of the games associated with it, so I can't say I have any experience with them.\r\nThat being said, The iDOLM@STER so far has been quite an enjoyable experience for me.\r\n(Please note that all things said below are my opinion only! Also, most of the things I talk about are already subjective in nature, sonot everyone will agree with the verdicts that I lay out for it. I respect everyone's opinion and it's ultimately up to you as the reader/viewer to decide if you agree or disagree with the points I discuss. With that being said, enjoy the review!)\\n\\n\r\nStory;\\n\r\nIn terms of the story, I can attest that, so far, they have done a great job at keeping it consistent. The story as you may already know, is about a group of amateur idols (the main cast) and their journey towards reaching their goals. \\n\\n\r\nKeep in mind that this isn't just restricted to becoming a successful idol. While (nearly) every character in the cast wishes to become a popular, there are also a number of other goals that the characters are aiming to achieve alongside their journey through the industry. These goals are unique to those specific characters, and, in showing that, the show adds a side to it that increases the variety the of plot material as you are able to see that the cast isn't just a group of people aiming to do the same exact thing.\\n\\n\r\nAlthough there is no real central plot to the story aside from them wanting to become popular idols, the show supplements that fact by adding in sub-conflicts that different members of the cast face while they progress and grow. This is also made more interesting in that it shows how being an idol interacts with the character's lives and how it may sometimes get in the way of or complement their other objectives.\\n\\n\r\nFor the most part, there hasn't been any heavy drama yet, but this may change in the future. There were some specific dramatic parts for some of the characters (Don't want to spoil.) which I thought were done well for the most part. Nothing that made me break down crying, but still legit and reasonably believable/enjoyable. The episode hid a glaring chekhov gun in early on so there is probably something large waiting over the horizon.\\n\\n\r\nThe comedy of the show has been mostly just light comedy, nothing that made you burst out laughing like Nichijou, but nothing that made you cringe in disgust like you've been told a really bad joke either. Most of the comedy is usually good enough to put a smile on your face and elicit a few giggles, which is good enough for me.\\n\\n\r\nThe show is, for the most part, separated into specific character-centric episodes where they choose one of the cast and focus on a slice of their life. This hasn't been followed strictly seeing as some episodes have been shown to focus on multiple characters, or even the whole cast equally to some degree, but so far, there have been a decent number (3? I think.) of character-specific episodes. So far, the show has done a good job of doing it both ways, by giving a reasonable chunk of the screen-time to specific characters for their spotlight episodes, and also treating the cast fairly equally in episodes that feature them all.\\n\\n\r\nThe show does a very good job of keeping a steady balance between idol-related business, normal everyday life trials, and also catering to each character's equally important side-goals as well. In my opinion, the story is very solid so far, and I can attest that it is accomplishing what it had set out to do and not straying too far from the main path.\\n\\n\r\nArt;\\n\r\nIn terms of Art, I can at least say that I enjoy it. The characters are designed very well and they all look nice. I don't have much to say about the art because this subject is incredibly subjective, right alongside music, so I can't really explain whether it's good or not. You either enjoy the style or you don't.\\n\\n\r\nSound;\\n\r\nI guess this category could be attributed to the overall music for the show. In my opinion, the music included in the show so far has been very good. The opening sounds great, and also does a good job in getting you into the mood to watch the show. The ending themes are very good as well, aside from them being enjoyable music, the songs are tailored to specific characters of the cast, making for a heightened experience that complements the characters when viewing their spotlight episodes. The insert songs are fine, and the BGM is fine as well. Other then the specifics mentioned above, there wasn't anything that stood out as particularly \"bad\" in terms of music to me.\\n\\n\r\nCharacter;\\n\r\nOh boy, this section was actually going to be pretty big, but I think I already covered a majority of it in the story section. Due to the nature of the show's lack of a centralized conflict, it's obviously going to have its main focus be character development.\\n\r\nThat being said, the show succeeds in presenting the characters in ways that make them unique and interesting.\\n\r\nThere are a number of different personalities to identify with and explore. \\n\r\nThe characters also come from a variety of different backgrounds, ranging from the poor to the rich, to the average every-woman to the mysterious others.\\n\r\nIn terms of character development, the show doesn't slack in making sure that all of the cast has a their own, unique and interesting set of traits, goals, personalities, incentives, and probably more.\\n\\n\r\nEnjoyment & Overall;\\n\r\nIn my opinion, it's a very solid show that knows what it is aiming to accomplish and isn't hesitant to go for it while also providing a very enjoyable experience to those who want to lend their time to watching it. As a small side-note too, I really enjoy shows that give you a look into the life of another while also teaching you things as well. If I ever decide to become an idol, I can always look back and see that, while this show is probably idealized in some aspects, it is still a fun look at what the life of an aspiring idol would be like.\\n\\n\r\nSome people may be questioning why I gave the show 10's in everything. Well, here's the thing, the show so far hasn't really done anything for me to actually say it's bad. It's basically that kid in school that's doing everything he's supposed to do. I don't feel right taking points off of the score of a show if I don't even have anything reasoning behind taking them off. The show is for those who are interesting in hearing a story about the lives of a group of aspiring idols and their journey to success. If you are not interested in watching a show like that, you can always just watch something else. \\n\\n\r\nThe show knows what it whats to do and is doing it well. It's developing it's characters, keeping a steady pace on the main plot, making sure every character in the cast is diverse and interesting, and for the most part, making your viewing of it worthwhile. I would recommend this to anyone who is interested looking for a light-hearted slice of idol life show to just be able to relax and enjoy.",
            "date": "2011-08-15T06:58:00+00:00",
            "helpful_count": 120,
            "mal_id": 41533,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/545575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/saikanokiseki",
                "username": "saikanokiseki"
            },
            "url": "https://myanimelist.net/reviews.php?id=41533"
        },
        {
            "content": "There are some anime series that you desperately want to love. You’re either drawn in by the premise, one of the characters will strike your fancy for some reason and you’ll begin a furious Pixiv binge in search of any fanart of them to the point that your computer crashes and you’re declared legally dead, or you see some shimmer of pure gold underneath that thick sheen of shit and mediocrity and want to see if it’ll be more evident later on. The Idolmaster was one of the latter series, and it left me feeling entirely unsatisfied from start to finish.\r\nThe premise is simple enough:Twelve girls of questionable talent with single-note personalities and insecurities all vie for the chance to become idols with the help of their talent company and their ever-faithful producer. This single idea takes them all over Japan as their popularity inexplicably soars and they learn important things like trust, friendship, and synchronized dancing. Say what you will about the overall quality, it sticks to this premise throughout without ever losing the spirit of the idea. If you’re not in the market for a show all about the power of friendship or supposedly catchy pop music, there won’t be much for you here. \\n\\n\r\nFor me, the most important thing in any show is how the characters develop and interact. Something with a fantastic plot or great production won’t leave much of an impression if the characters don’t; see Madoka Magica. Unfortunately, this is the first and gravest misstep that the Idolmaster makes. \\n\\n\r\nThough it really can’t be helped with such a large cast of main characters, there isn’t much gravity to how the characters develop or interact. One minute, soliloquies are dropped regarding what problems a certain character has on their rocky road to idol stardom, the next the plot tousles them on the head, tells them to move on with their lives, and it’s never brought up again. While I understand that everybody is supposed to develop, it still feels awkwardly crammed in when it shouldn’t be. \\n\\n\r\nThis would be acceptable if all of the characters were memorable in some way, but some quite simply shine over the many others, leading to some intimate moments feeling resolved much too quickly in order to get back to what the Idolmaster perceives to be the most important characters. Haruka and the Futami twins seem to take up the most time, leaving the likes of Azusa and Makoto in the background for all but a few scant moments when they could have been fleshed out and humanized much more. \\n\\n\r\nThese overly-sentimental bits are punctuated every so often by the meddling of a rival talent company, 961 Pro, led by the conniving Takao Kuroi, which essentially play out the same each time. While they’re a welcome distraction from the slew of halfhearted character developments, these scenes could have easily been left out without the series suffering in any way. Don’t get me wrong, these were the only episodes in which I believed that the 765 Pro girls would come out more mature and fleshed out in the end, but I acknowledge their overall pointlessness. They take away nothing from the experience, but they add very little in return. \\n\\n\r\nWhere the Idolmaster came closest to breaking out of mediocrity was in the last few episodes, as Haruka dealt with everyone’s newfound success and consequential estrangement. It’s well paced and actually competent, leading to a complete departure from the episodic format of before.\\n\\n\r\nStory and character-wise, the Idolmaster falls a bit flat for me, even with the competently strung together drama in the final episodes. However, if there is one area where it shines, it’s definitely the production. The animation is crisp, the character designs are pleasing to the eye and soft by comparison, the dancing is wonderfully choreographed, the music could actually be confused for something thrown onto the market to be bought by thousands of impressionable Japanese teens and otaku of all sorts… in short, the Idolmaster went all out to bring the games to life, and that’s something to be admired. \\n\\n\r\nYet, for all the dazzling displays and occasional moments of interesting storytelling, the Idolmaster fails to be anything more than a flashy series that’s ultimately completely forgettable. Yet I can say without a shadow of a doubt that this is the best adaptation of the game series that anybody’s ever going to make. I tried to like the Idolmaster for what it was, and I did enjoy it every now and then, but overall it was a disappointing experience that I wouldn’t in good faith recommend.",
            "date": "2011-12-23T19:33:00+00:00",
            "helpful_count": 113,
            "mal_id": 49971,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=49971"
        },
        {
            "content": "The Idolm@ster is an ecchi anime with tons of fanservice but don't worry, your parents won't get mad because there is never any sex! A Producer enters a world with tons of lonely models and they get into many panty-revealing, nose bleeding adventures. The harem increases one by one and soon, all the girls just want the producer to touch their boobs. If you are a man, I definitely recommend this anime. Why should we ever bother with hentai anymore? That's all Idolm@ster is about.... \r\n....Or so you thought. \r\nWell then, sorry to disappoint you but I lied. For some reason, Idolm@ster tries to sellitself in a way that strays from its true focus. It's probably a conscious decision for the director to choose a poster that screams \"ECCHI\". However, it doesn't stop there because while Idolm@ster is a fun slice of life that tosses around cliche characters with smiles and jokes that make you feel warm it, ultimately rolls out two of the most intense drama arcs I've come to enjoy.    \\n\\n\r\nAt a first glance, the characters seem to be the strongest point of the show. The show emphasizes this by dedicating episodes to each of them. Yet the characters are where I have my most complaints. Each idol represents a typical character trait - from a friendly klutz, to playful twins, a prince who tries to be a princess - we've seen them all. Also, some of the characters just feel less important, which is understandable because there are 13 main idols, but not really an excuse because you wouldn't attempt such a show if you didn't have the confidence in developing 13 characters.  \\n\\n\r\nStill, despite the flaws, Idolm@ster somehow is able to make each character memorable and fresh. The way they react with each other is extremely important in achieving this. Yayoi's episode would not have been so enjoyable if it wasn't for Iori. Chihaya and Haruka's relationship is a joy to watch and Miki's relationship with \"Honey\" is very fun. They are just side stories that continue throughout the whole series even though the series is episodic. We end up with a very heartwarming series as the characters support each other to achieve their dreams.  \\n\\n\r\nI also quite enjoyed the variety of ideas. Sometimes we get almost pointless episodes like Hibiki's and Azusa's that just make you laugh but then we suddenly get serious ones like Miki's. The most important episodes are the last 4 towards the end of the series where it unravels into a melodrama that really pulls some emotional strings. The directing was also varied as the first episode was all shown through a camera all the way through and episode 15 was a whole show that the idols were hosting.  \\n\\n\r\nYet what I love about this anime most is how everything seemed so simple, so happy, but there were tons of rather dark and complicated moments. The president's background with the antagonist president was enough to get you thinking. The whole introduction of \" Ryūgū Komachi\" made me feel extremely uncomfortable, because I just couldn't help feeling how jealous all the rest of the girls must have felt which was most apparent in Miki. The Futami twins episode made me feel even more uncomfortable because while it looked as if Mami was unhappy because she wanted to be with Ami, I really felt a bit of jealousy in her tone. The foreshadowing of Chihaya's past in many of the episodes really piqued my interest. It's funny how even in a beach episode with 13 idols, you get a small scene which ends up with a discussion about what if fame doesn't end with what you actually wanted. Haruka's feelings in her last arc, are actually quite dark. Realizing that what she wants is selfish, she keeps it all to herself but in the end it's too much for her. And don't forget about Iori's blackmailing. There are many hidden emotions that never are being said, most notably Chihaya's anger towards Miki for abandoning practice even though she was the one who kept the group together when they all were worried. They are all little things, but when you put them together, you realize that this is no coincidence and they were scattered throughout the show on purpose. It adds an extra layer. \\n\\n\r\nI'm not that great in talking about animation and sound but I feel this anime definitely deserves some sort of recognition for it. The music was definitely fun and fitting but it really wouldn't have made an impact if it wasn't for those live performances. Those music videos were gorgeous. There is something special about the camera angles, the lights that explode, the choreography and uniforms, its just plain eye candy. They really put a lot of effort into making them - the details to the flying hair, few recycled scenes - I loved them all. \\n\\n\r\nYou see, Idolm@ster sells itself as a simple slice of life but if you pay enough attention, you'll notice the complex ideas hidden away in the story. Its easy to compare Idolm@ster to K-On!, as both seem to be a character-focused shows about girls having fun, yet I feel Idolm@ster tries to trick the watcher into thinking that while it dashes small hints of jealousy and sadness in the background. Its almost like a real show, because your idols are gorgeous on stage, but they are just humans behind the scenes. \\n\\n\r\nOh, and I wouldn't mind marrying Haruka.\\n",
            "date": "2012-06-03T07:02:00+00:00",
            "helpful_count": 90,
            "mal_id": 62543,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/226763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sanagami",
                "username": "Sanagami"
            },
            "url": "https://myanimelist.net/reviews.php?id=62543"
        },
        {
            "content": "Story: 3 (no impact. Mostly episodic, and while episode 08 is the only one that i like, the rest was boring for me)\r\nArt: 8 (moe-moe cute girls)\r\nSound: 7\r\nCHaracter: 2 (annoying and childish) \r\nEnjoyment: 2\r\nOverall: 2 (don't bother this at all)\r\nBefore proceeding to review sentence, allow me to apologize for my harsh overall ratings. \r\nThe Idol Master has potential to be the most entertaining idol anime because it was adopted by A-1 Picture that notably has abundant budget to create appealing animation, art, and music/OST. Unfortunately it falls apart from the expectation due to that it diverges its way from being realistic in idol topic...or notso serious if you like. The reason i prefer idol anime to be more serious nuance is because idol anime heavily involved in, not only in character development from childish to more mature idol-like person, but also frequent engagement in business commercial that may connect to political things.\\n\\n\r\nBelow is a quick bird view for screening purpose. If you don't want to see those things, please see the other two idol anime out there.\\n\\n\r\nThings that are lack of: \\n\r\n- Very little internal conflict exists within group members and individual \\n\r\n- Very little competition, and thus conflict, between idol group\\n\r\n- No idols scandal at all\\n\r\n- Mediocre Lack of management, marketing, networking story of how to lift the idol group to the top \\n\r\n- Although there are some internal problems needed to be solved by idol group member, most of problems are trivial, which don't need to have manager for that. It is just as if the manager and director in idol master is represented just for the sake of completeness, without further development. \\n\r\n- No interesting characteristics or traits of idol members. Worse, most characters are annoying as hell\\n\\n\r\nIdol Master could be said to be similar just like school club activity (slice-of-life), except it was flavored with idol taste. So it's just sad that, while art and choreography are sparkling, it's not be complemented with more mature and non-mediocre story, the things that i'm looking for, hence ripping off the balance of interesting dimensions of idol topic.",
            "date": "2016-07-31T06:59:00+00:00",
            "helpful_count": 67,
            "mal_id": 225505,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4786637.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/KUNYIT",
                "username": "KUNYIT"
            },
            "url": "https://myanimelist.net/reviews.php?id=225505"
        },
        {
            "content": "The story revolves around 10 wannabe idols and the staff at their agency 765 Productions. The anime includes all the characters from the games along with their original voice actors making this series great for the original fans of the franchise. The first episode which aired in Japan on July 7th this year introduces the audience to the characters via interviews with each idol and member of staff, giving us an insight into their reason for becoming idols and working for 765 Productions. This was a very original introduction to the series and seemed like a great way of telling a story while keeping thedating sim feel of the original game. I don't know if the whole series will be done like this but my guess from seeing the sneak preview is that it won't and I fear that this original concept may be scraped for something more typical of this genre. Visually IDOLM@STERS is great! Like A-1 Pictures previous animes, it's well animated and the backgrounds (though digitally done) look spectacular. The characters are as peppy and lively as they are in the games with each idol having their own different personalities and fan appeal from the large boin to the mysterious type.  Over all, I'm looking forward to seeing where this series goes from here and I expect there will be a lot more song and dance in the future.\\n\\n\r\nRough review by Charles Shepherd\\n\r\nwww.electricbloomwebzine.blogspot.com\\n",
            "date": "2011-07-10T01:41:00+00:00",
            "helpful_count": 30,
            "mal_id": 38918,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510334.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/electricbloom",
                "username": "electricbloom"
            },
            "url": "https://myanimelist.net/reviews.php?id=38918"
        },
        {
            "content": "I was thinking about giving this a quick spin but im gonna keep it short, since thats my thing.\r\nSo someone decided to make this video game into an anime, the story is about girls trying to be idols. Well I don't really see many game/anime adaptations go well and I can't really say im enjoying this series all that well. The plots kinda like a generic moe blobfest, and I think theres too much of that going around now. \r\nThe story consists of many different arcs with each idol being dug into deeper, their person and abilities are shown very vaguely and its a bithard to keep up with each one since a linear story line is non existent. Simply put, its about each girl and how everyone showcases their different talents to become famous idols. But whats the point in having so many characters, if you still don't know who is who when you're halfway through the series? Thats my take anyways, too many characters.\\n\\n\r\nNow lets try and look at it from the monitor and tune in with your stereo or mono.\\n\\n\r\nThe art itself isn't groundbreaking in any right what so ever, its simple. Maybe simple is good, sometimes art itself can take away the bads. Not having played the game you don't know the soundtracks, this is where the adaptation goes bad, in my opinion anyways. As I said before with art, sound can do the same. Lets take a walk back to 2010 with Inception. Many would say that the soundtrack itself made the movie that much better and that the movie itself would have sucked without the soundtracks. The series lacks music during each episode itself, while the ED tracks may be different too many people don't actually view ED's.\\n\\n\r\nThe characters are pretty generic, can't even make a full section off that. It doesn't meet the par for moe standard that shows like Azumanga Daioh and K-ON! set.\\n\\n\r\nOverall it fails to keep my interest enough, enjoyment isn't the word I would use. Rather on hold simply because its just too much.\\n\\n\r\nHey now, if you're into musical adaptations give it a go.\\n",
            "date": "2011-08-13T00:38:00+00:00",
            "helpful_count": 23,
            "mal_id": 41401,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=41401"
        },
        {
            "content": "So this is the first time watching an \"Idol\" themed anime, and because of that I may be rating this better than I should, but all in all this is a great anime and I doubt I would change the rating even if I had experience with similar animes.\r\nStory: 9/10\r\nThe story really wasn't anything special to be honest. There were two main parts to the story (they can be differentiated by the opening changing). The first part consisted on the girls really trying to just get themselves out there and known to the world and while that may seem sorta boring, it really wasn't. Everyepisode was VERY engaging and it just made you want to know what would happen next. The second part is after they become more well known then what happens? While I can't spoil anything, I can tell you that the show does become a little more serious especially near the last few episodes, but it still keeps that really  nice, and fun atmosphere. I was really surprised by how realistic it became at the end to be honest and if you ever think that being a big celebrity group means that it's all fun and games, then you haven't seen this anime.\\n\r\nP.S. From episode 20 and on, tissues are a must (unless you are a stone cold person with no soul :P). It gets ridiculously emotional at the end like I was Yukiho at the end.\\n\\n\r\nArt: 9/10\\n\r\nIf you thought that the art was bad then I'm Harry Potter. Since this is a idol anime, good artwork is a must and The iDOLM@STER certainly doesn't disappoint. The characters were drawn out very nicely and I applause this anime for not depending on fanservice from the characters to sell the show. I guess it's just a nice change of pace from panty shots or revealing bras that are in many animes nowadays.\\n\\n\r\nSound: 9/10\\n\r\nThere's a good amount of singing that happens during the performances and while I didn't find many particularly special, I give serious props to the people that came up to the lyrics for the songs. It really must have been hard to write them especially to fit the mood of whatever was happening. One of the best examples is the song \"Promise\" sung by Chihaya Kisaragi in episode 20 (tissues!). It's a very sad/happy/powerful song that fit the tragic atmosphere.\\n\\n\r\nCharacter: 10/10\\n\r\nNow I know there's going to be those people that say that these characters were \"unmemorable\" or something, but I have to disagree. This was actually one of the few animes where I took my time and memorized every character's name just so I could get to know each character better. Plus can I just mention the character development? From start to finish, so many characters have been able to grow and learn, some being able to conquer fears to others trying to forget a dark past.\\n\\n\r\nOverall: 10/10\\n\r\nWell considering that this is one of my highest ranked animes should say what I thought about it. It's quite a ride from the beginning to the end and all I can say is to enjoy it. From the beautifully written songs to the characters, this won't be an anime you'll be disappointed in. And when the ride's finally over, you'll wish it had just started.",
            "date": "2015-06-21T13:35:00+00:00",
            "helpful_count": 23,
            "mal_id": 190845,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554963.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/King_Of_Light",
                "username": "King_Of_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=190845"
        },
        {
            "content": "Nearly plotless, fluffy as hell, and still pretty good. No CGI unlike Love Live!, which might be good or bad depending on who you are. Somehow manages to have each character be a character despite there being 15 or so.\r\nSuuuuuuuper homosexual, though. Single most gay thing I've ever watched, and I watched Boku no Pico, man. Not that it's a bad thing, just incredibly homo. Every character is a lesbian or Miki, the only confirmed straight one there.",
            "date": "2015-03-01T19:42:00+00:00",
            "helpful_count": 20,
            "mal_id": 181496,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scrambled1432",
                "username": "Scrambled1432"
            },
            "url": "https://myanimelist.net/reviews.php?id=181496"
        },
        {
            "content": "Short Tips:\r\nIn one word: Vibrant\r\nGood for: Light-hearted fun, colorful pretty art, watching to unwind and relax\r\nOther notes: De-stressing, motivating, makes you smile!  Cute girls and personalities :D\r\nFull Review:\r\nWith a name like IDOLM@STER, I confess I really didn't expect much out of this anime when I first started.  But after watching a few episodes, I was really really taken by the vibrant art and the colorful characters.  To me, watching IDOLM@STER is like eating colorful fruit candy-- it's just so vibrant and sweet and there's nothing unpleasant about it at all!\r\nThe story of IM@S isn't much to be honest, 12 girls striving tobecome celebrities (Idols) in Japan.  They start out very unpopular/not well known in a Production Agency, and this anime chronicles their rise to fame.  The story is rather predictable in many ways, but gives you a solidly feel-good type of vibe, as they start out as underdogs and gradually work their way up.  \\n\\n\r\nOne of the lower points of the anime features an arc with a really really stereotypical \"bad guy\" rival production company, and to be honest, the whole \"evil, greedy production mastermind\" came off as really really cheesy.  The story of that arc was pretty meh. \\n\\n\r\nBut I find their best episodes to be the ones where there's not so much of a driving plot, but more of a observation episode of what happens to a group of characters on a given day.  And this is because the characters in Idolmaster are absolutely outstanding.  They're fun, vibrant, colorful-- the voice acting is superb and the songs are enjoyable and catchy~   One girl in particular, Miki, has really really great charisma as a character and her VA has done a great job.  You can't help but like her and everything she does, because she does it all so well!\\n\\n\r\nIt's been a while since I've found an anime that's just so darn FUN and adorable to watch.  There's no real drama or angst (Or is there, in Episode 23?!), not really enough to make a viewer/watcher feel stressed or anxious or sad.  It's a really fun, vibrant and light-hearted anime, and will definitely cheer up or add a bit of pep to any day~",
            "date": "2011-12-14T13:54:00+00:00",
            "helpful_count": 14,
            "mal_id": 49177,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104423.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tealeafkitty",
                "username": "tealeafkitty"
            },
            "url": "https://myanimelist.net/reviews.php?id=49177"
        },
        {
            "content": "The IDOLM@STER is one of the best anime I watched. I love this anime because a lot of people can relate to some of the storyline. The girls also have various personalities. I also like it because their singing is amazing and the artwork is really good. Their dancing is amazing too.  The anime is one of the best I watched.",
            "date": "2012-04-22T10:10:00+00:00",
            "helpful_count": 14,
            "mal_id": 59413,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266335.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lovely-Chan_6",
                "username": "Lovely-Chan_6"
            },
            "url": "https://myanimelist.net/reviews.php?id=59413"
        },
        {
            "content": "Story: 9/10 - I love how the story progresses each episode. It wasn't focused on one-person's life only but everybody's. every character touch my heart. \r\nSound: 10/10 - I love the sound effects and fitted in every scence in each episode. Most of all, I LOVE the music. I am having so much fun listening to them. I loved J-pop more.\r\nCharacter: 10/10 - Every character left impact on me. They have different personalities and I enjoy watching them. All I am saying while I watched is \"This girls are kawaii!\"\r\nEnjoyment: 10/10. I SIMPLY LOVE THIS ANIME. Nothing less. \r\nOverall: 10/10. This anime is very funto watch. I am inlove.",
            "date": "2018-12-23T11:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 296630,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jd2281",
                "username": "jd2281"
            },
            "url": "https://myanimelist.net/reviews.php?id=296630"
        },
        {
            "content": "Being an idol is far from easy. On the surface, it may seem like the job is all fun and games. However, as shown in THE iDOLM@STER, unexpected twists and turns make this job a very stressful one. Despite this, being an idol is like a dream come true for many of these girls as they would undoubtedly give everything they have to stay as one. Based on the popular raising simulation and rhythm game of the same name, THE iDOLM@STER had previously been unknown to the vast majority of the anime universe. Before continuing on to the main section of the review, take notethat this adaption is my first experience with the iDOLM@STER franchise. \\n\\n\r\nArt (9/10)\\n\r\nI'm a big fan of well-choreographed stage performances and the ones in THE iDOLM@STER definitely don't disappoint. Considering that they generally suck up a lot of the show's budget it's surprising, but good to see, that there were TWO, as opposed to one, large-scale concerts that were shown. In both of these, I found the animation to be top-notch and the use of camera panning and angling enhanced my viewing experience greatly. The characters themselves were also visually unique which I thought was a nice treat. However, like virtually all anime series that have scenes of breathtaking animation, there are also times where the drop in quality is noticeable. Although this barely affected my viewing experience, the fact that it happened prevents me from giving a perfect score in this category. \\n\\n\r\nCharacters (10/10)\\n\r\nI came into THE iDOLM@STER knowing none of the 13 idols and having no idea which ones I'll end up liking or hating. However, after the 25 episodes, I can say one thing for sure: all the girls are likeable and interesting in their own ways. Although some got less screentime than others, I felt they all were developed reasonably well considering that most of them only had one episode that focused on them. The development for the \"main three\" (Miki, Chihaya and Haruka) was anything but unnoticeable. If one were to compare their characters from when they were first introduced to the final few episodes, it is evident that there was a great deal of change that occurred. Aside from individual character development, the idols, as a group, also show signs of growth and bonding throughout the series. A big contributing factor of all this development can be attributed to the surprising amount of drama that was present; more on that later. \\n\\n\r\nSound (10/10)\\n\r\nI'm quite sure that almost everyone will agree with me when I say the sounds category for this episode definitely deserves a perfect 10. Not only are there 25 different EDs and 2 catchy OPs, but also a slew of insert songs (at least one for each episode). With this much content, I find it unbelievable if one were to tell me that none of the songs were, at minimum, \"good.\" The BGM was also quite decent, especially the perfectly placed piano pieces of various songs at the right times. The seiyūs, although many of whom are not popular, did a great job with their roles as each character's voice seemed to fit their personality. On top of being able to voice their characters well, they showed great deal of skill by being able to sing decently as well, an ability that not all seiyū have. \\n\\n\r\nStory (9/10)\\n\r\nLet's be honest here - not for one second did I expect THE iDOLM@STER to have a story or plot. And for the first half or so of the series, I looked to be correct. However, once drama started appearing on the horizon, things took an unexpected turn. My image of THE iDOLM@STER suddenly transformed from one of \"my weekly dose of moe idols living their lives\" to \"an exciting and gripping drama surrounding moe idols\". Even so, I greatly welcomed this surprising turn of events and, in no time, the series won my heart; the best of both worlds - moe girls and intense drama - all wrapped up into a nice package that is THE iDOLM@STER. \\n\\n\r\nOverall (10/10)\\n\r\nWhat can I say? I absolutely loved THE iDOLM@STER. I know there are many out there who are skeptical about this adaption but I ask that you remember these familiar words of advice: \"Don't judge a book by its cover.\" Sure, on the surface, THE iDOL@MASTER may look like it only appeals to the hardcore otaku fanbase but underneath all the singing, dancing, and moe girls, there's a great story waiting to present itself. So whether you're a fan of moe or drama anime, I highly recommend you sit back, relax and enjoy yourself some THE iDOLM@STER; it definitely wouldn't hurt to give it a try!",
            "date": "2011-12-27T19:12:00+00:00",
            "helpful_count": 12,
            "mal_id": 50269,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=50269"
        },
        {
            "content": "This is the most memorable idol animes I've seen. I watched this when I was young and even now I can remember everything about this anime. Like what happened in each episode, the voice of each characters, their hobbies, personality, pet, appearance, song, backstory... And it's been many years since I've watched this, so it really takes a lot for me to remember them so well. That's what makes this the best idol anime (imo) ever.\r\nStory 7/10: The story is simple. A producer helping an idol group from a poor company rise to the top. There is no rival idol groups, or media scandals, ormany inner conflicts between members, but this story doesn't need all that. That's for more serious, seinen idol animes like Perfect Blue. Not every story needs to be depressing and remind you how the real world is a horrible place in order to be a \"good\" idol story. A simple story depicting 12 girls struggling with their own life and their idol career can also be amazing and enjoyable.\\n\\n\r\nArt 8/10: Character designs are perfect for their personality and they're very memorable too. They're simple (especially the eyes) but somehow each member manages to stand out from the others. It's like Mob Psycho 100. The art isn't the best but it fits the story perfectly.\\n\\n\r\nSound 9/10: Voice actors are great. Songs are great. I still have the opening song in my phone right now lol\\n\\n\r\nCharacter 8/10: Each characters have their own struggles. Even though all 12 members of the idol group were introduced in a single episode, I didn't feel overwhelmed and each of them have one or two quirks that make them very distinguishable and memorable. Their development and backstory were brought to light as the story goes on. And in just 12 episodes, the anime managed to get me attached to every single one of them (even the producer lol). There's no best girl. All of them are best girls! I also like how this anime isn't afraid to bring physical pain to the characters xD\\n\\n\r\nEnjoyment 9/10: I've watched this anime who knows how many times, not just for the songs, but also for the characters. I love watching Yayoi's episode when I eat because watching her eat makes me hungry every time. I love Azusa's episode because of how ridiculous it is and that makes me laugh every single time. I love whenever Miki shows up because she just has that aura to her that makes her really likeable. I love Hibiki and her hamster and watching them communicate is one of the best part about this show. I love the twins, the tsundere Iori, Takane, Makoto...etc, hell, even the boy idol group and faceless president and the producer himself. All of them are amazing.\\n\\n\r\nOverall 9/10: This is the first idol anime I've watched and the best. I don't know why Love Live is so popular. From what I've seen, it really isn't all that great compared to this. Their songs are good but their characters aren't as memorable as this. The best part about this show is its characters. You will fall in love with every one of them.",
            "date": "2019-03-05T04:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 302937,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4264843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ttcchen",
                "username": "ttcchen"
            },
            "url": "https://myanimelist.net/reviews.php?id=302937"
        },
        {
            "content": "This is my first review, so please mind my unprofessionalism.\r\nOriginally, I watched the first episode as a mere joke, but by the end of the first episode, it left me wanting more. The IDOLM@STER was the first idol anime I had ever watched, and it opened up an entire new type of anime to me. I had taken a liking to idol animes upon completion of this one. As I watched this anime of 13 idols grow bigger and bigger in popularity, it made me feel somewhat proud. Remembering them as beginners just in the first few episodes and top idols in the last fewhad me very satisfied that they had gone a long way.\\n\\n\r\nStory: 7/10\\n\r\nThe story overall, would be unique and different to me, compared to others. The whole story revolves around 15 year old idols that work their way up to the big stage. Unlike many other animes, this story takes place at the 765 production office and does not show any of the character's school lives. Along with some fillers, each episode was dedicated to one character, and hence great character development in my own opinion. Many animes leave me with an empty feeling; I felt that I would have wanted a better ending, but this anime, however, made me feel complete, and I didn't really want to watch anymore, it was a great ending to me.\\n\\n\r\nArt: 8/10 \\n\r\nThe art in this one might not be THAT great to some. However, as I am watching this in 2015, I feel that for a 2011 anime, it has greatly exceeded my expectations. I even would prefer this art then some of the art in this year. \\n\r\nThe art has a moe feel to it to me. It's simple and unique. Although the characters from certain angles might be a bit strange, it the art was amazing nonetheless.\\n\\n\r\nSound: 7/10\\n\r\nThe voice acting was good, it matched with the animation and was clear. The background music and sound effects was good, but not that good. In some parts of the anime, some did not fit, but imo doesn't really effect me overall. Im not excellent at judging sounds, but if I were to rate it without any criticism, I would give it a 7/10.\\n\\n\r\nOverall: 8/10\\n\r\nFirst, It was me trying to watch this idol anime as a joke, but in the end it had been one of my favourites of all time, and made me take a liking to idol animes. Each episode kept me locked on the screen and didn't make me feel bored at all, and upon completion made me feel complete and fulfilled. It's a happy, and sometimes sad anime, and if you haven't watched it yet. I highly recommend you should.",
            "date": "2015-10-19T04:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 201561,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PoorKid",
                "username": "PoorKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=201561"
        },
        {
            "content": "HONESTLY... When I heard of this show, all I expected were girls performing at concerts. What I did NOT expect was the journey towards performing, any problems that occurred, nor any backstory (yes, we get a lot)... The character development is insane. Both openings 1 and 2 (Ready and Change respectively) are really fantastic, and the animations are fantastic for both. The art style for the characters, the background, posters, concerts, everything is amazing. The music is fantastic, and the backstories of the characters we get the backstories for are amazing. I enjoyed this anime so much, and I did not expect an anime likethis to make me cry so much; 3 times in one episode I cried. I easily recommend this anime to ANYONE, this show is such a masterpiece.",
            "date": "2018-09-05T15:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 288219,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sip_of_Mercury",
                "username": "Sip_of_Mercury"
            },
            "url": "https://myanimelist.net/reviews.php?id=288219"
        },
        {
            "content": "I’d like to think that I’ve made plenty of ventures into different genres and styles of anime. Part of the fun in consuming the medium for me is finding something new to explore, and throwing myself in the deep end at times has proven to be a worthwhile experience. However, I’d found myself shying away from the realm of idol anime and I’m not too sure why. There was not much that appealed to me or reached out to say ‘you really need to give this a go’. I had to push myself to take a leap of faith and decided to use The Idolm@sterto do just that.\\n\\n\r\nThe Idolm@ster provided me with a bumpy ride but formed itself into something pleasant by the time the 25 episodes had come to a close. Was I blown away by the visuals, the choreography or the music? Sure, but the reason I enjoyed The Idolm@ster far more than I thought I would is because the show really isn’t about the music and dancing. It’s about the teamwork needed to make that all happen. That really caught me by surprise. It must be said that I’m not really one for the brand of music depicted, with its overly mushy lyrics and the fact that most songs come off as sounding the same to me. I went into the show expecting that to be the focus and have the characterisation poorly tacked on. I was wrong. Even though the cast is pretty much designed to cover all the ranges of emotions and personality types (i.e. the snotty one, the shy one, the mysterious one, the androgynous one etc.) they’re usually fun to watch. The Idolm@ster does a solid job of creating a cast you want to cheer on, even if some of them irritated me to no end. \\n\\n\r\nThe Idolm@ster follows 12 girls looking to make their big break in glitzy and glamourous world of idols. They dance, act and sing under the guidance of their producer as they desperately seek out a way to make a bigger name for not only themselves but also their production studio, 765. In the way of a story, as you could imagine, it’s pretty simple. The group take on jobs wherever they can while trying to better understand each other and industry that lays ahead of them. Trouble often strikes in some form, whether it be a wardrobe concern or someone out to sabotage their name. Early on I started to get worried because everything felt so aimless. There all these issues befalling everyone but even when things get resolved it’s back to square one, like nothing has really changed amongst the group as a collective. The comedy seemed to fall flat and the show tended to rely on it too much for its own good. My leap into the genre wasn’t off to the most comfortable of starts.\\n\\n\r\nIt’s the latter story arcs of The Idolm@ster that make sitting through the tedious opening half of the show worthwhile. These parts start to actually flesh out the characters, delve into their past and - above all - actually show the importance of depending upon each other. The struggles aren’t just simple filming but instead they create consequences for the group as a whole – and that’s much more engaging for the viewer. The questions the characters ask start to steer away from “How can I improve my image?” to “How can I make sure I’m not letting anyone down?”. While it can be fun to watch the cast act cute, it’s much more impactful and rewarding to watch them all resolve their personal problems. The drama is never overbearing though, thankfully. The show always maintains this sense of optimism without being dark or too serious for its own good. The balance is just right. Because we get to know all the cast that little bit more, watching them battle their way to the show’s conclusion is a fun experience.\\n\\n\r\nThe 12 girls themselves are a mixed bag. A handful of them came across as interesting, because you could actually see something holding them back and I was left wondering what it could be. Some are there to provide a bit of comedy. Some I feel were just making up the numbers. It would be fruitless to really harp on about what are ‘strong’ and ‘weak’ characters in the 765 group. Everyone will pick a favourite and latch themselves onto their story and cheer them on. That’s the beauty of a show like this. There will be at least one of them that will strike you as likeable or interesting. Some of them I couldn’t stand but that’s to be expected when you are writing to cover as many personalities as possible to appease to the widest possible audience. Some side characters feel irrelevant, including one comically evil villain, who does a better job at dragging down my enjoyment as opposed to being of great value.\\n\\n\r\nThe visuals are a treat. Performances look and sound the part – you can certainly see where the bulk of the budget was directed towards by A-1 Pictures. The vocals are top notch, both in and out of musical performances. The VA work helps breathe distinct identities into the large main cast. Biggest praise from me goes towards Asami Imai (Chihaya Kisaragi) and also Kenji Akabane who is the perfect choice for the loveable and often bumbling Producer.\\n\\n\r\nFor all its annoying quirks and characters, The Idolm@ster eventually becomes something a slight cut above average. Edging through the often unbearable opening half of the show at least helped pave the way for something more interesting to come. There’s nothing exactly memorable or mind blowing about The Idolm@ster. If you can come to terms with its often cheesy 'friendship conquers all' mentality then there will be enjoyment to be found. Give the show a try if you want something really simple and easy to watch and might just have you nodding your head along. It’s just a bit of colourful, melodic fun.",
            "date": "2016-03-13T03:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 212825,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3966203.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Tozzy",
                "username": "Tozzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=212825"
        },
        {
            "content": "I've heard a lot of things about Idolmaster prior to watching it. In fact, I heard a lot about the hasegawa model airplanes they came up some time ago. That kind of caught my attention and well, ironically about the same time this anime popped up so I decided to watch and see what it was about.\r\nBasically this show is about a bunch of girls from different backgrounds wanting to be idols with the help from their producer who remains nameless. \r\nStory\r\nThe anime starts off very slow. You are introduced to the characters and you aren't given much information on them until several episodes in.It really feels like a slice of life type of format, just replacing the \"school\" aspect of it with the \"idol\" one. It isn't particularly strong, but some episodes can be entertaining. The addition of the rival 965 firm makes things more interesting though, but at times though I felt like dosing off, which in my opinion signifies repeated story lines I've probably seen before. Not particularly great or really bad, but pretty mediocre. I give it a 6.\\n\\n\r\nArt\\n\r\nHmm...It's not particularly bad and it's not particularly great. There is a lot of moeness, which pretty much does nothing for me unless it's very unique; which it isn't. I'm not particularly bothered by the moeness like I was for other animes (like K-On for example). Character designs are ok, animation is decent and backgrounds are pretty good. Unfortunately, not something I'd consider noteworthy. I give a 6. \\n\\n\r\nSound\\n\r\nMost of the songs are j-pop, which aren't particularly good or memorable. They sound a lot like the stuff you'd hear on the radio for like a month and then never hear it again. Singing wise it's good, some of the voice actors do a very decent job. Not really much else to say about it. I give it a 5.\\n\\n\r\nCharacters\\n\r\nThe shows characters tend to be the more interesting part of everything. Most of them aren't quite what they seem. Some characters have gone through some very tough situations, others face difficult circumstances and for the show that's a good thing to convey to the audience. Unfortunately, it doesn't do much of it thorough for you to really appreciate or relate to the characters which makes it fall just short. I give it a low 7.\\n\\n\r\nEnjoyment/Overall\\n\r\nOverall it's a pretty average show. If you are into moeness you'll probably love it and if you hate moeness, you'll definitely hate it. I'm not in either camp, so I say it's pretty average. Characters can be memorable, but so far through 17 episodes the show hasn't really taken off in my opinion. The slice of life story line can be too boring at times and too predictable which just hurts the show overall. I give it a 6.\\n\\n\r\n------------\\n\r\nUpdate.\\n\\n\r\nSince the last time I wrote this review, the anime has improved storywise and character wise. You learn a lot more about 965 pro and why the boss does what he does and you learn a lot more about the characters. I believe it was episode 20  was probably the best episode of the entire series. It was very well done and very moving (you learn a lot about Chihaya's past) and I equate it to other famous anime moments like that in Clannad when Tomoya finally accepts his daughter. It was a dramatic episode that really just stood out from all the rest of the anime. \\n\r\nIt doesn't stop there though. We got to know more about a few other characters and the episodes just suddenly got a whole lot better. It's a shame they couldn't show us these great episodes until the ending part of the anime because it would have made the anime a lot stronger overall. Luckily I think they did enough to really make this anime stand out a bit more. In all I give it a high 7. The last few episodes really saved this show.",
            "date": "2011-11-02T02:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 46683,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=46683"
        },
        {
            "content": "Watching The IDOLM@STER was an experience similar to eating a Big Mac. It’s delicious and a joy to eat … until you discover a Whopper. The previously unrivaled now Big Mac tastes cheap and bland when compared to the Whopper, but still remains edible. My point I am trying to get across is this: The IDOLM@STER is fun to watch, but don’t expect too much from the series.\r\nStory – 7/10\r\nThe plot in The IDOLM@STER is a simple one. It revolves around the lives of the 13 girls who aim to become prospective idols. The IDOLM@STER manages to tackle the entertainment industry quite accurately. Episodes inThe IDOLM@STER feels divided into two separate types of episodes; the first being episodes revolving around a single character and the development of her personality and traits etc.; and the second episodes which focus on building the characters as a unit rather than individual’s. Unfortunately the majority of episodes are focused on building the individual’s. Why would I consider this something negative in the anime, especially when considering that The IDOLM@STER is a slice of life anime which are mainly character driven?  The problem I have is that the majority of characters get a single episode dedicated to them as characters, after which they only feel significant whenever the plot calls for it. It is near impossible to have the audience immediately care for a character when they are given so little screen time to show us their motivations for becoming an idol, or just explaining why the character possesses some kind of quirk. The only characters who I believe got a backstory which actually meant something, was Yayoi and Chihaya. Both of these characters had to deal with issues which affect their lives, in addition to being idols.\\n\\n\r\nArt – 7/10\\n\\n\r\nUnfortunately the trend of being mediocre is something which this anime adaptation and its creators – A1-Pictures – have in common. I would describe the art style as average, because nothing stands out to me. Thankfully there was nothing about the art which was badly done either. The character designs are diverse and colorful, and work well with the characters personalities and their occupation as idols. Both the openings are vibrantly done and a joy to watch.\\n\\n\r\nSound – 8/10\\n\\n\r\nNow if there is one thing an idol anime should excel, it has to be the music. The IDOLM@STER has some great tracks throughout the run of the anime. The only thing which annoyed me regarding the sound was Yayoi’s vocalist and the fact that we only heard snippets of the largest number of tracks throughout the anime. I have to applaud the vocalists for each of the idols as all of them –except Yayoi – was a true pleasure to listen to individually. Where they excelled at the most, were during songs performed as a group as much like the characters they were meant to portray, they complimented each other’s strengths and weaknesses. The ending character-/group songs are really fun to listen to and the openings even more so.\\n\\n\r\nCharacter – 7/10\\n\\n\r\nWith a large cast, it is usually really hard to develop the entire cast and not neglect a few characters. Unfortunately The IDOLM@STER doesn’t succeed in creating a well-developed cast, as the characters don’t get enough screen-time. Producer was the character which made me hesitant to watch the anime, as I was expecting a bland character which every male in existence can fantasize about becoming – much like the protagonist from the games. I was pleasantly surprised to see that Producer was a kind-hearted individual who wants to help his idols accomplish their dreams. Heck, I enjoyed him so much that I felt sorry for him when my least favorite character – Miki – fell in love with the guy. How he doesn’t contemplate murder on a daily basis is a truly amazing feat. Other than Producer, other characters I enjoyed were: Makoto, because of she is awesome; Azusa, because she has a motherly charm surrounding her; Iori, because she is a cute tsundere loli; Chihaya, because her character arc made me cry and lastly President Kuroi, because he was unexpected and has a fantastic seiyuu.\\n\\n\r\nEnjoyment – 7/10\\n\\n\r\nThe main reason I usually find myself watching idol anime is simple, they make me smile. IDOLM@STER had some genuinely fun moments throughout the anime, but unfortunately only four scenes actually made me feel something. Love Live, for example, is a fun anime to watch, because of the interactions between the characters which at times feel more like a family than close friends.  Even though the music was pretty good, the lack of interaction between characters other than Producer made the anime less enjoyable.\\n\\n\r\nOverall – 7.5/10\\n\\n\r\nIf pick-a-waifu anime is appealing to you, I guarantee that you will enjoy The IDOLM@STER. With the majority of episodes focused on developing a single character it should be easy to decide which of the characters you find most appealing. However if you are looking for a slice of life anime with well-developed characters, I suggest that you look elsewhere. As good as the music is, the rest of the anime unfortunately doesn’t manage to measure up to the high standards of the soundtrack.\\n\\n\r\nThanks for taking the time to read my review!",
            "date": "2018-03-14T13:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 273812,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4981708.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TiaanM777",
                "username": "TiaanM777"
            },
            "url": "https://myanimelist.net/reviews.php?id=273812"
        },
        {
            "content": "The core concept behind a Japanese Idol is “heart” and then projecting that heart onto their audience. Likewise, an Idol-anime must emulate this same sensation of heart and project it onto the viewer. This emulation can be a task easier said than done and thankfully \"The iDOLM@STER\" accomplishes this with flying colors.\r\n    Idol Master follows the story of 12 would-be idols and their amazing production team on their journey from borderline bankruptcy to stardom. Along the way we get to see every up and down in the idol process. This includes stories ranging from quirky and often times veryfunny character-on-character encounters to deep, life lessons. The same lessons that are often reflected inside of the music they produce, almost as if to summarize what we’ve just seen. Each episode is outfitted with its own unique still image sequence and ED(this is almost worth a free point on its own).\\n\\n\r\n    Arguably the most important challenge presented to an anime of this nature is making sure that all of the idols feel very Distinguished and likeable. Every girl needs to have her own personality, her own likes and dislikes, her own life and backstory, her own very unique presence on the screen. Idol Master spares no expense breathing life into each of its characters and, almost as if boasting, lets you experience each of the characters both alone and together in a group enviroment. By the end of the 26th episode you will feel as if you personally know each and every one of the characters you have met.",
            "date": "2016-01-24T14:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 209297,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4332091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sawt0othGrin",
                "username": "Sawt0othGrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=209297"
        }
    ],
    [
        {
            "content": "Welcome to Robert's Too Late Reviews, where old people tell you about how the anime was REAL anime when they were a kid! Naw, not really, I'm kind of spoiled by modern shows these days! Today we're going to be tackling another interesting show, Idolmaster! One peek at my anime list reveals I'm very much a moe type fan, so it goes without saying that this kind of show would catch my eye, but I am trying my very best to be properly critical and not just gush over everything, so we're going to be taking this music anime with a real grain of salt,and see if we can't nail down a proper assessment. Will the gang at 765 Pro make the RTLR wall of fame? Will they ride the shelves of awesomeness? Let's break it down. \\n\\n\r\nStory: 6\\n\r\nWe have a bit of large cast to deal with when it comes to story so a lot of the episodes, especially early in, seem to mainly serve to introduce each idol and familiarize us with them. With there being 13 girls, this makes for a lot of background to cover, leading to the show's weakness in story. We don't get into the meatier stuff very consistently until towards the end of the run. The individual stories are not bad, they're just kind of generic. You've got the calm type, the quiet one, the energetic one, the oddball, so forth, and they each get some fair amount of character development in the early run. However, most of the stories take a back seat for what I would consider the 'true' storyline that comes in towards the end dealing with one specific idol attempting to juggle friendship and stardom, fame and family, and how to keep the girls who all started together in touch with each other. It's a real coming-of-age story where the one idol realizes that with time things change, and everyone grows.\\n\\n\r\nThis story is also kind of hampered by the typical upbeat outlook anime like this has: the girls don't end up drifting apart, and instead come together at the end for the big show, which isn't a spoiler I wouldn't think, as the synopsis itself basically points to this ending, and anime, at least this genre, is not given to depressing endings. So it really is a run of the mill story, completed with a rival group (of guys, oddly enough) and their dirty, underhanded studio president who tries to destroy the girls' studio in every way he can. Nothing we've not seen before a bazillion times. \\n\\n\r\nThe story is well executed, and is handled appropriately, it's just not that remarkable, not that I found. Yes there are some good parts to it, especially regarding one girl's family's past, and a couple other nice nuggets, but it never rises above itself to become more than just fair. That's not to say it's bad, I know ratings on the site, and my own in particular, treat 6 as just awful, but no, it's above the mid-line, and indicates it's not notable, but it's not also unpleasant either. There was only one episode that really grabbed me story wise, and that was later in the season. Overall not bad, just not something you're gonna write home about either. Cute enough to pass, and with the other parts working together, the weaker story is somewhat propped up, but on it's own, it's just fair. \\n\\n\r\nThe story would have benefited from a smaller cast, 13 is a bit big, which is why when it comes down to telling the coming of age part, they focus on only a few of the girls in detail, and leave the rest more as background characters. If Love Live! had too many characters for your tastes, then this is utter overkill. A smaller cast would have given a tighter focus, which could have been a good thing. Of course this would have cut some fun personalities as well. Not a bad balance they strike, but again, just fair. \\n\\n\r\nArt: 7\\n\r\nThe art looks good enough, to me the art is a bit simpler than say, Love Live! which came out a couple years later. The details aren't present as much as in other shows, but the overall look doesn't really suffer much for this. The girls are easy to recognize, the outfits are cute enough, and the colors are nice. It was cleaner and simpler than some other series, but did not lack in conveying emotions and getting me invested in what I was watching. I found watching the show pleasant on the eyes. \\n\\n\r\nSound: 8\\n\r\nThe music is the heart of a series like this, and Idolmaster does not disappoint, if you are a fan of the sugary sweet J-pop stylings put on display. Of course if you're not a fan of that kind of music, you should probably just avoid this entire thing as it is an idol anime, after all. Assuming you're down with the pop, then you'll find lots to like here. They do often play music, if even just small snippets of songs. They play them long enough, perhaps 45 seconds to a full minute for many of them for you to get a good feel for how the whole song would sound. The music is one place that Idolmaster tops even K-On! by actually sharing the songs with the viewers, instead of just dropping us in on the last chord. There are a large number of music pieces played throughout the series, with most if not all the girls getting a number or piece of one to go along with their parts of the story. \\n\\n\r\nThe opening themes are catchy and fun, and this show does like Akuma no Riddle in that each episode has a themed ending that fits either the idol being showcased or (later on) the situation the episode ends on, so we basically have a new closer for every show. I love this take, while great closers are awesome, to hear yet more variety in the music really is fitting for an idol anime. The voices are fairly well done, and if the preview image doesn't make it obvious, you're going to be hearing a lot of high pitched girls for the most part. None roam too close to annoying, and are all well done. I particularly liked the 'mysterious and wise' girl's voice a lot, along with the blonde bombshell girl, and of course the animal lover girl. They were all unique enough to be identified for the most part by voice alone, which can be difficult with so many girls chattering. As a native English speaker, I often have trouble telling Japanese voice actresses (seiyuu, whatever) apart in the native Japanese, but most of the Idolmaster girls are unique enough to pick out by voice alone, a very nice feature. \\n\\n\r\nCharacter: 7\\n\r\nThe girls are all interesting, even if some of them are kind of one trick ponies. Some girls just don't get the time to really delve into who they actually are, in favor of pacing. This is kind of sad if one of your favorite girls is passed over, but necessary to keep from really bogging down the entire series. As I said in my Love Live! review, there might be one dimensional characters, but we don't need every single last girl's life story to get the gist of what we need to know. I think Idolmaster strikes a nice balance of fitting the girls in, but not becoming lost in the construction of the background story. Its odd, I know, that I said that the story isn't anything to write home about, but the balance between the characters themselves is fairly well done. We might not see anything just revolutionary in the stories the girls are involved in, but they do effectively teach us the role each girl is to play in the overall scheme of things. \\n\\n\r\nThere are plenty of girls for the viewer to delight over, and a lot of them appear in most episodes so 'best girl' discussions aren't just limited to the 4 or 5 that come down to larger roles in the end coming of age story. One thing I had an issue with is that it's not believable that all the girls are solo idols. I'll buy several of them being famous on their own, but some just do not seem like they would make the cut without being in the larger group. \\n\\n\r\nThe producer who is never actually named is a great character as well, leading and guiding the girls throughout the show, and when it comes crunch time for the main idol, he's there supporting her the whole way. Toss in a cute as a button assistant, a sassy co-producer and former idol, along with a mysterious studio president, and you have a likeable and memorable cast. \\n\\n\r\nThe rival studio's president, the skeezemaster is also appropriately played, and there is an interesting development in the rival group he puts out there to 'fight' the girls and their studio. I was not expecting the boy band to take the arc they did, and I was glad they went for that part of the story, as it makes the guys understandable, and not quite so insufferable. \\n\\n\r\nEnjoyment: 9\\n\r\nNow here's the kicker, with the rather pedestrian story, simpler art, and with some one note girls, I still enjoyed this anime immensely. It was a romping good time, and the girls were just so cute, and it was fun to watch them come together, even if it was in predictable ways. The main idol's resolve to keep everyone close and not forget their roots was really sweet, and in a way a good lesson for everyone. Don't forget where you come from, who lifted you to where you are. I cheered with the girls as they did their concerts, laughed at them on the tv show, and just enjoyed the whole experience. I would have scored the whole thing higher if not for those technical demerits I mentioned. It was worth the time to watch.\\n\\n\r\nBest Girl: Hibiki! A new tagline for me, if there are multiple characters to pick from, I'll mention the girl I liked best in these reviews. I loved the animal lover Hibiki and her connection with her pets. She's fun and bubbly, and overall just really brightened every episode she was in. I especially like the episode focused on her animal show, where right before going on to make it, she gets into a serious argument with her dog and hamster. It's hilarious.  \\n\\n\r\nThat wraps it up for us today. This series was worth the time, and I did enjoy it. If you can forgive some of the flaws, you might find lots to like here as well. If sugar pop isn't your thing, RUN AWAY. As for the great wall, the girls did not make an entry. But, fear not, they are all making an appearance on the great shelves of super awesomeness! So thumbs up, with some reservations.",
            "date": "2019-02-20T16:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 302096,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6918726.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/captjoe213",
                "username": "captjoe213"
            },
            "url": "https://myanimelist.net/reviews.php?id=302096"
        },
        {
            "content": "Let me make a confession. My first idol anime was Love Live. Yes that yuribait infested Love Live with the horrid CGI animations. So after Love Love and realizing how much I was intrested in the idol genre, I decided to give one of the most prestigious series in the genre \"iDOLM@STER\" a spin. And it was great.\r\nStory: The story of Idolm@ster starts off with a documentary of a small idol company in Tokyo as a way of introducing the staggering 13-person cast. It's large, but the anime more than makes up for this through fantastic interpersonal interactions and personal episodes for each character duringboth halves of the show. The first episode isn't just great as it's own stand-alone episode, but also as an amazing introduction throughout the show. What the show does amazingly though is its portrayal of not only growth but as matureity. If you compare the characters(both the managers and the idols themselves) from the beginning of the show and the end, they are more mature, more grown up. And that's the best part about Idolm@ster. Every character grows in some way, gaining insight not only into the world around them, but also their own individual flaws. Subconsciously or consciously this change doesn't just occur within a single episode, but throughout the entire show as the cast tackles themes of trying hard, talent, and even corporate corruption. These themes can be presented in a silly manner(I love the scenes with Kuro-P) but the impact is still there. The anime strikes a great balance between silly and serious, something that is hard to due in anime.\\n\\n\r\nArt, Sound, and Animation: But this is an idol show after all so lets talk about the songs. The majority of the songs are interspersed in both daily life moments and in actual live performances(mostly in short bursts to provide CD sales) and for the most part are pretty catchy. The OPs and EDs as well have this same upbeat nature to them that is typical of idol music but that isn't a bad thing either. One thing that is great though is addition of hand drawn dances(something that is both expensive and very tedious to do in-studio). It really shows the passion and love the animators have for this project which I loved.\\n\\n\r\nCharacters: Yes each character is either a characterature or fetish personified in some way. It ultimately leads to plain characters that can be summed up in a single sentence. But that doesn't bog down the show. Instead it allows for more growth in the characters and makes each and every one of them rememberable and likeable. It's a great contradiction that works for the show instead of against it, as one might think.\\n\\n\r\nClosing Thoughts: Overall, \"The iDOLM@STER\" is a great show that exemplifies what I love about the idol genre. Upbeat songs, cute girls, memorable moments, minimal drama, interesting themes, and unique costume designs. If you love idols and jpop, watch this show.",
            "date": "2015-03-04T11:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 181692,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/finaljas90",
                "username": "finaljas90"
            },
            "url": "https://myanimelist.net/reviews.php?id=181692"
        },
        {
            "content": "The first impression you get from a series based on a game is that it will become just another piece of merchandising like Pokémon which after a great beginning it ended keeping for 10 years like a repetitive story which will never end while the games keep selling. Thankfully the introducing Xenoglossia gave me to the characters and to the IM@S franchise made me give this anime a big chance to watch it and become one of my favorites, after I watched the first episode it promised me to be a fun series full of colorful characters and lots of music and dance, now thatI watched all episodes I can say that it accomplished even more than that.\\n\\n\r\nAbout the characters it's amazing to see how this show makes you fall in love with them by showing not only how they are over the stage but also hoy they are in their daily lives, of course there were some of them they got left to show, but this show is so powerful that it even makes you fall in love with Kotori, who probably makes you think at the start: \"Nah, she's just the secretary!\", but no, you see that she's more than that.\\n\\n\r\nToo bad the first episode doesn't give a good impression for those who are not familiarized to give chances, cause the second episode is where the show really starts, in the meaning that the fight for becoming top idols really start and you keep discovering more things on the idols that you didn't even see in the game, and the fact that the classic combination of comedy in the beginning and drama in the end was more deep than expected makes you love it even more. Of course if you never played the games or at least heard of them, this show is a total surprise box for you.\\n\\n\r\nI loved the fact that there were new songs related to the show, and if you're watching it with subs the song titles on the screen make you run to your favorite mp3 site or youtube to listen them, cause they're songs you can't stop listening.\\n\\n\r\nIn few words, this show ended turning me in an Idolm@ster fan, and if you like music and colorful characters, it will turn you too into a fan after watching few episodes.",
            "date": "2011-12-28T12:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 50327,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mau-Kun",
                "username": "Mau-Kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=50327"
        },
        {
            "content": "The iDOLM@STER at first glance looks like it should be a complete mess of an anime. It has no central character, and a team of 13+ idols and the Producer to share the spotlight. \r\nThe \"story\" if you want to call it that is the transformation of the idols and their studio, 765 Pro, into nationally known (and sometimes internationally) super powers in the industry and how the changes have affected their day to day. This does not really hit in full force until the very late episodes, but you can see changes through out the entire series. \r\nMost episodes are only related in thesense that they involve the same characters. There is a \"rival\" group and studio that is introduced too, just to keep things a little interesting. Because the connectivity of a story is very loose the series presents a very slice of life feel at times. \\n\\n\r\nI will say that the show, as far as each episode goes, is inconsistent. It can go through stages of incredibly boring episodes, and then really touching ones. It is much stronger in the latter stages though, which makes up for what I'd call a slow start. \\n\\n\r\nAs I've mentioned idol has 13+ idols and even more characters that need to get some focus. With so many characters you'd think that some of them don't get touched on, and you'd be right...kinda. While not every character really gets a large amount of development most of them do get their own episode, or a shared one, and come to have a recognizable character trait(s). There are shows with less characters that don't development them as much as Idolmaster.\\n\\n\r\nMost of the characters are pretty enjoyable too. They have a large range of personalities, family situations, and even views on life. All of these are shown throughout the entirety of the series. Yes, a few of them are cardboard cutouts, but even they can be enjoyable. I would never expect a 25 episode show to fully develop a team of like 15 characters, the fact that they do such a good job with so many is really something. Still, it is apparent at times that they stretched themselves thin.\\n\\n\r\nI have to say I was surprised how emotional the latter episodes got. They really pulled the right strings and made you care for what's going on, unlike the early ones when you really struggled to grasp the show. \\n\\n\r\nThe series is obviously packed with music. Each episode has its own ED with animation focusing on what character the episode has in focus. There are also songs dotted throughout the series. \\n\\n\r\nThe more I write about this the more I kind of want to raise my score of 7, however, despite everything Idolmaster had going for it it just did not cash in on some of the strength early on. In a way the series got stronger as it went on, sort of like the idols themselves.",
            "date": "2012-01-08T01:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 51239,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=51239"
        },
        {
            "content": "The iDOLM@STER is one of the greatest and amazing animes that I ever watched. The story went from being light to drama.\r\nOkay, I was very happy that each of the girls got their own spotlight. The music and animation were amazing and the anime proves to me that they can make incredible dance moves without the use of CGI animation. Glad they gave the 765 Production some challenges up ahead and showed us good and bad points of being in the idol industry. The series is really based on real life idol activity.\r\nI gave this anime a positive review, for having an outstanding story. LikeI won't even thought of that (xD) and the challenges they gave for each of our characters. Keep up the good work and I hope to see more of the iDOLM@STER in the future.\\n\\n\r\nThis is DiamondRabbit signing off~",
            "date": "2016-04-25T02:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 217121,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4952437.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DiamondRabbit",
                "username": "DiamondRabbit"
            },
            "url": "https://myanimelist.net/reviews.php?id=217121"
        },
        {
            "content": "I can't remember where did I find out The Idolm@ster, but i know that in that moment, I just wanted to watch it. After I start watching it, I just went i little sad, because the first chapter isn't very interesting, and at the beginnig of the anime, I though I was going to watch something like K-On, without any spot, just cute things everywhere (and I do like cute things)\r\nBut it was merely a felling. This anime has a Spot. We could say that it is a little like K-on!, because characters are all cute girls (well, at least we have some boys), thatdo the funny and stupid things that we like so much... It's a little like K-On, yes, and I think, no matter how everyone like K-On, a lot of people got sick of it, before the end of the anime. And like this, I can't stop thinking that K-On would be a great anime if it had some spot.\\n\\n\r\nJUST LIKE THE IDOLM@STER!!!\\n\\n\r\nI'd say that this anime is complete, because even if we like sweet things, by itselves they will just get boring. That doesn't happen here. Characters have personality, have problems, they have a dream they want to reach, and we see that developing untill the very end of the anime, while we still can laugh out loud. Each character has his own problems, but they still fight with everything they have, and for dreamers, that's a truly beautful meaning. It give us hope and strengh, it makes us happiers just because we see the characters reach their dreams like we wish. This makes the spot beautiful, complete and I'd say well organized, because the develop of the characters' story is from the easiest to the hardest situation.\\n\\n\r\nThe art... I can't explain how the art is perfect. Each character is so beatifull, and not only beautiful but well drawn... I never found out something badl drawn. All the colors are just so pretty in this anime, it make the watchers fell better the emotions, it make us want to live in that world, just to see things like them. And normally, when we watch an anime, at the best episodes, seems like the quality isn't enough for that scene to be perfect. That doesn't happen here. At the shows, the idols seems like they are really dancing, like they were real, everything is so proportional, and the characters are even prettier. The clothes, specially when the girls dress dresses, make their moves so realistic, the dresses come and go just like they were real, and that makes me wonder how that was produced only in seven days!\\n\\n\r\nThe musics... I can't tell, it depends if you like that kind of music... You like anime songs like Toradora's, J-Pop, and things like that? So you'll like them for sure. Anyway, I dind't listen to the songs carefully, since most of them are used like background on a great moment. Anyway, I give it a ten because they really work out with the characters, and the spot.\\n\\n\r\nSo, with this, the only thing I have to tell you is: don't think this is a spotless anime at the first episodes, because that's not true. As I said, the spot is well organized from the easiest to the hardest situation, so the best comes in the end. I just ended watchng The Idolm@aster righ now, and i couldn't help but give it a 10.\\n\\n\r\nI really recommend it.\\n\r\nMia_Chan",
            "date": "2012-03-02T18:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 55211,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1072743.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mia_Chan",
                "username": "Mia_Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=55211"
        },
        {
            "content": "Idol /ˈʌɪd(ə)l/ n. a person or thing that is greatly admired, loved, or revered.\r\nWhat does it mean to be an idol? That's a question the A-1 pictures' series The Idolm@ster tries to answer. It's based on the Xbox 360 game with the same name and follows thirteen idols and their producers as they all try to overcome trials of varying sizes and severity in their quest to reach the top in the Japanese entertainment industry.\r\nThe show kicks off with a mockumentary style first episode, which really surprised me. It fools you into thinking that this actually might turn out to become something interesting direction-wise, asI've never heard of an anime of this genre being made before. Never fear! All the subsequent episodes are good ol' slice-of-life. As usual, each episode focuses on one character that is in some sort of pinch, and then the pinch resolves itself somehow and everyone is happy and smiling. Sometimes there is more than one character in focus, and sometimes there is no pinch at all, but the core plot-model doesn't really change a lot during the series. This doesn't really matter that much to me, as I'm a fan of mindless slice-of-life. I also found most of the girls to be likeable and every viewer will probably find at least one girl they like in the large cast. \\n\r\nSome people might want to check out this even if they don't usually like this kind story. I'll get back to that later.\\n\\n\r\nThe main antagonists, Jupiter and their producer, are introduced in the latter half of the story. I didn't really like them a lot in the beginning, as they felt unnecessary to the plot (if you could call it that.) But they acted as the catalyst for some surprisingly well executed drama; and I guess they grew on me eventually. \\n\r\nDrama is often the bane of slice-of-life stories. Writers who don't know what they’re doing tries to force in a contrived, sloppy sob-story in the last two episodes for no apparent reason and the whole show is ruined in 50 minutes. That is not the case for Im@s though, the drama arcs are properly implied from the start and they feels like a natural development of the story, I’d even say that it’s the high point of the series. Characters get to be properly fleshed out in a satisfying way and it also explores themes that, while not original, are interesting. For example the downsides of fame and how friends with the same ambition ironically get torn apart while chasing it. Im@s is not exactly a tear-jerker, but that wouldn't have clicked with the light-hearted tone anyway.  Series like this one and Soredemo Machi wa Mawatteiru show us that it actually is possible to have drama in a slice-of-life show without it having to feel incredibly forced and out of place. \\n\r\nI have no problem with light-hearted stories, but the first episode and the drama-centric episodes show us a \"what could have been\" Idolm@ster. A more raw and gritty take on the idol industry, a scathing social commentary. But it's not that, and that's fine. With nothing more than a regular-sized budget and averagely skilled staff, Im@s could very well have turned out to be something relatively mediocre, bad even. So let's have a look at what it is that really makes this series shine.\\n\\n\r\nDo you know what sakuga is? It's a term reserved for describing unusually fluent and exciting animation. It's not something commonly seen in series aired on television, but Im@s has buckets of it. I mean seriously, watching this show almost makes me wish they’d use all that money on something worthwhile, like fixing world hunger. Almost. The series routinely utilizes jaw-dropping animation and routinely makes animation nerds like me giggle like retarded, sugar-high children. Im@s really reminds us of why A-1 is such a highly regarded studio. Actually, I've been seeing a lot of sakuga lately. Fate/Zero and Mawaru Penguindrum have a lot of it too, though Ufotable seems more interested in design consistency than fluency with F/Z, and Penguindrum's strength mostly lies in its excellent scene composition and art. While Im@s just has brute, raw sakuga. Which show you’d prefer, visually speaking, mostly depends on what you value the most when looking at animation; it's a question of personal taste. \\n\\n\r\nOf course, animation is only one half of the presentation. Im@s is all about idols, so the music is a vital part of the whole package. The Idolm@ster series already boasts a rather large catalogue of songs and the staff has taken full advantage of this. The result is a new ED for every episode and many, oh so many insert songs. The viewer really is getting spoiled here. Whether you like the songs or not, again, comes down to taste. The songs are pop, but pop is a very wide and diffuse genre and Im@s has songs from every side of the spectre. You have both slow, pompous ballads and hyperactive J-pop. If you only listen to black metal or gabber you might feel a bit stumped, though most people should probably find the song catalogue listenable.\\n\r\nOn the seiyuu side, while some of the voices might be a bit grating, Im@s has an overall strong cast. I wouldn't consider all of them to be good singers, or singers… Some have great voices though, Asami Imai (Chihaya) especially stands out as a really talented singer throughout the show and Hiromi Hirata (Makoto) was also a favourite of mine with her cute, tomboyish voice.\\n\\n\r\nDespite all the praise I've been singing up until now, Im@s does suffer from a few problems. For example, some characters didn't have enough screentime (Takane) and some were subjected to mediocre writing (Takane). Some fans of the original games might also feel a little unhappy about the minor changes made when adapting the series to television. Finally, the direction and writing is very fluctuating, a common problem with episodic series lacking overarching plot and also Im@s's greatest. The episodes typically range from mediocre to so-cheesy-it's-awesome, ultimately it's the character interactions and presentation that'll keep you watching, not cleverly constructed stories and witty writing.\\n\r\nThese are only minor hiccups, at the end of the day The Idolm@ster is a very strong show. It goes for a scattershot approach, trying to appeal to as many as possible at once. Of course you can’t please anyone 100% like that, but Im@s succeeded fairly well. I’d say it pleased me about 80%. The show doesn't take many chances, but it has lots and lots of money and a very skilled staff. If you're only watching one show this year, make it Penguindrum, but if you're watching two, The Idolm@ster would be a good candidate.\\n",
            "date": "2011-12-23T07:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 49907,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171802.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Salsk",
                "username": "Salsk"
            },
            "url": "https://myanimelist.net/reviews.php?id=49907"
        },
        {
            "content": "The iDOLM@STER is not my first \"idol\" anime, having seen a few others before this one. I'm happy to say that it will also not be my last. With many shows that I watch, it's easy for me to lose interest at a some point during the series. Knowing that, almost any show that I finish and review will be a positive recommendation in some regard. In this case, however, there is much to be said about more than a single category.\r\n-Story- 7/10\r\nThis is, in my opinion, the weakest of what The iDOLM@STER offers. The story on its own is actually pretty entertaining: 13 girlsunder the 765 Production studio do whatever it is that idols do to make their names known. This often involves singing and dancing, but this show also makes apparent other ways that the girls brand themselves - commercials, plays, radio appearances, and so on. I found this to be refreshing after watching other shows that focus only on the former two points. That said, the show suffers some when it comes to a specific emotion. You know that sappy feeling when there's a sad scene and then everything works out in the end? That part of the show feels forced to me, with cliches (see: Characters) and overly dramatic scenes detracting from the emotions that the audience is supposed to have.\\n\\n\r\n-Art- 8/10\\n\r\nNo complaints here. There isn't much of a place for a series like this to actually show off any good animation and art aside from dance scenes. As for those, they are well done, but nothing too special either.\\n\\n\r\n-Sound- 9/10\\n\r\nI'm a sucker for this genre of music, really, and the show does a good job of placing certain characters into certain songs, or arranging them correctly for those that involve more members.\\n\\n\r\n-Characters- 8/10\\n\r\nIn short, most of the characters are great but a couple have noticeable flaws. Specifically, I found Yayoi and Yukiho to be underwhelming, though I only really noticed it on the episodes that focused on the two. Haruka is the character that I have the most mixed feelings about. Her clumsy nature and cheery demeanor make her likable, but she is the sole reason for most of the cliches that appear in the story. This aside, though, Miki, Chihaya, Makoto, and Azuza have particularly memorable traits to them. I also find it extremely refreshing to see a wide age differential between the idols, who range from 12 to 21 years old.\\n\\n\r\n-Enjoyment- 9/10\\n\r\nIt's unlikely that this category will ever be below a 7, but I enjoyed this series quite a bit more than I do the average show. This category is entirely subjective, but my opinion is that the show is fun. That's the easiest way to describe it, really. It's cheery and lighthearted and dramatic at times. So... fun. Just... fun to watch.\\n\\n\r\n-Overall- 8/10\\n\r\nIf the story were a bit less cringe-worthy at times, this would be an easy 9. As it is, though, it is still a respectable show. More importantly, though, I want more episodes. That's the best indicator I have that it was a good series, and would recommend it to any fan of other 'idol' series.",
            "date": "2017-02-04T23:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 239928,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4955590.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/loufurman",
                "username": "loufurman"
            },
            "url": "https://myanimelist.net/reviews.php?id=239928"
        },
        {
            "content": "\"Our goal is for the top idol!\"\r\nIdolm@ster is a gateway anime for me. This was the reason why I was pulled into anime after a long hiatus of 6 years since I watched Naruto. \r\nSTORY (9):\r\nIdolm@ster is basically a popular raising sim and rhythm game franchise by Namco Bandai Games. Basically the plot takes place where 13 idols, from 765 productions are competing for the top idol along with 961 productions. The 961 productions has male idols that form the group, Jupiter. Do the 13 idols have what it takes to defeat them? \r\nThe story tells that being an Idol is never easy and itrequires strength and effort put into it. Not only that teamwork is also very important because teamwork is improving the relationship with the co-worker and the producer.\\n\\n\r\nART (10):\\n\\n\r\nThe animation is vivid and stylistic. Every idol represents different color. Like red represents hyper and energetic. Haruka has that color. Blue represents cool and calm. Chihaya has that color.\\n\\n\r\nSOUND (9):\\n\\n\r\nEvery songs are special and unique. I couldn't say much. The best song is \"Aoi Tori\". The rhythm is smooth and calm.\\n\\n\r\nCHARACTER (10):\\n\\n\r\nEvery character has their own unique traits just like the representation of the colors. \\n\\n\r\nMy favorite characters are: Azusa, Chihaya & Makoto. They are the awesome trio.\\n\\n\r\nMakoto Kikuichi is my favorite character in this anime. She is badass and has charisma. I wouldn't say I love her otherwise she will kick me in the ass. \\n\\n\r\nAzusa & Chihaya are calm and composed. However, Chihaya is the most serious person who always achieve her goal with passion. \\n\\n\r\nChihaya is voiced by Asami Imai who voiced Kurisu Maksie from Steins Gate & Solva from Needless.\\n\\n\r\nRitsuko is a smart person and I also liked her personality.\\n\\n\r\nYukiho is easily timid which represents her color, white. She always say \"I'll dig a hole and bury myself\". \"Anahote umatemasu!!\" \\n\\n\r\nAmakase Touma was a cool guy. He was voiced by the same voice actor who did Hachiman Hikigaya, one of my favorite character in My Teen Romantic Comedy SNAFU. \\n\\n\r\nShota Mitarai is hyper just like Yayoi Takatsuki. He is voiced by Yoshitsugu Matsuoka who also did the voice acting of Kirito from SAO and Sorata Kanda from Sakurasou.\\n\\n\r\nHokuto Ijuin is calm and composed just like Azusa.\\n\\n\r\nThe 876 idols have not much to work in this anime. They were just there in episode 10, during the tournament. In fact, I would love to see more of the 876 idols.\\n\\n\r\nCONCLUSION (10):\\n\\n\r\nThe reason I was pulled into anime is because of this anime. I first watched a video about some Idolm@ster cast singing one of my favorite songs \"The Final Countdown\". That was when I was so fascinated by the video.\\n\\n\r\nIdolm@ster will still remain special in my heart. Idolm@ster also teaches us life-long lessons that being an idol requires more effort and time. Just like business, teamwork, skills and effort should come together so that business can be successful. \\n\\n\r\nEven though there is not much character development on 876 idols, I adore this anime a lot.\\n\\n\r\nI give this anime a 10 out of 10. A beautiful masterpiece. If you're into music, you should give this one a shot.",
            "date": "2014-04-02T18:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 138385,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=138385"
        },
        {
            "content": "This is... beautiful.\r\n My expectations were already high from the graphics, but this anime went above and beyond any of them in both visuals, audio and storytelling. Really, such kind of all_girls cast and one guy usually implies only harem-like action, but there is absolutely nothing of this kind. Nothing of any traits I usually frown upon in 90% of other series - there is no harem, no school, no romance, not even a fanservice of usual scale was noticed, if any at all. Only girls actually doing their best to become idols without slacking off and eating too much cakes. Truly said, perfection isnot when there's nothing to add, but when there's nothing to remove. And it isn't even boring, as one might think without all these \"features\", it's got drama episodes as well as some action. However, personally I was a bit unhappy about these issues they had to go through later in time, but that's how affection to characters works - you don't want them to have slightest problems.\\n\r\n I never thought I would encounter this kind of show, where creators actually love and respect their characters and emphasize their best features, released in 2011, when it is become usual to lure audience by less honorable methods. Actually, such methods are clearly pictured as wrong and this is the message of the series.\\n\r\n This might be the first show since Lucky Star that both made me laugh and shed a tear and that I will be missing after finishing for a long time. In fact, something of this kind I has been subconsciously waiting since the ending of the last episode of L*S, something to continue the performance of Lucky Star girls on stage but on a larger scale and with more dedication. It was especially pleasuring to watch since I, being a JPop fan myself can often relate to what's going on and recognize familiar features like that time with a scenery referencing various Mizuki Nana songs. However for those not already familiar with \"stardom\" these series still would be pretty enjoyable as slice-of-life's best.",
            "date": "2012-08-17T06:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 70029,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83084.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChitOKun",
                "username": "ChitOKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=70029"
        },
        {
            "content": "Firrst off, this is probably my most favorite anime. It's filled with music, dancing, and interesting characters. I loved it because many people could probably relate to the storyline. The story was also though out well. There is lots of comedy and drama in the story. The art was outstanding and the sound was heavenly. The characters had lots of personality and that made me more interested in the anime. I reccomend this anime.\r\n~A-Chan",
            "date": "2012-04-22T11:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 59425,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1267103.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Anime-Chan_6",
                "username": "Anime-Chan_6"
            },
            "url": "https://myanimelist.net/reviews.php?id=59425"
        },
        {
            "content": "I hate to  be that guy but if there was a definition of a bad Idol anime in my opinion this takes the crown and title. \r\nSo what did i liked with this anime hmm well the look of it all wasnt bad but everything else was just bad.\r\nNot sure i can say with good conscious that it even had a story. Everything in it was random their work , their manager , the whole thing  was something i cant even begin to describe. Whatever i could have said about the character and rest was ruined by the story. \r\nPeople will say thatwell you watched the whole anime well yeah i did in hope of it getting better but it never did. The risk of watching anime is that you will find one of those that sucks energy out of you and this did. I hate to be one of those guys but some anime deserves it and in my opinion this did. \\n\\n\r\nI write this so that people can realise that if the first episode really crushed your beliefs in it then take a hint and stop yourself from watching it.",
            "date": "2016-09-15T13:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 229097,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5327546.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Geddon616",
                "username": "Geddon616"
            },
            "url": "https://myanimelist.net/reviews.php?id=229097"
        },
        {
            "content": "For an Idol based anime it's very unique compared to other anime in similar genre. Mostly I'm going to talk what makes this anime is pretty special.\r\nStory.\r\nThe story actually feels...very realistic. You start as this small idol agency who no one knows, doing  small concert in countryside, starting to get bigger and bigger as time goes on, and you can tell how much they have grown. While the first half act as a character introduction which for some might be boring, some are pretty funny and show their own uniqueness. And the most of the late episode crisis feels pretty realistic.\r\nArt.\r\nI love that theyput extra effort to make different ED for each episode. Other than that there isn't much to say...well I really like some of the move.\\n\\n\r\nSound. \\n\r\nFirst they have a LOT of song in their arsenal. While I never really like this kind of Idol song, somehow I really like some of the song...which is good I guess???\\n\\n\r\nCharacter\\n\r\nThis probably one of the best part of this anime. Arguably some of them aren't visually attractive, most of them have unique character or background...well some of them might feel a bit cliche.\\n\\n\r\nThe one thing I really hate is that through out the entire anime they really tease with Romance that wants to exist but never really exist. Damnit poor Haruka.\\n\\n\r\nFun Fact : In Episode 15 a certain person get hit by a box in the face and it actually happen with that person seiyuu in real life.",
            "date": "2018-02-02T05:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 270407,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4707765.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PoDH",
                "username": "PoDH"
            },
            "url": "https://myanimelist.net/reviews.php?id=270407"
        },
        {
            "content": "The plot is simply about bunch of girls under the name of 765 Pro—765 Production Studio. They want to reach the top of Japan music industry as an idol. You don't need to frown your forehead or heavily withstand with the troublesome issues on your mind.\r\n[SPOILER] The series does have problems like when few of their friends went debut first while the others still need to improve their skills, the burden of main heroine—Haruka Amami—who wants to spend time with their friends but none of them can make it so they can't be together after long time separately do their own jobs, and shed-tears momentwhen one of the member's scandal goes public.\\n\\n\r\n    The amount of problems they have there taste like a spicy flavour in a crispy fried chicken. The  slice of life characters and humours mixed with the matters are a good combination as if tickles flavour yet savory, tempting, from freshly fried chicken. It has its main story, the goal they set as the self-conceptualization to be top idols, this undeniable resolve become the benchmark for the whole laughing nor sad matters and actions unlike the chicken fillet which is boneless and easy to chop. (Uh huh I'm hungry, don't you agree the parable of chicken usage here is easy to understand? lol)\\n\\n\r\n​\\n\r\n    I'm glad to comment about the visuals. Since the show is about slice of life, there's no action such as fighting and chanting magic spells like any other action and supranatural anime series. All of the impressive visuals then replaced by the idol performances on stages. Still it is not an action but the graphic there is so beautiful, accompanied by melodic songs angel-like voices in this show, also nice character designs. I am not into 3D animation at the time when musical groups in anime series perform, so this show offers the best idol group performance on stage, it's not so 3D, at least The iDOLM@STER is less 3D than Love Live! or AKB0048 or PriPara.\\n\\n\r\n    The characters development is not comprehensive, looking at mammoth amounts of characters, it's not questionable. I'd rather pick this story as it is than wanting it to change for thoroughgoing characterization. See it as a whole and it would be near perfect, the bond of every characters as 765 Pro is the best. Alongside Amami Haruka and her idol friends, there are a producer, ex-idol like a manager, and an assistant whose later known as an outstanding soloist in a Café. Focusing on few major characters, the characterization does well here.\\n\\n\r\n     No need to ask the theme songs, basically as a layman—who haven't watched the series yet—will assume the theme songs aspect is the key here. And happily it happens to be true. The show offers so many theme songs, insert songs, character songs, tons of songs will surely fill your playlist (*☌ᴗ☌) Most of them likeable and very likely to be listed on your favorite songs list. Thumping heart rhythm, elegant songs, even rip your heart off melodies and lyrics are available to listen. 申し訳ありません, I can't listed all of the theme songs, especially the ED theme because it all too much. Two OP themes, \"READY!!\" by 765PRO ALLSTARS and \"CHANGE!!!!\" by 765PRO ALLSTARS will be uploaded to my mp3 storage publicly immediately, find it there as instances for the nice songs I mentioned.\\n\\n\\n\r\nI rate iM@S series 9! and waiting for The iDOLM@STER Cinderella Girls which is airing on this season (Winter 2015) お楽しみに ! !\\n\r\nPros:\\n\r\nNice visual, especially when they're performing\\n\r\nTheme songs are awesome~\\n\r\nThe characters are charming and have unique characteristics",
            "date": "2016-07-23T22:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 224803,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224803"
        },
        {
            "content": "2011 Series directed by Atushi Nishigori\r\nProduced by A-1 Pictures\r\nBased on the Namco Bandai video game iDOLM@STER 2\r\nReview from my POV (w/personal biases)\r\n(Sp)oiler-Lite\r\nPROS/What I liked....ALOT!!\r\n+ As always with A-1 Pictures, the animation and overall design of the show is great and really appealing to look at. From the backgrounds to the fluidity of the idols' movements on stage, this series is shown with alot of love.\r\n+ Both Openings are very addicting. AAaaand they have a different ending theme for every episode? Whaaaaat?! Sweeeet :P\r\n+ Each idol character is likeable, diverse and worth rooting for as they become more and more popular as a collective group.\r\n+ Everyidol (and then some) gets a whole episode to themselves at minimum. Almost no one is left out.\\n\r\n+ It works to the show's strength that the main antagonist be a complete asshole.\\n\r\n+ Surprisingly, this show had range. The last few episodes can get a little deep yo.\\n\r\n+ NO EXCESSIVE FAN SERVICE (cept for one instance)\\n\\n\r\nCONS/What I didnt like so much\\n\r\n- At first, the dudes from Jupiter were a bit too naive for my taste, especially the main dude.\\n\r\n- (Sp) Haruka has that random SSBB type tripping that happens outta nowhere.\\n\r\n- (Sp) the beach episode seemed a bit too fanservice-y\\n\r\n- There were a few scenes where I expected full animation, yet they were presented with still frames. Still frames are my #1 pet peeve.\\n\\n\r\nFinal Note:\\n\r\nTo my very own surprise, I was very pleased to know that this show is genuinely fun and heartwarming. It doesn't over saturate the viewer with excessive cuteness and gratuitous booty angles. This is one of those shows where you will end up smiling after every episode.\\n\\n\r\nI Recommend this to:\\n\r\nSlice-of-life fans\\n\r\npeople who like a diverse cast\\n\r\nand most of all, Dudes (maybe i liked this so much was cause it's about a bunch of idol girls who are Kawaii AF) idk",
            "date": "2013-06-24T11:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 102217,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1316105.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Cruzader93",
                "username": "Cruzader93"
            },
            "url": "https://myanimelist.net/reviews.php?id=102217"
        },
        {
            "content": "\"What's this? An anime staring a completely nameless male protagonist and 13 young girls, who are on the cover all looking at the viewer while smiling? Better get the napalm ready... Wait a minute? This isn't some extremely shitty harem, it's a fairly decent slice of life... Well actually this thing is great!\"     -mdude009\r\nIn reality I went into The IDOLM@STER (damn that's kinda annoying to spell, from this point on I'm gonna call it \"TI\") expecting as I said some half-assed harem crap that seems to be plaguing a good portion of this industry. But although it gives off this badimpression on a first glance the actual show is a very nicely done slice of life... Although I am kinda sad I didn't get to use my napalm, I love that stuff. \\n\\n\r\nStory 10/10: TI starts off as more of a formula show rather then a linear story line, and later on though the story does become more concrete the formula is still used. The show is basically about 12 fairly unknown idols (Sidenote: I though idol was a title, not a profession?) working for a small time company, 765 productions. Basically we follow these 12 idols as they slowly get more and more famous. The formula is basically one of the idols has a problem, and the producer or other idols help her get over her problem. \\n\\n\r\nBoth the story and formula seem fairly straight forward eh? Honestly though, despite the simple idea behind it the story is actually handled very well, especially in the progression. They start off as essentially a bunch of nobodies and slowly raise to stardom, it's not a perfect ascend though. The whole way up they are burdened by the downsides of fame as well as the uplifting moments. This depiction of raising stardom shown from a not completely \"everything gets better as you go\" angle really does give the overall show a much more human feel to it. I can't really get into it too much without spoilers but trust me, the plot in this regard is handled extremely well and is definitely one of the high points of the show. \\n\\n\r\nArt 7/10: The art... Damn, I really don't want to talk about the art. Art is definitely one of the shows lowest points, it's not \"bad,\" it's just kind of... Generic. The characters all look fairly template-y (if you've read some of my previous reviews you'll know that what I mean by this is how they look like they follow a standard \"template\" of anime characters that seems to be used for 95% of the industry). And the background are also fairly generic for the most part. I will however praise the shows dancing parts, I can't talk ill of these, it's smooth and solid. Nothing to write home about but decent. \\n\\n\r\nSound 9/10: This was the part I was dreading, how do you review something you know next to nothing about? Unlike someone else who's familiar with J-pop and that type of music (which is what makes up a very large portion of this show) who can easily tell you what's good and bad within that specific genre out of experience, I myself have almost no knowledge of it. But I'll give it a go, I can't skip this section, music makes up a large portion of the anime. The music is fairly good in my personal opinion, some of the songs are far more energetic and fast paces where-as others are slower and more somber, but they all sound good... Well most of them, and they do fit in with the show. And as for the voice acting I have no idea! This show has no dub and my attitude when it comes to sub is that: a) I can't understand their language or how it works and b) I'm too busy reading the subs to really pay attention to how good the speaking I have no understanding of is. So I don't review subs because it would be unfair.\\n\\n\r\nCharacters 9/10: Finally we get to this point, I apologize if the previous entries were kind of boring but the characters really are the meat of the show (as is common with slice of life shows). And we all know the meats got to be good, I mean if you order a steak sure the baked potato might be amazing but if the steak is shit then it doesn't really matter. Thankfully this show doesn't have that problem, the characters are likable and (with the exception of a few problems) very well done. They all have their own personal quirks, personalities, and of course problems (fairly down to earth problems too, with the exceptions of a few silly and over the top moments here and there), making all the character quite human and relatable in some circumstances.\\n\\n\r\n\"Wait, you mentioned it wasn't completely perfect!\" True... True... When I went into this show after the first few episodes (when it convinced me that this wasn't some crappy harem) I had a small fear. \"If there's 25 episodes and 12 main protagonists, won't there be some spreading out issues?\" Turns out my fear was not unjustified. Let me compare it to this: You have 10 slices of bread, but only a small amount of jam. Now you could equally distribute it but then it would be spread fairly thin, or you could put more on certain pieces but then the other would have an even thinner spread. TI went with the latter. In the end we have characters like Chihaya that are very fleshed out with plenty of screen time (not that I'm complaining, I loved the way her story played out) but we also have characters like Ami/Mami, Iori, Azusa, ext... Who despite being central protagonists seem to just be supporting character. Though (arguably) it's better like this then having about 60 episodes of it, the shows good but that many episodes would be pushing it. \\n\\n\r\nEnjoyment 10/10: Like I said before, I did not go into this anime expecting much. I was pleasantly surprised, the show in the end turned out to be quite enjoyable. The great characters combined with the very will handled story and quality sound do make this an anime worth watching. Don't worry my skeptical friends, no shitty harems over here. \\n\\n\r\nOverall 9/10: If you're looking for a good slice of life anime (you know, if you're not on the other 50% of anime fans who despise slice of life and everything it stands for) you've definitely come to the right place, a good mix of drama and comedy with likable characters and a good story. You won't be disappointed... And if you are let me know, my napalm may go to good use after all.",
            "date": "2013-01-05T00:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 82692,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1263085.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mdude009",
                "username": "mdude009"
            },
            "url": "https://myanimelist.net/reviews.php?id=82692"
        },
        {
            "content": "\"Are you ready? I'm lady!\" - 765PRO (I am a guy btw *cough cough*)\r\nAssuming people have no knowledge of what \"The iDOLM@STER\" (will be written as iM@S later) is about, it was a rhythm game initially released by Bandai Namco in 2005 (as arcade), and was further developed into other platforms later.\r\nUnfortunately, I never play any of the games because it's either I don't own the platform (XBOX, PS, etc) or I am financially poor as most of the iM@S games (Android, iOS) are not free and you have to buy them (exception being CGSS, but it's in a different setting which is not relatedto 765PRO). This review will be solely based on the anime (OVA and movie inclusive) so don't judge me wrong if I have written something wrong about iM@S.\\n\\n\r\nStory: 8\\n\\n\r\nIn short, iM@S is about a story of 12 (or actually 13) idols with their \"Producer-san\" in a small company. Throughout the series, the girls work hard to become what they are aiming for ----- Top idols.\\n\\n\r\nThe flow is nice and every girl is dedicated at least one episode for screening so no one feels left out.\\n\\n\r\nArt: 9\\n\\n\r\nI enjoy everything shown in the anime and I guess I couldn't write much about art anyway. I will leave a 9 here.\\n\\n\r\nSound: 6\\n\\n\r\nNote: This category is totally subjective.\\n\\n\r\nAs for me, iM@S songs (OP/ED/inserts) hardly attract me to be frank (I am still downloading the full iM@S albums by the way as there are a LOT). As an idol anime which I have a certain expectation on good musics and/or songs, iM@S was a little letdown for me. I personally prefer the whole group singing together rather than their respective solos (i.e. endings). The only girl who can really sing well is Chihaya in my opinion.\\n\\n\r\nCharacter: 8\\n\\n\r\nHere comes one of the most asked questions: Who is/are your favourite(s) and least favourite(s)?\\n\\n\r\nOkay, every girl is likable to her own, but.... not Iori seriously. She does have her positive attitude occasionally but her \"tsundere\" nature just pissed me off in the beginning.\\n\\n\r\n(I am sorry if I offended any Iori fans around the world who will eventually hunt me down but that's just how I feel.)\\n\\n\r\nPS: For your reference, Haruka stays first in my \"list\", followed by Chihaya. I can't decide who should go for the third place since the rest looks equal for me.\\n\\n\r\nEnjoyment: 9\\n\\n\r\nI will be lying if I say I never enjoy the whole series. I am a sucker for SOL + \"aidoru\" series so I admit giving a biased score of 10/10 for enjoyment. :P\\n\\n\r\nOverall: 8\\n\\n\r\nSo overall, iM@S depicts what an idol really is and how idols live. As I had mentioned above, I do like the story, the plot, the setting and the characters but I am slightly disappointed on their songs (I mean, most of them.) but again this is just my opinion.\\n\\n\r\n-------------------------------------------------------------------------------------------------------\\n\\n\r\nMovie: 5\\n\\n\r\nThe movie is pretty disappointing to be honest. Nothing really new happened during that 2-hour long movie. You hardly see anyone from 765PRO other than Haruka and Producer-san in the movie. The new characters, Shiho and Kana (there's a total of 7 but I only remember 2 of them) steal almost all the focus from others including 765PRO but they just look pathetic in the movie. What I really like in iM@S as a whole is 765PRO, not that bunch of redundant \"back-dancers\".\\n\\n\r\nOverall, I don't recommend people watching the movie unless you need that sense of achievement in completing the whole iM@S series (like me).\\n\\n\r\n-------------------------------------------------------------------------------------------------------\\n\\n\r\nOVA: 6\\n\\n\r\n3 OVAs with exactly same plot, only with different titles and different characters. There's nothing bad about the OVAs, but nothing special as well. Watch them if you wish to complete the whole iM@S series, as mentioned above.",
            "date": "2016-03-21T00:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 213505,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2529171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/imnoob92",
                "username": "imnoob92"
            },
            "url": "https://myanimelist.net/reviews.php?id=213505"
        },
        {
            "content": "Idolm@ster are series which you will learn to love or will keep hating from the beginning till the end.\r\nThe basic impression series give are K-ON style and if you hated K-ON then there are very little chances that you will like this series. \r\nHowever, in comparison to K-ON, Idolm@ster actually tries to have some kind of story even if it is a basic one. Series also have some kind of progression, Idols are actually progressing in their careers while K-ON members spent whole series drinking tea =/\r\nA minus is the fact that Idolm@ster has a VERY huge characters cast which just didn't get enough timeto develop and some characters felt left out. However, I still think series did well since every character got at least one episode dedication which is far more than some other series do. Shiki is one of examples, I really liked those series but biggest part of characters barely even got 5 minutes of spotlight there while Idolm@ster offered at least one episode per character.\\n\r\nAlso characters always keep interacting with different people, not just with the same circle of friends. Of course there are those with whom characters are more close than others like for example Haruka/Chihaya. But it doesn't stop them from exchanging several words with someone else.\\n\\n\r\nThe biggest highlight of the series were the last like 6-7 episodes, where the drama had struck in. Episode 20 had one of the best executions I had seen in anime. The outcome was very predictable but creators managed to bring a real impact and I think that this episode alone has to be seen.\\n\\n\r\nSeries also had a good set of music, some better than others. A really huge variety of songs, though we barely ever heard full versions, but they did serve as good teasers.\\n\\n\r\nI personally didn't like series at first and planned to drop it several times. The stand alone episodes weren't that entertaining, and seemed to lack in humor area. However, it started to get more funny somewhere around episode 8. That's where I decided that it is worth to keep watching the series at least just for a good dose of humor once a week.\\n\r\nSome kind of story began at around episode 11.\\n\r\nAs a person who likes drama, the real highlights for me began at episode 19/20 and sometimes I couldn't wait to see what happens next.\\n\\n\r\nIf you are searching for relaxing series with some kind of story, Idolm@ster will do perfectly.\\n\r\nIf you are searching for series with good/strong story and character development, you'll hate it to bits. \\n\\n\r\nThe best way to orientate yourself is to compare series to K-ON. If you hated the whole idea behind K-ON, there is no way you'll ever like this series. If you had at least some kind of interest in K-ON then this series are worth a try. Just don't drop it from the start and let it build up. If you still will hate series after episode 13, drop it. And maybe just check episode 20 on it's own.\\n\\n\r\nAnd don't get put off by episode 1, it was done game style. Every other episode is normal.\\n\\n\r\nP.S. I never played the game but I heard that main idea behind it was that you are playing for Producer and helping each girl in their career and maybe even start some kind of relationship. \\n\r\nI really liked the fact that anime didn't follow that rode. Producer did keep helping the members and he did get closer to some members more than to others. But there were those cases where things were resolved thanks to someone else or by characters themselves. Producer didn't serve as a constant saver, and that made series look more 3 dimensional. \\n\\n\r\nOver all I think this series deserve 8 as a good relaxing series.\\n\r\nAs series with strong story and character development, they would probably only get around 4/5.",
            "date": "2011-12-24T03:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 49991,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238319.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kitten320",
                "username": "kitten320"
            },
            "url": "https://myanimelist.net/reviews.php?id=49991"
        },
        {
            "content": "While most slice of life animes that exist only contain a small slice of what actual life is like, the Idolm@ster actually seems like a plausible, real-life show.   What is the point of having a genre called slice of life if the show hardly resembles real life at all?  While most slice of life shows rely heavily on situations that would almost never happen in real life, the Idolm@ster finds a way to be an enjoyable show without doing so.  There are exceptions of course, such as Hibiki’s being able to converse with animals and Yukioh’s attitude towards men at thebeginning, however neither were dominant factors in the show.  This, I believe puts the Idolm@ster above the other slice of life shows that I have seen in the past.  \\n\r\nThe show focuses on twelve girls that are trying to become big idols at 765 PRO, a production company for idols.  The idols fit almost every personality type possible, which normally means that almost all of the characters end up being two-dimensional, except, they don’t.  They manage to give each character a considerable amount of growth and development throughout the show, without focusing on one character more than others.  The company they are employed by is small and inexperienced in the management of idols.  This is prominent only during the early stages of the show however, as the producers get their shit together much faster than the idols.  \\n\r\n\tThe first episode starts off with eight minutes of continuously showing different girls and slapping a giant 765 PRO logo next to their face, one of the most obnoxious first episodes I’ve ever seen.  This left a bad impression on me for the first eight episodes of the show, as not much was happening to really make me care about the characters.  When the show started to become a little more serious near their first concert however, I found the show quite enjoyable.  Each episode also features a short song sung by one of the idols, they are usually horrifyingly bad but some may enjoy them.\\n\r\n\tAt the end, I must say that the Idolm@ster is one of the most enjoyable slice of life shows I’ve ever seen.  It’s fairly enjoyable with the only real drawback being the slow start.  I give the Idolm@ster an 8 / 10, a score I pulled from my ass as I have no real grading criteria and don’t want to give it a ten as it had too many problems to be called perfect.\\n",
            "date": "2013-09-06T17:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 112145,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1770717.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/seiryotennan",
                "username": "seiryotennan"
            },
            "url": "https://myanimelist.net/reviews.php?id=112145"
        },
        {
            "content": "When first looking at Idolm@ster you tend to think 'its just another show about becoming an idol' or 'oh its another show with a lot of cute looking girls who are happy-go-lucky'. However, if you give the show a chance instead of watching just an episode or two you will discover it can actually be more than that. Even though the show has a lot of main characters, Idolm@ster does a great job introducing them all and going further into their characters. Each episode can be about a specific girl, but each episode isn't solely focused on them either. When a problem is introduced toone of them it not only shows how it affects them but the others as well. The story shows the idols [and the company?] slowly progressing to stardom. You even have a little bit of an antagonist in the show appear to heat things up! This anime is very funny, exciting, and can be dramatic when it wants. However I do feel as though the story lacked something. It might be that even though this anime is different it somehow felt predictable. Like a few other animes were similar to the show. However even if this is the case this show does stand out on its in own from others by the characters, art, and music.\\n\r\nThe show isn't about being famous, but the the bonds these girls have created and their everyday life to get to the top.\\n\r\nThis anime art style is one that I favor a lot. It is more realistic than other anime styles but it also holds the anime feeling. The style also complimented the character design, personality, and even their voices. Each character were unique in their own way from long silver hair to the shape of their face and even their eyes. Even if their personalities seem to be very bubbly the show makes it a point to show that they are different from one another and each girl has different tastes. \\n\r\nThe animation wasn't half bad either. Especially the concert scenes, with the background of the audience to the dances they performed on stage, everything was constantly moving and you were rarely staring at a picture for minutes [like some low budget animes]. The flow of the animation really help keep it going and keep the viewers entertained. However, there were a few times the animation was still for a lot longer than I think it should have. The ending themes to the episodes I enjoyed it being stills. They were always different and also related to everything that happened in the episode. The music for this anime was also very enjoyable. A lot of it was kind of too bubbly or slow for my taste, but the music was still good none-the-less. \\n\r\nI believe I would re-watch this anime given a good bit of time since i prefer shorter animes. Other people planning on watching this anime should give it a go even if you are reluctant. I was at the beginning but i'm glad I watched it.",
            "date": "2013-09-25T22:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 114281,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2467097.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KoreanMunchkin",
                "username": "KoreanMunchkin"
            },
            "url": "https://myanimelist.net/reviews.php?id=114281"
        }
    ],
    [
        {
            "content": "Time to get a better look at one of the anime of 2011 that ended up being unexpectedly good.  Now I am aware of the cover of this show having over a dozen girls on it and the idea connected with this is a giant harem.  Luckily, I never managed to connect the two and took a look at the show anyways.  What I primarily expected/hoped for was a GOOD music moe anime.  After all, one of the most popular anime which incorporate these two parts is K-ON!, a show that pretty much revolves around a group of high school girlsscrewing around in a club room ._______. which just wasn't my cup of tea (get it? cuz all they did was drink tea? q-q).  With this, let's dive into the world of idols with The iDOLM@STER.\\n\\n\r\nIn my opinion, there are three things that help generalize a show on if it is good or not.  First the audience must feel welcome in the setting: this pretty much is how interesting our surroundings are, the animation/sound, and/or the characters in it.  Second we need to get emotionally/mentally invested; we need to be stimulated in some way so that we do not get bored.  This could mean making us laugh from a gag, get intellectually invested from a deeper meaning, cry from an emotional scene, or just give you an adrenalin rush from watching an amazing fight scene.  The third is if the show can follow through with the rules that they create for themselves in the plot; in other words, if you are a show about music, DO NOT stray from music so far that we are watching something completely irrelevant.  All of these must be kept in mind when reading what I am about to present and we will see by the end how good the show actually is.\\n\\n\r\nSo The iDOLM@STER revolves around 12 musical idols and their climb to fame.  We are taken through their struggles with the business and all of the personal problems that they each have to overcome, whether it has to do with issues they have involving work or problems at home.\\n\\n\r\nAnimation:  The animation behind iDOLM@STER is very well done.  Everything looks fluid and in place, not to mention that the concert scenes are incredibly well designed and show every little detail.  For 2011, this is amazingly well done animation and the only complaint that I have about it is that the incredibly detailed animation of the characters on stage did not carry on off stage.  This lack of detail could be due to either not having the budget to support it or to make the concert scenes more effective.  Now there is something that might turn off some, which is the moe.  iDOLM@STER is a show which uses the moe style, but this isn't a bad thing if it is done well and doesn't distract the viewer and personally, I had no qualms with the style even though some might.  I bestow a 9.5 on iDOLM@STER for animation and the only way I could see it being better is if it was consistently detailed.\\n\\n\r\nSound:  So did you know that this show is about music?  Well as you can expect, the music is done quite well considering that's the shows genre.  It was very nice to hear a different ending theme every episode done by the character that the episode revolves around.  Also, the background soundtrack was well done and very fitting.  Both the OPs are good (the first is better in my opinion) and are performed in a concert at some time in the show.  However, I can only consider putting one or two songs from the show on my iPod.  As far as the dub goes, I feel that if the dub was not outstanding or horrible, then there isn't much point in talking about it.  All the VAs performed well, but other than Asami Imai (who played Chihaya and did a great job), I didn't feel like looking into any of the other cast.  They were pretty average, they fit the characters but weren't outstanding to me.  I give the show an 8.5 in sound, I only wish that they would have had more memorable pieces for a music anime.\\n\\n\r\nCharacters:  iDOLM@STER handles its episodes by having a different character for the main focus for almost every episode, which leads to having a massive main cast.  By having such a large cast, everyone will have several favorites that they hope to see as the central point in an episode.  Having a show that provides everyone is great and all but what about all the characters that you don't like?  Well your gonna be outa luck because most characters only get one episode so if you only like a couple characters and hate the rest then you better hope that one of the characters that you like is one of the big three that get more than one episode.  I give the characters an 8 since I luckily liked most of the cast.\\n\\n\r\nPlot:  Well damn, this is the one part that people really do not want a show to be poor in and there you go... iDOLM@STER goes and gives you only a slightly above average story.  As I said earlier, the show deals with different characters each episode and due to this, sometimes goes off track and doesn't focus on the musical aspect of the show in any way.  I actually think that they could have cut almost ten of the episodes out and it wouldn't have made the enjoyment or plot any worse but probably better.  Yes everyone wants their favorite idol to get an episode but why couldn't those episodes have stuck to the genre of music?  Now I'm not saying that every episode needs a concert but they could have shown more on the struggles with work.  I will give plot a 6 because despite irrelevant episodes deriving from the focal point of being an idol, some of the character arcs were very well done, sadly they do not make up for the rest of the show to upgrade its score anymore.\\n\\n\r\nEnjoyment:  The show was pretty enjoyable.  The final episodes of the first and second half of the show are great and the other episodes on the individual characters were somewhat entertaining as well.  iDOLM@STER was a 7.5 in my eyes as far as entertainment goes.\\n\\n\r\nOkay, so now to get back to the three points that decide if a show is good or not.  Firstly, the show brings you into the world of these idols incredibly well with the first episode.  The styling of how it was done plus the animation and music drew me in instantly.  As for how well it played with my emotions; it played with them to the extent that the show needed to.  The final episodes of each half had me in anticipation of what would happen next and left me wanting more.  As far as how well it stuck with the rules it set... ugh, not so well.  It stuck with the rule of giving each character an episode but that isn't what the first episode presented, which was the idea of the business behind being an idol and what it meant to them.  So how good is iDOLM@STER?  Well the show is pretty good, not fully meeting each of the three points shows that it could have been better.\\n\\n\r\nNow before I give you my final verdict, I'd like to give you a viewing recommendation.  I suggest that you only watch episodes 1, 3-6, 10-14, and 19-25.  What this will do is skip unimportant episodes to the plot and keep some of the best developmental points.  After watching these episodes, then you should watch the remaining like they are an extension of the show.  That way you will be able to watch for the story and true main characters first and if you liked it and want to see the remaining characters you can watch them as if they were an extra.  Overall the show receives a 7.9.",
            "date": "2013-06-06T20:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 100069,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1211121.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FireFly1",
                "username": "FireFly1"
            },
            "url": "https://myanimelist.net/reviews.php?id=100069"
        },
        {
            "content": "What does it mean to be an idol?\r\nAt first, I was hesitant in picking up the iDOLM@STER. The first episode was dull and boring. I mean, sure, it introduces the characters, but it's some person filming girls. Unless you're into that stuff (not judging), you don't really have any reason to continue to the next episode, because it doesn't offer anything to grab your attention.\r\nThat was my initial impression, but as I forced myself to go on with the series, I grew more and more thankful that I didn't completely drop it. It was surprising- everything was. By the end, I felt content. It hadgrown on me, and I wholly welcomed it.\\n\\n\r\nGiven the premise: \"to become a top idol\", the story outline is pretty linear. Every time they reach a new height, they slide down a bit, only to get back up higher. Although that's the case, the story wonderfully used the elements of the idol industry to highlight each character's traits, and use them to raise each one up even higher.\\n\\n\r\nThe characters are pretty diverse, though pretty generic. Each one has their own selling point, and everyone sort of compliments each other. This relationship between the cast is what powers their push to the top. When put under the spot light, they dealt with it in their own, unique way. Seeing the characters grow and claim their personalities as their own is what made me love iM@S the most.\\n\\n\r\nA-1 Pictures did this series good. The art has this fun contrast that makes it memorable and visually appealing. The characters are drawn simple and plain, while the scenery and backgrounds are made detailed and extravagant. The animation was clean and fluid to an extent. That may seem pretty average, but what surprised me is that everything, except the audience at certain scenes) was drawn by hand, even the dance scenes. Props to them for that. Though that's pretty typical for them, I guess.\\n\\n\r\nFor an anime about idols, the music was quite underwhelming. For the most part, their songs were used as background music. It was hard to fully appreciate the music when something else is happening, especially when there's dialogue at the same time. The focus of the viewer is put more into what is seen, making most of the songs forgettable.\\n\\n\r\nWith my point above, I made it seem like the idols are their music. Maybe. But, what does it really mean to be an idol? It doesn't matter as long as you're having fun.\\n\\n\r\nThe iDOLM@STER is a spectacular show that revolves around the idea of idols as a career. It showcases the struggles of getting into the industry, and the problems that come with rising to popularity, and how it affects people and their relationships. The experience is fun, and the bonds that are built along the way are lasting. Everyone's feeling reached out and touched me, and I'm sure your's too if you give them the chance.\\n\\n\r\n\"Is the goal near? No. This is just the beginning\". 9/10",
            "date": "2016-07-05T06:58:00+00:00",
            "helpful_count": 0,
            "mal_id": 223192,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4706314.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Arcanon",
                "username": "Arcanon"
            },
            "url": "https://myanimelist.net/reviews.php?id=223192"
        },
        {
            "content": "The only word I can use to describe this series is \"Cute\".  The story was pretty good for a \"slice-of-life\" as it actually went somewhere and wasn't simply episodic which was a plus.  Some of the characters were, well, they could be a bit annoying at times but there are quite a few to choose from (there are a couple of \"main\" protagonists but not one that stands out WAY above the rest) so you know that they'll not get ALL the screen time.  \r\nMusic was good, as you'd hope!  So yeah, cute girls doing cute idol-y things and a prettycute story (with some bits a little bit deeper but still with an \"awww\" factor by the end of each).  It's a bit like K-On, but with more characters and as an actual job, not just a post school club - there is hardly any mention of school life which was a plus in my book.  If you're a fan of either the games, the previous anime or just simply J-Pop and cuteness, you'll probably like this too.  Enjoyable, but not perfect.  \\n\\n\r\nOverall a good 8/10\\n\\n\r\n(Why such a short review?  See my profile)",
            "date": "2012-01-20T12:25:00+00:00",
            "helpful_count": 0,
            "mal_id": 52173,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/228567.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mantzy",
                "username": "Mantzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=52173"
        }
    ]
]