[
    [
        {
            "content": "-- This review contains spoilers. Only read if you have finished the series. --\r\nStory: \r\nThis was an anime that caught my eye from the very beginning. The way it presents itself could be alluring to anybody, yet the story felt as if though it lacked any creative direction. Our main character, who goes by the name Sana, is basically an experiment with luck on her side. After her escape from the depressing facility, as if by fate, she meets and ends up being taken care of by Zouroku. Like most people, Sana cannot escape her past and is forced to go head to head withenemies... and then the second half of the story begins. This is where it essentially fell apart for me. Rather than focusing on what caught everyone's attention to begin with, it lowers itself to carefree almost slice-of-life-like daily events that do not seem significant initially. Another girl somehow magically attains the Dreams of Alice power and the last third of the show basically revolves around her and the birth of her friendship with Sana. This ended up achieving two things: Sana is no longer lonely, and we see a glimpse of the impact the Dreams of Alice has on the world - or at least Japan. However, at what cost did this underwhelming ending have on the show? Let's not forget how the expansion of Wonderland was ceased all at the push of a button, literally. \\n\\n\r\nArt:\\n\r\nIn terms of art, J.C.Staff has done better. With that said, it does portray a sort of childish atmosphere, and I can see why they went with this. I don't recall seeing dips in quality, either. For what it was trying to achieve, I would say it did a good job. \\n\\n\r\nSound: \\n\r\nThe music was different from what we normally hear. Overall, I would describe it as a happy-go-lucky adventure in itself. It mirrored the show, or to be more precise, Sana's personality. \\n\\n\r\nCharacters: \\n\r\nWhen it comes to character development, I doubt there's much \"development\" a child can achieve in a show. But with Sana, we basically start from ground zero. As Zouroku mentions, everything is a first with her. Their relationship together can be seen as a grandfather and his granddaughter, or possibly even a parent and their child. His constant help really emphasizes how little she knows of the world, and throughout the show we end up seeing how she gradually learns. In comparison to the child characters, the adult characters received little screen time. If the show was longer, we could have gotten to know them a bit more. The show mainly focuses on the children, with the exception of Zouroku, and the things they learn throughout this journey. Zouroku himself is an honest man who wants nothing to do with corruption or what isn't deemed as the \"honest life.\" His real granddaughter, Sanae, is painfully just there in the background most of the time. She seems like an airhead, but in reality she's just always cheery - much like Sana is. \\n\\n\r\nIn the end, there wasn't much to the story and characters as I thought there would be. If the show was expanded into more seasons, then I could understand. Unfortunately, it looks like they decided to give it its own ending. The final scene with grown-up Sana seemed rather cryptic as the fog that surrounded her and flowers she held immediately made me think she was at a graveyard, which possibly hints that Zouroku died about a decade later.\\n\\n\r\nTo me, the whole show seemed like a waste of a decent plot. Nothing was really achieved on a grand scale. The exception would be the Dreams of Alice being spread to other people, but we never really got to see more into that other than it happened. But who knows. Maybe that's not what the show was going for. Maybe it was just a story about a girl who desperately wanted a happy ending. \\n\\n\r\nFinal score: 4/10.",
            "date": "2017-06-25T10:10:00+00:00",
            "helpful_count": 64,
            "mal_id": 250996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3498079.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Zelev",
                "username": "Zelev"
            },
            "url": "https://myanimelist.net/reviews.php?id=250996"
        },
        {
            "content": "Most of us have at one point questioned our own existence. After all, knowing our reason for being can be among our most valuable assets. We desire meaning from our lives, so pondering questions like “who am I, really?” and “what is my purpose?” is only natural.\r\nI bring this up not to go into some deep, pretentious analysis of this topic within the show, though there is some material there. Rather, I bring this up because Alice to Zouroku could have really benefited from taking a good, long look at itself in the mirror and seriously asking these questions.\r\nHereafter referred to as “AtoZ”, Alice toZouroku seems to face a bit of an existential crisis. The issue here is twofold: one pertaining to its focus as a whole - in other words, what it is - and the other to its appeal or value to viewers; its purpose for existing in the first place.\\n\\n\r\nGenre-wise, AtoZ mainly functions in two sharply-contrasting halves. One half of it (technically closer to two-thirds) is mainly slice of life with some interesting fantasy elements incorporated, while the other is more focused on action and drama. It does eventually stick to the former, but much of its runtime is spent stubbornly refusing to commit to one or the other, which comes at the detriment of both halves not being as well-realized as they could have been.\\n\\n\r\nThis kind of balancing of vastly different genres isn’t the easiest thing to pull off, but here is one area where I’ll give AtoZ credit. While its choice to hedge its bets does limit its greater potential, the show actually does an okay job selling the shift between them. The show spends long enough between genre shifts (usually a full episode or two) to allow its desired tone to properly settle in. This means that when it’s in slice of life mode, it actually manages to feel like slice of life, as opposed to just “down time” between action set pieces. Meanwhile, the more dramatic points still feel like more than just diversions. The series manages better than most to have two personalities at once; one for exciting times and one for laid-back moments.\\n\\n\r\nEven with only a 12-episode lifespan to work with, I’m glad it at least managed to explore the slice of life portion to a satisfactory degree, because that half is actually quite decent. The dramatic elements, on the other hand… well, to put it bluntly, they kind of suck. I’ll get back to that.\\n\\n\r\nUnfortunately, for AtoZ, contrasting genres isn’t the real issue here. A more notable issue is a lack of any substantial standout qualities – something to make it appealing over any other story of its type, particularly with how many of its wildly varied ideas are commonly seen in other series. Pretty much every individual element – every idea and its exploration - in AtoZ ranges from decent enough to outright bad, and none of it comes together to create something greater.\\n\\n\r\nStarting with the presentation, how are the visuals? They’re okay, I suppose. Color-wise? It’s fine. Character designs? They’re distinct-ish. Animation? Average to stiff. Level of detail? Not bad. Character expressions? Functional, but nothing more. There’s plenty of CGI, but it isn’t integrated very well into 2D scenes. There’s also an extended action sequence featuring some full 3D shots, and while it is decently dynamic, it simply doesn’t look that great (and that’s not even counting one hilarious animation error involving a moving background outside the parked car). What about the rest of the action? It’s nothing special. There’s no impressive choreography or impact, nor much emotional buildup, and little to no tension (as I’ll expand on later). There’s one exception that was actually solid, but the action as a whole isn’t much of a selling point.\\n\\n\r\nSo if the visuals can’t impress, then what about the sound? Well, the voice work is competent (subbed; haven’t seen the English dub), including vocal expression and delivery, but it’s not outstanding. Sound design? It works, I guess. Music? Actually, the soundtrack, while not that memorable in its own right, is often quite evocative in context, and I quite like the opening and ending themes. But does a modestly above-average OST do enough to make otherwise mediocre presentation great? It does not.\\n\\n\r\n“But so what?” one might ask. After all, almost every aspect I’ve listed so far, while typically unremarkable, is still acceptable, including the show’s handling of multiple genres. At the end of the day, the presentation is nothing ruinous, and it doesn’t have to be great if there’s strength of substance being presented.\\n\\n\r\nSadly, this is where the show runs into a serious fundamental problem: AtoZ, at least during its non-slice of life moments, is straight-up poorly-written. Those dramatic elements I mentioned earlier are seriously squandered by persistently low quality of writing.\\n\\n\r\nThe series tries very hard during these dramatic scenes especially to keep things flexible and varied. On one hand, the show poses all sorts of questions about Sana, her existence, the facility she escapes from, and several characters, among other things. The show leverages these questions and finds a degree of success here in initially hooking viewers. Alright, seems fine so far.\\n\\n\r\nBut on the other hand, there are all the different powers that Sana possesses, and they pose a real problem: they’re too powerful. Their versatility is taken way too far to give the show any hope of telling a compelling dramatic story; creating matter to summon pretty much anything, mind-reading, flying, manipulating objects, teleporting with some control over the destination, and that’s just from episode 1. Later points introduce some other equally if not more broken powers. Sana can pretty much do whatever the plot demands, and that includes pulling new abilities out of thin air whenever convenient. Normally, the established powers are already enough to prevent the main characters getting into truly tight situations, but even in rare exceptions, Sana possesses so many convenient powers that there’s usually nothing stopping the series from just coming up with a new way out for her or others on the spot.\\n\\n\r\nThe only semblance of a limitation on Sana’s powers is her current energy level, which in practice ends up almost a non-issue for her. When it does come up, it can easily be fixed as soon as Sana gets a hold of some food. How does the series compensate? Simple: make Sana conveniently not have eaten enough since last using her powers.\\n\\n\r\nThis lack of sufficient limitations also creates all sorts of loopholes that quickly result in things falling apart. For instance, why can’t Sana just teleport out of every problem? The show only bothers to contrive an excuse about half of the time, usually something to do with food again, and even those aren’t always very well conveyed or thought out. Any other time, it’s like everyone just outright forgets. That’s a real tension-killer, and it’s far from the only tension-killer this series falls victim to.\\n\\n\r\nThere are other writing issues present, which include plot holes, other loopholes, inconsistencies, contrivances and so on that bring the whole thing down anytime it attempts something dramatic. I’m going to get into some plot/event spoilers for the first 5 episodes here to go over some of them; scroll past to skip them. Now, I want to be fair to this show, so only things I feel have at least a noticeable effect on either the show’s integrity or the viewer’s experience are included.\\n\\n\r\nWith that said, let’s begin!\\n\\n\r\n*****SPOILERS FOR EPISODES 1-5*****\\n\r\n*********************************\\n\r\n*********************************\\n\\n\r\n- The show tries to make Sana’s recapture seem like a huge threat, but her teleportation ability undermines this. Even if, somehow, she gets kidnapped, attempts to rescue her fail, AND she gets taken back to the lab… so what? As soon as she isn’t actively being pinned down, unable to use her powers (and they have to let her use her powers eventually or they can’t do tests with them), she could just teleport away! That is, assuming she isn’t “conveniently” too low on energy at the time for that to happen, but this was only the case on her initial escape. There’s just not enough sense of finality or decisiveness to the threat of Sana’s capture, which only serves to dampen the suspense even more than it already was.\\n\\n\r\n- Furthermore, Sana gets a tracking device put on her for safety before her kidnapping in episode 3. Setting aside the fact that this leads to even less tension, even Sana’s successful capture would just serve to easily reveal where she and the research lab are located. And the show tries really hard to make this whole sequence dramatic. It doesn’t work.\\n\\n\r\n- Episode 1&2: Sana, while a few normal pancakes away from fainting, was easily able to teleport both herself and Sanae to many random places in quick succession. This includes Antarctica, tens of thousands of miles away, and then she brings back a swarm of pigs along with them. This only serves to make the brokenness of her teleportation more obvious, while seemingly contradicting the “conservation of energy” rule established. (Apparently all those pigs combined have less energy value than a few normal pancakes.)\\n\\n\r\n- Episode 1: in the car chase, there was no apparent reason why Sana and Zouroku couldn’t just teleport themselves away and use Sana’s powers to replace the car on the other end. She had enough energy to easily lift the entire car, drive it around, and detach her opponents’ giant chain - a quick short-distance teleport at least to a nearby hiding place should have been no trouble. But nope, got to keep the poorly-rendered car chase going!\\n\\n\r\n- During the kidnap in episodes 3-5, instead of using her powers to teleport Zouroku to her, Sana could have just teleported away herself. Clearly neither a lack of energy nor her being pinned down was preventing her from using her powers, seeing as she manages to summon Zouroku, heal herself completely and then literally rewrite her situation mere minutes later to get rid of the hands pinning her down, all with no extra food. (And as mentioned before, this whole time we know Sana has a tracking device on her, so everyone is obviously going to have no trouble getting to her. The lack of tension continues!) At least the sequence led to some decent, if rather forced, character development.\\n\\n\r\n- Sana can instantly and easily look into anyone’s head and find out everything about them and their background, including what their relatives are doing (episode 1; she finds out about Zouroku’s granddaughter). This makes the mysteries surrounding who characters are, the facility she came from, where that facility is, what their motives are, and who Sana herself is, become completely trivial matters. Sana should have figured all this stuff out, either while she was at the lab or after her escape, but the issue is never brought up.\\n\\n\r\n- This anime’s plays for sympathy typically fall flat. The lab just does vaguely (very vaguely) “horrible things” to its subjects for energy experiments for which we’re given no context as to why they should ever have involve horrible things, because they’re the show’s generic evil organization figure which exists for the sake of weak drama and making us feel sorry for Sana. Minnie C immediately blows her clichéd “dead partner” backstory in an attempt to make her a sympathetic villain, except that we don’t even know her enough to feel any kind of attachment or sympathy. But hey, got to have an excuse to make her a menacing and villainous woman who is mean to children and shoots one in the leg without remorse to stop her from acting out of line.\\n\\n\r\n- On that note, Sana getting shot in the leg by Minnie C is probably the show’s most egregious example of a failed sympathy card. “*gasp* NO! SHE SHOT THE CHILD!” the audience cries, only for it to barely matter 2 minutes later because it was instantly healed with Sana’s usual overpowered magic abilities while she simultaneously rewrites her situation so she isn’t even pinned down. Really? Neither one of these abilities was established beforehand, and 2 minutes later it’s like Sana forgets she ever got shot, with no effect on her personality or outlook. All that came out of it was brief shock value and another excuse for Sana to have low energy and require a delicious Snickers® bar to later recharge. It just ends up feeling like cheap plays for emotions because this poor, poor child is captured and pinned and scared and wetting herself and is in pain for a few moments. All this, while we know she’ll just be rescued shortly because of the tracking device. It’s overblown, ineffective in context, and too shamelessly manipulative. Yes, drama is technically manipulative by nature, but this show makes its manipulation mechanisms way too obvious to the viewer to be effective. It’s clear when the show is just playing for cheap sympathy points, and in many cases, it comes across as desperate.\\n\\n\r\nAtoZ’s dramatic elements aim for flexibility, but ends up creating loopholes and relying on half-assed excuses. It tries to create suspense, and mostly fails because of said loopholes. When it goes for sympathetic, shocking or dark elements, they feel cheap, and there are overall hardly any successful dramatic scenes. As a whole, the quality of writing just isn’t up to standards, and at times, it gets plain annoying.\\n\\n\r\n*********************************\\n\r\n*********************************\\n\r\n*********END OF SPOILERS**********\\n\\n\r\nBut with all those issues out of the way, is Alice to Zouroku an irredeemable show? Well, maybe not.\\n\\n\r\nThere’s a certain major development and shift that comes up in the middle of the series, almost out of nowhere. Some might call that another instance of poor writing. I’m going to call it a miracle, because it kicks of the “second half” of the story, where, at last, the series actually focuses on one thing! No more poorly-written pseudo-dramatic nonsense; just slice of life albeit more whimsical than average with some wonderland-fantasy elements. And the show definitely benefited from this transition, going from something I generally disliked to at least finding passable for the rest of it.\\n\\n\r\nDespite all of the writing problems present in the dramatic portions of the show, the slice of life components fare significantly better. When the series opts to focus on the more down-to-earth relationship between Sana, Zouroku and Sanae, most of the writing issues don’t apply. Granted, the occasional questionable element still pops up; these are mainly smaller details like Sana using her energy-demanding powers to fly because she’s supposedly too tired to walk, or her saying she hadn’t eaten in 3 days even though she clearly ate a rice ball earlier that afternoon, but none of it is stuff that cripples the antics as a whole; at worst, it might affect a brief interaction that is quickly moved on from.\\n\\n\r\nAs for the antics themselves, they’re not going to blow anyone away, but they do offer a few decisive strengths.\\n\\n\r\nWhile the supporting characters of Alice to Zouroku are straightforward and unremarkable, the chemistry among the main duo is actually fairly strong. Zouroku’s staunch no-nonsense attitude makes him stand out from your typical guardian-figure lead. For Sana, whenever she’s not reduced to a plot device (something thankfully exclusive to the dramatic elements), watching her try to understand the world around her can be interesting.\\n\\n\r\nUltimately, though, it’s the way these attitudes contrast and bounce off each other that make things endearing, and it also leads to the occasional bit of genuinely solid comedy. Most of the gags revolve around Sana getting confused or making a naïve comment because she’s still learning and/or Zouroku’s stubborn nature. While comedic subject matter itself is highly subjective, the show does fairly well in terms of setup and delivery. The jokes are fairly infrequent (I wouldn’t call this a comedy-focused series), but the ones it has are rarely predictable, well-timed, and never overbearing, nor do they get hammered in and outstay their welcome as if viewers are too stupid to “get it” otherwise (that last issue is a particular pet peeve of mine, so well played, AtoZ).\\n\\n\r\n“Don’t stand on the chair!” will go down as a favourite of mine with the context in which it was said.\\n\\n\r\nSo, are these slice of life portions enough to save the show?\\n\\n\r\nEhhhhhh…\\n\\n\r\nLike I said, they may be the more decent parts, but I wouldn’t call them exceptional. The show’s one real strength – its comedy – is sorely underutilized, and about a third of the show still consists mainly of poorly-written and almost entirely failed attempts at drama, action and suspense, so by the time it finally gets comfortable, its integrity is already compromised.\\n\\n\r\nStill, passable is passable, and the show deserves some credit for managing to recover from its extended weak beginnings, albeit having to do so with near-complete abandonment of its original direction. By the end, it just barely manages to find itself, but the two halves and even ideas within each half are a bit disconnected. As for convincing reasons to recommend it, or strong justification for its existence, I’m a bit iffy on both accounts. This is one of those cases where I think the show genuinely improves over its runtime, and the show’s last few episodes were easily its strongest; it just does so by so frequently changing face that it often struggles to have a real face at all. It never quite reaches the point where I’m comfortable saying, “Yes, this is worth watching!” Your mileage may vary.\\n\\n\r\nFirst half: 4/10 – Second half: 6/10 – Overall: 5/10\\n\\n\r\nA large enough portion of Alice to Zouroku’s runtime is spent on its functional fantasy-slice of life antics that there is still some value in the final product, despite it having very weak dramatic writing in the first half. That said, the product as a whole is decidedly lacking in focus and cohesion, ultimately resembling a haphazard hodgepodge of theoretically workable ideas, forced into an oddly-shaped blender that couldn’t properly handle them all. When the resulting pulp gives off a murky, unremarkable appearance, fails to acquire any consistent standout elements, and clutters up what could have been its main draw, I have to question what it really offers over many other series in any of its veins.\\n",
            "date": "2017-06-25T08:44:00+00:00",
            "helpful_count": 44,
            "mal_id": 250985,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450073.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Plasmatize",
                "username": "Plasmatize"
            },
            "url": "https://myanimelist.net/reviews.php?id=250985"
        },
        {
            "content": "Composed with precision, molded in the fashion of its peers, enhanced by the benefits of modern technology, and engineered for mass production, Alice and Zouroku is a meticulously manufactured project at its core. Among the multitude of shows this season that garnered attention early on before dissipating or self-combusting, like flashy fireworks on the 4th of July, Alice and Zouroku possesses the framework to achieve longevity (Don’t be surprised if news of a sequel arrives). With an astonishing 44 minute intro episode, a strangely mystifying opening scene, and an engaging premise (characters known as “Dreams of Alice” can conjure up anything they desire with the“Mirror Gate”), Alice and Zouroku was virtually guaranteed to attract viewers. Any anime can display sparks of potential, as Re:Creators and Eromanga-sensei had before quickly falling out of favor in the public eye. The challenge is to somehow transform the sparks into an electric current, to maintain the hype (if not exceed it), and to craft and grasp a standard of excellence. This, my friends, is what Alice and Zouroku achieved.\\n\\n\r\nA casual observer will most likely give this show a quick once-over, noting the cutesy character designs and simplistic promotional art, before turning away in disgust. However, as the adage goes, there’s more to this show than meets the eye. You see, Alice and Zouroku takes pride in its philosophical edge. Supported by an excellent script and a fascination with orchestral strings (especially in episode 4’s rescue operation), the deeper ideas and implications represented here are simply astounding in its amount of detail. For example, one character, deprived of self-worth, only senses fulfillment in helping and nurturing others (this character is rather deficient in the third level of Maslow’s hierarchy of needs) while another character is a prime example of the Resource Dependence Theory (the more love and support she receives, the more content she is; the less love and support she receives; the less content she is). Alice and Zouroku, above all else, crafts more than a few moral conundrums, appealing to the intellectual in me:\\n\\n\r\nIs it OK to sacrifice individual needs for the good of others?\\n\r\nDo the risks of an endeavor outweigh the rewards or, vice versa?\\n\r\nWould you kill one person to save many?\\n\r\nIs isolating unique traits just as destructive as forcing these traits to assimilate?\\n\r\nIf you flaws are detrimental, should you embrace them or seek to minimize them?\\n\r\nIf special abilities existed, would it be acceptable for a controlled minority to possess them or should all of us have them?\\n\\n\r\nOf course, Alice and Zouroku isn’t entirely intellectual nourishment; much of what constitutes this show is directed towards flaunting its inventive brilliance. Produced by J.C. Staff, which (judging from its involvement in Food Wars and Prison School) is no stranger to innovation, the visuals are unsurprisingly wonderful; the eyecatches, consisting of a spinning Mirror Gate on a blank background, are proof of this. However, it’s the cinematography (stunning establishment shots of the city), subtle stylistic touches (characters can alternate their clothes and hairstyles), and intriguing narrative techniques that truly showcase Alice and Zouroku at its best. There are quite a few narrative techniques in this show, like the occasional genre shift or the homages to Alice and Wonderland, but what really stands out is what occurs in episode 8. Here, the storyline shifts away from the protagonist, introducing a girl named Hatori (she’s a “Dream of Alice” as well as said protagonist), and it presents a fairy tale (“The Evil Witch”) that parallels the events of episode 8 (a story within a story, if you will) before reverting to the original plot halfway through the episode. It is this creativity that shines through in the second half of Alice and Zouroku.\\n\\n\r\nThe waning minutes of episode 5 is when this series adjusts its focus, from drama to slice-of-life, from flashy fight scenes to melodic midnight walks, from tracking devices to stuffed animals. The orchestral strings, once bombastic and frenzied, are smoothed out to project a relaxed, carefree vibe; the occasional accordion solos are quite easygoing in their own right. The show’s sense of humor begins to come into its own, as it’s less reliant on the protagonist to generate laughs (we’ll get to her in a bit) and more geared towards its expertise of the Fish Out of Water concept. The characters’ unawareness of social cues and elements is brilliantly executed (the segment where one character explains what marriage is to another is simply a treat). Yes, Alice and Zouroku can deliver unabashed excellence but it’s the little things, the more refined touches, which make this show worthwhile.\\n\\n\r\nAlice and Zouroku can establish settings as well as anyone, it can provide substantial themes to its storyline, and it can handle pathos like few are able to (the emotional scenes are quite realistic, neither overbearing nor underwhelming). However, expecting this show to construct a respectable cast is out of the question. At best, the characterization is unfulfilled, with hints of depth and dynamics materializing on occasion. Practically everyone you encounter in the show will momentarily stroll into the spotlight, spare a few lines about what constitutes them as a person, perhaps mention a tragic past, conjure up some sort of connection with the main cast before vanishing into the background; this allows the spotlight to illuminate even brighter for the protagonist. Sana is said protagonist and she, to put it lightly, is a handful. Early on, Sana projects the utter arrogance of someone who is fully aware of the unfathomable power she wields. It is this arrogance that generates a multitude of the disasters, both insignificant and catastrophic, in Alice and Zouroku. When Sana encounters a pig puppet, she causes pigs to rain from the sky. When Sana encounters a “Dream of Alice” misusing her abilities, she handles it with all the poise and control of the 10 year old that she pretends to be. When the issues she’s created are resolved, Sana excessively emotes over it, delivering the waterworks and self-pity like an attention-craving prima donna. Really, the only person in this show that’s worth appreciating is the titular character.\\n\\n\r\nThe “Zouroku” in Alice and Zouroku is rather unconventional for a show of this nature. He’s irritable, socially withdrawn, and a habitual smoker to boot. Yet, Zouroku is also the only realistic character you’ll find here. In a show overcompensated with shallow, cutesy idealists, this man comprehends his limitations and shortcomings more than anyone else; in one climatic scene, Zouroku states, “If there’s one thing I know for sure, it’s that nobody in this world is perfect. We lean on each other to get by because there’s some things you can’t do alone, no matter how smart or capable you are.” With an admirable performance from the wildly underrated John Swasey (the star of this show’s dub), Zouroku lords over the cast, dispensing words of wisdom in his realm of dominance (“It’s more important to focus on the people close to you than [to] dream about things that are out of reach”). Sana may be this show’s poster girl, the marketable leading lady, the reason why future viewers will be interested in Alice and Zouroku, but it’s this guy that you’ll remember long after you finish watching.\\n\\n\r\nMore than anything else, Alice and Zouroku was released with the sole intent of achieving popularity, and (seeing that it’s among this season’s most discussed titles) it succeeded. Every character (excluding Zouroku), every song, every awe-inspiring fight, every heartwarming scene was beneficial for its cause. Even the most obvious of its missteps, the laughable CGI, helps in sparking conversations about the show as a whole. Mind you, this strategy isn’t necessarily flawed (in this day and age, eyeballs mean everything) but it reduced this show’s potential. Alice and Zouroku doesn’t do enough to establish its own identity; it never pushes boundaries, never introduces new concepts, and never expands horizons. Alice and Zouroku comprehends the conventional and thrives in it; for that I hold no grudge. I just wish it amounted to more than a solid yet redundant title. Its best moments are understated, like Sanae humming the theme song at one point, and I commend Alice and Zouroku for what it does accomplish. Philosophically, it’s fascinating. Musically, it’s thrilling. Cinematically, it’s enchanting. However, this title is hardly worthy of any admiration or fervor. Alice and Zouroku is a respectable work, as sharp and concise as a staccato rhythm. It is a jack of many trades and master of none; there are areas of this show that fascinate me but, as a whole, Alice and Zouroku leaves much to be desired.\\n\\n\r\n7 raining pigs out of 10",
            "date": "2017-06-25T11:28:00+00:00",
            "helpful_count": 39,
            "mal_id": 251011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4691239.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bmoore07",
                "username": "bmoore07"
            },
            "url": "https://myanimelist.net/reviews.php?id=251011"
        },
        {
            "content": "Dark road, dimly lit up by the street lights. Rain falling down heavily. A small girl in a hospital gown suddenly appears on a camera, just to disappear in a matter of milliseconds after a mysterious object pops up above her head. A group of people desperately try to spot the escapee on one of the monitors. Finally, she stops, feeling tired and almost defeated she continues to move.\r\nShe has been found.\r\nA woman catches up to her, riding on a giant hand coming from the sky. The little girl falls over. She is approached by the woman.\r\nSudden slice from the right. A new user hasappeared. Fight occurs. The little girl escapes into an unknown world, or at least unknown to her.\\n\r\nEnter Zouroku: an old, experiences yet grumpy owner of a flower shop. As he walks into a shop, like every other day, and there he notices a child grabbing food that she didn't pay for. He lectures her, after which she offers him a free wish if he helps her.... Bam! She's gone, nowhere to be seen. Filled with disbelief, he continues with his normal life. As he enters his car, he spots the same girl asking him for the same thing again. And then a giant wrecking ball appears.\\n\r\nZouroku tries to escape but he can't. The child lifts up the car and they begin to drive away. Two other little girls start going after them. A chase commences. A bunch of insane, incomprehensible stuff happens and when all calms down, this one, grumpy old man grabs those magical children and tells them to stop causing havoc. They disperse, except for the girl who was with him before.\\n\r\nUpon hearing her out Zouroku decides to let her live with him, taken by pity and pure compassion for a broken, hurt child, he takes her in, despite seeing what she brings. And so begins a tale of magic, both figuratively and literally.\\n\\n\r\n*Slight spoilers included*\\n\\n\r\n1. The magic of youth and the youth of magic\\n\\n\r\nThe premise of Alice to Zouroku is something that should work perfectly in concept. Think about this for a second: What is magic to you? If I'd ask this of you, I would most likely get those two responses the most:\\n\r\na) A fictional, fantastical power that allows the user to do tricks beyond human comprehension, often performed by street artists through the usage of trickery and illusions\\n\r\nb) A feeling of wonder and amazement, something you'd never believe unless you've seen it with your own eyes, for example, \"this wedding is magical\"\\n\r\nLet's delve a bit deeper into the second one, shall we?\\n\r\nNow, I don't know about you, but I always considered my childhood to be the most magical part of my life. During my younger years all I wanted to do is explore, learn and see new things, every time I saw something amazing I could feel that exact feeling of magic. My first day at school? Magical. First time I saw anime? Absolutely magical. First time I played video games on my own computer? Filled with the essence of what the \"magical\" feeling is. I could go on and on, name my firsts and whatnot. The point is: Childhood is magical. And so is this show.\\n\r\nSana, the little girl with magic abilities and the main heroine, encapsulates both the magic that you can only see in fiction and the feeling of magic every human has felt before. She's not actually human though, she's just a being in a form of a child, however she acts as human, thinks as human, learns as human and feels as a human would. Every time she sees something or learns a new word she asks about it, she's always curious, energetic, ready for new things. Raised in a cut-off, dark place where she had no access to the outside world, each discovery shapes her way of seeing reality. First thing she gets to experience is the cold, hard rain when she attempts to escape. She asks \"is this how the outside is like?\". Her first impressions are clearly negative, but she gets to discover normal human things with Zouroku and his granddaughter, ranging from love, to a hot bath, to the meaning of the word \"mom\". Seeing her learn those things, act like a child really reminds me of that little scrub that I was. It's magical. Combine that with the ability she possesses though, and you got an explosive combination.\\n\r\nSana can do anything. Unlike other people with a similar ability, she has no constraints on her ability other than her vital energy which depletes whenever she uses it. She can summon things into the place she's in or teleport at will, so pretty much whatever she can wants to becomes reality. The things is, she doesn't know what exactly she wants most of the time. Her knowledge on human world is limited. For example, when she teleports, she rarely specifies the exact place, it's more like \"take me away from here\" or \"take me as far away as possible\", which results in her landing in places like the South Pole and being surrounded by penguins. Sometimes it leads to her riding a rocket. Sometimes it ends with her summoning a bunch of pigs. The list goes on.\\n\r\nAs such, this show tackles the idea of giving immense, nearly limitless power to a being with the mentality of a child. Even the adults with that power have something of a child in them, one of them created her power by watching a TV show and the other is overly selfish and ambitious. This topic sounds pretty interesting, doesn't it? Well, it is presented in a pretty peculiar way though.\\n\\n\r\n2. Gray area, or the lack of thereof\\n\\n\r\nAlice to Zouroku presents two different sides in the initial conflict. One of them are the people over at the institute that initially kept Sana and other children trapped in order to use her as an endless energy source. They are ruthless, don't consider Sana to be a human and will proceed to injure and abuse her, all just so they can keep her in the lab. The other side is a secret agency who tries to find the institute and rescue the children inside. They believe that even if Sana isn't human, she can still in a normal society, just like all the other users of \"Alice's Dream\" no matter what ability they possess.\\n\r\nObviously, if there's a way to include those people into society, they should have the right to do so. That's out of question, and the show clearly agrees with this by portraying the latter side as \"the good guys\", and the first as \"the bad guys\".\\n\r\nWait.\\n\r\nYes, what I'm saying is that despite such a big potential for a multidimensional conflict with numerous layers and possibilities for convincing the viewer towards both sides, this show doesn't try to do any of that. There's only black and white, no gray, and it directly tells you which is which. There's pretty much no justification for what the \"evil people\" are doing, they're just greedy and want to create an infinite free energy source, and while this could be framed as something of an ideal, like it's an attempt at helping entire humanity survive or something similar, it's just that simple. Every person from that institute is evil, they have evil, selfish intentions that could be fixed by \"the good guys\" if they gave them a chance. There's no room for any thought, even if you can understand that some have their reasons, they're still wrong. It's a huge waste of potential for sure, there's no doubting that, but...\\n\r\nIf you were to look back at the previous segment of this review, you might be reminded that this show is in fact, all about a child. And how do children see things? They see them as good or bad. That's it. They don't delve deeper into what goes into decision making and instead they simply choose based on what they think is right. If you think about it, it makes sense as to why it's presented this way, but that doesn't change the fact that there was some things that could be explored more, like other characters' point of view on things. I'm not talking about reasons behind their actions, those are touched upon here and there, but what I want is for this show to present some other opinions on the subject. It would be fine if this show was called \"Sana\" or \"Alice\", but it's called \"Alice and Zouroku\", and that old man should have more than enough to say about morality and such. Speaking of...\\n\\n\r\n3. Crooked stuff and why we hate it\\n\\n\r\nZouroku has a very interesting take on reality, on the outside, a very simple one, but definitely fitting for the show and how it's presented. His motto is \"I hate crooked stuff\". It matches his job ethics, as a florist he has to keep everything nice and organized, symmetrical and beautiful, but he applies this to his private life as well. The first time he got a chance to properly talk to Sana, and was offered a free wish, he refused, because he wanted to be on the same page as her rather than having some sort of an advantage above a child. He's a simple man, he has lived his life for far too long to put up with all this in all honesty. He only wishes for everything to have flow that he can follow. That doesn't mean he doesn't have a heart, as he takes Sana in, but it's because he genuinely wants to help this lost girl who lived a horrible life before meeting him.\\n\r\nBy saying all of this in episode one, this show introduces an idea into out head: Leave Sana alone, she has suffered enough, let her have a life, it's time for all of her mental pain to be repaid. Zouroku is supposed to be us, or at least tell us how to think. It's him that introduced this simple mindset. You're supposed to understand why something is crooked, but hate it because it's still crooked, perhaps want to fix it on your own. It's pretty simple, but at the same time rather subtle, I didn't even realize that this is why I missed how simple this show is for the longest of time.\\n\\n\r\n4. Fuzzy is a good feeling\\n\\n\r\nThanks to Zouroku with his strict attitude and Sanae and her genuine love towards her, Sana slowly begins to properly grow as a person. Somewhere towards the middle of the show she is finally able to create a mindset. You might think it's a bit too fast, but she is not really human and her learning abilities prove that she learns much faster than anyone else, but fails to understand words because, well, she's bad at understanding things. She invented a phrase for the feeling when she can't quite understand or comprehend a situation, it's called \"feeling fuzzy\" and she uses it constantly after the first major arc, she's unsure about a lot of things after all. Sana is unable to make decisions for herself, she needs others to do that for her. She wants to do things, but doesn't know how to go about doing them, that's why she's the happiest around Zouroku who thanks to his experience and the ability to spout harsh reality to everyone, helped her numerous times when she was in dire need and when she just craved for some small favors. Not only that, but she's still learning about the world, finding out about new words, understanding the basic principles of a daily life, finding out how to make friends and what other people mean to her, and most importantly, she finally starts to think about something in colors that aren't just black and white.\\n\r\nHer first encounter with something bad after she properly settled down in Zouroku's house is another ability, another \"Alice's Dream\" that seems to have hurt her guardians Zouroku and Sanae. After living such a comfy lifestyle, she shows her weak side and fails to get a full grasp of what's going on. When she finds the person who's responsible for this, she immediately assumes she's a bad person, as she would normally. However, upon learning her story and her reasons for using that power, she starts to understand, which isn't something common for her. It pretty much completes her character as of now, at the point where the show ends, if it will ever continue it would require showcasing more moral problems or add something to her. As we stand now, the plot is technically incomplete, but the show itself pretty much is.\\n\\n\r\n5. Alice in Wonderland\\n\\n\r\nIf you've ever indulged yourself in any form of art, then there's a really high chance that you have heard of a little book called \"Alice's Adventures in Wonderland\", or as we know it, simply \"Alice in Wonderland\". It's a pretty old novel that got adapted into many different mediums, there was an animated Disney movie, there were live action movies, there were many other works inspired by it. It undoubtedly had a huge influence on art, with such an inspiring and expressive world that the Wonderland was, with such amazing, memorable characters like The Mad Hatter and such an intriguing atmosphere it was doomed to become a classic sooner or later. Alice to Zouroku obviously takes away from that, but I think this is where it falls a bit short.\\n\r\nFirst off, the name of the power itself is \"Alice's Dream\", second, the bad people call Sana by the name \"Red Queen\" and third, the place where she was born was named \"Wonderland\". As such, if you know the books, you can quickly get a grasp on what does it mean in one way or another. Sana is the ruler of Wonderland, she was a part of it long before she existed as a being called \"Sana\". Nickname \"Red Queen\", who ruled of Wonderland in the novel, seems fitting, but my problem with all of this is that it's so poorly explored that it hurts.\\n\r\nHaving one of the most legendary and probably one of the best settings as the inspiration of a show led to some amazing results before. Here, Wonderland is just a simple, green land with some simple images that Sana created. You can't even imagine my excitement when I heard that this world is not only going to be based on THE Wonderland, but it will also resemble the mind of an energetic child... but alas it was rather poor in content and mostly just full of randomness. Once again, this technically works, the world is incredibly random after all, but as a visual medium I would expect more, but all of this could probably be explained pretty easily.\\n\\n\r\n6. Technical stuff\\n\\n\r\nThis show looks pretty awful. It has its charm and it keeps close to the original art style, but in motion it all looks clunky and very underwhelming. The character designs work well on their own, but when they move they look very stiff, even in the action scenes. Combine that with the heavy usage of CGI in certain parts, most noticeably in the first episode, where there was an entire chase sequence made entirely using computer effects, alongside such errors as a background moving while the car the characters were in was in fact not. Simply put, it is ugly, unpolished and poor. The directing is basically on par, but it isn't exactly bad. There were a lot of solid shots, but there were quite a few places that weren't properly established, even Kashimura's house where most of the show takes place lacks in that department. With that being said, it's not that surprising that the Wonderland looks like it looks, the people who were responsible for the visuals seemed as if they lacked passion in the first place....\\n\r\nThe sound on the other hand is sincerely very good. You can hear the inspiration from it momentarily, each track has seems to have its own reference to \"Alice in Wonderland\". There are sparkly noises and upbeat, almost fantasy-like tunes being snuck into even the more modern sounding ones that were created for the fights or the scenes in the city. It tells a narrative on its own while keeping in touch with what's going on on the screen, which almost makes up for the low quality visuals. Almost.\\n\\n\r\n7. Personal ramblings AKA Serious Spoiler Section\\n\\n\r\nI'm pretty sure that the thing I like the most about this show is how it treats the idea of adoption and a single parent family. Technically, the lab that Sana was in was almost like an adoption house without the adoption part or the love part. People in there kept her alive, but they didn't care. Once she escapes, she is taken in by a caring father figure who is able to both keep her alive and safe and genuinely care for her. This became especially strong once Zouroku actually adopted Sana, the entire episode was focused on their everyday lives, with Sana blending into society despite her powers and the institute believing that she couldn't, almost like people not believing a child could get adopted, and with her finding things who she never even knew she needed to properly exist, just like a child that's up for adoption since birth. I might be reaching here, but the show does tackle the topic and does so quite nicely.\\n\r\nAnother thing that I found to be interesting and charming is Sana's voice actress, who despite being a somewhat of a fresh name on the market, truly nails the sense of wonder and curiosity. She can even get a bit annoying at times, like a child would, but not to the point where it seriously influences the show's quality.\\n\r\nNow that we're done with the positives, I think the main problem I have here is that the show overall feels uninspired. I touched on this a bit when I mentioned the visuals, but it's not only that. The writing is solid and the themes are presented nicely, but there's a severe lack of direction with where it wants to go in terms of plot. It sort of misses itself in the middle, despite having some important moments. Don't get me wrong, I like the idea of an after story instead of prolonging one arc, but by doing so they had to add some parts of the characters we haven't seen before, creating confusion. Using timeskips usually ends up like this, because you can't tell if they developed it on their own or whether you missed something. There is a pretty clear reason for each storyline, but gluing them together seems to be the problem that really kept it from going anywhere other than just good. But I think being just good is fine, as long as people can build up on it. I surely got something out of this, I got to see more of some themes and developed a better understanding of them. Not only that but it was a good show on its own, so those things make it worth a watch, maybe not memorable initially but if I were ever to see a child character or another theme about what makes a human, this show would certainly come to mind.\\n\r\nAlso, some of you may be on the offense with me defending the show because \"it's about children so it makes sense that it's simple\" (I could even do that for the art style with how it looks like a child drew it) to which I say that you might as well be right, but I think if it can even work, then this show would be the one to make it work. Unfortunately it didn't quite hit the homerun, but it feels as if it paved a way for some other project for the same director or writer in the future. Simplicity should be used more, you would be surprised how well it works with most shows. Just don't mistake simplicity with mindlessness.\\n\\n\r\n8. Overall\\n\\n\r\nAlice & Zouroku is not really a peculiar show, nor is it the most intriguing or special one that I've watched. Hell, even some of the more generic shows that aired the same season felt much cleaner than this did, but that shouldn't undervalue that things that it achieved. Creating a good main character who is also a child certainly wasn't the easiest task, making a plot that diversifies into territories outside of its own setting is commendable and its attempts at tackling its themes worked better than I imagined. The problem is, it feels as if this was always doomed to be some sort of a side project to J.C.Staff, from the animation that shows how tight they were on the schedule, to the rather poor creative vision with its setting designs, it all almost falls apart whenever it build on something. The fact remains though, this show constantly builds on something and just like Sana, it adapts as well as it can, at least I feel like it does with the way it was handled.\\n\r\nSo with that I'd like to recommend it to everybody, maybe it'll miss your mark fairly soon, but I think it has a solid chance to grow if more people pick it up. Don't leave that cute, blonde girl hanging all alone on the cold, dimly lit street and pick it up to see what's this Werty guy is rambling about, and perhaps call him out for giving you false hope later. Who knows?\\n\\n\r\nAs always, this is purely my opinion. I recommend you to develop you own.",
            "date": "2017-06-25T08:56:00+00:00",
            "helpful_count": 35,
            "mal_id": 250986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=250986"
        },
        {
            "content": "In today’s world, we don’t have supernatural abilities. Imagine if we did though…the things we can make history from, the tasks we can accomplish, or change the world altogether. Sure, we have technology but that’s nothing compared to powers that can make anything out of nothing. In the world of Alice to Zouroku, that’s another story. It’s a story where supernatural abilities exist and it all begins one day when we meet the girl named Sana Kashimura.\r\nBased on the manga of the same name, Alice to Zouroku takes an interesting approach at modern fantasy. The first episode shows Sana escaping from a facility and eventually,she encounters Zouroku, a florist with a seemingly mysterious past. We quickly learn that Sana is far from ordinary as she is able to materialize objects out of thin air and perform inhuman feats. The story evolves from here as we learn more about Sana and how she adapts with her new life.\\n\\n\r\nConfession time. A show like this can set off some red flags. I have to admit, the first few episodes could really be a make or break for fans. It’s easily noticeable that the show bounces between supernatural thriller to slice of life drama. This could be a bit distracting at times and even annoying for fans who is interested in a specific genre. In the meantime, Sana is a character that is inevitably the main focus of the show. In terms of character relationships, the most dynamic one is between her and Zouroku. Their relationship feels like daughter and father although it starts off rocky at first. Zouroku wants to get rid of her after realizing that her power can cause havoc in his life. However as time passes, he grows to accept her and even care about Sana’s well-being. It’s also important to note that Zouroku teaches valuable lessons to Sana about being taking responsibility for using her powers and not always be reliant on them. In respect, Sana undergoes changes (both physically and mentally) and even becomes fiercely protective of Zouroku. She also begins to make friends and through them, she understands the world better.\\n\\n\r\nWhen I began watching this show, I often wonder how Sana can make friends with such a powerful ability. Also known as the Alice’s Dream, it’s an ability that she can use to materialize anything by imagination. This god-like power has potential to change the world.  What’s interesting is that Sana still displays the characteristics like a normal girl. She is normal enough to make friends, learn about everyday life, and like most kids, she is very curious about things around her. This extends to where she goes, the people she meets, and how she responds to them. A good portion of this show makes me realize that Sana is very relatable to any kids of her age. It’s through her personality that she is able to make friends with others including former enemies like Hinagiri siblings. At the same time, she is also protective of others that she cares about. When powerful individuals show up later in the show, we can see how Sana expresses her anger when characters like Zouroku and Sanae are put in danger. They are like family to her and she is eager to protect them at all cost.\\n\\n\r\nWhen it comes to visuals, Alice to Zouroku excels at making its modern setting feel real. Whenever fantasy elements are present, the show is able to draw attention to them with impressive aesthetics. However, I do have a mixed feeling about the character designs. It’s not necessary unwatchable but not visually impressive especially with characters like Zouroku who looks just like a plain old man. Furthermore, some of the CGI in early episodes can be very distracting. On the other hand, the producers did a wonderful job at choreography with high tense action sequences. The animation during those scenes are also very clean and showcases character abilities to their fullest. Similarly, I also find the theme songs likable as it has the fantasy feel with its colorfulness.\\n\\n\r\nWhen it comes to soundtrack, this show offers a variety that ranges from intense fighting music, eerie suspense OST, to very lighthearted beats. In the meantime, I am most impressed by the character voice acting of Sana as it’s not always easy to take the role of a child. Beyond that, the show’s music will also draw a mystery feel in later episodes as it will give the impression that the series may be darker than it seems.\\n\\n\r\nDirector Katsushi Sakurabi is no stranger to series with supernatural abilities. Having being involved in previous projects such as Flying Witch and Lostrange Incited WIXOSS, some of his talent is recognizable from this series. Alice to Zouroku blends a variety of genres together to bring a modern fantasy story. With a colorful cast of characters that draws peculiar mystique, I can safely recommend Alice to Zouroku to just about anyone. \\n",
            "date": "2017-06-25T06:57:00+00:00",
            "helpful_count": 15,
            "mal_id": 250980,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=250980"
        },
        {
            "content": "[ May contain very small spoilers for episode 1 ] \r\nAs for the series itself... The idea of young girls with special abilities being experimented on inside of an institute has been used over and over in anime. One such example is Elfen Lied. Despite this cliché, one of the more attractive elements of the series is the main male lead, Zouroku. He is an elderly and brusque man with a strong independency. Despite his perhaps slightly misleading personality, he is a florist. Zouroku has a very good reputation - so much so that even the yakuza pay for his services. \r\nThe relationship between Sana,the lead character, and Zouroku is one that reminds us of a grandfather-granddaughter relationship, which seems perfect for two of them. I believe that Zouroku's unique strength of character will be a huge factor in the enjoyment and hype of this series. His strength lies more within his heart and ideals than his mind or body. I personally found myself wanting to know more about Zouroku than any of the other characters. I think it'll also be interesting to discover how he handles situations in future episodes. \\n\\n\r\nAnother aspect of the series that is very important to me is the character development. Wih what has been released so far, it has already shown very realistic and well-done character development. They show it from the way they move to the way they interact to what they say. This is a major part of enjoying anime for me, and I think the character development by the end of the series will have been amazing. \\n\\n\r\nThe characters and the story seem pretty good, and the voice acting works very well. Also, the music for this anime is very well done (background music, OP, ED etc.) One of the biggest problems I've had with this anime is the animation in episode 1. There are plenty of anime that use CGI. There are even some (such as Seikaisuru Kado) that are made almost entirely with CGI. While the normal animation of the series is okay, the CGI sequences, such as rhe chase scene in episode 1, seem a little clunky and rushed. I was a bit disappointed. I also personally didn't like the animation of the characters' eyes during episode 1, but that aspect quickly grew on me. \\n\\n\r\nAlthough the characters and story are good, and it begins with a great setup, the first episode wasn't as enjoyable as it should've been. It was more average than good. It was definitely enjoyable, but I feel as if it somehow could've been done better. After watching the next few episodes, my opinion changed to a more positive one. However, the first episode does give us a good introduction to the characters and the sides fighting, provides us with a backstory and a feeling of sympathy for the main character, and also demonstrates why this ability of hers is so feared. Their personalities also come through well. It left me with lots of questions that are (thankfully) all answered throughout the course of the series. \\n\\n\r\nI think the series still has yet to blossom a bit more and deepen the relationships and create more experiences between the characters. It looks like it still has a lot more potential.",
            "date": "2017-04-26T14:55:00+00:00",
            "helpful_count": 12,
            "mal_id": 246374,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6112235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kuzuna",
                "username": "Kuzuna"
            },
            "url": "https://myanimelist.net/reviews.php?id=246374"
        },
        {
            "content": "I'm 10 episodes in and I absolutely love this show\r\nStory: 9/10\r\nIt may not be the most original, (at least not initially) but the execution is phenomenal, and it becomes heavily character influenced and Character driven in the later episodes. And since (as I will discuss later) the characters are the pinnacle of this show, having the story shift focus like this does wonders for it. Not only that but the plot and concepts, especially those explored after the first arc are unique and interesting\r\nArt: 8/10\r\nThe animation is a bit weak, especially in the first couple of episodes, but overall art has a unique style toit that complements the series well. The character designs in particular are really good, they're generally realistic and authentic to the characters.\\n\\n\r\nSound: 8/10\\n\r\nReally good, adds well to the show and is really good. I especially like the op song.\\n\\n\r\nCharacter: 10/10\\n\r\nEasily the best part of the show. Authentic, in-depth characters, with excellent character development and exploration. Very realistic characters and character reactions, and responses to situation that are consistent and authentic to there characters and ages. The stand outs being Zouroku and Sana. Especially as we get to really explore her personality in the second main arc, and how she reacts to what's happening to her and how it's influencing her to change. \\n\\n\r\nEnjoyment: 10/10\\n\r\nIncredibly enjoyable in all aspects. Really not much else to say.\\n\\n\\n\r\nOverall: 9/10\\n\r\nI absolutely love this show, and I really wanted to give it a 10/10, but sadly I can at least recognise it's not perfect. An amazing, well put together, incredibly enjoyable show with great characters. It's definitely one of the best shows of the season and certainly the most underrated. It is easily my favourite show of the season, and would definitely recommend it to almost anyone.\\n\\n\\n",
            "date": "2017-06-12T05:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 249745,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Caleb_Kettle",
                "username": "Caleb_Kettle"
            },
            "url": "https://myanimelist.net/reviews.php?id=249745"
        },
        {
            "content": "When I watch an Anime, the most important thing I think of is, \"Am I going to enjoy watching it.\" I watched this Anime and thought, \"Why did they cut out the most interesting part of the whole series?\" \r\nAlice & Zourku isn't a masterpiece, it isn't horrible, it's just a bland anime that you watch if your waiting for your pizza to come, then you eat the pizza while watching this show, and you finish the pizza so you can argue to your dad about not seeing The Emoji Movie. This review is going to describe the Plot, Characters, and the Animation (with atouch of art style).\\n\\n\r\n---This Review will contain SPOILERS, it's not that I want to spoil it because it is required to be described what happens.--- \\n\\n\r\nPlot: Wow! This anime gotten little interesting! You got this girl named Sana, ok? And she escaped from this lab where she lived most of her life in, and she gets chased around by this community because she has powers that no man can ever describe easily. She gets someone to help her and gives her a little advice. She took the advice by going to a big city, and she meets this old dude (Now tell me this, where do you get an old dude that acts like a normal person the entire anime? Ok, back to it), then he meets Sana and says \"I don't give a shit.\" Walks away without a thought of going back. She stalks him around until he finally gives in and decides to take her in. It was very eye opening to watch over these characters, how a event they run into would turn out, and what would happen to the lives of the people involved and most importantly including Sana. But wait.... hold on... 4 episodes, 4 episodes is the actual plot of the story that you want to see, the rest, 8 episodes, is the story that \"you don't give an actual shit about\" story. They executed the most important details away poorly, I thought this community is a secret government control that resents to no one and cover their tracks easily, but instead, the ACTUAL government shuts down the Laboratory due to doing experiments to a girl? What the hell? That doesn't make any sense, are you saying the government weren't aware? Or is it something else that is confusing to understand?. I think the Author of the series thought it would be funny to replace a exciting series into a dumb, stupid slice of life comedy. \"What the hell? If that's all it's going to be about then I'll be on my way.\" Ok, let me explain why I give this a 6 and how it was ok to watch. They show these little plot stories that progresses Alice's lessons about life of the outside world, it gives an explanation of some the characters you hardly knew, and you want to know about what Alice does with the power she has. \\n\\n\r\nI never got what her power does still, she makes things appear how she wants, she performs supernatural abilities, she teleports, and there is probably more that I'm missing because her power is the most confusing ability I've ever seen. The rest of the group have powers you get the gist of in 1 minute. Hers is, \"I'm going to make a giant pancake out of nothing!\" \\n\\n\r\nCharacters: Most of these characters I'm going to forget over a month.\\n\\n\r\nSana: A child who doesn't know how to control her powers.\\n\\n\r\nZouroku: A Grumpy Florist Old Fart who gives a shit and hates Crooked Stuff.\\n\\n\r\nSanea: A air headed boring girl who doesn't do anything but lives with her grandfather.\\n\\n\r\nShizuku: She has superpowered equipment.\\n\\n\r\nOther Characters: Watch the anime, I'm not going keep explain all of them in one sentence.\\n\\n\r\nAnimation: No, this animation isn't special, don't expect an anime to be perfect if it's referencing Alice and Wonderland. Sometimes it runs halfway like a watchable project, then it runs like a 100 episodic series. It has it's flaws I've seen that isn't suppose to happen. It's art style does quite fit with the theme it gives, it's childish, its happy, and it's clean. \\n\\n\r\nConclusion: This anime is a comparison to Usagi Drop, except it doesn't give much interest about the characters because it lays out a simple plan to make one character to be very simple to understand and not try do anything about it. Why did I enjoy this Anime as a 6? It has the atmosphere that you can get into that has a boring ass plot you've seen abunch of times, it's not something you get your hopes up for, but you wouldn't mind watching it. \\n\r\nThe Anime gets a 6/10, no demons involved, sorry morons. \\n\\n",
            "date": "2017-08-17T22:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 255711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6190384.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PapaRonny",
                "username": "PapaRonny"
            },
            "url": "https://myanimelist.net/reviews.php?id=255711"
        },
        {
            "content": "\"This review might contain light spoilers\"\r\nAlice to Zouroku is a heartwarming anime, starting with the premise of a little girl(Sana) with a special power meeting a strict and grumpy old man(Zouroku). this anime is truly a breath of fresh air with a lot of author deciding to ride the fantasy/isekai/harem bandwagon.\r\nStory\r\nAlice to Zouroku tells the story of how a little girl ended up living with the said old man after escaping from a research facility and getting to learn more about the society, which she is clueless to begin with. The old man, Zouroku is just an ordinary old man who could somehow, adapt tosituations very quickly. As the story goes, Sana would of course get her pursuers from the place where she escaped from. Sana is just a kid, the pursuers are also just a kid, so Zouroku here did the very obvious thing as an adult, totally ignoring the special powers and the fact that he is injured himself, he scolded both Sana and the pursuers, hitting them all in the head.\\n\\n\r\nThere would of course be more problems in the future, Sana getting scolded more, more conflicts, the struggle of life, but the first half mostly focuses on Sana learning important things, socialize, and getting to like Zouroku. the way they bond is just cute and heartwarming, there are of course hardships in the way, but learning how to overcome it together, and most of all, realizing that you are not unwanted and not alone, might be one of the strongest part of this anime, you might shed a few tears, but those are worth it.\\n\\n\r\nArt\\n\r\nThe art is very cute, not really that much detailed, and also bright, not literally. The art is pleasant to see, and easy to like, but nothing too spectacular after that.\\n\\n\r\nSound\\n\r\nThe sound might have been one of the strongest part that made me love this anime, both the OP and ED blends with the anime easily, and the OST itself is very strong, especially with the bonding, heartwarming, and tearjerking part, they are beautiful and enhanced the atmosphere greatly, the voice actors did great too.\\n\\n\r\nCharacter\\n\r\nSana's character development is the main focus of the first half of this anime, clueless to begin with, she did everything which deserved a scolding from Zouroku, but scolding's not the only thing she received, as the story goes, Sana began to depend on Zouroku a lot more, absorbing every knowledge Zouroku gives to Sana, learning to apologize where she did wrong, learning to not overuse her powers, and a lot of the basics of life.\\n\r\nZouroku of course, did his part as the one who decided to take her in, he taught her to not depend too much on her powers and started to do things with her own body because at the moment, her body is just too weak and frail. I personally like Zouroku a lot, he's very brave, and he doesn't care if it's a villain or another living being, he'll scold the hell out of it and make things right.\\n\\n\r\nThere are other characters, but they lack development because of the short anime length, this show could've done more if it went to 24 episode, but sadly, it is only 12 episodes long.\\n\\n\r\nEnjoyment\\n\r\nThis might not have been the best anime ever, it lacked episodes, some other characters desperately needed screen times, and the second part of the anime is not as good as the first one, i really enjoyed this anime because i'm a sucker for heartwarming things and bondings, especially the beautiful music in the background, but i can imagine other people not enjoying this as much as i did, because the anime has it's flaws, and it's not easily fixed.\\n\\n\r\nOverall\\n\r\nI personally gave this show a 9/10, while 6-7 is probably the most right choice for this anime, i just couldn't bring myself to give the anime that score, i went with 9 in the end after giving it a deep thought, while some part of the anime is dark, i think it's still a good anime to recommend to a lot of people, that's it for my review, thank you for reading.",
            "date": "2017-06-28T04:32:00+00:00",
            "helpful_count": 8,
            "mal_id": 251306,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3260487.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RageGoria",
                "username": "RageGoria"
            },
            "url": "https://myanimelist.net/reviews.php?id=251306"
        },
        {
            "content": "I enjoyed this one, a facinating series about people with powers, it has some great action moments, followed by some wonderful just family moments.   I liked it.\r\nStory:   It's cute, it comes off as more action packed at the start, but as it progresses it becomes more about just family and these kids with powers.\r\nArt:    The art is nice, especially later on, I can't say much without spoiling, but I liked how creative it got in the last few episodes.\r\nCharacters:  I think this is where it shines, it has a nice cast, each with their own personalities, abit of drama that worked, and some hard moments dealing with things that just worked for me.\\n\\n\r\nEnjoyment and overall:   I liked it, I would recommend it, I say if you want, give it a shot.",
            "date": "2017-06-26T00:24:00+00:00",
            "helpful_count": 8,
            "mal_id": 251067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wolfwing",
                "username": "wolfwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=251067"
        },
        {
            "content": "Starting up Reviews again: my 15th - Alice to Zouroku\r\nWhen I started watching this series I didn't really know what to expect however the more episodes that came out the more I started to enjoy this series. I loved the powers and the whole story of what happens to the people with powers however it lacked a lot of detail. \r\nThe plot of this show...there wasn't really a solid plot, was more of a semi-slice of life anime of a girls everyday life with a new family...with the exception that she just has powers! I couldn't really find a solid plot at all however itstill was a good anime at the end and I still had a lot of enjoyment watching this series. I suppose you could say that there was two plots to this anime: the first focusing on Sana and what she has to do in order to get away from her past and become who she wants to be and the second being of the 'witch'. The second Plot is more of this 'Witch' finding herself when she has gotten lost and Sana comes into play and tries to 'save' this witch from herself. \\n\\n\r\nWhat about the characters? I actually really enjoyed a lot of these characters, they all had unique details of one another and you could see the different personalities of each. I loved the last few episodes when the 'witch' and her friend arrived as it sort of shown more different types of characters within the anime. Sana is the main Protagonist and you can see her development the most as she really has nothing at the beginning, she knows hardly anything however as the story progresses she develops 'oneself' and shows us more of who she is becoming. \\n\\n\r\nThe Animation of this anime was unique and I actually liked it, it was nice and colourful in parts and it wasn't too in your face. Was a nice smooth animation that sort of blended together in frames. The sound was also lovely and very nice throughout the series, it put you on edge when there was something happening and it also calmed you in the nice slow scenes which gave you more feeling throughout. \\n\\n\r\nI really liked this series and would enjoy a second season. I really enjoyed watching this and I loved the different types of characters that was displayed throughout. I really did enjoy the different crazy plots that did come up with what Sana kept doing with her powers. My favourite part was near the end with the 'witch' plot where it shown the anime in a new 'dark-themed' way with what some characters had to go through. \\n\\n\r\nWould recommend this to people that prefer Slice of Life as it is really just a Slice of Life with the added Powers. Would definitely watch this series again.   A lot of the characters can become liked and the story itself can still be good with what happens towards the end of the series. \\n\\n\r\n~ Canaan",
            "date": "2017-07-04T05:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 251911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3403513.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Canaan",
                "username": "Canaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=251911"
        },
        {
            "content": "Alice to Zouroku finished airing after 12 episodes each being 23 minutes long,( apart from the first episode which is around 40 minutes long) but if you deduct the opening and ending there would only be around 21/20 minutes of the actual show. The show was created by Tetsuya Imai and came from J.C Staff studio. In this review, I will make a fair judgment on the show considering the series loyalty to its genre's and my personal opinion on the quality of the show. \r\nFirstly let's revise the genre's that the show relates itself to; Adventure, Mystery, Seinen.\r\nAdventure~ It is undeniable that this showcontains traces of the Adventure genre in its plot. The adventures are related to the main character 'Alice' other known as Sana. She runs away from a research facility and finds herself in a strange world with no knowledge of her surroundings. While wandering from place to place she meets Kashimura, Zouroku an elderly florist with a grumpy but honorable attitude. Sana finds herself in a constant adventure as she learns how to live like a normal girl without using her powers to complete simple everyday tasks. But although the show could be tied to the genre of adventure throughout the entire season, it is undeniable that the real adventure only started from episode 9-12 (in order to avoid spoilers I will not mention much about why in my opinion the real adventure only happens at the climax of the show)\\n\\n\r\nMystery~ Personally I don't see this show as a mystery whatsoever. This show is pretty straightforward and the biggest \"Mystery\" of the show was in the 1/2 episode where Zouroku's occupation was being revealed. If you look at the official poster for the show you can clearly see that the show will have something to do with flowers so it's not a mystery that Zouroku is a florist. So, in my opinion, this genre is not fitting for this show and could mislead people who are searching for a mysterious anime.\\n\\n\r\n Seinen~ For those unfamiliar with this term it means a genre that is aimed primarily at the male, college-aged/young adult. Seinen anime and manga tend to be a little bit more mature than it's counterpart, Shounen, which is aimed at younger boys. I personally find this genre to be the most misleading and misplaced in this shows description. Maybe this was a mistake on the publishers part for adding this genre into a show which is more so aimed at the young female audience with child-like problems and cutesy themes. \\n\\n\r\nAll in all the show gets a 1/3 genre accuracy on its genre choosing which in my opinion is dishonest and unfair towards its viewers.\\n\r\nNext, I will give my ratings for Story, Art, Sound, Character, Enjoyment, and Overall.\\n\\n\r\nStory~ The story itself gets a 4/10 since it isn't anything new in the anime industry and it wasn't shown in a new light. this shows highlights consist of the cuteness of the characters. The story is fairly decent since it revolves around Sana getting used to the world outside of Wonderland but in my opinion, the show had a slow paste and most of the content was unnecessary and could have been made more interesting if there was more going on in each episode. therefore a 4/10 seems like a fair rating in my opinion since the story was not clear and not as enjoyable as initially we are led to believe.\\n\\n\r\nArt~ 5/10, The art in Alice to Zouroku is quite pleasant but not anything spectacular. The art was very simple and followed a very cute pattern with most of the characters having pretty similar facial shapes and features. In the first episodes, the art gets messy and becomes an eyesore when Zouroko and Sana are escaping the twins Hinagiri, Asahi and Hinagiri, Yonaga who came from the same research facility and happened to be Sana's first and only friends at the time. In my opinion, 5/10 is a fair rating for this show being that its highlights consisted of scenes from Wonderland which were rare until the last few episodes.\\n\\n\r\nSound: 5/10. The sound in the show was pleasant also. The opening \"Wonder Drive (ワンダードライブ)\" by ORESAMA was very catchy and colorful which got me hyped for the episode to begin and the ending \"Chant (kotringo edition)\" by toi toy toi was pretty decent also. The voice acting was fair but I found Sana's voice to be a little irritating at times. Most characters have nice voice actors but I can't bring myself to give the show too much praise for its sound due to personally not being impressed with the sound.\\n\\n\r\nCharacter~ 4/10. Most characters were pretty unimpressive and most not getting much screentime even though they showed potential as interesting characters such as Ichijou, Shizuku. Zouroku himself, although the main character, does not get much screentime and not a lot of him is ever revealed. The only character development which was shown to us is between Sana and Ha-chan as she is referred to by her friend. Sana's backstory was pretty quickly revised but I wouldn't say that it wasn't clear. Ha-chan's story was told at the ending with the problems she was having and the truth behind why she seemed so depressed throughout her screentime. apart from these two only one other character was given a solid backstory Tachibana, Miriam C which for the sake of keeping her backstory more effective I will not disclose in this review.\\n\\n\r\nEnjoyment~ My enjoyment of the show comes down to 4/10 due to not being impressed with the show and not really looking forward to each episode as much as I would for other shows. the show was not outstanding with its plot or characters and personally, I just enjoyed the opening and the relationship between Sana and Zouroku.\\n\\n\r\nMy overall score for Alice to Zouroko is 5/10 since it wasn't complete garbage but it was far from a masterpiece. Perhaps it would have been more interesting if the characters were more relatable and if the plot was a little more gripping and explored more. I wouldn't discourage anyone from watching this show and I understand that many may enjoy it and I am in no way bashing your opinion. This anime is not for everyone and that is all you should keep in mind. This series would be a nice watch when you have spare time on your hands that you wouldn't mind spending on this show. I cannot say anything else about this show since I personally won't be rewatching it ever again but I wouldn't say regret watching it.\\n\\n\r\nThat concludes my review for Alice to Zouroku which finished airing Jun 25, 2017",
            "date": "2017-06-26T05:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 251088,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6109952.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnikuGuroshima",
                "username": "AnikuGuroshima"
            },
            "url": "https://myanimelist.net/reviews.php?id=251088"
        },
        {
            "content": "Alice and Zorouku is an anime that I truly like. It's one of the rare animes that fill your heart with warmth , comedy and magic . When you've watched  many animes, your longing for something special.Something that has a new vibe. It reminds me of Jinrui wa suita Shimashita X Usagi Drop X Gakuen Alice but a good original anime on its own. Just watch it. Damn, seeing this anime wrongly valued(with its reviews) as its really is make me sad.\r\n(may contain spoilers)\r\nThe Story:\r\nThe story was great though it had more potential. They could have executed it better. Showing Sana's every day life.\\n\r\nIt could have been more gratifying.  The flow was disoriented and it felt like it was rushing its end. It lacked of familial , friendship and school scenes. It's inclinement after inclinement.\\n\r\nHow I wish it was the nichijouísh kind of anime. More of like Kobayashi-san chi no maid dragon.\\n\r\n(The end was very annoying and infuriating. Showing the old Sana thanking Zouroku. How much lazy can you get?!  I mean you would love to see her grow right? But most of animes leave us with \"hey,just use your imagination\" or \"happy now? we have the ending:nomoreseason2\".)\\n\\n\r\nArt:\\n\r\nThe art is good.As far as I can tell it deviated so much to my expectance of the art(the story should have been more heartwarming as its art). Well, just wait to see the wonderland.\\n\\n\r\nThe characters:\\n\\n\r\nI did not find it to have corny lines as most of feels anime would have. Maybe because of the story and the character development. The lines were so natural and was connected to each other making the characters feel a little bit real. \\n\r\nAs for example how Zouroku replies to Sana when they have a conversation. \\n\r\nOr how Sana throws her tantrums.\\n\r\nIt amplified the characters cuteness, and its heartwarming concept of home.\\n\r\n(though it would have been better if they focused on the homey concept)\\n\\n\r\nSound:\\n\r\nTwo words. \"Original:Nostalgia\"\\n\\n\r\nEnjoyment:\\n\r\nJust fuckin'watch it. Its really fun.\\n\\n\r\nOverall:\\n\r\nWell though it had many downs,but I will be keeping this close in my heart and treasure it as one of the few animes that really made me feel frazzzled.",
            "date": "2017-06-26T02:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 251077,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6345442.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/onoeko",
                "username": "onoeko"
            },
            "url": "https://myanimelist.net/reviews.php?id=251077"
        },
        {
            "content": "I really like Steven Universe, and there are some necessary comparisons that have to be drawn between that show and Alice to Zouroku:\r\nChild with mysterious powers taken in by adoptive parents\r\nNo true villains\r\nComing-of-age portrayal through scenarios of social and emotional discovery, accented but not reliant on fight scenes\r\nOf course, in the details and execution, everything is different about Alice. An \"Alice in Wonderland\" aesthetic drives how the powers work(as you might expect), and while Alice is powerful she is utterly clueless about the world, making her a great foil for Zouroku, a traditional family values parent who is elderly and physically vulnerable, despite his assuringdemeanor. There are government agents and other kids with powers that variously intervene and propel along a larger story, but the plot structuring is loose, and the tone often shifts to warm slice of life character moments without any overt foreshadowing.\\n\\n\r\nIt comes off feeling both well-rounded and unpredictable: a consistent pleasure to watch.",
            "date": "2017-06-04T13:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 249274,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845194.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/triplefox",
                "username": "triplefox"
            },
            "url": "https://myanimelist.net/reviews.php?id=249274"
        },
        {
            "content": "‘Alice and Zouroku’ is the latest of a flurry of recent Seinen series about cute children and adoptive parent figures bonding, in the vein of ‘Usagi Drop’, ‘Barakamon’, and ‘Puco’s Udon World’. Except for the fact that it takes more of a Fantasy route.\r\nThe story involves our main character, Sana, a girl with an ability known as Alice’s Dream; which allows her to materialize anything that she imagines. This ability has kept her and other children with the ability locked inside a government facility until the day that she escapes. From there, she meets an old florist named Zouroku, who agrees to take her inand keep her safe from the government trying to find her.\\n\r\nThe reason the series is called ‘Alice and Zouroku’ despite the main character’s name being Sana is because the story makes use of a lot of allusions to ‘Alice in Wonderland’, certain characters are made as clear reflections of characters from the Lewis Caroll novel, and the premise, as we learn later on, is intended as a sort of subversion to the novel, with our main character’s development being how she goes away from the representation of Wonderland, and finds excitement in ordinary life, from which it is able to mould a ‘Coming of Age’ tale similar to Caroll’s book whilst also cleverly subverting it.\\n\r\nCombining elements of Slice of Life and Fantasy can be a tricky thing, one that could result in the series feeling trapped in an identity crisis. Thankfully, the series is mindful of when to properly use its genre components. The Slice of Life area of the series is where it shines the brightest. The chemistry between our two main characters is a particular delight to watch. Sana, being the young and optimistic (despite her experiences) child dominated by an intensive curiosity for the world around her works well as a comic foil with Zouroku’s gruff, grumpy old man persona. In Sana’s case, her powers offer an unlimited range of comic relief sections which help to make for a nice shake away from the mundane nature of most SOL series. The development between the two is also delightful, as they both learn from each other, Sana reigniting Zouroku’s softer side, while Zouroku helps to teach Sana how to adapt to the new world around her. I also enjoy how despite the story containing some hinted darker elements, they never tried to make that into the focus of the series.\\n\r\nMost of the supporting characters are there to provide either extra Comic relief or lengthy exposition. Zourokus granddaughter Sanae, who takes an instant liking to Sana is cute if a bit naïve. I read that some people found her character annoying but I never did mind her. From the facility are two other Alice’s Dream weavers, twins named Hinagiri, Yonaga and Asahi, or as I like to call them, Tweedle-Dum and Tweedle-Dere, they don’t really do a lot apart from try to capture Sana early on in the series before going through a background development. We also get Naito and Ichijo, two government agents Zouroku gets to help him. Despite often being used as subjects for exposition, they do provide for some entertaining moments, and even make you think a spin-off starring the two of them wouldn’t be a bad idea. Later in the series, we also get introduced to Hatori, a depressed young girl who discovers that she has those powers as well, providing the conflict for the final arc which I won’t get into for spoilers, but her story is still quite gripping, providing the best part of the series.\\n\r\nThe fantasy elements of the series permeate through its production. The Soundtrack attains a nice ambience to it. The OP and ED are also relaxing as hell. Even though none of it is particularly memorable, it does still manage to achieve what it sets out to do. The animation looks fine for the most part. At first, I wasn’t too sure about the blocky, cartoonish character designs in what at first seemed to be a dark series, but as the series settled into its tone and decided what it wanted to be, the more the character designs seemed to fit. Being a fantasy series, it should only be natural that the animation is used to make a wondrous visual display. This is certainly true when we see Alice’s Dream in action, and later on when we see the surreal environment of the representation of Wonderland, we see the series’ strengths really come into play with a myriad of animation styles keeping the environments visually interesting. The first episode did feature some terrible CGI which was so unpleasant to look at that I almost considered dropping the series there, but I kept with the series and I’m glad I did.\\n\r\nSo, with so many positives weighing in favour of the series, ‘Alice to Zouroku’ is one of the best shows the year, right? Well, unfortunately there is a major setback the series has going against it. As I said before the series works best when it embraces its slice of life elements. Additionally, the last arc focusing on Hatori displays the series’ ability to also weave its more fantastical elements to create a dazzling visual treat. I haven’t so far however mentioned the early-middle portion of the series, because that is where the series was at its weakest for me.\\n\r\nThe storyline of Sana trying to hide from the government feels too much like ‘Elfen Lied’ for my taste, and it largely consists of action setpieces involving the character’s powers. These aren’t as exciting as the series seems to think they are, mainly because the unlimited nature of their powers takes away a lot of the suspense. It is my belief that action scenes should have some sort of limitation for the protagonist to overcome, and while a character who can create anything in a fight may sound exciting, it ultimately just feels like a cavalcade of randomness which feels severely lacking in tension. This portion of the story also carries a debate about whether the Alice’s Dream weavers can integrate into human society, but this theme was already examined a lot better in the quieter moments when we actually saw Sana interacting with the ordinary world instead of relying on dull exposition to make us think this.\\n\r\nNot to mention, the arc goes on for a lot longer than it needs to, thanks in large part to these action scenes, which unfortunately takes a lot of the series’ runtime away from the more enjoyable moments. I was relieved when the arc finally did end, and the series got back to focusing on Sana and Zouroku’s everyday misadventures, as well as that final arc which really does accentuate the series’ highest qualities.\\n\r\nWith all that said, ‘Alice and Zouroku’ is still at least worth a watch if you have nothing better to do, or if you’re looking for an alternative Magical Girl series/Slice of Life. Although it could have reached higher heights, I am still ultimately glad that I checked it out, and that is perhaps one of the nicest comments you can give a series.\\n",
            "date": "2017-06-25T10:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 251003,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5740156.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hybrid_Rainbow29",
                "username": "Hybrid_Rainbow29"
            },
            "url": "https://myanimelist.net/reviews.php?id=251003"
        },
        {
            "content": "(No spoilers! I wrote this review for my blog and thought I'd post it here on MAL too.)\r\n“This is the story of a girl who continues to search for ‘herself’ so that she can become a ‘me.’”\r\nSo here we are and instead of joining the hype for titles like Attack on Titan Season 2 and Boku no Hero Academia Season 2, I decided I would try out something a little more my speed. Alice & Zoroku was something that looked cute and wholesome with a touch of action to keep the story from feeling too stagnant. In other words, just the sort of anime Iwas looking for to keep me entertained during hot summer days when I would rather stay cooped up in the A/C then brave the UV rays outside. Although now that I’m at the end I’m finding that it may have been a better idea to join in on some of the more anticipated titles the season had to offer.\\n\\n\r\nAlice & Zoroku was not a bad anime, honestly. The story kept me interested enough to finish out the twelve episodes of the sickeningly sweet main protagonist trying to sort out right from wrong in her strange new home. Sana possesses what is known as a “Dream of Alice” which grants her special powers. She’s not the only one though, and the real meat of the plot is her sorting out just what is okay to use her powers for and what is not, along with another young girl by the name of Hatori (who doesn’t even show up until episode 5). Unfortunately, there were several things that kept me from appreciating everything the show had to offer.\\n\\n\r\nFor one, the main character’s name is not Alice. It’s Sana. This, of course, was not the ultimate thing that caused me to enjoy the show less than I could have, but it irked me throughout the past few months everytime I caught sight of the show on a forum site or in my Crunchyroll queue.\\n\\n\r\nThe second thing that distracted me from what was a potentially wonderful anime was the art. The way the faces were drawn in profile had me giggling from just how ridiculous they looked, with a straight line directly down from the point of the nose through the chin, with the mouth placed comically to the side. Again, nothing too big. I could look past a particular art style I didn’t find all that appealing for the sake of the story.\\n\\n\r\nExcept that the story was nothing that I was expecting either. The first few episodes establish the relationship between Sana, the young female protagonist with otherwordly powers, and Zoroku, a stubborn elderly man who takes on the responsibility of becoming her guardian. When you hear this, you might think, “Oh man, I can’t wait for this girl to get in all sorts of supernatural trouble with a grandpa tagging along for comedic effect,” but that’s hardly what you get. There are minimal scenes where Zoroku interacts with Sana’s powers, but hardly any of them directly relate to the overall plot. As I mentioned before, the real story comes in the interactions between Sana and Hatori, another girl with a Dream of Alice, and how they sort out their own moral conflicts. Out with the old and in with the new, it seems.\\n\\n\r\nOverall I would give this anime a 5/10. It managed to keep itself lighthearted despite handling such heavy topics by keeping the main characters young and innocent and playful, but there was simply too much that took away from the enjoyment of it all. The art was funny looking, the characters not given enough time to develop, and the story focused too much on Zoroku on the beginning only to cast him aside later for the ‘real’ plot, thus leaving the rest of it rushed.",
            "date": "2017-07-23T18:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 253607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5542266.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LilacChild",
                "username": "LilacChild"
            },
            "url": "https://myanimelist.net/reviews.php?id=253607"
        },
        {
            "content": "Story\r\nThe synopsis alone gave me an idea that made me think about Elfen Lied. You know the Government hiding and making experiences in humans with special abilities. However, I knew this one would be much lighter than Elfen Lied was.\r\nThe story is not overly simpleminded but I didn’t enjoy the slow pacing of some episodes who were in my opinion, boring or annoying because of Sana’s childish behaviour.\r\nAlso, I am not happy with how it ended because I think there were plenty of unresolved questions. \r\nArt\r\nThe visuals were quite cute and good. Not something too memorable but still helped to keep my interested in watchingthis series. The characters design were also good, not perfect because I think they were in some cases just too similar to each other.\\n\\n\r\nSound\\n\r\nI am not going to look for the OST. It wasn’t a bad but nothing memorable. The voice actors did a pretty good job. I always admire their job even if the series is not that extraordinary. \\n\\n\r\nCharacter\\n\r\nI am not mentioning all characters because just some of them caught my attention.\\n\r\nMy favourite is Zouroku for a very simple reason: he is not the typical character that sees abnormal things happening around him and just ignores. He was genuine reactions and every time he scolded Sana or any other character I was totally supporting him. \\n\r\nNow, regarding the main character, Sana… I tried really hard to like her but there were some episodes that really ticked me off. I know she is a child and everything is new but in my humble opinion, they (the studio, whoever wrote this) took it too far. There were various moments when I was seriously considering dropping the show just because I couldn’t stand Sana’s attitude or behaviour.\\n\r\nI would like to see more of Ichijo but I guess, besides Zouroku, other characters didn’t really have a chance to show much.\\n\\n\r\nEnjoyment\\n\r\nThis anime has some heart-warming moments, some good action scenes and funny ones but nothing that I will remember in the future. Since everything was rather predictable I am not even going to bother to read the manga or recommend it to anyone.\\n",
            "date": "2017-07-11T14:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 252575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6122118.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnaSilva",
                "username": "AnaSilva"
            },
            "url": "https://myanimelist.net/reviews.php?id=252575"
        },
        {
            "content": "Spoiler free review\r\nI welcome feedback on my reviews\r\nWould you like to become God, or at least, gain the powers of God? The power to create something from nothing. The possibilities are endless when you think about the capabilities this ability has. Anything you ever need to survive is there for the taking, you just need to summon it. Think of all the world problems that could be solved with our very own friendly neighbourhood God. However, with power comes responsibility, as there would be many people that would to try and take advantage of this omnipotence.\r\nAlice & Zouroku is the story of Sana, a labrat who can use the \"Dreams of Alice,\" the ability to create matter. She escapes from the research facility to escape the scientist that want to experiment on her and runs into Zouroku Kashimura, a grumpy old florist that decides to take her in. Now, whoever wrote this story seemed to be unsure where exactly they wanted to take it, as the anime would often switch between a Slice of Life to a Drama. There are shows that can mix these two genres well, but it just didn't work out for A&Z. The Slice of Life element felt like forced cuteness, giving characters an unnatural moe that puts you off the show, while the Drama element is just badly done, with the boring villains, solutions to problems that feel thrown in for the sake of ending arcs quickly, and the unrealistic reactions that characters had during scenes. (Oh, a giant hammer-wielding Santa just appeared out of nowhere, and this girl just disappeared before our very eyes. Is a movie being filmed here?) These reactions just ruined the flow of scenes as you were left trying to figure out why everyone in this anime is so stupid.\\n\\n\r\nThe powers that are portrayed in the anime, named \"Dreams of Alice,\" would allow certain people to create matter. The objects that they could create however were different from character to character. Miriam C Tachibana could create giant arms that did whatever she wanted them to do such as grabbing or crushing objects, while Shizuku Ichijou had access to 666 different techniques and weapons she could bring out at a whim. Sana, however, had won the  Superpower Lottery, which gave her any power she wanted. Along with matter creation, she could also fly, teleport and use telepathy, just to name a few of abilities. The anime does well to explain how everything works and the limitations that they all had, so you're never confused about why a character is able to summon pigs or freeze people.\\n\\n\r\nMost of the characters were pretty likeable, from the childish ones like Sana, Sanae Kashimura, and Yonaga/Asahi Hinagiri, to the more serious ones like Zouroku, Ichijou and Ryuu Naitou. Most of them had their own goals that circled around the \"Dreams of Alice,\" either wanting to look after them or use them for their own selfish purposes. However, there were a few that seemed important but were left unexplored, soon to be forgotten by the anime. What was Kouichi Kitou's goal for wanting to experiment on the \"Dreams of Alice?\" Whatever happened to Cleo after the first arc? You're never really given the bigger picture to how all this started, as it's brushed aside to make room for the next arc.\\n\\n\r\nThe animation was quite nice for this show, although it often threw in some CGI to create the objects the \"Dreams of Alice\" would summon and other stuff like the everyday car. Looking past the 3D animation, the backgrounds that would often be shown were quite stunning, especially during the Wonderland scenes. Nothing else really stood out, as the character designs were pretty normal, (but that fits the setting of the anime so it's to be expected) and the action scenes didn't have any eye-popping visuals.\\n\\n\r\nAlice & Zouroku could have been something great, but it just wasn't able to show it's full potential as it tried to do too many things at once. This can be enjoyable if you're able to look past the issues this anime has, but sadly I can't recommend this incredibly forgettable show. Dream up of something better Alice.",
            "date": "2017-06-25T18:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 251054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6011085.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/EnZanity",
                "username": "EnZanity"
            },
            "url": "https://myanimelist.net/reviews.php?id=251054"
        },
        {
            "content": "I don't know why the other reviews are so low. This is a simple show about Sana Kashimura and her experiences with other people and the world around her. Yes, there is some of the story dedicated to other characters and the powers they have, but it all revolves around Sana. It's cute, it's beautiful, it's entertaining, and I find it highly enjoyable. JC Staff tried making a good anime this time and you can tell from the animation and beautiful detailed artwork. It's much better than their previous works such as Little Busters!\r\nJust watch the show if you want to get a feel forit. I love it, others hate it. It's a nice show and it's easy to follow. Zouroko is funny and Sana is extremely adorable--their relationship is funny and interesting, if a bit predictable.",
            "date": "2017-11-19T16:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 263573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1366087.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Malus92",
                "username": "Malus92"
            },
            "url": "https://myanimelist.net/reviews.php?id=263573"
        },
        {
            "content": "Warning possible Spoilers\r\nAlice in Wonderland is definitely what inspired this to be created because when you have a young blonde girl experiencing some weird stuff you know there's a connection somewhere.\r\nThe story begins with Sana a girl who has a power called Alice's dream which is an ability to create anything she imagines, but she is a test subject and after escaping the lab she encounters and old man called Zouroku the question is will he help her?\r\nNow the story wasn't particularly strong, but it was definitely interesting and kept me interested to the end as the show does start off in a thriller likeway then during the halfway point it becomes more of a slice of life anime then it finishes off with some really weird and deep stuff that did sort of lose me for a second though I enjoyed it all the way through till the end.\\n\r\nIt was interesting seeing Sana experiencing new things since she was always kept locked up and how this affected her view of the world and her own life in general because at some point she really does question whether her existence means anything and whether it will amount to something as she keeps calling herself a monster until the people around her like Zouroku and Sanae say she is who she is which helps her out.\\n\r\nI did like how the story paced out like it went through different arcs as you can tell when the situation changes and there is also the stuff that happened because this anime can get pretty dark at some point and then it can be really weird the next which shows how random this anime was, but this wasn't a bad thing as the characters always made the situation either funny or interesting as they try to figure things out and try to fix it.\\n\r\nIt was also interesting how there were other people who had the same ability as Sana, but had different variants and it was a bit tense seeing how some of these people used their powers because Sana mainly used it to help her, but there were others like Miriam C or Hatori who used their powers for more destructive or personal uses which showed that having powers isn't always a good thing.\\n\r\nThe big problem I have with the story is the fact that the ending felt rushed and a bit anti-climatic as it finishes with an adult Sana monologuing over how well her life has gone thanks to the people who looked after her which shows there isn't going to be a season 2 and the fact that all it took for the situation to be fixed was Zouroku saying \"I've had enough\" which just felt stupid, other than that though the story was alright.\\n\\n\r\nNow the characters were also a reason why the anime was pretty good, but there was certainly some screentime problems for some characters.\\n\r\nSana Kashimura is the female MC and is actually not human since she was born in the dream world and eventually took on a human form, she starts out arrogant and immature until Zouroku made her learn some manners and then helped her how the world worked, over time she does become more mature, but when facing certain situations she can be rash in her decisions and often use's the phrase frazzled when she feels something she doesn't like or confuses her, some people might find her annoying because she does whine a bit, but to me it wasn't dislikeable instead it was more cute really.\\n\r\nZouroku Kashimura is the male MC and he is a florist and owns a florist business, it's rare seeing an older person being a protagonist and he is actually a very likeable person because behind his grumpy exterior he is actually a wise and caring man and makes sure his family is ok, the problem with his character is that he wasn't used that much other than being Sana's guardian I mean you see them connect a bit, but you don't really get to see his character shine outside of those moments with Sana and Zouroku.\\n\r\nSanae Kashimura is Zouroku's granddaughter whose parents died while she was young, she switches from being a mother and sister figure to Sana and she is a really positive and happy person often making sure that Sana is happy, safe and well fed, she also has this weird fixation on stuff that's cute like when Sana was having a sleepover with her friends she wished she had joined in when they were messing around.\\n\r\nYonaga and Asahi Hinagiri are twins who were also test subjects alongside Sana and were her only friends, Asahi is the more adventurous and Yonaga is the more responsible one, but sometimes they swap personalities which makes it difficult to differentiate whose who, when they are freed from being test subjects they become proper friends with Sana and you can see from their interactions that they really care about her since she is like them.\\n\r\nHatori Shikishima and Ayumu Miho are two friends who end up in a difficult situation because of Hatori acquiring powers, Hatori is the more depressed of the two mainly because her parents constantly fight and she thinks that she is a burden to them until Sana helps her realise that her existence isn't meaningless and this helps her become a better person, Ayumu is Hatori's best friend and enjoys playing football, she cares about Hatori's well being and went to great lengths to make sure she wouldn't feel sad anymore which shows the close bond that the two had which at times made it seem like they were more than friends.\\n\r\nShizuku Ichijou is a person who has the same powers as Sana, but is from another organisation that is trying to help people like Sana live a normal life, her tone of voice doesn't really change much though she is definitely a badass that shouldn't be messed because her powers are immense and has saved Sana on multiple occasions and she has even helped teach her a few things too.\\n\\n\r\nThe artstyle was mixed in some areas, I really liked how dream land looked it was full of weird and wonderful things which just made the whole thing feel like a weird drug trip, but there are points where there is CGI that really ruins some scenes like when Sana and Zouroku are trying to get away from the twins and that whole chase scene looked really bad luckily it was the only scene that looked bad while the rest kept up nicely, the design of the characters looked a bit similar to the characters from Mahou Shoujo Madoka★Magica too.\\n\r\nThe soundtrack also surprised me too because I really liked how the music sounded during the dream land scenes as it felt mystic which fitted very nicely with the moment.\\n\\n\r\nDespite there being the mystery genre there were some good bits like Sana's origins which aren't really explained properly which is a little disappointing, but the best part of this aspect is pretty much during the whole dream land sequence with Sana trying to help out Hatori figure out the meaning of her existence and the reason why she existed too.\\n\\n\r\nThere is also some comedy and Slice of Life elements too especially with the interactions between Sana and Zouroku which were just great and funny moments, but the sad thing is they were too far between all the other stuff which is the main weakness of this anime is that is didn't take advantage of the relationship between Sana and Zouroku and just made it a side thing.\\n\\n\r\nOverall this was an interesting, sweet and mysterious anime with a few flaws, but still enjoyable though sadly there won't be a second season which does disappoint me a little since I think Sana still has more to tell in her story and I would have loved more moments between her and Zouroku though sadly that won't happen.",
            "date": "2017-09-06T12:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 257013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=257013"
        }
    ],
    [
        {
            "content": "-- This review contains spoilers. Only read if you have finished the series. --\r\nStory: \r\nThis was an anime that caught my eye from the very beginning. The way it presents itself could be alluring to anybody, yet the story felt as if though it lacked any creative direction. Our main character, who goes by the name Sana, is basically an experiment with luck on her side. After her escape from the depressing facility, as if by fate, she meets and ends up being taken care of by Zouroku. Like most people, Sana cannot escape her past and is forced to go head to head withenemies... and then the second half of the story begins. This is where it essentially fell apart for me. Rather than focusing on what caught everyone's attention to begin with, it lowers itself to carefree almost slice-of-life-like daily events that do not seem significant initially. Another girl somehow magically attains the Dreams of Alice power and the last third of the show basically revolves around her and the birth of her friendship with Sana. This ended up achieving two things: Sana is no longer lonely, and we see a glimpse of the impact the Dreams of Alice has on the world - or at least Japan. However, at what cost did this underwhelming ending have on the show? Let's not forget how the expansion of Wonderland was ceased all at the push of a button, literally. \\n\\n\r\nArt:\\n\r\nIn terms of art, J.C.Staff has done better. With that said, it does portray a sort of childish atmosphere, and I can see why they went with this. I don't recall seeing dips in quality, either. For what it was trying to achieve, I would say it did a good job. \\n\\n\r\nSound: \\n\r\nThe music was different from what we normally hear. Overall, I would describe it as a happy-go-lucky adventure in itself. It mirrored the show, or to be more precise, Sana's personality. \\n\\n\r\nCharacters: \\n\r\nWhen it comes to character development, I doubt there's much \"development\" a child can achieve in a show. But with Sana, we basically start from ground zero. As Zouroku mentions, everything is a first with her. Their relationship together can be seen as a grandfather and his granddaughter, or possibly even a parent and their child. His constant help really emphasizes how little she knows of the world, and throughout the show we end up seeing how she gradually learns. In comparison to the child characters, the adult characters received little screen time. If the show was longer, we could have gotten to know them a bit more. The show mainly focuses on the children, with the exception of Zouroku, and the things they learn throughout this journey. Zouroku himself is an honest man who wants nothing to do with corruption or what isn't deemed as the \"honest life.\" His real granddaughter, Sanae, is painfully just there in the background most of the time. She seems like an airhead, but in reality she's just always cheery - much like Sana is. \\n\\n\r\nIn the end, there wasn't much to the story and characters as I thought there would be. If the show was expanded into more seasons, then I could understand. Unfortunately, it looks like they decided to give it its own ending. The final scene with grown-up Sana seemed rather cryptic as the fog that surrounded her and flowers she held immediately made me think she was at a graveyard, which possibly hints that Zouroku died about a decade later.\\n\\n\r\nTo me, the whole show seemed like a waste of a decent plot. Nothing was really achieved on a grand scale. The exception would be the Dreams of Alice being spread to other people, but we never really got to see more into that other than it happened. But who knows. Maybe that's not what the show was going for. Maybe it was just a story about a girl who desperately wanted a happy ending. \\n\\n\r\nFinal score: 4/10.",
            "date": "2017-06-25T10:10:00+00:00",
            "helpful_count": 64,
            "mal_id": 250996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3498079.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Zelev",
                "username": "Zelev"
            },
            "url": "https://myanimelist.net/reviews.php?id=250996"
        },
        {
            "content": "Most of us have at one point questioned our own existence. After all, knowing our reason for being can be among our most valuable assets. We desire meaning from our lives, so pondering questions like “who am I, really?” and “what is my purpose?” is only natural.\r\nI bring this up not to go into some deep, pretentious analysis of this topic within the show, though there is some material there. Rather, I bring this up because Alice to Zouroku could have really benefited from taking a good, long look at itself in the mirror and seriously asking these questions.\r\nHereafter referred to as “AtoZ”, Alice toZouroku seems to face a bit of an existential crisis. The issue here is twofold: one pertaining to its focus as a whole - in other words, what it is - and the other to its appeal or value to viewers; its purpose for existing in the first place.\\n\\n\r\nGenre-wise, AtoZ mainly functions in two sharply-contrasting halves. One half of it (technically closer to two-thirds) is mainly slice of life with some interesting fantasy elements incorporated, while the other is more focused on action and drama. It does eventually stick to the former, but much of its runtime is spent stubbornly refusing to commit to one or the other, which comes at the detriment of both halves not being as well-realized as they could have been.\\n\\n\r\nThis kind of balancing of vastly different genres isn’t the easiest thing to pull off, but here is one area where I’ll give AtoZ credit. While its choice to hedge its bets does limit its greater potential, the show actually does an okay job selling the shift between them. The show spends long enough between genre shifts (usually a full episode or two) to allow its desired tone to properly settle in. This means that when it’s in slice of life mode, it actually manages to feel like slice of life, as opposed to just “down time” between action set pieces. Meanwhile, the more dramatic points still feel like more than just diversions. The series manages better than most to have two personalities at once; one for exciting times and one for laid-back moments.\\n\\n\r\nEven with only a 12-episode lifespan to work with, I’m glad it at least managed to explore the slice of life portion to a satisfactory degree, because that half is actually quite decent. The dramatic elements, on the other hand… well, to put it bluntly, they kind of suck. I’ll get back to that.\\n\\n\r\nUnfortunately, for AtoZ, contrasting genres isn’t the real issue here. A more notable issue is a lack of any substantial standout qualities – something to make it appealing over any other story of its type, particularly with how many of its wildly varied ideas are commonly seen in other series. Pretty much every individual element – every idea and its exploration - in AtoZ ranges from decent enough to outright bad, and none of it comes together to create something greater.\\n\\n\r\nStarting with the presentation, how are the visuals? They’re okay, I suppose. Color-wise? It’s fine. Character designs? They’re distinct-ish. Animation? Average to stiff. Level of detail? Not bad. Character expressions? Functional, but nothing more. There’s plenty of CGI, but it isn’t integrated very well into 2D scenes. There’s also an extended action sequence featuring some full 3D shots, and while it is decently dynamic, it simply doesn’t look that great (and that’s not even counting one hilarious animation error involving a moving background outside the parked car). What about the rest of the action? It’s nothing special. There’s no impressive choreography or impact, nor much emotional buildup, and little to no tension (as I’ll expand on later). There’s one exception that was actually solid, but the action as a whole isn’t much of a selling point.\\n\\n\r\nSo if the visuals can’t impress, then what about the sound? Well, the voice work is competent (subbed; haven’t seen the English dub), including vocal expression and delivery, but it’s not outstanding. Sound design? It works, I guess. Music? Actually, the soundtrack, while not that memorable in its own right, is often quite evocative in context, and I quite like the opening and ending themes. But does a modestly above-average OST do enough to make otherwise mediocre presentation great? It does not.\\n\\n\r\n“But so what?” one might ask. After all, almost every aspect I’ve listed so far, while typically unremarkable, is still acceptable, including the show’s handling of multiple genres. At the end of the day, the presentation is nothing ruinous, and it doesn’t have to be great if there’s strength of substance being presented.\\n\\n\r\nSadly, this is where the show runs into a serious fundamental problem: AtoZ, at least during its non-slice of life moments, is straight-up poorly-written. Those dramatic elements I mentioned earlier are seriously squandered by persistently low quality of writing.\\n\\n\r\nThe series tries very hard during these dramatic scenes especially to keep things flexible and varied. On one hand, the show poses all sorts of questions about Sana, her existence, the facility she escapes from, and several characters, among other things. The show leverages these questions and finds a degree of success here in initially hooking viewers. Alright, seems fine so far.\\n\\n\r\nBut on the other hand, there are all the different powers that Sana possesses, and they pose a real problem: they’re too powerful. Their versatility is taken way too far to give the show any hope of telling a compelling dramatic story; creating matter to summon pretty much anything, mind-reading, flying, manipulating objects, teleporting with some control over the destination, and that’s just from episode 1. Later points introduce some other equally if not more broken powers. Sana can pretty much do whatever the plot demands, and that includes pulling new abilities out of thin air whenever convenient. Normally, the established powers are already enough to prevent the main characters getting into truly tight situations, but even in rare exceptions, Sana possesses so many convenient powers that there’s usually nothing stopping the series from just coming up with a new way out for her or others on the spot.\\n\\n\r\nThe only semblance of a limitation on Sana’s powers is her current energy level, which in practice ends up almost a non-issue for her. When it does come up, it can easily be fixed as soon as Sana gets a hold of some food. How does the series compensate? Simple: make Sana conveniently not have eaten enough since last using her powers.\\n\\n\r\nThis lack of sufficient limitations also creates all sorts of loopholes that quickly result in things falling apart. For instance, why can’t Sana just teleport out of every problem? The show only bothers to contrive an excuse about half of the time, usually something to do with food again, and even those aren’t always very well conveyed or thought out. Any other time, it’s like everyone just outright forgets. That’s a real tension-killer, and it’s far from the only tension-killer this series falls victim to.\\n\\n\r\nThere are other writing issues present, which include plot holes, other loopholes, inconsistencies, contrivances and so on that bring the whole thing down anytime it attempts something dramatic. I’m going to get into some plot/event spoilers for the first 5 episodes here to go over some of them; scroll past to skip them. Now, I want to be fair to this show, so only things I feel have at least a noticeable effect on either the show’s integrity or the viewer’s experience are included.\\n\\n\r\nWith that said, let’s begin!\\n\\n\r\n*****SPOILERS FOR EPISODES 1-5*****\\n\r\n*********************************\\n\r\n*********************************\\n\\n\r\n- The show tries to make Sana’s recapture seem like a huge threat, but her teleportation ability undermines this. Even if, somehow, she gets kidnapped, attempts to rescue her fail, AND she gets taken back to the lab… so what? As soon as she isn’t actively being pinned down, unable to use her powers (and they have to let her use her powers eventually or they can’t do tests with them), she could just teleport away! That is, assuming she isn’t “conveniently” too low on energy at the time for that to happen, but this was only the case on her initial escape. There’s just not enough sense of finality or decisiveness to the threat of Sana’s capture, which only serves to dampen the suspense even more than it already was.\\n\\n\r\n- Furthermore, Sana gets a tracking device put on her for safety before her kidnapping in episode 3. Setting aside the fact that this leads to even less tension, even Sana’s successful capture would just serve to easily reveal where she and the research lab are located. And the show tries really hard to make this whole sequence dramatic. It doesn’t work.\\n\\n\r\n- Episode 1&2: Sana, while a few normal pancakes away from fainting, was easily able to teleport both herself and Sanae to many random places in quick succession. This includes Antarctica, tens of thousands of miles away, and then she brings back a swarm of pigs along with them. This only serves to make the brokenness of her teleportation more obvious, while seemingly contradicting the “conservation of energy” rule established. (Apparently all those pigs combined have less energy value than a few normal pancakes.)\\n\\n\r\n- Episode 1: in the car chase, there was no apparent reason why Sana and Zouroku couldn’t just teleport themselves away and use Sana’s powers to replace the car on the other end. She had enough energy to easily lift the entire car, drive it around, and detach her opponents’ giant chain - a quick short-distance teleport at least to a nearby hiding place should have been no trouble. But nope, got to keep the poorly-rendered car chase going!\\n\\n\r\n- During the kidnap in episodes 3-5, instead of using her powers to teleport Zouroku to her, Sana could have just teleported away herself. Clearly neither a lack of energy nor her being pinned down was preventing her from using her powers, seeing as she manages to summon Zouroku, heal herself completely and then literally rewrite her situation mere minutes later to get rid of the hands pinning her down, all with no extra food. (And as mentioned before, this whole time we know Sana has a tracking device on her, so everyone is obviously going to have no trouble getting to her. The lack of tension continues!) At least the sequence led to some decent, if rather forced, character development.\\n\\n\r\n- Sana can instantly and easily look into anyone’s head and find out everything about them and their background, including what their relatives are doing (episode 1; she finds out about Zouroku’s granddaughter). This makes the mysteries surrounding who characters are, the facility she came from, where that facility is, what their motives are, and who Sana herself is, become completely trivial matters. Sana should have figured all this stuff out, either while she was at the lab or after her escape, but the issue is never brought up.\\n\\n\r\n- This anime’s plays for sympathy typically fall flat. The lab just does vaguely (very vaguely) “horrible things” to its subjects for energy experiments for which we’re given no context as to why they should ever have involve horrible things, because they’re the show’s generic evil organization figure which exists for the sake of weak drama and making us feel sorry for Sana. Minnie C immediately blows her clichéd “dead partner” backstory in an attempt to make her a sympathetic villain, except that we don’t even know her enough to feel any kind of attachment or sympathy. But hey, got to have an excuse to make her a menacing and villainous woman who is mean to children and shoots one in the leg without remorse to stop her from acting out of line.\\n\\n\r\n- On that note, Sana getting shot in the leg by Minnie C is probably the show’s most egregious example of a failed sympathy card. “*gasp* NO! SHE SHOT THE CHILD!” the audience cries, only for it to barely matter 2 minutes later because it was instantly healed with Sana’s usual overpowered magic abilities while she simultaneously rewrites her situation so she isn’t even pinned down. Really? Neither one of these abilities was established beforehand, and 2 minutes later it’s like Sana forgets she ever got shot, with no effect on her personality or outlook. All that came out of it was brief shock value and another excuse for Sana to have low energy and require a delicious Snickers® bar to later recharge. It just ends up feeling like cheap plays for emotions because this poor, poor child is captured and pinned and scared and wetting herself and is in pain for a few moments. All this, while we know she’ll just be rescued shortly because of the tracking device. It’s overblown, ineffective in context, and too shamelessly manipulative. Yes, drama is technically manipulative by nature, but this show makes its manipulation mechanisms way too obvious to the viewer to be effective. It’s clear when the show is just playing for cheap sympathy points, and in many cases, it comes across as desperate.\\n\\n\r\nAtoZ’s dramatic elements aim for flexibility, but ends up creating loopholes and relying on half-assed excuses. It tries to create suspense, and mostly fails because of said loopholes. When it goes for sympathetic, shocking or dark elements, they feel cheap, and there are overall hardly any successful dramatic scenes. As a whole, the quality of writing just isn’t up to standards, and at times, it gets plain annoying.\\n\\n\r\n*********************************\\n\r\n*********************************\\n\r\n*********END OF SPOILERS**********\\n\\n\r\nBut with all those issues out of the way, is Alice to Zouroku an irredeemable show? Well, maybe not.\\n\\n\r\nThere’s a certain major development and shift that comes up in the middle of the series, almost out of nowhere. Some might call that another instance of poor writing. I’m going to call it a miracle, because it kicks of the “second half” of the story, where, at last, the series actually focuses on one thing! No more poorly-written pseudo-dramatic nonsense; just slice of life albeit more whimsical than average with some wonderland-fantasy elements. And the show definitely benefited from this transition, going from something I generally disliked to at least finding passable for the rest of it.\\n\\n\r\nDespite all of the writing problems present in the dramatic portions of the show, the slice of life components fare significantly better. When the series opts to focus on the more down-to-earth relationship between Sana, Zouroku and Sanae, most of the writing issues don’t apply. Granted, the occasional questionable element still pops up; these are mainly smaller details like Sana using her energy-demanding powers to fly because she’s supposedly too tired to walk, or her saying she hadn’t eaten in 3 days even though she clearly ate a rice ball earlier that afternoon, but none of it is stuff that cripples the antics as a whole; at worst, it might affect a brief interaction that is quickly moved on from.\\n\\n\r\nAs for the antics themselves, they’re not going to blow anyone away, but they do offer a few decisive strengths.\\n\\n\r\nWhile the supporting characters of Alice to Zouroku are straightforward and unremarkable, the chemistry among the main duo is actually fairly strong. Zouroku’s staunch no-nonsense attitude makes him stand out from your typical guardian-figure lead. For Sana, whenever she’s not reduced to a plot device (something thankfully exclusive to the dramatic elements), watching her try to understand the world around her can be interesting.\\n\\n\r\nUltimately, though, it’s the way these attitudes contrast and bounce off each other that make things endearing, and it also leads to the occasional bit of genuinely solid comedy. Most of the gags revolve around Sana getting confused or making a naïve comment because she’s still learning and/or Zouroku’s stubborn nature. While comedic subject matter itself is highly subjective, the show does fairly well in terms of setup and delivery. The jokes are fairly infrequent (I wouldn’t call this a comedy-focused series), but the ones it has are rarely predictable, well-timed, and never overbearing, nor do they get hammered in and outstay their welcome as if viewers are too stupid to “get it” otherwise (that last issue is a particular pet peeve of mine, so well played, AtoZ).\\n\\n\r\n“Don’t stand on the chair!” will go down as a favourite of mine with the context in which it was said.\\n\\n\r\nSo, are these slice of life portions enough to save the show?\\n\\n\r\nEhhhhhh…\\n\\n\r\nLike I said, they may be the more decent parts, but I wouldn’t call them exceptional. The show’s one real strength – its comedy – is sorely underutilized, and about a third of the show still consists mainly of poorly-written and almost entirely failed attempts at drama, action and suspense, so by the time it finally gets comfortable, its integrity is already compromised.\\n\\n\r\nStill, passable is passable, and the show deserves some credit for managing to recover from its extended weak beginnings, albeit having to do so with near-complete abandonment of its original direction. By the end, it just barely manages to find itself, but the two halves and even ideas within each half are a bit disconnected. As for convincing reasons to recommend it, or strong justification for its existence, I’m a bit iffy on both accounts. This is one of those cases where I think the show genuinely improves over its runtime, and the show’s last few episodes were easily its strongest; it just does so by so frequently changing face that it often struggles to have a real face at all. It never quite reaches the point where I’m comfortable saying, “Yes, this is worth watching!” Your mileage may vary.\\n\\n\r\nFirst half: 4/10 – Second half: 6/10 – Overall: 5/10\\n\\n\r\nA large enough portion of Alice to Zouroku’s runtime is spent on its functional fantasy-slice of life antics that there is still some value in the final product, despite it having very weak dramatic writing in the first half. That said, the product as a whole is decidedly lacking in focus and cohesion, ultimately resembling a haphazard hodgepodge of theoretically workable ideas, forced into an oddly-shaped blender that couldn’t properly handle them all. When the resulting pulp gives off a murky, unremarkable appearance, fails to acquire any consistent standout elements, and clutters up what could have been its main draw, I have to question what it really offers over many other series in any of its veins.\\n",
            "date": "2017-06-25T08:44:00+00:00",
            "helpful_count": 44,
            "mal_id": 250985,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450073.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Plasmatize",
                "username": "Plasmatize"
            },
            "url": "https://myanimelist.net/reviews.php?id=250985"
        },
        {
            "content": "Composed with precision, molded in the fashion of its peers, enhanced by the benefits of modern technology, and engineered for mass production, Alice and Zouroku is a meticulously manufactured project at its core. Among the multitude of shows this season that garnered attention early on before dissipating or self-combusting, like flashy fireworks on the 4th of July, Alice and Zouroku possesses the framework to achieve longevity (Don’t be surprised if news of a sequel arrives). With an astonishing 44 minute intro episode, a strangely mystifying opening scene, and an engaging premise (characters known as “Dreams of Alice” can conjure up anything they desire with the“Mirror Gate”), Alice and Zouroku was virtually guaranteed to attract viewers. Any anime can display sparks of potential, as Re:Creators and Eromanga-sensei had before quickly falling out of favor in the public eye. The challenge is to somehow transform the sparks into an electric current, to maintain the hype (if not exceed it), and to craft and grasp a standard of excellence. This, my friends, is what Alice and Zouroku achieved.\\n\\n\r\nA casual observer will most likely give this show a quick once-over, noting the cutesy character designs and simplistic promotional art, before turning away in disgust. However, as the adage goes, there’s more to this show than meets the eye. You see, Alice and Zouroku takes pride in its philosophical edge. Supported by an excellent script and a fascination with orchestral strings (especially in episode 4’s rescue operation), the deeper ideas and implications represented here are simply astounding in its amount of detail. For example, one character, deprived of self-worth, only senses fulfillment in helping and nurturing others (this character is rather deficient in the third level of Maslow’s hierarchy of needs) while another character is a prime example of the Resource Dependence Theory (the more love and support she receives, the more content she is; the less love and support she receives; the less content she is). Alice and Zouroku, above all else, crafts more than a few moral conundrums, appealing to the intellectual in me:\\n\\n\r\nIs it OK to sacrifice individual needs for the good of others?\\n\r\nDo the risks of an endeavor outweigh the rewards or, vice versa?\\n\r\nWould you kill one person to save many?\\n\r\nIs isolating unique traits just as destructive as forcing these traits to assimilate?\\n\r\nIf you flaws are detrimental, should you embrace them or seek to minimize them?\\n\r\nIf special abilities existed, would it be acceptable for a controlled minority to possess them or should all of us have them?\\n\\n\r\nOf course, Alice and Zouroku isn’t entirely intellectual nourishment; much of what constitutes this show is directed towards flaunting its inventive brilliance. Produced by J.C. Staff, which (judging from its involvement in Food Wars and Prison School) is no stranger to innovation, the visuals are unsurprisingly wonderful; the eyecatches, consisting of a spinning Mirror Gate on a blank background, are proof of this. However, it’s the cinematography (stunning establishment shots of the city), subtle stylistic touches (characters can alternate their clothes and hairstyles), and intriguing narrative techniques that truly showcase Alice and Zouroku at its best. There are quite a few narrative techniques in this show, like the occasional genre shift or the homages to Alice and Wonderland, but what really stands out is what occurs in episode 8. Here, the storyline shifts away from the protagonist, introducing a girl named Hatori (she’s a “Dream of Alice” as well as said protagonist), and it presents a fairy tale (“The Evil Witch”) that parallels the events of episode 8 (a story within a story, if you will) before reverting to the original plot halfway through the episode. It is this creativity that shines through in the second half of Alice and Zouroku.\\n\\n\r\nThe waning minutes of episode 5 is when this series adjusts its focus, from drama to slice-of-life, from flashy fight scenes to melodic midnight walks, from tracking devices to stuffed animals. The orchestral strings, once bombastic and frenzied, are smoothed out to project a relaxed, carefree vibe; the occasional accordion solos are quite easygoing in their own right. The show’s sense of humor begins to come into its own, as it’s less reliant on the protagonist to generate laughs (we’ll get to her in a bit) and more geared towards its expertise of the Fish Out of Water concept. The characters’ unawareness of social cues and elements is brilliantly executed (the segment where one character explains what marriage is to another is simply a treat). Yes, Alice and Zouroku can deliver unabashed excellence but it’s the little things, the more refined touches, which make this show worthwhile.\\n\\n\r\nAlice and Zouroku can establish settings as well as anyone, it can provide substantial themes to its storyline, and it can handle pathos like few are able to (the emotional scenes are quite realistic, neither overbearing nor underwhelming). However, expecting this show to construct a respectable cast is out of the question. At best, the characterization is unfulfilled, with hints of depth and dynamics materializing on occasion. Practically everyone you encounter in the show will momentarily stroll into the spotlight, spare a few lines about what constitutes them as a person, perhaps mention a tragic past, conjure up some sort of connection with the main cast before vanishing into the background; this allows the spotlight to illuminate even brighter for the protagonist. Sana is said protagonist and she, to put it lightly, is a handful. Early on, Sana projects the utter arrogance of someone who is fully aware of the unfathomable power she wields. It is this arrogance that generates a multitude of the disasters, both insignificant and catastrophic, in Alice and Zouroku. When Sana encounters a pig puppet, she causes pigs to rain from the sky. When Sana encounters a “Dream of Alice” misusing her abilities, she handles it with all the poise and control of the 10 year old that she pretends to be. When the issues she’s created are resolved, Sana excessively emotes over it, delivering the waterworks and self-pity like an attention-craving prima donna. Really, the only person in this show that’s worth appreciating is the titular character.\\n\\n\r\nThe “Zouroku” in Alice and Zouroku is rather unconventional for a show of this nature. He’s irritable, socially withdrawn, and a habitual smoker to boot. Yet, Zouroku is also the only realistic character you’ll find here. In a show overcompensated with shallow, cutesy idealists, this man comprehends his limitations and shortcomings more than anyone else; in one climatic scene, Zouroku states, “If there’s one thing I know for sure, it’s that nobody in this world is perfect. We lean on each other to get by because there’s some things you can’t do alone, no matter how smart or capable you are.” With an admirable performance from the wildly underrated John Swasey (the star of this show’s dub), Zouroku lords over the cast, dispensing words of wisdom in his realm of dominance (“It’s more important to focus on the people close to you than [to] dream about things that are out of reach”). Sana may be this show’s poster girl, the marketable leading lady, the reason why future viewers will be interested in Alice and Zouroku, but it’s this guy that you’ll remember long after you finish watching.\\n\\n\r\nMore than anything else, Alice and Zouroku was released with the sole intent of achieving popularity, and (seeing that it’s among this season’s most discussed titles) it succeeded. Every character (excluding Zouroku), every song, every awe-inspiring fight, every heartwarming scene was beneficial for its cause. Even the most obvious of its missteps, the laughable CGI, helps in sparking conversations about the show as a whole. Mind you, this strategy isn’t necessarily flawed (in this day and age, eyeballs mean everything) but it reduced this show’s potential. Alice and Zouroku doesn’t do enough to establish its own identity; it never pushes boundaries, never introduces new concepts, and never expands horizons. Alice and Zouroku comprehends the conventional and thrives in it; for that I hold no grudge. I just wish it amounted to more than a solid yet redundant title. Its best moments are understated, like Sanae humming the theme song at one point, and I commend Alice and Zouroku for what it does accomplish. Philosophically, it’s fascinating. Musically, it’s thrilling. Cinematically, it’s enchanting. However, this title is hardly worthy of any admiration or fervor. Alice and Zouroku is a respectable work, as sharp and concise as a staccato rhythm. It is a jack of many trades and master of none; there are areas of this show that fascinate me but, as a whole, Alice and Zouroku leaves much to be desired.\\n\\n\r\n7 raining pigs out of 10",
            "date": "2017-06-25T11:28:00+00:00",
            "helpful_count": 39,
            "mal_id": 251011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4691239.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bmoore07",
                "username": "bmoore07"
            },
            "url": "https://myanimelist.net/reviews.php?id=251011"
        },
        {
            "content": "Dark road, dimly lit up by the street lights. Rain falling down heavily. A small girl in a hospital gown suddenly appears on a camera, just to disappear in a matter of milliseconds after a mysterious object pops up above her head. A group of people desperately try to spot the escapee on one of the monitors. Finally, she stops, feeling tired and almost defeated she continues to move.\r\nShe has been found.\r\nA woman catches up to her, riding on a giant hand coming from the sky. The little girl falls over. She is approached by the woman.\r\nSudden slice from the right. A new user hasappeared. Fight occurs. The little girl escapes into an unknown world, or at least unknown to her.\\n\r\nEnter Zouroku: an old, experiences yet grumpy owner of a flower shop. As he walks into a shop, like every other day, and there he notices a child grabbing food that she didn't pay for. He lectures her, after which she offers him a free wish if he helps her.... Bam! She's gone, nowhere to be seen. Filled with disbelief, he continues with his normal life. As he enters his car, he spots the same girl asking him for the same thing again. And then a giant wrecking ball appears.\\n\r\nZouroku tries to escape but he can't. The child lifts up the car and they begin to drive away. Two other little girls start going after them. A chase commences. A bunch of insane, incomprehensible stuff happens and when all calms down, this one, grumpy old man grabs those magical children and tells them to stop causing havoc. They disperse, except for the girl who was with him before.\\n\r\nUpon hearing her out Zouroku decides to let her live with him, taken by pity and pure compassion for a broken, hurt child, he takes her in, despite seeing what she brings. And so begins a tale of magic, both figuratively and literally.\\n\\n\r\n*Slight spoilers included*\\n\\n\r\n1. The magic of youth and the youth of magic\\n\\n\r\nThe premise of Alice to Zouroku is something that should work perfectly in concept. Think about this for a second: What is magic to you? If I'd ask this of you, I would most likely get those two responses the most:\\n\r\na) A fictional, fantastical power that allows the user to do tricks beyond human comprehension, often performed by street artists through the usage of trickery and illusions\\n\r\nb) A feeling of wonder and amazement, something you'd never believe unless you've seen it with your own eyes, for example, \"this wedding is magical\"\\n\r\nLet's delve a bit deeper into the second one, shall we?\\n\r\nNow, I don't know about you, but I always considered my childhood to be the most magical part of my life. During my younger years all I wanted to do is explore, learn and see new things, every time I saw something amazing I could feel that exact feeling of magic. My first day at school? Magical. First time I saw anime? Absolutely magical. First time I played video games on my own computer? Filled with the essence of what the \"magical\" feeling is. I could go on and on, name my firsts and whatnot. The point is: Childhood is magical. And so is this show.\\n\r\nSana, the little girl with magic abilities and the main heroine, encapsulates both the magic that you can only see in fiction and the feeling of magic every human has felt before. She's not actually human though, she's just a being in a form of a child, however she acts as human, thinks as human, learns as human and feels as a human would. Every time she sees something or learns a new word she asks about it, she's always curious, energetic, ready for new things. Raised in a cut-off, dark place where she had no access to the outside world, each discovery shapes her way of seeing reality. First thing she gets to experience is the cold, hard rain when she attempts to escape. She asks \"is this how the outside is like?\". Her first impressions are clearly negative, but she gets to discover normal human things with Zouroku and his granddaughter, ranging from love, to a hot bath, to the meaning of the word \"mom\". Seeing her learn those things, act like a child really reminds me of that little scrub that I was. It's magical. Combine that with the ability she possesses though, and you got an explosive combination.\\n\r\nSana can do anything. Unlike other people with a similar ability, she has no constraints on her ability other than her vital energy which depletes whenever she uses it. She can summon things into the place she's in or teleport at will, so pretty much whatever she can wants to becomes reality. The things is, she doesn't know what exactly she wants most of the time. Her knowledge on human world is limited. For example, when she teleports, she rarely specifies the exact place, it's more like \"take me away from here\" or \"take me as far away as possible\", which results in her landing in places like the South Pole and being surrounded by penguins. Sometimes it leads to her riding a rocket. Sometimes it ends with her summoning a bunch of pigs. The list goes on.\\n\r\nAs such, this show tackles the idea of giving immense, nearly limitless power to a being with the mentality of a child. Even the adults with that power have something of a child in them, one of them created her power by watching a TV show and the other is overly selfish and ambitious. This topic sounds pretty interesting, doesn't it? Well, it is presented in a pretty peculiar way though.\\n\\n\r\n2. Gray area, or the lack of thereof\\n\\n\r\nAlice to Zouroku presents two different sides in the initial conflict. One of them are the people over at the institute that initially kept Sana and other children trapped in order to use her as an endless energy source. They are ruthless, don't consider Sana to be a human and will proceed to injure and abuse her, all just so they can keep her in the lab. The other side is a secret agency who tries to find the institute and rescue the children inside. They believe that even if Sana isn't human, she can still in a normal society, just like all the other users of \"Alice's Dream\" no matter what ability they possess.\\n\r\nObviously, if there's a way to include those people into society, they should have the right to do so. That's out of question, and the show clearly agrees with this by portraying the latter side as \"the good guys\", and the first as \"the bad guys\".\\n\r\nWait.\\n\r\nYes, what I'm saying is that despite such a big potential for a multidimensional conflict with numerous layers and possibilities for convincing the viewer towards both sides, this show doesn't try to do any of that. There's only black and white, no gray, and it directly tells you which is which. There's pretty much no justification for what the \"evil people\" are doing, they're just greedy and want to create an infinite free energy source, and while this could be framed as something of an ideal, like it's an attempt at helping entire humanity survive or something similar, it's just that simple. Every person from that institute is evil, they have evil, selfish intentions that could be fixed by \"the good guys\" if they gave them a chance. There's no room for any thought, even if you can understand that some have their reasons, they're still wrong. It's a huge waste of potential for sure, there's no doubting that, but...\\n\r\nIf you were to look back at the previous segment of this review, you might be reminded that this show is in fact, all about a child. And how do children see things? They see them as good or bad. That's it. They don't delve deeper into what goes into decision making and instead they simply choose based on what they think is right. If you think about it, it makes sense as to why it's presented this way, but that doesn't change the fact that there was some things that could be explored more, like other characters' point of view on things. I'm not talking about reasons behind their actions, those are touched upon here and there, but what I want is for this show to present some other opinions on the subject. It would be fine if this show was called \"Sana\" or \"Alice\", but it's called \"Alice and Zouroku\", and that old man should have more than enough to say about morality and such. Speaking of...\\n\\n\r\n3. Crooked stuff and why we hate it\\n\\n\r\nZouroku has a very interesting take on reality, on the outside, a very simple one, but definitely fitting for the show and how it's presented. His motto is \"I hate crooked stuff\". It matches his job ethics, as a florist he has to keep everything nice and organized, symmetrical and beautiful, but he applies this to his private life as well. The first time he got a chance to properly talk to Sana, and was offered a free wish, he refused, because he wanted to be on the same page as her rather than having some sort of an advantage above a child. He's a simple man, he has lived his life for far too long to put up with all this in all honesty. He only wishes for everything to have flow that he can follow. That doesn't mean he doesn't have a heart, as he takes Sana in, but it's because he genuinely wants to help this lost girl who lived a horrible life before meeting him.\\n\r\nBy saying all of this in episode one, this show introduces an idea into out head: Leave Sana alone, she has suffered enough, let her have a life, it's time for all of her mental pain to be repaid. Zouroku is supposed to be us, or at least tell us how to think. It's him that introduced this simple mindset. You're supposed to understand why something is crooked, but hate it because it's still crooked, perhaps want to fix it on your own. It's pretty simple, but at the same time rather subtle, I didn't even realize that this is why I missed how simple this show is for the longest of time.\\n\\n\r\n4. Fuzzy is a good feeling\\n\\n\r\nThanks to Zouroku with his strict attitude and Sanae and her genuine love towards her, Sana slowly begins to properly grow as a person. Somewhere towards the middle of the show she is finally able to create a mindset. You might think it's a bit too fast, but she is not really human and her learning abilities prove that she learns much faster than anyone else, but fails to understand words because, well, she's bad at understanding things. She invented a phrase for the feeling when she can't quite understand or comprehend a situation, it's called \"feeling fuzzy\" and she uses it constantly after the first major arc, she's unsure about a lot of things after all. Sana is unable to make decisions for herself, she needs others to do that for her. She wants to do things, but doesn't know how to go about doing them, that's why she's the happiest around Zouroku who thanks to his experience and the ability to spout harsh reality to everyone, helped her numerous times when she was in dire need and when she just craved for some small favors. Not only that, but she's still learning about the world, finding out about new words, understanding the basic principles of a daily life, finding out how to make friends and what other people mean to her, and most importantly, she finally starts to think about something in colors that aren't just black and white.\\n\r\nHer first encounter with something bad after she properly settled down in Zouroku's house is another ability, another \"Alice's Dream\" that seems to have hurt her guardians Zouroku and Sanae. After living such a comfy lifestyle, she shows her weak side and fails to get a full grasp of what's going on. When she finds the person who's responsible for this, she immediately assumes she's a bad person, as she would normally. However, upon learning her story and her reasons for using that power, she starts to understand, which isn't something common for her. It pretty much completes her character as of now, at the point where the show ends, if it will ever continue it would require showcasing more moral problems or add something to her. As we stand now, the plot is technically incomplete, but the show itself pretty much is.\\n\\n\r\n5. Alice in Wonderland\\n\\n\r\nIf you've ever indulged yourself in any form of art, then there's a really high chance that you have heard of a little book called \"Alice's Adventures in Wonderland\", or as we know it, simply \"Alice in Wonderland\". It's a pretty old novel that got adapted into many different mediums, there was an animated Disney movie, there were live action movies, there were many other works inspired by it. It undoubtedly had a huge influence on art, with such an inspiring and expressive world that the Wonderland was, with such amazing, memorable characters like The Mad Hatter and such an intriguing atmosphere it was doomed to become a classic sooner or later. Alice to Zouroku obviously takes away from that, but I think this is where it falls a bit short.\\n\r\nFirst off, the name of the power itself is \"Alice's Dream\", second, the bad people call Sana by the name \"Red Queen\" and third, the place where she was born was named \"Wonderland\". As such, if you know the books, you can quickly get a grasp on what does it mean in one way or another. Sana is the ruler of Wonderland, she was a part of it long before she existed as a being called \"Sana\". Nickname \"Red Queen\", who ruled of Wonderland in the novel, seems fitting, but my problem with all of this is that it's so poorly explored that it hurts.\\n\r\nHaving one of the most legendary and probably one of the best settings as the inspiration of a show led to some amazing results before. Here, Wonderland is just a simple, green land with some simple images that Sana created. You can't even imagine my excitement when I heard that this world is not only going to be based on THE Wonderland, but it will also resemble the mind of an energetic child... but alas it was rather poor in content and mostly just full of randomness. Once again, this technically works, the world is incredibly random after all, but as a visual medium I would expect more, but all of this could probably be explained pretty easily.\\n\\n\r\n6. Technical stuff\\n\\n\r\nThis show looks pretty awful. It has its charm and it keeps close to the original art style, but in motion it all looks clunky and very underwhelming. The character designs work well on their own, but when they move they look very stiff, even in the action scenes. Combine that with the heavy usage of CGI in certain parts, most noticeably in the first episode, where there was an entire chase sequence made entirely using computer effects, alongside such errors as a background moving while the car the characters were in was in fact not. Simply put, it is ugly, unpolished and poor. The directing is basically on par, but it isn't exactly bad. There were a lot of solid shots, but there were quite a few places that weren't properly established, even Kashimura's house where most of the show takes place lacks in that department. With that being said, it's not that surprising that the Wonderland looks like it looks, the people who were responsible for the visuals seemed as if they lacked passion in the first place....\\n\r\nThe sound on the other hand is sincerely very good. You can hear the inspiration from it momentarily, each track has seems to have its own reference to \"Alice in Wonderland\". There are sparkly noises and upbeat, almost fantasy-like tunes being snuck into even the more modern sounding ones that were created for the fights or the scenes in the city. It tells a narrative on its own while keeping in touch with what's going on on the screen, which almost makes up for the low quality visuals. Almost.\\n\\n\r\n7. Personal ramblings AKA Serious Spoiler Section\\n\\n\r\nI'm pretty sure that the thing I like the most about this show is how it treats the idea of adoption and a single parent family. Technically, the lab that Sana was in was almost like an adoption house without the adoption part or the love part. People in there kept her alive, but they didn't care. Once she escapes, she is taken in by a caring father figure who is able to both keep her alive and safe and genuinely care for her. This became especially strong once Zouroku actually adopted Sana, the entire episode was focused on their everyday lives, with Sana blending into society despite her powers and the institute believing that she couldn't, almost like people not believing a child could get adopted, and with her finding things who she never even knew she needed to properly exist, just like a child that's up for adoption since birth. I might be reaching here, but the show does tackle the topic and does so quite nicely.\\n\r\nAnother thing that I found to be interesting and charming is Sana's voice actress, who despite being a somewhat of a fresh name on the market, truly nails the sense of wonder and curiosity. She can even get a bit annoying at times, like a child would, but not to the point where it seriously influences the show's quality.\\n\r\nNow that we're done with the positives, I think the main problem I have here is that the show overall feels uninspired. I touched on this a bit when I mentioned the visuals, but it's not only that. The writing is solid and the themes are presented nicely, but there's a severe lack of direction with where it wants to go in terms of plot. It sort of misses itself in the middle, despite having some important moments. Don't get me wrong, I like the idea of an after story instead of prolonging one arc, but by doing so they had to add some parts of the characters we haven't seen before, creating confusion. Using timeskips usually ends up like this, because you can't tell if they developed it on their own or whether you missed something. There is a pretty clear reason for each storyline, but gluing them together seems to be the problem that really kept it from going anywhere other than just good. But I think being just good is fine, as long as people can build up on it. I surely got something out of this, I got to see more of some themes and developed a better understanding of them. Not only that but it was a good show on its own, so those things make it worth a watch, maybe not memorable initially but if I were ever to see a child character or another theme about what makes a human, this show would certainly come to mind.\\n\r\nAlso, some of you may be on the offense with me defending the show because \"it's about children so it makes sense that it's simple\" (I could even do that for the art style with how it looks like a child drew it) to which I say that you might as well be right, but I think if it can even work, then this show would be the one to make it work. Unfortunately it didn't quite hit the homerun, but it feels as if it paved a way for some other project for the same director or writer in the future. Simplicity should be used more, you would be surprised how well it works with most shows. Just don't mistake simplicity with mindlessness.\\n\\n\r\n8. Overall\\n\\n\r\nAlice & Zouroku is not really a peculiar show, nor is it the most intriguing or special one that I've watched. Hell, even some of the more generic shows that aired the same season felt much cleaner than this did, but that shouldn't undervalue that things that it achieved. Creating a good main character who is also a child certainly wasn't the easiest task, making a plot that diversifies into territories outside of its own setting is commendable and its attempts at tackling its themes worked better than I imagined. The problem is, it feels as if this was always doomed to be some sort of a side project to J.C.Staff, from the animation that shows how tight they were on the schedule, to the rather poor creative vision with its setting designs, it all almost falls apart whenever it build on something. The fact remains though, this show constantly builds on something and just like Sana, it adapts as well as it can, at least I feel like it does with the way it was handled.\\n\r\nSo with that I'd like to recommend it to everybody, maybe it'll miss your mark fairly soon, but I think it has a solid chance to grow if more people pick it up. Don't leave that cute, blonde girl hanging all alone on the cold, dimly lit street and pick it up to see what's this Werty guy is rambling about, and perhaps call him out for giving you false hope later. Who knows?\\n\\n\r\nAs always, this is purely my opinion. I recommend you to develop you own.",
            "date": "2017-06-25T08:56:00+00:00",
            "helpful_count": 35,
            "mal_id": 250986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=250986"
        },
        {
            "content": "In today’s world, we don’t have supernatural abilities. Imagine if we did though…the things we can make history from, the tasks we can accomplish, or change the world altogether. Sure, we have technology but that’s nothing compared to powers that can make anything out of nothing. In the world of Alice to Zouroku, that’s another story. It’s a story where supernatural abilities exist and it all begins one day when we meet the girl named Sana Kashimura.\r\nBased on the manga of the same name, Alice to Zouroku takes an interesting approach at modern fantasy. The first episode shows Sana escaping from a facility and eventually,she encounters Zouroku, a florist with a seemingly mysterious past. We quickly learn that Sana is far from ordinary as she is able to materialize objects out of thin air and perform inhuman feats. The story evolves from here as we learn more about Sana and how she adapts with her new life.\\n\\n\r\nConfession time. A show like this can set off some red flags. I have to admit, the first few episodes could really be a make or break for fans. It’s easily noticeable that the show bounces between supernatural thriller to slice of life drama. This could be a bit distracting at times and even annoying for fans who is interested in a specific genre. In the meantime, Sana is a character that is inevitably the main focus of the show. In terms of character relationships, the most dynamic one is between her and Zouroku. Their relationship feels like daughter and father although it starts off rocky at first. Zouroku wants to get rid of her after realizing that her power can cause havoc in his life. However as time passes, he grows to accept her and even care about Sana’s well-being. It’s also important to note that Zouroku teaches valuable lessons to Sana about being taking responsibility for using her powers and not always be reliant on them. In respect, Sana undergoes changes (both physically and mentally) and even becomes fiercely protective of Zouroku. She also begins to make friends and through them, she understands the world better.\\n\\n\r\nWhen I began watching this show, I often wonder how Sana can make friends with such a powerful ability. Also known as the Alice’s Dream, it’s an ability that she can use to materialize anything by imagination. This god-like power has potential to change the world.  What’s interesting is that Sana still displays the characteristics like a normal girl. She is normal enough to make friends, learn about everyday life, and like most kids, she is very curious about things around her. This extends to where she goes, the people she meets, and how she responds to them. A good portion of this show makes me realize that Sana is very relatable to any kids of her age. It’s through her personality that she is able to make friends with others including former enemies like Hinagiri siblings. At the same time, she is also protective of others that she cares about. When powerful individuals show up later in the show, we can see how Sana expresses her anger when characters like Zouroku and Sanae are put in danger. They are like family to her and she is eager to protect them at all cost.\\n\\n\r\nWhen it comes to visuals, Alice to Zouroku excels at making its modern setting feel real. Whenever fantasy elements are present, the show is able to draw attention to them with impressive aesthetics. However, I do have a mixed feeling about the character designs. It’s not necessary unwatchable but not visually impressive especially with characters like Zouroku who looks just like a plain old man. Furthermore, some of the CGI in early episodes can be very distracting. On the other hand, the producers did a wonderful job at choreography with high tense action sequences. The animation during those scenes are also very clean and showcases character abilities to their fullest. Similarly, I also find the theme songs likable as it has the fantasy feel with its colorfulness.\\n\\n\r\nWhen it comes to soundtrack, this show offers a variety that ranges from intense fighting music, eerie suspense OST, to very lighthearted beats. In the meantime, I am most impressed by the character voice acting of Sana as it’s not always easy to take the role of a child. Beyond that, the show’s music will also draw a mystery feel in later episodes as it will give the impression that the series may be darker than it seems.\\n\\n\r\nDirector Katsushi Sakurabi is no stranger to series with supernatural abilities. Having being involved in previous projects such as Flying Witch and Lostrange Incited WIXOSS, some of his talent is recognizable from this series. Alice to Zouroku blends a variety of genres together to bring a modern fantasy story. With a colorful cast of characters that draws peculiar mystique, I can safely recommend Alice to Zouroku to just about anyone. \\n",
            "date": "2017-06-25T06:57:00+00:00",
            "helpful_count": 15,
            "mal_id": 250980,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=250980"
        },
        {
            "content": "[ May contain very small spoilers for episode 1 ] \r\nAs for the series itself... The idea of young girls with special abilities being experimented on inside of an institute has been used over and over in anime. One such example is Elfen Lied. Despite this cliché, one of the more attractive elements of the series is the main male lead, Zouroku. He is an elderly and brusque man with a strong independency. Despite his perhaps slightly misleading personality, he is a florist. Zouroku has a very good reputation - so much so that even the yakuza pay for his services. \r\nThe relationship between Sana,the lead character, and Zouroku is one that reminds us of a grandfather-granddaughter relationship, which seems perfect for two of them. I believe that Zouroku's unique strength of character will be a huge factor in the enjoyment and hype of this series. His strength lies more within his heart and ideals than his mind or body. I personally found myself wanting to know more about Zouroku than any of the other characters. I think it'll also be interesting to discover how he handles situations in future episodes. \\n\\n\r\nAnother aspect of the series that is very important to me is the character development. Wih what has been released so far, it has already shown very realistic and well-done character development. They show it from the way they move to the way they interact to what they say. This is a major part of enjoying anime for me, and I think the character development by the end of the series will have been amazing. \\n\\n\r\nThe characters and the story seem pretty good, and the voice acting works very well. Also, the music for this anime is very well done (background music, OP, ED etc.) One of the biggest problems I've had with this anime is the animation in episode 1. There are plenty of anime that use CGI. There are even some (such as Seikaisuru Kado) that are made almost entirely with CGI. While the normal animation of the series is okay, the CGI sequences, such as rhe chase scene in episode 1, seem a little clunky and rushed. I was a bit disappointed. I also personally didn't like the animation of the characters' eyes during episode 1, but that aspect quickly grew on me. \\n\\n\r\nAlthough the characters and story are good, and it begins with a great setup, the first episode wasn't as enjoyable as it should've been. It was more average than good. It was definitely enjoyable, but I feel as if it somehow could've been done better. After watching the next few episodes, my opinion changed to a more positive one. However, the first episode does give us a good introduction to the characters and the sides fighting, provides us with a backstory and a feeling of sympathy for the main character, and also demonstrates why this ability of hers is so feared. Their personalities also come through well. It left me with lots of questions that are (thankfully) all answered throughout the course of the series. \\n\\n\r\nI think the series still has yet to blossom a bit more and deepen the relationships and create more experiences between the characters. It looks like it still has a lot more potential.",
            "date": "2017-04-26T14:55:00+00:00",
            "helpful_count": 12,
            "mal_id": 246374,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6112235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kuzuna",
                "username": "Kuzuna"
            },
            "url": "https://myanimelist.net/reviews.php?id=246374"
        },
        {
            "content": "I'm 10 episodes in and I absolutely love this show\r\nStory: 9/10\r\nIt may not be the most original, (at least not initially) but the execution is phenomenal, and it becomes heavily character influenced and Character driven in the later episodes. And since (as I will discuss later) the characters are the pinnacle of this show, having the story shift focus like this does wonders for it. Not only that but the plot and concepts, especially those explored after the first arc are unique and interesting\r\nArt: 8/10\r\nThe animation is a bit weak, especially in the first couple of episodes, but overall art has a unique style toit that complements the series well. The character designs in particular are really good, they're generally realistic and authentic to the characters.\\n\\n\r\nSound: 8/10\\n\r\nReally good, adds well to the show and is really good. I especially like the op song.\\n\\n\r\nCharacter: 10/10\\n\r\nEasily the best part of the show. Authentic, in-depth characters, with excellent character development and exploration. Very realistic characters and character reactions, and responses to situation that are consistent and authentic to there characters and ages. The stand outs being Zouroku and Sana. Especially as we get to really explore her personality in the second main arc, and how she reacts to what's happening to her and how it's influencing her to change. \\n\\n\r\nEnjoyment: 10/10\\n\r\nIncredibly enjoyable in all aspects. Really not much else to say.\\n\\n\\n\r\nOverall: 9/10\\n\r\nI absolutely love this show, and I really wanted to give it a 10/10, but sadly I can at least recognise it's not perfect. An amazing, well put together, incredibly enjoyable show with great characters. It's definitely one of the best shows of the season and certainly the most underrated. It is easily my favourite show of the season, and would definitely recommend it to almost anyone.\\n\\n\\n",
            "date": "2017-06-12T05:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 249745,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Caleb_Kettle",
                "username": "Caleb_Kettle"
            },
            "url": "https://myanimelist.net/reviews.php?id=249745"
        },
        {
            "content": "When I watch an Anime, the most important thing I think of is, \"Am I going to enjoy watching it.\" I watched this Anime and thought, \"Why did they cut out the most interesting part of the whole series?\" \r\nAlice & Zourku isn't a masterpiece, it isn't horrible, it's just a bland anime that you watch if your waiting for your pizza to come, then you eat the pizza while watching this show, and you finish the pizza so you can argue to your dad about not seeing The Emoji Movie. This review is going to describe the Plot, Characters, and the Animation (with atouch of art style).\\n\\n\r\n---This Review will contain SPOILERS, it's not that I want to spoil it because it is required to be described what happens.--- \\n\\n\r\nPlot: Wow! This anime gotten little interesting! You got this girl named Sana, ok? And she escaped from this lab where she lived most of her life in, and she gets chased around by this community because she has powers that no man can ever describe easily. She gets someone to help her and gives her a little advice. She took the advice by going to a big city, and she meets this old dude (Now tell me this, where do you get an old dude that acts like a normal person the entire anime? Ok, back to it), then he meets Sana and says \"I don't give a shit.\" Walks away without a thought of going back. She stalks him around until he finally gives in and decides to take her in. It was very eye opening to watch over these characters, how a event they run into would turn out, and what would happen to the lives of the people involved and most importantly including Sana. But wait.... hold on... 4 episodes, 4 episodes is the actual plot of the story that you want to see, the rest, 8 episodes, is the story that \"you don't give an actual shit about\" story. They executed the most important details away poorly, I thought this community is a secret government control that resents to no one and cover their tracks easily, but instead, the ACTUAL government shuts down the Laboratory due to doing experiments to a girl? What the hell? That doesn't make any sense, are you saying the government weren't aware? Or is it something else that is confusing to understand?. I think the Author of the series thought it would be funny to replace a exciting series into a dumb, stupid slice of life comedy. \"What the hell? If that's all it's going to be about then I'll be on my way.\" Ok, let me explain why I give this a 6 and how it was ok to watch. They show these little plot stories that progresses Alice's lessons about life of the outside world, it gives an explanation of some the characters you hardly knew, and you want to know about what Alice does with the power she has. \\n\\n\r\nI never got what her power does still, she makes things appear how she wants, she performs supernatural abilities, she teleports, and there is probably more that I'm missing because her power is the most confusing ability I've ever seen. The rest of the group have powers you get the gist of in 1 minute. Hers is, \"I'm going to make a giant pancake out of nothing!\" \\n\\n\r\nCharacters: Most of these characters I'm going to forget over a month.\\n\\n\r\nSana: A child who doesn't know how to control her powers.\\n\\n\r\nZouroku: A Grumpy Florist Old Fart who gives a shit and hates Crooked Stuff.\\n\\n\r\nSanea: A air headed boring girl who doesn't do anything but lives with her grandfather.\\n\\n\r\nShizuku: She has superpowered equipment.\\n\\n\r\nOther Characters: Watch the anime, I'm not going keep explain all of them in one sentence.\\n\\n\r\nAnimation: No, this animation isn't special, don't expect an anime to be perfect if it's referencing Alice and Wonderland. Sometimes it runs halfway like a watchable project, then it runs like a 100 episodic series. It has it's flaws I've seen that isn't suppose to happen. It's art style does quite fit with the theme it gives, it's childish, its happy, and it's clean. \\n\\n\r\nConclusion: This anime is a comparison to Usagi Drop, except it doesn't give much interest about the characters because it lays out a simple plan to make one character to be very simple to understand and not try do anything about it. Why did I enjoy this Anime as a 6? It has the atmosphere that you can get into that has a boring ass plot you've seen abunch of times, it's not something you get your hopes up for, but you wouldn't mind watching it. \\n\r\nThe Anime gets a 6/10, no demons involved, sorry morons. \\n\\n",
            "date": "2017-08-17T22:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 255711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6190384.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PapaRonny",
                "username": "PapaRonny"
            },
            "url": "https://myanimelist.net/reviews.php?id=255711"
        },
        {
            "content": "\"This review might contain light spoilers\"\r\nAlice to Zouroku is a heartwarming anime, starting with the premise of a little girl(Sana) with a special power meeting a strict and grumpy old man(Zouroku). this anime is truly a breath of fresh air with a lot of author deciding to ride the fantasy/isekai/harem bandwagon.\r\nStory\r\nAlice to Zouroku tells the story of how a little girl ended up living with the said old man after escaping from a research facility and getting to learn more about the society, which she is clueless to begin with. The old man, Zouroku is just an ordinary old man who could somehow, adapt tosituations very quickly. As the story goes, Sana would of course get her pursuers from the place where she escaped from. Sana is just a kid, the pursuers are also just a kid, so Zouroku here did the very obvious thing as an adult, totally ignoring the special powers and the fact that he is injured himself, he scolded both Sana and the pursuers, hitting them all in the head.\\n\\n\r\nThere would of course be more problems in the future, Sana getting scolded more, more conflicts, the struggle of life, but the first half mostly focuses on Sana learning important things, socialize, and getting to like Zouroku. the way they bond is just cute and heartwarming, there are of course hardships in the way, but learning how to overcome it together, and most of all, realizing that you are not unwanted and not alone, might be one of the strongest part of this anime, you might shed a few tears, but those are worth it.\\n\\n\r\nArt\\n\r\nThe art is very cute, not really that much detailed, and also bright, not literally. The art is pleasant to see, and easy to like, but nothing too spectacular after that.\\n\\n\r\nSound\\n\r\nThe sound might have been one of the strongest part that made me love this anime, both the OP and ED blends with the anime easily, and the OST itself is very strong, especially with the bonding, heartwarming, and tearjerking part, they are beautiful and enhanced the atmosphere greatly, the voice actors did great too.\\n\\n\r\nCharacter\\n\r\nSana's character development is the main focus of the first half of this anime, clueless to begin with, she did everything which deserved a scolding from Zouroku, but scolding's not the only thing she received, as the story goes, Sana began to depend on Zouroku a lot more, absorbing every knowledge Zouroku gives to Sana, learning to apologize where she did wrong, learning to not overuse her powers, and a lot of the basics of life.\\n\r\nZouroku of course, did his part as the one who decided to take her in, he taught her to not depend too much on her powers and started to do things with her own body because at the moment, her body is just too weak and frail. I personally like Zouroku a lot, he's very brave, and he doesn't care if it's a villain or another living being, he'll scold the hell out of it and make things right.\\n\\n\r\nThere are other characters, but they lack development because of the short anime length, this show could've done more if it went to 24 episode, but sadly, it is only 12 episodes long.\\n\\n\r\nEnjoyment\\n\r\nThis might not have been the best anime ever, it lacked episodes, some other characters desperately needed screen times, and the second part of the anime is not as good as the first one, i really enjoyed this anime because i'm a sucker for heartwarming things and bondings, especially the beautiful music in the background, but i can imagine other people not enjoying this as much as i did, because the anime has it's flaws, and it's not easily fixed.\\n\\n\r\nOverall\\n\r\nI personally gave this show a 9/10, while 6-7 is probably the most right choice for this anime, i just couldn't bring myself to give the anime that score, i went with 9 in the end after giving it a deep thought, while some part of the anime is dark, i think it's still a good anime to recommend to a lot of people, that's it for my review, thank you for reading.",
            "date": "2017-06-28T04:32:00+00:00",
            "helpful_count": 8,
            "mal_id": 251306,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3260487.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RageGoria",
                "username": "RageGoria"
            },
            "url": "https://myanimelist.net/reviews.php?id=251306"
        },
        {
            "content": "I enjoyed this one, a facinating series about people with powers, it has some great action moments, followed by some wonderful just family moments.   I liked it.\r\nStory:   It's cute, it comes off as more action packed at the start, but as it progresses it becomes more about just family and these kids with powers.\r\nArt:    The art is nice, especially later on, I can't say much without spoiling, but I liked how creative it got in the last few episodes.\r\nCharacters:  I think this is where it shines, it has a nice cast, each with their own personalities, abit of drama that worked, and some hard moments dealing with things that just worked for me.\\n\\n\r\nEnjoyment and overall:   I liked it, I would recommend it, I say if you want, give it a shot.",
            "date": "2017-06-26T00:24:00+00:00",
            "helpful_count": 8,
            "mal_id": 251067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wolfwing",
                "username": "wolfwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=251067"
        },
        {
            "content": "Starting up Reviews again: my 15th - Alice to Zouroku\r\nWhen I started watching this series I didn't really know what to expect however the more episodes that came out the more I started to enjoy this series. I loved the powers and the whole story of what happens to the people with powers however it lacked a lot of detail. \r\nThe plot of this show...there wasn't really a solid plot, was more of a semi-slice of life anime of a girls everyday life with a new family...with the exception that she just has powers! I couldn't really find a solid plot at all however itstill was a good anime at the end and I still had a lot of enjoyment watching this series. I suppose you could say that there was two plots to this anime: the first focusing on Sana and what she has to do in order to get away from her past and become who she wants to be and the second being of the 'witch'. The second Plot is more of this 'Witch' finding herself when she has gotten lost and Sana comes into play and tries to 'save' this witch from herself. \\n\\n\r\nWhat about the characters? I actually really enjoyed a lot of these characters, they all had unique details of one another and you could see the different personalities of each. I loved the last few episodes when the 'witch' and her friend arrived as it sort of shown more different types of characters within the anime. Sana is the main Protagonist and you can see her development the most as she really has nothing at the beginning, she knows hardly anything however as the story progresses she develops 'oneself' and shows us more of who she is becoming. \\n\\n\r\nThe Animation of this anime was unique and I actually liked it, it was nice and colourful in parts and it wasn't too in your face. Was a nice smooth animation that sort of blended together in frames. The sound was also lovely and very nice throughout the series, it put you on edge when there was something happening and it also calmed you in the nice slow scenes which gave you more feeling throughout. \\n\\n\r\nI really liked this series and would enjoy a second season. I really enjoyed watching this and I loved the different types of characters that was displayed throughout. I really did enjoy the different crazy plots that did come up with what Sana kept doing with her powers. My favourite part was near the end with the 'witch' plot where it shown the anime in a new 'dark-themed' way with what some characters had to go through. \\n\\n\r\nWould recommend this to people that prefer Slice of Life as it is really just a Slice of Life with the added Powers. Would definitely watch this series again.   A lot of the characters can become liked and the story itself can still be good with what happens towards the end of the series. \\n\\n\r\n~ Canaan",
            "date": "2017-07-04T05:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 251911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3403513.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Canaan",
                "username": "Canaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=251911"
        },
        {
            "content": "Alice to Zouroku finished airing after 12 episodes each being 23 minutes long,( apart from the first episode which is around 40 minutes long) but if you deduct the opening and ending there would only be around 21/20 minutes of the actual show. The show was created by Tetsuya Imai and came from J.C Staff studio. In this review, I will make a fair judgment on the show considering the series loyalty to its genre's and my personal opinion on the quality of the show. \r\nFirstly let's revise the genre's that the show relates itself to; Adventure, Mystery, Seinen.\r\nAdventure~ It is undeniable that this showcontains traces of the Adventure genre in its plot. The adventures are related to the main character 'Alice' other known as Sana. She runs away from a research facility and finds herself in a strange world with no knowledge of her surroundings. While wandering from place to place she meets Kashimura, Zouroku an elderly florist with a grumpy but honorable attitude. Sana finds herself in a constant adventure as she learns how to live like a normal girl without using her powers to complete simple everyday tasks. But although the show could be tied to the genre of adventure throughout the entire season, it is undeniable that the real adventure only started from episode 9-12 (in order to avoid spoilers I will not mention much about why in my opinion the real adventure only happens at the climax of the show)\\n\\n\r\nMystery~ Personally I don't see this show as a mystery whatsoever. This show is pretty straightforward and the biggest \"Mystery\" of the show was in the 1/2 episode where Zouroku's occupation was being revealed. If you look at the official poster for the show you can clearly see that the show will have something to do with flowers so it's not a mystery that Zouroku is a florist. So, in my opinion, this genre is not fitting for this show and could mislead people who are searching for a mysterious anime.\\n\\n\r\n Seinen~ For those unfamiliar with this term it means a genre that is aimed primarily at the male, college-aged/young adult. Seinen anime and manga tend to be a little bit more mature than it's counterpart, Shounen, which is aimed at younger boys. I personally find this genre to be the most misleading and misplaced in this shows description. Maybe this was a mistake on the publishers part for adding this genre into a show which is more so aimed at the young female audience with child-like problems and cutesy themes. \\n\\n\r\nAll in all the show gets a 1/3 genre accuracy on its genre choosing which in my opinion is dishonest and unfair towards its viewers.\\n\r\nNext, I will give my ratings for Story, Art, Sound, Character, Enjoyment, and Overall.\\n\\n\r\nStory~ The story itself gets a 4/10 since it isn't anything new in the anime industry and it wasn't shown in a new light. this shows highlights consist of the cuteness of the characters. The story is fairly decent since it revolves around Sana getting used to the world outside of Wonderland but in my opinion, the show had a slow paste and most of the content was unnecessary and could have been made more interesting if there was more going on in each episode. therefore a 4/10 seems like a fair rating in my opinion since the story was not clear and not as enjoyable as initially we are led to believe.\\n\\n\r\nArt~ 5/10, The art in Alice to Zouroku is quite pleasant but not anything spectacular. The art was very simple and followed a very cute pattern with most of the characters having pretty similar facial shapes and features. In the first episodes, the art gets messy and becomes an eyesore when Zouroko and Sana are escaping the twins Hinagiri, Asahi and Hinagiri, Yonaga who came from the same research facility and happened to be Sana's first and only friends at the time. In my opinion, 5/10 is a fair rating for this show being that its highlights consisted of scenes from Wonderland which were rare until the last few episodes.\\n\\n\r\nSound: 5/10. The sound in the show was pleasant also. The opening \"Wonder Drive (ワンダードライブ)\" by ORESAMA was very catchy and colorful which got me hyped for the episode to begin and the ending \"Chant (kotringo edition)\" by toi toy toi was pretty decent also. The voice acting was fair but I found Sana's voice to be a little irritating at times. Most characters have nice voice actors but I can't bring myself to give the show too much praise for its sound due to personally not being impressed with the sound.\\n\\n\r\nCharacter~ 4/10. Most characters were pretty unimpressive and most not getting much screentime even though they showed potential as interesting characters such as Ichijou, Shizuku. Zouroku himself, although the main character, does not get much screentime and not a lot of him is ever revealed. The only character development which was shown to us is between Sana and Ha-chan as she is referred to by her friend. Sana's backstory was pretty quickly revised but I wouldn't say that it wasn't clear. Ha-chan's story was told at the ending with the problems she was having and the truth behind why she seemed so depressed throughout her screentime. apart from these two only one other character was given a solid backstory Tachibana, Miriam C which for the sake of keeping her backstory more effective I will not disclose in this review.\\n\\n\r\nEnjoyment~ My enjoyment of the show comes down to 4/10 due to not being impressed with the show and not really looking forward to each episode as much as I would for other shows. the show was not outstanding with its plot or characters and personally, I just enjoyed the opening and the relationship between Sana and Zouroku.\\n\\n\r\nMy overall score for Alice to Zouroko is 5/10 since it wasn't complete garbage but it was far from a masterpiece. Perhaps it would have been more interesting if the characters were more relatable and if the plot was a little more gripping and explored more. I wouldn't discourage anyone from watching this show and I understand that many may enjoy it and I am in no way bashing your opinion. This anime is not for everyone and that is all you should keep in mind. This series would be a nice watch when you have spare time on your hands that you wouldn't mind spending on this show. I cannot say anything else about this show since I personally won't be rewatching it ever again but I wouldn't say regret watching it.\\n\\n\r\nThat concludes my review for Alice to Zouroku which finished airing Jun 25, 2017",
            "date": "2017-06-26T05:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 251088,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6109952.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnikuGuroshima",
                "username": "AnikuGuroshima"
            },
            "url": "https://myanimelist.net/reviews.php?id=251088"
        },
        {
            "content": "Alice and Zorouku is an anime that I truly like. It's one of the rare animes that fill your heart with warmth , comedy and magic . When you've watched  many animes, your longing for something special.Something that has a new vibe. It reminds me of Jinrui wa suita Shimashita X Usagi Drop X Gakuen Alice but a good original anime on its own. Just watch it. Damn, seeing this anime wrongly valued(with its reviews) as its really is make me sad.\r\n(may contain spoilers)\r\nThe Story:\r\nThe story was great though it had more potential. They could have executed it better. Showing Sana's every day life.\\n\r\nIt could have been more gratifying.  The flow was disoriented and it felt like it was rushing its end. It lacked of familial , friendship and school scenes. It's inclinement after inclinement.\\n\r\nHow I wish it was the nichijouísh kind of anime. More of like Kobayashi-san chi no maid dragon.\\n\r\n(The end was very annoying and infuriating. Showing the old Sana thanking Zouroku. How much lazy can you get?!  I mean you would love to see her grow right? But most of animes leave us with \"hey,just use your imagination\" or \"happy now? we have the ending:nomoreseason2\".)\\n\\n\r\nArt:\\n\r\nThe art is good.As far as I can tell it deviated so much to my expectance of the art(the story should have been more heartwarming as its art). Well, just wait to see the wonderland.\\n\\n\r\nThe characters:\\n\\n\r\nI did not find it to have corny lines as most of feels anime would have. Maybe because of the story and the character development. The lines were so natural and was connected to each other making the characters feel a little bit real. \\n\r\nAs for example how Zouroku replies to Sana when they have a conversation. \\n\r\nOr how Sana throws her tantrums.\\n\r\nIt amplified the characters cuteness, and its heartwarming concept of home.\\n\r\n(though it would have been better if they focused on the homey concept)\\n\\n\r\nSound:\\n\r\nTwo words. \"Original:Nostalgia\"\\n\\n\r\nEnjoyment:\\n\r\nJust fuckin'watch it. Its really fun.\\n\\n\r\nOverall:\\n\r\nWell though it had many downs,but I will be keeping this close in my heart and treasure it as one of the few animes that really made me feel frazzzled.",
            "date": "2017-06-26T02:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 251077,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6345442.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/onoeko",
                "username": "onoeko"
            },
            "url": "https://myanimelist.net/reviews.php?id=251077"
        },
        {
            "content": "I really like Steven Universe, and there are some necessary comparisons that have to be drawn between that show and Alice to Zouroku:\r\nChild with mysterious powers taken in by adoptive parents\r\nNo true villains\r\nComing-of-age portrayal through scenarios of social and emotional discovery, accented but not reliant on fight scenes\r\nOf course, in the details and execution, everything is different about Alice. An \"Alice in Wonderland\" aesthetic drives how the powers work(as you might expect), and while Alice is powerful she is utterly clueless about the world, making her a great foil for Zouroku, a traditional family values parent who is elderly and physically vulnerable, despite his assuringdemeanor. There are government agents and other kids with powers that variously intervene and propel along a larger story, but the plot structuring is loose, and the tone often shifts to warm slice of life character moments without any overt foreshadowing.\\n\\n\r\nIt comes off feeling both well-rounded and unpredictable: a consistent pleasure to watch.",
            "date": "2017-06-04T13:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 249274,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845194.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/triplefox",
                "username": "triplefox"
            },
            "url": "https://myanimelist.net/reviews.php?id=249274"
        },
        {
            "content": "‘Alice and Zouroku’ is the latest of a flurry of recent Seinen series about cute children and adoptive parent figures bonding, in the vein of ‘Usagi Drop’, ‘Barakamon’, and ‘Puco’s Udon World’. Except for the fact that it takes more of a Fantasy route.\r\nThe story involves our main character, Sana, a girl with an ability known as Alice’s Dream; which allows her to materialize anything that she imagines. This ability has kept her and other children with the ability locked inside a government facility until the day that she escapes. From there, she meets an old florist named Zouroku, who agrees to take her inand keep her safe from the government trying to find her.\\n\r\nThe reason the series is called ‘Alice and Zouroku’ despite the main character’s name being Sana is because the story makes use of a lot of allusions to ‘Alice in Wonderland’, certain characters are made as clear reflections of characters from the Lewis Caroll novel, and the premise, as we learn later on, is intended as a sort of subversion to the novel, with our main character’s development being how she goes away from the representation of Wonderland, and finds excitement in ordinary life, from which it is able to mould a ‘Coming of Age’ tale similar to Caroll’s book whilst also cleverly subverting it.\\n\r\nCombining elements of Slice of Life and Fantasy can be a tricky thing, one that could result in the series feeling trapped in an identity crisis. Thankfully, the series is mindful of when to properly use its genre components. The Slice of Life area of the series is where it shines the brightest. The chemistry between our two main characters is a particular delight to watch. Sana, being the young and optimistic (despite her experiences) child dominated by an intensive curiosity for the world around her works well as a comic foil with Zouroku’s gruff, grumpy old man persona. In Sana’s case, her powers offer an unlimited range of comic relief sections which help to make for a nice shake away from the mundane nature of most SOL series. The development between the two is also delightful, as they both learn from each other, Sana reigniting Zouroku’s softer side, while Zouroku helps to teach Sana how to adapt to the new world around her. I also enjoy how despite the story containing some hinted darker elements, they never tried to make that into the focus of the series.\\n\r\nMost of the supporting characters are there to provide either extra Comic relief or lengthy exposition. Zourokus granddaughter Sanae, who takes an instant liking to Sana is cute if a bit naïve. I read that some people found her character annoying but I never did mind her. From the facility are two other Alice’s Dream weavers, twins named Hinagiri, Yonaga and Asahi, or as I like to call them, Tweedle-Dum and Tweedle-Dere, they don’t really do a lot apart from try to capture Sana early on in the series before going through a background development. We also get Naito and Ichijo, two government agents Zouroku gets to help him. Despite often being used as subjects for exposition, they do provide for some entertaining moments, and even make you think a spin-off starring the two of them wouldn’t be a bad idea. Later in the series, we also get introduced to Hatori, a depressed young girl who discovers that she has those powers as well, providing the conflict for the final arc which I won’t get into for spoilers, but her story is still quite gripping, providing the best part of the series.\\n\r\nThe fantasy elements of the series permeate through its production. The Soundtrack attains a nice ambience to it. The OP and ED are also relaxing as hell. Even though none of it is particularly memorable, it does still manage to achieve what it sets out to do. The animation looks fine for the most part. At first, I wasn’t too sure about the blocky, cartoonish character designs in what at first seemed to be a dark series, but as the series settled into its tone and decided what it wanted to be, the more the character designs seemed to fit. Being a fantasy series, it should only be natural that the animation is used to make a wondrous visual display. This is certainly true when we see Alice’s Dream in action, and later on when we see the surreal environment of the representation of Wonderland, we see the series’ strengths really come into play with a myriad of animation styles keeping the environments visually interesting. The first episode did feature some terrible CGI which was so unpleasant to look at that I almost considered dropping the series there, but I kept with the series and I’m glad I did.\\n\r\nSo, with so many positives weighing in favour of the series, ‘Alice to Zouroku’ is one of the best shows the year, right? Well, unfortunately there is a major setback the series has going against it. As I said before the series works best when it embraces its slice of life elements. Additionally, the last arc focusing on Hatori displays the series’ ability to also weave its more fantastical elements to create a dazzling visual treat. I haven’t so far however mentioned the early-middle portion of the series, because that is where the series was at its weakest for me.\\n\r\nThe storyline of Sana trying to hide from the government feels too much like ‘Elfen Lied’ for my taste, and it largely consists of action setpieces involving the character’s powers. These aren’t as exciting as the series seems to think they are, mainly because the unlimited nature of their powers takes away a lot of the suspense. It is my belief that action scenes should have some sort of limitation for the protagonist to overcome, and while a character who can create anything in a fight may sound exciting, it ultimately just feels like a cavalcade of randomness which feels severely lacking in tension. This portion of the story also carries a debate about whether the Alice’s Dream weavers can integrate into human society, but this theme was already examined a lot better in the quieter moments when we actually saw Sana interacting with the ordinary world instead of relying on dull exposition to make us think this.\\n\r\nNot to mention, the arc goes on for a lot longer than it needs to, thanks in large part to these action scenes, which unfortunately takes a lot of the series’ runtime away from the more enjoyable moments. I was relieved when the arc finally did end, and the series got back to focusing on Sana and Zouroku’s everyday misadventures, as well as that final arc which really does accentuate the series’ highest qualities.\\n\r\nWith all that said, ‘Alice and Zouroku’ is still at least worth a watch if you have nothing better to do, or if you’re looking for an alternative Magical Girl series/Slice of Life. Although it could have reached higher heights, I am still ultimately glad that I checked it out, and that is perhaps one of the nicest comments you can give a series.\\n",
            "date": "2017-06-25T10:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 251003,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5740156.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hybrid_Rainbow29",
                "username": "Hybrid_Rainbow29"
            },
            "url": "https://myanimelist.net/reviews.php?id=251003"
        },
        {
            "content": "(No spoilers! I wrote this review for my blog and thought I'd post it here on MAL too.)\r\n“This is the story of a girl who continues to search for ‘herself’ so that she can become a ‘me.’”\r\nSo here we are and instead of joining the hype for titles like Attack on Titan Season 2 and Boku no Hero Academia Season 2, I decided I would try out something a little more my speed. Alice & Zoroku was something that looked cute and wholesome with a touch of action to keep the story from feeling too stagnant. In other words, just the sort of anime Iwas looking for to keep me entertained during hot summer days when I would rather stay cooped up in the A/C then brave the UV rays outside. Although now that I’m at the end I’m finding that it may have been a better idea to join in on some of the more anticipated titles the season had to offer.\\n\\n\r\nAlice & Zoroku was not a bad anime, honestly. The story kept me interested enough to finish out the twelve episodes of the sickeningly sweet main protagonist trying to sort out right from wrong in her strange new home. Sana possesses what is known as a “Dream of Alice” which grants her special powers. She’s not the only one though, and the real meat of the plot is her sorting out just what is okay to use her powers for and what is not, along with another young girl by the name of Hatori (who doesn’t even show up until episode 5). Unfortunately, there were several things that kept me from appreciating everything the show had to offer.\\n\\n\r\nFor one, the main character’s name is not Alice. It’s Sana. This, of course, was not the ultimate thing that caused me to enjoy the show less than I could have, but it irked me throughout the past few months everytime I caught sight of the show on a forum site or in my Crunchyroll queue.\\n\\n\r\nThe second thing that distracted me from what was a potentially wonderful anime was the art. The way the faces were drawn in profile had me giggling from just how ridiculous they looked, with a straight line directly down from the point of the nose through the chin, with the mouth placed comically to the side. Again, nothing too big. I could look past a particular art style I didn’t find all that appealing for the sake of the story.\\n\\n\r\nExcept that the story was nothing that I was expecting either. The first few episodes establish the relationship between Sana, the young female protagonist with otherwordly powers, and Zoroku, a stubborn elderly man who takes on the responsibility of becoming her guardian. When you hear this, you might think, “Oh man, I can’t wait for this girl to get in all sorts of supernatural trouble with a grandpa tagging along for comedic effect,” but that’s hardly what you get. There are minimal scenes where Zoroku interacts with Sana’s powers, but hardly any of them directly relate to the overall plot. As I mentioned before, the real story comes in the interactions between Sana and Hatori, another girl with a Dream of Alice, and how they sort out their own moral conflicts. Out with the old and in with the new, it seems.\\n\\n\r\nOverall I would give this anime a 5/10. It managed to keep itself lighthearted despite handling such heavy topics by keeping the main characters young and innocent and playful, but there was simply too much that took away from the enjoyment of it all. The art was funny looking, the characters not given enough time to develop, and the story focused too much on Zoroku on the beginning only to cast him aside later for the ‘real’ plot, thus leaving the rest of it rushed.",
            "date": "2017-07-23T18:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 253607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5542266.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LilacChild",
                "username": "LilacChild"
            },
            "url": "https://myanimelist.net/reviews.php?id=253607"
        },
        {
            "content": "Story\r\nThe synopsis alone gave me an idea that made me think about Elfen Lied. You know the Government hiding and making experiences in humans with special abilities. However, I knew this one would be much lighter than Elfen Lied was.\r\nThe story is not overly simpleminded but I didn’t enjoy the slow pacing of some episodes who were in my opinion, boring or annoying because of Sana’s childish behaviour.\r\nAlso, I am not happy with how it ended because I think there were plenty of unresolved questions. \r\nArt\r\nThe visuals were quite cute and good. Not something too memorable but still helped to keep my interested in watchingthis series. The characters design were also good, not perfect because I think they were in some cases just too similar to each other.\\n\\n\r\nSound\\n\r\nI am not going to look for the OST. It wasn’t a bad but nothing memorable. The voice actors did a pretty good job. I always admire their job even if the series is not that extraordinary. \\n\\n\r\nCharacter\\n\r\nI am not mentioning all characters because just some of them caught my attention.\\n\r\nMy favourite is Zouroku for a very simple reason: he is not the typical character that sees abnormal things happening around him and just ignores. He was genuine reactions and every time he scolded Sana or any other character I was totally supporting him. \\n\r\nNow, regarding the main character, Sana… I tried really hard to like her but there were some episodes that really ticked me off. I know she is a child and everything is new but in my humble opinion, they (the studio, whoever wrote this) took it too far. There were various moments when I was seriously considering dropping the show just because I couldn’t stand Sana’s attitude or behaviour.\\n\r\nI would like to see more of Ichijo but I guess, besides Zouroku, other characters didn’t really have a chance to show much.\\n\\n\r\nEnjoyment\\n\r\nThis anime has some heart-warming moments, some good action scenes and funny ones but nothing that I will remember in the future. Since everything was rather predictable I am not even going to bother to read the manga or recommend it to anyone.\\n",
            "date": "2017-07-11T14:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 252575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6122118.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnaSilva",
                "username": "AnaSilva"
            },
            "url": "https://myanimelist.net/reviews.php?id=252575"
        },
        {
            "content": "Spoiler free review\r\nI welcome feedback on my reviews\r\nWould you like to become God, or at least, gain the powers of God? The power to create something from nothing. The possibilities are endless when you think about the capabilities this ability has. Anything you ever need to survive is there for the taking, you just need to summon it. Think of all the world problems that could be solved with our very own friendly neighbourhood God. However, with power comes responsibility, as there would be many people that would to try and take advantage of this omnipotence.\r\nAlice & Zouroku is the story of Sana, a labrat who can use the \"Dreams of Alice,\" the ability to create matter. She escapes from the research facility to escape the scientist that want to experiment on her and runs into Zouroku Kashimura, a grumpy old florist that decides to take her in. Now, whoever wrote this story seemed to be unsure where exactly they wanted to take it, as the anime would often switch between a Slice of Life to a Drama. There are shows that can mix these two genres well, but it just didn't work out for A&Z. The Slice of Life element felt like forced cuteness, giving characters an unnatural moe that puts you off the show, while the Drama element is just badly done, with the boring villains, solutions to problems that feel thrown in for the sake of ending arcs quickly, and the unrealistic reactions that characters had during scenes. (Oh, a giant hammer-wielding Santa just appeared out of nowhere, and this girl just disappeared before our very eyes. Is a movie being filmed here?) These reactions just ruined the flow of scenes as you were left trying to figure out why everyone in this anime is so stupid.\\n\\n\r\nThe powers that are portrayed in the anime, named \"Dreams of Alice,\" would allow certain people to create matter. The objects that they could create however were different from character to character. Miriam C Tachibana could create giant arms that did whatever she wanted them to do such as grabbing or crushing objects, while Shizuku Ichijou had access to 666 different techniques and weapons she could bring out at a whim. Sana, however, had won the  Superpower Lottery, which gave her any power she wanted. Along with matter creation, she could also fly, teleport and use telepathy, just to name a few of abilities. The anime does well to explain how everything works and the limitations that they all had, so you're never confused about why a character is able to summon pigs or freeze people.\\n\\n\r\nMost of the characters were pretty likeable, from the childish ones like Sana, Sanae Kashimura, and Yonaga/Asahi Hinagiri, to the more serious ones like Zouroku, Ichijou and Ryuu Naitou. Most of them had their own goals that circled around the \"Dreams of Alice,\" either wanting to look after them or use them for their own selfish purposes. However, there were a few that seemed important but were left unexplored, soon to be forgotten by the anime. What was Kouichi Kitou's goal for wanting to experiment on the \"Dreams of Alice?\" Whatever happened to Cleo after the first arc? You're never really given the bigger picture to how all this started, as it's brushed aside to make room for the next arc.\\n\\n\r\nThe animation was quite nice for this show, although it often threw in some CGI to create the objects the \"Dreams of Alice\" would summon and other stuff like the everyday car. Looking past the 3D animation, the backgrounds that would often be shown were quite stunning, especially during the Wonderland scenes. Nothing else really stood out, as the character designs were pretty normal, (but that fits the setting of the anime so it's to be expected) and the action scenes didn't have any eye-popping visuals.\\n\\n\r\nAlice & Zouroku could have been something great, but it just wasn't able to show it's full potential as it tried to do too many things at once. This can be enjoyable if you're able to look past the issues this anime has, but sadly I can't recommend this incredibly forgettable show. Dream up of something better Alice.",
            "date": "2017-06-25T18:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 251054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6011085.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/EnZanity",
                "username": "EnZanity"
            },
            "url": "https://myanimelist.net/reviews.php?id=251054"
        },
        {
            "content": "I don't know why the other reviews are so low. This is a simple show about Sana Kashimura and her experiences with other people and the world around her. Yes, there is some of the story dedicated to other characters and the powers they have, but it all revolves around Sana. It's cute, it's beautiful, it's entertaining, and I find it highly enjoyable. JC Staff tried making a good anime this time and you can tell from the animation and beautiful detailed artwork. It's much better than their previous works such as Little Busters!\r\nJust watch the show if you want to get a feel forit. I love it, others hate it. It's a nice show and it's easy to follow. Zouroko is funny and Sana is extremely adorable--their relationship is funny and interesting, if a bit predictable.",
            "date": "2017-11-19T16:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 263573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1366087.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Malus92",
                "username": "Malus92"
            },
            "url": "https://myanimelist.net/reviews.php?id=263573"
        },
        {
            "content": "Warning possible Spoilers\r\nAlice in Wonderland is definitely what inspired this to be created because when you have a young blonde girl experiencing some weird stuff you know there's a connection somewhere.\r\nThe story begins with Sana a girl who has a power called Alice's dream which is an ability to create anything she imagines, but she is a test subject and after escaping the lab she encounters and old man called Zouroku the question is will he help her?\r\nNow the story wasn't particularly strong, but it was definitely interesting and kept me interested to the end as the show does start off in a thriller likeway then during the halfway point it becomes more of a slice of life anime then it finishes off with some really weird and deep stuff that did sort of lose me for a second though I enjoyed it all the way through till the end.\\n\r\nIt was interesting seeing Sana experiencing new things since she was always kept locked up and how this affected her view of the world and her own life in general because at some point she really does question whether her existence means anything and whether it will amount to something as she keeps calling herself a monster until the people around her like Zouroku and Sanae say she is who she is which helps her out.\\n\r\nI did like how the story paced out like it went through different arcs as you can tell when the situation changes and there is also the stuff that happened because this anime can get pretty dark at some point and then it can be really weird the next which shows how random this anime was, but this wasn't a bad thing as the characters always made the situation either funny or interesting as they try to figure things out and try to fix it.\\n\r\nIt was also interesting how there were other people who had the same ability as Sana, but had different variants and it was a bit tense seeing how some of these people used their powers because Sana mainly used it to help her, but there were others like Miriam C or Hatori who used their powers for more destructive or personal uses which showed that having powers isn't always a good thing.\\n\r\nThe big problem I have with the story is the fact that the ending felt rushed and a bit anti-climatic as it finishes with an adult Sana monologuing over how well her life has gone thanks to the people who looked after her which shows there isn't going to be a season 2 and the fact that all it took for the situation to be fixed was Zouroku saying \"I've had enough\" which just felt stupid, other than that though the story was alright.\\n\\n\r\nNow the characters were also a reason why the anime was pretty good, but there was certainly some screentime problems for some characters.\\n\r\nSana Kashimura is the female MC and is actually not human since she was born in the dream world and eventually took on a human form, she starts out arrogant and immature until Zouroku made her learn some manners and then helped her how the world worked, over time she does become more mature, but when facing certain situations she can be rash in her decisions and often use's the phrase frazzled when she feels something she doesn't like or confuses her, some people might find her annoying because she does whine a bit, but to me it wasn't dislikeable instead it was more cute really.\\n\r\nZouroku Kashimura is the male MC and he is a florist and owns a florist business, it's rare seeing an older person being a protagonist and he is actually a very likeable person because behind his grumpy exterior he is actually a wise and caring man and makes sure his family is ok, the problem with his character is that he wasn't used that much other than being Sana's guardian I mean you see them connect a bit, but you don't really get to see his character shine outside of those moments with Sana and Zouroku.\\n\r\nSanae Kashimura is Zouroku's granddaughter whose parents died while she was young, she switches from being a mother and sister figure to Sana and she is a really positive and happy person often making sure that Sana is happy, safe and well fed, she also has this weird fixation on stuff that's cute like when Sana was having a sleepover with her friends she wished she had joined in when they were messing around.\\n\r\nYonaga and Asahi Hinagiri are twins who were also test subjects alongside Sana and were her only friends, Asahi is the more adventurous and Yonaga is the more responsible one, but sometimes they swap personalities which makes it difficult to differentiate whose who, when they are freed from being test subjects they become proper friends with Sana and you can see from their interactions that they really care about her since she is like them.\\n\r\nHatori Shikishima and Ayumu Miho are two friends who end up in a difficult situation because of Hatori acquiring powers, Hatori is the more depressed of the two mainly because her parents constantly fight and she thinks that she is a burden to them until Sana helps her realise that her existence isn't meaningless and this helps her become a better person, Ayumu is Hatori's best friend and enjoys playing football, she cares about Hatori's well being and went to great lengths to make sure she wouldn't feel sad anymore which shows the close bond that the two had which at times made it seem like they were more than friends.\\n\r\nShizuku Ichijou is a person who has the same powers as Sana, but is from another organisation that is trying to help people like Sana live a normal life, her tone of voice doesn't really change much though she is definitely a badass that shouldn't be messed because her powers are immense and has saved Sana on multiple occasions and she has even helped teach her a few things too.\\n\\n\r\nThe artstyle was mixed in some areas, I really liked how dream land looked it was full of weird and wonderful things which just made the whole thing feel like a weird drug trip, but there are points where there is CGI that really ruins some scenes like when Sana and Zouroku are trying to get away from the twins and that whole chase scene looked really bad luckily it was the only scene that looked bad while the rest kept up nicely, the design of the characters looked a bit similar to the characters from Mahou Shoujo Madoka★Magica too.\\n\r\nThe soundtrack also surprised me too because I really liked how the music sounded during the dream land scenes as it felt mystic which fitted very nicely with the moment.\\n\\n\r\nDespite there being the mystery genre there were some good bits like Sana's origins which aren't really explained properly which is a little disappointing, but the best part of this aspect is pretty much during the whole dream land sequence with Sana trying to help out Hatori figure out the meaning of her existence and the reason why she existed too.\\n\\n\r\nThere is also some comedy and Slice of Life elements too especially with the interactions between Sana and Zouroku which were just great and funny moments, but the sad thing is they were too far between all the other stuff which is the main weakness of this anime is that is didn't take advantage of the relationship between Sana and Zouroku and just made it a side thing.\\n\\n\r\nOverall this was an interesting, sweet and mysterious anime with a few flaws, but still enjoyable though sadly there won't be a second season which does disappoint me a little since I think Sana still has more to tell in her story and I would have loved more moments between her and Zouroku though sadly that won't happen.",
            "date": "2017-09-06T12:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 257013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=257013"
        }
    ],
    [
        {
            "content": "Story: I for one enjoyed the kind of story that Alice to Zouroku told during its 12 episode life. Initially the show comes off as perhaps a more action-oriented mystery, with the first arc of the show having a more serious atmosphere to it. But after the first arc, the show then does a 90 degree turn with the next arc being more down to earth compared to the first one. This was a bit jarring, as I had expected the first arc to be more fleshed out then just \"...and it's over\" The last few minutes of the arc felt rushed as most ofthe \"antagonists\" are never mentioned again in the show, and only assumptions can be made about their fate. Despite the jarring transition, the rest of the show onward is more slice of life, with Sana experiencing more of the world around her under the care of good old Zouroku. Towards the end, thanks to newly introduced characters, Sana's peaceful life is disrupted, prompting her to resolve the issue, which leads us to how the show concludes itself. Though for me it was anti-climatic, the ending was rather fitting the story's direction in the later part of the show.\\n\\n\r\nArt: While the CGI in the beginning may have offset a lot of people, the animation and the art direction from then on is absolutely heartwarming if not joyful. For me, most anime I watch generally have acceptable or quality animation which is something I've come to expect, so there isn't much to say about Alice to Zourokou's animation besides what I mentioned earlier.\\n\\n\r\nSound: Not breathtaking, but certainly not dull, the music of Alice to Zouroku is not only fitting of Sana's cheerful personality but also the atmosphere of the show. \\n\\n\r\nCharacters: Besides Sana and the other children like her in the show, not much character development in terms of backstory is given for the other characters. Throughout the show, you learn more about Sana and also the other children if its needed for the story along with bits about Zouroku. And that's about it, since the show's primary focus is really on Sana and her experiences or should I say her \"adventure' in the real world.\\n\\n\r\nIn the end, I enjoyed watching Alice to Zouroku because to me it was a rather heartwarming experience, I'll admit it wasn't a spectacular show, me giving it a 7 which is a rather common rating for me to give to generic shows. While not spectacular, it was by far a different experience from shows with a similar theme/outline.\\n\\n\r\nOverall: Pretty good but i'm more of an optimist so its probably just decent/10\\n",
            "date": "2017-07-13T01:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 252710,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4283191.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Xteria",
                "username": "Xteria"
            },
            "url": "https://myanimelist.net/reviews.php?id=252710"
        },
        {
            "content": "The \"Pantheon of opportunities ignored\" has another addition to it with this anime. Coupled with shit 3-d animation as well, this anime deserves a skip. But why?\r\nHonestly, I was betrayed by the first 4 episodes of what was going to happen and how the story was going to progress. I'm not gonna discuss this openly for fear of spoilers, you'll just have to watch them yourself. But I swear they flipped the anime around like a pancake and reveal a very charred side of the story that I would rather wait for, it felt rushed, to put it mildly.\r\nThe rest of the anime is primarilyabout how children interact with new things in life and the struggles they might face coupled with the strange powers that exist in this world, wich sounds good granted, but it was not what I wanted.\\n\\n\r\nWhat I wanted, was the first 4 episodes, stretched out neatly with the 2 main characters helping each other in their own unique way.\\n\\n\r\nI could easily see a path they could have gone to make this a really good story with all the fluff still there. I will say however if the release a sequel I will watch it. There is a lot of promise and opportunities. They might still ignore it though. Meh, if the do I'll just rate it 1/10.",
            "date": "2017-06-26T15:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 251123,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6240765.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SirMarmelady",
                "username": "SirMarmelady"
            },
            "url": "https://myanimelist.net/reviews.php?id=251123"
        },
        {
            "content": "Story: 8\r\nThat 8 is at least for the premise. It starts off quite interesting. It could have gone a more serious route like in the first arc where it was about keeping Sana/Red Queen contained or obtaining her powers, but it quickly changed into a slice of life show after that, only returning to the supernatural stuff in the last arc.\r\nCharacters: 7\r\nThey all build to some degree or another. Sana becomes more and more like a human child as time goes on. Zouroku and Sanae also grow closer as a family with Sana. Ayumu and Hattori towards the end also sort of grow up. Originallythe latter was a rather angsty child. \\n\\n\r\nArt: 7\\n\r\nIt's simplistic and tends toward a younger audience but is not unique. The backgrounds are decent.\\n\\n\r\nSound: 7\\n\r\nNot much to say. The soundtracks did its job but that's it..\\n\\n\r\nEnjoyment: 8\\n\r\nAlthough this show has seinen in its tags, it felt rather lighthearted and is really more or less a growing up story of sorts. There really weren't that many adult themes in this show, nor is anything here really mature.\\n\\n\r\nWho's this for:\\n\r\n-If you want an unusual slice of life show\\n\r\n-Moe fans\\n\r\n-Loli fans\\n\r\n-If you like supernatural stuff/superpowers\\n\\n\r\nWho's this not for:\\n\r\n-If you really want something serious as implied by the seinen tag. \\n\r\n-If you don't like slice of life\\n\r\n-If you were looking for something deeper than a growing up story",
            "date": "2017-06-25T13:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 251025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6177738.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SongstressSL",
                "username": "SongstressSL"
            },
            "url": "https://myanimelist.net/reviews.php?id=251025"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nIt’s my hope to be a grandfather someday.\r\nMy own Grandpa turned 85 years old this week. I called him up on the phone to tell him happy birthday and to see how he has been doing. We talked about my job, his thoughts, and just life in general. To him, he’s most grateful for a simple yet important thing: his family.\r\nFrom his wife to his siblings, from his kids to his grandkids and great grandkids, he is proud to know that his legacy is one filled with amazing people. Good people. And I’m lucky enoughto be a part of the love that he shares.\\n\\n\r\nAlice to Zouroku isn’t about birthdays and legacies, but it is about a relationship that spans a couple of generations. Sadly, whatever love it does have to share is lost along the way.\\n\\n\r\nSTORY\\n\\n\r\nIt takes watching all of Alice to Zouroku to realize that its narrative construction isn’t exactly linear. Not in the one-event-after-another sense but in the how-it-coalesces sense. Because, at first, it seems as though the show will follow a strict, singular plotline. Instead, it goes for separate arcs and episodic content, jumbling together both approaches to achieve its story.\\n\\n\r\nIf this content were half-arc-half-episodic or fully one or the other, then the anime would have had some merit, following through on a foundation or keeping consistent in its plot. Instead, this jumbling comes off as the anime having little to no focus. Many of the people in the first half do not carry over: Minnie C., the director dude, that one kid who can draw items into existence. Much of what goes on in the second half doesn’t tie back too well: Hatori’s dilemma, the explanation of her powers, the newfound government watch program. And sandwiched in-between are the show’s episodic morsels.\\n\\n\r\nNot that the two slices of bread on either side of the season are completely inedible. Sanae and Sana’s interactions in the second episode make for a fun, lively sequence of events that push the plot along while building the cast. And the exploration of Wonderland in the final couple of episodes, after it had been alluded to here and there for quite some time, demonstrates a follow through on Alice to Zouroku’s part.\\n\\n\r\nStill, the breads’ moldy focus heavily curtails the show’s most important aspect: Sana and Zouroku’s relationship. With the initial outing worried mostly about a research facility and the evil people chasing Sana, and with the last outing putting a ridiculous amount of emphasis on a couple of last-minute characters, there just isn’t enough time given to what the anime literally titles itself around.\\n\\n\r\nThat’s why, when these moments between the old grandpa and the young granddaughter do pop up, they immediately capture the audience’s attention. It can be something as small as him pulling open a wrapper around some candy for her to eat or as big as her clinging onto and refusing to let go of him when he gets back home safe and sound. No matter the scale, their grounded moments together represent Alice to Zouroku at its absolute best.\\n\\n\r\nIndeed, all of episode six – with her tagging along during his job, their intermittent conversations, and her eventual adoption – make this aforementioned morsel the tastiest of the bunch. It can even be argued that the very, very last scene also deserves such praise. An older Sana fondly reminisces about Zouroku in a future timeline while clutching a set of beautiful flowers that no doubt remind her of him. The thematic implications alone here make this snippet infinitely more interesting than whatever the first and second halves of the show dished out. If for no other reason than it actually relates to the anime’s main goal.\\n\\n\r\nBesides the strange lack of focus, the anime contains even stranger decisions. Sana’s kidnapping isn’t so much shocking in an entertaining sense as it is downright uncomfortable to watch given how over-the-top the anime goes with it (when she soils herself, the potential drugging, literally shooting her in the leg with subsequent muffled screams and cries). Moreover, one of the story’s themes on humanizing remains restricted to the Dreams of Alice users as opposed to explored and contrasted through regular people as well. And, speaking of the Dreams of Alice, the premise never truly takes hold, acting more as a caveat to the narrative rather than a vital piece worth extra attention.\\n\\n\r\nA lot of the comedy does work in the anime’s favor thanks mostly to Sana’s inquisitiveness. Plus, to reiterate, her moments with Zouroku demonstrate that this story has heart. But, without tangible storytelling focus and with those few speedbumps along the way, the show’s total execution rots more than it would prefer.\\n\\n\r\nART & ANIMATION\\n\\n\r\nAlice to Zouroku’s first episode spells doom for the series when it trips up with error after error in its artistry. Asynchronous audiovisual production when a character sounds like he sits down and sighs but not really. Low-quality CG all over. Moving backgrounds when the characters themselves have stopped. Improper detail locations. While none of these specific issues exist for any longer than a few seconds at most, their frequency raises a red flag immediately for the rest of the show’s artistic integrity.\\n\\n\r\nThankfully, the flag lowers quite a bit once moved beyond the first episode. Yes, the CG is still not ideal when it does appear, but it isn’t around as much or at least as prominently. And yea, the rare weird cut can rear its ugly head, like when Zouroku moves to attack Minnie C. for harming Sana. But, in general, the anime doesn’t wave that flag around with vigor anymore afterwards.\\n\\n\r\nInstead, Alice to Zouroku likes to draw one’s attention to the effort put into the designs of its characters. Their blocky nature adds some much needed charm to this story, and their looks capture their personalities well.\\n\\n\r\nFor example, Zouroku’s furrowed gaze, white beard, and red sweater paint him as a stern yet likable grandpa. Sana switches from a princess dress and crown to a hoodie and short hair without ever losing her blonde strands and pink coloring, giving her a childish, cute appearance with ease. And Shizuku’s business attire contrasts with her magical maid outfit to complement work with “play” and to help accentuate her doubly helpful behavior.\\n\\n\r\nSana’s Wonderland and the background artistry also deserve some praise. Her world away from the world contains all manner of depicted oddities: flying seals, giant turtles, crazy technology, piano bridges, shoe plants, ducky boats on a tea river. All it’s missing is a loony (read: mad) guy with a hat and some cards.\\n\\n\r\nThe background art in Wonderland wows with its blue skies, pink clouds, and levitating isles. But the local city, Zouroku’s pretty floral shop, and the smaller locations visited (his house, the alley restaurant) also do their part in building the show’s appeal.\\n\\n\r\nBy comparison, Alice to Zouroku’s actual animation does not reach as high as the designs and the background art, but it does not reach as low as the first episode’s wary mistakes either. Instead, it treads a middle ground. The characters’ imaginative summons, like Shizuku’s array of “weapons”, up movement for the duration of their stay, and the everyday actions of the characters don’t scream fluidity but get the job done regardless.\\n\\n\r\nThat red flag never leaves the mind of the audience because of the stark nature of the errors committed. However, with the nice designs, pretty backgrounds, and passable animation, the show at least tries to hide that flag as best as it can.\\n\\n\r\nCHARACTERS\\n\\n\r\nOf the two main characters in Alice to Zouroku, Sana evidently earns the most screen time.\\n\\n\r\nWithout knowing anything about her, Sana seems like any other child. She pines after tasty food she cannot afford. She isn’t afraid to state her honest opinion despite the situation. She loves to have fun without worrying about the consequences. Yes, she has her own personal quirks, like commenting on the smells around her and singing made-up songs any chance she gets. But she’s no doubt like any other kid through and through.\\n\\n\r\nAt least, until one discovers that there’s more to her than meets the eye. As a sentient Dream of Alice, Sana isn’t human. She’s a construct of the people and the emotions she experienced very early on. In other words, not only does she have to mature as a person but also she has to learn what being a person even is to begin with. This double layer of necessary growth for her character gives her experiences throughout the season a meaningful edge twice over and a much more purposeful direction overall.\\n\\n\r\nSo, many of the scenes in Alice to Zouroku that revolve around Sana center on her growth. Much like the craziness of her Wonderland dreamscape, these scenes come in all shapes and sizes. She finds joy in the simple things such as the squeaking of some wooden steps. She learns to apologize when in the wrong. She receives an education and a family to call her own. Incremental steps really, but they go a long way towards putting her on the right path for adulthood and “humanhood.”\\n\\n\r\nHer relationships with others, while few in number, also contribute to Sana’s growth. The twins act as a fun, recurring remnant from the first part of her life, letting her know that not everything from her past should be forgotten. Hatori, the main “antagonist” of the last arc of the season, is herself not the most compelling character (and honestly not individually relevant to the show), but she does (indirectly) force Sana to refrain from gut reactions and to think about sympathy towards others instead. And Sanae dotes on her as much as she can to give her the love and care she has never experienced before.\\n\\n\r\nThese people are well and good for Sana’s growth, but the most important figure now in her life isn’t a friend or a sibling but (as anyone can guess at this point) a grandparent: Zouroku.\\n\\n\r\nKnown as the man who despises “crooked stuff,” Zouroku is an older fellow whose tough demeanor and worn baseball cap hide the fact that he’s the town’s most proficient florist. He doesn’t take extra handouts from others, and he looks after his employees. In short, his age reflects his steadfast maturity.\\n\\n\r\nWith age also comes wisdom. Zouroku doesn’t care that Sana is technically not human; he simply sees her as a sincere young girl who wants to live a normal life like anybody else. So, in their various scenes together, Sana listens to Zouroku as he passes on his wisdom to her. Be it about the need to lean on others during tough times or being responsible with one’s own power, he is the best role model for her to achieve the growth in character that she requires.\\n\\n\r\nZouroku sometimes employs a harsh cranium squeeze to reprimand Sana which goes against his normally calm self, yet those words of his guide her all the same. Unfortunately, he doesn’t have much else going for him. No strong backstory, no outside relationships. In a way, that’s because he’s “been through it all” already, so he (on a life level) does not have much left to gain. Indeed, not only does this whole crazy experience not change him much but also he comes off as oddly unfazed by it all. This direction for his character leaves little room for him in which to express himself, thereby diminishing his presence and his impact within the anime.\\n\\n\r\nNevertheless, by the end of the season, Sana has clearly grown. She may become “frazzled” again in the future, but, with the people in her life looking out for her to support her from here on out, she will surely encounter more opportunities and more happiness, too. All to make her life the one she has always dreamed about.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\n“Wonder Drive,” the opening track to this show, includes a lot of spacey effects and otherworldly noises to produce its sound. It aligns with the alien nature of the Dreams of Alice, and, for at least this reason, the OP has a leg to stand on. Otherwise, the track fills said space with nothing too out of the ordinary. A clapping segment. Some twang from its guitar and a pattering of drums in the background. Vocals that do not overbear the listener but do not engage them either. Altogether, this track isn’t too interesting, but it works in Alice to Zouroku.\\n\\n\r\nIts counterpart, however, is a different, better story. Titled “Chant,” the ending track stands on two legs instead, providing music both intriguing and fun to hear. The acoustic guitar, the xylophone, and the chimes blend together into a simplistic yet whimsical sound that entrances one’s ear. As the instrumentation glides along, the main vocalist’s whisper-like lyrical delivery and the supporting background vocals combine to give the song its happy, gentle vibe. Everything coalesces as an awesome track that’s worthy of playing outside of the anime itself.\\n\\n\r\nLikewise, the original soundtrack also earns props for many of its heartfelt melodies that accompany its scenes. Light piano keys will give way to violin strings that evoke the same swell of emotions. Other times, acoustic guitar plays alongside the piano for a decidedly happier tune. Then singular piano keys will intersperse a warped sound-effect to lightly lay on the tension of a given situation.\\n\\n\r\nBeyond these piano tracks, Alice to Zouroku also provides different musical pieces that follow different moods and segments. An intentionally stumbling song – with dainty xylophone notes, methodical wind instruments, and lazier pipe sounds – creates an airy atmosphere for the slice-of-life scenes. And the occasional jazz tune, with saxophone and light cymbal tapping, dots the show during certain montage moments. The OST may not stand as tall as the ED, but, melody or no, it stands tall nonetheless throughout the season.\\n\\n\r\nAnd not to be ignored, the voice acting involved, while not exactly special, has a couple of examples worthy of pointing out. Hitomi Ohwada as Sana stars in her first major main role, doing well in making Sana not only sound like a young girl but also dabbling into different emotions for her. Not to mention the overall cuteness of her cadence. Likewise, Akio Ootsuka as Zouroku also deserves a shoutout. His gruff tone and respectful anger give his lectures and yells their stern and compassionate edge.\\n\\n\r\nAll in all, with just the OP not leaving too much of a mark on Alice to Zouroku, the music and sound contain some of the best parts to this show even when the other parts available were somewhat of a letdown.\\n\\n\r\nENJOYMENT\\n\\n\r\nMy feelings are conflicted on this one. I like it for two specific reasons, and I don’t like it for one specific reason.\\n\\n\r\nOne of those likes goes to Sana. She is curious, silly, and happy-go-lucky. In other words, she’s a really fun kid character. Her impatience causing her to summon a giant pancake during breakfast to demonstrate the law of conversation of energy. Riding a rocket to chase after the twins in a high-speed, high-flying chase. How she talked about the proper way to drink milk. Quite regularly, her antics and reactions got me laughing.\\n\\n\r\nThe other like goes to her relationship with Zouroku, for she cares a lot about this old man who she randomly ran into. She brings him with her into the nighttime sky for a spectacular view of the world below, and she gleefully goes out of her way to try and show him her new bobbed haircut. In turn, his intentions were always sincere, and her happiness while around him was always infectious.\\n\\n\r\nWhich leads to my number one dislike: Hatori. I get that she’s depressed from living in a household where her parents fight and do not value her much. But she got on my nerves very quickly regardless: all of the drama with her powers, being even slightly mean to Sana. Plus, she’s apparently between eight and ten years old, making her adult behavior about her entire situation difficult for me to take seriously. She’ll choose which kiddy backpack to wear to school but then complain about her philosophical existence or how her mother is “…looking in from a universe of endless darkness.”\\n\\n\r\nBesides my likes and dislikes, the rest of the show somewhat counterbalances itself. Shizuku and Ryuu from the protection agency were cool, but Hatori’s best friend Ayumu was similarly as annoying as her. The magic from the Dreams of Alice seemed interesting, but the powers present didn’t receive a ton of variety or usage. Sanae was a lot of fun, but she took a heavy backseat within the show beyond the second episode.\\n\\n\r\nGiven that my bigger likes and my big dislike also counterbalance each other, my personal takeaway from this anime is neither super positive nor super negative. Overall, it’s just a whole lot of neutral.\\n\\n\r\nAlice to Zouroku unfortunately cannot make its dreams a reality. Misplaced focus on a narrative level, early artistic errors, not enough attention spent on particular characters, and annoying details prevent the show’s heartfelt bonds and nice musical repertoire from materializing. A legacy that falls far short of amazing.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, a lack of focus in its structure and purpose, alongside larger grievances, get in the way Sana and Zouroku’s relationship, arguably the most important part of the narrative\\n\\n\r\nArt & Animation: Fine, while the first episode raises a red flag, the majority of the visuals depict charming designs, nice background art, and okay movement\\n\\n\r\nCharacters: Fine, Sana grows as a kid and as a human through individual experiences and the help of others, especially Zouroku, but he himself does not have much of a presence or an impact\\n\\n\r\nMusic & Sound: Good, a whimsical ED, a melodious OST, and a couple of solid VA performances stand above a passable OP\\n\\n\r\nEnjoyment: Fine, Sana and her relationship with Zouroku are pluses, Hatori is a big minus, and the rest of the elements counterbalance each other\\n\\n\r\nFinal Score: 5/10",
            "date": "2018-03-20T16:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 274395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=274395"
        },
        {
            "content": "SPOILER FREE\r\nTo be honestly, I enjoyed this a lot more than it is objectively good. I have a soft spot for gruff males in anime and Zouroku was by far the best part. Unfortunately, he didn't appear nearly frequently enough and his development ended in the first third of the series. Most of the show is about Sana and her cuteness which admitted gets less annoying as the show progresses. \r\nThe main problem I have with his anime is that it's a potentially great slice of life that tries to have a plot and spends a lot of time on plot without having a plotthat's actually good. Ideas are introduced without much payoff and just die out. The powers the characters have also aren't explained very well and there were several moments when the characters didn't have powers or didn't use them that weren't explained.\\n\\n\r\nThe art style is cute, but the animations is very mediocre and there wasn't even a really poppy opening. Still if you watch the first 2 episodes and like the old man enough, you might be able to pull through this show okay and be mildly entertained.",
            "date": "2017-09-14T19:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 257539,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4785185.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Inspector-Spinda",
                "username": "Inspector-Spinda"
            },
            "url": "https://myanimelist.net/reviews.php?id=257539"
        },
        {
            "content": "Alice to Zouroku is another \"young girls with crazy powers\" type anime, similar to Black Bullet (which I have yet to watch, but need to get around to). I personally had a good time watching it, though there were a few things I wasn't fully behind.\r\nStory: 7/10\r\nThe story itself starts off pretty basic; an escape from a secret laboratory and super power fights. This carries on for the first half of the show. There's strong points to this story type, though. There's an identifiable antagonist, reasonable threat, mysterious origins (although I must say, there was that off-hand mention of experiments being done by the organization.Did I misunderstand that, miss something, or do they never actually cover what that was or satisfy that point at all), all that good stuff. About half way through it switches tone, and a new \"antagonist\" is introduced. I feel like the pacing was fine for the time that it was given, but complete plot switches are always a little disorienting for me.\\n\\n\r\nArt: 8/10\\n\r\nThe art in the show is fine. The battle scenes are general well animated, and the character design is fine (feels a bit like Yuyushiki). If I had to criticize anything, it's the greenscreen-esque background that they use inside the car, which still moves even when the car isn't moving. It's pretty strange. Also, the show makes me want to buy a Snickers and get a burger from Carl's Jr.\\n\\n\r\nSound: 7/10\\n\r\nI'm rather fond of the opening of the show, and the voice actors all do a pretty good job. There's nothing particularly memorable about the in-show OST, however.\\n\\n\r\nCharacter: 7/10\\n\r\nThe children in the show for the most part actually act like children, once they're done acting like god-like beings. Side characters are mostly bland, though. Not enough grandpa, either.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI had a great time watching this show, and felt compelled to continue on at the end of each episode. What can I say, it was great.\\n\\n\r\nOverall: 8/10",
            "date": "2017-08-30T19:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 256576,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6471926.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aliulo",
                "username": "Aliulo"
            },
            "url": "https://myanimelist.net/reviews.php?id=256576"
        },
        {
            "content": "A so/so anime (mildly spoiler-y). \r\nOverall it was a cute little anime, but there were a few things that I feel bring down its rating from a truly \"good\" anime. \r\n1. It left us with many, many questions and very few answers. \r\n2. The tone was all over the place. The beginning has some dark (and VERY dark) scenes, and a clear main story line, but these are funneled out as the anime continues. \r\nEventually the anime feels like any typical cutesy anime with a little girl lead where problems are solved by a down-to-earth adult scolding the thing that is doing wrong. It feltlike they didn't really know what kind of anime they were making, and some scenes feel very disjointed from others. \\n\\n\r\nWould I recommend it? Sure! ...just don't expect a masterpiece or to feel fulfilled after this season. \\n\\n\r\nAll in all I'd say if you're looking for a decent anime that deals with relationships, finding yourself, and questions why each of us exist, and don't mind that the main story leaves a lot to be desired and that there is a serious disconnect in tone between the first third and the last two thirds, then this anime is for you! Enjoy.",
            "date": "2017-08-23T15:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 256121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MmeBear",
                "username": "MmeBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=256121"
        },
        {
            "content": "Having picked the series up a short while after it was released, I followed it as it aired until the 9th episode and left it hanging until I finally decided to finish off the last few episodes. Starting off, it was pretty interesting though it quickly became the slice-of-life anime suggested by the cover picture and description.\r\nStory – 5/10\r\nA chickwith great magical powers, Sana, escapes from a great research facility. Research folks are after her to get her back for the sake of science but some other folks seem to want not for them to get a hold on the girl, for the sake of…uh,idunno. Runaway chick meets an old fella, Zoroku, & so begins their little life together. A retreat from the grand and a coincidental stumble upon a simple yet memorable luxury. \\n\\n\r\nTo sum up, the series begins with a meaninglessly action-packed first few episodes before dulling down into an average cute slice-of-life following Sana’s little journey to live the ordinary magic-free life that she’d always wanted – except she gets hit with philosophy, and otherstuff…oh dear.\\n\\n\r\nCharacter – 7/10\\n\r\nNone of the characters were far from average and almost all of them remained static throughout the story. However, as the title suggests, Sana & Zouroku are the main characters, and they’ve changed a bit throughout the story.\\n\r\nI guess Sana represents the average person when they’re small, having dreams and wanting to change the world, discovering little things about feelings and becoming a little more accepting of others. She starts off alone and emotionless, meets Zouroku and her overadoring granddaughter Sanae, and begins to discover the wonders of a simple life.\\n\r\nZouroku is more of the parent in the parent-child relationship, seeming grumpy but actually being very caring. He begins to soften as he & Sana begin to value their relationship more. He's also a florist, I could say that's symbolic of the tender care parents need to put into taking care of their little ones and making sure they're happy. Probably what a grandparent feels when their kids come to them and say ‘hey mom & dad, I’ve just got a kid, we need to work hard to pay off our mortgage so would you mind taking care of them for a bit?\\n\\n\r\nArt – 6/10\\n\r\nSimple graphics for the most part (see cover picture for an idea of what it looks like) with some nice visual effects and fancy action scenes. To be an analytical freak, I’ll say that the fancy graphics here and there are used to express that ordinary life is just as significant, exciting and troubling as the extravagant life represented by the main character’s extensive magical powers. Am I just overthinking things? Probably.\\n\\n\r\nSound – 7/10\\n\r\nI quite liked this part actually, the background music fit in well with the scenes, particularly reflecting Sana’s emotions. The OP & ED mirrored Sana’s journey as well, those moments when you’re a playful, curious kid and actually have dreams and those moments you learn to consider the feelings of others.\\n\\n\\n\r\nFinal thoughts~\\n\r\nAlice to Zouroku is a cute series blending fantasy and curiosity with reality, reminiscent of our childhood when we learn to discover and everything seems fresh and intriguing. The ideas were average and could have been executed more interestingly and meaningfully. The action packed start made the rest of the series feel very slow-paced and dull. \\n\\n\r\nIf you're looking to be blown away by the magnificently thought-provoking message and enchanted by the powerful and captivating plotline, then this series isn't for you.\\n\r\nHowever, if light, cute and simple stories are your type, I would definitely recommend this series!\\n\\n",
            "date": "2017-07-17T23:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 253116,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634767.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/optex",
                "username": "optex"
            },
            "url": "https://myanimelist.net/reviews.php?id=253116"
        },
        {
            "content": "STORY: \r\nSana escaped from a research facility where she was subjected to take part of various experiments that were deemed dangerous and abusive. Her plan consists of vengeance for the pain that she had to endure. The first few episode was full of intense moments and fighting scenes. Halfway through the series, it died down a bit and all was calm. Then, the last few final episodes became intense again.\r\nCHARACTERS:\r\nSana: The Red Queen, magical and powerful, funny, weird, caring, still a child (especially at heart), anxious and impulsive. \r\nZoroku: Guardian of Sana, grandfather, has old-school mindset, and florist.\r\nOVERALL:\r\nThis anime has caught my eye. Expect alot of references to Alice and Wonderland. The flow of the storyline was really weird and a bit unconventional. Halfway through the series, it felt that it was the finale of the anime. The anime is very cute, funny and full of wonder and weirdness.",
            "date": "2017-07-01T19:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 251704,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=251704"
        },
        {
            "content": "First of all let me tell you, Alice to Zouroku is not your usual anime. It's quite a strange one and the story is kinda intriguing too.\r\nThe anime revolves around people who posses a strange power called 'Alice's Dream'. They can materialize anything they imagine and our MC, Sana happens to be the most powerful of them all. She was bound in a research facility but then escapes and ends up with a grumpy florist called Zouroku. How they bond and become a family is what the story is all about.\r\nFirst, the story is a new one. It is being adapted from a manga ofthe same name, which I have to read at some point of time. The development of characters and strengthening of family bonds play a strong part in this anime, and honestly you'll love it.\\n\\n\r\nAs for the art, it was just horrible in the first episode. That awful CGI made me wash my eyes with bleach and I had planned to drop it. But thankfully, they amped up the animation from the second episode and has improved a LOT. \\n\\n\r\nThe sound is pretty good. The ED is so calm and peaceful that I'm already in love with it. The OP is kinda quirky but it's enjoyable nonetheless.\\n\\n\r\nCharacter development plays a strong part in Alice to Zouroko. We see Sana becoming more adaptive to human emotions and feelings. Zouroku's grumpy but lovable Grandpa is enjoying. There are also some dark characters like Minnie C, who gives of an air of a complete psychotic killer.\\n\\n\r\nAlice to Zouroku ended on a positive note and for once I can say, that I'm happy with the ending. No cliffhangers and no abruptness, the ending was real beautiful.\\n\\n\r\nOverall the enjoyment is pretty good in Alice to Zouroku. While not as good as many other shows this season, Alice to Zouroku manages to hold out on its own and create a place for itself. Watch this show just to see Sana and Zouroku's bonding, trust me, it's really heart warming and enjoyable. \\n",
            "date": "2017-06-28T04:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 251304,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5717953.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stranger_Hanyo",
                "username": "Stranger_Hanyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=251304"
        },
        {
            "content": "I didn’t expect that I would enjoy this anime last winter. It had a unique premise, and the main characters were consists of 1 kid and 1 old man. Totally different from the norm. The storytelling was done really well, even the pacing flowed smoothly through out the series. It had a nice blend of action, comedy, drama and slice-of-life. The animation was rather unique compared to other anime released last winter, but it fits well with the story. The characters were well fleshed out. You’ll even like the suppose antagonists of the story. Indeed, a must watch if you want to relax and enjoya good anime with a solid story.",
            "date": "2018-10-22T00:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 292276,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3763589.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AngelWin14",
                "username": "AngelWin14"
            },
            "url": "https://myanimelist.net/reviews.php?id=292276"
        },
        {
            "content": "Alice to Zouroku is like Madoka Magica, but with a half-baked story.\r\nI don't know if I'm being too kind grading this anime 7, but... It wasn't all that bad (Umaru-chan is worst).\r\nThere's no spoilers, so don't worry.\r\n--Story (6/10)--\r\nThe first episode was 46 minutes long, which means that the story was going to be complex, with much to explain. What I think that ruined the story, was because of that. The 11th (next-to-last) episode ended suddenly, with nothing really happening, and then I thought that the final episode was going to have 46 minutes long too to end the story with a thrilling sensation, with agood climax to finally end the anime. But I was wrong. The 12th episode was only 23 minutes. \\n\\n\r\nRegardless of that, I still felt hope that it would happen something really thrilling, and then the climax. But the end was really superficial, like if the staff of this anime ran out of creativity.\\n\\n\r\nThe story of Alice to Zouroku presented something interesting in the beginning, but in the end, it ended too cliché and too happy. I'm not opposed to happy endings, but it's because some characters were having hard problems to resolve. And it ended as if the problems didn't ever existed.\\n\\n\r\n--Art (9/10)--\\n\\n\r\nThe art remembered me of Madoka Magica, and it was beautiful.\\n\\n\r\n--Sound (9/10)--\\n\\n\r\nThe opening song of this anime is catchy, but the thing is that the song was a little strange to put in the animation.\\n\\n\r\n--Character (7/10)--\\n\\n\r\nThe characters are charismatic, but during some episodes, the title started to lose sense. The name of the anime means \"Alice & Zouroku\", meaning that Zouroku and the main character have a strong connection with each other (I know that the main character isn't called Alice). The thing is: Zouroku isn't that present in the anime. He appears sometimes, but most of the time is only Sana (main character) and the other \"Alice's Dream Girls\". So I think it fits best as \"Alice & Sana\".\\n\\n\r\n--Enjoyment (8/10)--\\n\\n\r\nThe anime was dark and filled with mystery, like Madoka Magica. The first episode was longer than the others, but I didn't realized it much, it was very interesting and I couldn't stop watching it. The thing that ruined was that ending.\\n\\n\r\n--Overall (7/10)--\\n\\n\r\nAlice to Zouroku is a good anime, I spent a good time keeping up with it on crunchyroll. If you want to watch an anime that makes you curious, watch Alice to Zouroku.",
            "date": "2017-07-13T18:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 252777,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6129689.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AmaFa",
                "username": "AmaFa"
            },
            "url": "https://myanimelist.net/reviews.php?id=252777"
        }
    ]
]