[
    [
        {
            "content": "At first glance Kannagi might appear to be just yet another school harem romance comedy and for the most part that’s about all it is.  However once you start it becomes apparent that there is a little more to it to separate it from a genre that is overcrowded by bland and average titles.\r\nThe premise is pretty typical of any other show of this type, only the names and the origins ever seem to change.   Though I did find it to be a bit unique with this one.  Our lead Jin Mikuriya has just completed a wooden sculpture of a treespirit he saw as a boy for his art class.  Shockingly the statue dematerializes and substituted in its place is a girl, Nagi.  Nagi claims to be the god of this area and an amnesiac who needs Jin's help to purge the area of impurities that have arisen because the sacred tree she was bound to has been chopped down.  It’s an amusing start and Nagi herself is instantly lovable as a character.\\n\\n\r\nKannagi's story though soon gets off track.  Instead of developing the stories premise it stars to meander along and becomes basically a slice of life comedy.  Some interesting plot elements that are brought up early seem to be pushed aside and forgotten about altogether.  The ending is also slightly disappointing in that it changes focus again and gets serious and doesn’t really end decisively.  What saves it though is that I really didn’t care because Nagi and many of the supporting cast are just so much damn fun.  There is a lot of great comedy and even though I complain about the poor plot development the episodes, particularly in the middle part of the series, are extremely amusing.  That’s the real charm of Kannagi is that despite it being shallow it has a special feeling about it that makes it stand above most other series of this genre.  Kannagi also manages to be titillating and sexy without resorting to tasteless fan service.  If you’re hoping for a bevy of boobs and panty shots you’re going to be extremely disappointed.\\n\\n\r\nAs with most harem shows the most interesting characters are usually the harem itself and not the male lead.  Kannagi's appeal begins and ends with Nagi.  She carried the show and makes it as interesting as it is.  I find it doubtful that anyone watching this wont love her from the start.  Her personality oozes out from every scene she’s in.  Overall I thought she was pretty unique, moe without being helpless, tsundere without becoming the typical stereotype, and a quirky weirdness without coming across as a Haruhi clone.  Sadly though because of the shows plot failures and slice of life pacing through the middle episodes we just don’t get enough back-story and development a character of this importance deserves.\\n\\n\r\nFor the rest of the harem the reviews are mixed.  Though I found all of them amusing and enjoyable several are archetypes that frankly I am becoming a bit tired of, namely Tsugumi.  You know who she is; the childhood friend who's in love with and secretly pines for the lead.  (usually a tsundere though in this case she’s not)  Girl, I have no sympathy for you.  Admit your damn feelings already or get out of the way!  Zange was also a tired and overused archetype.  She was also poorly developed as none of the issues regarding her characters situation are ever satisfactorily addressed or resolved.  Among the supporting cast, Takako steals the show. As the perverted otaku type she manages to be very funny without feeling like a cliché. \\n\\n\r\nFinally Jin is adequate as the lead.  He manages to not be the dull weakling who has no business attracting this harem of beautiful girls.  Though he certainly has some of those character attributes, I found him to be amusing and interesting.  There is great chemistry between him and Nagi and I really enjoyed watching them interact with one another. Again as with Nagi, there is very little overall development of his character which was disappointing.\\n\\n\r\nThe styling and animation in Kannagi was excellent.  It’s one of the big appeals to this show.  I loved Nagi's look and the settings and fashion designs were really cute.  The voice cast is outstanding and in my opinion the OP animation and musical number is one of the best I have ever seen.  If you watch it and don’t come away wanting to see more then I seriously question your judgment.\\n\\n\r\nKannagi is light on substance but high on enjoyment.  I recommend this show to anyone who is looking for a few hours of mindless entertainment.  Despite its failures with plot and some tired overused character types it stands out as a show that shouldn’t be missed.\\n",
            "date": "2009-10-16T18:08:00+00:00",
            "helpful_count": 189,
            "mal_id": 19741,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=19741"
        },
        {
            "content": "There will be no comparison between this anime and the manga\r\nKannagi is a 13 episode series that drives its plot through comedy and character interaction. When the fall season started, I originally wasn't going to watch this show since the whole goddess popping out of nowhere fiasco has been done numerous times. Once I saw the OP however, I decided to take a look at the first episode and I was definitely glad that I took this up. It takes the conventional \"boy meets girl\" theme and builds it up with plenty of interaction, parody, and drama.\r\nStory: The plot starts off rather strong and fastwith our protagonist, Mikuriya Jin, encountering a goddess called Nagi that has taken its vessel out of a carving Jin made from the local shrine's holy tree. The plot contains no action packed scenes of Nagi trying to banish great evil impurities but it instead drives the plot with comedic devices. The comedy is the show's main driving force. The interactions between the characters are all amusing even if they're bickering over the simplest things. The pure randomness of the humor adds in the extra feel that makes the comedy even all the more funnier.\\n\\n\r\nThe original plot unfortunately gets lost in the middle of the series with several episodes dedicated to nothing but comedic interaction between the characters but it ends with a strong finish in the last two to three episodes.\\n\\n\r\nArt: The animation is not exactly the most crisp and clear cut state-of-the-art work but it's the way the animation flows seamlessly together that makes it great. Each scene has many small intricate movements such as a flick of hair waving about or background characters that actually move to even the sleeve of a shirt moving about in the wind. This makes the scenes appear to be natural and alive, not stiff and lacking.\\n\\n\r\nSound: The soundtrack is not a great memorable collection of BGM that'll have you scrambling for the OST. The high points of it would have to be both the OP and ED. Both of them shows a sharp contrast in how the anime is driven. The upbeat OP details the slice of life and comedic moments while the mellow ED details the seriousness and melancholy of the show. \\n\\n\r\nThe VAs are great too in bringing out the emotions in each scene, whether it be comedic or serious. Tomatsu Haruka not only does a great job at both OP and ED, she truly brings out the character of Nagi straight off the paper.\\n\\n\r\nCharacter: There are only very few characters who actually receives an ample amount of development but the great supporting cast just brings everybody together. The various dialect between the characters just seem natural and it shows a lot of personality to all of them even if they don't have any large amount of development given to them. \\n\\n\r\nAnd not to mention the main male character is actually pretty damn normal (except for his strange ability to see impurities). He's not a hot-headed brawns-over-brains idiot. He's not an annoying arrogant bastard. He's not a self-righteous piece of shit. He's just a completely normal guy who goes to high school. Nagi is a great character herself. She may appear to be slightly arrogant but the way she goes about doing things is just pure hilarious. She'll go off on how she's a great goddess and doesn't get all bitchy when Jin will occasionally smack her upside the side.\\n\\n\r\nKannagi has a great cast of supporting characters too. The supporting characters have some of the best lines in the whole show. From Akiba's &quot;It's a Sony&quot; line to Takako's karaoke concert, the supporting cast gives great development towards the main characters.\\n\\n\r\nEnjoyment/Overall: Kannagi may have had its plot get lost somewhere in the middle, but its comedy more than fulfills its part. It's supported by a great cast of different characters and the different little scenarios they get themselves into is great. Kannagi is a fun little show with some very lulz moments and is able to deliver a strong finish too with its plot.",
            "date": "2008-12-29T01:33:00+00:00",
            "helpful_count": 117,
            "mal_id": 10750,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14970.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wasabi",
                "username": "Wasabi"
            },
            "url": "https://myanimelist.net/reviews.php?id=10750"
        },
        {
            "content": "\"A great series that started with a bang but could have ended better.\"\r\nA first glimpse of Kannagi will make you think the anime is overly simplistic and cliche. Don't be fooled! The everyday comedy throughout the early half of the show, plus the references to certain other anime/show, makes Kannagi a good one-day-marathon candidate. In fact, I would recommend even to those who are not interested to just spend a few hours to watch the entire series (takes no more than 5 hours of your lifetime).\r\nAs to be expected from a 13 episodes series, the story was a bit lacking, especially when attempting to clarifywho Nagi really is at the end. Surprisingly it did not feel like the show was rushed, however the lack of explanation and the blurry conclusion really hurt the show near the end. As expressed by a fellow MAL member, \"...and true the series did take a nose-dive when things got too serious [in the latter half].\" - Master_M2K\\n\\n\r\nBut from a comedy anime perspective, Kannagi was an outstanding piece of art. Of course, there are other factors that also contributed to the overall success of this show as this review continues to break it down into components.\\n\\n\r\nPerhaps the first thing that caught your attention about Kannagi is the high quality animation and superb soundtrack in the OP. Later you may find that the scenery too, are of exceptional quality. But strangely, there seems to be some slight inconsistency with the level of animation throughout the series leading to some attractive looking characters end up looking rather ugly at times. Fortunately, for the most part the background animation quality remain unchanged.\\n\\n\r\nThe CV of Kannagi, while most of them being fairly new to the industry, did a fantastic job in performing each character to their fullest. But if you are knowledgeable in the seiyu world and and are looking for big names, then you will probably be disappointed (well Mai Nakahara being perhaps the only exception, but her role in Kannagi was pretty limited in many ways).\\n\\n\r\nThe main casts have a decent amount of character development in the show at the expense of the side/supporting casts. Most of these developments were through daily interaction with one another as the viewers slowly take a deeper understanding of the general concept of the show. However, it gives the impression that the sidelined characters are somewhat \"hollow\" as very little was actually revealed about them. For instance, it would have been great to actually get a clear view of how Shino actually look with her eyes open.\\n\\n\r\nOverall, Kannagi has proven its worth as one of the more entertaining show of 2008. While it may not top the chart in any particular category, it is still one that should not be missed by any anime lovers or hardcore otaku.",
            "date": "2009-01-30T11:40:00+00:00",
            "helpful_count": 68,
            "mal_id": 11950,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=11950"
        },
        {
            "content": "Kannagi is a Supernatural, Slice of Life, Romantic, Comedy with the kind of story set-up that any hardcore anime fan is familiar with. However this particular anime is highly enjoyable with a unique charm to it that helps justify its fandom.\r\nIt is about a teenage boy Jin Mikuriya, who carves a statue out of a sacred tree and in your typical anime fashion the statue turns into a cute girl, clad with a standard top and extremely short miniskirt. Well this guardian deity is fuming at the fact that her sacred tree was chopped down but with no other choice she decides to intrude uponour unfortunate? young adolescent boy’s life by living with him. Nothing ground-breaking here, just your average abnormal girl cohabiting with an ordinary boy and being mostly filled with random misadventure you’re bound to wonder what makes this 13 episode series so special. Sure I say Kannagi has supernatural and romantic aspects but it’s really just the comedy that makes it such an enjoyable series. With a mix between subtle references that only the otaku would get and the outlandish slap-stick comedy anyone could laugh to, makes this into an anime series with a diverse audience in mind. And to me it is the Nagi in Kannagi that brings such a dull premise to life.\\n\\n\r\nHaruhi needs to take a step down from the podium as there’s a new idol in town and that is Nagi. Sure she is based off some popular character archetypes but her hot, foxy attitude is what makes her so entertaining to watch. Her interactions with the protagonist Jin are some of the highlights of the show and it’s to no surprise that Jin falls into the average teenage boy role but he’s a lot more relatable than most of the losers found in this kind of genre. Sure there are several other characters like Zange-chan & Tsugumi that give the series a harem feel at times but it’s more or less about Nagi & Jin.\\n\\n\r\nAnother strong point of the Kannagi anime series is the animation, as it is almost un-par with some of the quality Kyoto Animation shows. The settings & scenery usually range from the typical high school setting to Jin’s home, but it’s really the character animation that stands out. Their actions & reactions are animated so well and the studio truly does a lot to bring its characters to life. The music and voice acting of Kannagi can be compared to the likes of the Melancholy of Haruhi, as they both have memorable OP & ED themes but their BGM’s uninspiring. This in turn allows the voice actors to shine, most notably Nagi’s voice actor who’s able to pull off the most unique one-liners resulting in some truly hilarious moments.\\n\\n\r\nOverall Kannagi is one of those obscure comedies that come about every year and is destined to be a hit amongst the Japanese & Western audience, like the well-known Lucky Star phenomenon. With all the comedy it is easy to forget what this series was originally about but later on when it tries to remind us; those serious, emo-driven episodes really didn’t feel like a part of the show I fell in love with. Well even though the last 3 episodes disappointed me in some way, this was still a remarkable series that warrants a sequel.\\n",
            "date": "2008-12-30T16:24:00+00:00",
            "helpful_count": 47,
            "mal_id": 10823,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=10823"
        },
        {
            "content": "Editing this review after completing Kannagi...\r\nKannagi deserves a second season. Not just because the storyline hasn't been completely covered by the first season, but because if the same animation and production team carry on adapting whatever is left of the manga in the same vein, we can expect moar enjoyable off-beat humour and crazy antics.\r\nIt is hard to rate the storyline of Kannagi without reading the manga, for this anime follows the manga very very closely. And to be frank, for this first season there wasn't really any story or plot to talk about. We had the introduction of Nagi, followed by her assimilation intoJin's school life. Zange comes into the picture soon enough, then Nagi's elevation into idol-like status, and after which comes a few filler-y episodes that seem thrown in purely for comedic effect, but advance the plot bit by bit, then finally the identity crisis arc near the end. However, the plot does set the tone for the second season (if there is one), asking a few questions, particularly about Nagi's true identity, and uncovers some interesting mysteries that should be answered sooner or later (like Shino Okouchi's eyes, heh)\\n\\n\r\nHowever, you don't watch Kannagi and like it just for the plot. You watch it for the characters. Kannagi is character-driven, not plot-driven. With a rather small cast of about 8 characters, Kannagi manages to give each character their deserved screen-time, and make each character seem important, but at the same time we know just who are the true 'main characters'. Each character has their own quirks and traits that make each of them so likable and lovable. The interaction and dialogue between characters are very well written and scripted, and is one of the reasons why Kannagi is so watchable. Whether it's the pointless but humourous babble, or the arguments between 'lovers', or the heartwarming reunion between Nagi and Jin near the end of the series, all of it seems so heartfelt, so real, and there isn't any of the corniness plaguing other animes at all. \\n\\n\r\nKannagi was a very enjoyable series, I enjoyed every minute while watching it. It was humorous, there was pure slapstick humour, there was also 'thinking' humour, there were the references/parodies of other anime series, and of course, there was THE karaoke singing. I enjoyed the pointless banter between Nagi and Jin. I enjoyed the drama in the final two episodes, and the touching moments between Nagi and Jin near the end, along with encounter with the spirit after that, as Nagi's benevolent side was revealed. IMHO, Nagi steals the show here. Like Haruhi, she's a god behaving (rather) badly. But yet she gives off so much energy and enthusiasm.\\n\\n\r\nThis series impressed me with its fluid animation and crisp art. The characters are all very well animated, with all the little movements that make them seem more human, and there are many fine details to take note of in the background. I particularly like the attention to detail shown whenever the setting moves outdoors to one of the many places in Kannagi City, from the shopping district to the riverbank to the forested shrine, the backgrounds are all very well-drawn.\\n\\n\r\nThe voice-acting is great. Nagi's seiyuu manages to switch between Nagi's many 'split personalities' effortlessly, from sounding like the haughty tsun-dere free-loader to being the polite ideal lady to being her mysterious god-like self, and at the same time, managing to belt out the catchy and energetic OP while also singing the slow and somber ED. Zange's seiyuu manages to flesh out the part of the sexy seductress well. The instrumental version of the OP is surprisingly pleasant, and goes well when played during emotional scenes with its melancholic tones. \\n\\n\r\nThe OP surprised me with Nagi prancing around on stage and its catchy theme at first, and the ED surprised me even more since it was totally opposite to the OP, being slow and somber. It reflects the general mood of the show; it can be both fun and upbeat at times, but also melancholic and slow at times. To be frank, there was a pacing problem - it seemed like all fun and games at the start, only to rush through a rather sad semblance of a plot in 3 episodes near the end, but disregarding all the complaints about the plot and whatnot, Kannagi is a breath of fresh air. Is it slice-of-life? Yes, if you consider free-loading spiritual beings, harems and the sudden appearance of idols in school part of a normal life. It is a comedy, but also a drama, a tale about the supernatural, with some bits of ecchi-ness thrown in.\\n\\n\r\nIMHO, one of the best comedy animes of 2008. I'd would recommend this to everyone, because I can't really see why someone would dislike this.",
            "date": "2008-11-24T19:01:00+00:00",
            "helpful_count": 30,
            "mal_id": 9827,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/supremebull",
                "username": "supremebull"
            },
            "url": "https://myanimelist.net/reviews.php?id=9827"
        },
        {
            "content": "At the time of writing this review, Kannagi has a score of 7.8, which makes me utterly sad.\r\nIn this modern culture of moe-market, things have become rather easy for directors. You want an anime hit? No sweat, add some moe into it and you'll be fine, other aspects like animation, editing and timing could easily be ignored. Please be aware that I'm not against moe (since Kannagi contains a certain amount of it aswell), I just despise how a lot of viewers do not care about seemingly \"unimportant\" aspects. Just entertainment will suffice. What does that conclude? The average viewer gives a score based onhow much they have enjoyed a show, meaning that only the story and the genre count as relevant factors.\\n\\n\r\nLet's not drag on and apply this to Kannagi. \\n\r\nNot many studios these days have the courage to invest in proper animation and editing, because it's simply not rewarding enough in terms of sales. People simply just don't care. However, Kannagi is rather brave on that department. Conversations are really convincing and a joy to watch, because everything happens in realtime. There are no such things as unnecesary camera movements to fill an episode. And that, ladies and gentlemen, gives off an appropiate effect for a slice of life. The time really \"flows\", as the director Yutaka Yamamoto would say.\\n\\n\r\nWhile the graphical elements were more than fine, story-wise, Kannagi lacks the balls to be groundbreaking. Many have noticed, it's not hard to point out the cliched part of the story. The story starts off with a generic female character who appears suddenly in the protagonists' house. As you can guess, this girl, Nagi is not your average girl. She's a deity. Dragging Jin along -our protagonist- in her quest to extinguish evil bugs that taint people's soul, the story heads for a direction of slice of life. Not original, but entertaining. But that's okay. Series don't need original concepts to be interesting (but it sure enough helps), concepts are just a base to start off a story. It's all about the execution. And as I've stated before, Kannagi tells the story in a smooth way.\\n\\n\r\nSpeaking of a concept, the stage with it's goofy characters in a world with deities has been set for a humorus adventure. With a sharp-tongued character like Nagi, the stereotypical-not-so-stereotypical characters like the Akiba-kei who's too selfconscious, a fujoshi club president and her partner, the misinterpret heterosexual, things tend to get over the top hilarious at times.\\n\\n\r\nKannagi has the potential to share the same fate as K-on!, but didn't achieve the same predicament due to circumstances. Which is a shame, because we've got an interesting series on our hands, which definately deserves the chance to shine in it's sequel. It probably will never come, but I always hope for a better tomorrow.",
            "date": "2010-08-29T05:59:00+00:00",
            "helpful_count": 29,
            "mal_id": 30066,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4039.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rethardus",
                "username": "Rethardus"
            },
            "url": "https://myanimelist.net/reviews.php?id=30066"
        },
        {
            "content": "Kannagi. But first:\r\nOne thing I'm going to say about anime in general is that endings, the conclusion to a show, to an anime that satisifies many people are hard to come by. In truth most animes I have seen, even the ones I rate highly have fairly bad endings. Most of the time it's because the manga isn't finished so the anime producers have a hard time ending an anime in a satisfactory manner due to that and they simply have no idea how to end it. It can also be a question of money, perhaps they had a too tight budget, perhaps production expenseswere too high (ex. KareKano).\\n\\n\r\nNow to relate this to Kannagi; Kannagi had a worthless ending. Now I recieved a very ambitious comment about how I don't go into detail about the animes I write reviews about, but what is there to say about a worthless ending? It was unfinished, it was unsatisfactory and it did not fit and the thing is it wasn't even the very end that made the bad ending. If you strap on your criticizing goggles for a minute and think back on the climax before the conclusion to this anime, didn't it feel unnatural to the story?\\n\\n\r\nSomething I've noticed of late about almost any anime, that contains these or similar themes, is that they all suffer from the same syndrome; \"interesting first episode passes over to the thing we've seen 100 times before it ends in something rushed and fairly blurry, often with some sort of flashback/narrating touchy-feely thing\". Yea it's a copyright-pending expression. This anime was no exception.\\n\\n\r\nStill I was entertained from time to time by this anime. It had some nice touches and a few of the characters weren't half bad. They pulled off making characters irrelevant to the story amusing enough to be forgiven for bad character development which is always a plus, especially when making an anime 13 episodes long. The animation and art are good in Kannagi, but it is only to be expected of the producers and animation producers of this show. I don't regret having seen Kannagi, but the entire anime feels like fanservice when fanservice isn't called for. Watch when/if you have the time and want the occasional laugh.",
            "date": "2009-04-03T12:12:00+00:00",
            "helpful_count": 22,
            "mal_id": 13805,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=13805"
        },
        {
            "content": "If broken down to its individual components, there’s hardly anything new presented in Kannagi. An average guy for a protagonist, magical girls, childhood friends, highschool life, convoluted love triangles, otaku references, doses of fanservice, product placement, etc. If I had known earlier that the show contained these, I would have never even bothered to try it out. Fortunately, I was oblivious of this and, having finished the show, I must give credit to its creators for creating a palatable mix of these elements. By featuring a bit of everything without going in too deep and alienating some audiences, I believe they have made a showwith much potential for crossover appeal.\\n\\n\\n\r\nStory: 7\\n\r\nThe premise of the story seems to be heavily dependent on fantasy elements but not (yet) to the same extent as in other shows like Kamichu! or The Melancholy of Haruhi Suzumiya. Most of the series is mainly slice of life in content due to its focus on the characters and their more mundane interactions with each other. Like many other series of this genre, Kannagi’s humor makes use of slapstick comedy, parodies, Easter eggs, cameos, lampshading, 4th wall breaking, completely conspicuous product placement, and a healthy dose of fanservice. Thankfully, they don’t go overboard in terms of quantity or execution so the gags come across as amusing rather than offensive, obscure, or downright stupid. \\n\\n\r\nOccasionally, bits and pieces of the “main story” are served throughout the show, and a very large chunk is thrown in towards the end. The later episodes feature much more drama and viewers who enjoyed the light atmosphere earlier might find this change quite drastic. On the bright side, this allows the story to progress further and character development spikes up at this point. Many questions are left hanging but it gives hope to fans who wish for a second season.\\n\\n\\n\r\nCharacters: 9\\n\r\nSince Kannagi seems to be a character-centered story, it’s only fitting that the show has an interesting bunch for the cast. Much of the humor of the show is fueled by their various and complementary quirks, and even supporting characters get plenty of onscreen time because of this. The two main characters in particular are pretty well-developed. Nagi plays a variety of roles ranging from spoiled and childish to refined and divine, while Jin is much more mature than the typical highschool lead character despite often being labeled as “ordinary” by his seniors.\\n\\n\\n\r\nVisuals: 9\\n\r\nThe Kannagi has few special effects to boast of but the show isn’t lacking when it comes to visuals. The animation of characters in particular was very impressive, and this evident enough from the OP animation alone. The studios certainly didn’t scrimp on frames; the smooth and consistent animation is on par with many movies and the hair movement is so fluid that it reminds me of shampoo commercials. \\n\\n\r\nIn additions to this, ordinary settings are brought to life through minute details. For example, interior shots show various items scattered throughout the room, as in the case of the art club and its cluttered boxes, scattered comics, paintings, busts, beverages, and half-finished drawings. External shots of the town may are close to some real life counterparts with some illustrations bordering on scenery porn. Figures in the background such as pedestrians walking on the other side of the street are also fully animated. \\n\\n\\n\r\nAudio: 8\\n\r\nThe OP and ED songs capture both sides of the main character’s personality. The upbeat motto☆Hade ni ne! features Nagi as a charismatic idol while the soothing Musuhi no Toki is a song fitting for a goddess. \\n\\n\r\nAlthough the rest of the soundtrack isn’t as memorable, it’s more than effective enough in supplementing the mood of the show.\\n\\n\\n\r\nOverall: 9\\n\r\nKannagi is probably one of the most well-rounded comedy series that I’ve seen so far. Besides delivering a truckload of gags, the show offers slices of life, hints of romance, several heartwarming scenes, and even a few bits of trivia regarding otaku culture. In terms of execution, there’s nothing shabby either in the show’s animation, music or direction. Overall, it’s a very enjoyable experience that worth repeating while waiting for a second season.\\n",
            "date": "2008-12-31T10:04:00+00:00",
            "helpful_count": 20,
            "mal_id": 10860,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7639.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yuunagi",
                "username": "Yuunagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=10860"
        },
        {
            "content": "Kannagi is like one heck of a awesome party. You're left with the feeling of a bloody good time where you're too damn drunk and happy to care about the minor details... like who invited you, why you were partying, or how he hell you got there. Sure, it was just generic party, but hey, maybe it was the vodka, maybe the company, but for reason, you loved it.\r\nKannagi exemplifies how brilliant humor and characters may polish even the most cliched plot devices into a worthy gem. The premise of Kannagi is almost capable of inducing many facepalms. A magic girl/god (Nagi), due to someridiculous circumstance, lands into the house of some teenage guy (Jin), who despite his complete lack of experience with the opposite gender, manages to score himself a harem within the next 6 episodes. By now, you can probably fill in the rest of the plot. \\n\\n\r\nIts the details that make Kannagi special.\\n\\n\r\nAlmost every joke in Kannagi appeared somewhere, but few of them have ever been executed so well. From the sheer hilarity of an Otaku who gets offended when anyone assumes that he loves anything remotely anime, to the Art class seniors who speak of forming a `balanced party' of adventurers (artists) to to a boss (cleaning the antic). While the animation and voice acting isn't spectacular, it support the humour perfectly. Its enough to get you drunk with  laughter, enough to forget, and forgive, the rather contrived circumstances that make up Kannagi's plot.\\n\\n\r\nKannagi major weakness is in Episode 11, as it sets up the drama for the final arc. Suddenly that shield of humor is removed. The experience is akin to screaming with an excitement on one of the best rollercoaster rides you've had, only to have it suddenly slow down to 5 miles/hour and transform into a museum tour of ancient Greek literature. The drama isn't bad per se... but the experience is so discontinous that you begin to wonder if you're still watching the same anime.\\n\\n\r\nIn the end, Kanaggi isn't without faults. The plot is thin, the situation cliched, and the final ending, while heart warming, leaves many questions unexplained. Yet, you're unlikely to care given that it is a show that will certainly make you laugh.\\n\\n\r\nKannagi may not be perfect, but it is a perfect execution of an imperfect story.\\n\\n\\n\\n\\n",
            "date": "2009-01-27T10:07:00+00:00",
            "helpful_count": 20,
            "mal_id": 11870,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=11870"
        },
        {
            "content": "I have mixed feelings about this anime. \r\nIt starts off with such potential and draws you in with the character's personalities and the off-beat situations they get themselves into. Then your at the midpoint and things go south.\r\nThe storyline seems to be completely forgotten for a good 4 episodes which in a 13 episode series is unforgivable. The viewer is left with a mountain of unanswered questions and a strong sense of disappointment. There were very funny and risque moments that made me lagh out loud, but at the end it amounts to nothing as this anime is unfinished without a second season to\r\nmakeup forthe midway slump.\\n",
            "date": "2009-07-02T15:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 16372,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/200972.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/pinkninjaichigo",
                "username": "pinkninjaichigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=16372"
        },
        {
            "content": "Well seeing as how I just finished the last episode, it would be best to make a review. Though it is one of the few that I want to make a review for as I have a lot of thoughts that need to be said. That being said, let's continue on. \r\nKannagi is one of a kind romance/comedy anime that really stood out for me. Though some of it's comedy might not be humorous to everyone, once you go over it again I am sure you will understand it. It's not as if it's a slap-stick comedy and it's quite easy to comprehend, it takesyou into a deeper meaning of comedy that is rarely used in most romance/comedy anime. Though that is rarely used in the series itself. But let's get on with the rest. \\n\\n\r\nStory\\n\r\nThough the story seems simplistic and overly cliche, that would be because it is simplistic and overly cliche. It's rather formfitting to be a romance/comedy anime since the main character is introduced and rather instantly a girl appears before him. Though it can never be said that he likes her or she likes him, there are a lot of hints that provide this fact. Apart from the usual &quot;main character gets lots of girls to like him&quot; thing, it's really your average romance anime. What really stood out the most was when overall plot of the story. It's random at best, but because of the randomness stands out the most. Though in the end, they summarize it but it still leaves an ambiguous nature to the story.\\n\\n\r\nArt\\n\r\nI found the art to be quite intriguing. It's not your typical art style and that to me is special. The character drawing and background artwork is simply spectacular. It seemed like a cross of Clannad and Haruhi to me, which are two of my favorite animes as well. Not much to say about the art as I loved it but it was not as in depth as I wanted it to be. At most it can only get up to an 8 in my standards. \\n\\n\r\nSound\\n\r\nAs for the sound, there was not much to make out of it. I did like the opening theme as it was catchy and fun to listen to. It had a nice beat to it and it was nice to sing along (haha yes, I did sing along as I got to know the song). Though the ending didn't really stick with me since the opening was catchy and upbeat. The ending was monotone and had a sad tone to it. It didn't really appeal to me as I found the episodes to be happy and joyful. The background music and overall music for each episodes were plain at best. \\n\\n\r\nCharacters\\n\r\nThe characters are what made me enjoy the anime the most. From the random and quirky Jin to the otaku-in-denial Akiba, the range of characters is always fun to watch. They would get into arbitrary situations, which in the end, would lead to Jin getting embarrassed or harmed in any way possible.  Albeit it seems like any other characters in any other anime, they really stand out the most in terms of how they are introduced. Each character is different in their own way and with different faults/actions/ways that they can be embedded in your brain for a long time. Their antics are always fun to watch and the comical situations they face are endearing. \\n\\n\r\nEnjoyment\\n\r\nWhat can I say. Maybe I am being biased since Nagi/Zange interests me, but I did enjoy each and every episode. Though in some episodes the comedy was rather dry and humorless, it still had some kind of meaning towards the end. \\n\\n\r\nOverall\\n\r\nOverall I gave the anime a 9/10. Because of the characters mostly since they did stand above the rest for me. And it has come to be one of my favorite romance/comedy anime.",
            "date": "2008-12-29T15:32:00+00:00",
            "helpful_count": 15,
            "mal_id": 10783,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11785.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Darkreaper70",
                "username": "Darkreaper70"
            },
            "url": "https://myanimelist.net/reviews.php?id=10783"
        },
        {
            "content": "Compared to other \"slice of life\" anime i've seen, I really can't give it more than a 6.\r\nNow don't get me wrong, a six diesn't mean you can't enjoy the show, it just means it's not amazingly good in every aspect. So, let's start with the good stuff this show has to offer.\r\nThe Good\r\nArt / Animation\r\nKannagi is extremely dynamic, everything moves. The hair, the leaves, the clothes, everything. All that movement give Kannagi a great sinergy and realism. Thanks to that, everything looks pretty natural.\r\nThe colouring in this show is superb. When the mood is happy, everything looks bright and alive, colors seem to jumpout of the screen. When the mood is sad, everything looks grey, heavy, dark, as if someone had tried to wash away all the colors in the world. It helps to converge the feelings of the characters to the viewer.\\n\\n\r\nThe Humor\\n\r\nYou will laugh, probably a lot. If something defines Kannagi is the word \"Laugh\".\\n\r\nSure it has the usual funny misunderstandings that all romantic comedies have: shower scenes, bra size, etc, you know what i mean.\\n\r\nBut it will also manage to turn the most mundane things (like eating dinner, or brushing your teeth) into something really funny. And that's something commendable, not every show can pull that out.\\n\\n\\n\r\nThe Bad\\n\r\nNow, having read all the other reviews i can guess that my review is going to get a lot of \"THIS ISN'T HELPFUL (YOU BASTARD!)\". But it's ok, i embrace my destiny.\\n\r\nI honestly believe that this show is good, just that the synopsis is extremely misleading, and some people might watch the show expecting something that will not be delivered. So i want to warn them about it, so they know what Kannagi is, and what it isn't.\\n\\n\r\nThe Plot Development\\n\r\nThis has to be it's weakest point. It starts awesome, with a great deal of potential. Healthy male teenager lives alone, crafts wooden statue, statue becomes a beautiful female teenager goddess, he has to help her DO SOMETHING, and until THAT is finished they have to live together.\\n\r\nThe problem is that starting from episode 3 and until episode 10, the original plot (discovering what is Nagi?, what is it that she has to do?, what exactly are those bugs that she kills?) is forgotten.\\n\r\nInstead, what you will see is a series of funny episodes, with little to no character development, that have nothing to do with episode 1 premises.\\n\r\nAnd in the final episodes they try to wrap it up, with some rushed and incomplete explanations, that give you the feeling that you have been somehow scammed.\\n\r\nSo to summarize, it starts great but quickly drifts away almost until the end, then unsuccesfully tries to come back and make up for the wasted time with a rather forced, inconclusive ending.\\n\\n\r\nCharacter / Character Development\\n\r\nI know, successful character development is hard to do in a short show. But that's no excuse to do it poorly. Let's start talking about the characters.\\n\r\nZange and Nagi are the only characters that you can't fit in any generic stereotype you have seen one hundred times before. Even if the show won't tell you much about their past, their motivations or basically anything about them, they are very complete, have many aspects, and their actions will surprise you from time to time.\\n\r\nThat being said, the rest of the cast is just a bunch of generic arctypes that you can predict their every dialogue / action. Specially the overused childhood friend.\\n\r\nNow for the char development:\\n\r\nThere isn't any. There, i don't think i can extend very much about this. Believe me, by the time Kannagi ends, you will know little to nothing about any of the characters (male and female lead included). And it's not that you missed anything, even inside the show this lack of background information is addressed.\\n\r\nIf you disagree with this, I would recommend you to watch \"Kore wa Zombie desu Ka?\", \"Gakuen Utopia Manabi Straight\" and \"Suzumiya Haruhi no Yuutso\", and compare their char development with this one. Then you will see that it would be unfair to say there is good char development in Kannagi.\\n\\n\r\nIn clonclusion, I would recommend you this show if you are looking for:\\n\\n\r\n* An enjoyable slice of life with supernatural elements.\\n\r\n* Something to have a good laugh, and don't care much about story.\\n\r\n* Romantic highschool comedy, with female tsundere lead.\\n\\n\r\nI hope that you found my review helpful. Thanks for reading.",
            "date": "2011-05-11T11:02:00+00:00",
            "helpful_count": 15,
            "mal_id": 36913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482401.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Faito",
                "username": "Faito"
            },
            "url": "https://myanimelist.net/reviews.php?id=36913"
        },
        {
            "content": "I wasn&rsquo;t familiar with the manga, but based on the buzz, I had pretty high hopes for Kannagi, and by the end of the season, the show managed to meet and exceed most of those expectations. If you're looking for a zany, episodic, slightly romantic comedy with a lot of heart, Nagi hits the spot.\r\nStory:\r\nI may as well get this out of the way right now, but in case you're wondering, Kannagi isn't a harem anime. With that said, \"crazy shrine maidens\" sums up Kannagi pretty well. Its \"storylines\" from an episode to episode standpoint were comedic gold and occasionally brilliant. The closet ep, thelove square ep, the karaoke ep, the maid cafe ep. Kannagi had the most memorable episodes I&rsquo;ve seen since Haruhi. However, the overarching dramatic storyline faltered as the season went on, as they seemed to forget and move away from storylines they introduced earlier in the season. But that aside, there wasn&rsquo;t a single episode that didn&rsquo;t at least bring a smile to my face at one point, if it didn&rsquo;t leave me in side-splitting laughter.\\n\\n\r\nArt:\\n\r\nI&rsquo;ll always caveat myself by saying I&rsquo;m not an animation expert, but the show looked great to me. Obviously there&rsquo;s no battle scenes or heavy action animation, but all the character designs standout and a lot of attention was paid to the little details and expressions which made it a joy to watch.\\n\\n\r\nSound:\\n\r\nThe OP is great, it&rsquo;s an upbeat song with some cool choreographed dance moves. Otherwise,the music doesn't really standout, the BGM was pretty plain, and the ED is your standard mellow ballad. The only exception would be during the Karoake episode, in which all the songs and performances were pure win.\\n\\n\r\nCharacter:\\n\r\nThe characters are what makes Kannagi so awesome. You&rsquo;ve got a good mix of the standard character stereotypes: the bashful and inexperienced harem guy, the unpredictable, loud-mouthed girl who walks in on the main guy&rsquo;s life, and the insecure childhood best friend. And then you&rsquo;ve got the crazy, zany characters like the light prostituting Nun-cosplay idol, the hardcore otaku, the perverted fujoshi, and the huge, but sensitive art prodigy. They&rsquo;re all loveable and enjoyable on their own merits. But the best part is the relationships between them gives each of them a chance to shine, without it making them seem like they&rsquo;re one-shot, one-dimensional punchlines-in-waiting, which makes them, and the show, that much funnier.\\n\\n\r\nEnjoyment/Overall:\\n\r\nIf it hasn&rsquo;t been clear, I loved this show. It's a light-hearted comedy with a lot of heart that I looked forward to watching every week, because I knew it wouldn&rsquo;t fail to deliver the comedic goods.\\n\\n\r\nI hope this review was helpful to you, if it was/wasn't, i'd love to hear feedback. thanks!",
            "date": "2009-01-01T10:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 10911,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19131.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rabbitpoets",
                "username": "rabbitpoets"
            },
            "url": "https://myanimelist.net/reviews.php?id=10911"
        },
        {
            "content": "Having read the reviews of this anime prior to watching it I was ready for the big \"downturn\" half way through the series that was reported. I personally, didn't see it at all. \r\nKannagi is full of laughs and fan service, serves up plenty of predictable scenes but does it with stellar, crisp art highlighted with a few characters who step outside the box (albeit not the main characters) that keep it from falling into typical harem/comedy cliches. \r\nWhile I enjoyed most of the jokes and the eye candy, the story and romance I had issues with. Of thirteen episodes, eleven of them are mostlydevoid of serious drama and the final two episodes ramp up the emo, drama and \"romance\" so high it blindsides you and causes the complaints about the ending feeling rushes that several reviews have. The romance too felt rushed, undeveloped and shallow. In one episode the main love interest is giggling on the sidelines as she forces the male lead into a \"love square\" that doesn't include her and the next suddenly the two are torn apart, can't live without each other and end up \"let's be together forever\" land within forty minutes. \\n\\n\r\nKannagi is light hearted and entertaining, spiritual at moments but could have benefited greatly from a few more episodes or a bit more direction in the early episodes so that the drama and romance at the end felt less fake and rushed.",
            "date": "2009-06-16T14:05:00+00:00",
            "helpful_count": 10,
            "mal_id": 15806,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/89486.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ainilome",
                "username": "ainilome"
            },
            "url": "https://myanimelist.net/reviews.php?id=15806"
        },
        {
            "content": "Usually, when you carve a wooden sculpture you don’t expect it to turn into a person, right? Well, unfortunately for Jin, that’s not the case. Kannagi is an anime that revolves around the concept of land gods that live inside trees. It seems that the wood that Jin used is actually the trunk of a sacred tree and summons the god Nagi. What a coincidence! Set on these premises, Kannagi starts of wonderfully but for some reason, ends up horribly. Why? Let’s see…\r\nFirst of all, it’s the story. After that coincidence of summoning Nagi, what was supposed to happen next is that they will beexterminating impurities disguised as bugs. Unfortunately, that never happened. What happened is that Kannagi drifted away from its concept of going for a mahou shoujo type anime without the frilly clothes and magic beams flying around. Instead, it opted for a slice of life type anime, complete with some references to series like lucky star and almost completely threw away the concept it created during the first 3 or so episodes. Also, if that wasn’t bad enough, somewhere in the middle it suddenly turns into a harem type anime with three girls competing for the MC. Then during the last couple of episodes or so, they suddenly reverted back to their original concept, in hopes of tying up all of the loose ends. Now, there lies the problem. Kannagi wasn’t able to focus on anything. It kept on switching and switching between genres and in the end, it left without answering any of the questions it raised during progression of the series. Also, besides leaving unanswered questions, it also leaves an open ending, and as a series which left too much to ponder upon, it left a very bitter taste in my mouth. So in the end, the problems of Kannagi lies within its plot; It was indecisive of what it wanted to become and has way to many plotholes. \\n\\n\r\nNow, even though it had a terrible plot, the reason I was able to watch through the entire series is because of the character development and interactions. You can see the characters developing from bland, generic anime characters into somewhat loveable ones, although they are still far from perfect. You see, even though they are loveable, they still resemble some anime stereotypes and are not really all that unique. That isn’t where Kannagi shines though. Where Kannagi truly shines is in the interactions between the characters and the weird situations they are thrown in. These moments are where the characters develop and the story progresses as well as when we get to see the inner thoughts of the characters. Some of these moments can range from something as missing an airing episode of Nagi’s favorite anime up to Jin becoming the subject of gossip of his entire school.  Unfortunately though, these moments don’t really contribute much to the story and only creates and more confusion for the viewers. It does however, manage to entertain despite all of the confusion it creates, so it’s still enjoyable enough to keep me watching.\\n\\n\r\nThat, along the animation and sound of the Kannagi managed to at least make the series somewhat acceptable. The animation was clean, smooth and well-done overall, and with a little touch of moe here and there, it gives a pleasant feeling to watch. The opening,  , had an upbeat and catchy tune to it and the ending has a bit of a mysterious and sad feel to it which was quite contradictory with the opening. The voice acting is also worth mentioning. I gotta give props to Nagi’s voice actor because Nagi’s voice was just, wow. It fits her personality so perfectly that I wouldn’t want it any other way. \\n\\n\r\nNow, even with these good compliments that I made to Kannagi, I still can’t disregard the fact that its plot sucked. Still though, this is in no way a terrible anime. Deep inside me, something is telling me that I might be being biased but really, it made me laugh, it gave me a great time and it gave back a nice amount of entertainment for the time I spent watching it. It still is far from a masterpiece but if you have nothing else to watch and just seek a couple of hours of entertainment, Kannagi could be a good anime to watch. I don’t highly recommend it but if you have some spare time then why not give it a shot? Who knows, you might actually like it.\\n\\n\\n\r\n~ First of all, thanks for reading my review. If you have a different opinion about this anime, feel free to comment. Your criticism will be greatly appreciated, whether good or bad. Also, a simple click on the Helpful button means a lot to me; it feels good to see that my reviews actually help people.~\\n",
            "date": "2012-11-22T07:32:00+00:00",
            "helpful_count": 9,
            "mal_id": 78159,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1463167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nateal",
                "username": "Nateal"
            },
            "url": "https://myanimelist.net/reviews.php?id=78159"
        },
        {
            "content": "Let me state upfront that there are already several outstanding reviews of this show by other members. I would encourage anyone interested in Kannagi to read them as well.\r\nI however have a different opinion regarding the middle episodes, which have been disparaged by several reviewers, because they seem to wander off topic. I like the ‘slice of life’ genre and it is that aspect of this series which I find so engaging. Rather than write about the entire season, I want to focus on one episode in particular [Specifically episode 7]. \r\nSome quick background first. In this show Jin carves a figure of goddess fora high school art project. Unknowingly, the wood Jin used was from a scared tree and the goddess [Nagi] takes on human form. Because the sacred tree had been cut down the goddess has no place to return and ends up living in Jin’s home. Other characters include Tsugumi, a childhood friend who lives next door, various members of the art club from his high school, and Nagi’s sister Zange [also a goddess].\\n\\n\r\nNow back to Episode 7, which oddly is an episode where the main character [Nagi] has locked herself in the closest because she is upset with Jin, and focuses on his efforts to coax her out. The episode works well and does so for three reasons: one it is entertaining, two the story is able to keep our attention, and three it very subtly shows keen insight into the nature of relationships between people. \\n\\n\r\nIt is entertaining using situational humor and dialog, and while it often pokes at the idiosyncrasies of the main characters, it is able to do so in a way that is neither mean spirited nor degrading.  Over the course of the show, the other characters are involved in trying to sooth Nagi’s feeling and coax her out of the closet and while their efforts are both unsuccessful as well as amusing, their concern and their presence is also in itself very endearing.\\n\\n\r\nThe craft of storytelling by the writer is impressive: the original offense committed by Jin is not immediately revealed. Slowly, we are able to piece together that Jin had accidentally erased a taped episode of Nagi's favorite anime show before she watched it. Furthermore we learn that the reason Jin erased it was because he was recording a show with cute kittens that he thought Nagi would like, which he did without consulting her. \\n\\n\r\nBut it is next part that really is impressive because of its insight on people and their relationships.  The shows end with Jin reflecting on his actions and realizing that he had not truly considered her feelings and being able to offer a much more sincere apology. Interestingly, one is left a sense that while Jin has made a step forward, Jin still does not quite completely ‘got it’. Jin is a good person, but Jin had minimized Nagi’s disappoint and hurt because he felt his good intentions were important and should be considered in her reaction to him. In clinging to his self-perception as a ‘good guy’ he behaved poorly, both by being dismissive of Nagi’s feeling and by minimized the harm he had caused, and furthermore he was unaware that it was this behavior more than the original offensive that had left Nagi so angry and frustrated that she had locked herself up in closet.  \\n\\n\r\nAs a side note I tried to explain this episode to my brother and he could not get it, he too had the “it’s no big deal and she should just get over it” attitude (then again he’s not married). \\n\\n\r\nThis is a series that asks a lot of interesting questions and to its credit does not give simple pat solutions. Unfortunately the manga was suspended due the ill health of the author Eri Takenashi. I don’t know if there will ever be a second season or if she will resume the manga. She was fairly young when she wrote it and it may be difficult for her to return to it. In 2010 a spinoff of Kannagi [Kanpachi] was started by her older brother Shinichi Yuhki also a mangaka.\\n",
            "date": "2012-05-11T11:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 61041,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1220889.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bobbyf77",
                "username": "bobbyf77"
            },
            "url": "https://myanimelist.net/reviews.php?id=61041"
        },
        {
            "content": "I'll try not to keep things too long. Having just finished this series, I can say this: Kannagi is an extremely entertaining 13 episode series, and nicely done too. Here's why I think so:\r\nStory: 7/10\r\nI'll admit, in terms of story, Kannagi certainly does not progress much, most of the episodes consists of mainly comedy and slice-of-life aspects that are rather standalone and move the plot slowly. Interesting themes and subjects are brought up but not touched upon frequently enough, I can understand those who were unsatisfied with that.  However I do think that Kannagi's strongest aspects lies not in its plot, but rather thecomedy and interaction of the characters in the series.\\n\\n\r\nArt: 9/10\\n\r\nArt and animation wise, Kannagi excels in this department. I was very impressed with all the fine details given to everything from Nagi scratching her leg occasionally as she sits to hair blowing in the wind to the electronic noise usually present in old analog television sets. Movement is fluid and natural and the characters and their surroundings are drawn consistently every episode. Not many still shots or other effects are used in place of actual movement. \\n\\n\r\nSound: 8/10\\n\r\nThe music used in Kannagi is good, it fits their respective scenes and help add to the overall atmosphere. Th variations of the main theme as well as the instrumental versions of the OP/ED are pleasant to hear and give me nothing to complain about. The OP/ED themselves are catchy and very different from each other. All the voice actors also did an excellent job in bringing their characters and their personalities to life.\\n\\n\r\nCharacter: 9/10\\n\r\nThe cast of Kannagi each have their own unique personalities and quirks, most of which had me laughing as I kept watching. Development wise there isn't too much of that, save for the two main characters of course(even that was not too much). It is the way they interact amongst each other that deserves a 9 for character. There will certainly be someone you can relate to or situation they end up in that remind you of something similar.\\n\\n\r\nEnjoyment: 10/10\\n\r\nIn terms of enjoyment, Kannagi presents lots of it. Each episode has comedy to have you laughing, likeable characters, parodies/references and even some drama to top it all off. Personally I enjoyed every minute of Kannagi and in my honest opinion, you have to stop thinking of its lack of lot development in order to enjoy this series fully.\\n\\n\r\nOverall: 9/10 (10/10 to me, but I'm trying to be more fair here) \\n\r\nOverall, Kannagi is a pleasant, thoroughly enjoyable experiece, be it the slice-of-life situations, comedy,  parody/references to popular culture,  brands and etc. to the characters themselves. Sure, for a 13 episode series the plot barely moved or resolved but honestly with the above mentioned things I feel that they nicely make up for it and is much more enjoyable when you overlook the pacing of the story. Probably one of the most enjoyable anime this year(certainly is to me )\\n\\n\r\nYou are not obligated to fully agree with my ratings and opinions nor does this review truly reflect what this series is like. Hope you enjoyed this review.\\n\\n\r\nP.S. It's a Sony! ;D\\n\\n\\n",
            "date": "2008-12-28T22:17:00+00:00",
            "helpful_count": 6,
            "mal_id": 10740,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22819.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kantarou",
                "username": "Kantarou"
            },
            "url": "https://myanimelist.net/reviews.php?id=10740"
        },
        {
            "content": "Take your typical spineless male protagonist, throw at him a beautiful, immature and almighty goddess and the obligatory annoying childhood friend that has a crush on said male. Add then the evil twin sister of the afore-mentioned almighty goddess that dresses as a nun (because apparently Japanese people find that sexy), surround all of them with some potentially interesting, yet never quite exploited obscure secondary characters and wrap everything up in a fairly pleasant animation, with a commercial theme song. What do we get? Kannagi –a mediocre show that's not particularly bad, yet never gets close to being good either. \r\n\tKannagi starts off of aninteresting premise –Mikuriya Jin, a high school student, carves a sculpture from a holy tree which later turns into the goddess of the area, Nagi. Because people nowadays do not believe in gods as much and because her tree was cut, Nagi is very weakened, and must get rid of roaches –erm, impurities. So far, so good. If only they'd actually follow that plot.\\n\r\n\tUnfortunately, Kannagi seemed to have decided that that is not a successful money bringing strategy, and resorted to your typical ecchi comedy/slice of life/high school anime subplots. You know them; Nagi living with Jin, pretending to be his half-sister (giving a chance to reuse the same over-repeatedly gag of other characters wondering whether they really act towards each other as siblings); the love triangle-square-pentagon whatever (after the presumably gay relationship between Jin and his best friend it really isn't clear anymore); and of course, the obligatory episodes of said genre –bra buying, karaoke singing and so on. Now these might seem exciting if you're new to this kind of anime; sadly, after seeing 20+ series of the same sort, you really cannot help but blame Kannagi for the lack of innovation. What about romance then? Pff, that's really nothing but a lame excuse to bring lots and lots of fanservice. Because why not?\\n\\n\r\n\tIn the end, I'd only recommend this series to people who are generally new to anime and haven't experienced all the cliches this certain genre carries with it.",
            "date": "2015-09-02T17:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 197707,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6077.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sii_Kei",
                "username": "Sii_Kei"
            },
            "url": "https://myanimelist.net/reviews.php?id=197707"
        },
        {
            "content": "Kannagi is quite original in my opinion, it starts out looking like a magical fantasy oriented anime, but immediately transitions into complete comedy/Romance. Kannagi isn&rsquo;t extremely comedic or romantic so I would have to throw it into the slice of life category \r\nStory\r\nLead character is a young boy named Jin who happens to have an acute sense of the spiritual. He one day sculpts an idol of a goddess out of sacred wood that a friend gives him and POOF, out pops a young girl from the sculptures. This girls name is kannagi who happens to believe her self to be a God. From theiron she joins Jin through out his daily life accompanying him to school, the mall and just about everywhere else he goes. For some reason she finds it her duty to rid the world impurities which happen to be evil mysterious bug like creatures that cause misfortune to whom ever they touch. Wait PAUSE, I know most readers are like wah??? But kannagi is a strange anime, it introduces this mystery but gives it very little attention. In fact ridding the world of evil is not first on the to do list for Kannagi, not second but THIRD on Kannagis list of chores. Her first and second goals are finding out more about her mysterious nature and becoming popular among the masses. Now how does a God not know anything about its self is a mystery in itself so don&rsquo;t ask.\\n\\n\r\nChrachters\\n\r\nGreat characters, Kannagi the lead Girl character is quite hilarious and enjoyable to watch. Even the side cast is enjoyable to watch, most situations in this story are very entertaining.\\n\\n\r\nAnimation Sound\\n\r\nAnimation is excellent. Sound on the other hand I&rsquo;m not sure about, this anime has very little sound or music through out its kind of silent at times making the show slow and groggy. \\n\\n\r\nPros\\n\r\n-Hillarious side cast\\n\r\n-Origional Story\\n\r\n-Entertaining plots and situations\\n\\n\r\nCons\\n\r\n-Very slow pace development, some shows get to a drooling level of boredom.\\n\r\n-Weird story to be honest but not horrible\\n\\n\r\nOverall\\n\r\nA good watch especially if you enjoy comedy/romances. If you don&rsquo;t enjoy mysterious magic in your anime don&rsquo;t worry its very minimal in Kannagi. This anime does many things right, it doesn&rsquo;t become to strange or to realistic making it balanced in some way for all audiences really.\\n",
            "date": "2009-01-30T07:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 11946,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91846.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Alderban",
                "username": "Alderban"
            },
            "url": "https://myanimelist.net/reviews.php?id=11946"
        },
        {
            "content": "Kannagi is a little deceptive kind of series: it may look like fantasy at first, yet soon it ends up a harem/moe comedy with insignificant fantasy elements, and well, it isn't nearly as good as some people make it out to be.\r\nSTORY & CHARACTERS\r\nFirst, the major part of the \"plot\" is taken up by endless dialogues about nothing at the pace of a crippled snail. Perhaps, fans of K-On! and similar series may enjoy that, but I personally consider it to be nothing more than a boring waste of time.\r\nSecond, the \"story\" is essentially a generic harem with your cookie-cutter boy-protagonist who allows a girlto live at his place, and how that girl and two other girls compete for his attention. That's the base, and the authors apparently try to add some other aspects to make the anime more entertaining, yet that eventually turns the \"plot\" into a total illogical mess:\\n\r\n- the series starts as fantasy, with the heroine taking on the duty to destroy some shadow creatures because it's supposed to be a purpose of a goddess - to protect the land from the negative energy those creatures are made of; \\n\r\n- then this mission suddenly gets abandoned, and she starts rivaling another goddess for popularity, making the show a parody on pop-idols; \\n\r\n- then this plotline also gets abandoned with no conclusion, and the anime shows several comedy fillers; \\n\r\n- and then out of nowhere it becomes a serious drama. \\n\r\nNone of those parts are logically connected, and nothing gets solved by the end, as the show has an open ending and no sequel whatsoever. Overall, it looks like those who wrote this \"story\" tried to appeal to different groups of viewers but totally failed to tie various elements together and make a proper conclusion.\\n\r\nThird, the only outstanding character here is Nagi - the female lead who somewhat reminds me of Holo from Spice & Wolf: she's cute, very likeable and lots of fun to follow. The other characters aren't nearly as interesting and memorable since they are only some shallow anime stereotypes that never develop into anything.\\n\r\nAll in all, my experience with this \"story\" & characters may be described as boredom with occasional sparks of entertainment when Nagi comes into play with her tricks & shenanigans. Basically, she's the main attraction of the show and the only aspect I truly enjoyed about it.\\n\\n\r\nANIMATION & SOUND\\n\r\nThe animation utilizes fitting colour palette and shows nice fluency of motion. In general, it's good but not really something to brag about. As for the sound department, the voice-acting is quite remarkable, especially when it comes to Nagi who sometimes uses archaic Japanese words in her speech: not only it sounds rather amusing, but it also might be interesting to those who study the language. Sadly, the musical score doesn't match the voice-acting: it's bland and absolutely forgettable except for the ending song.\\n\\n\r\nOVERALL\\n\r\nThe series might be enjoyable if you're ok with the extremely slow pace and the numerous plot issues it has (in other words: if you don't care whether the anime you watch is exciting and has a logical and conclusive plot). As for me, I personally like the comedy fillers: for example, the episode where Nagi locks herself up in the cupboard is very funny indeed. However, the rest of the show is pretty boring and nonsensical.",
            "date": "2016-12-19T10:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 235822,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2270413.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Singan",
                "username": "Singan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235822"
        }
    ],
    [
        {
            "content": "At first glance Kannagi might appear to be just yet another school harem romance comedy and for the most part that’s about all it is.  However once you start it becomes apparent that there is a little more to it to separate it from a genre that is overcrowded by bland and average titles.\r\nThe premise is pretty typical of any other show of this type, only the names and the origins ever seem to change.   Though I did find it to be a bit unique with this one.  Our lead Jin Mikuriya has just completed a wooden sculpture of a treespirit he saw as a boy for his art class.  Shockingly the statue dematerializes and substituted in its place is a girl, Nagi.  Nagi claims to be the god of this area and an amnesiac who needs Jin's help to purge the area of impurities that have arisen because the sacred tree she was bound to has been chopped down.  It’s an amusing start and Nagi herself is instantly lovable as a character.\\n\\n\r\nKannagi's story though soon gets off track.  Instead of developing the stories premise it stars to meander along and becomes basically a slice of life comedy.  Some interesting plot elements that are brought up early seem to be pushed aside and forgotten about altogether.  The ending is also slightly disappointing in that it changes focus again and gets serious and doesn’t really end decisively.  What saves it though is that I really didn’t care because Nagi and many of the supporting cast are just so much damn fun.  There is a lot of great comedy and even though I complain about the poor plot development the episodes, particularly in the middle part of the series, are extremely amusing.  That’s the real charm of Kannagi is that despite it being shallow it has a special feeling about it that makes it stand above most other series of this genre.  Kannagi also manages to be titillating and sexy without resorting to tasteless fan service.  If you’re hoping for a bevy of boobs and panty shots you’re going to be extremely disappointed.\\n\\n\r\nAs with most harem shows the most interesting characters are usually the harem itself and not the male lead.  Kannagi's appeal begins and ends with Nagi.  She carried the show and makes it as interesting as it is.  I find it doubtful that anyone watching this wont love her from the start.  Her personality oozes out from every scene she’s in.  Overall I thought she was pretty unique, moe without being helpless, tsundere without becoming the typical stereotype, and a quirky weirdness without coming across as a Haruhi clone.  Sadly though because of the shows plot failures and slice of life pacing through the middle episodes we just don’t get enough back-story and development a character of this importance deserves.\\n\\n\r\nFor the rest of the harem the reviews are mixed.  Though I found all of them amusing and enjoyable several are archetypes that frankly I am becoming a bit tired of, namely Tsugumi.  You know who she is; the childhood friend who's in love with and secretly pines for the lead.  (usually a tsundere though in this case she’s not)  Girl, I have no sympathy for you.  Admit your damn feelings already or get out of the way!  Zange was also a tired and overused archetype.  She was also poorly developed as none of the issues regarding her characters situation are ever satisfactorily addressed or resolved.  Among the supporting cast, Takako steals the show. As the perverted otaku type she manages to be very funny without feeling like a cliché. \\n\\n\r\nFinally Jin is adequate as the lead.  He manages to not be the dull weakling who has no business attracting this harem of beautiful girls.  Though he certainly has some of those character attributes, I found him to be amusing and interesting.  There is great chemistry between him and Nagi and I really enjoyed watching them interact with one another. Again as with Nagi, there is very little overall development of his character which was disappointing.\\n\\n\r\nThe styling and animation in Kannagi was excellent.  It’s one of the big appeals to this show.  I loved Nagi's look and the settings and fashion designs were really cute.  The voice cast is outstanding and in my opinion the OP animation and musical number is one of the best I have ever seen.  If you watch it and don’t come away wanting to see more then I seriously question your judgment.\\n\\n\r\nKannagi is light on substance but high on enjoyment.  I recommend this show to anyone who is looking for a few hours of mindless entertainment.  Despite its failures with plot and some tired overused character types it stands out as a show that shouldn’t be missed.\\n",
            "date": "2009-10-16T18:08:00+00:00",
            "helpful_count": 189,
            "mal_id": 19741,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=19741"
        },
        {
            "content": "There will be no comparison between this anime and the manga\r\nKannagi is a 13 episode series that drives its plot through comedy and character interaction. When the fall season started, I originally wasn't going to watch this show since the whole goddess popping out of nowhere fiasco has been done numerous times. Once I saw the OP however, I decided to take a look at the first episode and I was definitely glad that I took this up. It takes the conventional \"boy meets girl\" theme and builds it up with plenty of interaction, parody, and drama.\r\nStory: The plot starts off rather strong and fastwith our protagonist, Mikuriya Jin, encountering a goddess called Nagi that has taken its vessel out of a carving Jin made from the local shrine's holy tree. The plot contains no action packed scenes of Nagi trying to banish great evil impurities but it instead drives the plot with comedic devices. The comedy is the show's main driving force. The interactions between the characters are all amusing even if they're bickering over the simplest things. The pure randomness of the humor adds in the extra feel that makes the comedy even all the more funnier.\\n\\n\r\nThe original plot unfortunately gets lost in the middle of the series with several episodes dedicated to nothing but comedic interaction between the characters but it ends with a strong finish in the last two to three episodes.\\n\\n\r\nArt: The animation is not exactly the most crisp and clear cut state-of-the-art work but it's the way the animation flows seamlessly together that makes it great. Each scene has many small intricate movements such as a flick of hair waving about or background characters that actually move to even the sleeve of a shirt moving about in the wind. This makes the scenes appear to be natural and alive, not stiff and lacking.\\n\\n\r\nSound: The soundtrack is not a great memorable collection of BGM that'll have you scrambling for the OST. The high points of it would have to be both the OP and ED. Both of them shows a sharp contrast in how the anime is driven. The upbeat OP details the slice of life and comedic moments while the mellow ED details the seriousness and melancholy of the show. \\n\\n\r\nThe VAs are great too in bringing out the emotions in each scene, whether it be comedic or serious. Tomatsu Haruka not only does a great job at both OP and ED, she truly brings out the character of Nagi straight off the paper.\\n\\n\r\nCharacter: There are only very few characters who actually receives an ample amount of development but the great supporting cast just brings everybody together. The various dialect between the characters just seem natural and it shows a lot of personality to all of them even if they don't have any large amount of development given to them. \\n\\n\r\nAnd not to mention the main male character is actually pretty damn normal (except for his strange ability to see impurities). He's not a hot-headed brawns-over-brains idiot. He's not an annoying arrogant bastard. He's not a self-righteous piece of shit. He's just a completely normal guy who goes to high school. Nagi is a great character herself. She may appear to be slightly arrogant but the way she goes about doing things is just pure hilarious. She'll go off on how she's a great goddess and doesn't get all bitchy when Jin will occasionally smack her upside the side.\\n\\n\r\nKannagi has a great cast of supporting characters too. The supporting characters have some of the best lines in the whole show. From Akiba's &quot;It's a Sony&quot; line to Takako's karaoke concert, the supporting cast gives great development towards the main characters.\\n\\n\r\nEnjoyment/Overall: Kannagi may have had its plot get lost somewhere in the middle, but its comedy more than fulfills its part. It's supported by a great cast of different characters and the different little scenarios they get themselves into is great. Kannagi is a fun little show with some very lulz moments and is able to deliver a strong finish too with its plot.",
            "date": "2008-12-29T01:33:00+00:00",
            "helpful_count": 117,
            "mal_id": 10750,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14970.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wasabi",
                "username": "Wasabi"
            },
            "url": "https://myanimelist.net/reviews.php?id=10750"
        },
        {
            "content": "\"A great series that started with a bang but could have ended better.\"\r\nA first glimpse of Kannagi will make you think the anime is overly simplistic and cliche. Don't be fooled! The everyday comedy throughout the early half of the show, plus the references to certain other anime/show, makes Kannagi a good one-day-marathon candidate. In fact, I would recommend even to those who are not interested to just spend a few hours to watch the entire series (takes no more than 5 hours of your lifetime).\r\nAs to be expected from a 13 episodes series, the story was a bit lacking, especially when attempting to clarifywho Nagi really is at the end. Surprisingly it did not feel like the show was rushed, however the lack of explanation and the blurry conclusion really hurt the show near the end. As expressed by a fellow MAL member, \"...and true the series did take a nose-dive when things got too serious [in the latter half].\" - Master_M2K\\n\\n\r\nBut from a comedy anime perspective, Kannagi was an outstanding piece of art. Of course, there are other factors that also contributed to the overall success of this show as this review continues to break it down into components.\\n\\n\r\nPerhaps the first thing that caught your attention about Kannagi is the high quality animation and superb soundtrack in the OP. Later you may find that the scenery too, are of exceptional quality. But strangely, there seems to be some slight inconsistency with the level of animation throughout the series leading to some attractive looking characters end up looking rather ugly at times. Fortunately, for the most part the background animation quality remain unchanged.\\n\\n\r\nThe CV of Kannagi, while most of them being fairly new to the industry, did a fantastic job in performing each character to their fullest. But if you are knowledgeable in the seiyu world and and are looking for big names, then you will probably be disappointed (well Mai Nakahara being perhaps the only exception, but her role in Kannagi was pretty limited in many ways).\\n\\n\r\nThe main casts have a decent amount of character development in the show at the expense of the side/supporting casts. Most of these developments were through daily interaction with one another as the viewers slowly take a deeper understanding of the general concept of the show. However, it gives the impression that the sidelined characters are somewhat \"hollow\" as very little was actually revealed about them. For instance, it would have been great to actually get a clear view of how Shino actually look with her eyes open.\\n\\n\r\nOverall, Kannagi has proven its worth as one of the more entertaining show of 2008. While it may not top the chart in any particular category, it is still one that should not be missed by any anime lovers or hardcore otaku.",
            "date": "2009-01-30T11:40:00+00:00",
            "helpful_count": 68,
            "mal_id": 11950,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=11950"
        },
        {
            "content": "Kannagi is a Supernatural, Slice of Life, Romantic, Comedy with the kind of story set-up that any hardcore anime fan is familiar with. However this particular anime is highly enjoyable with a unique charm to it that helps justify its fandom.\r\nIt is about a teenage boy Jin Mikuriya, who carves a statue out of a sacred tree and in your typical anime fashion the statue turns into a cute girl, clad with a standard top and extremely short miniskirt. Well this guardian deity is fuming at the fact that her sacred tree was chopped down but with no other choice she decides to intrude uponour unfortunate? young adolescent boy’s life by living with him. Nothing ground-breaking here, just your average abnormal girl cohabiting with an ordinary boy and being mostly filled with random misadventure you’re bound to wonder what makes this 13 episode series so special. Sure I say Kannagi has supernatural and romantic aspects but it’s really just the comedy that makes it such an enjoyable series. With a mix between subtle references that only the otaku would get and the outlandish slap-stick comedy anyone could laugh to, makes this into an anime series with a diverse audience in mind. And to me it is the Nagi in Kannagi that brings such a dull premise to life.\\n\\n\r\nHaruhi needs to take a step down from the podium as there’s a new idol in town and that is Nagi. Sure she is based off some popular character archetypes but her hot, foxy attitude is what makes her so entertaining to watch. Her interactions with the protagonist Jin are some of the highlights of the show and it’s to no surprise that Jin falls into the average teenage boy role but he’s a lot more relatable than most of the losers found in this kind of genre. Sure there are several other characters like Zange-chan & Tsugumi that give the series a harem feel at times but it’s more or less about Nagi & Jin.\\n\\n\r\nAnother strong point of the Kannagi anime series is the animation, as it is almost un-par with some of the quality Kyoto Animation shows. The settings & scenery usually range from the typical high school setting to Jin’s home, but it’s really the character animation that stands out. Their actions & reactions are animated so well and the studio truly does a lot to bring its characters to life. The music and voice acting of Kannagi can be compared to the likes of the Melancholy of Haruhi, as they both have memorable OP & ED themes but their BGM’s uninspiring. This in turn allows the voice actors to shine, most notably Nagi’s voice actor who’s able to pull off the most unique one-liners resulting in some truly hilarious moments.\\n\\n\r\nOverall Kannagi is one of those obscure comedies that come about every year and is destined to be a hit amongst the Japanese & Western audience, like the well-known Lucky Star phenomenon. With all the comedy it is easy to forget what this series was originally about but later on when it tries to remind us; those serious, emo-driven episodes really didn’t feel like a part of the show I fell in love with. Well even though the last 3 episodes disappointed me in some way, this was still a remarkable series that warrants a sequel.\\n",
            "date": "2008-12-30T16:24:00+00:00",
            "helpful_count": 47,
            "mal_id": 10823,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=10823"
        },
        {
            "content": "Editing this review after completing Kannagi...\r\nKannagi deserves a second season. Not just because the storyline hasn't been completely covered by the first season, but because if the same animation and production team carry on adapting whatever is left of the manga in the same vein, we can expect moar enjoyable off-beat humour and crazy antics.\r\nIt is hard to rate the storyline of Kannagi without reading the manga, for this anime follows the manga very very closely. And to be frank, for this first season there wasn't really any story or plot to talk about. We had the introduction of Nagi, followed by her assimilation intoJin's school life. Zange comes into the picture soon enough, then Nagi's elevation into idol-like status, and after which comes a few filler-y episodes that seem thrown in purely for comedic effect, but advance the plot bit by bit, then finally the identity crisis arc near the end. However, the plot does set the tone for the second season (if there is one), asking a few questions, particularly about Nagi's true identity, and uncovers some interesting mysteries that should be answered sooner or later (like Shino Okouchi's eyes, heh)\\n\\n\r\nHowever, you don't watch Kannagi and like it just for the plot. You watch it for the characters. Kannagi is character-driven, not plot-driven. With a rather small cast of about 8 characters, Kannagi manages to give each character their deserved screen-time, and make each character seem important, but at the same time we know just who are the true 'main characters'. Each character has their own quirks and traits that make each of them so likable and lovable. The interaction and dialogue between characters are very well written and scripted, and is one of the reasons why Kannagi is so watchable. Whether it's the pointless but humourous babble, or the arguments between 'lovers', or the heartwarming reunion between Nagi and Jin near the end of the series, all of it seems so heartfelt, so real, and there isn't any of the corniness plaguing other animes at all. \\n\\n\r\nKannagi was a very enjoyable series, I enjoyed every minute while watching it. It was humorous, there was pure slapstick humour, there was also 'thinking' humour, there were the references/parodies of other anime series, and of course, there was THE karaoke singing. I enjoyed the pointless banter between Nagi and Jin. I enjoyed the drama in the final two episodes, and the touching moments between Nagi and Jin near the end, along with encounter with the spirit after that, as Nagi's benevolent side was revealed. IMHO, Nagi steals the show here. Like Haruhi, she's a god behaving (rather) badly. But yet she gives off so much energy and enthusiasm.\\n\\n\r\nThis series impressed me with its fluid animation and crisp art. The characters are all very well animated, with all the little movements that make them seem more human, and there are many fine details to take note of in the background. I particularly like the attention to detail shown whenever the setting moves outdoors to one of the many places in Kannagi City, from the shopping district to the riverbank to the forested shrine, the backgrounds are all very well-drawn.\\n\\n\r\nThe voice-acting is great. Nagi's seiyuu manages to switch between Nagi's many 'split personalities' effortlessly, from sounding like the haughty tsun-dere free-loader to being the polite ideal lady to being her mysterious god-like self, and at the same time, managing to belt out the catchy and energetic OP while also singing the slow and somber ED. Zange's seiyuu manages to flesh out the part of the sexy seductress well. The instrumental version of the OP is surprisingly pleasant, and goes well when played during emotional scenes with its melancholic tones. \\n\\n\r\nThe OP surprised me with Nagi prancing around on stage and its catchy theme at first, and the ED surprised me even more since it was totally opposite to the OP, being slow and somber. It reflects the general mood of the show; it can be both fun and upbeat at times, but also melancholic and slow at times. To be frank, there was a pacing problem - it seemed like all fun and games at the start, only to rush through a rather sad semblance of a plot in 3 episodes near the end, but disregarding all the complaints about the plot and whatnot, Kannagi is a breath of fresh air. Is it slice-of-life? Yes, if you consider free-loading spiritual beings, harems and the sudden appearance of idols in school part of a normal life. It is a comedy, but also a drama, a tale about the supernatural, with some bits of ecchi-ness thrown in.\\n\\n\r\nIMHO, one of the best comedy animes of 2008. I'd would recommend this to everyone, because I can't really see why someone would dislike this.",
            "date": "2008-11-24T19:01:00+00:00",
            "helpful_count": 30,
            "mal_id": 9827,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/supremebull",
                "username": "supremebull"
            },
            "url": "https://myanimelist.net/reviews.php?id=9827"
        },
        {
            "content": "At the time of writing this review, Kannagi has a score of 7.8, which makes me utterly sad.\r\nIn this modern culture of moe-market, things have become rather easy for directors. You want an anime hit? No sweat, add some moe into it and you'll be fine, other aspects like animation, editing and timing could easily be ignored. Please be aware that I'm not against moe (since Kannagi contains a certain amount of it aswell), I just despise how a lot of viewers do not care about seemingly \"unimportant\" aspects. Just entertainment will suffice. What does that conclude? The average viewer gives a score based onhow much they have enjoyed a show, meaning that only the story and the genre count as relevant factors.\\n\\n\r\nLet's not drag on and apply this to Kannagi. \\n\r\nNot many studios these days have the courage to invest in proper animation and editing, because it's simply not rewarding enough in terms of sales. People simply just don't care. However, Kannagi is rather brave on that department. Conversations are really convincing and a joy to watch, because everything happens in realtime. There are no such things as unnecesary camera movements to fill an episode. And that, ladies and gentlemen, gives off an appropiate effect for a slice of life. The time really \"flows\", as the director Yutaka Yamamoto would say.\\n\\n\r\nWhile the graphical elements were more than fine, story-wise, Kannagi lacks the balls to be groundbreaking. Many have noticed, it's not hard to point out the cliched part of the story. The story starts off with a generic female character who appears suddenly in the protagonists' house. As you can guess, this girl, Nagi is not your average girl. She's a deity. Dragging Jin along -our protagonist- in her quest to extinguish evil bugs that taint people's soul, the story heads for a direction of slice of life. Not original, but entertaining. But that's okay. Series don't need original concepts to be interesting (but it sure enough helps), concepts are just a base to start off a story. It's all about the execution. And as I've stated before, Kannagi tells the story in a smooth way.\\n\\n\r\nSpeaking of a concept, the stage with it's goofy characters in a world with deities has been set for a humorus adventure. With a sharp-tongued character like Nagi, the stereotypical-not-so-stereotypical characters like the Akiba-kei who's too selfconscious, a fujoshi club president and her partner, the misinterpret heterosexual, things tend to get over the top hilarious at times.\\n\\n\r\nKannagi has the potential to share the same fate as K-on!, but didn't achieve the same predicament due to circumstances. Which is a shame, because we've got an interesting series on our hands, which definately deserves the chance to shine in it's sequel. It probably will never come, but I always hope for a better tomorrow.",
            "date": "2010-08-29T05:59:00+00:00",
            "helpful_count": 29,
            "mal_id": 30066,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4039.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rethardus",
                "username": "Rethardus"
            },
            "url": "https://myanimelist.net/reviews.php?id=30066"
        },
        {
            "content": "Kannagi. But first:\r\nOne thing I'm going to say about anime in general is that endings, the conclusion to a show, to an anime that satisifies many people are hard to come by. In truth most animes I have seen, even the ones I rate highly have fairly bad endings. Most of the time it's because the manga isn't finished so the anime producers have a hard time ending an anime in a satisfactory manner due to that and they simply have no idea how to end it. It can also be a question of money, perhaps they had a too tight budget, perhaps production expenseswere too high (ex. KareKano).\\n\\n\r\nNow to relate this to Kannagi; Kannagi had a worthless ending. Now I recieved a very ambitious comment about how I don't go into detail about the animes I write reviews about, but what is there to say about a worthless ending? It was unfinished, it was unsatisfactory and it did not fit and the thing is it wasn't even the very end that made the bad ending. If you strap on your criticizing goggles for a minute and think back on the climax before the conclusion to this anime, didn't it feel unnatural to the story?\\n\\n\r\nSomething I've noticed of late about almost any anime, that contains these or similar themes, is that they all suffer from the same syndrome; \"interesting first episode passes over to the thing we've seen 100 times before it ends in something rushed and fairly blurry, often with some sort of flashback/narrating touchy-feely thing\". Yea it's a copyright-pending expression. This anime was no exception.\\n\\n\r\nStill I was entertained from time to time by this anime. It had some nice touches and a few of the characters weren't half bad. They pulled off making characters irrelevant to the story amusing enough to be forgiven for bad character development which is always a plus, especially when making an anime 13 episodes long. The animation and art are good in Kannagi, but it is only to be expected of the producers and animation producers of this show. I don't regret having seen Kannagi, but the entire anime feels like fanservice when fanservice isn't called for. Watch when/if you have the time and want the occasional laugh.",
            "date": "2009-04-03T12:12:00+00:00",
            "helpful_count": 22,
            "mal_id": 13805,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=13805"
        },
        {
            "content": "If broken down to its individual components, there’s hardly anything new presented in Kannagi. An average guy for a protagonist, magical girls, childhood friends, highschool life, convoluted love triangles, otaku references, doses of fanservice, product placement, etc. If I had known earlier that the show contained these, I would have never even bothered to try it out. Fortunately, I was oblivious of this and, having finished the show, I must give credit to its creators for creating a palatable mix of these elements. By featuring a bit of everything without going in too deep and alienating some audiences, I believe they have made a showwith much potential for crossover appeal.\\n\\n\\n\r\nStory: 7\\n\r\nThe premise of the story seems to be heavily dependent on fantasy elements but not (yet) to the same extent as in other shows like Kamichu! or The Melancholy of Haruhi Suzumiya. Most of the series is mainly slice of life in content due to its focus on the characters and their more mundane interactions with each other. Like many other series of this genre, Kannagi’s humor makes use of slapstick comedy, parodies, Easter eggs, cameos, lampshading, 4th wall breaking, completely conspicuous product placement, and a healthy dose of fanservice. Thankfully, they don’t go overboard in terms of quantity or execution so the gags come across as amusing rather than offensive, obscure, or downright stupid. \\n\\n\r\nOccasionally, bits and pieces of the “main story” are served throughout the show, and a very large chunk is thrown in towards the end. The later episodes feature much more drama and viewers who enjoyed the light atmosphere earlier might find this change quite drastic. On the bright side, this allows the story to progress further and character development spikes up at this point. Many questions are left hanging but it gives hope to fans who wish for a second season.\\n\\n\\n\r\nCharacters: 9\\n\r\nSince Kannagi seems to be a character-centered story, it’s only fitting that the show has an interesting bunch for the cast. Much of the humor of the show is fueled by their various and complementary quirks, and even supporting characters get plenty of onscreen time because of this. The two main characters in particular are pretty well-developed. Nagi plays a variety of roles ranging from spoiled and childish to refined and divine, while Jin is much more mature than the typical highschool lead character despite often being labeled as “ordinary” by his seniors.\\n\\n\\n\r\nVisuals: 9\\n\r\nThe Kannagi has few special effects to boast of but the show isn’t lacking when it comes to visuals. The animation of characters in particular was very impressive, and this evident enough from the OP animation alone. The studios certainly didn’t scrimp on frames; the smooth and consistent animation is on par with many movies and the hair movement is so fluid that it reminds me of shampoo commercials. \\n\\n\r\nIn additions to this, ordinary settings are brought to life through minute details. For example, interior shots show various items scattered throughout the room, as in the case of the art club and its cluttered boxes, scattered comics, paintings, busts, beverages, and half-finished drawings. External shots of the town may are close to some real life counterparts with some illustrations bordering on scenery porn. Figures in the background such as pedestrians walking on the other side of the street are also fully animated. \\n\\n\\n\r\nAudio: 8\\n\r\nThe OP and ED songs capture both sides of the main character’s personality. The upbeat motto☆Hade ni ne! features Nagi as a charismatic idol while the soothing Musuhi no Toki is a song fitting for a goddess. \\n\\n\r\nAlthough the rest of the soundtrack isn’t as memorable, it’s more than effective enough in supplementing the mood of the show.\\n\\n\\n\r\nOverall: 9\\n\r\nKannagi is probably one of the most well-rounded comedy series that I’ve seen so far. Besides delivering a truckload of gags, the show offers slices of life, hints of romance, several heartwarming scenes, and even a few bits of trivia regarding otaku culture. In terms of execution, there’s nothing shabby either in the show’s animation, music or direction. Overall, it’s a very enjoyable experience that worth repeating while waiting for a second season.\\n",
            "date": "2008-12-31T10:04:00+00:00",
            "helpful_count": 20,
            "mal_id": 10860,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7639.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yuunagi",
                "username": "Yuunagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=10860"
        },
        {
            "content": "Kannagi is like one heck of a awesome party. You're left with the feeling of a bloody good time where you're too damn drunk and happy to care about the minor details... like who invited you, why you were partying, or how he hell you got there. Sure, it was just generic party, but hey, maybe it was the vodka, maybe the company, but for reason, you loved it.\r\nKannagi exemplifies how brilliant humor and characters may polish even the most cliched plot devices into a worthy gem. The premise of Kannagi is almost capable of inducing many facepalms. A magic girl/god (Nagi), due to someridiculous circumstance, lands into the house of some teenage guy (Jin), who despite his complete lack of experience with the opposite gender, manages to score himself a harem within the next 6 episodes. By now, you can probably fill in the rest of the plot. \\n\\n\r\nIts the details that make Kannagi special.\\n\\n\r\nAlmost every joke in Kannagi appeared somewhere, but few of them have ever been executed so well. From the sheer hilarity of an Otaku who gets offended when anyone assumes that he loves anything remotely anime, to the Art class seniors who speak of forming a `balanced party' of adventurers (artists) to to a boss (cleaning the antic). While the animation and voice acting isn't spectacular, it support the humour perfectly. Its enough to get you drunk with  laughter, enough to forget, and forgive, the rather contrived circumstances that make up Kannagi's plot.\\n\\n\r\nKannagi major weakness is in Episode 11, as it sets up the drama for the final arc. Suddenly that shield of humor is removed. The experience is akin to screaming with an excitement on one of the best rollercoaster rides you've had, only to have it suddenly slow down to 5 miles/hour and transform into a museum tour of ancient Greek literature. The drama isn't bad per se... but the experience is so discontinous that you begin to wonder if you're still watching the same anime.\\n\\n\r\nIn the end, Kanaggi isn't without faults. The plot is thin, the situation cliched, and the final ending, while heart warming, leaves many questions unexplained. Yet, you're unlikely to care given that it is a show that will certainly make you laugh.\\n\\n\r\nKannagi may not be perfect, but it is a perfect execution of an imperfect story.\\n\\n\\n\\n\\n",
            "date": "2009-01-27T10:07:00+00:00",
            "helpful_count": 20,
            "mal_id": 11870,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=11870"
        },
        {
            "content": "I have mixed feelings about this anime. \r\nIt starts off with such potential and draws you in with the character's personalities and the off-beat situations they get themselves into. Then your at the midpoint and things go south.\r\nThe storyline seems to be completely forgotten for a good 4 episodes which in a 13 episode series is unforgivable. The viewer is left with a mountain of unanswered questions and a strong sense of disappointment. There were very funny and risque moments that made me lagh out loud, but at the end it amounts to nothing as this anime is unfinished without a second season to\r\nmakeup forthe midway slump.\\n",
            "date": "2009-07-02T15:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 16372,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/200972.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/pinkninjaichigo",
                "username": "pinkninjaichigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=16372"
        },
        {
            "content": "Well seeing as how I just finished the last episode, it would be best to make a review. Though it is one of the few that I want to make a review for as I have a lot of thoughts that need to be said. That being said, let's continue on. \r\nKannagi is one of a kind romance/comedy anime that really stood out for me. Though some of it's comedy might not be humorous to everyone, once you go over it again I am sure you will understand it. It's not as if it's a slap-stick comedy and it's quite easy to comprehend, it takesyou into a deeper meaning of comedy that is rarely used in most romance/comedy anime. Though that is rarely used in the series itself. But let's get on with the rest. \\n\\n\r\nStory\\n\r\nThough the story seems simplistic and overly cliche, that would be because it is simplistic and overly cliche. It's rather formfitting to be a romance/comedy anime since the main character is introduced and rather instantly a girl appears before him. Though it can never be said that he likes her or she likes him, there are a lot of hints that provide this fact. Apart from the usual &quot;main character gets lots of girls to like him&quot; thing, it's really your average romance anime. What really stood out the most was when overall plot of the story. It's random at best, but because of the randomness stands out the most. Though in the end, they summarize it but it still leaves an ambiguous nature to the story.\\n\\n\r\nArt\\n\r\nI found the art to be quite intriguing. It's not your typical art style and that to me is special. The character drawing and background artwork is simply spectacular. It seemed like a cross of Clannad and Haruhi to me, which are two of my favorite animes as well. Not much to say about the art as I loved it but it was not as in depth as I wanted it to be. At most it can only get up to an 8 in my standards. \\n\\n\r\nSound\\n\r\nAs for the sound, there was not much to make out of it. I did like the opening theme as it was catchy and fun to listen to. It had a nice beat to it and it was nice to sing along (haha yes, I did sing along as I got to know the song). Though the ending didn't really stick with me since the opening was catchy and upbeat. The ending was monotone and had a sad tone to it. It didn't really appeal to me as I found the episodes to be happy and joyful. The background music and overall music for each episodes were plain at best. \\n\\n\r\nCharacters\\n\r\nThe characters are what made me enjoy the anime the most. From the random and quirky Jin to the otaku-in-denial Akiba, the range of characters is always fun to watch. They would get into arbitrary situations, which in the end, would lead to Jin getting embarrassed or harmed in any way possible.  Albeit it seems like any other characters in any other anime, they really stand out the most in terms of how they are introduced. Each character is different in their own way and with different faults/actions/ways that they can be embedded in your brain for a long time. Their antics are always fun to watch and the comical situations they face are endearing. \\n\\n\r\nEnjoyment\\n\r\nWhat can I say. Maybe I am being biased since Nagi/Zange interests me, but I did enjoy each and every episode. Though in some episodes the comedy was rather dry and humorless, it still had some kind of meaning towards the end. \\n\\n\r\nOverall\\n\r\nOverall I gave the anime a 9/10. Because of the characters mostly since they did stand above the rest for me. And it has come to be one of my favorite romance/comedy anime.",
            "date": "2008-12-29T15:32:00+00:00",
            "helpful_count": 15,
            "mal_id": 10783,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11785.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Darkreaper70",
                "username": "Darkreaper70"
            },
            "url": "https://myanimelist.net/reviews.php?id=10783"
        },
        {
            "content": "Compared to other \"slice of life\" anime i've seen, I really can't give it more than a 6.\r\nNow don't get me wrong, a six diesn't mean you can't enjoy the show, it just means it's not amazingly good in every aspect. So, let's start with the good stuff this show has to offer.\r\nThe Good\r\nArt / Animation\r\nKannagi is extremely dynamic, everything moves. The hair, the leaves, the clothes, everything. All that movement give Kannagi a great sinergy and realism. Thanks to that, everything looks pretty natural.\r\nThe colouring in this show is superb. When the mood is happy, everything looks bright and alive, colors seem to jumpout of the screen. When the mood is sad, everything looks grey, heavy, dark, as if someone had tried to wash away all the colors in the world. It helps to converge the feelings of the characters to the viewer.\\n\\n\r\nThe Humor\\n\r\nYou will laugh, probably a lot. If something defines Kannagi is the word \"Laugh\".\\n\r\nSure it has the usual funny misunderstandings that all romantic comedies have: shower scenes, bra size, etc, you know what i mean.\\n\r\nBut it will also manage to turn the most mundane things (like eating dinner, or brushing your teeth) into something really funny. And that's something commendable, not every show can pull that out.\\n\\n\\n\r\nThe Bad\\n\r\nNow, having read all the other reviews i can guess that my review is going to get a lot of \"THIS ISN'T HELPFUL (YOU BASTARD!)\". But it's ok, i embrace my destiny.\\n\r\nI honestly believe that this show is good, just that the synopsis is extremely misleading, and some people might watch the show expecting something that will not be delivered. So i want to warn them about it, so they know what Kannagi is, and what it isn't.\\n\\n\r\nThe Plot Development\\n\r\nThis has to be it's weakest point. It starts awesome, with a great deal of potential. Healthy male teenager lives alone, crafts wooden statue, statue becomes a beautiful female teenager goddess, he has to help her DO SOMETHING, and until THAT is finished they have to live together.\\n\r\nThe problem is that starting from episode 3 and until episode 10, the original plot (discovering what is Nagi?, what is it that she has to do?, what exactly are those bugs that she kills?) is forgotten.\\n\r\nInstead, what you will see is a series of funny episodes, with little to no character development, that have nothing to do with episode 1 premises.\\n\r\nAnd in the final episodes they try to wrap it up, with some rushed and incomplete explanations, that give you the feeling that you have been somehow scammed.\\n\r\nSo to summarize, it starts great but quickly drifts away almost until the end, then unsuccesfully tries to come back and make up for the wasted time with a rather forced, inconclusive ending.\\n\\n\r\nCharacter / Character Development\\n\r\nI know, successful character development is hard to do in a short show. But that's no excuse to do it poorly. Let's start talking about the characters.\\n\r\nZange and Nagi are the only characters that you can't fit in any generic stereotype you have seen one hundred times before. Even if the show won't tell you much about their past, their motivations or basically anything about them, they are very complete, have many aspects, and their actions will surprise you from time to time.\\n\r\nThat being said, the rest of the cast is just a bunch of generic arctypes that you can predict their every dialogue / action. Specially the overused childhood friend.\\n\r\nNow for the char development:\\n\r\nThere isn't any. There, i don't think i can extend very much about this. Believe me, by the time Kannagi ends, you will know little to nothing about any of the characters (male and female lead included). And it's not that you missed anything, even inside the show this lack of background information is addressed.\\n\r\nIf you disagree with this, I would recommend you to watch \"Kore wa Zombie desu Ka?\", \"Gakuen Utopia Manabi Straight\" and \"Suzumiya Haruhi no Yuutso\", and compare their char development with this one. Then you will see that it would be unfair to say there is good char development in Kannagi.\\n\\n\r\nIn clonclusion, I would recommend you this show if you are looking for:\\n\\n\r\n* An enjoyable slice of life with supernatural elements.\\n\r\n* Something to have a good laugh, and don't care much about story.\\n\r\n* Romantic highschool comedy, with female tsundere lead.\\n\\n\r\nI hope that you found my review helpful. Thanks for reading.",
            "date": "2011-05-11T11:02:00+00:00",
            "helpful_count": 15,
            "mal_id": 36913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482401.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Faito",
                "username": "Faito"
            },
            "url": "https://myanimelist.net/reviews.php?id=36913"
        },
        {
            "content": "I wasn&rsquo;t familiar with the manga, but based on the buzz, I had pretty high hopes for Kannagi, and by the end of the season, the show managed to meet and exceed most of those expectations. If you're looking for a zany, episodic, slightly romantic comedy with a lot of heart, Nagi hits the spot.\r\nStory:\r\nI may as well get this out of the way right now, but in case you're wondering, Kannagi isn't a harem anime. With that said, \"crazy shrine maidens\" sums up Kannagi pretty well. Its \"storylines\" from an episode to episode standpoint were comedic gold and occasionally brilliant. The closet ep, thelove square ep, the karaoke ep, the maid cafe ep. Kannagi had the most memorable episodes I&rsquo;ve seen since Haruhi. However, the overarching dramatic storyline faltered as the season went on, as they seemed to forget and move away from storylines they introduced earlier in the season. But that aside, there wasn&rsquo;t a single episode that didn&rsquo;t at least bring a smile to my face at one point, if it didn&rsquo;t leave me in side-splitting laughter.\\n\\n\r\nArt:\\n\r\nI&rsquo;ll always caveat myself by saying I&rsquo;m not an animation expert, but the show looked great to me. Obviously there&rsquo;s no battle scenes or heavy action animation, but all the character designs standout and a lot of attention was paid to the little details and expressions which made it a joy to watch.\\n\\n\r\nSound:\\n\r\nThe OP is great, it&rsquo;s an upbeat song with some cool choreographed dance moves. Otherwise,the music doesn't really standout, the BGM was pretty plain, and the ED is your standard mellow ballad. The only exception would be during the Karoake episode, in which all the songs and performances were pure win.\\n\\n\r\nCharacter:\\n\r\nThe characters are what makes Kannagi so awesome. You&rsquo;ve got a good mix of the standard character stereotypes: the bashful and inexperienced harem guy, the unpredictable, loud-mouthed girl who walks in on the main guy&rsquo;s life, and the insecure childhood best friend. And then you&rsquo;ve got the crazy, zany characters like the light prostituting Nun-cosplay idol, the hardcore otaku, the perverted fujoshi, and the huge, but sensitive art prodigy. They&rsquo;re all loveable and enjoyable on their own merits. But the best part is the relationships between them gives each of them a chance to shine, without it making them seem like they&rsquo;re one-shot, one-dimensional punchlines-in-waiting, which makes them, and the show, that much funnier.\\n\\n\r\nEnjoyment/Overall:\\n\r\nIf it hasn&rsquo;t been clear, I loved this show. It's a light-hearted comedy with a lot of heart that I looked forward to watching every week, because I knew it wouldn&rsquo;t fail to deliver the comedic goods.\\n\\n\r\nI hope this review was helpful to you, if it was/wasn't, i'd love to hear feedback. thanks!",
            "date": "2009-01-01T10:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 10911,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19131.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rabbitpoets",
                "username": "rabbitpoets"
            },
            "url": "https://myanimelist.net/reviews.php?id=10911"
        },
        {
            "content": "Having read the reviews of this anime prior to watching it I was ready for the big \"downturn\" half way through the series that was reported. I personally, didn't see it at all. \r\nKannagi is full of laughs and fan service, serves up plenty of predictable scenes but does it with stellar, crisp art highlighted with a few characters who step outside the box (albeit not the main characters) that keep it from falling into typical harem/comedy cliches. \r\nWhile I enjoyed most of the jokes and the eye candy, the story and romance I had issues with. Of thirteen episodes, eleven of them are mostlydevoid of serious drama and the final two episodes ramp up the emo, drama and \"romance\" so high it blindsides you and causes the complaints about the ending feeling rushes that several reviews have. The romance too felt rushed, undeveloped and shallow. In one episode the main love interest is giggling on the sidelines as she forces the male lead into a \"love square\" that doesn't include her and the next suddenly the two are torn apart, can't live without each other and end up \"let's be together forever\" land within forty minutes. \\n\\n\r\nKannagi is light hearted and entertaining, spiritual at moments but could have benefited greatly from a few more episodes or a bit more direction in the early episodes so that the drama and romance at the end felt less fake and rushed.",
            "date": "2009-06-16T14:05:00+00:00",
            "helpful_count": 10,
            "mal_id": 15806,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/89486.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ainilome",
                "username": "ainilome"
            },
            "url": "https://myanimelist.net/reviews.php?id=15806"
        },
        {
            "content": "Usually, when you carve a wooden sculpture you don’t expect it to turn into a person, right? Well, unfortunately for Jin, that’s not the case. Kannagi is an anime that revolves around the concept of land gods that live inside trees. It seems that the wood that Jin used is actually the trunk of a sacred tree and summons the god Nagi. What a coincidence! Set on these premises, Kannagi starts of wonderfully but for some reason, ends up horribly. Why? Let’s see…\r\nFirst of all, it’s the story. After that coincidence of summoning Nagi, what was supposed to happen next is that they will beexterminating impurities disguised as bugs. Unfortunately, that never happened. What happened is that Kannagi drifted away from its concept of going for a mahou shoujo type anime without the frilly clothes and magic beams flying around. Instead, it opted for a slice of life type anime, complete with some references to series like lucky star and almost completely threw away the concept it created during the first 3 or so episodes. Also, if that wasn’t bad enough, somewhere in the middle it suddenly turns into a harem type anime with three girls competing for the MC. Then during the last couple of episodes or so, they suddenly reverted back to their original concept, in hopes of tying up all of the loose ends. Now, there lies the problem. Kannagi wasn’t able to focus on anything. It kept on switching and switching between genres and in the end, it left without answering any of the questions it raised during progression of the series. Also, besides leaving unanswered questions, it also leaves an open ending, and as a series which left too much to ponder upon, it left a very bitter taste in my mouth. So in the end, the problems of Kannagi lies within its plot; It was indecisive of what it wanted to become and has way to many plotholes. \\n\\n\r\nNow, even though it had a terrible plot, the reason I was able to watch through the entire series is because of the character development and interactions. You can see the characters developing from bland, generic anime characters into somewhat loveable ones, although they are still far from perfect. You see, even though they are loveable, they still resemble some anime stereotypes and are not really all that unique. That isn’t where Kannagi shines though. Where Kannagi truly shines is in the interactions between the characters and the weird situations they are thrown in. These moments are where the characters develop and the story progresses as well as when we get to see the inner thoughts of the characters. Some of these moments can range from something as missing an airing episode of Nagi’s favorite anime up to Jin becoming the subject of gossip of his entire school.  Unfortunately though, these moments don’t really contribute much to the story and only creates and more confusion for the viewers. It does however, manage to entertain despite all of the confusion it creates, so it’s still enjoyable enough to keep me watching.\\n\\n\r\nThat, along the animation and sound of the Kannagi managed to at least make the series somewhat acceptable. The animation was clean, smooth and well-done overall, and with a little touch of moe here and there, it gives a pleasant feeling to watch. The opening,  , had an upbeat and catchy tune to it and the ending has a bit of a mysterious and sad feel to it which was quite contradictory with the opening. The voice acting is also worth mentioning. I gotta give props to Nagi’s voice actor because Nagi’s voice was just, wow. It fits her personality so perfectly that I wouldn’t want it any other way. \\n\\n\r\nNow, even with these good compliments that I made to Kannagi, I still can’t disregard the fact that its plot sucked. Still though, this is in no way a terrible anime. Deep inside me, something is telling me that I might be being biased but really, it made me laugh, it gave me a great time and it gave back a nice amount of entertainment for the time I spent watching it. It still is far from a masterpiece but if you have nothing else to watch and just seek a couple of hours of entertainment, Kannagi could be a good anime to watch. I don’t highly recommend it but if you have some spare time then why not give it a shot? Who knows, you might actually like it.\\n\\n\\n\r\n~ First of all, thanks for reading my review. If you have a different opinion about this anime, feel free to comment. Your criticism will be greatly appreciated, whether good or bad. Also, a simple click on the Helpful button means a lot to me; it feels good to see that my reviews actually help people.~\\n",
            "date": "2012-11-22T07:32:00+00:00",
            "helpful_count": 9,
            "mal_id": 78159,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1463167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nateal",
                "username": "Nateal"
            },
            "url": "https://myanimelist.net/reviews.php?id=78159"
        },
        {
            "content": "Let me state upfront that there are already several outstanding reviews of this show by other members. I would encourage anyone interested in Kannagi to read them as well.\r\nI however have a different opinion regarding the middle episodes, which have been disparaged by several reviewers, because they seem to wander off topic. I like the ‘slice of life’ genre and it is that aspect of this series which I find so engaging. Rather than write about the entire season, I want to focus on one episode in particular [Specifically episode 7]. \r\nSome quick background first. In this show Jin carves a figure of goddess fora high school art project. Unknowingly, the wood Jin used was from a scared tree and the goddess [Nagi] takes on human form. Because the sacred tree had been cut down the goddess has no place to return and ends up living in Jin’s home. Other characters include Tsugumi, a childhood friend who lives next door, various members of the art club from his high school, and Nagi’s sister Zange [also a goddess].\\n\\n\r\nNow back to Episode 7, which oddly is an episode where the main character [Nagi] has locked herself in the closest because she is upset with Jin, and focuses on his efforts to coax her out. The episode works well and does so for three reasons: one it is entertaining, two the story is able to keep our attention, and three it very subtly shows keen insight into the nature of relationships between people. \\n\\n\r\nIt is entertaining using situational humor and dialog, and while it often pokes at the idiosyncrasies of the main characters, it is able to do so in a way that is neither mean spirited nor degrading.  Over the course of the show, the other characters are involved in trying to sooth Nagi’s feeling and coax her out of the closet and while their efforts are both unsuccessful as well as amusing, their concern and their presence is also in itself very endearing.\\n\\n\r\nThe craft of storytelling by the writer is impressive: the original offense committed by Jin is not immediately revealed. Slowly, we are able to piece together that Jin had accidentally erased a taped episode of Nagi's favorite anime show before she watched it. Furthermore we learn that the reason Jin erased it was because he was recording a show with cute kittens that he thought Nagi would like, which he did without consulting her. \\n\\n\r\nBut it is next part that really is impressive because of its insight on people and their relationships.  The shows end with Jin reflecting on his actions and realizing that he had not truly considered her feelings and being able to offer a much more sincere apology. Interestingly, one is left a sense that while Jin has made a step forward, Jin still does not quite completely ‘got it’. Jin is a good person, but Jin had minimized Nagi’s disappoint and hurt because he felt his good intentions were important and should be considered in her reaction to him. In clinging to his self-perception as a ‘good guy’ he behaved poorly, both by being dismissive of Nagi’s feeling and by minimized the harm he had caused, and furthermore he was unaware that it was this behavior more than the original offensive that had left Nagi so angry and frustrated that she had locked herself up in closet.  \\n\\n\r\nAs a side note I tried to explain this episode to my brother and he could not get it, he too had the “it’s no big deal and she should just get over it” attitude (then again he’s not married). \\n\\n\r\nThis is a series that asks a lot of interesting questions and to its credit does not give simple pat solutions. Unfortunately the manga was suspended due the ill health of the author Eri Takenashi. I don’t know if there will ever be a second season or if she will resume the manga. She was fairly young when she wrote it and it may be difficult for her to return to it. In 2010 a spinoff of Kannagi [Kanpachi] was started by her older brother Shinichi Yuhki also a mangaka.\\n",
            "date": "2012-05-11T11:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 61041,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1220889.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bobbyf77",
                "username": "bobbyf77"
            },
            "url": "https://myanimelist.net/reviews.php?id=61041"
        },
        {
            "content": "I'll try not to keep things too long. Having just finished this series, I can say this: Kannagi is an extremely entertaining 13 episode series, and nicely done too. Here's why I think so:\r\nStory: 7/10\r\nI'll admit, in terms of story, Kannagi certainly does not progress much, most of the episodes consists of mainly comedy and slice-of-life aspects that are rather standalone and move the plot slowly. Interesting themes and subjects are brought up but not touched upon frequently enough, I can understand those who were unsatisfied with that.  However I do think that Kannagi's strongest aspects lies not in its plot, but rather thecomedy and interaction of the characters in the series.\\n\\n\r\nArt: 9/10\\n\r\nArt and animation wise, Kannagi excels in this department. I was very impressed with all the fine details given to everything from Nagi scratching her leg occasionally as she sits to hair blowing in the wind to the electronic noise usually present in old analog television sets. Movement is fluid and natural and the characters and their surroundings are drawn consistently every episode. Not many still shots or other effects are used in place of actual movement. \\n\\n\r\nSound: 8/10\\n\r\nThe music used in Kannagi is good, it fits their respective scenes and help add to the overall atmosphere. Th variations of the main theme as well as the instrumental versions of the OP/ED are pleasant to hear and give me nothing to complain about. The OP/ED themselves are catchy and very different from each other. All the voice actors also did an excellent job in bringing their characters and their personalities to life.\\n\\n\r\nCharacter: 9/10\\n\r\nThe cast of Kannagi each have their own unique personalities and quirks, most of which had me laughing as I kept watching. Development wise there isn't too much of that, save for the two main characters of course(even that was not too much). It is the way they interact amongst each other that deserves a 9 for character. There will certainly be someone you can relate to or situation they end up in that remind you of something similar.\\n\\n\r\nEnjoyment: 10/10\\n\r\nIn terms of enjoyment, Kannagi presents lots of it. Each episode has comedy to have you laughing, likeable characters, parodies/references and even some drama to top it all off. Personally I enjoyed every minute of Kannagi and in my honest opinion, you have to stop thinking of its lack of lot development in order to enjoy this series fully.\\n\\n\r\nOverall: 9/10 (10/10 to me, but I'm trying to be more fair here) \\n\r\nOverall, Kannagi is a pleasant, thoroughly enjoyable experiece, be it the slice-of-life situations, comedy,  parody/references to popular culture,  brands and etc. to the characters themselves. Sure, for a 13 episode series the plot barely moved or resolved but honestly with the above mentioned things I feel that they nicely make up for it and is much more enjoyable when you overlook the pacing of the story. Probably one of the most enjoyable anime this year(certainly is to me )\\n\\n\r\nYou are not obligated to fully agree with my ratings and opinions nor does this review truly reflect what this series is like. Hope you enjoyed this review.\\n\\n\r\nP.S. It's a Sony! ;D\\n\\n\\n",
            "date": "2008-12-28T22:17:00+00:00",
            "helpful_count": 6,
            "mal_id": 10740,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22819.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kantarou",
                "username": "Kantarou"
            },
            "url": "https://myanimelist.net/reviews.php?id=10740"
        },
        {
            "content": "Take your typical spineless male protagonist, throw at him a beautiful, immature and almighty goddess and the obligatory annoying childhood friend that has a crush on said male. Add then the evil twin sister of the afore-mentioned almighty goddess that dresses as a nun (because apparently Japanese people find that sexy), surround all of them with some potentially interesting, yet never quite exploited obscure secondary characters and wrap everything up in a fairly pleasant animation, with a commercial theme song. What do we get? Kannagi –a mediocre show that's not particularly bad, yet never gets close to being good either. \r\n\tKannagi starts off of aninteresting premise –Mikuriya Jin, a high school student, carves a sculpture from a holy tree which later turns into the goddess of the area, Nagi. Because people nowadays do not believe in gods as much and because her tree was cut, Nagi is very weakened, and must get rid of roaches –erm, impurities. So far, so good. If only they'd actually follow that plot.\\n\r\n\tUnfortunately, Kannagi seemed to have decided that that is not a successful money bringing strategy, and resorted to your typical ecchi comedy/slice of life/high school anime subplots. You know them; Nagi living with Jin, pretending to be his half-sister (giving a chance to reuse the same over-repeatedly gag of other characters wondering whether they really act towards each other as siblings); the love triangle-square-pentagon whatever (after the presumably gay relationship between Jin and his best friend it really isn't clear anymore); and of course, the obligatory episodes of said genre –bra buying, karaoke singing and so on. Now these might seem exciting if you're new to this kind of anime; sadly, after seeing 20+ series of the same sort, you really cannot help but blame Kannagi for the lack of innovation. What about romance then? Pff, that's really nothing but a lame excuse to bring lots and lots of fanservice. Because why not?\\n\\n\r\n\tIn the end, I'd only recommend this series to people who are generally new to anime and haven't experienced all the cliches this certain genre carries with it.",
            "date": "2015-09-02T17:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 197707,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6077.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sii_Kei",
                "username": "Sii_Kei"
            },
            "url": "https://myanimelist.net/reviews.php?id=197707"
        },
        {
            "content": "Kannagi is quite original in my opinion, it starts out looking like a magical fantasy oriented anime, but immediately transitions into complete comedy/Romance. Kannagi isn&rsquo;t extremely comedic or romantic so I would have to throw it into the slice of life category \r\nStory\r\nLead character is a young boy named Jin who happens to have an acute sense of the spiritual. He one day sculpts an idol of a goddess out of sacred wood that a friend gives him and POOF, out pops a young girl from the sculptures. This girls name is kannagi who happens to believe her self to be a God. From theiron she joins Jin through out his daily life accompanying him to school, the mall and just about everywhere else he goes. For some reason she finds it her duty to rid the world impurities which happen to be evil mysterious bug like creatures that cause misfortune to whom ever they touch. Wait PAUSE, I know most readers are like wah??? But kannagi is a strange anime, it introduces this mystery but gives it very little attention. In fact ridding the world of evil is not first on the to do list for Kannagi, not second but THIRD on Kannagis list of chores. Her first and second goals are finding out more about her mysterious nature and becoming popular among the masses. Now how does a God not know anything about its self is a mystery in itself so don&rsquo;t ask.\\n\\n\r\nChrachters\\n\r\nGreat characters, Kannagi the lead Girl character is quite hilarious and enjoyable to watch. Even the side cast is enjoyable to watch, most situations in this story are very entertaining.\\n\\n\r\nAnimation Sound\\n\r\nAnimation is excellent. Sound on the other hand I&rsquo;m not sure about, this anime has very little sound or music through out its kind of silent at times making the show slow and groggy. \\n\\n\r\nPros\\n\r\n-Hillarious side cast\\n\r\n-Origional Story\\n\r\n-Entertaining plots and situations\\n\\n\r\nCons\\n\r\n-Very slow pace development, some shows get to a drooling level of boredom.\\n\r\n-Weird story to be honest but not horrible\\n\\n\r\nOverall\\n\r\nA good watch especially if you enjoy comedy/romances. If you don&rsquo;t enjoy mysterious magic in your anime don&rsquo;t worry its very minimal in Kannagi. This anime does many things right, it doesn&rsquo;t become to strange or to realistic making it balanced in some way for all audiences really.\\n",
            "date": "2009-01-30T07:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 11946,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91846.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Alderban",
                "username": "Alderban"
            },
            "url": "https://myanimelist.net/reviews.php?id=11946"
        },
        {
            "content": "Kannagi is a little deceptive kind of series: it may look like fantasy at first, yet soon it ends up a harem/moe comedy with insignificant fantasy elements, and well, it isn't nearly as good as some people make it out to be.\r\nSTORY & CHARACTERS\r\nFirst, the major part of the \"plot\" is taken up by endless dialogues about nothing at the pace of a crippled snail. Perhaps, fans of K-On! and similar series may enjoy that, but I personally consider it to be nothing more than a boring waste of time.\r\nSecond, the \"story\" is essentially a generic harem with your cookie-cutter boy-protagonist who allows a girlto live at his place, and how that girl and two other girls compete for his attention. That's the base, and the authors apparently try to add some other aspects to make the anime more entertaining, yet that eventually turns the \"plot\" into a total illogical mess:\\n\r\n- the series starts as fantasy, with the heroine taking on the duty to destroy some shadow creatures because it's supposed to be a purpose of a goddess - to protect the land from the negative energy those creatures are made of; \\n\r\n- then this mission suddenly gets abandoned, and she starts rivaling another goddess for popularity, making the show a parody on pop-idols; \\n\r\n- then this plotline also gets abandoned with no conclusion, and the anime shows several comedy fillers; \\n\r\n- and then out of nowhere it becomes a serious drama. \\n\r\nNone of those parts are logically connected, and nothing gets solved by the end, as the show has an open ending and no sequel whatsoever. Overall, it looks like those who wrote this \"story\" tried to appeal to different groups of viewers but totally failed to tie various elements together and make a proper conclusion.\\n\r\nThird, the only outstanding character here is Nagi - the female lead who somewhat reminds me of Holo from Spice & Wolf: she's cute, very likeable and lots of fun to follow. The other characters aren't nearly as interesting and memorable since they are only some shallow anime stereotypes that never develop into anything.\\n\r\nAll in all, my experience with this \"story\" & characters may be described as boredom with occasional sparks of entertainment when Nagi comes into play with her tricks & shenanigans. Basically, she's the main attraction of the show and the only aspect I truly enjoyed about it.\\n\\n\r\nANIMATION & SOUND\\n\r\nThe animation utilizes fitting colour palette and shows nice fluency of motion. In general, it's good but not really something to brag about. As for the sound department, the voice-acting is quite remarkable, especially when it comes to Nagi who sometimes uses archaic Japanese words in her speech: not only it sounds rather amusing, but it also might be interesting to those who study the language. Sadly, the musical score doesn't match the voice-acting: it's bland and absolutely forgettable except for the ending song.\\n\\n\r\nOVERALL\\n\r\nThe series might be enjoyable if you're ok with the extremely slow pace and the numerous plot issues it has (in other words: if you don't care whether the anime you watch is exciting and has a logical and conclusive plot). As for me, I personally like the comedy fillers: for example, the episode where Nagi locks herself up in the cupboard is very funny indeed. However, the rest of the show is pretty boring and nonsensical.",
            "date": "2016-12-19T10:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 235822,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2270413.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Singan",
                "username": "Singan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235822"
        }
    ],
    [
        {
            "content": "So this is what the hippies meant with „trees are our friends”.\r\nStory:\r\nI don’t really know where to begin. Kannagi is a very weirdly written show, it jumps from one genre to the next, but I fail to see the reason why. It’s almost as if the author didn’t know what she wanted herself either. It starts out with a supernatural meeting, but soon it goes into a fish out of water-comedy territory, which is fine so far. Then we see a slight drift into harem comedy, which is not what I was hoping for, but still somewhat justifiable. And suddenly, near the end of itsrun, we are in the middle of an existentialistic drama. Wow, how did that happen? I understand what they were trying to do here (at least I think I do), but the transitions are so frequent and sudden, that it’s hard for me to grab hold of the story. Why couldn’t it be just one of these things? Or at least, make the switches a little smoother. To me, this anime seems way too ambitious for its own good. Good old “less is more” would have done wonders for Kannagi, I’m sure. The story itself is not a bad one and I had a couple of good laughs, but I wish it would have been more consistent.\\n\r\n6/10\\n\\n\r\nArt:\\n\r\nThanks to the character design, I was absolutely sure this was a KyoAni show, but to my surprise, it isn’t. The characters look pretty normal in terms of outrageous hair or hair color or physique, with a few exceptions. Unusual for a comedy, but it’s not like it’s a must or anything, I just thought I should mention that. The animation was incredibly fluent, sometimes even too much so. You know, when something artificial looks or behaves human-like, it stops being amazing and gets creepy. Ah yes, uncanny valley, that’s what you call that, thanks Google. It’s not that bad, it’s still within the realm of really good animation, especially for its time. The backgrounds looks pretty good too, there was quite some attention put into detail there.\\n\r\n9/10\\n\\n\r\nSound:\\n\r\nI have to admit, the opening song is pretty catchy, even though I do not like these nonsensical J-Pop songs at all. But I’m not a fundamentalist when it comes down to my personal preferences, I’m willing to look past that. After all, I’m just one viewer out of…thousands? Millions? I don’t know. What I really enjoyed however was the ending theme. Its calm and oriental sound was a perfect fit for the show, especially considering the latter parts that got a little more serious. The voice acting was solid throughout. Haruka Tomatsu did a fine switch between silly freeloader and divine being, good job there. None of the rest really stuck out, but that’s not necessarily a bad thing. As long as the voices fit their characters well enough, that’s fine with me. The karaoke episode was fun to watch and I have to say, Hiro Shimono did surprisingly well doing a mediocre singing voice. I think that’s even harder to pull off than a purposely bad performance.\\n\r\n8/10\\n\\n\r\nCharacters:\\n\r\nNagi suffered a bit from the irregularity of the story, but she was a well-written enough character to survive this. At first she seemed to be a very arrogant person, which didn’t make me emphasize with her much. But as the anime slowly turned towards its more serious side, we saw much more shades to her and an explanation for her behavior (more or less). But the selling point for me was the actual remorse she had, something bitchy anime girls almost never seem to possess. I wouldn’t go so far as to say I liked her, but you get the idea. Jin on the other hand was sadly a very good example what people constantly bitch about, a useless male lead. Even though technically the story revolves around him most of the time, he didn’t move it forward in any meaningful way. There were some hope spots, when he called Nagi out for her actions or remarks, but that never lasted very long and we were soon back to the status quo. He didn’t even help out in the finale by himself, he had to be instructed to do so. On top of that, he was way too easily embarrassed, as if he was the worst harem protagonist ever.\\n\\n\r\nThe rest of the cast unfortunately was not very memorable. Childhood friend Tsugumi was featured a lot, yet she did not help advance the plot, with the exception of the end, where she was the one to tell Jin what to do. The same goes for Zange, but even more so. When the drama kicked in, Zange pretty much vanished from the show. She did not matter in the end, nor did she help out solving anything. Her character became a personified open end, in retrospective making her entire existence in the anime kind of meaningless. The rest of the circle was unimportant in the end as well, though I can swallow that a lot easier, as they were side characters from the very start anyway. But Tsugumi and Zange? They should have mattered more.\\n\r\n5/10\\n\\n\r\nEnjoyment:\\n\r\nKannagi was not a bad anime, but it failed to leave a lasting impression on me. The writing being all over the place and many of the characters being quite unimportant gave me a hard time getting invested in this show. This is definitely not an anime to binge, there are too many inconsistencies to do that, but if you take it slowly, watching one episode at a time, you might end up liking it much more than I did. I’m amazed how much of a cult following Kannagi has (or had), but I’m not surprised that it didn’t click with mainstream audiences. I don’t know how much may have been lost from adapting the manga, but the anime itself is almost a mess. A somewhat enjoyable one, but still a mess.\\n\r\n6/10\\n\\n\r\nOverall:\\n\r\n6.8/10",
            "date": "2017-09-10T12:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 257258,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=257258"
        },
        {
            "content": "When I 1st learned about this series I searched on ANN and it didn't catch my attention much. but when i saw that ayako was subbing this I thought it might be something good to watch, but had better stuff on my queue so I never got around to get it.  after they had released all eps in 1 batch I figured what the heck... so i got it.\r\nTonight I sat down and one episode after another, I just couldn't stop watching it.  It just gave you that warm feeling of a very well thought out story, crazy goddesses and love polygons witha twist...\\n\\n\r\nNow, from what I saw at the ending, there were several loose ends to the story, but these will probably be covered on a sequel. At least I hope so...\\n\\n\r\nregardless, this is a great anime. I'll check the manga as well because it's just that good.  It's not just another pop-up goddess with immediate-crush on main character kinda story... instead, it's something that builds up throughout the series.  Oh, and plenty of laughs from all main characters (not so much for the secondary, but still).\\n\r\nso yeah, it's worth watching.",
            "date": "2009-01-04T23:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 11118,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33026.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/basara",
                "username": "basara"
            },
            "url": "https://myanimelist.net/reviews.php?id=11118"
        },
        {
            "content": "Uhmm first of all, the main reason on why i liked this anime is very simple. It is because it made me laugh :P unlike some anime ive recently watched, this is one of the anime which made me happy but at the same time sad. im hoping that there will be a season 2 of kannagi since after all, the manga is still on hiatus and i believe that the director wont make the anime end like that.\r\nto the people who read this review, please try and watch kannagi :) im sure ull enjoy it.",
            "date": "2009-01-03T00:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 10993,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/124792.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ken127",
                "username": "ken127"
            },
            "url": "https://myanimelist.net/reviews.php?id=10993"
        },
        {
            "content": "Yamamoto yutaka, who was the director of Kannagi, recently said this on his official line blog.\r\n\"Now Japan will not need an idol.\"\r\nWait, hold on second. What does he mean by that? No, I wonder if there was a lot of idol animation in the past as it is now. There are love live, sunshine, Aimas, Cindemas, WUG, and 22/7, which is Yasushi Akimoto's new plan just as soon as we think about it. So many idol animations are coming out, what are you talking about?\r\nYamakan, no matter how you think, the public needs an idol. You may have to ask.\r\nBut there is context to theword. The public may need an idol that mediates \"animation\", but it does not seem to require idol with real blood and flesh. It is true that the idol that has been accepted by the public literally as an \"idol\" can go up to the 80s if it goes back to history, but it is now disappearing after the prescription. SMAP has breaking-up, and who are concentrating on entertainment activities such as AKB48, NMB48 and other female idols.\\n\r\nAmong them, there are some members who graduate from Idol and enter freshmen in Yoshimoto Kogyo. The public now treats the idol as a common gossip, and only accepts it as an object of entertainment on TV. As Yamakan said, the idol has already done its prescription.\\n\\n\r\nThe same thing happens in «Kannagi». The giant new wood guarding the Kannagi Village is cut down by the compartmentalization, and the Kannagi Shrine (where the anime pilgrimage is the highest level of difficulty) will also disappear. Mikuriya Jin, who was doing sculpture for the exhibition with that part of wood, have a surprise experience, and suddenly a woman with blue hair suddenly appears from the carved wood and introduces herself as \"God\".\\n\\n\r\nWhat the f**k.\\n\\n\r\nMikuriya-kun is embarrassed to hear the ridiculous sound, but looking at the situation and think, she was really holy God. It would be glad that it ends, but in the village, the idol character \"Zange(Confession) chan\" was doing a part-time job with 100 yen for the confession of a person who were in trouble. Wander around in a machi(village in japan) I would be surprised if I met someone like this on the street. It turns out that the confessor was a sister of Nagi, who was fall apart from one wood. And animation falls into the shadows of despair, hope and humor. I can tell that almost all the fairy tale dancing, open the door and closing, sadness and ordering scenes in episode 10, is a magnum opus of this animation.\\n\\n\r\nHowever, Kannagi suddenly starts to develop rapidly from episode 11. Is Nagi really a god? Jin talks with his teacher, Suzushiro, who teaches religion, and begins to question. Nagi does not know why she should handle the denial, and what original name is. She does not know anything about it. but anyway, the relationship between them suddenly deteriorates. Nagi did runaway and stays at grandmother's house for a while (for details, it can be spoiled). So the story goes, and after the episode 12, the unexpected ending waits in the last episode. I do not know if it's anyone else, but I really didn't know that the animation would end like this. It was honestly shocking and surprising.\\n\\n\r\nCome back to talk about idol again, Kannagi is a god who had been guarding the village for a long time. God = idol disappears when people are forgotten. However, by chance, she returns to her village and gains faith from students, she becomes an idol at school. The light comes from the Onosa(a cheap magic wand). Although it is often used as a gag material, the idea that many people make the \"god\" of the village possible, is quite same as the idea that many people's whole love can make idols possible. Obviously it existed long time ago. Maybe even a little bit right now. But ultimately it is destined to disappear.\\n\\n\r\nIf the language changes, then the definition of the language also changes. The meaning of idol is arbitrarily determined, and there is no reason to limit it to a single meaning. However, even if we need 'idol', if it does not have any contact with the reality (Yamakan has obviously done such attempt), the future suddenly has a different appearance from what we expected. If you can say one thing, the future is \"World has lost its God.\" This is why God did not exist in Japan. The future anthropologist may say like that. This is because we don't need God anymore, not because the god was gone. God = Nature is still here.\\n\\n\r\nMaybe we can say, Kannagi was an animation that predicted modern Japanese society? I think that if you are looking at it quietly, you will be agree. It may be meaningful to see this animation again right now. I realized that, famous movie Spirited Away's theme song \"Itsumo Nando demo(in English Always, Numerous Times)\", I recall the lyrics of this beautiful song.",
            "date": "2017-01-02T00:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 237241,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5876794.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Barde",
                "username": "Barde"
            },
            "url": "https://myanimelist.net/reviews.php?id=237241"
        },
        {
            "content": "A Story about a guy who made a statue. he was about to brought it to his school, but suddenly the statue disappeared. the statued was outside of his house and connected to the ground (dirt) few seconds later the statue broke into peices and, guess what ? a young girl appeared from inside of the statue. \r\nIMO, that was an interesting starting point from this anime especially for SoL anime. tbh, i have never seen something like that before. and the story went with many SoL, Comedy scene AS the character development, especially with the MC kept going until the end of the episodewith it. they put SoL scene but didn't forget about the actual problem. another reason why i like it. \\n\\n\r\nThe animation was great imo. y'know KyoAni ? then that was the kind of animation from this anime. even i thought this show was made by KyoAni at the first sight but after i checked it out again, it was A-1Pictures. it was pretty suprised tbh for A-1Pictures managed to pulled of that kind of animation.\\n\\n\r\nThe soundtrack was fit well with the show too imo. i don't see anything wrong with that. \\n\\n\r\nThe character was pretty good imo. but there is one thing which i don't like from this episode, it's the MC boy. he is dense, but not really that bad. but the fact that he is still dense kinda pissed me off a little bit. that's the only thing which i don't like from the character. the other was funny and cool. especially Nagi. i like her character. upbeat, adorable, and always act like a brat xD well, basically she is funny xD on the other side, Tsugumi. well, i don't really mid with osananajimi set up but it pissed me off a little that she didn't end up with Jin even tho i want Nagi with Jin LOL XD \\n\\n\r\nOverall, it was a great show imo. i enjoyed it a lot. it became one of ma fav shows XD solid 9/10 for this anime. \\n\\n\r\nSorry for bad english.\\n\r\nHope my review can be helpful to you all. \\n\r\nThanks. Have a nice day",
            "date": "2016-05-29T02:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 219542,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4481249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YizelTro",
                "username": "YizelTro"
            },
            "url": "https://myanimelist.net/reviews.php?id=219542"
        },
        {
            "content": "Kannagi is a great mix of different genres that often have difficulty working together, though whether they actually mix well may be a matter of opinion. The supernatural topics are very matter of fact, in that it's not overblown or annoying, but it is a story of a spiritual and supernatural nature in a casual and lighthearted way. It is an odd mix of Serious and Comedy, but personally I think that's the best part. At different points it had me screeching and dying from laughing so hard, and it had me bawling in other spots. The best part is that it's actually pretty spreadout, they don't try to pack feels and laughs together too much, the feelings generally have different arcs and different episodes. As a Comedy it's fantastic in places, as a drama it's not very consistent but it sure got hearty tears from me, but I think that as a show... It's well rounded and fantastic. Everything flows and works well together. Not to mention the *God-tier* animation quality. Very good.",
            "date": "2017-09-08T18:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 257132,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6396407.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tazinat0r",
                "username": "Tazinat0r"
            },
            "url": "https://myanimelist.net/reviews.php?id=257132"
        },
        {
            "content": "Well i didn't really enjoy this anime too much since I am not into art and im quite religious, the idea of anyone deeming themselves god is naturally against my chain of thought however in my honest opinion the anime didn't satisfy me in any way in the end with nothing profound happening \r\nIt also drifted away from their initial plot to destroy the impurities too much.\r\nHowever the character Nagi was well structured most girls of that age are as immature as that and lock themselves in cupboards when things aren't going their way i enjoyed that episode somewhat more than any of the others",
            "date": "2009-03-15T23:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 13231,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/145146.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BatriX",
                "username": "BatriX"
            },
            "url": "https://myanimelist.net/reviews.php?id=13231"
        },
        {
            "content": "I liked the anime, \r\nIt is unusual for a 13 episode shounen anime. It doesn't have much fanservice or almost non, characters are good and the story is very good but what ruined it, I feel that the story isn't complete and there are a lot of mysteries that are left unsolved and a lot of those mysteries are very hard to predict. Surly will leave you with a lot of unanswered questions .\r\nI don't know if the manga is more clear than the anime, it might answer those questions. \r\nAnd if they will produce another season, that would make things right.....*__*",
            "date": "2011-03-21T10:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 35218,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/aaaqqqsss",
                "username": "aaaqqqsss"
            },
            "url": "https://myanimelist.net/reviews.php?id=35218"
        },
        {
            "content": "It was a really fun watch. Rather short being able to complete it in just a few hours. I was rather disappointed in the ending, but in harem-like animes its easy to feel that way.\r\nI enjoyed well-defined relationships among characters because it is so well defined--much more then any of the characters individually. \r\nThe episodes in the middle seem a lot more slice-of-life then I expected, but they made it work.",
            "date": "2010-06-07T13:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 26912,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/111185.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scott_Moseley",
                "username": "Scott_Moseley"
            },
            "url": "https://myanimelist.net/reviews.php?id=26912"
        },
        {
            "content": "Kannagi is quite the show for sure. It may be viewed at first glance as another comedic high school harem anime, but in truth it really is a bit more than that. This show definitely has its fair share of cliché episodes with tons of memorable and humorous moments, as well as also driving home an acceptable amount of thought towards gods, self awareness, discovering oneself, etc.\r\nBefore I cover the my big complaints to the show, I'll start off with the small stuff\r\nArt (10) - It's a beautiful show. Especially for what... Being released in the 2000's? It surprised me actually. Everyone looks very fluffyand dare I say, lush. Smooth smooth smooth Animation as well!\\n\\n\r\nSound (7) - I've never been too picky on this section in particular. Probably since I'm an English speaker and since I'm not from Japan, I don't seem to pick up on the quality of voice acting as much. I will say I have heard Very well done voice acting in anime before, but most are just... Normal sounding. And this is what this show has in particular. Just normal. But as far as the music goes... Love the OP, love the ED, and Soundtrack within the episodes is, y'know , a regualr Soundtrack. Overall it's okay.\\n\\n\r\nEnjoyment (7) - Kannagi is a great show! I would definitely recommend it to any friend of mine. It's quite light hearted and doesn't rely heavily on jokes about perversion and indecency, unlike most shows unfortunately. It has its fair share of those of course, and people seem to be even categorizing the anime as a harem as well, but the \"perversion\" is not so overpowering that it takes over the show and ruins it. It's done moderately, which is a very nice touch and shows its maturity compared to other shows. Other than that stupid perversion shit or whatever, the show contains many great memorable moments and episodes! Lemme tell ya, it's a funny show! It really is! It stands out a little more for sure.\\n\\n\r\nStory (6) - alright, so this is probably where people may disagree with me. First off let me say, the IDEA for the story is great, but how it was executed could have had been done better. Not by much, it was done pretty well, but there were definitely many sections in the anime that were either unnecessary, boring, or just had little to no action on forwarding the character development. The best example of this was the karaoke bar episode. I won't spoil what happens blah blah blah, but I have one big complaint. The show uses half the time in this episode to either fill in slapstick comedy, funny jokes and remarks that the Characters quote to eachother, or just plain silliness. Sure you could say this continues the character development... But I beg to differ. I say this because I believe the show could do without the  cliché episodes like the karaoke bar. Sure the episode covers what would happen when all the characters are out in the situation of hanging out in the karaoke bar, including the social tensions, internal and external feelings and all, but the show develops the Characters in the more unproductive way like most bottom bin niche 12 episode animes. The way the show executes the scenario and reactions of characters during the karaoke bar episode DO add character development, but in a very shallow way. The whole purpose of that episode (and for just about any episode to any show) was to build up a way to prove a point at the end which further adds to the development of the storyline. But in this particular episode, there is no buildup. It just aimlessly wanders around, making jokes and slapstick comedy to fill in the gap. What I'm trying to say, is that SOME episodes could be used in a more resourceful manner that is not just filler. This does not only happen in the karaoke bar episode either. There are at least 2 or 3 that do this as well.\\n\r\nBUT OTHER THAN THAT BIG COMPLAINT, the show is great! Most of the episodes are very enjoyable and do a fine job at keeping my attention, and progressing the story, Characters, and Themes. I wouldn't say it is the deepest show, but it allows for ones mind to think a bit and realize some things they may not have though of before. Overall, great story, despite the large complaint.\\n\\n\r\nCharacters (7) - The Characters are lovable ,for sure! Like I said above though, some of the episodes dont do the best job of developing the Characters, and some of the episodes barely address one of the main characters, Nagi as much as you would think they should. Then again, the same goes for every character in the show, but of course, it's only 13 episodes so you can't expect TOO much. Generally speaking, they did a good job. there wasnt really one character I disliked.\\n\\n\r\nOverall (7) In a nutshell, Kannagi is an enjoyable anime to the average viewer and is a perfect show to be watched casually, yet the show spends too much time not progressing the story or characters in each episode, which ends up making each minute not as captivating as the last in some cases. Kannagi by all means is not a bad anime. It's actually one of the better short series shoes you can watch, but in my personal opinion, it still contains that slight disconnect from the show being a classic with each episode being amazing and memorable to the show just throwing certain cliché scenarios to fill the void in the storyline. Good show, but like most shows in general, it has room for improvement.",
            "date": "2015-12-26T00:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 206821,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2954601.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MrShishkebab",
                "username": "MrShishkebab"
            },
            "url": "https://myanimelist.net/reviews.php?id=206821"
        },
        {
            "content": "Sometimes, the best series hide itself for people to see its true beauty. This is one of those series. It had its ups and downs, it wasn't perfect, but it was able to present its story naturally.\r\nIf you judge this series from its art style, then you're missing out on so much. The plot of this series doesn't compare to it. Sure, the animation is too simple and not as exaggerated as I hoped, but the execution of the scenes was more important to me than the display of tantalizing effects. I can still remember the theme track used. It was simple, but it capturedthe atmosphere of the setting: nice and quiet. \\n\\n\r\nYes, it might be boring at first glance. But give it a chance and you'll enjoy it just as I did. I highly recommend this for those looking for underrated series. For sure, You'll love the mystical world of Kannagi!",
            "date": "2016-09-03T17:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 228232,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=228232"
        },
        {
            "content": "The concept of a parody Anime is hardly anything new. It's been going on for quite some time now with notable examples being Excel Saga and Sayonara Zetsubou Sensei. Kannagi fits in a group with them quite nicely, but this show is far more subtle about its business.\r\nIt rides the line between parody and straight almost effortlessly. The show has a plot and the purpose of the show isn't to mock other Anime or the archetypes, cliches and tropes; yet by some great directing and writing it manages to do all of that effortlessly while lightly telling its story. The plot isn't particularly heavy butonce it's the focus of the show it doesn't dilute anything like you see in a lot of comedy shows. Everything here works nicely as a cohesive package and satisfies from beginning to end.\\n\\n\r\nIt's sad to see how quickly people forgot this show considering it was such a big hit in the Fall of 08', but most Anime fans, myself included on occasion, have a short attention span. I also wonder if it had to do with the waning health of the Mangaka behind this series or even the massive 2ch outrage at her for writing one of the characters had lost her virginity in the past. However I digress because that will lead into a long essay about why 2ch is bad for Anime and full of idiots.\\n\\n\r\nGo watch this show, you'll love it.",
            "date": "2011-08-18T13:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 41709,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/204719.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kickflip",
                "username": "kickflip"
            },
            "url": "https://myanimelist.net/reviews.php?id=41709"
        },
        {
            "content": "Kannagi was laugh out loud funny a couple of times in each episode, with the exception of the last few episodes which were more serious.\r\nThe characters in this series were excellent.  It was fun to watch.\r\nI'm looking forward to another season.",
            "date": "2009-05-04T10:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 14785,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/adamskinner",
                "username": "adamskinner"
            },
            "url": "https://myanimelist.net/reviews.php?id=14785"
        },
        {
            "content": "Well this series was one to remember with some quite humorous situations. I enjoyed the eccentric characters, followed by the wildest of scenarios ever. I must say though, I feel very sorry for Jin, things just get worse for him.\r\nOverall 9/10, the romance in here was okay, but the ending wasn't solid to me, and there wasn't much else going. The plot seemed like it would unfold and become bigger, but it fell short...Still good though!",
            "date": "2009-03-31T23:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 13699,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13699"
        },
        {
            "content": "If your into more of a romance/slight fiction this is something to try our. i thought it was a very good anime and the art was amazing. the characters movement was very human like in an anime sense.",
            "date": "2012-05-25T13:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 61867,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1314649.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PhireDawn",
                "username": "PhireDawn"
            },
            "url": "https://myanimelist.net/reviews.php?id=61867"
        }
    ]
]