[
    [
        {
            "content": "******this review contain some spoilers ******\r\n-I gave all 3 seasons a score of \"1\" \r\n- This anime is really really horrible \r\nNothing can describe my hatred for this anime \r\n-I used to love this anime (in fact like) \r\nWhy i gave such a score? \r\n- It's too cliche this anime is called kuroko no basket, not Akashi no basket or GOM no basket.\r\n-I watch the same thing for 75 times. \r\n-I hate kuroko \r\n-The author really using any method to make kuroko win the winter cup \r\nStory (5) \r\nNothing much to say as you guys can predict. As usual the characters are competing against eachother in basketball and there's always a winner and loser. Without fail kuroko is gonna win in the end. And I'm right! When they lose they learn something then then they win again. This goes on and on. \\n\\n\r\nArt (6) \\n\r\nNot much to say since the art is normal. Just that I really don't understand WHAT in the world is the black shadow under their neck? It's shadow? No, it has strips. Are they zebras?.... \\n\\n\r\nSound (6) \\n\r\nThe bgm is good. It makes people goes \"thump thump\" But not for me! Since i already know the fact that Seirin is gonna win in the end. In my opinion this anime's soundtrack is getting worse and worse. I do like that opening in season 1 though. \\n\\n\r\nCharacter (1)\\n\r\nHonestly I like Aomine and Kise a lot. But nothing is gonna change this \"1\". Kuroko is acting like he is the boss and knows everything. When he lose he cry . If not in game, the last minute he will thought of something which lead seirin to victory. If not, he will rely on his teammates . Then they win! He act as if seirin will not win if he is not there. And the way he play basketball and shoot is really complicating , for example : phantom shot , misdirection and worst lack of presence. All these doesn't make sense at all! I know this is shounen anime but ain't this abit too much? Why not put a \"magic\" or \"super power\" under the tag? This author is really trying to come up with all shorts of funny move and shoots to make seirin win. \\n\\n\r\nFor the whole character of this anime. They are already tired but they still have the strength to enter zone to run,shoot,block and win. What logic is this?... \\n\\n\r\nEnjoyment (1)\\n\r\nAs stated from above this anime has no logic. I came here to watch \"sports\" anime and not  \"magic\" or \"super power\" anime. \\n\r\nI realized something about this anime which really pissed me off. Which is whenever 1 team had a goal, the other team will hype up and say somethings then the next time the team (that didn't get the ball previously)\\n\r\nwill surely get the ball and will goal. A very good example: Teppei is blocking someone under the net. He failed. Then next time round there's a rebound he will surely get the ball and score. \\n\r\nAnd the score is either 1 point away from each other or many points away from each other (around 20-100 points) \\n\r\nThis anime has a logic of \"a mountain has a mountain taller than it\" In this case means that rakuzan enter zone 1st. But that is not the end! Because there is seirin in zone as well! Although we all know the fact that rakuzan is already very powerful.\\n\\n\r\nOverall, this is horrible. So i shall not waste so much of my time writing a view on this anime. So horrible that will surely gonna trauma my brain. \\n",
            "date": "2015-07-02T10:08:00+00:00",
            "helpful_count": 226,
            "mal_id": 192043,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3275659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeLoverAAA",
                "username": "AnimeLoverAAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=192043"
        },
        {
            "content": "At this point, Kuroko no Basket (Kuroko’s Basketball) is a series that needs no introduction. After two seasons of competitive gameplay, we have the third and final season to conclude the entire story based off the manga written by Tadatoshi Fujimaki. If you’re really anxious to see how the Winter Cup will be decided and who will earn the ultimate glory, then this is a must-see for KnB fans. Otherwise, I confess to myself that the third season is a bit of a hit or miss.\r\nFor starters, the third season still takes place in the same setting with Seirin High as the main focus. Notonly is Kuroko, one of the legendary Generation of Miracles, on the team but there’s also much we learn about the rest of his former teammates. \\n\\n\r\nThe third season already establishes the foundations of basketball, the most prominent players, and what’s at stake. As the previous seasons introduced most of the prominent rivals, there’s little need to bring new challengers. As such, expect this season to focus more on the existing players; characters such as the Generation of Miracles and Uncrowned Kings from Rakuzan. There’s also a good amount of history from behind the scenes for the main supporting players as well. And that’s really something to say about the show. Kuroko no Basket approaches its premise to characterize its players especially for the ones that the audience may care about the most. Other than Kuroko, we have the distinctive Generation of Miracles. We find out much more about them in ways that really makes us understand them beyond just on the court. It also gives the audience as a sense of appreciation for the reasons that Kuroko left behind his former team and is now part of Seirin High.\\n\\n\r\nAs with any competitive sport, basketball is no exception to rivalries. Early on the show, we can easily see rivalries that go head in head on the court. These include Kise Ryouta vs Shogo Haizaki, Seijuro Akashi vs. Shintaro Midorima, and later on Seirin vs. Rakuzen. A good portion of these matches are intimidating. And sticking with its shounen style, the show still pulls out its supernatural-like gimmicks with the players’ moves. Kise’s copycat and Akashi’s Emperor Eye are prime examples of this as we see how they can influence the outcome of a game. As much as this can be appealing, it really comes off as edgy and unrealistic. There’s little to relate with and most of the time, this season attempts to wow the audience with diehard efforts. By this time, it’s really repetitive and doesn’t bring much with these establishes gimmicks. The plus side of this might be the fact that the show still retains its electrifying energy. After all, basketball is a game that requires both the individual and collective effort of a team to succeed. And as one of the sports that requires constant movement on the court, the show creates its full throttle mood with delicacy. \\n\\n\r\nI mentioned this before but Kuroko no Basket has a lot of story written into each game. Players facing off often had a history in some way or form with one another. This doesn’t just include rivalries but friendships as well. For instance, Shintaro’s decision to join Shutoku High is influenced by his teammate, Kazunari Takao. Some episodes reveals more about each of the prominent players through its in-game storytelling. At the same time, it spawns emotions to connect players’ dedications and their reasons to play in the first place. So in essence, you could say that the show’s characters are all like chapters of a story with each episode progressing that said story.  However, some of these stories aren’t what can be really memorable. As Kagami already had plenty of development, there’s little more to improve his character. Instead, do expect a bit more focus on some of its other supporting characters with their own stories. \\n\\n\r\nKuroko no Basket is not a drama show. However, the drama it attempts to craft go in a lot of directions. I think the show at times is really trying to send a message of some sorts towards the audience. How does it try to get the message across? With a lot of intention to persuade the audience for what the players are trying to accomplish, the series really at time feels like it’s a sermon. Not that the speeches are anything malicious or in that particular way, but the series itself really should do more than just go with the usual cliché dialogues. However, I do give some praise to the characters’ performances throughout the majority of this season. On or off the court, it’s entrancing to see how they react and play with engaging momentum.\\n\\n\r\nFor the third time in a row, Production I.G. takes the task to produce a good quality show with its artwork style. Character designs and expression are well decorated on most terms to fit with their personalities. Each school that plays in this season also has its own distinctive uniforms that stands out in their own way. However, the most promising technical aspect is the shounen-style coordination of the gameplay. Kuroko no Basket is always known to pull out crazy moves that is beyond normal human comprehension. So what should you expect? The same intense elements of what you should be used to from the previous seasons. And that would be an excitement of powerful and compelling movements with clever camera angles, facial expressions, and emotional attachment. It communicates its message to the audience at how weak or strong a team is both individually, or in other cases, the players individually.\\n\\n\r\nSoundtrack relies mostly on itself to adapt the gameplay when it needs to be. The most noticeable feature includes thrilling timings when significant moves are made where the soundtrack plays a key role. Character voice mannerisms also retains its expectations although nothing really home to write home about compared to its OST. And on a more decorative aspect, there are various OP and ED theme songs that reflect the momentum of the third season. \\n\\n\r\nIt’s been a long ride. With over 70 episodes, various OVAs, and a franchise that makes basketball looks like a battlefield, you could say that the destination has finally be reached with everything it had to offer. Unfortunately, the third season isn’t a much improvement from before and the final game has a lot of the usual generic themes written in like a textbook. But is it worth watching in the end? I’d still say yes especially for fans eager to see who will win the Winter Cup. Anyone who is interested at learning more about the Generation of Miracles will also be in for a treat; despite the bit of rush in content based on the manga. It’s still a sensational feeling to realize the destination has finally been reached though.",
            "date": "2015-06-30T11:08:00+00:00",
            "helpful_count": 106,
            "mal_id": 191811,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=191811"
        },
        {
            "content": "Finally... I got to finish this anime. Even few hours after I finished watching, adrenaline still overflowing inside of me. I really enjoy this season. Okay, before reviewing, I have read all the manga chapters before the anime even started the third season. Even though I did enjoy reading it, I was not that hyped up for the ending... but the anime did the reverse. With solid story as the base, characters we have grown to love, animated in such an astounding way, this is one of the rare case when I feel more enjoyment with the anime. \r\nStory: 8/10\r\nAfter the winning the match againstYosen, Seirin team proceeds to semifinal facing Kaijou. In the same time, Shutoku vs Rakuzan. Both have fought hard, but in the end Seirin got to meet Rakuzan in the final. Before the final showdown, we are shown a flashback of the days of Kuroko with the Generation of Miracles back in Teikou middle school. Then.. yeah, the showdown. \\n\r\nThe storyline of the anime faithfully follows the manga, which makes me utterly happy.\\n\\n\r\nArt: 9/10\\n\r\nProduction I.G outdone itself once again. While the previous seasons are good, this season is particularly so much better. With more flashy opening sequence, better and smoother animated movements... Knowing a bit about 2D animation, I am in awe thinking how much frame they used to make those pose, passes, throws, shoots very smoothly. Dribbles and drives are especially better here. They may use a bit of CG but it is used very efficiently and can blend rather well with the other animation. Effects like the Zone, Kuroko's magic passes are done very well too. \\n\\n\r\nColors are very bright and brilliant. I really love the flashback arc in particular. The colors of the sakura trees, sunset, inside of the stadium... everything is really pleasing to the eye.\\n\\n\r\nThe only thing keeping the art from getting 10/10 is.. sometimes the animation quality drops a bit and slight distortion in the character design at times. Nevertheless, it is really great.\\n\\n\r\nSound: 9/10\\n\r\nThis is one of the major factor that keeps the experience of watching anime better compared to reading the manga. Upbeat opening and ending songs, then background music that is pumping your energy during matches.. mellow music during sadder or reflective scenes... They make everything so much more exciting, grande and emotional when the time calls for it. \\n\\n\r\nSeiyuus / voice actors are doing their roles very well. ^^ \\n\\n\r\nCharacter: 10/10\\n\r\nIf you follow Kuroko no Basket since the very beginning, you will see a lot of development, both in the characters personally and how they interact with the others. After meeting Seirin, Generation of Miracles gets more humble and they got reminded of how fun playing basketball is. Well, they kinda lost the excitement of playing since they consecutively won with ease during Teikou days.. \\n\\n\r\nThen we got to see more of the first years in Seirin.. Furihata, Fukuda, Kawahara.. finally they got to enter the court at least. Also more screentime for Koganei, Tsuchida and Mitobe. The starters in Seirin has developed to the better too.. they have better teamwork and trust to support each other. Kagami is powered up some more.. Kuroko is no longer as stoic and expressionless compared to the very start. Kiyoshi, Hyuuga and Izuki also has their glorious moments. The other characters like the guys from Touou, Shutoku, Kaijou, Yosen, other schools that went against Seirin before are also shown. Basically everyone who have made their appearance in this series from season 1 appeared again, in the match or among the audience, contributing either by encouraging the cast or giving their observation about the match. This really highlights that the season 3 is really the final.\\n\\n\r\nEnjoyment: 9/10\\n\r\nAlthough the direction of the series may seem very clear and Shutoku vs Rakuzan is very one-sided, the matches are so hard for Seirin vs Kaijou making me brimming with excitement. I'm kinda sad the flashback (which is my most favorite part) is not that highlighted and only have 4 episodes. However, although short, they managed to cover the most important parts and tug in your heart, especially after Ogiwara's team went against Teikou. I really feel heartbroken along with Kuroko and Ogiwara. And when the final match is over, I also feel triumphant. \\n\\n\r\nOverall: 9/10\\n\r\nA really good way to wrap up the story of Kuroko Tetsuya and his basketball journey. \\n\r\nHighly recommended for sports lovers and of course, the fans of Kuroko no Basket manga. You won't be disappointed :) \\n\\n",
            "date": "2015-07-29T21:54:00+00:00",
            "helpful_count": 84,
            "mal_id": 194666,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2086837.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aikojazz",
                "username": "aikojazz"
            },
            "url": "https://myanimelist.net/reviews.php?id=194666"
        },
        {
            "content": "First of all, I will clear things out by saying, that I am a big fan of season 1 & 2 of this anime series. I liked almost everthing about those two anime. Eventhough with such a great prequels the third season felt a bit too repetitive. While watching this anime I felt like I have watched the same things in season one & two. The thing that I loved about the first two seasons was character development which was somewhat missing in season 3. The story is good and it give the whole in depth backstory of all the players. This backstory helps viewerunderstand why kuroko is so passionate about basketball. Plot of the story is also good which helps the anime to get viewer interested and watch it untill the end. Overall I would say the anime doesn't live upto the expectation that the viewers or I would say I personally had for this anime. In the end, I would say if you are fan of this anime series you should watch it but don't keep your expectations too high.",
            "date": "2015-07-04T11:15:00+00:00",
            "helpful_count": 56,
            "mal_id": 192298,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642154.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Npk005",
                "username": "Npk005"
            },
            "url": "https://myanimelist.net/reviews.php?id=192298"
        },
        {
            "content": "Brilliance, that's the most accurate term I can think of when describing pathetic Kuroko no Basket anime series. To me it's something so exciting and so addicting that I can't help but love it, even for someone who doesn't really care for basketball such as myself. Basically what the third season of this series covers is the Generation of miracle's lives in middle school and the conclusion of the winter cup. So what does this season do correctly? Well season 3 doesn't only supply character development, it introduces an awesome character namely Akashi. What makes Akashi great character is his whole split personality characteristic, andhis emperor eye ability which give his character some more spice. But season 3 triumphs in being just as exciting and engaging as the previous two seasons. Some of the characters also gained new abilities which made the games even more exciting then they already were. The music and voice acting are both great. The music really gets you pumped up and the opening themes are excellent. What I also liked is during some scenes past opening and ending themes make appearances in the background so that they don't feel completely lost. The artwork looks really good especially with all of the special abilities and it really does these moves justice. The story is very good although it does include many shounen tropes though I didn't mind too much. Characters were also developed well this season especially the Generation of miracles during the Teiko arc. The conclusion was also satisfiying and I was happy with the ending. \\n\r\n In conclusion I enjoyed kuroko no basket season 3 equally as much as seasons 1 and 2. It's still as exciting and fun as it always been with a great conclusion. And with the recent announcement of the new movie and the OVA I am excited as ever for more kuroko no basket content. And KNB is definitely one of my favorite shows of all time now, I enjoyed it that much.",
            "date": "2015-11-27T19:39:00+00:00",
            "helpful_count": 15,
            "mal_id": 204303,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4931947.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/711nono",
                "username": "711nono"
            },
            "url": "https://myanimelist.net/reviews.php?id=204303"
        },
        {
            "content": "*If you haven't watch the series yet, see my first season review instead. I also won't repeat the things I've said from my first season review.\r\nhttp://myanimelist.net/reviews.php?id=192244\r\nThe last season of Kuroko no Basket is the best among the 3. Sure, the pacing is much slower than the first two but the amount of impact that this season gave is high and it's a great thing.\r\nThis season resumes the Winter Cup after Seirin won against Yosei to get in to the Semi-finals. However, the main focus of this season is a lot more on Akashi, we will get to know Kuroko more on why he feels thisway and why he is really determined to beat the Generation of Miracle players. This season did a great job on building up the tension on Akashi thus, it gives us the atmosphere on who Akashi really is. For Kuroko, they show us the flashback of him during his middle school days where he was still with the Teiko High. This arc is called \"Teiko arc\" which spanned 4 episodes. Teiko arc is kind of corny but the way it was executed was really well done.\\n\\n\r\nHere's the thing though - the ending is not unique but why bother? If you want \"them\" (Had to do that to avoid spoilers) to lose then the whole build up of the story is useless. The show does try their best to make the ending unpredictable but come on, we all know who is going to win and take home the Winter Cup.\\n\\n\r\nThe animation is outstanding. From season 1 to season 3 the animation just keeps getting better and better. Sure, the coloring is not unique but hey, at least it isn't lazy (*Cough* Studio Pierrot *Cough*). The smooth animation when they play basketball was produced very well. Also, the superpower animation (Which can be corny for some), well, I thought it looks great especially the Direct Drive Zone. Production I.G. did a great job.\\n\\n\r\nOverall, I enjoyed this show a lot. This show took me on one heck of a ride and I am going to miss this show. Will you enjoy this anime? Corny or not, try watching it because of the sense of thrill that this show offers. Even though sports anime isn't your genre, watch it. This is actually my very first sports anime and now it has come to an end. So, if I like it, you might like it too.\\n\\n\r\nScore: 9.6/10",
            "date": "2015-07-04T01:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 192251,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FurankuSan",
                "username": "FurankuSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=192251"
        },
        {
            "content": "I'm gonna say it and i'm gonna say it now: KnB is the most predictable, shounen-like and overrated anime i have ever seen. We all know why it's rated so high: it is very enjoyable and flashy. It's like a weak version of Bleach, with more cliches and totally unjustified powers, since we're talking about basketball, not shinigamis.\r\nThe reason KnB is so popular is that it tricks the audience by creating false tension: you're there like \"OMG this is so close, i don't know who will win\" but actually know who's gonna win (Spoiler, but no spoiler).\r\nAnd this brings us to my next problem: EVERYGAME IS THE SAME, and i'm not even exagerrating. Seirin always has to play from behind and somehow win in the last second by 1 point, obviously dunked by our MVP Kagami. Guess what, you stupid writers: COMEBACKS LIKE THAT DON'T HAPPEN EVERY SINGLE TIME.\\n\\n\r\nThis anime doesn't even try to accurately depict basketball. It ignores a lot of aspects. Fouls only happen when the plot calls it and nobody ever misses a shot unless the enemy planned it all along. If somehow they do miss the shot, it is just to showcase a rebound battle (they don't even show the shooter). And don't even get me started on the powers. People told me that these things are entirely possible. I call it bullshit. Only NBA players can do stuff like that, if they're lucky. We're talking about japanese high-school students for god's sake!\\n\\n\r\nStory: 5/10\\n\r\nI couldn't care less about the whole Teiko backstory and even less about the games, since i knew all along who's gonna win. It's not something new at all, just about a team that wants to become the best in Japan. Why am i even talking about this?\\n\\n\r\nCharacters: 5/10\\n\r\nYou might find them enjoyable, but they completely lack any depth and are very one-dimensional: the ambitious red-head, the silent guy, the other silent guy, the four-eyes and the gentle giant. Most of them aren't worth mentioning, since the whole anime is about Kagami and Kuroko. I also have a huge problem with the \"bad guys\". Yeah, i called them bad guys, because every enemy of Seirin is depicted as a deuchebag that hates basketball and bullies his teammates. It tries to make you feel that it's right for Seirin to win, which is a really cheap trick if you ask me.\\n\\n\r\nSound and animtion: 10/10\\n\r\nThis is where Knb slightly redeems itself. I cannot argue that the OST is amazing and fitting for this type of show, and all those flashy moves are animated very beautifully.\\n\\n\r\nEnjoyment: 7/10\\n\r\nDespite all the flaws, i did enjoy KnB while hardly trying to turn off my brain as much as possible. It is an anime for everyone and everyone should enjoy it as a mindless piece of fun.\\n\\n\r\nOverall: 6/10\\n\r\nKnB, even though it had a lot of potential, fails miserably at being a sports anime and ends up being a generic battle shounen in disguise. Its presentation makes up for the lack of depth and realism, making it a somewhat enjoyable anime (that is, if you really try not to pay attention to details).",
            "date": "2015-09-08T11:34:00+00:00",
            "helpful_count": 14,
            "mal_id": 198108,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4497164.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Madness17",
                "username": "Madness17"
            },
            "url": "https://myanimelist.net/reviews.php?id=198108"
        },
        {
            "content": "This is my very first review EVER, so please bear with me. KnB is the first sports anime I've ever seen and actually finished. Starting from season one all the way til the last episode I literally just cried over twenty minutes ago. This story is great, you never get bored and it keeps you on the edge of your seat, believe me. The art is AMAZING! I'm a sucker for vibrant colors and good animations. The art is smooth and fits very well with the show. The sound is perfect. It adds to the intensity of the show and the emotions. All of thecharacters are likable. They are explained nicely and all of them develop well. I believe that everyone should watch this and everyone should enjoy it. If you don't you must be extremely critical. I don't see whats not the love about this anime. It's funny, intense, emotional and joyous all at the same time. I highly recommend this anime to anyone and everyone. I'd watch this eight times over in a row and still love it. All in all, watch this anime. You will not regret it, I promise.",
            "date": "2015-07-03T19:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 192222,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4383945.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/__blvckmvgic",
                "username": "__blvckmvgic"
            },
            "url": "https://myanimelist.net/reviews.php?id=192222"
        },
        {
            "content": "There's tons of sport genre anime .. \r\nThis anime shows a lot of motivation, and even sometimes feel you want to play basketball.\r\nOh did I forget about the feels in this anime , I really had a great time watching this and I totally did not regret watching this.\r\nA lot of  characters and different characteristic. I also like how each character personality brings impact to a game.\r\nThe way each school play as a team and every team have a unique play style.",
            "date": "2015-06-30T12:52:00+00:00",
            "helpful_count": 10,
            "mal_id": 191816,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3409711.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/vSword",
                "username": "vSword"
            },
            "url": "https://myanimelist.net/reviews.php?id=191816"
        },
        {
            "content": "I can't believe it just ended like that. I'm like nooo if anyone saw Akatsuki no Yona it ended just like that but in a different way of course. I just felt it ended to fast and man I wish it could be more. Anyway, I loved the skits the series had and the characters where reminiscing. The action. Movements. And Everything about it XD my favorites are Aomine and Kuroko since they're full of surprises and there reactions are priceless when the unexpected happens. The art in this anime is amaazing it really fits for a 2014-2015 anime and the sounds you can hearit just like in any basketball game. I usually don't watch sports or to many sports anime, but this one was exceptional and I enjoyed it very much. Bravo! \\n\\n\r\nI still wish there is more! I would recommend this anime to sports and non sports fan alike. It has the slice of life and uplifting moments you need to enjoy. \\n\\n",
            "date": "2015-06-30T17:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 191848,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/187157.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kaisui",
                "username": "Kaisui"
            },
            "url": "https://myanimelist.net/reviews.php?id=191848"
        },
        {
            "content": "(This review goes for all seasons)\r\nKnB was one of the most dinamic animes I already watched, a kind of dinamic that make you have suddenly goose bumps. \r\nIt apparently is a \"super-powers sports anime\", however, it is really close to reality, stop to watch NBA for a while, the same \"miracles\" that happen in KnB, happen in real games. Of course in KnB we have some visual effects here, others sound effects there, that for me give more life and adrenalin to the show.\r\nThe character development is cool, the generation of miracles is really charismatic (even being named according to hair color). As the sametime we have a lot of good characters in the teams (Kagami, Teppei, Momoi, Hayakawa, etc).\\n\\n\r\nUltimately, Kuroko no Basket bring us a great message, that you realize while the the character's personality are changing, the real meaning of the sports.",
            "date": "2016-01-18T09:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 208824,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4509465.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/poticardo",
                "username": "poticardo"
            },
            "url": "https://myanimelist.net/reviews.php?id=208824"
        },
        {
            "content": "SHITTY REVIEW\r\n-shamelessly presents-\r\nKuroko No Basuke\r\nNOTICE-THIS REVIEW IS FOR ALL 3 SEASONS\r\n**SPOILER FREE**\r\nnow before you start to read this review keep 3 things in mind\r\n1)KnB is my first actual sports anime(first one being One Outs which is heavily based on psychology)\r\n2)I know very little about Basketball(so there was very less part which I found unrealistic)\r\n3)I used to dislike sports because  of my weak body and disease of Asthma\r\nKnB is a anime that really pumped me up and made me go teary eyed thrice.So it was an amazing journey for me of 75 episodes.This review will try to tell what I enjoyed.\r\nStory[7/10]-I will be blunt Thestory is full of cheesiness.But what makes KnB an amazing journey is the goal our main MC has and that is to beat generation of miracles and each match full of tension and excitement.The matches are well scripted and each one has satisfying conclusions where the winner and the losers were on equal level .The ending made me cry because how satisfying it was.\\n\\n\r\nArt{8/10}-One of the main difference that can be seen in each Season was that the visual becoming better and better.We are talking of production I.G here so course the visual were good.I was fascinated by the motion of each basket when the ball  was put  through it.\\n\\n\r\nSound(10/10)-First thing first KnB has this awesome soundtrack which will make you adrenaline rushed.The Voice  acting were amaZing especially of Akashi and Kuroko.The first OP is the best but other were also nice and EDs too.\\n\\n\r\nCharacter[9/10]-Now the thing that really makes KnB awesome is the characters.There was not a single character which I hated or found useless.I was feeling the emotions of every main character their sadness at the loss,tension during the match,love for basketball,trust in teammates  etc, each one of them.and every single freaking single character has development except few.\\n\\n\r\nEnjoyment{10/10}-I will define my enjoyment  in 2 statements\\n\r\n1st I became teary eyed thrice(record for a anime)\\n\r\n2nd I do everyday some kind of physical workout now\\n\r\nHell Yeah I enjoyed it\\n\\n\r\nOverall-If you do not mind unrealness  and cheesiness whether a sports freak or not I really recommend KnB to you.\\n\\n\r\n PS-If you find my review helpful please help me by telling which part it was at my profile and those of you who desperately wanted the 'not helpful' button there to be clicked plz you too tell the fault in our stars uh I mean review at my profile.\\n\\n\r\nThank You for Reading This\\n\\n\\n\\n\\n\\n",
            "date": "2015-09-23T09:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 199324,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4625315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheGeniusBaka",
                "username": "TheGeniusBaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=199324"
        },
        {
            "content": "Kuroko no Basket's 3rd season kicks it up a notch and improves the anime. The art is pretty good in this season and has improved since the beginning of the show. The sound is decent and the intros for this season and the intros are okay. The characters are great and are really fun to watch all the different players on screen. You get to know the characters a bit more which is great. It is very enjoyable to watch and makes you want to go to the gym and play basket ball. The story is great and this season makes for a great endfor the show even though they are scheduled for a fourth season. Overall it's a great season and you learn about the final players from Teiko which was really fun to watch.",
            "date": "2016-09-15T07:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 229079,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5454001.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/phillipbrule",
                "username": "phillipbrule"
            },
            "url": "https://myanimelist.net/reviews.php?id=229079"
        },
        {
            "content": "So this is my first review, so any feedback would be nice :3\r\nStory- 10/10\r\nThis is basically a continuation from the first 2 seasons, following the match after Yosen. The story heads at a steady pace, and we are notified of a match between Kise and an Teiko member who had once quit basketball to start this intense anime up. All episodes didn't have any flaw in the story, and if it did, it would of been barely noticeable. We are also given interesting and detailed backstories to some of the characters and get to see how they had gotten to where they are now. Thegames are even more exciting and suspenseful which just take your breath away.\\n\\n\r\nArt & Animation- 9/10\\n\\n\r\nArt & Animation are even better then the other 2 season. This is noticeable in the games with the brilliant passing, dribbling, shooting, etc. And this is taken to the next level in the last few episodes which is absolutely breath taking.\\n\\n\r\nSound- 9/10\\n\\n\r\nThe sound in this anime is outstanding, with amazing soundtrack which makes everything more intense, suspenseful and even emotional at points. All the OP's and ED's are all well done, which are all catchy and just nice to listen to.\\n\\n\r\nCharacter- 10/10\\n\\n\r\nThe characters in this season are even better developed and attachable (Or hated depending on which character it is), and is always interesting in what they think and say, how they play in the games and how important their role is in each match. It's always nice hearing Seirin and the other team encouraging each other no matter how bad they screw over their play.\\n\\n\r\nEnjoyment- 10/10\\n\\n\r\nThe enjoyment is perfect, each episode gets you pumped for the next and is always worth watching. Every game scene, flashback, and conversation is enjoyable and intriguing to watch, that while the other parts like the story, art & animation, sound, characters just make this one of the best anime out at the moment. \\n\\n\r\nOverall- 10/10 \\n\\n\r\nOverall this anime is highly enjoyable, and will leave you wanted more and more. I highly recommend it to anyone who likes sports anime, and even those who like comedy, shounen and school. \\n\\n\r\nThank you to those who had read this review, I look forward to making more in the future :3\\n",
            "date": "2015-07-16T05:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 193546,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4417205.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xvRevolution",
                "username": "xvRevolution"
            },
            "url": "https://myanimelist.net/reviews.php?id=193546"
        },
        {
            "content": "[Minor Spoilers]\r\nIf you are already 2 seasons into this, you have finish this and see the famed Akashi in action. Unfortunately, it was not as good as the previous BUT it had a great ending episodes. My main issue was you could tell the show was out of steam at the end. What made Kuroko No basket good was that the shounen abilities had explanations that made some kind of sense. That's until Kagami used ZONE three times that turned an unique ability to something he can unlock any time without consequence. And that's the worst part, there's no consequence which makes it too farfetched and forced. I didn't mind Akashi's Emperor Eye being overpowered, but him being able to alley hoop and run from one end to another in a fraction of a second? For Yousen, it made sense. He's tall with long limbs which gave him the extended reach. For Akashi, there was no need or overpower him in every way, his ability was powerful enough.\\n\\n\r\nBut once again, there were amazing reveals. Kuroko Quasi Emperors Eye impressed me with how it countered Akashi's. Frankly people talk about Kagami being too overpowered but can we appreciate how well sculpted Kuroko's character is in terms of ability? He has clear flaws and clear advantages which make his accomplishments not so much as an asspull (besides Misdirection Overflow). It just boils down to that he uses his head to maneuver his opponent whereas Kagami just tries harder. \\n\\n\r\nIt was still a good season, Akashi was worth the wait. Understanding how the Generations of Miracles came to be was interesting, along with Akashi's role fitted very well. The soundtrack could have been much better because it was average for such an important season. The animation held up well when it mattered although I didn't get the point of all the flashy colours during the deeper ZONE at the end. \\n\\n\r\nPutting Aomine matchup at the start was a bad idea. In my eyes that should have been a show down left for towards the end. And in an ideal world I would love to see Aomine versus Akashi. THAT would've been a better match up.\\n\\n\r\nStory - 9\\n\r\nYousen and Akashi and how the Generation of Miracles came to be was very interesting\\n\\n\r\nSoundtrack - 5\\n\r\nThe Opening and Ending Soundtracks could have been so much better.  It was the worst OST out of the 3 seasons, which is disappointing.\\n\\n\r\nArt - 8\\n\r\nIt held up well especially at the end and during Kise's bout.\\n\\n\r\nCharacters - 7\\n\r\nThe antagonists were all great with their own abilities.\\n\\n\r\nEnjoyment - 7\\n\r\nI enjoyed it and the ending was worth it with me but could have been so much better!\\n\\n\\n\\n\\n",
            "date": "2016-07-14T08:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 223994,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5172188.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/abovetheveil",
                "username": "abovetheveil"
            },
            "url": "https://myanimelist.net/reviews.php?id=223994"
        },
        {
            "content": "The final season of Kuroko no Basket is pretty epic to me. This whole anime in general is good to watch, especially for basketball fans like myself. Although the moves and techniques used in this anime were unrealistic, it is still enjoyable to watch.\r\nThe plot for this season was amazing. The characters are introduced and explained well. It is explained why they like basketball or why they do what they do. There we also humor inserted along the exciting moments. The comedy is enjoyable and you laugh a lot at it. The basketball itself is amzing that it kind of sends a chill down yourspine.\\n\\n\r\nSo if you like superpowered basketball or just basketball in general, then this anime would good to watch. :)",
            "date": "2015-07-31T05:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 194795,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4782151.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zeroian101",
                "username": "zeroian101"
            },
            "url": "https://myanimelist.net/reviews.php?id=194795"
        },
        {
            "content": "Edit: Review has been updated to when I have seen all the series' three seasons and even rewatched it:\r\nThis review also takes into account season 1, 2 and 3\r\nStory: 10 because I felt each turn was just amazing every time\r\nArt: 10 because of the amazing visuals and the aura of the characters\r\nSound: 10 because of the amazing openings and sound tracks\r\nCharacters: 10 because I just loved every single characters different characteristics\r\nEnjoyment: 10 because I utterly loved every single second of it\r\nOverall: 10 because it one of my most favourite anime's!!!\r\nMy list for the strongest players in the series:\r\n1) Akashi Seijuro because he has been provento be the strongest plus his Emperor Eye is the only ability Kise Ryota cant perfectly copy and he never loses because he is absolute\\n\r\n2) Kise Ryota because his Perfect Copy allows him to be all the generation of miracles in one and has the unlimited potential to have his perfect copy last the whole game with his only limiting factor because what he is physically able to do which could be a problem for him if the others improve further past his limit such as shown by how Kise is 5cm smaller than Aomine but since he is a miracle it shouldn't be a problem \\n\r\n3) Aomine Daiki because he has been proven to still be stronger than Kagami Taiga one on one and has more unlimited raw natural talent out of all of the generation of miracles \\n\r\n4) Kagami Taiga since he has been proven to be weaker than Aomine Daiki because he doesn't have the unlimited natural talent Aomine has but is still his equal because they both have the animal instinct and have similar heights with Kagami being only 4cm smaller than Aomine which could be seen as a microcosm of Aomine being better than Kagami\\n\r\n5) Murasakibara Atsushi since it is proven he is one of the strongest shown by how he has the most natural physical ability in basket ball shown by how he is the tallest out of all of them at 208cm when basket ball is a height dependant sport but the reason he is only 6th is because he will always concede against Akashi and has been shown to be defeated by the weakest member of the generation of miracles: Kuroko Tetsuya which means that he is defeated by the two juxtaposing ability's of Akashi and Kuroko who he is limited to never defeating them unlike the others who arn't but also since the other characters are also miracles they would not be defeated by only physical ability when you consider their own ability's\\n\r\n6) Midorima Shintaro because he has mostly reached the full extent of his power since he first must rely on his team mates to utilise his sky direct three-point shot and though his ability to score three pointers from anywhere on the court is strong because when he is facing other miracles and their insane ability's his three point shots are easily stopped by all their ability's so he is one of the weakest \\n\r\n7) Kuroko Tetsuya because though he has some of the most amazing ability's and Kise Ryota can not copy his misdirection ability's at all he is set as the weakest because he is a member of the miracles but he must rely on his team mates other to be adequate since he is a shadow but otherwise he losses his ability's and though Kuroko is impressive since he has strong ability's that allowing him to coexist with fellow members of the generation of miracles unlike the others who when are forced together cause the team diffract he is still last though his role and ability's are different \\n\r\n8) Momoi Satsuki Since she is also a member of the generation of miracles but she is last because though she doesn't play basket ball and he role is as a manager she is last because Akashi Seijuro is better than her at her field\\n\\n\r\nTatsuya Himuro and Shōgo Haizaki were not included in this list because it has been stated that they are not miracles and are limited in ability and just not on the level of the generation of miracles shown by how they are unable to over come the barrier and enter the room of the generation of miracles like Kagami did so they are not able to enter the zone.",
            "date": "2016-02-29T13:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 211963,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4776806.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Regret--",
                "username": "Regret--"
            },
            "url": "https://myanimelist.net/reviews.php?id=211963"
        },
        {
            "content": "I just want to start off by explaining my stance on sports anime. For the most part I tend to dislike them. It's not that I don't like sports, in fact I partake in both tennis and golf in real life on a regular basis. My issue with a lot of sports anime is that they tread a strange line between trying to be realistic and give an accurate presentation of that sport whilst stretching the realism of said presentation to the limits. This grey area between fiction and non-fiction often results in a uninvestable environment. My other big problem with sports anime is theprodigy factor. Not that they're in the show but rather the way they are presented. Unbeatable, god-like, plot armoured. Keeping this in mind let's look at Kuroko no Basket 3.\\n\\n\r\nThat treading thing I spoke of is here, at least to some extent. So immediately it would appear it's failed the first of two challenges and yet it also hasn't. I feel season 1 definitely falls for it and season 2 to a lesser extent, but season 3 is different. By season 3 you get the feeling that the writer no longer is trying to portray a realistic game of basketball. The focus on super-human abilities, the usage of ZONE to amplify yourself beyond human capabilities and just general acts of ridiculousness. With all this happening I stopped getting the sense this was even pretending to be anything like real basketball anymore. By the way, that's a good thing. You want to know something? If I wanted to watch something that was like real basketball, I'd watch real basketball. What I want though is a unique and interesting, fictional take on a real sport, something season 3 of Kuroko most definitely delivers. So, test 1 passed.\\n\\n\r\nSo, what about the prodigies? They are most certainly there as the term 'Generation of Miracles' is thrown around like a basketball itself. The show sure loves to remind you how great these people are and how even thinking of facing them will be met with hopelessness and demise. It can get tiresome to be honest. Outside of this we have Kagami and Kuroko who are sort of prodigies, it's hard to tell. They constantly go on about how Kagami is the 'Ace of Seiren' and how he has 'opened the door to the Generation of Miracles' and yet I never really got the same feeling I did from the originals. At no point did I actually think he was a prodigy. Sure, a very talented player but not some kind of god figure like I’m seeing in Akashi and Aomine. So it seems Kuroko has done an okay job here. We aren't seeing the story being presented from one of the predictable prodigies and whilst they do feature in the story it's the opponents that possess them. Just a heads up whilst we’re discussing predictability. Kuroko no Basket is extremely predictable. You know what’s going to happen because it literally has to happen for it to have a decent narrative. Seirin have to win their important games or else it’d feel incomplete. So what you are really getting in this series for is to discover their journey on how they win. If you don’t like knowing the end result, avoid this.\\n\\n\r\nOkay, I'll admit the over-dramatising is pretty bad. You have these high school guys screaming their face off at a game of what is effectively amateur basketball. I'll willing to give it the benefit of the doubt though as this over-dramatic narrative is usually accompanied by some genuinely interesting developments of skill. Also, they actually show the character's improving over time through real training. How lazy anime has come in this respect annoys me. Not only sports shows but more or less any coming of age or character development focused narrative really. They will just say \"The power of friendship is powering him up!\" and we're  just supposed to accept that? It's fine to have a theme of friendship, or in Kuroko no Basket’s case; teamwork, but that can't explain everything on its own. You need the training and skill development segments too. So I've addressed my big problems with sports anime and it seems Kuroko no Basket has passed all of them well enough. Fantastic. Let's have a look at the other sections too then. \\n\\n\r\nThe sound elements of Kuroko are it's weakest element sadly. Season 3's OPs are all forgettable as far as I'm concerned and even the EDs drop off here. In season 2 we had \"FANTASTIC TUNE\" by Kensho Ono which I thought was pretty... well... fantastic. Here in season 3 though I didn't find a single OP or ED that appealed to me. I tried to enjoy them but it wasn't long before the skipping to the main episode took place. As for the OST itself they've managed to get a nice mix of music (from electro, urban all the way to rock and opera-esc). Unfortunately out of the 31 songs featured in season 3's OST, not one of them is worth listening to outside of the show. The music doesn't really detract from the overall series but it also doesn't add much to it either. It serves a basic purpose whilst you watch the show but that's all it does. It never strives to be anything more than just 'okay'. If we want to stick to sports then Kuroko no Basket's soundtrack is the equivalent of a par in golf. It's not too disappointing but you should be aiming for more.\\n\\n\r\nSince we're looking at the technical elements I may as well quickly cover the art. In short it's very nice really. It fulfils my need to have a comfortable aesthetic to view but doesn't quite reach the peak of what anime is capable of. The stronger point of Kuroko is its animation. There are occasional still shots but for the major events and the majority of important plays, we get slick and smooth animated shots. The camera doesn't half love taking unique positions too as it sways all over the place. It certainly creates a sense of excitement using a very simple technique in this respect. I really liked how the expression of characters is shown with the clarity of their feelings becoming apparent to the viewer at all times. There's a nice transition between utter dedication and playful banter from scene to scene. These subtle animation shifts do a lot to give small yet important impressions of the characters to the audience. I can always appreciate small touches of detail as it shows effort and thought has been put it.\\n\\n\r\nAll in all Kuroko no Basket as a whole fixes a lot of the problems I've got with sports anime. The third season though is the stand out one by a considerable distance. I didn't go too much into detail about the story as it's very simple, yet effective but the inclusion of the small Teiko Middle School arc within season 3 puts it ahead of the other two in my opinion. The art is satisfying and refined and the sound is average but competent at the very least. The characters range hugely from people I love (Kuroko himself is great) to those I completely loathe (Akashi's writing annoys me. He's a third psycho, a third loving friend and a third insane. It makes little sense and his development is too rushed). I guess there's a very easy way of judging this show. If I honestly ask myself \"Does Kuroko no Basket 3 do everything I want from a sports show?\" then the answer is a simple yes. On this basis alone, it's worth your time.",
            "date": "2016-04-17T10:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 216577,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4855894.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KurtJP35",
                "username": "KurtJP35"
            },
            "url": "https://myanimelist.net/reviews.php?id=216577"
        },
        {
            "content": "I think I burned calories while watching this season. Seriously, that's how fast my heart was beating the whole time.\r\nThe first thing on my mind to mention with this season is the stellar change of pace it brought in the beginning. It's hard to explain, but up til now, Seirin had been playing against fearsome opponents, all of which caused a certain amount of rage to bubble up within the team--especially Kagami. However, in their battle with Kaijo, that was lacking for the most part. The absence of this hostility wasn't bad, though--in fact, it was refreshing. Since Seirin had already played Kise and Kaijoonce before in the first season, they were actually able to play a normal game against them, and also have some fun with it. That probably mostly stemmed from the fact that the two teams have a high respect for each other and they didn't underestimate each other. That change of pace, though still extremely suspenseful and intense, was simply fun to watch. It wasn't as anxiety-inducing as everything else that had lead up to this point. To me, that game was masterfully done. \\n\\n\r\nThis season also fully introduced Akashi, who is probably the most intricate character in the series. The way Kuroko no Basket laid out his character was immaculate, albeit confusing at times. Without giving too much away, this anime was very good at giving out little pieces of plot at a time about Akashi. It shrouded him in complete mystery until their game with him, where it all came to light. The slow incline to a sharp climax was very interesting to watch. Overall, the storytelling methods of this anime are very skilled. \\n\\n\r\nI could talk a lot more about the quality of this anime, but the last really important thing to touch on is how well it pulls on your heart. It really is a touching anime to watch, whether Seirin wins or loses. The suspense building, as I've said in previous reviews of Kuroko no Basket, is nearly untouchable by other anime. It will toy with your emotions so fiercely. One moment you'll be able to see victory for Seirin, and the next--with one single move of retaliation from the opponent--you'll think they don't have a chance. It's also very good when it comes to the characters' wills. Will they be able to hold out until the end of the game psychically and mentally? Who knows? Literally anything can happen. No one route of story is assured. And through all of that, you're feelings will be all over the place. That's what makes this anime great.\\n\\n\r\nHey, I even had the ending spoiled slightly for me, and I still couldn't get my emotions in check during the games. I still thought the outcome would be different from what I knew it would be. \\n\\n\r\nSorry I couldn't give actual example from the anime, but spoilers are terrible, so I'll just leave it up to you to go watch this yourselves. It's the best season yet.",
            "date": "2018-08-18T14:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 286826,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=286826"
        },
        {
            "content": "I never really gave the sports anime a chance, but after watching the first \r\nI couldn't help but watch the second. Of course, that lead to the third season.\r\nNow, this anime isn't what I would call a realistic anime, but the story and art was amazing, along with the music and humor. The characters, each, has their own unique person  and abilities, and especially the main characters have.\r\nBut the third season seriously took my breathe away, the last episode was worth waiting for. \r\nWhat I liked the most was the brotherhood and abilities of the main characters.\r\nThe hitstory between the GOM was very interesting.\r\nLikea bit of drama, competition, hot main characters, this is something I recommend. \\n\r\nAmazing work.",
            "date": "2018-07-25T10:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 284757,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6738220.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Craneface",
                "username": "Craneface"
            },
            "url": "https://myanimelist.net/reviews.php?id=284757"
        }
    ],
    [
        {
            "content": "******this review contain some spoilers ******\r\n-I gave all 3 seasons a score of \"1\" \r\n- This anime is really really horrible \r\nNothing can describe my hatred for this anime \r\n-I used to love this anime (in fact like) \r\nWhy i gave such a score? \r\n- It's too cliche this anime is called kuroko no basket, not Akashi no basket or GOM no basket.\r\n-I watch the same thing for 75 times. \r\n-I hate kuroko \r\n-The author really using any method to make kuroko win the winter cup \r\nStory (5) \r\nNothing much to say as you guys can predict. As usual the characters are competing against eachother in basketball and there's always a winner and loser. Without fail kuroko is gonna win in the end. And I'm right! When they lose they learn something then then they win again. This goes on and on. \\n\\n\r\nArt (6) \\n\r\nNot much to say since the art is normal. Just that I really don't understand WHAT in the world is the black shadow under their neck? It's shadow? No, it has strips. Are they zebras?.... \\n\\n\r\nSound (6) \\n\r\nThe bgm is good. It makes people goes \"thump thump\" But not for me! Since i already know the fact that Seirin is gonna win in the end. In my opinion this anime's soundtrack is getting worse and worse. I do like that opening in season 1 though. \\n\\n\r\nCharacter (1)\\n\r\nHonestly I like Aomine and Kise a lot. But nothing is gonna change this \"1\". Kuroko is acting like he is the boss and knows everything. When he lose he cry . If not in game, the last minute he will thought of something which lead seirin to victory. If not, he will rely on his teammates . Then they win! He act as if seirin will not win if he is not there. And the way he play basketball and shoot is really complicating , for example : phantom shot , misdirection and worst lack of presence. All these doesn't make sense at all! I know this is shounen anime but ain't this abit too much? Why not put a \"magic\" or \"super power\" under the tag? This author is really trying to come up with all shorts of funny move and shoots to make seirin win. \\n\\n\r\nFor the whole character of this anime. They are already tired but they still have the strength to enter zone to run,shoot,block and win. What logic is this?... \\n\\n\r\nEnjoyment (1)\\n\r\nAs stated from above this anime has no logic. I came here to watch \"sports\" anime and not  \"magic\" or \"super power\" anime. \\n\r\nI realized something about this anime which really pissed me off. Which is whenever 1 team had a goal, the other team will hype up and say somethings then the next time the team (that didn't get the ball previously)\\n\r\nwill surely get the ball and will goal. A very good example: Teppei is blocking someone under the net. He failed. Then next time round there's a rebound he will surely get the ball and score. \\n\r\nAnd the score is either 1 point away from each other or many points away from each other (around 20-100 points) \\n\r\nThis anime has a logic of \"a mountain has a mountain taller than it\" In this case means that rakuzan enter zone 1st. But that is not the end! Because there is seirin in zone as well! Although we all know the fact that rakuzan is already very powerful.\\n\\n\r\nOverall, this is horrible. So i shall not waste so much of my time writing a view on this anime. So horrible that will surely gonna trauma my brain. \\n",
            "date": "2015-07-02T10:08:00+00:00",
            "helpful_count": 226,
            "mal_id": 192043,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3275659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeLoverAAA",
                "username": "AnimeLoverAAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=192043"
        },
        {
            "content": "At this point, Kuroko no Basket (Kuroko’s Basketball) is a series that needs no introduction. After two seasons of competitive gameplay, we have the third and final season to conclude the entire story based off the manga written by Tadatoshi Fujimaki. If you’re really anxious to see how the Winter Cup will be decided and who will earn the ultimate glory, then this is a must-see for KnB fans. Otherwise, I confess to myself that the third season is a bit of a hit or miss.\r\nFor starters, the third season still takes place in the same setting with Seirin High as the main focus. Notonly is Kuroko, one of the legendary Generation of Miracles, on the team but there’s also much we learn about the rest of his former teammates. \\n\\n\r\nThe third season already establishes the foundations of basketball, the most prominent players, and what’s at stake. As the previous seasons introduced most of the prominent rivals, there’s little need to bring new challengers. As such, expect this season to focus more on the existing players; characters such as the Generation of Miracles and Uncrowned Kings from Rakuzan. There’s also a good amount of history from behind the scenes for the main supporting players as well. And that’s really something to say about the show. Kuroko no Basket approaches its premise to characterize its players especially for the ones that the audience may care about the most. Other than Kuroko, we have the distinctive Generation of Miracles. We find out much more about them in ways that really makes us understand them beyond just on the court. It also gives the audience as a sense of appreciation for the reasons that Kuroko left behind his former team and is now part of Seirin High.\\n\\n\r\nAs with any competitive sport, basketball is no exception to rivalries. Early on the show, we can easily see rivalries that go head in head on the court. These include Kise Ryouta vs Shogo Haizaki, Seijuro Akashi vs. Shintaro Midorima, and later on Seirin vs. Rakuzen. A good portion of these matches are intimidating. And sticking with its shounen style, the show still pulls out its supernatural-like gimmicks with the players’ moves. Kise’s copycat and Akashi’s Emperor Eye are prime examples of this as we see how they can influence the outcome of a game. As much as this can be appealing, it really comes off as edgy and unrealistic. There’s little to relate with and most of the time, this season attempts to wow the audience with diehard efforts. By this time, it’s really repetitive and doesn’t bring much with these establishes gimmicks. The plus side of this might be the fact that the show still retains its electrifying energy. After all, basketball is a game that requires both the individual and collective effort of a team to succeed. And as one of the sports that requires constant movement on the court, the show creates its full throttle mood with delicacy. \\n\\n\r\nI mentioned this before but Kuroko no Basket has a lot of story written into each game. Players facing off often had a history in some way or form with one another. This doesn’t just include rivalries but friendships as well. For instance, Shintaro’s decision to join Shutoku High is influenced by his teammate, Kazunari Takao. Some episodes reveals more about each of the prominent players through its in-game storytelling. At the same time, it spawns emotions to connect players’ dedications and their reasons to play in the first place. So in essence, you could say that the show’s characters are all like chapters of a story with each episode progressing that said story.  However, some of these stories aren’t what can be really memorable. As Kagami already had plenty of development, there’s little more to improve his character. Instead, do expect a bit more focus on some of its other supporting characters with their own stories. \\n\\n\r\nKuroko no Basket is not a drama show. However, the drama it attempts to craft go in a lot of directions. I think the show at times is really trying to send a message of some sorts towards the audience. How does it try to get the message across? With a lot of intention to persuade the audience for what the players are trying to accomplish, the series really at time feels like it’s a sermon. Not that the speeches are anything malicious or in that particular way, but the series itself really should do more than just go with the usual cliché dialogues. However, I do give some praise to the characters’ performances throughout the majority of this season. On or off the court, it’s entrancing to see how they react and play with engaging momentum.\\n\\n\r\nFor the third time in a row, Production I.G. takes the task to produce a good quality show with its artwork style. Character designs and expression are well decorated on most terms to fit with their personalities. Each school that plays in this season also has its own distinctive uniforms that stands out in their own way. However, the most promising technical aspect is the shounen-style coordination of the gameplay. Kuroko no Basket is always known to pull out crazy moves that is beyond normal human comprehension. So what should you expect? The same intense elements of what you should be used to from the previous seasons. And that would be an excitement of powerful and compelling movements with clever camera angles, facial expressions, and emotional attachment. It communicates its message to the audience at how weak or strong a team is both individually, or in other cases, the players individually.\\n\\n\r\nSoundtrack relies mostly on itself to adapt the gameplay when it needs to be. The most noticeable feature includes thrilling timings when significant moves are made where the soundtrack plays a key role. Character voice mannerisms also retains its expectations although nothing really home to write home about compared to its OST. And on a more decorative aspect, there are various OP and ED theme songs that reflect the momentum of the third season. \\n\\n\r\nIt’s been a long ride. With over 70 episodes, various OVAs, and a franchise that makes basketball looks like a battlefield, you could say that the destination has finally be reached with everything it had to offer. Unfortunately, the third season isn’t a much improvement from before and the final game has a lot of the usual generic themes written in like a textbook. But is it worth watching in the end? I’d still say yes especially for fans eager to see who will win the Winter Cup. Anyone who is interested at learning more about the Generation of Miracles will also be in for a treat; despite the bit of rush in content based on the manga. It’s still a sensational feeling to realize the destination has finally been reached though.",
            "date": "2015-06-30T11:08:00+00:00",
            "helpful_count": 106,
            "mal_id": 191811,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=191811"
        },
        {
            "content": "Finally... I got to finish this anime. Even few hours after I finished watching, adrenaline still overflowing inside of me. I really enjoy this season. Okay, before reviewing, I have read all the manga chapters before the anime even started the third season. Even though I did enjoy reading it, I was not that hyped up for the ending... but the anime did the reverse. With solid story as the base, characters we have grown to love, animated in such an astounding way, this is one of the rare case when I feel more enjoyment with the anime. \r\nStory: 8/10\r\nAfter the winning the match againstYosen, Seirin team proceeds to semifinal facing Kaijou. In the same time, Shutoku vs Rakuzan. Both have fought hard, but in the end Seirin got to meet Rakuzan in the final. Before the final showdown, we are shown a flashback of the days of Kuroko with the Generation of Miracles back in Teikou middle school. Then.. yeah, the showdown. \\n\r\nThe storyline of the anime faithfully follows the manga, which makes me utterly happy.\\n\\n\r\nArt: 9/10\\n\r\nProduction I.G outdone itself once again. While the previous seasons are good, this season is particularly so much better. With more flashy opening sequence, better and smoother animated movements... Knowing a bit about 2D animation, I am in awe thinking how much frame they used to make those pose, passes, throws, shoots very smoothly. Dribbles and drives are especially better here. They may use a bit of CG but it is used very efficiently and can blend rather well with the other animation. Effects like the Zone, Kuroko's magic passes are done very well too. \\n\\n\r\nColors are very bright and brilliant. I really love the flashback arc in particular. The colors of the sakura trees, sunset, inside of the stadium... everything is really pleasing to the eye.\\n\\n\r\nThe only thing keeping the art from getting 10/10 is.. sometimes the animation quality drops a bit and slight distortion in the character design at times. Nevertheless, it is really great.\\n\\n\r\nSound: 9/10\\n\r\nThis is one of the major factor that keeps the experience of watching anime better compared to reading the manga. Upbeat opening and ending songs, then background music that is pumping your energy during matches.. mellow music during sadder or reflective scenes... They make everything so much more exciting, grande and emotional when the time calls for it. \\n\\n\r\nSeiyuus / voice actors are doing their roles very well. ^^ \\n\\n\r\nCharacter: 10/10\\n\r\nIf you follow Kuroko no Basket since the very beginning, you will see a lot of development, both in the characters personally and how they interact with the others. After meeting Seirin, Generation of Miracles gets more humble and they got reminded of how fun playing basketball is. Well, they kinda lost the excitement of playing since they consecutively won with ease during Teikou days.. \\n\\n\r\nThen we got to see more of the first years in Seirin.. Furihata, Fukuda, Kawahara.. finally they got to enter the court at least. Also more screentime for Koganei, Tsuchida and Mitobe. The starters in Seirin has developed to the better too.. they have better teamwork and trust to support each other. Kagami is powered up some more.. Kuroko is no longer as stoic and expressionless compared to the very start. Kiyoshi, Hyuuga and Izuki also has their glorious moments. The other characters like the guys from Touou, Shutoku, Kaijou, Yosen, other schools that went against Seirin before are also shown. Basically everyone who have made their appearance in this series from season 1 appeared again, in the match or among the audience, contributing either by encouraging the cast or giving their observation about the match. This really highlights that the season 3 is really the final.\\n\\n\r\nEnjoyment: 9/10\\n\r\nAlthough the direction of the series may seem very clear and Shutoku vs Rakuzan is very one-sided, the matches are so hard for Seirin vs Kaijou making me brimming with excitement. I'm kinda sad the flashback (which is my most favorite part) is not that highlighted and only have 4 episodes. However, although short, they managed to cover the most important parts and tug in your heart, especially after Ogiwara's team went against Teikou. I really feel heartbroken along with Kuroko and Ogiwara. And when the final match is over, I also feel triumphant. \\n\\n\r\nOverall: 9/10\\n\r\nA really good way to wrap up the story of Kuroko Tetsuya and his basketball journey. \\n\r\nHighly recommended for sports lovers and of course, the fans of Kuroko no Basket manga. You won't be disappointed :) \\n\\n",
            "date": "2015-07-29T21:54:00+00:00",
            "helpful_count": 84,
            "mal_id": 194666,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2086837.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aikojazz",
                "username": "aikojazz"
            },
            "url": "https://myanimelist.net/reviews.php?id=194666"
        },
        {
            "content": "First of all, I will clear things out by saying, that I am a big fan of season 1 & 2 of this anime series. I liked almost everthing about those two anime. Eventhough with such a great prequels the third season felt a bit too repetitive. While watching this anime I felt like I have watched the same things in season one & two. The thing that I loved about the first two seasons was character development which was somewhat missing in season 3. The story is good and it give the whole in depth backstory of all the players. This backstory helps viewerunderstand why kuroko is so passionate about basketball. Plot of the story is also good which helps the anime to get viewer interested and watch it untill the end. Overall I would say the anime doesn't live upto the expectation that the viewers or I would say I personally had for this anime. In the end, I would say if you are fan of this anime series you should watch it but don't keep your expectations too high.",
            "date": "2015-07-04T11:15:00+00:00",
            "helpful_count": 56,
            "mal_id": 192298,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642154.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Npk005",
                "username": "Npk005"
            },
            "url": "https://myanimelist.net/reviews.php?id=192298"
        },
        {
            "content": "Brilliance, that's the most accurate term I can think of when describing pathetic Kuroko no Basket anime series. To me it's something so exciting and so addicting that I can't help but love it, even for someone who doesn't really care for basketball such as myself. Basically what the third season of this series covers is the Generation of miracle's lives in middle school and the conclusion of the winter cup. So what does this season do correctly? Well season 3 doesn't only supply character development, it introduces an awesome character namely Akashi. What makes Akashi great character is his whole split personality characteristic, andhis emperor eye ability which give his character some more spice. But season 3 triumphs in being just as exciting and engaging as the previous two seasons. Some of the characters also gained new abilities which made the games even more exciting then they already were. The music and voice acting are both great. The music really gets you pumped up and the opening themes are excellent. What I also liked is during some scenes past opening and ending themes make appearances in the background so that they don't feel completely lost. The artwork looks really good especially with all of the special abilities and it really does these moves justice. The story is very good although it does include many shounen tropes though I didn't mind too much. Characters were also developed well this season especially the Generation of miracles during the Teiko arc. The conclusion was also satisfiying and I was happy with the ending. \\n\r\n In conclusion I enjoyed kuroko no basket season 3 equally as much as seasons 1 and 2. It's still as exciting and fun as it always been with a great conclusion. And with the recent announcement of the new movie and the OVA I am excited as ever for more kuroko no basket content. And KNB is definitely one of my favorite shows of all time now, I enjoyed it that much.",
            "date": "2015-11-27T19:39:00+00:00",
            "helpful_count": 15,
            "mal_id": 204303,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4931947.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/711nono",
                "username": "711nono"
            },
            "url": "https://myanimelist.net/reviews.php?id=204303"
        },
        {
            "content": "*If you haven't watch the series yet, see my first season review instead. I also won't repeat the things I've said from my first season review.\r\nhttp://myanimelist.net/reviews.php?id=192244\r\nThe last season of Kuroko no Basket is the best among the 3. Sure, the pacing is much slower than the first two but the amount of impact that this season gave is high and it's a great thing.\r\nThis season resumes the Winter Cup after Seirin won against Yosei to get in to the Semi-finals. However, the main focus of this season is a lot more on Akashi, we will get to know Kuroko more on why he feels thisway and why he is really determined to beat the Generation of Miracle players. This season did a great job on building up the tension on Akashi thus, it gives us the atmosphere on who Akashi really is. For Kuroko, they show us the flashback of him during his middle school days where he was still with the Teiko High. This arc is called \"Teiko arc\" which spanned 4 episodes. Teiko arc is kind of corny but the way it was executed was really well done.\\n\\n\r\nHere's the thing though - the ending is not unique but why bother? If you want \"them\" (Had to do that to avoid spoilers) to lose then the whole build up of the story is useless. The show does try their best to make the ending unpredictable but come on, we all know who is going to win and take home the Winter Cup.\\n\\n\r\nThe animation is outstanding. From season 1 to season 3 the animation just keeps getting better and better. Sure, the coloring is not unique but hey, at least it isn't lazy (*Cough* Studio Pierrot *Cough*). The smooth animation when they play basketball was produced very well. Also, the superpower animation (Which can be corny for some), well, I thought it looks great especially the Direct Drive Zone. Production I.G. did a great job.\\n\\n\r\nOverall, I enjoyed this show a lot. This show took me on one heck of a ride and I am going to miss this show. Will you enjoy this anime? Corny or not, try watching it because of the sense of thrill that this show offers. Even though sports anime isn't your genre, watch it. This is actually my very first sports anime and now it has come to an end. So, if I like it, you might like it too.\\n\\n\r\nScore: 9.6/10",
            "date": "2015-07-04T01:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 192251,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FurankuSan",
                "username": "FurankuSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=192251"
        },
        {
            "content": "I'm gonna say it and i'm gonna say it now: KnB is the most predictable, shounen-like and overrated anime i have ever seen. We all know why it's rated so high: it is very enjoyable and flashy. It's like a weak version of Bleach, with more cliches and totally unjustified powers, since we're talking about basketball, not shinigamis.\r\nThe reason KnB is so popular is that it tricks the audience by creating false tension: you're there like \"OMG this is so close, i don't know who will win\" but actually know who's gonna win (Spoiler, but no spoiler).\r\nAnd this brings us to my next problem: EVERYGAME IS THE SAME, and i'm not even exagerrating. Seirin always has to play from behind and somehow win in the last second by 1 point, obviously dunked by our MVP Kagami. Guess what, you stupid writers: COMEBACKS LIKE THAT DON'T HAPPEN EVERY SINGLE TIME.\\n\\n\r\nThis anime doesn't even try to accurately depict basketball. It ignores a lot of aspects. Fouls only happen when the plot calls it and nobody ever misses a shot unless the enemy planned it all along. If somehow they do miss the shot, it is just to showcase a rebound battle (they don't even show the shooter). And don't even get me started on the powers. People told me that these things are entirely possible. I call it bullshit. Only NBA players can do stuff like that, if they're lucky. We're talking about japanese high-school students for god's sake!\\n\\n\r\nStory: 5/10\\n\r\nI couldn't care less about the whole Teiko backstory and even less about the games, since i knew all along who's gonna win. It's not something new at all, just about a team that wants to become the best in Japan. Why am i even talking about this?\\n\\n\r\nCharacters: 5/10\\n\r\nYou might find them enjoyable, but they completely lack any depth and are very one-dimensional: the ambitious red-head, the silent guy, the other silent guy, the four-eyes and the gentle giant. Most of them aren't worth mentioning, since the whole anime is about Kagami and Kuroko. I also have a huge problem with the \"bad guys\". Yeah, i called them bad guys, because every enemy of Seirin is depicted as a deuchebag that hates basketball and bullies his teammates. It tries to make you feel that it's right for Seirin to win, which is a really cheap trick if you ask me.\\n\\n\r\nSound and animtion: 10/10\\n\r\nThis is where Knb slightly redeems itself. I cannot argue that the OST is amazing and fitting for this type of show, and all those flashy moves are animated very beautifully.\\n\\n\r\nEnjoyment: 7/10\\n\r\nDespite all the flaws, i did enjoy KnB while hardly trying to turn off my brain as much as possible. It is an anime for everyone and everyone should enjoy it as a mindless piece of fun.\\n\\n\r\nOverall: 6/10\\n\r\nKnB, even though it had a lot of potential, fails miserably at being a sports anime and ends up being a generic battle shounen in disguise. Its presentation makes up for the lack of depth and realism, making it a somewhat enjoyable anime (that is, if you really try not to pay attention to details).",
            "date": "2015-09-08T11:34:00+00:00",
            "helpful_count": 14,
            "mal_id": 198108,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4497164.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Madness17",
                "username": "Madness17"
            },
            "url": "https://myanimelist.net/reviews.php?id=198108"
        },
        {
            "content": "This is my very first review EVER, so please bear with me. KnB is the first sports anime I've ever seen and actually finished. Starting from season one all the way til the last episode I literally just cried over twenty minutes ago. This story is great, you never get bored and it keeps you on the edge of your seat, believe me. The art is AMAZING! I'm a sucker for vibrant colors and good animations. The art is smooth and fits very well with the show. The sound is perfect. It adds to the intensity of the show and the emotions. All of thecharacters are likable. They are explained nicely and all of them develop well. I believe that everyone should watch this and everyone should enjoy it. If you don't you must be extremely critical. I don't see whats not the love about this anime. It's funny, intense, emotional and joyous all at the same time. I highly recommend this anime to anyone and everyone. I'd watch this eight times over in a row and still love it. All in all, watch this anime. You will not regret it, I promise.",
            "date": "2015-07-03T19:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 192222,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4383945.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/__blvckmvgic",
                "username": "__blvckmvgic"
            },
            "url": "https://myanimelist.net/reviews.php?id=192222"
        },
        {
            "content": "There's tons of sport genre anime .. \r\nThis anime shows a lot of motivation, and even sometimes feel you want to play basketball.\r\nOh did I forget about the feels in this anime , I really had a great time watching this and I totally did not regret watching this.\r\nA lot of  characters and different characteristic. I also like how each character personality brings impact to a game.\r\nThe way each school play as a team and every team have a unique play style.",
            "date": "2015-06-30T12:52:00+00:00",
            "helpful_count": 10,
            "mal_id": 191816,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3409711.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/vSword",
                "username": "vSword"
            },
            "url": "https://myanimelist.net/reviews.php?id=191816"
        },
        {
            "content": "I can't believe it just ended like that. I'm like nooo if anyone saw Akatsuki no Yona it ended just like that but in a different way of course. I just felt it ended to fast and man I wish it could be more. Anyway, I loved the skits the series had and the characters where reminiscing. The action. Movements. And Everything about it XD my favorites are Aomine and Kuroko since they're full of surprises and there reactions are priceless when the unexpected happens. The art in this anime is amaazing it really fits for a 2014-2015 anime and the sounds you can hearit just like in any basketball game. I usually don't watch sports or to many sports anime, but this one was exceptional and I enjoyed it very much. Bravo! \\n\\n\r\nI still wish there is more! I would recommend this anime to sports and non sports fan alike. It has the slice of life and uplifting moments you need to enjoy. \\n\\n",
            "date": "2015-06-30T17:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 191848,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/187157.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kaisui",
                "username": "Kaisui"
            },
            "url": "https://myanimelist.net/reviews.php?id=191848"
        },
        {
            "content": "(This review goes for all seasons)\r\nKnB was one of the most dinamic animes I already watched, a kind of dinamic that make you have suddenly goose bumps. \r\nIt apparently is a \"super-powers sports anime\", however, it is really close to reality, stop to watch NBA for a while, the same \"miracles\" that happen in KnB, happen in real games. Of course in KnB we have some visual effects here, others sound effects there, that for me give more life and adrenalin to the show.\r\nThe character development is cool, the generation of miracles is really charismatic (even being named according to hair color). As the sametime we have a lot of good characters in the teams (Kagami, Teppei, Momoi, Hayakawa, etc).\\n\\n\r\nUltimately, Kuroko no Basket bring us a great message, that you realize while the the character's personality are changing, the real meaning of the sports.",
            "date": "2016-01-18T09:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 208824,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4509465.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/poticardo",
                "username": "poticardo"
            },
            "url": "https://myanimelist.net/reviews.php?id=208824"
        },
        {
            "content": "SHITTY REVIEW\r\n-shamelessly presents-\r\nKuroko No Basuke\r\nNOTICE-THIS REVIEW IS FOR ALL 3 SEASONS\r\n**SPOILER FREE**\r\nnow before you start to read this review keep 3 things in mind\r\n1)KnB is my first actual sports anime(first one being One Outs which is heavily based on psychology)\r\n2)I know very little about Basketball(so there was very less part which I found unrealistic)\r\n3)I used to dislike sports because  of my weak body and disease of Asthma\r\nKnB is a anime that really pumped me up and made me go teary eyed thrice.So it was an amazing journey for me of 75 episodes.This review will try to tell what I enjoyed.\r\nStory[7/10]-I will be blunt Thestory is full of cheesiness.But what makes KnB an amazing journey is the goal our main MC has and that is to beat generation of miracles and each match full of tension and excitement.The matches are well scripted and each one has satisfying conclusions where the winner and the losers were on equal level .The ending made me cry because how satisfying it was.\\n\\n\r\nArt{8/10}-One of the main difference that can be seen in each Season was that the visual becoming better and better.We are talking of production I.G here so course the visual were good.I was fascinated by the motion of each basket when the ball  was put  through it.\\n\\n\r\nSound(10/10)-First thing first KnB has this awesome soundtrack which will make you adrenaline rushed.The Voice  acting were amaZing especially of Akashi and Kuroko.The first OP is the best but other were also nice and EDs too.\\n\\n\r\nCharacter[9/10]-Now the thing that really makes KnB awesome is the characters.There was not a single character which I hated or found useless.I was feeling the emotions of every main character their sadness at the loss,tension during the match,love for basketball,trust in teammates  etc, each one of them.and every single freaking single character has development except few.\\n\\n\r\nEnjoyment{10/10}-I will define my enjoyment  in 2 statements\\n\r\n1st I became teary eyed thrice(record for a anime)\\n\r\n2nd I do everyday some kind of physical workout now\\n\r\nHell Yeah I enjoyed it\\n\\n\r\nOverall-If you do not mind unrealness  and cheesiness whether a sports freak or not I really recommend KnB to you.\\n\\n\r\n PS-If you find my review helpful please help me by telling which part it was at my profile and those of you who desperately wanted the 'not helpful' button there to be clicked plz you too tell the fault in our stars uh I mean review at my profile.\\n\\n\r\nThank You for Reading This\\n\\n\\n\\n\\n\\n",
            "date": "2015-09-23T09:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 199324,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4625315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheGeniusBaka",
                "username": "TheGeniusBaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=199324"
        },
        {
            "content": "Kuroko no Basket's 3rd season kicks it up a notch and improves the anime. The art is pretty good in this season and has improved since the beginning of the show. The sound is decent and the intros for this season and the intros are okay. The characters are great and are really fun to watch all the different players on screen. You get to know the characters a bit more which is great. It is very enjoyable to watch and makes you want to go to the gym and play basket ball. The story is great and this season makes for a great endfor the show even though they are scheduled for a fourth season. Overall it's a great season and you learn about the final players from Teiko which was really fun to watch.",
            "date": "2016-09-15T07:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 229079,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5454001.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/phillipbrule",
                "username": "phillipbrule"
            },
            "url": "https://myanimelist.net/reviews.php?id=229079"
        },
        {
            "content": "So this is my first review, so any feedback would be nice :3\r\nStory- 10/10\r\nThis is basically a continuation from the first 2 seasons, following the match after Yosen. The story heads at a steady pace, and we are notified of a match between Kise and an Teiko member who had once quit basketball to start this intense anime up. All episodes didn't have any flaw in the story, and if it did, it would of been barely noticeable. We are also given interesting and detailed backstories to some of the characters and get to see how they had gotten to where they are now. Thegames are even more exciting and suspenseful which just take your breath away.\\n\\n\r\nArt & Animation- 9/10\\n\\n\r\nArt & Animation are even better then the other 2 season. This is noticeable in the games with the brilliant passing, dribbling, shooting, etc. And this is taken to the next level in the last few episodes which is absolutely breath taking.\\n\\n\r\nSound- 9/10\\n\\n\r\nThe sound in this anime is outstanding, with amazing soundtrack which makes everything more intense, suspenseful and even emotional at points. All the OP's and ED's are all well done, which are all catchy and just nice to listen to.\\n\\n\r\nCharacter- 10/10\\n\\n\r\nThe characters in this season are even better developed and attachable (Or hated depending on which character it is), and is always interesting in what they think and say, how they play in the games and how important their role is in each match. It's always nice hearing Seirin and the other team encouraging each other no matter how bad they screw over their play.\\n\\n\r\nEnjoyment- 10/10\\n\\n\r\nThe enjoyment is perfect, each episode gets you pumped for the next and is always worth watching. Every game scene, flashback, and conversation is enjoyable and intriguing to watch, that while the other parts like the story, art & animation, sound, characters just make this one of the best anime out at the moment. \\n\\n\r\nOverall- 10/10 \\n\\n\r\nOverall this anime is highly enjoyable, and will leave you wanted more and more. I highly recommend it to anyone who likes sports anime, and even those who like comedy, shounen and school. \\n\\n\r\nThank you to those who had read this review, I look forward to making more in the future :3\\n",
            "date": "2015-07-16T05:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 193546,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4417205.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xvRevolution",
                "username": "xvRevolution"
            },
            "url": "https://myanimelist.net/reviews.php?id=193546"
        },
        {
            "content": "[Minor Spoilers]\r\nIf you are already 2 seasons into this, you have finish this and see the famed Akashi in action. Unfortunately, it was not as good as the previous BUT it had a great ending episodes. My main issue was you could tell the show was out of steam at the end. What made Kuroko No basket good was that the shounen abilities had explanations that made some kind of sense. That's until Kagami used ZONE three times that turned an unique ability to something he can unlock any time without consequence. And that's the worst part, there's no consequence which makes it too farfetched and forced. I didn't mind Akashi's Emperor Eye being overpowered, but him being able to alley hoop and run from one end to another in a fraction of a second? For Yousen, it made sense. He's tall with long limbs which gave him the extended reach. For Akashi, there was no need or overpower him in every way, his ability was powerful enough.\\n\\n\r\nBut once again, there were amazing reveals. Kuroko Quasi Emperors Eye impressed me with how it countered Akashi's. Frankly people talk about Kagami being too overpowered but can we appreciate how well sculpted Kuroko's character is in terms of ability? He has clear flaws and clear advantages which make his accomplishments not so much as an asspull (besides Misdirection Overflow). It just boils down to that he uses his head to maneuver his opponent whereas Kagami just tries harder. \\n\\n\r\nIt was still a good season, Akashi was worth the wait. Understanding how the Generations of Miracles came to be was interesting, along with Akashi's role fitted very well. The soundtrack could have been much better because it was average for such an important season. The animation held up well when it mattered although I didn't get the point of all the flashy colours during the deeper ZONE at the end. \\n\\n\r\nPutting Aomine matchup at the start was a bad idea. In my eyes that should have been a show down left for towards the end. And in an ideal world I would love to see Aomine versus Akashi. THAT would've been a better match up.\\n\\n\r\nStory - 9\\n\r\nYousen and Akashi and how the Generation of Miracles came to be was very interesting\\n\\n\r\nSoundtrack - 5\\n\r\nThe Opening and Ending Soundtracks could have been so much better.  It was the worst OST out of the 3 seasons, which is disappointing.\\n\\n\r\nArt - 8\\n\r\nIt held up well especially at the end and during Kise's bout.\\n\\n\r\nCharacters - 7\\n\r\nThe antagonists were all great with their own abilities.\\n\\n\r\nEnjoyment - 7\\n\r\nI enjoyed it and the ending was worth it with me but could have been so much better!\\n\\n\\n\\n\\n",
            "date": "2016-07-14T08:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 223994,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5172188.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/abovetheveil",
                "username": "abovetheveil"
            },
            "url": "https://myanimelist.net/reviews.php?id=223994"
        },
        {
            "content": "The final season of Kuroko no Basket is pretty epic to me. This whole anime in general is good to watch, especially for basketball fans like myself. Although the moves and techniques used in this anime were unrealistic, it is still enjoyable to watch.\r\nThe plot for this season was amazing. The characters are introduced and explained well. It is explained why they like basketball or why they do what they do. There we also humor inserted along the exciting moments. The comedy is enjoyable and you laugh a lot at it. The basketball itself is amzing that it kind of sends a chill down yourspine.\\n\\n\r\nSo if you like superpowered basketball or just basketball in general, then this anime would good to watch. :)",
            "date": "2015-07-31T05:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 194795,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4782151.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zeroian101",
                "username": "zeroian101"
            },
            "url": "https://myanimelist.net/reviews.php?id=194795"
        },
        {
            "content": "Edit: Review has been updated to when I have seen all the series' three seasons and even rewatched it:\r\nThis review also takes into account season 1, 2 and 3\r\nStory: 10 because I felt each turn was just amazing every time\r\nArt: 10 because of the amazing visuals and the aura of the characters\r\nSound: 10 because of the amazing openings and sound tracks\r\nCharacters: 10 because I just loved every single characters different characteristics\r\nEnjoyment: 10 because I utterly loved every single second of it\r\nOverall: 10 because it one of my most favourite anime's!!!\r\nMy list for the strongest players in the series:\r\n1) Akashi Seijuro because he has been provento be the strongest plus his Emperor Eye is the only ability Kise Ryota cant perfectly copy and he never loses because he is absolute\\n\r\n2) Kise Ryota because his Perfect Copy allows him to be all the generation of miracles in one and has the unlimited potential to have his perfect copy last the whole game with his only limiting factor because what he is physically able to do which could be a problem for him if the others improve further past his limit such as shown by how Kise is 5cm smaller than Aomine but since he is a miracle it shouldn't be a problem \\n\r\n3) Aomine Daiki because he has been proven to still be stronger than Kagami Taiga one on one and has more unlimited raw natural talent out of all of the generation of miracles \\n\r\n4) Kagami Taiga since he has been proven to be weaker than Aomine Daiki because he doesn't have the unlimited natural talent Aomine has but is still his equal because they both have the animal instinct and have similar heights with Kagami being only 4cm smaller than Aomine which could be seen as a microcosm of Aomine being better than Kagami\\n\r\n5) Murasakibara Atsushi since it is proven he is one of the strongest shown by how he has the most natural physical ability in basket ball shown by how he is the tallest out of all of them at 208cm when basket ball is a height dependant sport but the reason he is only 6th is because he will always concede against Akashi and has been shown to be defeated by the weakest member of the generation of miracles: Kuroko Tetsuya which means that he is defeated by the two juxtaposing ability's of Akashi and Kuroko who he is limited to never defeating them unlike the others who arn't but also since the other characters are also miracles they would not be defeated by only physical ability when you consider their own ability's\\n\r\n6) Midorima Shintaro because he has mostly reached the full extent of his power since he first must rely on his team mates to utilise his sky direct three-point shot and though his ability to score three pointers from anywhere on the court is strong because when he is facing other miracles and their insane ability's his three point shots are easily stopped by all their ability's so he is one of the weakest \\n\r\n7) Kuroko Tetsuya because though he has some of the most amazing ability's and Kise Ryota can not copy his misdirection ability's at all he is set as the weakest because he is a member of the miracles but he must rely on his team mates other to be adequate since he is a shadow but otherwise he losses his ability's and though Kuroko is impressive since he has strong ability's that allowing him to coexist with fellow members of the generation of miracles unlike the others who when are forced together cause the team diffract he is still last though his role and ability's are different \\n\r\n8) Momoi Satsuki Since she is also a member of the generation of miracles but she is last because though she doesn't play basket ball and he role is as a manager she is last because Akashi Seijuro is better than her at her field\\n\\n\r\nTatsuya Himuro and Shōgo Haizaki were not included in this list because it has been stated that they are not miracles and are limited in ability and just not on the level of the generation of miracles shown by how they are unable to over come the barrier and enter the room of the generation of miracles like Kagami did so they are not able to enter the zone.",
            "date": "2016-02-29T13:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 211963,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4776806.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Regret--",
                "username": "Regret--"
            },
            "url": "https://myanimelist.net/reviews.php?id=211963"
        },
        {
            "content": "I just want to start off by explaining my stance on sports anime. For the most part I tend to dislike them. It's not that I don't like sports, in fact I partake in both tennis and golf in real life on a regular basis. My issue with a lot of sports anime is that they tread a strange line between trying to be realistic and give an accurate presentation of that sport whilst stretching the realism of said presentation to the limits. This grey area between fiction and non-fiction often results in a uninvestable environment. My other big problem with sports anime is theprodigy factor. Not that they're in the show but rather the way they are presented. Unbeatable, god-like, plot armoured. Keeping this in mind let's look at Kuroko no Basket 3.\\n\\n\r\nThat treading thing I spoke of is here, at least to some extent. So immediately it would appear it's failed the first of two challenges and yet it also hasn't. I feel season 1 definitely falls for it and season 2 to a lesser extent, but season 3 is different. By season 3 you get the feeling that the writer no longer is trying to portray a realistic game of basketball. The focus on super-human abilities, the usage of ZONE to amplify yourself beyond human capabilities and just general acts of ridiculousness. With all this happening I stopped getting the sense this was even pretending to be anything like real basketball anymore. By the way, that's a good thing. You want to know something? If I wanted to watch something that was like real basketball, I'd watch real basketball. What I want though is a unique and interesting, fictional take on a real sport, something season 3 of Kuroko most definitely delivers. So, test 1 passed.\\n\\n\r\nSo, what about the prodigies? They are most certainly there as the term 'Generation of Miracles' is thrown around like a basketball itself. The show sure loves to remind you how great these people are and how even thinking of facing them will be met with hopelessness and demise. It can get tiresome to be honest. Outside of this we have Kagami and Kuroko who are sort of prodigies, it's hard to tell. They constantly go on about how Kagami is the 'Ace of Seiren' and how he has 'opened the door to the Generation of Miracles' and yet I never really got the same feeling I did from the originals. At no point did I actually think he was a prodigy. Sure, a very talented player but not some kind of god figure like I’m seeing in Akashi and Aomine. So it seems Kuroko has done an okay job here. We aren't seeing the story being presented from one of the predictable prodigies and whilst they do feature in the story it's the opponents that possess them. Just a heads up whilst we’re discussing predictability. Kuroko no Basket is extremely predictable. You know what’s going to happen because it literally has to happen for it to have a decent narrative. Seirin have to win their important games or else it’d feel incomplete. So what you are really getting in this series for is to discover their journey on how they win. If you don’t like knowing the end result, avoid this.\\n\\n\r\nOkay, I'll admit the over-dramatising is pretty bad. You have these high school guys screaming their face off at a game of what is effectively amateur basketball. I'll willing to give it the benefit of the doubt though as this over-dramatic narrative is usually accompanied by some genuinely interesting developments of skill. Also, they actually show the character's improving over time through real training. How lazy anime has come in this respect annoys me. Not only sports shows but more or less any coming of age or character development focused narrative really. They will just say \"The power of friendship is powering him up!\" and we're  just supposed to accept that? It's fine to have a theme of friendship, or in Kuroko no Basket’s case; teamwork, but that can't explain everything on its own. You need the training and skill development segments too. So I've addressed my big problems with sports anime and it seems Kuroko no Basket has passed all of them well enough. Fantastic. Let's have a look at the other sections too then. \\n\\n\r\nThe sound elements of Kuroko are it's weakest element sadly. Season 3's OPs are all forgettable as far as I'm concerned and even the EDs drop off here. In season 2 we had \"FANTASTIC TUNE\" by Kensho Ono which I thought was pretty... well... fantastic. Here in season 3 though I didn't find a single OP or ED that appealed to me. I tried to enjoy them but it wasn't long before the skipping to the main episode took place. As for the OST itself they've managed to get a nice mix of music (from electro, urban all the way to rock and opera-esc). Unfortunately out of the 31 songs featured in season 3's OST, not one of them is worth listening to outside of the show. The music doesn't really detract from the overall series but it also doesn't add much to it either. It serves a basic purpose whilst you watch the show but that's all it does. It never strives to be anything more than just 'okay'. If we want to stick to sports then Kuroko no Basket's soundtrack is the equivalent of a par in golf. It's not too disappointing but you should be aiming for more.\\n\\n\r\nSince we're looking at the technical elements I may as well quickly cover the art. In short it's very nice really. It fulfils my need to have a comfortable aesthetic to view but doesn't quite reach the peak of what anime is capable of. The stronger point of Kuroko is its animation. There are occasional still shots but for the major events and the majority of important plays, we get slick and smooth animated shots. The camera doesn't half love taking unique positions too as it sways all over the place. It certainly creates a sense of excitement using a very simple technique in this respect. I really liked how the expression of characters is shown with the clarity of their feelings becoming apparent to the viewer at all times. There's a nice transition between utter dedication and playful banter from scene to scene. These subtle animation shifts do a lot to give small yet important impressions of the characters to the audience. I can always appreciate small touches of detail as it shows effort and thought has been put it.\\n\\n\r\nAll in all Kuroko no Basket as a whole fixes a lot of the problems I've got with sports anime. The third season though is the stand out one by a considerable distance. I didn't go too much into detail about the story as it's very simple, yet effective but the inclusion of the small Teiko Middle School arc within season 3 puts it ahead of the other two in my opinion. The art is satisfying and refined and the sound is average but competent at the very least. The characters range hugely from people I love (Kuroko himself is great) to those I completely loathe (Akashi's writing annoys me. He's a third psycho, a third loving friend and a third insane. It makes little sense and his development is too rushed). I guess there's a very easy way of judging this show. If I honestly ask myself \"Does Kuroko no Basket 3 do everything I want from a sports show?\" then the answer is a simple yes. On this basis alone, it's worth your time.",
            "date": "2016-04-17T10:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 216577,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4855894.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KurtJP35",
                "username": "KurtJP35"
            },
            "url": "https://myanimelist.net/reviews.php?id=216577"
        },
        {
            "content": "I think I burned calories while watching this season. Seriously, that's how fast my heart was beating the whole time.\r\nThe first thing on my mind to mention with this season is the stellar change of pace it brought in the beginning. It's hard to explain, but up til now, Seirin had been playing against fearsome opponents, all of which caused a certain amount of rage to bubble up within the team--especially Kagami. However, in their battle with Kaijo, that was lacking for the most part. The absence of this hostility wasn't bad, though--in fact, it was refreshing. Since Seirin had already played Kise and Kaijoonce before in the first season, they were actually able to play a normal game against them, and also have some fun with it. That probably mostly stemmed from the fact that the two teams have a high respect for each other and they didn't underestimate each other. That change of pace, though still extremely suspenseful and intense, was simply fun to watch. It wasn't as anxiety-inducing as everything else that had lead up to this point. To me, that game was masterfully done. \\n\\n\r\nThis season also fully introduced Akashi, who is probably the most intricate character in the series. The way Kuroko no Basket laid out his character was immaculate, albeit confusing at times. Without giving too much away, this anime was very good at giving out little pieces of plot at a time about Akashi. It shrouded him in complete mystery until their game with him, where it all came to light. The slow incline to a sharp climax was very interesting to watch. Overall, the storytelling methods of this anime are very skilled. \\n\\n\r\nI could talk a lot more about the quality of this anime, but the last really important thing to touch on is how well it pulls on your heart. It really is a touching anime to watch, whether Seirin wins or loses. The suspense building, as I've said in previous reviews of Kuroko no Basket, is nearly untouchable by other anime. It will toy with your emotions so fiercely. One moment you'll be able to see victory for Seirin, and the next--with one single move of retaliation from the opponent--you'll think they don't have a chance. It's also very good when it comes to the characters' wills. Will they be able to hold out until the end of the game psychically and mentally? Who knows? Literally anything can happen. No one route of story is assured. And through all of that, you're feelings will be all over the place. That's what makes this anime great.\\n\\n\r\nHey, I even had the ending spoiled slightly for me, and I still couldn't get my emotions in check during the games. I still thought the outcome would be different from what I knew it would be. \\n\\n\r\nSorry I couldn't give actual example from the anime, but spoilers are terrible, so I'll just leave it up to you to go watch this yourselves. It's the best season yet.",
            "date": "2018-08-18T14:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 286826,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=286826"
        },
        {
            "content": "I never really gave the sports anime a chance, but after watching the first \r\nI couldn't help but watch the second. Of course, that lead to the third season.\r\nNow, this anime isn't what I would call a realistic anime, but the story and art was amazing, along with the music and humor. The characters, each, has their own unique person  and abilities, and especially the main characters have.\r\nBut the third season seriously took my breathe away, the last episode was worth waiting for. \r\nWhat I liked the most was the brotherhood and abilities of the main characters.\r\nThe hitstory between the GOM was very interesting.\r\nLikea bit of drama, competition, hot main characters, this is something I recommend. \\n\r\nAmazing work.",
            "date": "2018-07-25T10:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 284757,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6738220.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Craneface",
                "username": "Craneface"
            },
            "url": "https://myanimelist.net/reviews.php?id=284757"
        }
    ],
    [
        {
            "content": "Alright, Kuroko no Basket, you got me. I didn't think I'd be writing this review, but here I am.\r\nI think my stance on the series is a fair bit unlike most others -- as I've sat through this show, I've constantly felt like it's just a bit away from *actually* being a very solid show. I wanted to watch something like Haikyuu!! and all the fans of KnB sent me here, telling me it's at least as good as Haikyuu is, or something like that. I was skeptical, but excited, and so I kept an open mind, hoping they were right.\r\nBut, for the first twoseasons, I was thoroughly unimpressed.\\n\\n\r\nLook, KnB isn't a *bad* show at all, but it falls flat in a lot of areas. It really is easiest to see that when you've seen an excellent show like Haikyuu to compare it with. The characters are flat, the backstories aren't particularly compelling, the games are rather predictable, and, for a basketball anime, there's awful little basketball happening on-screen, and that which does happen really isn't satisfying a lot of the time. It was a pain to sit through the first season at times, honestly. But it was fine, it had its redeeming moments, and it managed to score a 7.\\n\\n\r\nThe second season is where I think the show started to notice some of the flaws, and it was the beginning of the uphill climb. See, in the first season, the different team members were either barely on screen, or characterized by some simplistic ideal and a dramatic and mysterious backstory. Let's be clear: That isn't characterization. That's assigning trashy and generic anime tropes to characters, and pretending that they're suddenly people the audience will care about. And maybe some people turned off their brains and enjoyed this -- and that's fine! Good for them. But the way it was done, it felt insulting, honestly. Just like most of the show in the first season, actually. \\n\\n\r\nIt condescended to the audience, refusing to give them real characters and allow them some leeway to figure stuff out during the games and let them reflect on revelations themselves -- no, three separate characters had to say the exact same (blatantly obvious) thing on screen right after one another every single time. It's ridiculous, and I hated it. Oh, and I'm not going to pretend this stopped completely, either. This continues through the third season.\\n\\n\r\nWhat marked the change for me, though, was when we saw Kagami's childhood at the beginning of season 2. They didn't give the characters some set of ideals and these crazy dramatic interactions, they showed us two kids that loved basketball interacting. For the first time, it felt like I was seeing an *actual person* in the show. Unfortunately, this occurred minimally in the second season, and that plus the more interesting games (despite their predictability) barely scraped an 8.\\n\\n\r\nNow, the third season itself. It took the idea of actually using characterization (what a novel idea!) and ran with it HEAVILY, and thank goodness it did so, because the flashback arcs plus the fact that some characters had actually been developed in season 2 made the show feel a lot more real in this season, and despite the ridiculous \"yay the power of friendship wins again!\" second gate, the ending managed to pull all of the characterization in the past together to make the ending really satisfying, actually -- not the win itself, but all the characters cheering on the team, that is. And I have to say, in season 3, I actually did enjoy this show a fair bit.\\n\\n\r\nThat being said: It barely scraped a 9 for me, and I wouldn't be surprised if I pushed it down to an 8 fairly soon. Here's what should have been done better.\\n\\n\r\nFirst, the art. Seriously, what was up with the art? Very few of the plays felt satisfying because it all felt so rigid and the animation was so blasé most of the time. A couple of the instances of The Zone were really well done, and the one 3d bit towards the end of the season was fantastic -- we should have had a lot more animation on that level. Unfortunately, we really didn't get much action, and it suffered a LOT from that. Look at Haikyuu, on the other hand. Everything's so much more fluid, and even when it's not focusing on the game, the shots are moving or it's more interestingly animated, or something. The art was just underwhelming, and it could have been so fantastic given the material the artists had to work with.\\n\\n\r\nSecond, the monologues. Cut them. Please. We get it, your audience is incapable of thinking or something like that, but shut up and let us watch some basketball for once, guys. Again, Haikyuu does this better. There's some talking, sure, but it's less of \"wow look ten people are commenting on the game but somehow saying the exact same thing\" and more of \"hey look players are thinking and interacting\" and it's more concise and action often concurrently happens and it's just so much better done all around. And we want action! We want to see the game! But when 75% of the episode is still shots of people's faces or cutting to audience members that tell us what to think, how can we enjoy the focus of the show?\\n\\n\r\nAlso, as an aside, can we discuss the whole suspension-of-disbelief thing? Because KnB completely fails at this, and it really didn't need to. Stop hyping some of the powers up so much, and focus on how they're just extensions of normal skills used uniquely and well. I'd buy the crazy high-level play much more if they'd just provide a reasonable in-universe explanation, but often they really just didn't try. Sure, they got better at this later on, but it was too little too late. And people talking just happening to use the same metaphors independently of each other? Please, I don't need the \"epic\" anime monologue tropes, and I don't buy that. It doesn't feel natural, and it's done too often to ever feel like it's a thoughtful dramatic choice. Anyways, back to my main points.\\n\\n\r\nThird, the characters. Flashbacks are fine, but should be a secondary method of development, not a primary method. Show us the characters changing as people and as players throughout the show -- establish them as more than a one-trick pony, more than a simple ideology, and do it from the beginning of the show. Show us real interactions, not trope-filled generic skits. And yet again, Haikyuu does this excellently. It didn't take more than half a dozen episodes for that show to convince me that the characters were real.\\n\\n\r\nFourth, the games. Honestly, some games were tense, but really, the formula was obvious and predictable, and that took a lot of the fun out of it. Add to that the one-dimensionality of many of these games, and suddenly it's a lot less interesting. You know how Kise could use moves from past games? There's the bit that KnB missed out on. It didn't feel like Seirin was really learning from the past, so much as powering up and using their new superpowers against the new set of enemy superpowers. It was overdone, and often unexciting. And, yes, Haikyuu did this, too. An integral part of the character development in this show should be done in the games, on the field, yet KnB lacked that almost completely until the end of the 3rd season. Like most things KnB figured out, it was too little, too late to redeem the whole show.\\n\\n\r\nFifth, the plot. They lost once, to bait us with the possibility of losing, and that was it. After that, they always won, and the dramatic stakes disappeared. It just... didn't have much of a plot as far as the actual basketball went. I will say, however, that the whole conflict of ideologies bit *did* work when it came to the plot -- it created at least a little interest, and helped give the show a little push to propel it onwards. So good on KnB, it didn't completely fall flat when it came to the plot, but it's far from great. You guessed it -- Haikyuu does this better. Karasuno is no stranger to losing. There are stakes, and when the team wins, it's a legitimate cause for celebration.\\n\\n\r\nI think those are the main five things I'd want fixed about KnB.\\n\\n\r\nBecause, here's the thing: KnB was never bad. It's just never been great. And it could have been -- it had a LOT of potential! I'm just disappointed that it never really made it there. Season 3 was close -- if season 1 had been around this good, then I think the show as a whole would have done a lot better.\\n\\n\r\nFor what it's worth, though, at the end of the day, KnB was fun. And it's certainly worth watching. Not every show has to be a masterpiece -- it's just disappointing when a show isn't as good as it should have been.",
            "date": "2018-04-17T21:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 278356,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5285576.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shymain",
                "username": "Shymain"
            },
            "url": "https://myanimelist.net/reviews.php?id=278356"
        },
        {
            "content": "This is just about the worst anime segment I've ever watched. It's astounding there are so few negative reviews. \r\nMy take on the show? Absolute rubbish. Having seen the first two seasons of Kuroko, and rating them averaging at 7, I figured this would more or less follow suit.\r\nWrong.\r\nThe first two seasons had their own overly paranormal / logically unsound plot twists/ techniques , but the characters more or less mitigated how silly it was; as we are drawn to somewhat yearn for something to happen. It did have its corny developments, with forced polaric drama of being overwhelmed, then whimsically overcoming without necessarily tryinganything new, but this season just took it to another level.\\n\\n\\n\r\nCharacters 0/10\\n\\n\r\nConcept 0/10\\n\\n\r\nThis whole copy concept employed in the anime was overall just so absurd and inconsistent that I could barely bare the prior 2 seasons during the segments including Kise. He can essentially copy anyone, yet isn't winning every single game with ease. How do you justify that? He can mimick any foe hes vsing, and culminate it with his own arsenal. Idiotic. For instance, he could be mimicking a full court 3 pointer... \\n\r\nThe whole ''zone'' nonesense going from 80% to 100% is iditotic. Its also idiotic in its explanation of who can use it. 80 to 100 is only a 25% (relative) performance gain. 20/80 = .25 btw... \\n\\n\r\nYeah I'm kinda dragging on the prior seasons but everything they did wrong they do here and worse. \\n\\n\r\nEdit : he did eventually use Mimorikas throw, tho everything else still stands. \\n\\n\r\nCharacters 1/10\\n\\n\r\nFirst few episodes we are dealing with probably one of the most generic ''antagonists'' in the anime franchise. Each tongue lick induced a cringe sensation as I was overcome with how cheesy it is. The guy has absolutely no depth. One of the cheapest attempts to try to root for the other team. What is this, 1980 Disney?\\n\\n\r\nArt 4/10\\n\\n\r\nWhatever. The motions /techniques employed are quite plain / 2nd rate. Otherwise mostly average. \\n\\n\r\nEnjoyment 0/10\\n\\n\r\nThis is the worst sport anime season I've ever watched. I can't believe I wasted the 8 or so minutes to write this, but I figured there'd be many more hours of human hours lost being unproductive watching this filth. \\n\\n",
            "date": "2018-01-20T21:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 269191,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5727467.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/deathlytivo",
                "username": "deathlytivo"
            },
            "url": "https://myanimelist.net/reviews.php?id=269191"
        },
        {
            "content": "I personally think it is a very interesting sports-themed anime where there are multiple main characters with different extraordinary skills and how each of them have their own very distinct personalities and characters (even minor characters too)\r\nThe way the characters developments were presented in a unique way to the viewers through a series of flashbacks; which includes the different stories of the Generation of Miracles members during their middle school days were really entertaining.\r\nThe art style was also amazing and all the basketball court scenes were super engaging, cool and fun to watch. Especially when the characters start using their superpowers. Personal favourite sceneis the Kagami vs Aomine match-up. Although i still think that certain characters' powers are too overpowered.\\n\\n\r\nDespite it being one of those typical story where you know which team will win. It was also interesting to see the solutions the teams came up with to defeat different opponents with very different skill sets.\\n\\n\r\nI would definitely recommend this anime to those people who likes sports-action anime.",
            "date": "2015-11-10T00:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 203100,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/james95",
                "username": "james95"
            },
            "url": "https://myanimelist.net/reviews.php?id=203100"
        },
        {
            "content": "A non-spoiler review\r\nDespite the many bad and good things about this anime, I would overall rate it a strong 9.\r\nSome people have said that it is cliche - and I must admit, it was. The different coloured hair, so abnormal that it would make one cringe. Or maybe it was that not every character had a unique add-on?, and seemed like it belonged from some other anime. (Talking about you, green-head glasses guy)\r\nStory: 8\r\nIt may just be because I love sports anime, but I thoroughly enjoyed the entertainment and concept of the basketball games. In fact, the only reason why I didn't give it aten was because of the fact that some of the games went on for literally - what, five episodes? - and some of the characters did nothing but repeat and repeat the same moves. In other words, sometimes it felt like I'd literally re-watched the episode.\\n\r\n(Once again, talking about you, green-head glasses guy)\\n\\n\r\nI got bored once or twice, but the setting between teammates and believing in each other made me want to continue the series even more. Ha, cheesy, I know.\\n\\n\r\nArt: 7\\n\\n\r\nThe art wasn't anything to be proud of. Kagami's hair looked like a different version of Jean's from Attack on Titan, so that was quite weird.\\n\r\nAnd then the classic every-body-has-different-colored-hairs came into place. I'm actually confused - apparently brown hair isn't a thing in the world of Kuroko's Basketball.\\n\r\nPink hair. Green hair. Navy hair. Light blue hair. Red hair. Hot pink hair. Yellow hair. Purple hair. ALL THE HAIR.\\n\\n\r\nThe shading on the characters, however, were more or so interesting. It reminded me of Attack on Titan (another reference, I know) as it wasn't just the casual make-a-shade-darker shading. That added some depth into the anime.\\n\\n\r\nSound: 10\\n\\n\r\nIt actually surprised me how well the sound fitted, apart from the occasional off-lip talking that happened once or twice. The character's running and stopping's sound was directly, to the point and limit, perfect. \\n\\n\r\nSometimes I did cringe when Kuroko or one of the other's made some weird noise, but that doesn't matter :3\\n\\n\r\nCharacter: 7\\n\\n\r\nThere was only one or two characters that were completely unique (to me, anyway) which was Akashi and Kuroko - maybe Kagami? Let's start off with the Generation on Miracles.\\n\r\nFirstly you have Kise. A classical, charm the girls man who can never keep a straight face. Hmm, that's totally not in every anime that's ever existed.\\n\r\nThen we have Aomine. The man who is kind of a bad-butt and is cold to everyone else. \\n\r\nMurasakibara - no interests in anything at all.\\n\r\nMidorima, I sure as heck have NEVER seen him before *sarcasm*. Like, I've never seen anyone who is a slight bit nerdy, does calculations, wears glasses, has weird interests and bases everything he does of in logic and math.\\n\r\nAkashi. In my eyes, he's more original. He's got a past, he's not all goody-goody and he has a heck of an introduction. I like the way the story adapts with him... but I need more.\\n\r\nKuroko.... he's not ALL too unique in the story. I've seen about ten other animes where the main character isn't noticed at all (so far I've only watched 51 animes :P). But this one DOES make it a slightly bit more original, seeing that he used his unnoticed aura to his advantage.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nI really enjoyed this anime - obviously as you can see that small-text black 10. Although I mostly spoke about CONS in this review, Kuroko no Basket was one of the very few animes that I've dreamt about and fangirled *very loudly* about. I'm not joking, I've spent two days watching this entire anime and those two nights I had a dream about it. It was great.\\n\\n\r\nI think I mentioned this, but it might just be because I adore sports anime that this one was so great. Although I can't really explain it, think of your favorite anime and try and give it a hundred words. Hard, right? That's how I'm feeling trying to explain why I like it.\\n\\n\r\nOverall: 9\\n\\n\r\n8, 7, 10 , 7 , 10. With those scores, I'm going to give this anime a 9. That may not be correct but... math is boring anyway. I don't need to go into detail WHY it was overall 9, considering I have a habit of putting the wrong things in the wrong category. Heh...\\n\\n\r\nSide Notes:\\n\r\n*slight spoiler*\\n\\n\r\nI do with that the ending had been more elaborated. I, personally, love Akashi and was quite sad I didn't get to see Kuroko and him re-bond in vision. Not only that, but I loved this series so much that I can't actually believe it's over.\\n\\n\r\nAnd, back on the Akashi topic, we didn't really see much of him apart from the game. I'm sure all the fangirls out there, like myself, would have loved to have seen more of him instead of just having to read fanfictions :(\\n\\n\r\nI also would've liked to have seen the match between Kuroko and his old best friend, but I guess that didn't happen either.\\n\\n\r\nWHAT HAPPENED TO KIYOSHI?\\n\\n",
            "date": "2017-04-25T16:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 246304,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6059991.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Deylia",
                "username": "Deylia"
            },
            "url": "https://myanimelist.net/reviews.php?id=246304"
        },
        {
            "content": "Kuroko No Basket Season 1 2 3\r\nThe story focuses on students who have passion on playing basketball. Different skills will be displayed, along with different belief because of the talent they have. Among those students, five stand out and was called Generations of Miracles. They are the prodigies in basketball on their place, and was scattered on different school after they graduated. One student, respected by the five members, entered a newly created school and is destined to meet another guy whom will help him to make the five prodigies realize that the way of their basketball is wrong. The series will show different plays,struggles to improve, and how the team with the combination of two students win the battle they prepared to take. \\n\\n\r\nKuroko No Basket Anime Review\\n\r\nBy: Tadatoshi Fujimaki\\n\r\nApril 15, 2019\\n\\n\r\nOverall: 10/10\\n\\n\r\nPlot: 10\\n\\n\r\nSports Anime genre have only one path to take, tournaments. Participating individually or by teaming up, it is the most common plot that exist. While this is not a unique one, it will be the author's capability how he manage to capture the interest of the viewer and excite them. This series focuses on students who love playing basketball. At first, I am really not interested on watching this anime. It is kind of absurd to think of a basketball story with extraordinary skills. But after trying it out, it made me realize that the plot of the story is great. I love the simplicity of it. The main reason of why the series moves forward and how it affects every branches of the story. Unrealistic as it may seem, the lesson is still there. The creator successfully stress out the core value when playing basketball. What also made me hook on this series is the directness of every plays all of the basketball teams have. Each play only last for an average of 5 to 6 episodes. Flashbacks are there but its only on a really minimum basis. You can enjoy watching all of the plays without so much cliffhanging and annoying side stories of the characters. \\n\\n\r\nCharacters: 10\\n\\n\r\nIt is already a known that almost all of the characters on this series are super cool. It is the reason why most of the girl watched it, I think. Aside from that fact, the development of the characters can totally be seen along the story. The changes and realization they made make them more of a human. Though not skillfully speaking. Since there are so many characters, giving all of them the spotlight is hard. And that's whats amazing. The creator successfully introduce a past where most of the characters belong. That way, it won't be hard tackling each of the characters past and it gives the story more time in other scenarios that needs to be displayed. I love how the story never depend on the back story of the characters so much that it will take too much time to explain it. \\n\\n\r\nSound and Animation: 10\\n\\n\r\nPerfect. My phone is full of Kises' picture. Yes, every character is so handsome but it is not only this. The animation of the story is really great. Parts where the characters show dribbling, passing, shooting or even guarding their opponents is really detailed. I love how they show the movements of the characters playing on the court, as well as their expression depending on the feeling they have. Should I also mention the voices? Yes, theirs are really cool and perfectly matches the looks of the characters.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nI am not really a fan of basketball. I do not hate it, but I do not also like it. This is the first anime basketball which got me hooked. Due to so much enjoyment watching it, I've finished it in a more faster time than the other series I tried. Every episode will make you want more, more plays, more actions on the court, more characters to encounter with. It is really exciting, and fun to watch. \\n\\n\r\nEnding: 10\\n\\n\r\nThis is the best route to take for an ending on this series. The main goal of Kuroko has been met after winning the nationals with his team. But no, the story did not really move forward just because they had to win. It is because he had to bring back his loss previously. He had to bring back all of the people precious to him and he did. Fixing things that is broken and making them realize the most important thing when doing the thing they love. I am content with the ending of this series. It is simple, yet it will made you realize something important.",
            "date": "2019-04-19T01:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 306639,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6349777.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Castinate",
                "username": "Castinate"
            },
            "url": "https://myanimelist.net/reviews.php?id=306639"
        },
        {
            "content": "*** This review contains spoilers of all the three seasons. I have separated season 3 spoilers towards the end. ***\r\nThis is a general review of the series \"Kuroko no Basket\" as a whole series. If you have not seen first two seasons then do not read this review.\r\nI really liked this anime. I will definitely recommend it, especially for the sports enthusiasts. But I have given overall score of 8 because this anime could have been so much better with a little realistic characters and story. Towards the end I realized that the show lacked depth for its center characters. I guess a shounen animeneed not have depth to its story but I felt little disappointed because of it. But overall feel of the anime was very good.\\n\r\nKuroko no basket is a very well structured plot for a sports anime. It started with a guy name Kuroko who is excellent in passing the ball using misdirection skills and loves the basketball as a team sport. In the past he has been a part of a legendary high-school basketball team whose other members were prodigies and never believed in team-play. He want to prove to them that basketball is a team sport.\\n\r\nI really liked this simple and strong plot.\\n\r\nIn this review I am noting down good and bad points (in my opinion) about the anime.\\n\r\nGood points:\\n\r\n•\tThe most intriguing element of the series is the thrill in the basketball games played by “Serin” (Korukos’ high school team) as well as the other teams. The anime successfully involves you in every minute of the game. At certain moments even I myself felt the adrenalin rush watching the game. The difficult task of making the audience realize the events taking place in every corner of the court is brilliantly handled. The uncertainty of winning keeps the audience involved in every game and makes them want more.\\n\r\n•\tAppropriate abstraction of the details of the games. I myself don’t know much about the game. With much more details, this could have become little boring for the audience who know nothing about the game. This can be a negative point for those who want to see details about the game.\\n\r\n•\tWell written script for all the games throughout the series. Also the screen-time given to other characters and their background was okay. (This could have been better).\\n\r\nBad points:\\n\r\n•\tAs the series progresses you start realizing that this is not a realistic series. Misdirection, copying other players was okay but making a 3-pointer from the other half of the court with 100% accuracy was too much. Even me, who have rarely seen basketball, realized that this is total BS. In spite of this I liked the series till second season but in the third this was taken to another level. The anime could have been much more realistic. Instead of showing a player who is out of the world with awesome super-power (Midorima), a simple unstoppable rival (Aoimine) makes much more impact on the overall series. Instead of showing a vanishing drive (acknowledged even by the audience *facepalm*) a basket scored with the help of misdirection (without the ball vanishing in front of your eyes) would have been much more awesome.\\n\r\n•\tAs I said earlier center characters and story lacked depth. The center characters Kuroko and Kagami are very shallow. Yes, we got that Kuroko started hating basketball while playing with “Generation of Miracles” but neither has he lacked the confidence after the so called trauma nor he gives any reaction about it throughout the series. He only keeps on saying “I will make you acknowledge my style of basketball”. In case of Kagami, I never really listened to what he is saying. :P Even with the so called background story of Alex and Kagami’s acknowledged brother, I was never able to appreciate Kagami’s character. He simply opens the door to “Generation of Miracles” room and keeps on getting better and better. He goes to US to train hard but learns nothing and in two days masters an unstoppable shot. And so on… Kagami’s character is the most nonrealistic character in the series. Actually all the villains and side characters are much more realistic. Aoimine, Kise, Midorima, Mirasakibura, Hyuga, Kiyoshi are much more realistic than Kuroko and Kagami. Throughout the series Kagami keeps on improving simply by jumping higher and running here and there. I personally felt that Aoimine’s character was the most realistic and impactful.\\n\r\n*** Season 3 spoilers ***\\n\r\nGood points:\\n\r\n•\tThe flashback story of “Generation of Miracle” is especially good in season 3. It justifies the behavior of all 6 of them including Kuroko.\\n\r\nBad points:\\n\r\n•\tExcept from the flashback everything else felt like repletion from season 1 and 2. The series became much more interesting after Serin badly lost against Aoimine’s team but after this they monotonously won all the games up to winter championship which made it seem too simple. Season 3 lacks the uncertainty of winning which was present in the season 1. I was waiting for Serin to win the winter championship and it did win as per the expectations of everyone. This was little disappointing. \\n\r\n*** END of spoilers ***\\n\r\nTo summarize, I will say that this anime makes basketball interesting for everyone but if you are looking for a serious basketball anime then you better not watch this series. With addition of basketball shots which may seem like super-power the anime lost the opportunity to create one of the best series in sports category but even so watching 75 episodes of only basketball was really fun.\\n",
            "date": "2015-12-19T09:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 205983,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5059344.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MJ23",
                "username": "MJ23"
            },
            "url": "https://myanimelist.net/reviews.php?id=205983"
        },
        {
            "content": "*Spoilers may be ahead*\r\nI started to watch the first season in winter and I did my best to catch up with the storyline, I really like it and I enjoyed the openings and endings:\r\nStory: 8\r\nIn this season, we will see how it was on Teiko High, how the Generation of Miracles was build, how they split up after their personalities started to change, it was drama and I felt quite sad during the Teiko Arc, otherwise, the story overall isn't that much, but we see how the characters build more up than we saw on the first season. \r\nArt: 10\r\nAt first, I didn't like theart style of it because it seemed so weird every time I watched in different Top 10 videos, but I sooner started to watch the anime and I fell in love with the art style, I love how it was animated, I love how it affected the storyline.\\n\\n\r\nSound: 9\\n\r\nThe soundtrack to this anime is outstanding, it's mostly like when you wear headphones and listen on the soundtrack while it plays during the most of the games in the anime, it fills up the excitement and the suspension in the anime, I especially love the openings and the endings.\\n\\n\r\nCharacter: 9\\n\r\nI think the anime has made the characters grow more mature (Some of them) and that we could understand their personality and their background, there are some characters you may dislike and like, but I don't hate anyone in this anime, I love most of them.\\n\\n\r\nEnjoyment: 8\\n\r\nAs much I enjoy comedy, this one was terrific, I love their sense of humor, their animations and the comedy that grows in the story while watching it.\\n\\n\r\nOverall: 9\\n\r\nI would give it higher, but I think a 9 would do good, the anime had it's good moments and I truly enjoyed it, I was filled with suspense in every end of the episodes, they leave us suspiscous and nervous until the next episode, the ending was really great and I hope that I will read the manga to see the difference.",
            "date": "2015-11-03T03:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 202573,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4248951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheOneOfSeven",
                "username": "TheOneOfSeven"
            },
            "url": "https://myanimelist.net/reviews.php?id=202573"
        },
        {
            "content": "Out of the hundreds of anime I've seen, this was the first sports anime. I usually watch superpower/adventure/isekai etc. and thats probably why I enjoyed watching this. There were a lot of players who had unique abilities/techniques that made them great basketball players. Every episode had something to look forward to in the next. The way the creators handled the way the players act on and off the court was flawless. With the games, they didn't make everything the same, they made every game different in their own unique way. Some of the games have a lot of meaning behind them that it will getyou emotional and maybe tear up. The very last episode certainly got my emotions riled up. It was though as my heart was breaking because of how well they executed it and maybe a little because the series was over. I binge watched this series in 3 days and it was amazing. I hadn't felt like this in a while since I started running out of anime to watch and there weren't any left to binge. Watching this anime opened my eyes to watch other sports anime and I'm deeply grateful for gifting us with this one.",
            "date": "2018-10-07T17:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 291207,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6833998.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cabadula",
                "username": "Cabadula"
            },
            "url": "https://myanimelist.net/reviews.php?id=291207"
        },
        {
            "content": "Alright, now that I've finished all seasons I'll let my honest opinions on the series as a whole and individually as a season:\r\nOverall, Kuroko's Basketball is a nice Anime. It's not particularly outstanding in any field and very generic in every way a shonen Anime can be, but if you watched season 1 and got hooked like I did you have a chance of being entertained for all three seasons. \r\nThis will 100% rely on whether or not you like the characters and their struggles. The characters are likable to me, each with their own hurdles to face and enough entertainment value that I didn'tfeel any particular disappointment when any of them switched out during a game. However, many - especially the enemies - can come off one-dimensional with lackluster personalities that start to blend as the creators try to place them as the enemies of our heroes. However, no one is really ever portrayed as being above redemption and it's easy to start liking them once they stop being assholes. I usually have a hard time doing that but I was pleasantly \\n\\n\r\nRight off the bat I was hooked with Kuroko, whom I found cute and a prime character to root for as a below average guy with a hidden talent he could use for TEAM play. His teammates shined as season 1 progressed and I was pleasantly surprised by the atypical stop of their journey at season 1.\\n\\n\r\nSeason two is the hurdle you have to face with this series, imo. It's where the typical shonen tropes stand out with intense DBZ-style power-ups and asspulls right at the perfect moment. Yet, while I definitely shook my head at the ridiculousness of it all and rolled my eyes and how predictable some of these moments became I still found myself cheering for Seirin - despite being asspulls they felt natural and not as cringe as in other series. I believe this is because of the tone the series already had set at season 1. Yes, it tries to be serious and tackles some real drama that can 100% apply to life, but in the end it's a series meant to lift you up and give a positive message. The trippy moves and fancy titles are there for entertainment. \\n\r\nOnce I passed season 2 THAT's where I worried because I sure as hell didn't make a commitment to watch a 70+ episode series to be disappointed. I spoiled myself on the ending lol Which isn't really surprising, really, if you know how shounen series go and that this is the final season. Once settled on that I went ahead with this season and this is my conclusion:\\n\\n\r\nPros: \\n\r\n-GREAT animation. Season 2 upped the animation a bit but this season made it clear Production IG saw where it could go with this series and allowed their budget to shine. Some of the emotional scenes and art - and especially the animation during important plays - are a stark contrast to the plain look from season 1. I was pleasantly surprised.\\n\r\n-The music is repetitious as they use the same 3-4 (great) intense tracks for every game but works perfectly with each scene. Kiiinda makes it predictable what will happen at certain points in the game but if anything it gave me peace of mine haha. However, the OPs this season were superb. I think it had 4? Each a little more emotional than the last. The music was ok but the actual OP was great.\\n\r\n-ASSUMING you didn't watch any of the specials before this, THIS is the season we get to really see into the GoM's past and I really enjoyed it. If you finished season 2 you may have worried about fatigue with this season only covering few matches but they did well with delaying that until they got those stories out. Season 2 got some parts in but season 3 is where it fits together chronologically. I loved it.\\n\\n\r\nCons (most of which apply to the series as a whole): \\n\r\n-Standard Shonen. Lots of screaming, lots of \"Impossible!\" moments and random additions to a character's backstory that come out of nowhere for the #drama. However, if you didn't get sick of it by season 2 it probably won't be an issue for you at season 3. That said, the matches WILL get repetitious because - and I'm not even joking - at some point they end almost exactly the same. You'll start to notice how immediately. Honestly, you could skip to the end and not miss a thing other than some flashbacks.\\n\r\n-Not very accurate to basketball from what I've read. . . it's very gimmicky with all the special powers so if you're a basketball fan I don't know how you'll enjoy the unrealistic scenes of characters constantly talking and thinking for 1+ minutes while holding the ball.  \\n\r\n-As a Kuroko fan who was very aware the show was named after him . .. Kuroko doesn't get much story outside of his relationship with the GoM, especially compared to his teammates. This is an overall criticism of the series, not just this particular season. Like stated before we do get his backstory with them in this season, but outside of those episodes his presence in the games sometimes felt forced. As if the animators remembered the MC was playing and added one shot of him looking series just to make sure he was included. He does get to shine as the MC in this season, regardless.\\n\r\n-After hyping up the GoM season 2-3's battles past Aomine felt a little easy. Season 1 handled it well, I think, but since they obviously had to 'make it' going after the rest - especially Akashi - didn't feel as intense. Torturous, but not as much of a strain.\\n\r\n-Because there are so many characters involved as a result of having to introduce each player on the opposing team and give them some importance you sit there wondering . .. do we really need their backstory? They try to give almost everyone one and by the last half it's like you realize some of them were just unnecessary and added to give the episode more meat. I love Seirin's coach, too, but at times it felt like she just observed and it was her players coming up with ideas. I sometimes asked myself \"Why are you even there?\" These were the only real flaws I found annoyed me with the characters. \\n\r\n- EVERYONE analyzes the matches as they happen this season. EVERYONE. It's a shonen trope but I found it a bit ridiculous at times.\\n\r\n-The season ends with the match and a few scenes after, but some key elements with certain characters are never really touched upon afterwards . . . I really wanted to know more of Akashi's personal life post-game but they don't bother going over that, even though his personal life is what made him like that. That said,\\n\r\nA LOT of really neat backstory/side stories are featured in OVAS. I HIGHLY recommend you watch them, especially the one set after this season featuring Kuroko's birthday. I feel that should have been the final episode instead of just ending it how they do in this season.\\n\\n\\n\\n\r\nDespite all the flaws I personally enjoyed this series at a 9/10. That OVA made me feel satisfied and almost teared up. \\n\r\nAs a series it's about a 8/10 ONLY if you don't take it seriously. It's 100% meant to be a feel-good typical shounen Anime. Focus on the characters and you'll be fine.\\n\r\nFor someone who isn't into basketball I think this is an entertaining Anime, definitely made me care to look up basketball rules and such lol, and worth a watch if you can make the commitment. The music is great, it can be funny and light at times, they put enough personality to the characters that I didn't end up disliking anyone (save for the truly villanous a-holes that weren't supposed to be reoccurring anyway) - which is a feat for me lol\\n\\n\r\nTo summarize:\\n\r\nStory: 7 - very standard but fun. The GoM backstory is simple but interesting. I became invested.\\n\r\nArt: 8 - gets better as it goes. Starts off very plain but by season 3 it definitely has some eyecandy. \\n\r\nSound: 7 - personal preference but the music was good, just generic. Nothing special imo aside from the first two OPs and some really good OSTs for the intense moments of a match. It's repeated, though, so while it works to get you pumped it's still noticeable that they had a budget. I will be downloading some of the OST.\\n\r\nCharacters: 9 - all fun. Didn't hate a single reoccurring one. Each gets time to flesh out with the exception of new characters in season 3 for obvious reasons.\\n\\n\r\nI rate my personal enjoyment over any technical flaws it may have so my verdict for the series is a solid 9.\\n\\n\r\nI loved it. You may love it. Give it a chance!\\n\r\nWith that I'm off to see the 4th movie!",
            "date": "2018-08-24T22:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 287322,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1168797.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vyudali",
                "username": "Vyudali"
            },
            "url": "https://myanimelist.net/reviews.php?id=287322"
        },
        {
            "content": "Spoilers incoming.\r\nStory: 7/10. The story isn't something unseen of or profound, it's the typical narrative of most sports anime: win the tournament while beating X amount of overpowered teams. But this is to be expected, sports anime are definitely the type of shows where its more about the journey than it is the destination.\r\nArt: 10/10. The art and animation in KnB is phenomenal. Everything is vibrant and full of color, and matches are well-animated and full of intensity and vigor. Everything moves fluidly and every match captures your attention to the fullest, whether it be the first match of the season or the final, decidingbattle.\\n\\n\r\nSound: 9/10. The music in Kuroko has always been great. The voice actors are also phenomenal, the cast is a versatile one known for doing many other great roles.\\n\\n\r\nCharacter: 7/10. For the most part, the characters in Kuroko are shallow. In fact, most found a seat on the bench in Season 1 and have remained there ever since. When we move to the main cast, however, there is some diversity and nuance to be had. The GoM particularly have the best showcase of personalities and character growth: most notably, Kise's development from S1 to S3. My favorite character of the show, Akashi, also presents us a very deep take on the sport we haven't seen before, and although the show goes a little bit beyond reason with his character, Akashi is one of the best we've seen throughout the whole show. Both his command of his team and the game as well as his personal backstory make him intriguing and compelling to watch. \\n\\n\r\nEnjoyment: 10/10. Every match in Kuroko offers an exciting experience. I love the over-the-top plays and essentially 'superpowers' employed throughout matches. We see some of the best abilities revealed in this season: Perfect Copy, Mid-air Shot and Emperor Eye. The Zone also comes back stronger than ever, and the final match of the show delivers in full.\\n\\n\r\nOverall: 9/10. If you loved the first two seasons of Kuroko, you'll love the third. This season is probably the best to date, with the most interesting abilities seen yet, the final revelation of the captain of the GoM and his abilities, and the culmination of all of Seirin's trials and tribulations up until this point.",
            "date": "2018-05-06T00:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 279885,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5493927.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kuta1",
                "username": "Kuta1"
            },
            "url": "https://myanimelist.net/reviews.php?id=279885"
        },
        {
            "content": "Ok, so I can understand why everyone is disliking this season, because it has many points that disturbs the enjoyment of this series. \r\nFirst of all, I really really liked the beginning of the season. Like, the thing with Haizaki or Shutoku vs. Rakuzan, but the end was so boring and lengthily. That's why I gave the enjoyment 8/10. \r\nI don't mean it wasn't epic at the end, but it was like: \"Oh no they're stronger!\" \"Ha! Now we're back!\" \"Oh no\" \"Oh yes!\" and so it goes on......\r\nI also REALLY REALLY missed the first season feeling between Kuroko and Kagami. I don't even knowif it was mentioned that Kagami is Kuroko's light or something, but I missed the teamwork between them so much!! Yeah, and the problem was Akashi. He had way too much screentime in my opinion. He IS a great character, but his story, especially why he got his Empror Eye, is so confusing. \\n\\n\r\nThe sound didn't come out either very often. So it's kind of disappointing. \\n\r\nThe art is amazing. No point. Even though I don't like the style of the opening. \\n\\n\r\nOverall it was good. Not as good as the first season, but still a must-see for a Kuroko no Basuke fan. \\n\\n\r\nPros:\\n\r\n- Emotions \\n\r\n- Great Animations\\n\r\n- Amazing character developments\\n\\n\r\nCons: \\n\r\n- Lengthily\\n\r\n- Missing Kagami and Kuroko Teamwork\\n\r\n- Too much screentime for other characters in this season",
            "date": "2016-06-12T03:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 220560,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5095014.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TorixChiakiLover",
                "username": "TorixChiakiLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=220560"
        },
        {
            "content": "Short review for those who don't have time to read a whole document \r\nStory: Assuming you have watched the last two seasons it's all about the second half of winter cup and the reveal of the Miracle of Generations Back Story! 8/10\r\nArt: The art in the 3rd season has gone down bit when comparing to season 2 but in the highlight moments the art just springs into movie budget which the scenes lasts for 5-10 seconds. 8/10\r\nSound: The sound i would wasn't as good as season 2 which was such i shame because they could of chosen a mix of season 1&2 song as thiswas the last season but even so the sound was still good. 7/10\\n\\n\r\nCharacters: You got to see what lead the GOMs backstory that Answers all the WHY questions you had to say about the GOM so you know it's good. 8/10\\n\\n\r\nEnjoyment: I would give it a 6/10. The first half of KNB was very Enjoyable until Serin's last game. Omg they extended all the scenes to make the match that should only be 3-4 episodes become 7!!! They did this by replaying every Shot 3 times, Made everyone talk stupid obvious sh*T that of course wasn't in manga and made everyone react to EVERYTHING!!! EVEN WHEN SOMEONE DID A NORMAL 3 POINTER!!! 6/10\\n\\n\r\nSo overall i give it a 7/10 just beware of the last game with Serin \\n\\n",
            "date": "2015-10-05T02:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 200571,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4160381.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NightShadowb",
                "username": "NightShadowb"
            },
            "url": "https://myanimelist.net/reviews.php?id=200571"
        },
        {
            "content": "OHH, I guess I have never experienced the same drive and ADRENALINE that during watching the anime. IT WAS PERFECT!!! The story maybe is too cliche but at the end of the day, it gave a lot of emotions especially in the last season where the events intensify with each and every episode. Characters have been well developed, and as I more love the supporting characters in each anime so here I liked them the most. Kuroko ofc is very nice and his story is very interesting. Music is spectacular because it emphasizes the right moments, highs and lows etc. And art overall was 10/10!!I liked it a lot~~~!! So i recommend all 3 seasons of this anime to everyone who loves the tension and incredible feelings!!!~~~~",
            "date": "2017-07-21T04:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 253364,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5623302.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NICK1994",
                "username": "NICK1994"
            },
            "url": "https://myanimelist.net/reviews.php?id=253364"
        },
        {
            "content": "*This review will include my thoughts on the third season, and also the Kuroko no Basuke series as a whole*\r\nStory: 7\r\nThe third season is my favourite, but also my least favourite in different ways, and both have to do with the story development.\r\nThis season included (finally!) a Teiko arc which I've really been waiting for the longest time. Personally I absolutely love backstories, especially well-executed ones, and this one really fulfilled my expectations. I wouldn't have minded if it was longer than what we had, but I thought that the pacing was done quite well, especially when it was in the middle of the season.It brought so much more character developments, and answered many questions. One of the most successful things Kuroko no Basuke did, was that it actually gave me closure, regarding the Generation of Miracles and their phantom sixth man, which a lot of series fail to make me feel so. It made me root for Seirin so damn hard, and genuinely feel so proud and happy for the GoM to have found their places with their teammates. It's a weird and complicated little mindset I have, but I usually prefer the original 'team' in any story. For example, going a bit out of topic here, but in Gintama I find myself hoping that the Joui4 would fight together more than I would get excited at seeing the Yorozuya, not that I don't love them, of course. So at least to me, this series succeeded in making me feel content with the way things are, the way things progressed, and the way things will be. The last season provided the backstory and plot development needed, and for that I am really grateful.\\n\\n\r\nThings that I didn't like, however, was how the matches get a bit too repetitive, a point that a lot of people pointed out. Season 2 was when I thought they had me at the edge of my seat the most (all of the time, actually) but season 3 felt a bit lacking on this part. Also I don't actually mind unrealistic sports anime, but that last couple of episodes... things got a bit ridiculous for me, especially with the last team play I guess. But the ending saved everything and Akashi is king, so.\\n\\n\r\nArt: 8\\n\\n\r\nArt and animation were pretty consistent and was better than the previous seasons, except some tiny flaws here and there, but nothing that disrupted the overall execution\\n\\n\r\nSound: 8\\n\\n\r\nThey did a good job at getting my blood pumping, I think that's good enough!\\n\\n\r\nCharacter: 8\\n\\n\r\nI actually really loved how the characters developed over the three seasons, especially with that Teiko arc, I could understand why Tetsu was as stoic as he was when he first appeared, his determination, and the Teiko team's relationship. How things turned out to be can feel a bit cheesy at times, but I think the important thing is how the flow and the story was executed. It didn't feel too much to me, at least, and watching them change is truly a wonderful thing. Also, the entire Seirin team was so amazing in this season (and the previous one, to be honest), and I'm really glad that everyone, even the first-years got their chance to shine. They've really come a long way, and the transformation was truly satisfying to watch. I will say that I think Kagami is overpowered, but it doesn't affect how much I enjoy the show (except maybe the last 2 episodes), so that's fine. The rest of them, Koganei, Riko, TEPPEI, Hyuga, Izuki were all really amazing.\\n\\n\r\nEnjoyment: 9\\n\\n\r\nI enjoyed this quite thoroughly, minus the last couple of parts of the last game. Season 2 had me at the edge of my seat the most, but this season had its moments too. Things wrapped up nicely, and as usual, the character and team interactions were very enjoyable.\\n\\n\r\nOverall an 8 for this season, but Kuroko no Basuke has been quite a journey! In fact I would give it a 10 for enjoyment overall, even though it was lacking in some areas, the satisfaction and enjoyment I got out of watching it was quite big. I finished two seasons in less than three or four days I think (going a bit blind here) but it was worth it. I don't play basketball so I have no idea just how far-fetched it is to use those techniques in one game, and I'm not entirely sure how unrealistic the powerups are. I began the series with close to zero knowledge of basketball, so my ratings are all based on how much I enjoyed and felt about the anime itself. If some unrealistic powerups and some cheesy lines here and there don't concern you, I definitely recommend watching this one. It's thrilling to watch most of the times, even when I felt it was a bit repetitive, even when I knew who was going to win, so I would say that the pacing and execution of the games are pretty solid. Character development is not magnificent but pretty decent. It's just been a really fun, and at times very heartwarming, journey.",
            "date": "2017-05-24T15:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 248452,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6260978.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bluecoke_",
                "username": "bluecoke_"
            },
            "url": "https://myanimelist.net/reviews.php?id=248452"
        },
        {
            "content": "CONTAINS VERY SLIGHT SPOILERS\r\nTHIS IS A REVIEW OF ALL 3 SEASONS\r\nBefore I properly start this review, I have to first say that this review is for ALL THREE seasons of ‘Kuroko no Basuke’ which is called ‘Kuroko’s Basketball’ in English – and also officially known as ‘The Basketball Which Kuroko Plays’ (what a mouthful).\r\nKuroko no Basuke was my second sports anime right after I had watched the first five episodes of ‘Prince of Tennis’ and had quietly dropped it because it didn’t make me feel anything for it. This was back in 2014 and with the 1st season of the anime.\r\nI honestly wasn’t expecting muchfrom Kuroko no Basuke. At the time, I didn’t play the sport nor did I really care for it. The little I knew about basketball and it’s rules and regulations was from the fun as hell PlayStation 2 game ‘NBA Street V3’. The first two episodes of the 1st season didn’t really do much for me.\\n\\n\r\nIt was after that that I was hooked on the superpowers-meet-basketball extravaganza that is Kuroko no Basuke. From then right till the 2nd season in 2015 to the last episode of the the 3rd and final season this year, Kuroko no Basuke proved to be a wild ride.\\n\\n\r\nNow even though the ride was on one hell of a beast and the fact that I had immensely enjoyed it, doesn’t mean that Kuroko no Basuke is a perfect sports anime by any means. All throughout the course of the 75 episodes (not counting specials and OVAs) I knew that this anime would have so much better if it hadn’t conformed to typical Shounen rule-book. Simply put it’s a great show but the characters and the execution need a bit of polishing.\\n\\n\r\nThe synopsis easily tells you that this is you every day shounen-fest but instead of a loud-mouthed weakling yelling that he’d save the world by relying on his nakama’s (comrades’) strength, you get Kagami who is, uh… well, a loud-mouthed basketball fanatic who teams up with Kuroko, the superhuman passing machine, to defeat the ghosts of Kuroko’s past by winning the National Interhigh Championship.\\n\\n\r\nIt’s a rather straightforward story. Play. Encounter stronger team. Practice. Win. Meet another strong team. Grasp victory’s straw with a flexed pinky. Rinse and repeat. Whether you get bored or not by the formula is basically up to you. Kuroko no Basuke is a shounen anime: whatever happens, the final victory is guaranteed. Honestly, you can’t really make sports anime/manga without the main team finally winning that all important tournament. If they lose, no matter for how strong and impactful a message the writer is trying to pull out of his ass, it will leave a sour taste in the mouths of pretty much everyone watching. Unless if you go the Ping Pong The Animation route but the focus of it’s story is entirely on something else.\\n\\n\r\nThere’s not really much to say about the story itself at this point because it’s the usual. The goal of Kuroko no Basuke’s plot is not the destination: it’s the journey. Flashy dunks coupled with insane passing right down to a player perfectly imitating the play-styles of his opponents to carry the entire game by himself, Kuroko no Basuke shines in the field of pumping you up and getting you hooked to the narrative. Obviously, it feels like you’re watching a bunch of supermen scampering for a ball and that, I imagine, will be quite an annoying ordeal for some viewers. They’ll want realistic basketball. If you want that, you’re better off watching either ‘Basquash!’ or NBA matches while reading the biographies and fan rumors about the players.\\n\\n\r\nSimply put, the aim of Kuroko no Basuke is to entertain you and get you hyped and possibly interested in the sport of basketball. It worked on me. I play it now. Can sometimes even pull off the passes Kuroko does.\\n\\n\r\nCharacter development in Kuroko no Basuke is primarily just for the plot’s sake (it’s kind of hard to explain). It’s somewhat natural but it’s not really to my liking. I’m not saying I was displeased by it – just saying that it could have been done differently. It only ever seems to be apparent by the last 10 episodes of the 3rd season. Delayed background information on characters late in the story via flashbacks for suspense and wanton curiosity’s sake can really put you off.\\n\\n\r\nOther than that, the characters are unique and fun to watch. Aomine, Kagami’s main rival and Kuroko’s original partner, has to be my favorite. Kise is a close-second followed by Midorima as they have opposite personalities that click well and undergo the most development (that is done right).\\n\\n\r\nThe animation by Production I.G. is top-notch. When the characters are not in a game, it’s pretty normal by keeping it clean with a half-comic half-serious style. Where the animation really shines is during the matches. It becomes a tad smoother and more expressive. But wait, there’s more! It goes full super-saiyan mode when important plays occur and when the matches reach their all time high. Imagining the Aomine vs Kagami showdown in season 2 and the final showdown in season 3 at 60 frames-per-season with THAT animation quality just gives me goosebumps.\\n\\n\r\nThe sound fits the show perfectly. Electric guitar heavy rock dominates the Openings and the background music while mellow boyband-esque songs play in the Endings. Granrodeo’s songs really put the spirit of the show into the Openings. The first Opening ‘Can Do It’ is the best.\\n\\n\r\nIf the last-second wins didn’t occur so often, the superhuman abilities of the players didn’t get too absurd at times, and Kise didn’t get abused so damn much (lol); then Kuroko no Basuke would have been quite an exceptional romp of entertainment. With an 8.5/10 from me, I have to say that it’s one of the best anime available in the sports genre.",
            "date": "2016-06-29T16:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 222375,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3356717.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ReJaKted",
                "username": "ReJaKted"
            },
            "url": "https://myanimelist.net/reviews.php?id=222375"
        },
        {
            "content": "(First time writing a review so this review may not be that good or as detailed as some of the others I have read.)\r\nKuroko no Basket, a fun, engaging and sometimes adrenaline thrilling show. \r\nConsidering this is my first ever sports anime that I have watched, I really enjoyed it. As soon as I watched the first episode of season 1 I was already pulled in, even though this show doesn't have a complicated plot line the anime was still entertaining and fulfilling. I loved all the characters from the ones well developed and the ones that we don't know too well, they all playa special part in the anime. \\n\r\nEven though I highlighted the parts of the anime that I liked there were a few things that made me not enjoy the show. Being completely honest I really enjoyed season 1 and 2, due to giving them a higher rating than this season. I enjoyed the first few episodes of season 3 but then I felt as though the show started to become more repetitive, as if you could skip an episode and still understand what was going on, thats how repetitive I found the last season of this anime to be. I feel like they could have made the last season a little more exciting, different, unpredictable. \\n\r\nBut overall I did enjoy this anime but not as much as the 1st and 2nd season, people who are new to sports anime or are a big fan of sports anime I highly suggest you check out this anime, even though some parts are repetitive I did enjoy most of it :)",
            "date": "2019-02-18T03:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 301925,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7454041.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xlilianlilli",
                "username": "xlilianlilli"
            },
            "url": "https://myanimelist.net/reviews.php?id=301925"
        }
    ]
]