[
    [
        {
            "content": "Story:\r\nBased around a character that wants to become an idol I really didn't expect much from this series. Starting out with that prejudice I was surprised to see new approaches in this business and was instantly drawn by this anime. Unlike other storys full of clich&eacute;d stuff, our protagonist (Kyoko) isn't driven by the wish of fame, money or power as it is common. No, all she wants is revenge on her former ... well ... \"boyfriend\"... kind of... not. \r\nWith this the anime's story thrives very much from character developement and I mean REAL character developement. Additionally it is well rounded up with alot of good comedic events. \\n\r\nBut in the end it turns into an all to common basic plot: the protagonist has to overcome obstacles with hard work, just with a nice twist. Don't get me wrong, this isn't necessarily a bad thing. It's a solid story, just not an all to originally one. Still the added surprising elements are what makes this very good.\\n\\n\r\n9 points for a story with a relly nice change\\n\\n\\n\r\nCharacter:\\n\r\nWith Kyoko, for once, we have a female lead that is independent and isn't waiting for a prince in shining armor to save her. It's pretty much the opposite, since she is already disappointed of her prince, that took her out into the big town so she could do his chores... actually that's not quite right... she came to hate the prince and wants revenge for using and playing her.\\n\\n\r\nHaving that said, Kyoko is a rather fresh and surprising character. With her hate and her own spirits fighting each other we see a lot of her inner conflict of trying to become loved by the public and at the same time being full of hate for Shotaro. We can expect a lot more character developement.\\n\\n\r\nThe other two male characters influencing Kyoko's new life certainly seem interesting as well. \\n\r\nShotaro is pretty much the guy who thinks too highly of himself and is for now the perfect guy for Kyoko's hate manifestation, but then there are times where it seems like all that Kyoko want is to be acknowledged by him.\\n\r\nRen on the other hand is a perfectionist, who takes his job seriously and expects others to do so as well. Since Kyoko is want to be an idol only out of revenge he certainly has a little problem with her. But judging him now wouldn't be right, since there wasn't much screentime focused on him up till now.\\n\\n\r\n9 points for Characters Development to look forward too\\n\\n\\n\r\nSound:\\n\r\nThe background music/sound often go by unnoticed, which actually might be a good thing. That is not because the music is bad, but rather because this way the watcher can focus a lot more on the story. Which in turn means it's simply not necessary to pep up the story with catchy music, because it can stand on it's own. But you gotta admit the music isn't too impressive either.\\n\\n\r\nI won't rate the opening and ending, since that often depends on personal flavor. (okay... I do prefer the ending song ^_^)\\n\\n\r\n7 points for a well used and solid music\\n\\n\\n\r\nArt:\\n\r\nThe art quality certainly is a very good one. Definetly above todays average. The characters are overall very well drawn, and the backgrounds are always fitting the context perfectly. \\n\r\nSadly animation quality is at very few points not at it's peak, but even then still a good one. Also sometimes the background seems a bit empty, but that's not to big of a deal since it's usually enough to carry the athmosphere.\\n\\n\r\n8 points for nice work from the graphics department\\n\\n\\n\r\nEnjoyment:\\n\r\nThe story just makes me want to cheer Kyoko on. Damn, this girls deserves her revenge. *waves a Kyoko flag with waterfall eyes and starts shouting &quot;KYOKO! KYOKO!&quot;*\\n\r\nIt's not only the really interesting story, but also all the little bits which make laugh that make this anime such a great show.\\n\r\nThis anime goes even with a perfectly balanced pace, blended out of story advancement and humour.\\n\\n\r\n10 points for Kyoko and all the hilarious moments\\n\\n\\n\r\nI for myself find me really enchanted to Kyoko and this anime. So give it a try as well. ;)\\n\\n\r\n9 points overall\\n",
            "date": "2008-11-15T17:36:00+00:00",
            "helpful_count": 217,
            "mal_id": 9514,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81114.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Silberkralle",
                "username": "Silberkralle"
            },
            "url": "https://myanimelist.net/reviews.php?id=9514"
        },
        {
            "content": "Lovers of comedy, dynamic characters, and stories with the realistic backdrop of a dog-eat-dog show biz world, rejoice! There is a perfectly enjoyable and ultimately very satisfying anime in store for you called Skip Beat!. \r\nSkip Beat! follows the endearing young Kyoko Mogami as she travels 200-something miles across Japan to support her childhood friend Sho in his debut as a pop singer. She continues to bail him out until she finds out he's only been using her for her delicious cooking and wife-like, hardworking traits. And he's allowed to because he is THE Fuwa Sho? Kyoko doesn't think so.  \r\nHere's where the animegets a little interesting. \\n\\n\r\nUnlike other female leads who might cry over numerous tubs of ice cream while re-watching their favorite soap operas, Kyoko takes this pain and suffering she's gone through and turns it into something beautiful. She uses her new-found hatred for Sho as an endless supply of fuel for her journey into the mysterious and somewhat scary world of show business. \\n\\n\r\nLike Kyoko, all of the characters in this anime have a reason to do what they are doing. They all have a single purpose they are trying to achieve through professions such as acting, singing or debuting in big-budget films. \\n\\n\r\nBecause not all of the characters were there for the same reason, we as viewers are able to see some great ideology clashes and disputes that break out among this wide variety of characters. \\n\\n\r\nThinking back, the sole reason why this anime was so enjoyable was the cast of wacky, memorable characters who brought a sense of purpose and bursts of life to what could have been a very stereotypical, bland and fabricated holywood-glamorized portrayal of the world of show business. This cast includes the enigmatic Tsuruga Ren, the selfishly obnoxious Fuwa Sho, the tsundere-dere \"Mouko\" and the all-knowingly eccentric LME president. While their characters may seem generic and cardboard-like at first, the story's excellent pacing and wonderful use of character interactions gives depth and meaning to each character.... \\n\\n\r\neven the most unlikable character becomes slightly tolerable as you learn to appreciate his existence in the anime. \\n\\n\r\nThat being said, the characters' designs were not exactly up-to-par or great. I am an artist myself and it's probably the reason why I am so particular about the aspect of art in an anime. The colors were generally very bright and one-sided, while the character designs themselves didn't stand out much. I did like the emphasis on the expressions of the characters that changed when they were acting but other than that, there was nothing much to look for. \\n\\n\r\nIt was truly the characters themselves and the cast of seiyuu who did a fantastic job portraying their animated-counterparts that made me like this anime. \\n\\n\r\nThe same goes for sound. Nothing was very special about the upbeat, very forgettable pop-song opening but the ending did a very nice job of capturing any left over angst and anxiety from being a victim of horrible circumstances. OST's turned out to be fine as well, mostly in the department of dramatizing an event or adding extra suspense. \\n\\n\r\nLastly, I appreciated the anime's ability to create an engaging atmosphere with the audience as it tackled the tricky topic of what really goes on behind the camera. How much are we seeing of these underpaid actors who go through sleepless nights and bottles of gin to try and perfect their role?\\n\\n\r\nNothing, really. \\n\\n\r\nWe only see their perfectly chiseled faces covered in pounds of make-up and we think, \"man that's the life.\"\\n\\n\r\nThis anime reveals all of the ugly that actually goes on behind that makeup and perfectly lit photos while remaining professional, non-cliche and upbeat. There's no unnecessary drama, no stupid tabloid induced scandals, no fake love relationships. It could have easily gone down the reality-tv-show path of \"look, stars are real humans too! they eat lunch just like we do!\", but it didn't, thank goodness. \\n\\n\r\nWe empathize with these characters and their struggles and triumphs because we actually SEE what they're going through. \\n\\n\r\nThe anime is able to give us viewers insights on their world in a very down-to-earth and realistic manner. \\n\\n\r\nAll in all, this anime was fun and very easy to get lost in. I remember seeing it as a middle schooler thinking \"wow this is pretty good\" and now, as a more-grown-up-but-still-kinda-childish viewer, I'm still thinking the same thing. If you're looking for a nice way to spend your Saturday afternoon, go ahead and watch it. I encourage you to. \\n",
            "date": "2013-07-16T22:31:00+00:00",
            "helpful_count": 80,
            "mal_id": 105685,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/277877.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hinahinaxxchoco",
                "username": "hinahinaxxchoco"
            },
            "url": "https://myanimelist.net/reviews.php?id=105685"
        },
        {
            "content": "We know the story of the plucky girl making it big in the glitzy world of showbiz.  It's the story of Bridget Jones, Josie, the Pussycats, and even Hanna Montana.  Skip Beat! puts a welcome spin on it, and it's not just the (fascinating) insight into the Japanese entertainment industry.  The story is consistently compelling throughout, and the surreal imagery is inventive and keeps the tone light and humorous, even as its emotions are scathingly deep.\r\nWhile it's not beneath the show to humiliate the characters or make them look foolish, they are complex and principled, and the show has enough compassion togive them their dignity.  The way it allows even its most prickly characters to learn and change feels natural, authentic and worthwhile.  It's rare to see any show about anything from anywhere as concerned with human dignity as Skip Beat! is.\\n\\n\r\nLet's have a second season, already.",
            "date": "2010-11-02T16:59:00+00:00",
            "helpful_count": 61,
            "mal_id": 31787,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/399890.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zarusoba",
                "username": "zarusoba"
            },
            "url": "https://myanimelist.net/reviews.php?id=31787"
        },
        {
            "content": "Been quite a while since I last found a shoujo title that I genuinely enjoyed. Skip Beat focuses on the challenges faced by our lead Kyoko in trying to become a successful actress as she learns that she wants to get more out of it besides being a tool to get revenge on her jerk of an ex-boyfriend and popular musician, Sho Fuwa. Some have called the series as something of a Cinderella story and the description seems mostly accurate as we learn of Kyoko's tragic and impoverished back story and dealing with the ramifications of being abandoned by those close to her. The emotionalscars do affect her at the start of the series as she lacks the passion for wanting to enjoy acting at first as she only seen the profession as a means of seeking revenge on Sho. But as episodes progress, she does develop a genuine love for acting, sees it as something she feels motivated to excel in beyond her original goal of revenge and a number of episodes revolve around how Kyoko approaches a role she would be performing in.\\n\\n\r\nBeyond Kyoko, some other characters get focused on within the world of stardom as they come to connect with Kyoko and we learn of their own personal challenges they struggled through to get to the point where they were at within their careers. Tsuruga's character is given the more prominent focus in his interactions with Kyoko as he seemingly hates Kyoko's motivations for persuing an acting career at first, before the changes in her motivations lead him to start supporting her and developing feelings for her. The series does drop hints that Tsuruga may have a more tragic past than Kyoko and he may have known her for far longer than she thinks, but the series abruptly ends before more of these aspects to the storyline could be explored. This weakness appears to be due to the title's manga source material still being ongoing as of this review.\\n\\n\r\nAnother issue I did find with the series at points came with its comedy. Scenes with it tend to pop up throughout a good part of the series, serving to either exaggerate on a conflict or emotional state affecting one of the characters or to lighten the mood following a rather serious development in the show's storyline. The title's comedic style was hit-or-miss for me as I had some moments where the humor focused on the former got me laughing, but others left me indifferent and usually had me feeling that they got in the way of the mood of serious scenes for the latter mentioned moments. Fortunately, the comedy does tone itself down as Kyoko's emotional state improves from adjusting positively to her new life as an actress and doesn't intrude too heavily upon later developments with her character and others.\\n\\n\r\nThe visuals to the series are rather standard for a late 2000s anime in terms of detail and design for characters and scenery. Details are clean and bright color is used to go along with the show's upbeat mood, but this and the animation for Skip Beat don't particularly stick out. The same thing applies to the show's soundtrack as it does its part to complement scenes in the series that fit for their intended purpose, but have nothing too memorable with them.\\n\\n\r\nGripes aside, Skip Beat is still one of the better shoujo titles I've seen recently as there hasn't been anything from the demographic that has seriously hooked me beyond a number of titles that came out during the late 1990s and early 2000s. The focus on Kyoko's growth as an actress is a compelling and enjoyable story worth seeing throughout Skip Beat's 25-episode run, alongside other characters in stardom who interact with her. If you're a shoujo anime fan, this is worth a definite look.",
            "date": "2014-11-01T20:11:00+00:00",
            "helpful_count": 30,
            "mal_id": 167085,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=167085"
        },
        {
            "content": "What's fun when I watch a comedy show is the presence of a crazy character. In anime you'll surely find wacky characters such as Hiruma-sama (Eyeshield 21) and Kona-chan, but no one is wierder than Mogami Kyoko from this anime/manga skip beat. She was one of my most loved shoujo characters and as expected, the fun was multiplied when Skip Beat was adopted to an anime series.\r\nThe plot is quite ordinary, \"a tale of revenge\", but what separates it from the classics is the reason why and how it will be done. Kyoko decided to enter showbusiness to ruin the rising superstar Fuwa Shou, herchildhood friend that betrayed her. The fact that she was once called by him as 'plain faced' never affected Kyoko's determination. She willingly accepted few jobs and awkward situations just to gain her goal of being an idol and smash it all on Shou's face.\\n\\n\r\nThe kind of love story featured in the series was some kind of indirect romance which thrills me better than the showy type that was full of confessions and emotions.\\n\\n\r\nSo far, I think Skip Beat was one of the best Romantic Comedy Anime this season.",
            "date": "2008-12-21T23:39:00+00:00",
            "helpful_count": 30,
            "mal_id": 10555,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30049.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/graysky14",
                "username": "graysky14"
            },
            "url": "https://myanimelist.net/reviews.php?id=10555"
        },
        {
            "content": "Love can make people do crazy things, even if it’s skipping high school to follow your boyfriend to Tokyo to begin his career as a rockstar. Admittedly, the popular rom-com Skip Beat may give bad presumptions when it’s revealed that the main character’s (Kyouko) sole motivation for entering showbiz is to seek revenge on her ex-boyfriend (Shou) by outshining him. In actuality, Skip Beat is just as fun to watch as its name portrays it to be. The plot itself is actually what brings out the comedy in the anime because of the characters’ reactions. The anime is not reflected on a girl’s life thatrevolves around her ex, but it focuses on how she discovers herself. Apart from the steady pacing, Skip Beat is also a prime example of how creators advertise a manga by ending the anime with a cliffhanger.\\n\\n\r\nThe pacing is steady and engaging, and there are no fillers. The dramatic and funny moments are perfectly balanced. Nothing is immediate, including Kyouko’s attempt at stardom. A romance story develops in the anime, and the steady pacing is fulfilled by showing no intimacy within the series. The story also reflects on other characters instead of solely Kyouko, so the viewer gets to learn of situations from those characters’ points of view. \\n\\n\r\nThe only problem with Skip Beat is that the story is incomplete. The romance is still in development and has a while until it fully blooms. Kyouko has a past with another main character that was shown in brief clips in later episodes, but it is never fully revealed. Kyouko is clueless about it, while the other character still keeps it a secret. Additionally, a new subplot was introduced near the very end of the series, and a solution is never reached. Although the story itself is incomplete, the creators did a good job on giving a hopeful ending. All of the characters were given a reflection, and it gives the viewer enough for the imagination. Since there has been no talk of a second season for the past four years, the viewer is left with no choice but to read the manga in the meantime. (7)\\n\\n\r\nInstead of a weak-hearted female lead that is usually present in shoujo anime, Kyouko is an aggressive and driven individual. All characters have their own personality, and it’s cool that some actually address the stupidity behind Kyouko’s motivation for showbiz. The main characters and supporting characters all balance out the theme of the anime. There are some characters with huge egos, contributing to the comedy as Kyouko enters the entertainment world by taking one step at a time. The contribution of the other characters also helps Kyouko develop into an independent and strong woman. The “Character” category would have a perfect score of 10, but the interruption of the subplot placed a halt on some of the characters’ development. (8)\\n\\n\r\nThe animation is unique from most other anime. Apart from the plot itself, the animation is to thank for the comedy. Demonic and depressing auras, along with emotions, are drawn hilariously with ghostly figures. Also, the characters’ designs as chibi are both funny and adorable. The colors are exceptionally vivid and bright in the character and background designs, giving off a refreshing and fun atmosphere to the anime. (10)\\n\\n\r\nThe voice actors were superb. Marina Inoue (voice of Kyouko) did an excellent job separating her innocent vs. aggressive voices to fit Kyouko’s split personality. “Dream Star” by generous is upbeat and expresses Kyouko’s confidence within herself. The OP and ED changed at Episode 20 as there is more love affection shown between characters. The background music is played at the right moments and fits the moods of each episode. (10)\\n\\n\r\nSkip Beat was very entertaining. I was desperately looking for a rom-com, and Skip Beat was often recommended. I turned it down several times in the past because of the synopsis. I was disappointed with no immediate romance, but the steady pacing caused the anime to exceed my expectations. The comedy and Kyouko’s determination are what mostly kept me watching. After the first episode, I became anxious to watch the next episodes to watch Kyouko achieve her goal. I disliked how some characters’ pasts were not emphasized and how a new subplot was introduced near the end. Now I’m reading the manga to complete the story. (8)\\n\\n\r\nSkip Beat is unique from other Shoujo anime, and it’s all thanks to a strong female lead. The drama and comedy are balanced, and the plot is irresistible as you’ll become drawn to the story and feel the need to watch it ‘til the end. It is meant to advertise the manga by leaving the viewer with a cliffhanger. As someone who read the manga after completing the series (starting at Chapter 67), I say that jumping on the Skip Beat bandwagon is definitely worth the ride. (8)",
            "date": "2014-01-06T09:48:00+00:00",
            "helpful_count": 27,
            "mal_id": 127523,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=127523"
        },
        {
            "content": "Skip Beat is truly one of my favorites of all time ever since the manga starts its publication, yet the anime capture every detail in the manga. The heroine is not your usual girl who always cries when down and weak all the time, but instead she becomes stronger and stronger. \r\nThe story starts off about a \"Pandora Box\"  that was given to each person, and no one knows what is sealed inside. One Day, when Mogami Kyoko finds out that she was only being used by Fuwa Sho, her \"Pandora Box\" opens and promised revenge against Fuwa Sho. Then the start of hertransformation and debut in the entertainment world begins....",
            "date": "2008-10-06T04:51:00+00:00",
            "helpful_count": 22,
            "mal_id": 8477,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23547.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chizuru86",
                "username": "chizuru86"
            },
            "url": "https://myanimelist.net/reviews.php?id=8477"
        },
        {
            "content": "I was initially reluctant to start this anime, the synopsis sounded like it could go either way in terms of quality.\r\nFortunately i quickly got into this anime from the first few episodes, to the point i quickly found myself losing track of how long i'd been watching for.\r\nIt's fair to say if your not taken in by the first 2 episodes, this probably isn't the show for you.\r\nWithout the doubt the main strength of this show is the protagonist Kyoko, her character and her attitude instantly warms the viewer to her and you can't help but want to see how she advances through the idolindustry and how she develops her relationships with the support characters.\\n\\n\r\nThis anime is largely character driven, the plot itself does little more but present scenerios for Kyoko to meet a wide variety of characters throughout the show. If i were to compare this show to anything, it heavily reminds me of Fruits Basket, both with the main character, and the shifts from comedy to drama to undertones of romance. \\n\\n\r\nI found myself finishing every episode with a smile on my face, it's fair to say i found this show genuinely heart warming, i'm hoping to see a second season, because with only 2 episodes remaining there still seem to be alot of lose ends to be resolved.\\n\\n\\n\\n",
            "date": "2009-03-18T12:35:00+00:00",
            "helpful_count": 15,
            "mal_id": 13291,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=13291"
        },
        {
            "content": "thought the opening sequence and song aren't all that inspiring, this anime (based off one of my favorite shoujo mangas) is a pretty well done and enjoyable adaptation so far.\r\nThe story and plot are strong funny, unique, definitely something worth building on, which the animation and voice actors managed to capture pretty well.\r\nKyoko in all her crazy flaming glory, Yoshiki Nakamura wonderful brand a humor all working towards a shoujo story that  stands out in a genre swimming with weak weeping leading ladies, so if you want a girl series that's a bot different and always willing to make fun of itself, give Skip-Beatthe anime (and the manga if you haven't already, RIGHT NOW) a shot.",
            "date": "2008-10-17T01:09:00+00:00",
            "helpful_count": 14,
            "mal_id": 8743,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sdblaine",
                "username": "sdblaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=8743"
        },
        {
            "content": "If you disregard animation and art, the gender of the main character (usually) and other minor differences; one major difference remains between shoujo/jousei and shounen animes that have romance and drama as the two main themes. This difference protrudes as one thing and that is character interaction, character interaction is a result of script/screenplay and to a certain extent storyboard. Character interaction is one of the key features in anime that needs to be executed well for it to be successful, if an anime has good character interaction then you can almost forgive everything else that's bad about that particular anime. This being said, therehas never been nor will there ever be (probably) a shounen romantic drama/comedy with as good character interaction as a shoujo anime equivalent in themes.\\n\\n\r\nNow why I have decided to start this review by talking about character interaction is because Skip Beat has good character interaction and this saves it from being a bad anime. Now ransack your hearts; this anime had fairly weak storyboard, the events happen rather haphazardly and the character development of some characters are below mediocre. In truth though, it's hard to have good character development for many characters but then you really have to make the characters undergoing bad character development either forgettable or really, really good in entertainment value. Skip Beat did not deliver this hence why some characters feel unfinished or even unnecessary to the story.\\n\\n\r\nAll the same this anime is very good, it was a good concept and I particularly enjoyed the fact that the main protagonist wasn't some meek, weak pushover that so many other female main protagonists have been. There was some spunk in this girl that I appreciated even though she could be a bit too clueless at times regarding some things for my liking.\\n\\n\r\nNow my overall rating of this anime is based on the things I have pointed out in this review, but also on the fact that I am expecting a season two as it was not only hinted at the end of the last episode but also due to the storyboard and the overall worthless conclusion to the anime, you know it, I know it; we have seen that ending before. So many times... so many times. Atleast it wasn't as bad as KareKano though.",
            "date": "2009-03-31T11:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 13648,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=13648"
        },
        {
            "content": "Shoujo Lovers! This is something you can't afford to miss out. As for the rest, you might think twice if you are going to overlook this anime, just because it's, you know what, \"Oh! Another shoujo anime. I will pass.\"\r\nA couple of my female friends (blu-chan, hagumi_honey) have been pestering me to watch this anime. I was quite reluctant as the story seemed too iffy when i read the synopsis. And then, I recommended the anime to my sister, since she is a crazy shoujo anime fan, and decided to overlook the anime myself.\r\nI was just recently having the time of my life, with Hayate,Ippo and Spice and Wolf II all rolling week in week out, until they all ended. I was looking for a replacement but was not sure what to pick. Then I checked my HDD and thought \"okay. there is skip beat! there, I copied from my sister's.\" I thought lets see whats so good about it, as my sis has been ruining my life wanting me to see that.\\n\\n\r\nAnd here I am, fell in love with the anime. It actually amazed me to find out later on that the original manga started way back in 2002, and has been really popular ever since and still ongoing.\\n\\n\r\nAnyways, thats me and Skip Beat! Now for the review:\\n\\n\r\nHere is your synopsis. Kyoko (Marina Inoue), an energetic and devoted girl, gave up school and decided to follow her prince-charming Shoutarou 'Sho' Fuwa (Mamoru Miyano) to Tokyo as Sho has set his dream to become the next big thing of Japan. Yeap. His aim is to become the number one Idol in Japan. But there is this big problem. The current heart-throb of Japanese Entertainment line, Ren Tsuruga (Katsuyuki Konishi). Sho goes out of control whenever there is anything about Ren, and throws his frustration and whatnot to Kyoko. Kyoko, as a result has been hating Ren for ruining her love-life. And she badmouths Ren all the time to show her support for Sho. Kyoko, giving her all to Sho, decided to follow Sho through and through, until she overheard that Sho thinks lowly of her and the only reason he keeps her around is for household chores. Kyoko's world shatters. She throws her hatred to Sho and promises him vengeance, that she will take him on in the very world he wants to rule over, the world of showbiz.    \\n\\n\r\nStory: 10/10. One of the most lovable of shoujo stories out there I can tell you. Its right there in the ranks of the best. The story is simple but powerful, gives you the \"what will happen next\" and full of unpredictable outcomes that will keep you entangled and without knowing, you'll definitely get absorbed in no time.\\n\\n\r\nThroughout the entire anime, you'll find the determination and dedication runs through Kyoko and how she without even knowing herself, affects the people surrounding her, the obstacles she is about to overcome to reach her goal, and add to that, doing things which are irregular, if not insane.\\n\\n\r\nAnd of course, there is love to bloom. Kyoko, dejected through Sho, has closed her emotions of love and decides to never fall for anyone again. Ren, whom she has been badmouthing while with her days with Sho, she finds him also cold and lacking heart. But the reason behind Ren's coldness towards her, is something she doesn't know. But soon, she finds out that Ren is, deep down is not what she usually thought him to be. Will her heart finally skip a beat for the Japan's Number One? Find out yourself!\\n\\n\r\nArt: Okay, I will be honest here. Most of the shoujo anime sucks in drawing when it comes to surroundings. This one isn't an exception either. I hate to tell this, but every time I saw Ren's Porsche 911, I really wanted to redraw that. So yes. 5/10 for artwork of the surroundings.\\n\\n\r\nWhat covers up for the lack of details in the surroundings is of course the character drawings. There are lots of lots of chibi scenes, i would say every the other scene is probably drawn with chibi characters, but that goes so well with the mood and makes the anime even more lovable. But the best part about the drawing will remain the expressions when the mood is serious or needs attention. The eyes, eyebrows, the lips, the facial shadows everything is drawn so lively that you can actually not only feel the emotional state of the character but also the atmosphere around them. 10/10 for character drawings, which in whole gets an 8/10 overall.\\n\\n\r\nSound: The BGM and the OP/ED are really superb. The sounds actually help to change the mood and the sounds change often as the animation hovers between serious expressions and chibi drawings. What makes it even more enjoyable is that the sounds are nicely blended with the screenplay. There was not once I felt that the BGM didn't go with the screenplay. As for the OP/ED, I fell in love with both the ED songs and I am sure anyone will too. The second OP is also very nice. Sound gets a 9/10 from me.\\n\\n\r\nCharacter: This is where the anime is probably reached its best. Kyoko, instead of falling apart, decides to take on Sho from the very instant her world is crushed. Her determination, dedication and ambition mixed with her softness and kindness, make her character one of the best female characters I have come across so far. Her self-declaration of not falling for anyone ever again, shows only her emotional state and although she believes her emotion of love is long dead, she does things for others which shows, deep inside, her heart is still capable skipping a beat or two. This is probably Marina's best performance as a seiyuu after Kasahara (Toshokan Sensou). \\n\\n\r\nSho, performed by Mamoru Miyano, is already a legend in seiyuu world (Light Yagami (Death Note), Setsuna F. Seiei (Gundam 00), Tamaki Suou (Ouran Host Club), Death The Kid (Soul Eater) and many more). There's nothing much to say about his performance as his character amazingly swindles when he is in the public and when is in private. His shift of voice has always been a class above regular seiyuu and thus making him arguably the best in recent times. Sho is just another addition to his illustrious seiyuu career. He performed so well, you will definitely hate Sho.\\n\\n\r\nRen Tsuruga, performed by Katsuyuki Konishi, (other major performances: Kamina (TTGL), Komui Lee (D.Gray-man), Haji (Blood+), Tooya (Ayashi no Ceres) Ozma Lee (Macross Frontier) etc.) has been amazing. Ren doesn't show his true emotion in front of everyone. His true personality remains a mystery to Kyoko as she can't compare the Ren who can be both cold and warm from time to time. Konishi performed the character as it should be, Ren, the number one Idol in Japan, who is professional to the last and always puts his works as priority one, shows the reason why he is the most successful man in the world of entertainment. As the anime progresses, Kyoko starts to understand Ren bit by bit, and without knowing herself, starts to admire him as her senpai.\\n\\n\r\nAnd the anime character list is rounded up with other interesting characters Kyoko is set to meet as she is about the find out that 'revenge over Sho' is not the reason anymore as she takes every step to become an actress.  10/10 for characters.\\n\\n\r\nEnjoyment: You bet I want moar! This anime is absolutely a masterpiece of entertainment. Seriously, I can't but have to say I will love to see they are making a 3 or 4 seasons of it. For now, I will be hoping that the anime gets a well deserved Season 2. And I will be getting the first release out online, because not having Skip Beat! in my watch list is almost hurting. 10/10 for enjoyment.\\n\\n\r\nOverall: I will rate it 9/10, as a whole. This anime has given me so much entertainment that I can rewatch this anime over and over again and will never, ever get tired of it, that I can assure.\\n\\n\r\nI am not sure whether my review will be enough to encourage more people into this anime, but I can guarantee one thing, you wont be able to drop this anime once you've started it ;)   \\n\\n",
            "date": "2009-11-07T01:24:00+00:00",
            "helpful_count": 12,
            "mal_id": 20322,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23258.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shanimebib",
                "username": "shanimebib"
            },
            "url": "https://myanimelist.net/reviews.php?id=20322"
        },
        {
            "content": "This review comes from my own opinion. ^ ^\r\nOk, so I've recently finish watching this anime. I've came across it quite a few times, but didn't really bother watching it because the description of this anime just didn't sound all that interesting. I watching it, and now I am regretting not watching it sooner. :)  \r\nStory: Well i gave it a 10 out of 10.\r\nThe story truly is one of a kind, it quite surprised me. Well the basic story is about a girl named Kyoko who WAS always stepped on by the one guy she would give anything to( an up-coming star atthat). Through certain chains of events (Yes i will not give spoilers cos i REALLY hate them) she realized she that she needs a change of personality, she will NOT be a pushover any longer. At this point in time she is determined to get her revenge. As she thought she realized....whats worse than to out-shine a star? And that's what this girl is striving for in this anime revenge.\\n\\n\r\nArt: Um, well, I am no expert, so therefore i am not really particular about the art it self. I (as an amature) think the anime art work is done well, plus the quality is pretty good therefore i gave a 10 out of 10. \\n\\n\r\nSound:  Opening - Well the opening song was OK. Well, then again, I am PRETTY choosy when it comes to openings. Um, well PERSONALLY didn't like the intro music much(don't kill me for it), but it was still good cos the song lyrical wise did indeed match with the song :) .  Well like one thing i should include is that i think that everyone likes diffrent types of songs right? so i think everyone has their own opinion about it hehe~\\n\\n\r\nApart from the opening throughout the anime it seems as they put good background music. They really do try to fit the mood, and it really does show.  Therefore i gave it a 8 out of 10 ^ ^\\n\\n\r\nCharacter: Well the characters are all very unique to one another. Well, the female lead (Huraayy) Kyoko is the beginning is very attached and thinks she cant picture her life without her beloved Shotaro. Shes been living with his family since she was young and became very attached to him, after all she DOES love him. Since he wanted to pursue his his dream career as a star and decides to take Kyoko along with him (but not for the reasons Kyoko THINKS). Anyway that's her in the beginning of the story, but she drastically begins to change for the better. She soon starts to relize she must do things for herself too, because she gave and gave to others (meaning Shotaro) but she never took the time to give to herself. Along her journey to a better self, she makes others relize them selfs aswell. Another main character in this story is Ren, a cold hearted star who never expereanced happiness till Kyoko can along. Many characters in this anime change for the better.\\n\\n\r\nOver all, i think all the characters were well thought out (Kyoko-giving caring passionate ect... Shotaro- Full of himself, cruel, antagonist,  Ken- cold, distant, means well.) Well i think that the writer put a lot of thought into designing the characters. I was very impressed on how well the clashed with one another. 10/10 :)\\n\\n\r\nEnjoyment: Well i got to say straight of the bat 10/10. Some parts were so filled with humor i just could not stop laughing. The thing is, its not just that that was enjoyable, the serious moments aswell, your just so into it that your expressionless. So a very good amusement in all aspects ^ ^\\n\\n\\n\r\ni got to say, 9/10 over all.\\n\r\ni recommend this to anyone that's interested in good animes ;)\\n\\n\r\nheheee hope this helped some of you~",
            "date": "2009-05-06T16:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 14830,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/177372.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BleachedSoul",
                "username": "BleachedSoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=14830"
        },
        {
            "content": "Wahahaha!!! Don't waste your time contemplating whether you're gonna watch this or not. I'm telling you, go directly to your favorite streaming site or prepare your torrent downloader for this. This ANIME will shake your life.\r\nwell, not really, ahem, kinda just carried away...\r\nI just made a recommendation of Skip Beat, it's with Ouran Host Club. My Ouran is my 2nd favorite anime,because i believe it greatly represents the SHOUJO GENRE. to tell the truth, i enjoy better shounen anime than shoujos, but OURAN changed my mind..as well with SKIP BEAT. Wahahahah!\r\nWho wouldn't love Kyoko, the main lead. I'll admit it. I can see some partof me into her character. I still wish to be a princess, there's still the little child inside in me who still believes in fairy tales. Even though Kyoko is not speaking of it, her feminine side is so realistic and is so relevant to the youth today. \\n\\n\r\nA good lead is one my criteria in choosing anime. Just like Haruhi, I really really like free-spirited, intelligent, smart and strong-willed heroine. AND KYOKO FULLY EMBODIES IT. She's way better than my Haruhi-chan. OH mY GOSH!\\n\\n\r\nThe REVENGE part is the best thing, because this help us to see the real Kyoko. I like her. She's not a show off. Yes, she might be a cry baby but is never an annoying one. She has a good disposition in life. She is not lady-like, which is the BEST about her personality. She is not boxed. WUSHU!\\n\\n\r\nAnd Ren, wufufufu! To think that Jerry Yan is gonna portray his character in the live action adaptation is such a...a....a.....a..........FEAST TO CELEBRATE...wUSHU~ I'm thinking of RAIN. well, whatever. Ren Tsuruga is not your ordinary good boy bishounen. Good ThinG! I hate Gentle Lead Male who is SO GOOD TO BE TRUE! He has also his own evil ways, well, towards Kyoko. Which makes the 2 a more romantic couple...\\n\\n\r\nThere goes SHO,,I also like his character even though he's supposed to be the antagonist. not only because my favorite dubber voiced him (MAMORU MIYANO) but he's also NOT AN ARCHETYPE. He's the coolest villain evAH!\\n\\n\r\nWell, if you like interesting characters like me, and just wanna have plenty of good and goofy times, try this right now. This will even surpass the Twilight Craze...BWAHAHAHAH!! Let's SKIP THE BEAT!\\n\\n\\n\r\nP.S.\\n\r\nI also like Moko-san, Kyoko's partner...\\n\r\nI hate Ariel Lin,,I don't want her to do Kyoko's role...can they change the casting please...\\n\r\nLooking for more happy episodes...\\n\\n\\n\r\nLove lots,\\n\r\na newbie from Love Me Section \\n",
            "date": "2009-02-07T07:35:00+00:00",
            "helpful_count": 11,
            "mal_id": 12200,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119010.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/docalion",
                "username": "docalion"
            },
            "url": "https://myanimelist.net/reviews.php?id=12200"
        },
        {
            "content": "This is a fun show.\r\nThe main character, Mogami Kyouko, is one of the best shoujo heroines to pop up in a long time. I adored her dual personality--she swings between being an innocent, sweet, caring girl to a vindictive, bitter one at the drop of a hat! Her facial expressions are a riot, too, especially her chibi ones.\r\nUnlike so many heroines of this genre, Kyouko's motivation for seeking greatness in showbiz is revenge, not love. Of course, revenge is never a good motivation, and a fair portion of Kyouko's character development involves her learning to love and trust people again, or at least to learnto enjoy acting for its own sake.\\n\\n\r\nThe rest of the main characters are equally enjoyable. Japanese voice actor Miyano Mamoru (Light from Death Note, Tamaki from Ouran HSHC) is absolutely perfect as as Shoutaro--the character's arrogance, massive ego, and adolescent attitudes are fully on display whenever he speaks. Kyouko's eventual love interest, Tsuruga Ren, voiced by the always-fantastic Konishi Katsuyuki (Kamina from Gurren Lagann, Soubi from Loveless, Hisagi from Bleach), is frankly one of the hottest bishounen to appear on screen in recent memory. He's a fully developed character too, with his own flaws and foibles. Interestingly enough, the viewer sees a good quantity of the action from his point of view, which makes him a refreshing change from the mysterious, aloof bishie that one often sees in shoujo anime. Kyouko's friend, \"Mouko\" and Ren's manager, Yashiro, are fine additions to the anime's cast as well.\\n\\n\r\nThat is not to say this anime is without flaws. The animation is rather poor, and the frame rate is embarrassingly low. Of course, there really isn't enough action in this show to really merit a high animation budget, but at least they could have used fewer still-frame shots and included a little more detail in the sparse character designs. It also seems like that the animators, every time they could, replaced the backgrounds with pink shoujo sparkles and reduced the characters to chibi forms just to save drawing effort.\\n\\n\r\nThe anime suffers from major pacing problems as well. The show progresses at a crawl, lingering much too long on unimportant events (like the mini-arc involving the little bratty girl) instead of progressing the plot or Kyouko's relationship with Ren. The ending (don't worry, no spoilers here) leaves something to be desired, too, as it cuts out in the middle of one of the manga arcs. It makes me wish they'd hurried up more in the beginning so they could have at least finished the storyline (perhaps they were hoping for a second season...?).\\n\\n\r\nAnyway, overall this anime is worth watching. The characters, plot, and over-the-top humor simply make up for whatever compositional flaws there are.\\n\\n\r\nAnd for those of you who've finished the anime and are looking for more, definitely pick up the manga. It eats the anime for lunch.",
            "date": "2010-05-30T19:24:00+00:00",
            "helpful_count": 10,
            "mal_id": 26605,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304468.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/7PhoenixAshes",
                "username": "7PhoenixAshes"
            },
            "url": "https://myanimelist.net/reviews.php?id=26605"
        },
        {
            "content": "Skip Beat is definitely one of my favorite anime shows. I honestly don't normally like most shoujo anime, but Skip Beat is different. This show is on my top 5 because it has a fantastic storyline, fantastic characters, and nonstop excitement. On top of that, it has romance as well...with a twist. Kyoko practically loses her ability to love after being betrayed by the only guy she ever loved. She had basically devoted her life to him so, on that fateful day when she is betrayed, it sets her loose. Kyoko stops being a sweet, innocent girl and goes into show business as Fuwa Shotaro(the guy she liked) already is a popular singer. She stops at nothing to try to outshine Sho. He was cruel and now, he needs to pay in her eyes.  What will it take? Will Kyoko be able to rise to the top? Can she really win when she only desires revenge? Watch the anime, read the manga, Skip Beat is fantastic!\\n\\n\\n\r\nThe story~\\n\r\nThe story is excellent and very unique.  Kyoko basically becomes a popular actress because she wants to get revenge on Sho.  It starts off like this, but then she changes.  Acting becomes her passion, and it's not all about revenge anymore (although she still hates Sho haha).  She builds a new life for herself in a way, with new relationships and more.\\n\r\nArt~\\n\r\nFor art, I must say this is the lowest point of the anime/manga.  The men all have weird, pointy chins although the girls look decent.  Honestly though, besides the chins, everything is pretty ok xP.\\n\r\nSound~\\n\r\n8\\n\r\nThere is lovely music and it always fits the different scenes.  Don't have much to say, but the op/ed was better than average.\\n\r\nCharacters~\\n\r\nWow, the characters are something else.  Kyoko, Sho, Ren and everyone else become so developed throughout the show.  Hopefully, the anime will continue because they grow even more in the manga.  The characters are original and thoroughly enjoyable.  Even the villains end up fascinating you and aren't extremely cliche and boring.\\n\r\nEnjoyment~\\n\r\nOverall, I absolutely ADORE this anime.  I recommend this show to anybody who is looking something different from the typical, boring shoujo.  Skip Beat is on my top 5 for a reason! ;O",
            "date": "2009-05-06T16:49:00+00:00",
            "helpful_count": 9,
            "mal_id": 14831,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155981.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Redvines32",
                "username": "Redvines32"
            },
            "url": "https://myanimelist.net/reviews.php?id=14831"
        },
        {
            "content": "The anime is amazing. The characters are learning some lesson throughout the story like learning to love or to move on if something doesn't go your way. The advice they put through the story somehow fits with reality. I don't really find the ending of the show that great but the rest of the story is extremely amazing and fits with the plot. I can't say i loved it but i did enjoy it and liked it, and i recommend you watch it.",
            "date": "2015-06-14T12:07:00+00:00",
            "helpful_count": 9,
            "mal_id": 190317,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4674226.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sarahgem",
                "username": "sarahgem"
            },
            "url": "https://myanimelist.net/reviews.php?id=190317"
        },
        {
            "content": "Ah...Skip Beat...what can I say about you, except that you're probably THE most enjoyable anime I've ever watched. If you've ever jumped into an anime, not expecting much of anything from it, so ready to drop it (I was NOT a big fan of the art at first) and yet after watching a few minutes of the first episode you knew you couldn't for any reason pull away? Well that's how I felt watching Skip Beat! I saw this a while back, but I've currently started reading the manga, so I thought I'd give it a review.\r\nStory:\r\nThe story is one of revenge. Kyouko is devotedto her childhood friend Shou and thus tries to help him out on his quest to become famous. But Shou is a jerk of epic proportions and he mistreats Kyouko to the point she can't take it anymore. She decides she'll get revenge on him for all he's done and how he's made her 'lose her youth.' She decides entering show biz and becoming an even bigger star than him is the way to go. Along the way she learns a couple of important lessons, growing and changing as she tries to make it to the top. It's really not the most outlandish story line out there but I don't think it's the most common either. Even if the story line wasn't solid, it's the trials and tribulations of Kyouko and her UBER awesome personality that makes this anime solid.\\n\\n\r\nArt:\\n\r\nI was a bit turned off by the art to the point I almost didn't watch it, but I decided to at least give the first episode a look-see and I was hooked. I've learned to feel comfortable with the art and I've come to feel it fits the characters just right.\\n\\n\r\nSound:\\n\r\nI don't pay much attention, so either way, good or bad, I wouldn't know XD\\n\\n\r\nCharacter:\\n\r\nKyouko is the solid lead of this anime and by all means it stands on her shoulders alone. She's not your typical weak, crybaby, shojo anime heroine. She's strong, independent, hard-working and strong-willed. Plus, she has a wicked vengeful, 'I'll kick your ---- any day!' kind of attitude. But at the same time she's pure-hearted and deep down she's really just someone who wants to be loved and accepted, whether she understands that herself or not. Plus, she's hilarious. The first episode alone has her whipping out like 100000 facial expressions that are just drop dead funny. That's another thing that makes her great, she's sooooo expressive. You're never at odds about what she's thinking. YOU JUST KNOW. The other characters are great as well, each having a personality that, although seems very shallow, is in fact quite multi-faceted. But one thing is always evident, it seems Kyouko is always the one bringing out the best in everyone. \\n\\n\r\nEnjoyment:\\n\r\nI don't usually laugh out loud at anime... to be perfectly honest, even if it's actually funny, I'll laugh on the inside. BUT I couldn't do that with Skip Beat. It was non-stop LOL-ness, to the point people were staring and thinking I was weird. I can truly say, if you're into this sort of anime, you'll be laughing your tail off too. It's just a fun anime. And you can't help but relate to Kyouko and feel everything she's feeling. \\n\\n\r\nOverall:\\n\r\nI'd say, for shojo anime lovers out there, this is the best I've seen. And I'm sure you'll enjoy it, even if not as much as I did.",
            "date": "2010-08-28T19:39:00+00:00",
            "helpful_count": 8,
            "mal_id": 30059,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/225791.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Naiika",
                "username": "Naiika"
            },
            "url": "https://myanimelist.net/reviews.php?id=30059"
        },
        {
            "content": "I fell in love with the manga and ended up watching the anime afterwards because I just couldn't get enough of it. That being said, I was highly disappointed with the anime adaptation, and felt like the overall vibe was very different than the original manga (and no, I am not someone who automatically feels that the manga version of any story is superior).  It's difficult for me to pinpoint exactly why I loved the manga and hated the adaptation, but I'll try. \r\nPlotwise, the anime more or less follows the story. Parts were shortened and some scenes eliminated, but nothing that really stoodout at me. However, the anime ENDS right about when the manga starts to get good and the characters start to develop. Skip Beat is a long a** manga (too long some might say - I love it but the mangaka does drag it on for quite a while), and the anime just barely scratches the surface, and leaves more loose ends that it resolves (honestly, if I only saw the anime without reading the manga at first, I would be confused and frustrated since there are so many things that are never explained or reseolved). One of my favorite aspects of the manga was how Kyoko and Ren's career in acting was incorporated in the story (especially seeing how Kyoko grew as an actor and changed for each role that she played), but that was not explored nearly as much in the anime. \\n\\n\r\nThe anime also emphasized some of my least favorite aspects of the original story, in a way that made the story seem much more cliche and Kyoko much more annoying. Kyoko comes across as much more over-the-top in the anime, and bent on revenge with not as many characteristics to make her rounded out (a LOT of her character development is also left out since the anime ends so prematurely). The pacing of the how Kyoko's relationship with Ren develops was also a lot faster, which makes it somewhat boring to me since you don't see as much of a transition from hate to apathy to friends to romantic interest. \\n\\n\r\nThe art was terrible. Very plain scenes that lacked in detail, angular and unattractive character designs, way too much chibi...maybe some of the worst art that i've come across in quite a while. \\n\\n\r\nOverall. I would say that this was a very dull and cliche adaptation with uninspiring artwork and annoying characters. I wouldn't go so far as to say that it's not worth watching if you like the genre - it's alright, and maybe I might have liked it more if I hadn't read the manga beforehand and knew what I was missing out on. That being said, if watching this anime leaves you feeling unfulfilled, I highly recommend that you read the source material.",
            "date": "2019-04-12T19:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 306143,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7427161.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Lupa-",
                "username": "-Lupa-"
            },
            "url": "https://myanimelist.net/reviews.php?id=306143"
        },
        {
            "content": "The reason I enjoyed this anime is because of the main character. After learning that her love interest was using her, she doesn't break down and cry and pity herself, but she takes some action and decides to take revenge on him by going into showbusiness.\r\nStory (7)\r\nThe story might seem a but ridiculous at times ( for example she got into the LME agency way too easily with no talent really). I was also disappointed with the Love Me section as it was forgotten really easily and wasn't really mentioned anymore. It kind of seemed useless at the end, but at the end of theday I was really cheering for the main character to suceed and was looking forward to see how she will deal with various kinds of things.\\n\\n\r\nArt (5)\\n\r\nI didn't really enjoyed art in this series. Sometimes the animation of movement didn;t work at all ( for example when driving, the buldings in the background looked soo cartoony [ on top of that the Porshe was just ugly (And i love cars).\\n\\n\r\nSound (7)\\n\\n\r\nCharacter (9)\\n\r\nI loved the main character. I liked how she wasn;t a typical anime heroine which just cries the whole time after her love interest dumps her. What can I say, she had balls.\\n\r\nI enjoyed side characters too especially Ren.\\n\\n\r\nOverall I really enjoyed this series and recommend anyone to give it a go.",
            "date": "2015-11-02T12:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 202516,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/justa333",
                "username": "justa333"
            },
            "url": "https://myanimelist.net/reviews.php?id=202516"
        },
        {
            "content": "After finishing Kaichou wa Maid-sama and Special A, I was looking for another show that would give me the same flavor.  I saw Skip Beat! in the list of recommendations so I thought to try it.  Then I read the synopsis and kind of put it on the back-burner.  The concept of a girl struggling for revenge and all that drama kind of switched off my interest.  Yes, I passed judgement on this show prematurely.  My mistake, because this show just blew me away.  It was exactly what I was looking for and then some.\r\nThe story was great.The show does have drama, but the comedy does balance it out.  As for the art, it wasn't anything outstanding but I'm not complaining.  I never felt turned off by it and the characters designs were fine by me.  Same thing with the sound.  The music was okay and nothing really grabbed me but it wasn't bad.  But what really makes this show great is the characters.  Hey, it's shoujo, and the characters are predictable.  You have the pretty boys, the plain girl, the rivals and what not.  But the voice acting, especially for the main character, was fantastic.  I was rooting for Kyoko from episode 1.  She is such a likeable character that, in a way, was a breath of fresh air to me.  I had just finished Maburaho and the hero in that show annoyed me to no end.  But Kyoko on other hand, wasn't so static.  She is a good girl but wants revenge.  And that vengeful streak often rears up unexpectedly, that it had me laughing.  There are tense moments in the show that build up and this kept me hooked, so that I watched episode after episode just to find out what happened next.  The ending though, was a bit of a let down.  I wanted more; some kind of closure to this wild ride but it just didn't properly appear to me.  Nevertheless, all that led up to the ending was so enjoyable that I can definitely overlook the ending.\\n\\n\r\nI don't buy a lot of anime.  Why?  Cause I'm a guy and I recently got married.  I always wonder what my wife would think if she found out that I was watching all these girly shows.  But this show is just too good that I'm going to buy it.  Then I'll slip it in the DVD player and win her over to my side.  Or...would it be that I've gone over to her side?  Yup, I'll have to pick up a manly show as well just to even it out.",
            "date": "2014-04-27T22:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 141609,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40142.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Volfenstein",
                "username": "Volfenstein"
            },
            "url": "https://myanimelist.net/reviews.php?id=141609"
        }
    ],
    [
        {
            "content": "Story:\r\nBased around a character that wants to become an idol I really didn't expect much from this series. Starting out with that prejudice I was surprised to see new approaches in this business and was instantly drawn by this anime. Unlike other storys full of clich&eacute;d stuff, our protagonist (Kyoko) isn't driven by the wish of fame, money or power as it is common. No, all she wants is revenge on her former ... well ... \"boyfriend\"... kind of... not. \r\nWith this the anime's story thrives very much from character developement and I mean REAL character developement. Additionally it is well rounded up with alot of good comedic events. \\n\r\nBut in the end it turns into an all to common basic plot: the protagonist has to overcome obstacles with hard work, just with a nice twist. Don't get me wrong, this isn't necessarily a bad thing. It's a solid story, just not an all to originally one. Still the added surprising elements are what makes this very good.\\n\\n\r\n9 points for a story with a relly nice change\\n\\n\\n\r\nCharacter:\\n\r\nWith Kyoko, for once, we have a female lead that is independent and isn't waiting for a prince in shining armor to save her. It's pretty much the opposite, since she is already disappointed of her prince, that took her out into the big town so she could do his chores... actually that's not quite right... she came to hate the prince and wants revenge for using and playing her.\\n\\n\r\nHaving that said, Kyoko is a rather fresh and surprising character. With her hate and her own spirits fighting each other we see a lot of her inner conflict of trying to become loved by the public and at the same time being full of hate for Shotaro. We can expect a lot more character developement.\\n\\n\r\nThe other two male characters influencing Kyoko's new life certainly seem interesting as well. \\n\r\nShotaro is pretty much the guy who thinks too highly of himself and is for now the perfect guy for Kyoko's hate manifestation, but then there are times where it seems like all that Kyoko want is to be acknowledged by him.\\n\r\nRen on the other hand is a perfectionist, who takes his job seriously and expects others to do so as well. Since Kyoko is want to be an idol only out of revenge he certainly has a little problem with her. But judging him now wouldn't be right, since there wasn't much screentime focused on him up till now.\\n\\n\r\n9 points for Characters Development to look forward too\\n\\n\\n\r\nSound:\\n\r\nThe background music/sound often go by unnoticed, which actually might be a good thing. That is not because the music is bad, but rather because this way the watcher can focus a lot more on the story. Which in turn means it's simply not necessary to pep up the story with catchy music, because it can stand on it's own. But you gotta admit the music isn't too impressive either.\\n\\n\r\nI won't rate the opening and ending, since that often depends on personal flavor. (okay... I do prefer the ending song ^_^)\\n\\n\r\n7 points for a well used and solid music\\n\\n\\n\r\nArt:\\n\r\nThe art quality certainly is a very good one. Definetly above todays average. The characters are overall very well drawn, and the backgrounds are always fitting the context perfectly. \\n\r\nSadly animation quality is at very few points not at it's peak, but even then still a good one. Also sometimes the background seems a bit empty, but that's not to big of a deal since it's usually enough to carry the athmosphere.\\n\\n\r\n8 points for nice work from the graphics department\\n\\n\\n\r\nEnjoyment:\\n\r\nThe story just makes me want to cheer Kyoko on. Damn, this girls deserves her revenge. *waves a Kyoko flag with waterfall eyes and starts shouting &quot;KYOKO! KYOKO!&quot;*\\n\r\nIt's not only the really interesting story, but also all the little bits which make laugh that make this anime such a great show.\\n\r\nThis anime goes even with a perfectly balanced pace, blended out of story advancement and humour.\\n\\n\r\n10 points for Kyoko and all the hilarious moments\\n\\n\\n\r\nI for myself find me really enchanted to Kyoko and this anime. So give it a try as well. ;)\\n\\n\r\n9 points overall\\n",
            "date": "2008-11-15T17:36:00+00:00",
            "helpful_count": 217,
            "mal_id": 9514,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81114.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Silberkralle",
                "username": "Silberkralle"
            },
            "url": "https://myanimelist.net/reviews.php?id=9514"
        },
        {
            "content": "Lovers of comedy, dynamic characters, and stories with the realistic backdrop of a dog-eat-dog show biz world, rejoice! There is a perfectly enjoyable and ultimately very satisfying anime in store for you called Skip Beat!. \r\nSkip Beat! follows the endearing young Kyoko Mogami as she travels 200-something miles across Japan to support her childhood friend Sho in his debut as a pop singer. She continues to bail him out until she finds out he's only been using her for her delicious cooking and wife-like, hardworking traits. And he's allowed to because he is THE Fuwa Sho? Kyoko doesn't think so.  \r\nHere's where the animegets a little interesting. \\n\\n\r\nUnlike other female leads who might cry over numerous tubs of ice cream while re-watching their favorite soap operas, Kyoko takes this pain and suffering she's gone through and turns it into something beautiful. She uses her new-found hatred for Sho as an endless supply of fuel for her journey into the mysterious and somewhat scary world of show business. \\n\\n\r\nLike Kyoko, all of the characters in this anime have a reason to do what they are doing. They all have a single purpose they are trying to achieve through professions such as acting, singing or debuting in big-budget films. \\n\\n\r\nBecause not all of the characters were there for the same reason, we as viewers are able to see some great ideology clashes and disputes that break out among this wide variety of characters. \\n\\n\r\nThinking back, the sole reason why this anime was so enjoyable was the cast of wacky, memorable characters who brought a sense of purpose and bursts of life to what could have been a very stereotypical, bland and fabricated holywood-glamorized portrayal of the world of show business. This cast includes the enigmatic Tsuruga Ren, the selfishly obnoxious Fuwa Sho, the tsundere-dere \"Mouko\" and the all-knowingly eccentric LME president. While their characters may seem generic and cardboard-like at first, the story's excellent pacing and wonderful use of character interactions gives depth and meaning to each character.... \\n\\n\r\neven the most unlikable character becomes slightly tolerable as you learn to appreciate his existence in the anime. \\n\\n\r\nThat being said, the characters' designs were not exactly up-to-par or great. I am an artist myself and it's probably the reason why I am so particular about the aspect of art in an anime. The colors were generally very bright and one-sided, while the character designs themselves didn't stand out much. I did like the emphasis on the expressions of the characters that changed when they were acting but other than that, there was nothing much to look for. \\n\\n\r\nIt was truly the characters themselves and the cast of seiyuu who did a fantastic job portraying their animated-counterparts that made me like this anime. \\n\\n\r\nThe same goes for sound. Nothing was very special about the upbeat, very forgettable pop-song opening but the ending did a very nice job of capturing any left over angst and anxiety from being a victim of horrible circumstances. OST's turned out to be fine as well, mostly in the department of dramatizing an event or adding extra suspense. \\n\\n\r\nLastly, I appreciated the anime's ability to create an engaging atmosphere with the audience as it tackled the tricky topic of what really goes on behind the camera. How much are we seeing of these underpaid actors who go through sleepless nights and bottles of gin to try and perfect their role?\\n\\n\r\nNothing, really. \\n\\n\r\nWe only see their perfectly chiseled faces covered in pounds of make-up and we think, \"man that's the life.\"\\n\\n\r\nThis anime reveals all of the ugly that actually goes on behind that makeup and perfectly lit photos while remaining professional, non-cliche and upbeat. There's no unnecessary drama, no stupid tabloid induced scandals, no fake love relationships. It could have easily gone down the reality-tv-show path of \"look, stars are real humans too! they eat lunch just like we do!\", but it didn't, thank goodness. \\n\\n\r\nWe empathize with these characters and their struggles and triumphs because we actually SEE what they're going through. \\n\\n\r\nThe anime is able to give us viewers insights on their world in a very down-to-earth and realistic manner. \\n\\n\r\nAll in all, this anime was fun and very easy to get lost in. I remember seeing it as a middle schooler thinking \"wow this is pretty good\" and now, as a more-grown-up-but-still-kinda-childish viewer, I'm still thinking the same thing. If you're looking for a nice way to spend your Saturday afternoon, go ahead and watch it. I encourage you to. \\n",
            "date": "2013-07-16T22:31:00+00:00",
            "helpful_count": 80,
            "mal_id": 105685,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/277877.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hinahinaxxchoco",
                "username": "hinahinaxxchoco"
            },
            "url": "https://myanimelist.net/reviews.php?id=105685"
        },
        {
            "content": "We know the story of the plucky girl making it big in the glitzy world of showbiz.  It's the story of Bridget Jones, Josie, the Pussycats, and even Hanna Montana.  Skip Beat! puts a welcome spin on it, and it's not just the (fascinating) insight into the Japanese entertainment industry.  The story is consistently compelling throughout, and the surreal imagery is inventive and keeps the tone light and humorous, even as its emotions are scathingly deep.\r\nWhile it's not beneath the show to humiliate the characters or make them look foolish, they are complex and principled, and the show has enough compassion togive them their dignity.  The way it allows even its most prickly characters to learn and change feels natural, authentic and worthwhile.  It's rare to see any show about anything from anywhere as concerned with human dignity as Skip Beat! is.\\n\\n\r\nLet's have a second season, already.",
            "date": "2010-11-02T16:59:00+00:00",
            "helpful_count": 61,
            "mal_id": 31787,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/399890.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zarusoba",
                "username": "zarusoba"
            },
            "url": "https://myanimelist.net/reviews.php?id=31787"
        },
        {
            "content": "Been quite a while since I last found a shoujo title that I genuinely enjoyed. Skip Beat focuses on the challenges faced by our lead Kyoko in trying to become a successful actress as she learns that she wants to get more out of it besides being a tool to get revenge on her jerk of an ex-boyfriend and popular musician, Sho Fuwa. Some have called the series as something of a Cinderella story and the description seems mostly accurate as we learn of Kyoko's tragic and impoverished back story and dealing with the ramifications of being abandoned by those close to her. The emotionalscars do affect her at the start of the series as she lacks the passion for wanting to enjoy acting at first as she only seen the profession as a means of seeking revenge on Sho. But as episodes progress, she does develop a genuine love for acting, sees it as something she feels motivated to excel in beyond her original goal of revenge and a number of episodes revolve around how Kyoko approaches a role she would be performing in.\\n\\n\r\nBeyond Kyoko, some other characters get focused on within the world of stardom as they come to connect with Kyoko and we learn of their own personal challenges they struggled through to get to the point where they were at within their careers. Tsuruga's character is given the more prominent focus in his interactions with Kyoko as he seemingly hates Kyoko's motivations for persuing an acting career at first, before the changes in her motivations lead him to start supporting her and developing feelings for her. The series does drop hints that Tsuruga may have a more tragic past than Kyoko and he may have known her for far longer than she thinks, but the series abruptly ends before more of these aspects to the storyline could be explored. This weakness appears to be due to the title's manga source material still being ongoing as of this review.\\n\\n\r\nAnother issue I did find with the series at points came with its comedy. Scenes with it tend to pop up throughout a good part of the series, serving to either exaggerate on a conflict or emotional state affecting one of the characters or to lighten the mood following a rather serious development in the show's storyline. The title's comedic style was hit-or-miss for me as I had some moments where the humor focused on the former got me laughing, but others left me indifferent and usually had me feeling that they got in the way of the mood of serious scenes for the latter mentioned moments. Fortunately, the comedy does tone itself down as Kyoko's emotional state improves from adjusting positively to her new life as an actress and doesn't intrude too heavily upon later developments with her character and others.\\n\\n\r\nThe visuals to the series are rather standard for a late 2000s anime in terms of detail and design for characters and scenery. Details are clean and bright color is used to go along with the show's upbeat mood, but this and the animation for Skip Beat don't particularly stick out. The same thing applies to the show's soundtrack as it does its part to complement scenes in the series that fit for their intended purpose, but have nothing too memorable with them.\\n\\n\r\nGripes aside, Skip Beat is still one of the better shoujo titles I've seen recently as there hasn't been anything from the demographic that has seriously hooked me beyond a number of titles that came out during the late 1990s and early 2000s. The focus on Kyoko's growth as an actress is a compelling and enjoyable story worth seeing throughout Skip Beat's 25-episode run, alongside other characters in stardom who interact with her. If you're a shoujo anime fan, this is worth a definite look.",
            "date": "2014-11-01T20:11:00+00:00",
            "helpful_count": 30,
            "mal_id": 167085,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=167085"
        },
        {
            "content": "What's fun when I watch a comedy show is the presence of a crazy character. In anime you'll surely find wacky characters such as Hiruma-sama (Eyeshield 21) and Kona-chan, but no one is wierder than Mogami Kyoko from this anime/manga skip beat. She was one of my most loved shoujo characters and as expected, the fun was multiplied when Skip Beat was adopted to an anime series.\r\nThe plot is quite ordinary, \"a tale of revenge\", but what separates it from the classics is the reason why and how it will be done. Kyoko decided to enter showbusiness to ruin the rising superstar Fuwa Shou, herchildhood friend that betrayed her. The fact that she was once called by him as 'plain faced' never affected Kyoko's determination. She willingly accepted few jobs and awkward situations just to gain her goal of being an idol and smash it all on Shou's face.\\n\\n\r\nThe kind of love story featured in the series was some kind of indirect romance which thrills me better than the showy type that was full of confessions and emotions.\\n\\n\r\nSo far, I think Skip Beat was one of the best Romantic Comedy Anime this season.",
            "date": "2008-12-21T23:39:00+00:00",
            "helpful_count": 30,
            "mal_id": 10555,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30049.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/graysky14",
                "username": "graysky14"
            },
            "url": "https://myanimelist.net/reviews.php?id=10555"
        },
        {
            "content": "Love can make people do crazy things, even if it’s skipping high school to follow your boyfriend to Tokyo to begin his career as a rockstar. Admittedly, the popular rom-com Skip Beat may give bad presumptions when it’s revealed that the main character’s (Kyouko) sole motivation for entering showbiz is to seek revenge on her ex-boyfriend (Shou) by outshining him. In actuality, Skip Beat is just as fun to watch as its name portrays it to be. The plot itself is actually what brings out the comedy in the anime because of the characters’ reactions. The anime is not reflected on a girl’s life thatrevolves around her ex, but it focuses on how she discovers herself. Apart from the steady pacing, Skip Beat is also a prime example of how creators advertise a manga by ending the anime with a cliffhanger.\\n\\n\r\nThe pacing is steady and engaging, and there are no fillers. The dramatic and funny moments are perfectly balanced. Nothing is immediate, including Kyouko’s attempt at stardom. A romance story develops in the anime, and the steady pacing is fulfilled by showing no intimacy within the series. The story also reflects on other characters instead of solely Kyouko, so the viewer gets to learn of situations from those characters’ points of view. \\n\\n\r\nThe only problem with Skip Beat is that the story is incomplete. The romance is still in development and has a while until it fully blooms. Kyouko has a past with another main character that was shown in brief clips in later episodes, but it is never fully revealed. Kyouko is clueless about it, while the other character still keeps it a secret. Additionally, a new subplot was introduced near the very end of the series, and a solution is never reached. Although the story itself is incomplete, the creators did a good job on giving a hopeful ending. All of the characters were given a reflection, and it gives the viewer enough for the imagination. Since there has been no talk of a second season for the past four years, the viewer is left with no choice but to read the manga in the meantime. (7)\\n\\n\r\nInstead of a weak-hearted female lead that is usually present in shoujo anime, Kyouko is an aggressive and driven individual. All characters have their own personality, and it’s cool that some actually address the stupidity behind Kyouko’s motivation for showbiz. The main characters and supporting characters all balance out the theme of the anime. There are some characters with huge egos, contributing to the comedy as Kyouko enters the entertainment world by taking one step at a time. The contribution of the other characters also helps Kyouko develop into an independent and strong woman. The “Character” category would have a perfect score of 10, but the interruption of the subplot placed a halt on some of the characters’ development. (8)\\n\\n\r\nThe animation is unique from most other anime. Apart from the plot itself, the animation is to thank for the comedy. Demonic and depressing auras, along with emotions, are drawn hilariously with ghostly figures. Also, the characters’ designs as chibi are both funny and adorable. The colors are exceptionally vivid and bright in the character and background designs, giving off a refreshing and fun atmosphere to the anime. (10)\\n\\n\r\nThe voice actors were superb. Marina Inoue (voice of Kyouko) did an excellent job separating her innocent vs. aggressive voices to fit Kyouko’s split personality. “Dream Star” by generous is upbeat and expresses Kyouko’s confidence within herself. The OP and ED changed at Episode 20 as there is more love affection shown between characters. The background music is played at the right moments and fits the moods of each episode. (10)\\n\\n\r\nSkip Beat was very entertaining. I was desperately looking for a rom-com, and Skip Beat was often recommended. I turned it down several times in the past because of the synopsis. I was disappointed with no immediate romance, but the steady pacing caused the anime to exceed my expectations. The comedy and Kyouko’s determination are what mostly kept me watching. After the first episode, I became anxious to watch the next episodes to watch Kyouko achieve her goal. I disliked how some characters’ pasts were not emphasized and how a new subplot was introduced near the end. Now I’m reading the manga to complete the story. (8)\\n\\n\r\nSkip Beat is unique from other Shoujo anime, and it’s all thanks to a strong female lead. The drama and comedy are balanced, and the plot is irresistible as you’ll become drawn to the story and feel the need to watch it ‘til the end. It is meant to advertise the manga by leaving the viewer with a cliffhanger. As someone who read the manga after completing the series (starting at Chapter 67), I say that jumping on the Skip Beat bandwagon is definitely worth the ride. (8)",
            "date": "2014-01-06T09:48:00+00:00",
            "helpful_count": 27,
            "mal_id": 127523,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=127523"
        },
        {
            "content": "Skip Beat is truly one of my favorites of all time ever since the manga starts its publication, yet the anime capture every detail in the manga. The heroine is not your usual girl who always cries when down and weak all the time, but instead she becomes stronger and stronger. \r\nThe story starts off about a \"Pandora Box\"  that was given to each person, and no one knows what is sealed inside. One Day, when Mogami Kyoko finds out that she was only being used by Fuwa Sho, her \"Pandora Box\" opens and promised revenge against Fuwa Sho. Then the start of hertransformation and debut in the entertainment world begins....",
            "date": "2008-10-06T04:51:00+00:00",
            "helpful_count": 22,
            "mal_id": 8477,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23547.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chizuru86",
                "username": "chizuru86"
            },
            "url": "https://myanimelist.net/reviews.php?id=8477"
        },
        {
            "content": "I was initially reluctant to start this anime, the synopsis sounded like it could go either way in terms of quality.\r\nFortunately i quickly got into this anime from the first few episodes, to the point i quickly found myself losing track of how long i'd been watching for.\r\nIt's fair to say if your not taken in by the first 2 episodes, this probably isn't the show for you.\r\nWithout the doubt the main strength of this show is the protagonist Kyoko, her character and her attitude instantly warms the viewer to her and you can't help but want to see how she advances through the idolindustry and how she develops her relationships with the support characters.\\n\\n\r\nThis anime is largely character driven, the plot itself does little more but present scenerios for Kyoko to meet a wide variety of characters throughout the show. If i were to compare this show to anything, it heavily reminds me of Fruits Basket, both with the main character, and the shifts from comedy to drama to undertones of romance. \\n\\n\r\nI found myself finishing every episode with a smile on my face, it's fair to say i found this show genuinely heart warming, i'm hoping to see a second season, because with only 2 episodes remaining there still seem to be alot of lose ends to be resolved.\\n\\n\\n\\n",
            "date": "2009-03-18T12:35:00+00:00",
            "helpful_count": 15,
            "mal_id": 13291,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=13291"
        },
        {
            "content": "thought the opening sequence and song aren't all that inspiring, this anime (based off one of my favorite shoujo mangas) is a pretty well done and enjoyable adaptation so far.\r\nThe story and plot are strong funny, unique, definitely something worth building on, which the animation and voice actors managed to capture pretty well.\r\nKyoko in all her crazy flaming glory, Yoshiki Nakamura wonderful brand a humor all working towards a shoujo story that  stands out in a genre swimming with weak weeping leading ladies, so if you want a girl series that's a bot different and always willing to make fun of itself, give Skip-Beatthe anime (and the manga if you haven't already, RIGHT NOW) a shot.",
            "date": "2008-10-17T01:09:00+00:00",
            "helpful_count": 14,
            "mal_id": 8743,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sdblaine",
                "username": "sdblaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=8743"
        },
        {
            "content": "If you disregard animation and art, the gender of the main character (usually) and other minor differences; one major difference remains between shoujo/jousei and shounen animes that have romance and drama as the two main themes. This difference protrudes as one thing and that is character interaction, character interaction is a result of script/screenplay and to a certain extent storyboard. Character interaction is one of the key features in anime that needs to be executed well for it to be successful, if an anime has good character interaction then you can almost forgive everything else that's bad about that particular anime. This being said, therehas never been nor will there ever be (probably) a shounen romantic drama/comedy with as good character interaction as a shoujo anime equivalent in themes.\\n\\n\r\nNow why I have decided to start this review by talking about character interaction is because Skip Beat has good character interaction and this saves it from being a bad anime. Now ransack your hearts; this anime had fairly weak storyboard, the events happen rather haphazardly and the character development of some characters are below mediocre. In truth though, it's hard to have good character development for many characters but then you really have to make the characters undergoing bad character development either forgettable or really, really good in entertainment value. Skip Beat did not deliver this hence why some characters feel unfinished or even unnecessary to the story.\\n\\n\r\nAll the same this anime is very good, it was a good concept and I particularly enjoyed the fact that the main protagonist wasn't some meek, weak pushover that so many other female main protagonists have been. There was some spunk in this girl that I appreciated even though she could be a bit too clueless at times regarding some things for my liking.\\n\\n\r\nNow my overall rating of this anime is based on the things I have pointed out in this review, but also on the fact that I am expecting a season two as it was not only hinted at the end of the last episode but also due to the storyboard and the overall worthless conclusion to the anime, you know it, I know it; we have seen that ending before. So many times... so many times. Atleast it wasn't as bad as KareKano though.",
            "date": "2009-03-31T11:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 13648,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=13648"
        },
        {
            "content": "Shoujo Lovers! This is something you can't afford to miss out. As for the rest, you might think twice if you are going to overlook this anime, just because it's, you know what, \"Oh! Another shoujo anime. I will pass.\"\r\nA couple of my female friends (blu-chan, hagumi_honey) have been pestering me to watch this anime. I was quite reluctant as the story seemed too iffy when i read the synopsis. And then, I recommended the anime to my sister, since she is a crazy shoujo anime fan, and decided to overlook the anime myself.\r\nI was just recently having the time of my life, with Hayate,Ippo and Spice and Wolf II all rolling week in week out, until they all ended. I was looking for a replacement but was not sure what to pick. Then I checked my HDD and thought \"okay. there is skip beat! there, I copied from my sister's.\" I thought lets see whats so good about it, as my sis has been ruining my life wanting me to see that.\\n\\n\r\nAnd here I am, fell in love with the anime. It actually amazed me to find out later on that the original manga started way back in 2002, and has been really popular ever since and still ongoing.\\n\\n\r\nAnyways, thats me and Skip Beat! Now for the review:\\n\\n\r\nHere is your synopsis. Kyoko (Marina Inoue), an energetic and devoted girl, gave up school and decided to follow her prince-charming Shoutarou 'Sho' Fuwa (Mamoru Miyano) to Tokyo as Sho has set his dream to become the next big thing of Japan. Yeap. His aim is to become the number one Idol in Japan. But there is this big problem. The current heart-throb of Japanese Entertainment line, Ren Tsuruga (Katsuyuki Konishi). Sho goes out of control whenever there is anything about Ren, and throws his frustration and whatnot to Kyoko. Kyoko, as a result has been hating Ren for ruining her love-life. And she badmouths Ren all the time to show her support for Sho. Kyoko, giving her all to Sho, decided to follow Sho through and through, until she overheard that Sho thinks lowly of her and the only reason he keeps her around is for household chores. Kyoko's world shatters. She throws her hatred to Sho and promises him vengeance, that she will take him on in the very world he wants to rule over, the world of showbiz.    \\n\\n\r\nStory: 10/10. One of the most lovable of shoujo stories out there I can tell you. Its right there in the ranks of the best. The story is simple but powerful, gives you the \"what will happen next\" and full of unpredictable outcomes that will keep you entangled and without knowing, you'll definitely get absorbed in no time.\\n\\n\r\nThroughout the entire anime, you'll find the determination and dedication runs through Kyoko and how she without even knowing herself, affects the people surrounding her, the obstacles she is about to overcome to reach her goal, and add to that, doing things which are irregular, if not insane.\\n\\n\r\nAnd of course, there is love to bloom. Kyoko, dejected through Sho, has closed her emotions of love and decides to never fall for anyone again. Ren, whom she has been badmouthing while with her days with Sho, she finds him also cold and lacking heart. But the reason behind Ren's coldness towards her, is something she doesn't know. But soon, she finds out that Ren is, deep down is not what she usually thought him to be. Will her heart finally skip a beat for the Japan's Number One? Find out yourself!\\n\\n\r\nArt: Okay, I will be honest here. Most of the shoujo anime sucks in drawing when it comes to surroundings. This one isn't an exception either. I hate to tell this, but every time I saw Ren's Porsche 911, I really wanted to redraw that. So yes. 5/10 for artwork of the surroundings.\\n\\n\r\nWhat covers up for the lack of details in the surroundings is of course the character drawings. There are lots of lots of chibi scenes, i would say every the other scene is probably drawn with chibi characters, but that goes so well with the mood and makes the anime even more lovable. But the best part about the drawing will remain the expressions when the mood is serious or needs attention. The eyes, eyebrows, the lips, the facial shadows everything is drawn so lively that you can actually not only feel the emotional state of the character but also the atmosphere around them. 10/10 for character drawings, which in whole gets an 8/10 overall.\\n\\n\r\nSound: The BGM and the OP/ED are really superb. The sounds actually help to change the mood and the sounds change often as the animation hovers between serious expressions and chibi drawings. What makes it even more enjoyable is that the sounds are nicely blended with the screenplay. There was not once I felt that the BGM didn't go with the screenplay. As for the OP/ED, I fell in love with both the ED songs and I am sure anyone will too. The second OP is also very nice. Sound gets a 9/10 from me.\\n\\n\r\nCharacter: This is where the anime is probably reached its best. Kyoko, instead of falling apart, decides to take on Sho from the very instant her world is crushed. Her determination, dedication and ambition mixed with her softness and kindness, make her character one of the best female characters I have come across so far. Her self-declaration of not falling for anyone ever again, shows only her emotional state and although she believes her emotion of love is long dead, she does things for others which shows, deep inside, her heart is still capable skipping a beat or two. This is probably Marina's best performance as a seiyuu after Kasahara (Toshokan Sensou). \\n\\n\r\nSho, performed by Mamoru Miyano, is already a legend in seiyuu world (Light Yagami (Death Note), Setsuna F. Seiei (Gundam 00), Tamaki Suou (Ouran Host Club), Death The Kid (Soul Eater) and many more). There's nothing much to say about his performance as his character amazingly swindles when he is in the public and when is in private. His shift of voice has always been a class above regular seiyuu and thus making him arguably the best in recent times. Sho is just another addition to his illustrious seiyuu career. He performed so well, you will definitely hate Sho.\\n\\n\r\nRen Tsuruga, performed by Katsuyuki Konishi, (other major performances: Kamina (TTGL), Komui Lee (D.Gray-man), Haji (Blood+), Tooya (Ayashi no Ceres) Ozma Lee (Macross Frontier) etc.) has been amazing. Ren doesn't show his true emotion in front of everyone. His true personality remains a mystery to Kyoko as she can't compare the Ren who can be both cold and warm from time to time. Konishi performed the character as it should be, Ren, the number one Idol in Japan, who is professional to the last and always puts his works as priority one, shows the reason why he is the most successful man in the world of entertainment. As the anime progresses, Kyoko starts to understand Ren bit by bit, and without knowing herself, starts to admire him as her senpai.\\n\\n\r\nAnd the anime character list is rounded up with other interesting characters Kyoko is set to meet as she is about the find out that 'revenge over Sho' is not the reason anymore as she takes every step to become an actress.  10/10 for characters.\\n\\n\r\nEnjoyment: You bet I want moar! This anime is absolutely a masterpiece of entertainment. Seriously, I can't but have to say I will love to see they are making a 3 or 4 seasons of it. For now, I will be hoping that the anime gets a well deserved Season 2. And I will be getting the first release out online, because not having Skip Beat! in my watch list is almost hurting. 10/10 for enjoyment.\\n\\n\r\nOverall: I will rate it 9/10, as a whole. This anime has given me so much entertainment that I can rewatch this anime over and over again and will never, ever get tired of it, that I can assure.\\n\\n\r\nI am not sure whether my review will be enough to encourage more people into this anime, but I can guarantee one thing, you wont be able to drop this anime once you've started it ;)   \\n\\n",
            "date": "2009-11-07T01:24:00+00:00",
            "helpful_count": 12,
            "mal_id": 20322,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23258.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shanimebib",
                "username": "shanimebib"
            },
            "url": "https://myanimelist.net/reviews.php?id=20322"
        },
        {
            "content": "This review comes from my own opinion. ^ ^\r\nOk, so I've recently finish watching this anime. I've came across it quite a few times, but didn't really bother watching it because the description of this anime just didn't sound all that interesting. I watching it, and now I am regretting not watching it sooner. :)  \r\nStory: Well i gave it a 10 out of 10.\r\nThe story truly is one of a kind, it quite surprised me. Well the basic story is about a girl named Kyoko who WAS always stepped on by the one guy she would give anything to( an up-coming star atthat). Through certain chains of events (Yes i will not give spoilers cos i REALLY hate them) she realized she that she needs a change of personality, she will NOT be a pushover any longer. At this point in time she is determined to get her revenge. As she thought she realized....whats worse than to out-shine a star? And that's what this girl is striving for in this anime revenge.\\n\\n\r\nArt: Um, well, I am no expert, so therefore i am not really particular about the art it self. I (as an amature) think the anime art work is done well, plus the quality is pretty good therefore i gave a 10 out of 10. \\n\\n\r\nSound:  Opening - Well the opening song was OK. Well, then again, I am PRETTY choosy when it comes to openings. Um, well PERSONALLY didn't like the intro music much(don't kill me for it), but it was still good cos the song lyrical wise did indeed match with the song :) .  Well like one thing i should include is that i think that everyone likes diffrent types of songs right? so i think everyone has their own opinion about it hehe~\\n\\n\r\nApart from the opening throughout the anime it seems as they put good background music. They really do try to fit the mood, and it really does show.  Therefore i gave it a 8 out of 10 ^ ^\\n\\n\r\nCharacter: Well the characters are all very unique to one another. Well, the female lead (Huraayy) Kyoko is the beginning is very attached and thinks she cant picture her life without her beloved Shotaro. Shes been living with his family since she was young and became very attached to him, after all she DOES love him. Since he wanted to pursue his his dream career as a star and decides to take Kyoko along with him (but not for the reasons Kyoko THINKS). Anyway that's her in the beginning of the story, but she drastically begins to change for the better. She soon starts to relize she must do things for herself too, because she gave and gave to others (meaning Shotaro) but she never took the time to give to herself. Along her journey to a better self, she makes others relize them selfs aswell. Another main character in this story is Ren, a cold hearted star who never expereanced happiness till Kyoko can along. Many characters in this anime change for the better.\\n\\n\r\nOver all, i think all the characters were well thought out (Kyoko-giving caring passionate ect... Shotaro- Full of himself, cruel, antagonist,  Ken- cold, distant, means well.) Well i think that the writer put a lot of thought into designing the characters. I was very impressed on how well the clashed with one another. 10/10 :)\\n\\n\r\nEnjoyment: Well i got to say straight of the bat 10/10. Some parts were so filled with humor i just could not stop laughing. The thing is, its not just that that was enjoyable, the serious moments aswell, your just so into it that your expressionless. So a very good amusement in all aspects ^ ^\\n\\n\\n\r\ni got to say, 9/10 over all.\\n\r\ni recommend this to anyone that's interested in good animes ;)\\n\\n\r\nheheee hope this helped some of you~",
            "date": "2009-05-06T16:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 14830,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/177372.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BleachedSoul",
                "username": "BleachedSoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=14830"
        },
        {
            "content": "Wahahaha!!! Don't waste your time contemplating whether you're gonna watch this or not. I'm telling you, go directly to your favorite streaming site or prepare your torrent downloader for this. This ANIME will shake your life.\r\nwell, not really, ahem, kinda just carried away...\r\nI just made a recommendation of Skip Beat, it's with Ouran Host Club. My Ouran is my 2nd favorite anime,because i believe it greatly represents the SHOUJO GENRE. to tell the truth, i enjoy better shounen anime than shoujos, but OURAN changed my mind..as well with SKIP BEAT. Wahahahah!\r\nWho wouldn't love Kyoko, the main lead. I'll admit it. I can see some partof me into her character. I still wish to be a princess, there's still the little child inside in me who still believes in fairy tales. Even though Kyoko is not speaking of it, her feminine side is so realistic and is so relevant to the youth today. \\n\\n\r\nA good lead is one my criteria in choosing anime. Just like Haruhi, I really really like free-spirited, intelligent, smart and strong-willed heroine. AND KYOKO FULLY EMBODIES IT. She's way better than my Haruhi-chan. OH mY GOSH!\\n\\n\r\nThe REVENGE part is the best thing, because this help us to see the real Kyoko. I like her. She's not a show off. Yes, she might be a cry baby but is never an annoying one. She has a good disposition in life. She is not lady-like, which is the BEST about her personality. She is not boxed. WUSHU!\\n\\n\r\nAnd Ren, wufufufu! To think that Jerry Yan is gonna portray his character in the live action adaptation is such a...a....a.....a..........FEAST TO CELEBRATE...wUSHU~ I'm thinking of RAIN. well, whatever. Ren Tsuruga is not your ordinary good boy bishounen. Good ThinG! I hate Gentle Lead Male who is SO GOOD TO BE TRUE! He has also his own evil ways, well, towards Kyoko. Which makes the 2 a more romantic couple...\\n\\n\r\nThere goes SHO,,I also like his character even though he's supposed to be the antagonist. not only because my favorite dubber voiced him (MAMORU MIYANO) but he's also NOT AN ARCHETYPE. He's the coolest villain evAH!\\n\\n\r\nWell, if you like interesting characters like me, and just wanna have plenty of good and goofy times, try this right now. This will even surpass the Twilight Craze...BWAHAHAHAH!! Let's SKIP THE BEAT!\\n\\n\\n\r\nP.S.\\n\r\nI also like Moko-san, Kyoko's partner...\\n\r\nI hate Ariel Lin,,I don't want her to do Kyoko's role...can they change the casting please...\\n\r\nLooking for more happy episodes...\\n\\n\\n\r\nLove lots,\\n\r\na newbie from Love Me Section \\n",
            "date": "2009-02-07T07:35:00+00:00",
            "helpful_count": 11,
            "mal_id": 12200,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119010.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/docalion",
                "username": "docalion"
            },
            "url": "https://myanimelist.net/reviews.php?id=12200"
        },
        {
            "content": "This is a fun show.\r\nThe main character, Mogami Kyouko, is one of the best shoujo heroines to pop up in a long time. I adored her dual personality--she swings between being an innocent, sweet, caring girl to a vindictive, bitter one at the drop of a hat! Her facial expressions are a riot, too, especially her chibi ones.\r\nUnlike so many heroines of this genre, Kyouko's motivation for seeking greatness in showbiz is revenge, not love. Of course, revenge is never a good motivation, and a fair portion of Kyouko's character development involves her learning to love and trust people again, or at least to learnto enjoy acting for its own sake.\\n\\n\r\nThe rest of the main characters are equally enjoyable. Japanese voice actor Miyano Mamoru (Light from Death Note, Tamaki from Ouran HSHC) is absolutely perfect as as Shoutaro--the character's arrogance, massive ego, and adolescent attitudes are fully on display whenever he speaks. Kyouko's eventual love interest, Tsuruga Ren, voiced by the always-fantastic Konishi Katsuyuki (Kamina from Gurren Lagann, Soubi from Loveless, Hisagi from Bleach), is frankly one of the hottest bishounen to appear on screen in recent memory. He's a fully developed character too, with his own flaws and foibles. Interestingly enough, the viewer sees a good quantity of the action from his point of view, which makes him a refreshing change from the mysterious, aloof bishie that one often sees in shoujo anime. Kyouko's friend, \"Mouko\" and Ren's manager, Yashiro, are fine additions to the anime's cast as well.\\n\\n\r\nThat is not to say this anime is without flaws. The animation is rather poor, and the frame rate is embarrassingly low. Of course, there really isn't enough action in this show to really merit a high animation budget, but at least they could have used fewer still-frame shots and included a little more detail in the sparse character designs. It also seems like that the animators, every time they could, replaced the backgrounds with pink shoujo sparkles and reduced the characters to chibi forms just to save drawing effort.\\n\\n\r\nThe anime suffers from major pacing problems as well. The show progresses at a crawl, lingering much too long on unimportant events (like the mini-arc involving the little bratty girl) instead of progressing the plot or Kyouko's relationship with Ren. The ending (don't worry, no spoilers here) leaves something to be desired, too, as it cuts out in the middle of one of the manga arcs. It makes me wish they'd hurried up more in the beginning so they could have at least finished the storyline (perhaps they were hoping for a second season...?).\\n\\n\r\nAnyway, overall this anime is worth watching. The characters, plot, and over-the-top humor simply make up for whatever compositional flaws there are.\\n\\n\r\nAnd for those of you who've finished the anime and are looking for more, definitely pick up the manga. It eats the anime for lunch.",
            "date": "2010-05-30T19:24:00+00:00",
            "helpful_count": 10,
            "mal_id": 26605,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304468.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/7PhoenixAshes",
                "username": "7PhoenixAshes"
            },
            "url": "https://myanimelist.net/reviews.php?id=26605"
        },
        {
            "content": "Skip Beat is definitely one of my favorite anime shows. I honestly don't normally like most shoujo anime, but Skip Beat is different. This show is on my top 5 because it has a fantastic storyline, fantastic characters, and nonstop excitement. On top of that, it has romance as well...with a twist. Kyoko practically loses her ability to love after being betrayed by the only guy she ever loved. She had basically devoted her life to him so, on that fateful day when she is betrayed, it sets her loose. Kyoko stops being a sweet, innocent girl and goes into show business as Fuwa Shotaro(the guy she liked) already is a popular singer. She stops at nothing to try to outshine Sho. He was cruel and now, he needs to pay in her eyes.  What will it take? Will Kyoko be able to rise to the top? Can she really win when she only desires revenge? Watch the anime, read the manga, Skip Beat is fantastic!\\n\\n\\n\r\nThe story~\\n\r\nThe story is excellent and very unique.  Kyoko basically becomes a popular actress because she wants to get revenge on Sho.  It starts off like this, but then she changes.  Acting becomes her passion, and it's not all about revenge anymore (although she still hates Sho haha).  She builds a new life for herself in a way, with new relationships and more.\\n\r\nArt~\\n\r\nFor art, I must say this is the lowest point of the anime/manga.  The men all have weird, pointy chins although the girls look decent.  Honestly though, besides the chins, everything is pretty ok xP.\\n\r\nSound~\\n\r\n8\\n\r\nThere is lovely music and it always fits the different scenes.  Don't have much to say, but the op/ed was better than average.\\n\r\nCharacters~\\n\r\nWow, the characters are something else.  Kyoko, Sho, Ren and everyone else become so developed throughout the show.  Hopefully, the anime will continue because they grow even more in the manga.  The characters are original and thoroughly enjoyable.  Even the villains end up fascinating you and aren't extremely cliche and boring.\\n\r\nEnjoyment~\\n\r\nOverall, I absolutely ADORE this anime.  I recommend this show to anybody who is looking something different from the typical, boring shoujo.  Skip Beat is on my top 5 for a reason! ;O",
            "date": "2009-05-06T16:49:00+00:00",
            "helpful_count": 9,
            "mal_id": 14831,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155981.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Redvines32",
                "username": "Redvines32"
            },
            "url": "https://myanimelist.net/reviews.php?id=14831"
        },
        {
            "content": "The anime is amazing. The characters are learning some lesson throughout the story like learning to love or to move on if something doesn't go your way. The advice they put through the story somehow fits with reality. I don't really find the ending of the show that great but the rest of the story is extremely amazing and fits with the plot. I can't say i loved it but i did enjoy it and liked it, and i recommend you watch it.",
            "date": "2015-06-14T12:07:00+00:00",
            "helpful_count": 9,
            "mal_id": 190317,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4674226.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sarahgem",
                "username": "sarahgem"
            },
            "url": "https://myanimelist.net/reviews.php?id=190317"
        },
        {
            "content": "Ah...Skip Beat...what can I say about you, except that you're probably THE most enjoyable anime I've ever watched. If you've ever jumped into an anime, not expecting much of anything from it, so ready to drop it (I was NOT a big fan of the art at first) and yet after watching a few minutes of the first episode you knew you couldn't for any reason pull away? Well that's how I felt watching Skip Beat! I saw this a while back, but I've currently started reading the manga, so I thought I'd give it a review.\r\nStory:\r\nThe story is one of revenge. Kyouko is devotedto her childhood friend Shou and thus tries to help him out on his quest to become famous. But Shou is a jerk of epic proportions and he mistreats Kyouko to the point she can't take it anymore. She decides she'll get revenge on him for all he's done and how he's made her 'lose her youth.' She decides entering show biz and becoming an even bigger star than him is the way to go. Along the way she learns a couple of important lessons, growing and changing as she tries to make it to the top. It's really not the most outlandish story line out there but I don't think it's the most common either. Even if the story line wasn't solid, it's the trials and tribulations of Kyouko and her UBER awesome personality that makes this anime solid.\\n\\n\r\nArt:\\n\r\nI was a bit turned off by the art to the point I almost didn't watch it, but I decided to at least give the first episode a look-see and I was hooked. I've learned to feel comfortable with the art and I've come to feel it fits the characters just right.\\n\\n\r\nSound:\\n\r\nI don't pay much attention, so either way, good or bad, I wouldn't know XD\\n\\n\r\nCharacter:\\n\r\nKyouko is the solid lead of this anime and by all means it stands on her shoulders alone. She's not your typical weak, crybaby, shojo anime heroine. She's strong, independent, hard-working and strong-willed. Plus, she has a wicked vengeful, 'I'll kick your ---- any day!' kind of attitude. But at the same time she's pure-hearted and deep down she's really just someone who wants to be loved and accepted, whether she understands that herself or not. Plus, she's hilarious. The first episode alone has her whipping out like 100000 facial expressions that are just drop dead funny. That's another thing that makes her great, she's sooooo expressive. You're never at odds about what she's thinking. YOU JUST KNOW. The other characters are great as well, each having a personality that, although seems very shallow, is in fact quite multi-faceted. But one thing is always evident, it seems Kyouko is always the one bringing out the best in everyone. \\n\\n\r\nEnjoyment:\\n\r\nI don't usually laugh out loud at anime... to be perfectly honest, even if it's actually funny, I'll laugh on the inside. BUT I couldn't do that with Skip Beat. It was non-stop LOL-ness, to the point people were staring and thinking I was weird. I can truly say, if you're into this sort of anime, you'll be laughing your tail off too. It's just a fun anime. And you can't help but relate to Kyouko and feel everything she's feeling. \\n\\n\r\nOverall:\\n\r\nI'd say, for shojo anime lovers out there, this is the best I've seen. And I'm sure you'll enjoy it, even if not as much as I did.",
            "date": "2010-08-28T19:39:00+00:00",
            "helpful_count": 8,
            "mal_id": 30059,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/225791.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Naiika",
                "username": "Naiika"
            },
            "url": "https://myanimelist.net/reviews.php?id=30059"
        },
        {
            "content": "I fell in love with the manga and ended up watching the anime afterwards because I just couldn't get enough of it. That being said, I was highly disappointed with the anime adaptation, and felt like the overall vibe was very different than the original manga (and no, I am not someone who automatically feels that the manga version of any story is superior).  It's difficult for me to pinpoint exactly why I loved the manga and hated the adaptation, but I'll try. \r\nPlotwise, the anime more or less follows the story. Parts were shortened and some scenes eliminated, but nothing that really stoodout at me. However, the anime ENDS right about when the manga starts to get good and the characters start to develop. Skip Beat is a long a** manga (too long some might say - I love it but the mangaka does drag it on for quite a while), and the anime just barely scratches the surface, and leaves more loose ends that it resolves (honestly, if I only saw the anime without reading the manga at first, I would be confused and frustrated since there are so many things that are never explained or reseolved). One of my favorite aspects of the manga was how Kyoko and Ren's career in acting was incorporated in the story (especially seeing how Kyoko grew as an actor and changed for each role that she played), but that was not explored nearly as much in the anime. \\n\\n\r\nThe anime also emphasized some of my least favorite aspects of the original story, in a way that made the story seem much more cliche and Kyoko much more annoying. Kyoko comes across as much more over-the-top in the anime, and bent on revenge with not as many characteristics to make her rounded out (a LOT of her character development is also left out since the anime ends so prematurely). The pacing of the how Kyoko's relationship with Ren develops was also a lot faster, which makes it somewhat boring to me since you don't see as much of a transition from hate to apathy to friends to romantic interest. \\n\\n\r\nThe art was terrible. Very plain scenes that lacked in detail, angular and unattractive character designs, way too much chibi...maybe some of the worst art that i've come across in quite a while. \\n\\n\r\nOverall. I would say that this was a very dull and cliche adaptation with uninspiring artwork and annoying characters. I wouldn't go so far as to say that it's not worth watching if you like the genre - it's alright, and maybe I might have liked it more if I hadn't read the manga beforehand and knew what I was missing out on. That being said, if watching this anime leaves you feeling unfulfilled, I highly recommend that you read the source material.",
            "date": "2019-04-12T19:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 306143,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7427161.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Lupa-",
                "username": "-Lupa-"
            },
            "url": "https://myanimelist.net/reviews.php?id=306143"
        },
        {
            "content": "The reason I enjoyed this anime is because of the main character. After learning that her love interest was using her, she doesn't break down and cry and pity herself, but she takes some action and decides to take revenge on him by going into showbusiness.\r\nStory (7)\r\nThe story might seem a but ridiculous at times ( for example she got into the LME agency way too easily with no talent really). I was also disappointed with the Love Me section as it was forgotten really easily and wasn't really mentioned anymore. It kind of seemed useless at the end, but at the end of theday I was really cheering for the main character to suceed and was looking forward to see how she will deal with various kinds of things.\\n\\n\r\nArt (5)\\n\r\nI didn't really enjoyed art in this series. Sometimes the animation of movement didn;t work at all ( for example when driving, the buldings in the background looked soo cartoony [ on top of that the Porshe was just ugly (And i love cars).\\n\\n\r\nSound (7)\\n\\n\r\nCharacter (9)\\n\r\nI loved the main character. I liked how she wasn;t a typical anime heroine which just cries the whole time after her love interest dumps her. What can I say, she had balls.\\n\r\nI enjoyed side characters too especially Ren.\\n\\n\r\nOverall I really enjoyed this series and recommend anyone to give it a go.",
            "date": "2015-11-02T12:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 202516,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/justa333",
                "username": "justa333"
            },
            "url": "https://myanimelist.net/reviews.php?id=202516"
        },
        {
            "content": "After finishing Kaichou wa Maid-sama and Special A, I was looking for another show that would give me the same flavor.  I saw Skip Beat! in the list of recommendations so I thought to try it.  Then I read the synopsis and kind of put it on the back-burner.  The concept of a girl struggling for revenge and all that drama kind of switched off my interest.  Yes, I passed judgement on this show prematurely.  My mistake, because this show just blew me away.  It was exactly what I was looking for and then some.\r\nThe story was great.The show does have drama, but the comedy does balance it out.  As for the art, it wasn't anything outstanding but I'm not complaining.  I never felt turned off by it and the characters designs were fine by me.  Same thing with the sound.  The music was okay and nothing really grabbed me but it wasn't bad.  But what really makes this show great is the characters.  Hey, it's shoujo, and the characters are predictable.  You have the pretty boys, the plain girl, the rivals and what not.  But the voice acting, especially for the main character, was fantastic.  I was rooting for Kyoko from episode 1.  She is such a likeable character that, in a way, was a breath of fresh air to me.  I had just finished Maburaho and the hero in that show annoyed me to no end.  But Kyoko on other hand, wasn't so static.  She is a good girl but wants revenge.  And that vengeful streak often rears up unexpectedly, that it had me laughing.  There are tense moments in the show that build up and this kept me hooked, so that I watched episode after episode just to find out what happened next.  The ending though, was a bit of a let down.  I wanted more; some kind of closure to this wild ride but it just didn't properly appear to me.  Nevertheless, all that led up to the ending was so enjoyable that I can definitely overlook the ending.\\n\\n\r\nI don't buy a lot of anime.  Why?  Cause I'm a guy and I recently got married.  I always wonder what my wife would think if she found out that I was watching all these girly shows.  But this show is just too good that I'm going to buy it.  Then I'll slip it in the DVD player and win her over to my side.  Or...would it be that I've gone over to her side?  Yup, I'll have to pick up a manly show as well just to even it out.",
            "date": "2014-04-27T22:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 141609,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40142.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Volfenstein",
                "username": "Volfenstein"
            },
            "url": "https://myanimelist.net/reviews.php?id=141609"
        }
    ],
    [
        {
            "content": "This shoujo coming-of-age is nothing you haven't seen before unless you started anime within the last month, but that doesn't necessarily mean it's not worth watching. Equal parts drama, romance and comedy as set in the world of showbiz, a typical charming lead that tries to make self-insertion easy scrapes up the ladder with a variety of virtues that play much better on screen than they ever would in real life, with important people regularly going out of their way for someone they barely know as she rises to the top. But that's par for the course and rarely detracts from the presentation.\r\nTwo points needto be made. Don't watch this if you're looking for music, there is none. I'd like a single in here somewhere, better yet two - dueling tracks from the male leads would be excellent. Kyoko isn't a singer, but an entertainment anime deserves some memorable music and the OP/ED don't provide.\\n\\n\r\nTwo, the acting scenes don't sell. Kyoko spontaneously and repeatedly transforms, almost magical-girl-style, into a premiere actress without any real training and at the drop of a hat. Fine, prodigies exist - but then the way she's written when she's supposed to be amazing doesn't resonate. \\n\\n\r\nThe ending leaves a lot of space for a second season, an OVA, something, and I personally found it disappointing, but I can understand this decision and won't criticize, even if I would be surprised by a continuation. Outside from this, it's an entertaining ride that's worth a watch on a rainy Sunday or more generally if there's not a ton on your plate. If you like Twilight this is right up your alley, without the fanfiction aftertaste. 7 of 10.",
            "date": "2010-09-07T19:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 30334,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/59663.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Solanio",
                "username": "Solanio"
            },
            "url": "https://myanimelist.net/reviews.php?id=30334"
        },
        {
            "content": "Amazing, amazing, AMAZING! Skip was just amazing. I loved this anime because of all the drama...the feeling...the EMOTION...the acting! It was all so wonderful! \r\nThe only thing I disliked was the ending. It was so....it was SO a cliffhanger! I was so angry but I've seen this whole anime twice because it's so amazing.",
            "date": "2011-04-30T22:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 36627,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/472113.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Priester",
                "username": "Priester"
            },
            "url": "https://myanimelist.net/reviews.php?id=36627"
        },
        {
            "content": "I am a little biased because this is my favourite shoujo anime of all time!!! \r\nThe reason why this anime is so good is just because most female shoujo characters are very weak, shy and boring and only used as a tool to highlight how hot or amazing the guys are. But Skip Beat! is on another level in terms of the main characters.\r\nKyouko is just the funniest, strongest, and most surprising heroine I have ever seen, her character development will shock you and you will not believe how amazing she is in every way. She actually makes the guys seem less cool compared toher. It is refreshing to see a shoujo anime that emphasizes girl power. \\n\r\nThe two main leads are also exceptionally interesting from other animes, and they all have extremely funny and heartwarming moments throughout. The characters are developed well in the 25 episodes.\\n\r\nIf you are expecting a lot of intimate scenes, you will be disappointed as the intimacy between the characters moves incredibly slowly (even in the manga).\\n\r\nThe only let-down would have to be the ending as it kind of ends on a cliff hanger. But that's probably because the manga is still ongoing. \\n\\n\r\nPlease give it a shot and I am sure you will be surprised :)",
            "date": "2015-04-08T22:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 185184,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4548661.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MagicPotato98",
                "username": "MagicPotato98"
            },
            "url": "https://myanimelist.net/reviews.php?id=185184"
        },
        {
            "content": "Short Review here - \r\nRecommended: For more Shojo lovers but yes!\r\nSpoiler Free?: Kind of? Some spoilers.\r\nRead Manga: Yes, unanswered ending.\r\nPros: THIS CHARACTER DEVELOPMENT! MHMMM! Also super funny!\r\nCons: Unanswered ending and not a complete romance\r\nBest Character: Yukihito Yashiro because...he ships...\r\nSwears in review: Yeaha\r\n♥\r\nIn depth review is here:\r\nFirst ep, I thought the anime was going to be trash! A classic female lead HUNG over on her male best friend. Then we learn that her best friend is has been using her as a stepping stone. Boom! That's when her character changed! She became a badass without weapons!\r\nThough even though she is a new person she still gainedflaws for becoming that new person. And that flaw is lacking love, a common human emotion. \\n\\n\r\nI say ep 10 and up were the best and we actually got to see her get all of these opportunities. The romance starts around ep-15 which was kind of slow but whatever. \\n\\n\r\nNow one of the things that shined so brightly in this show was this character development. And they had the best type of character development! The character development was the kind we see in a lot of animes, characters wanting to better themselves or see how other work and gain inspiration to be like them. It's honestly super sweet.\\n\\n\r\nThis anime got me laughing out loud and honestly one of the sho-jo gems. \\n\r\nThe romance is a SLOW-BURNER but it's worth it. Also we see a lot of bitchy characters but honestly...they weren't all that bad.\\n\\n\r\nI love how they portrayed the acting as well. \\n\\n\r\nNow one of the BIG problem I have with this show is... how do I put this.. THAT ENDING CLIFFHANGER! I get it is to push pepole to read the manga but... come on!\\n\\n\r\nThis is definitely an anime you should watch :).",
            "date": "2017-11-01T16:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 262294,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6516145.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 4,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AmazingElephant",
                "username": "AmazingElephant"
            },
            "url": "https://myanimelist.net/reviews.php?id=262294"
        },
        {
            "content": "skip beat has the most wonderful story...it includes a one girl that wants revenge on his past friend that has been a traitor of his life because of that boy named: (Fuwa Sho), because of that guy she lost an important part of the human life and it's love. Then she got unto showbiz to show his revenge on Fuwa Sho. But there's a man who's been knowing also a part of her life and its Tsuraga Ren. And that where she continue her journey on becoming a star by joining the LOVE ME department, to get back her feeling on love...",
            "date": "2009-04-01T07:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 13722,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/130141.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xXKatRyzXx",
                "username": "xXKatRyzXx"
            },
            "url": "https://myanimelist.net/reviews.php?id=13722"
        },
        {
            "content": "A story of vengeance embarks a girl's journey towards a life of fame. There is a slow pace of minimal character development but it's better than not having anything at all and there are some twists in the story that will make you feel good about watching it.\r\nA highly recommended anime for people who loves to laugh while enjoying a romance anime with twists.",
            "date": "2010-05-08T06:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 25859,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/134055.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Itadakiimasu",
                "username": "Itadakiimasu"
            },
            "url": "https://myanimelist.net/reviews.php?id=25859"
        },
        {
            "content": "Skip beat is about a girl named Kyoko who has spent her whole life adoring and dedicating herself to a shallow bastard named Sho Fuwa and helping him pursue his dreams of becoming an idol.  \nOne day Kyoko overhears Sho saying he think of her as nothing but his “maid” and that she is a “plain and boring girl.” So what does she do? Cry? Get depressed? Crawl into a sad little ball and give up on life itself? \nHELL NO! Kyoko swears revenge on Sho and does this by getting into the showbiz industry herself! \nI FREAKING LOVE Kyoko's PERSONALITY! I may evenhave a girl crush on her, she's just that awesome! It's so refreshing to finally see a strong female main character. She's bold, full of spunk, hilarious and at times even a bit scary. \\n\\n\nI really admire her for how she didn't let Sho steal her self-esteem and instead used her noble excuse for revenge to join his rivaling agency LME to get into the acting industry (and by god is she talented!) You just can’t help and cheer on this underdog as she faces the challenges to become an actor with the help of fellow actor Ren.\\n\\n\nHowever like many anime, Skip Beat felt unfinished. There is a dying need of a second series! Lots of thing felt unresolved and I wanted to see more relationship development.\\n\\n\nOverall, I recommend this series as it is very enjoyable to watch with a great heroine but I was a little disappointed by the end which left me hanging.",
            "date": "2013-05-15T10:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 97267,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2179689.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bizzibee100",
                "username": "bizzibee100"
            },
            "url": "https://myanimelist.net/reviews.php?id=97267"
        },
        {
            "content": "Skip beat! ...... What can i say ..... in my top 10 anime.\r\nI found a really refreshing anime with a good story and somehow original, but also i wonder why a common story hooked me instantly and now i know it's the character development and also the personalities they have that complements the story so well, that's why i finished loving kyoko's temper and the different \"modes\" she can get into but that helps somehow in her personal and professional growth.\r\nI wasn't going to watch it at all because synopsis was a bit lame when i read it, but i was killing some time andstarted watching it, and since the 2nd episode i was caught in the story and as it advances u really don't want this anime to finish and the time flies away episode by episode.\\n\\n\r\nThis anime made me start reading the manga, since the anime ending was a bit open i did want to see how the story continued so now i'm hooked up with the manga.\\n\\n\r\nI loved the first ED and the second OP they are great!! \\n",
            "date": "2010-07-22T16:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 28764,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FoX_983876",
                "username": "FoX_983876"
            },
            "url": "https://myanimelist.net/reviews.php?id=28764"
        },
        {
            "content": "I don't like long-winded reviews that are impossible to read because they go on forever, so I'm going to try and make this short and sweet.\r\nAt first, Skip Beat seems like an anime with a stupid storyline and shallow, single faced characters. But that impression is quickly proven wrong. It's witty, it's fun, and it's totally engaging. I watched this anime in two days. It was that good. Basically, the main character, Kyoko, gets dumped by her best friend who's a celebrity. Kyoko vows to get revenge by becoming even more famous than her friend. I love this anime because the humor was so great.It made me laugh out loud countless times. The characters are easy to love, and easy to hate. You'll find yourself getting mad with Kyoko, embarrassed with Kyoko, and routing for her every step of the way!\\n\\n\r\nAnd guess what? There's romance, too! (but I wasn't the one who told you). Skip Beat! is a great anime, and everybody should get to enjoy it!",
            "date": "2009-11-29T14:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 20941,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/226962.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BrookeAnn",
                "username": "BrookeAnn"
            },
            "url": "https://myanimelist.net/reviews.php?id=20941"
        },
        {
            "content": "I really liked this animé and enjoyed every episode.\r\nThe little splashes of romance made it even more interesting!\r\nSome particular scene's are so intense when its just about the main character getting ready to act a part.Also the reason why she changed and wants to get revenge is really fun cause I think allot of people went through thesame thing: getting used by boys they really like(or girls)\r\nI think all of us sometimes fantasize about getting even (or just revenge) with people that used us.\r\nSo to see an anime where the main character accomplishes just that is really amusing.\r\nThe ending however SUCKS BALLZ! \r\nI was reallyexpecting something else.\\n\r\nIt ended so sudden that when the last episode is done,you just stare at your screen with a huge question mark above your head haha\\n",
            "date": "2011-03-15T10:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 35081,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/461504.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gee_",
                "username": "Gee_"
            },
            "url": "https://myanimelist.net/reviews.php?id=35081"
        },
        {
            "content": "Undeniably shoujo, with a good balance of drama and slapstick. Well I must admit there is a LOT of slapstick going on. However, how the plot was shown had an amazingly constant and timely pace to it. In addition to that, the concept is not overly interesting as it is (when you read the synopsis), but how it is portrayed made it so. I will probably watch the next installment of this series and probably read the manga if I have time. This one was worth the time.",
            "date": "2009-06-17T15:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 15840,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nastyrush14",
                "username": "nastyrush14"
            },
            "url": "https://myanimelist.net/reviews.php?id=15840"
        },
        {
            "content": "For starters: Skip Beat is really good and should be enjoyed by all! I really don't have to explain the plot, mainly because I couldn't get any deeper, the plot is how the summary explains. Anyways, the characters in here (Mainly Kyoko) have impeccable design and are always a riot to watch. Their interior monologues are hilarious and the animation adds extra humor onto the plot. However the romance in here is very questionable, but I can not say much on account that the series is only on season one. BUT I can say that the romance displayed is very very weird.\r\nOverall 8/10 For now,let's wait for the second season, or at least the end, THEN I can give a real review. Let's hope there isn't only one season, oh please NO! I can't take inconclusive series! Argh ^(>o",
            "date": "2009-04-06T14:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 13929,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13929"
        },
        {
            "content": "I deeply enjoyed this anime, I was so sucked in by the story that I didn't want to stop watching it for very long. I finished it a total of two days, though that might be too much. But sadly, now that I've finished it, I really want to see a second season of it, which is sadly not been annouced of yet. I am told that I should read the manga, but that's where the problem lies, how can I swtich from the anime to the manga. \r\nI might have missed some stuff in the manga that wasn't in the anime and there mightbe stuff in the anime that might not be the in manga. I have to start over the story for me to understand the story again but from a written propective. The transition is not always the easiest. \\n\\n\r\nBut that aside, I will continue on with my review. \\n\\n\r\nEverything gets 10 out of 10 for these reasons.\\n\\n\r\nStory - Because it was so original, yes, I did see some stuff that seemed like the usual but the way the put much of the stuff together is what made it so out there. The fact that Kyoko joined the acting biz to get revenge on her 'star' boyfriend is something that isn't usually seen in animes such as this. And the backstory of it all really catches and sucks you in. I always wanted to learn more about it and therefore I couldn't stop watching till the very end.\\n\\n\r\nArt - Even though it was one of the more plain and gentle styles, the eys and expressions are what take the art to a new level. The enviroment and the characters are just so well expressed that you can enjoy watching the stunning work of the artists involved in the creation of the anime. They also fit well with the theme of the anime and the personalities of the characters. You can see that much though was put into the artwork.\\n\\n\r\nSound - At time I never had the best quaity of sound but that is not the anime's fault, mainly the fault of the players I was using. But the voices all went well with each other and suited their characters. There were times when I feel that some voices were off, like a certain director but after some time, I found that he was perfect for the personality of such a character. The effort of the actors move me and at times I felt that I was on the verge of tears. Seeing an anime character cry can move someone, but it's the voice that moves me to tears. So, outstanding on sound.\\n\\n\r\nCharacter - At first, the characters seem a little bland and at time, rediculous. But as the show progress, you could really see the character development with EVERY character, even the minor ones. Personalities change and grow as I got furthur in the anime, I felt like I really connected to the anime, which is a hard feat on its own. I felt like I understood the feelings protrayed and that I could think of what would need to happen to make that situation better, and that is usually what happens. But what makes me moved by the characters is that you want to cheer on the characters that you favor, like the point where Kyoko goes on set with Shou, the fact that she was able to overcome her difficulties makes you believe in her even more. \\n\\n\r\nEnjoyment - I was caught up in the story from start to finish, yes, there were times when I put the anime down but that never lasted more than 10 to 30 minutes, I just couldn't stay away from the story. The only down point I saw in the enjoyment part was the fact that it sometimes felt like it was taking too long to get to a point but then again, there were reasons why and it was understand why it took so long. And again, the ending is rather disappointing because there is nothing to follow up on with it. But that just means I will either have to read the manga, which will give even more detail to the story or just wait patiently for the next installment. So, it leaves you wanting more, that's for sure. \\n\\n\r\nAnd so, overall, an outstanding 10 to this anime. I just hope they don't make we wait too long for the next installment.",
            "date": "2013-06-18T07:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 101469,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/597359.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/moonlitneko",
                "username": "moonlitneko"
            },
            "url": "https://myanimelist.net/reviews.php?id=101469"
        },
        {
            "content": "I admit I put this anime off for a very long time because I thought it would be annoying and overrated. However, the moment I started watching I found myself regretting for having put this aside for so long! Now that I have finished watching it I can definitely say this story is one of those to not miss out on.\r\nSTORY: It's kind of simple, yet so much more deep. I love how the story manages to pull you in from the beginning (after a couple of episodes or so at max) and never lets you go. It has a lot of events that keepon going which will keep you interested. The best aspect of it was how it was not predictable. You can guess a few things but you will absolutely have no idea how those things will take place. \\n\\n\r\nART: I liked the art. I think Ren, Sho and Kyoko were all well animated. They had distinct features and I can never confuse them with other shoujo anime characters. The side characters looked good as well. There were moments where I loved simple stuff like their outfits. So I would say they did a good job with the art.\\n\\n\r\nSOUND: The voice actors were great (especially Kyouko). Plus I love all the songs played in this anime. The background was nothing noteworthy but I liked it enough.\\n\\n\r\nCHARACTER: I must say the characters are amazing! Seriously! Kyouko seems lame and Ren seems predictable in the beginning but they completely prove you wrong as the story progresses. If you like slow romance and good character development- this is the story for you. As far as characters go, I don't think there can be more perfect examples.\\n\\n\r\nENJOYMENT: The humor is great, the drama is gripping and the romantic moments are sweet. For me it left no room to get bored. So it's a very enjoyable anime. :)\\n\\n\r\nOVERALL: 10/10.\\n\\n\r\nI don't know whether I'll ever find a shoujo anime that would beat SKIP BEAT. I will remember it for a long, long time. :)",
            "date": "2013-09-12T22:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 112725,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2041183.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sakura72",
                "username": "Sakura72"
            },
            "url": "https://myanimelist.net/reviews.php?id=112725"
        },
        {
            "content": "Story : It is about this plain girl who dedicated her life to one guy.  She finds out he was using her, so she wants revenge in showbiz, since he's an idol.  \r\nArt : It isn't too great.  I don't really like the design of the guys.  I really like the MC's facial expressions.  When she changes her hairstyles and stuff, it's nice because it seems so fresh.\r\nSound : The OP and ED were eh.  Nothing special.  \r\nCharacter : Great character development.  One of the best I've seen ever in an anime.  The main girl reallydevelops.  You can see how changed she becomes when she finds out the guy was using her.  Also, one she enters the business, she becomes more mature.  She is one of my favorite characters ever.  I thought she would be annoying, initially, but it's the opposite.  Shotaro is the guy that used her.  I know I should hate him, but I really liked him.  I ship them.  I didn't like the other guy, Ren.  He was so boring and got mad at Kyoko for stupid stuff.  He was just really bland.\\n\\n\r\nEnjoyment : Loved the beginning and middle of the series.  It was so great to find another great anime.  The ending got boring, cliché, and it was unsatisfying.  It's worth watching for the beginning, though.\\n\\n\r\nOverall : It really surprised me.  It doesn't seem good from the summary and art, but give it a try.  I bet you'll like it.",
            "date": "2014-08-15T19:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 156703,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3923663.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/helloisabelle",
                "username": "helloisabelle"
            },
            "url": "https://myanimelist.net/reviews.php?id=156703"
        },
        {
            "content": "This anime is THE SHIT™. 10/10.\r\nInitially, I wasn't going to watch it because the art looked like cancer, but I'm so glad that I eventually did.\r\nI've heard many people say that 'the art is bad', and that 'there isn't enough romance'. SKIP BEAT IS A SHOUJO ANIME THAT CENTRES AROUND THE DEVELOPMENT AND GROWTH OF THE MAIN CHARACTER, KYOKO MOGAMI.\r\nWhat people don't seem to understand is that, despite being a shoujo, the anime isn't just about Kyoko's relationship with Ren, or any other male lead. It's purely about Kyoko's growth as an actress and as a person, and her realising that revenge may not bethe only thing she wants in life.\\n\r\nAnother critique that I've often heard is that 'the anime is too short', or that 'it doesn't end properly'.\\n\r\nThis is purely because of the manga being very long and still ongoing. The manga had begun in 2002, and is still continuing today. The series is yet to have an actual ending, so this would have been virtually impossible to achieve in 25 episodes of the anime.\\n\r\nHaving said that, I highly recommend Skip Beat's manga (I prefer it to the anime) to those who disliked the anime's abrupt ending.\\n\r\nBye (go watch Skip Beat) 😎😎😎",
            "date": "2017-06-02T17:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 249143,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5456111.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/amy220",
                "username": "amy220"
            },
            "url": "https://myanimelist.net/reviews.php?id=249143"
        },
        {
            "content": "Skip Beat! had everything I could hope for in a good anime - a compelling story, amazingly likable characters, and great humor. \r\nI found myself thoroughly engaged in the Kyoko's story. A few minutes in and I was already invested. \r\nI had to stop watching so I could vent about Shotaro's betrayal, even though I knew about it before hand. And I still do, as I read the manga. Not many anime can do that to you... make you feel for the characters' situation to that extent. \r\nThis, in my opinion, deserves all the praise it gets. That's why I scored it so high. It'slike a breath of fresh air among the crowds of newer, clichéd shows that come out all the time. A must see for any anime fan. \\n\\n\r\nFair warning, though: the anime does not have an ending. It was one of those shows that were cancelled before the manga finished. So the anime only goes up to volume 11 (chapter 66) of the manga, leaving many plot points unresolved. However, the manga continues well past that.",
            "date": "2017-02-18T21:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 240889,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JennyNoelle",
                "username": "JennyNoelle"
            },
            "url": "https://myanimelist.net/reviews.php?id=240889"
        },
        {
            "content": "YAY FOR SKIP BEAT!! I watched this a while ago, but I decided, Heck this definitely deserves a review. I have rewatched and rewatched this anime on Crunchyroll. I absolutely adore it. \r\nStory 10/10\r\nMain girl gets gipped by her childhood love, sets out for revenge by challenging him in the entertainment industry. \r\nAMAZING. FANTASTIC. DOWNRIGHT PERFECT.\r\nArt 9/10\r\nComfortable to look at. First anime I've seen with this type of style in the eyes, and yes, I did actually like them. I'll admit that sometimes the physical builds of the characters bothered me a little, but it wasn't anything major and unacceptable.\r\nSound 9/10 \r\nNice opening/ending themes.Music perfectly showcased what was going on. Great, but not enough of a standout to me to deserve a 10. \\n\\n\r\nCharacter 10/10\\n\\n\r\nI LOVE THE CHARACTERS SO MUCH IT'S NOT EVEN FUNNY. Do I need to say more? Probably not, but I will anyway.\\n\\n\r\nMogami (Main) LOVE HER. Strong, independent, and a little naïve. Determined, headstrong, and kind. \\n\\n\r\nRen LOVE HIM. I can't really put my finger on a particular trait, but I love the way he interacts with other characters.\\n\\n\r\nShotaro/Sho/Enemy of Mogami Arrogant, selfish, has trouble expressing his feelings to others.\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nConsidering how many times I've watched this, I think it actually deserves an 11, but hey that's not allowed.\\n\\n\r\nOverall 10/10\\n\\n\r\nAs anyone will tell you, downright awesome.\\n\\n\\n",
            "date": "2015-06-12T15:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 190181,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220095.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Animelover820",
                "username": "Animelover820"
            },
            "url": "https://myanimelist.net/reviews.php?id=190181"
        },
        {
            "content": "Definitely a must watch comedy at this moment. the same company that made special a which is quite promising, if not better. The inner demon parts of individuals just spice the things up dramatically.",
            "date": "2009-02-15T00:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 12438,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/147280.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zero_99",
                "username": "zero_99"
            },
            "url": "https://myanimelist.net/reviews.php?id=12438"
        },
        {
            "content": "Anyone who is into the shoujo and slice of life genre will probably enjoy this anime. The art and music are so-so, and the plot is cliche and pretty predictable, but its the character growth and interactions -- the story of how the main character and those around her reach their goals that makes the a fun anime to watch. \r\nThe heroine is a likable female character -- strong, independent, and friendly to those around her and her contempt for her friend who dumped her is realistic and relatable to anyone who has had someone betray their trust. Even though her revenge against the friendwho \"dumped\" her was an initial motivation for her to pursue her career, I liked that this man wasn't too much of a focus for her character's growth and that she was able to find other, better things that could keep her going.\\n\\n\r\nI'd say the worse part about this anime is the fact the the ending left me hanging and wished that there was more. Oh well, time to read the manga!",
            "date": "2015-12-30T19:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 207346,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5078481.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sars0928",
                "username": "sars0928"
            },
            "url": "https://myanimelist.net/reviews.php?id=207346"
        }
    ],
    [
        {
            "content": "I watched this entire series in one shot. I really wish I could give it a higher score, I really do, and up until the last episode, it easily had an 8... however, the lack of any real conclusion, and dropping of certain story elements was just too disappointing.\r\nThere is no romantic conclusion, the point card system of the Love Me department just sort of disappears, she doesn't even get to make a real debut (the seeming point). There is a half conclusion with her ex-boyfriend Sho, but I would have liked to see more, seeing as they kept going back to him after hisarc should have concluded.\\n\\n\r\nIt really is a pity, since there was a good range of characters and character development, and the animation wasn't shabby in the slightest. It was just really annoying to watch the first 18 episodes have very solid plot directions, and the last 7 waver about as if they didn't know what plot line to go with. Episode 25 felt like a 22 minute spot for a season two, not a finale. :(",
            "date": "2012-03-30T05:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 57389,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/182824.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tokyo_shorty",
                "username": "tokyo_shorty"
            },
            "url": "https://myanimelist.net/reviews.php?id=57389"
        },
        {
            "content": "Story: It starts out like a revenge story, but becomes more off Kyoko's development story about how she becomes from nobody to somebody in the acting biz with some romance mixed in. But be careful the romance part of this show only shows itself after episode 20 or so with some. Most of the time until then it kinda is more like a comedy story about Kyoko and her career.\r\nArt: It was better then I expected for a Shoujo anime. Almost all of the time pretty, shiny man didn't get into the screen to obscure my view. Also characters were drawn very good, but Inoticed about 3 times for few seconds that some character body parts seemed out of proportion. Background art was very good too.\\n\\n\r\nSound: First OP was very good,but not catchy and I wouldn't want to listen to it normally, but it did fit well with the feel of the Skip Beat. Second OP wasn't bad either but it was nothing special.\\n\\n\r\nCharacter: This is the strong point of this anime. Kyoko, Fuwa, Ren are all great characters. Specially Kyoko, she was very funny and I liked how she developed her acting and personality through out the series. Only thing I didn't like was that Kyoko all the time even to the end was naive. I kinda expected her to become more tougher and hardened, because she was betrayed by Fuwa.\\n\\n\r\nEnjoyment: I enjoyed Skip beat even though I'm not a shoujo anime fan, but I liked this anime mostly because of the comedy and the characters and how it all was put together.\\n\\n\r\nOverall: Don't be afraid to watch this anime just because it is Shoujo. It is hilarious, entertaining and heartwarming. It may be a little naive and a bit stupid some times, but all people are a bit naive and stupid. Skip Beat isn't a perfect anime that i would recommend to all. But still take a look at this anime if you like comedy or you have nothing else good to watch .\\n",
            "date": "2011-04-27T08:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 36506,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/reinis-jan",
                "username": "reinis-jan"
            },
            "url": "https://myanimelist.net/reviews.php?id=36506"
        },
        {
            "content": "This anime was very outstanding because of it's main protagonist Kyouko. I feel like she wraps up the story quite nicely and it's really enjoyable to have a protagonist who doesn't cry when she falls but instead gets right back up. \r\nAlso, this anime is very realistic in the sense that Kyouko doesn't always win and that she has to work hard to have a career in showbiz. Despite the constant lingering of romance, it only reaches it's climax at the end so I suggest you should watch the show for comedy rather than romance.",
            "date": "2015-04-09T11:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 185223,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4256271.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/masumi_amari",
                "username": "masumi_amari"
            },
            "url": "https://myanimelist.net/reviews.php?id=185223"
        },
        {
            "content": "These are of those rare gems that I'm very happy to read tenfold. Before you just pass by this review without a second glance-- this is coming from someone who left shoujo because I was dissatisfied by the lack of character development and cringing by stereotypical main pairs. \r\nYou probably already know the standard stuff, so I'll go on with what was personally important to me: the focus on her ability as an actor rather than the focus on romance. \r\nDon't get me wrong, I love romance, however, they were able to steer clear from the sterotypical shoujo bull. Instead of the idea love, they'remore focused on her Kyoko's development, even Ren was focused by her talent. \\n\\n\r\nIt was only then that senpai/kouhai relationship used this factor to bloom romance. \\n\\n\r\nSadly, this anime is barely a quarter of the manga. Literally. If you were to read the manga you'd be already in quarter in-- and girl. The best stuff happens in the manga. \\n\\n\r\nOveral, I'd give the anime an 8. My manga review is entirely different. \\n",
            "date": "2016-12-14T18:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 235461,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5901810.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PrinceOfInsomnia",
                "username": "PrinceOfInsomnia"
            },
            "url": "https://myanimelist.net/reviews.php?id=235461"
        },
        {
            "content": "A shōjo like no other (and it feels great!)\r\nGet ready to laugh over and over again!\r\nWouldn't Skip Beat be one of the most hilarious mangas that exists? Honestly, I think so.\r\nFirst the synopsis. The main character - Kyōko Mogami - moved to Tokyo to follow her childhood friend - Shō Fuwa - (whom she is in love with). Having become a well-known singer in Japan, he ended up manipulating Kyōko, throwing her away from his life like she was nothing to begin with. Put yourself in her shoes? What would you do? I would probably cry. Well Kyōko has decided otherwise and she intends totake revenge. She decides to become an actress and integrate the competing company of Shō which produces stars such as actors and singers. Then she will meet the other main character - Ren Tsuruga – a handsome talented man recognized as one or even the best actor in Japan. He will become his mentor and will start falling in love with Kyōko.\\n\\n\r\nA love triangle like no other\\n\r\nLet's agree, I hate love triangles in shojos, too cliché for my taste. The main character is generally in love with the brown hair guy, the brown is also in love with her but cannot admit his feelings. Then the sad heroine will find some comfort in the arms of a very kind blond, respectful and always present. Their story develops and then plot twist! The brown finally wakes up after months and decides to win back her love and the worst is that he succeeds. And the blond guy (way too nice) lets his sweetheart join his true love... MY GOD STOP!\\n\\n\r\nSkip Beat offers a completely different approach:\\n\r\n1°) The heroine has built a real relationship with the two men. As a result, we appreciate these two relationships.\\n\r\n2°) The three characters are charismatic, funny, ambitious and slightly naive which gives them an endearing side. It also allows the story to go further.\\n\\n\r\nMore than 250 chapters...\\n\r\nSkip Beat has been published monthly since 2002. The series is still in progress with over 250 chapters/42 volumes (83 chapters/18 volumes for Ouran High School Host Club, 85 chapters/18 volumes for Kaichou Wa Maid-sama!).\\n\\n\r\nWhy is the story still not finished?\\n\r\nIf we constantly wonder how the love story will evolve, we do not forget that the main character is Kyōko, and which heroine: beautiful, funny, intelligent, ambitious. She is not just reduced to a girl who seeks love since Kyōko, betrayed by Shō, refuses to fall in love again. She has a real goal: to become the greatest actress in Japan. The story invites us to follow her dream.\\n\\n\r\nIn summary\\n\r\nI read a lot of shōjos and for now Skip Beat is my favorite one. I have read it over and over again with the same enthusiasm. I therefore advise it to all those who are revolted by weak main characters who take no initiative. Kyōko Mogami is an example for all the heroines of shōjo.",
            "date": "2018-08-14T15:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 286498,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7295565.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/my_wander_woman",
                "username": "my_wander_woman"
            },
            "url": "https://myanimelist.net/reviews.php?id=286498"
        },
        {
            "content": "A nearly perfect shoujo anime, with one small fault, in my eyes.\r\nNow, it's worth noting I am obviously not the target audience for Skip Beat, so that might be something to note. I have seen my fair share of shoujo anime, and liked most of them actually,  but I'm still probably writing from a different perspective than most viewers of this show.\r\nSo what is my one fault I had with this particular anime? \r\nI guess, to put it simply, the \"wish fulfillment\" (aka fan-service) element of the story, specifically in the romantic department. This is not inherently a negative, but it is fairly egregiousin this case, at least IMO. I'll explain.\\n\\n\r\nIn Skip Beat, the main character Kyouko, like in most shoujo anime, is a teenage girl. After being tossed aside by her narcissistic, a-hole pop idol boyfriend, Shoutaro, she has decided her ultimate revenge will be to show him up in his world, the world of show business. \\n\\n\r\nShe quickly ends up working for the talent agency of Shoutaro's hated rival, the slightly more kind-hearted, and \"serious\" acto,  Ren. We actually get a brief introduction to him in the beginning of the show when, much to the chagrin of Shoutaro, he appears on TV and places 1st in a poll for most attractive men in Japan, while Shoutaro is all the way down at 7.\\n\\n\r\nWithout spoiling anything, you can probably see what is coming. The most fan-servicey psuedo-love triangle (it's debatable whether one should include Shoutaro, but based on some of his obvious jealously later in the series, I thought it was appropriate) I've seen in an anime. I mean, two hugely popular celebrities, and apparently 2 of the 7 best looking guys in the entire country, are the two MC's love interests? Really?\\n\\n\r\nIt sort of reminded me of Harem in that respect (although obviously this is not a Harem, as there is at most 2 suitors), in that Kyouko, as most harem MCs do, served as the self-insert character that found herself in a very fortuitous romantic scenario. And this is after having her heart broken by an ex who becomes increasingly flustered seeing her doing so well, which just adds to the fantasy element. And, much like Harem anime, this made it a little difficult to take the romantic element too seriously.\\n\\n\r\nLuckily though, the anime excelled at everything else. Kyouko is a fantastic lead. She's funny, determined, a little quirky, and just so easy to root for. Not only that, but I feel there was legitimate growth of her character throughout the series, largely because of her willingness to take a critical look at her actions and see where she is erring. Overall, one of the better leads in any romance anime I've seen.\\n\\n\r\nAs for the other characters, aspiring actress and \"frenemy\" Moko, as well as a very eccentric president of the talent agency were standouts. As I mentioned before, I wasn't a huge fan of either of the almost fanservice-y love interests. \\n\\n\r\nBut maybe where Skip Beat shines the brightest is in its comedy. A lot of this takes place within Kyouko's vivid imagination, and there's also a decent amount of chibi scenes, which work surprisingly well. Marina Inoue, the MC's VA, absolutely nails it and basically steals the show. I can legitimately say it is one of the 5 funniest anime I've seen.\\n\\n\r\nAs far as the art and music, I can't really say it was great or terrible, it was merely good.\\n\\n\r\nSo, overall, I give Skip Beat an 8. It's just slightly disappointing that it could've been truly GREAT if it wasn't for some pandering towards the target audience.\\n\\n\r\n(this is my first review, so be kind)",
            "date": "2018-07-10T16:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 283660,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7002497.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/axel360",
                "username": "axel360"
            },
            "url": "https://myanimelist.net/reviews.php?id=283660"
        },
        {
            "content": "The anime has to be picked up again and continue from where it's left off.\r\nAmazing, relatable, funny characters that are trying to make their dreams come true. They show a bit of the difficulties in making it in show biz, but still keep it positive. Good character development and relationships. Inspiring, happy anime. And an interesting plot.\r\nThe only problem is the art. It's...not very clear. That's why I like the anime and can't read the manga, because the anime makes it clear and prettier.\r\nI totally recommend this anime, unless you don't want to be let down when you see it doesn't continue, while the mangadoes.",
            "date": "2018-05-14T11:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 280555,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7256466.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FallenNathaniel",
                "username": "FallenNathaniel"
            },
            "url": "https://myanimelist.net/reviews.php?id=280555"
        },
        {
            "content": "I was interested into this anime since I first heard the premise.\r\nStory: Despite her original intention for trying to become a star, Kyoko turns out to be a strong and persistent character that ends up taking her future into her own hands. She takes her initial drama and pain and transforms it into the energy she needs to boost herself up the stardom ladder. \r\nCharacters: The vast array of characters is what makes this series truly enjoyable. The story focuses a lot on character development, and not just for our main heroine. Kyoko is a fresh character - and it is a bit sad to say this in2017 since the anime was released in 2008. \\n\\n\r\nArt: Now the art was something I had trouble with at the beginning... I am just not used to this art and it took me a bunch of episodes to learn to get over it and not look at their weird proportions. But I truly enjoyed the art during the comedic scenes. The colors are bright and the details are clean, but nothing special.\\n\\n\r\nSound: Most of the time I ignore the background music and music in general when it comes to anime. Unless the sound is spectacular, it usually goes unnoticed, which is a good thing in my humble opinion.\\n\\n\r\nEnjoyment: Tremendous! I loved how it managed to blend the tragic story moments with the comedy scenes. It didn't disrupt the story flow. Plus I loved the art style from the funny bits. To have Skip Beat! as my first finished series since returning to this hobby is a great way to start!\\n\\n\r\nOverall: I recommend it! Great character development and story. One small flaw, and it is probably due to the manga being incomplete at the time of the anime - the ending is kinda open, although positive - and there are a lot of plots that need to be further explored. So I might need to read the manga now.",
            "date": "2017-12-10T09:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 264917,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/352458.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/magicb",
                "username": "magicb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264917"
        },
        {
            "content": "ok so this is my first review and i hope u enjoy it(some spoilers ahead)\r\nive watched skip beat 3 times already and it doesnt fail to impress me everytime i watch it the characters are loveable,has a nice plot,u enjoy it and spoilers(*************its second season isnt there) so i can honestly say its gonna be a huge dissapointment to those who dont like cliff hangers such as myself \r\nnow our story is about a girl who gets into show business(tv and glamour world of celebrities)just for the sake of revenge against her ex crush who manipulates her.it sounds insane but the anime is pretty goodthe romance is regular paced,lots of comedy and every episode has something to offer you will enjoy it but be WARNED there is no second season i searched for it everywhere and all i find is a Korean or Japanese adaptation version which kind of sucks\\n\r\nover all great anime which keeps you at the edge of your seat and the ending is really messed up coz the second season was never made so goodluck and have fun",
            "date": "2016-05-18T13:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 218840,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/elluvites",
                "username": "elluvites"
            },
            "url": "https://myanimelist.net/reviews.php?id=218840"
        },
        {
            "content": "Watching Skip Beat was one of the most entertaining and touching experiences I had since I've started watching anime. I highly recommend it to anyone who is in the mood of laughing till their stomach hurts. It's also quite moving, and as much as I hate to admit, my eyes teared up more than once. Sure, the story is quite naive, but that only gives it an extra kick. \r\nMogami Kyoko is one of the best female characters I've had the pleasure of watching. She starts out as a passive, typical shoujo young girl, innocent beyond innocence itself. She looses that trait as she isbetrayed and she strives to reinvent herself and to regain the trust in people and in love. And she's so damn fun!\\n\r\nSkip Beat is an onging manga, but nonetheless, the anime is wrapped up nicely, which is not very often in similar cases.\\n\r\nJust WATCH IT, please!\\n",
            "date": "2010-04-05T16:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 24710,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302537.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/aindah",
                "username": "aindah"
            },
            "url": "https://myanimelist.net/reviews.php?id=24710"
        },
        {
            "content": "This anime....I have to take a mental pause before I go into it about this anime.\r\nWhy do I love this character?\r\nFirst of all, she doesn't cry and takes out some sort of hammer and knocks the crap out of those who try to get in her way...\r\nShe wants friends, she wants to be loved by her friends she doesnt want to fall in love she truly enjoys her works and loves that her good work crushes those who try to mess with her....\r\nessentially Kyoko is a mental person, but I love that!\r\nThen we have Ren! And unfortunately I can't give too much info on hischaracter without going into  spoilers since essentially the anime covers Kyoko and her rise to stardom, again this is one of those anime where it can be looked at as an advertisement to the manga and while I would love to see a second season I would be very upset if they didnt follow the manga closely(like they did with the first) or made it better..which they can't....I like to laugh, I like to cry, I like to laugh while crying, this thing gets a 10.",
            "date": "2012-10-03T09:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 73991,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1388753.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/qichiro",
                "username": "qichiro"
            },
            "url": "https://myanimelist.net/reviews.php?id=73991"
        },
        {
            "content": "Enjoyment- 10/10, it had me constantly watching until I finished the anime.\r\nStory-  9/10 Interesting, entertaining and gets better with development. The only thing I would that is kind of a negative at times wad that her drive to be an amazing actress irritated me but that changes through out the anime.\r\nCharacters- 9/10\r\n Kyoko Mogami: I really like Kyoko as a character, she is very different from the usual heroine. She is terrifying, strong, extremely kind, and adorable. Her personality is so funny whether or not she is attacking someone with her aura or doting on Kanae. As she develops we come to understand herheart condition and how deeply she was affected by Sho. I love Kyoko and feel an attachment to her character.\\n\r\nTsugara Ren: At first I wasn't sure how I felt about him but as the anime goes on I fall in love with him as well. He does under go development in the anime concerning how he had never really loved anyone and how that affects his career and as he comes to understand his feelings. Though the anime only being 25 episodes he left alot of unanswered questions that can only be found in the manga (which I read after the show but is still ongoing).\\n\r\nFuwa Sho: I will say this straight out, I do not like him. Anime or Manga I don't like him. Though that is my opinion because I love Kyoko, he does under go development further in the anime and you see his feelings change (but only a little). He develops more in the manga by a little, but i still don't like him. One thing I will say is I looked forward to his appearances in the anime because of Mamoru Miyano's performance which was beautiful as always. I really like his song Prisoner as well, I still listen to that :)\\n\r\nThere are other characters given development but I'm not going to really talk about them because they are supporting and it would take too long. But I did like Kanae, Maria, the president and Yashiro. I really like how Yashiro shipped Ren and Kyoko :D\\n\r\nAnimation- 8/10 Solid and is the embodiment of the Manga which is from the early 2000s. It was pretty normal and solid but nice to look at, I like the chibi appearances which are in the Manga also.\\n\r\nSound- 7/10 Average, the openings and ending are forgettable and I always skipped. The only memorable performance was by Mamoru Miyano and that was Prisoner which is amazing by its self and I still listen to it.\\n\r\nProblems- The only problem I had with the way things went is that they stopped after 25 episodes when the Manga is still going on and already has over 200 chapters. The manga has been going on for 12 years. Sadly they left it as a \"go read the manga\" anime and that is disappointing but I did go read the manga and I recommend you do too! I just wish it wasn't uncompleted after 12 years. Which also means there wasn't that much romance in the anime which goes back to the \"go read the manga\" issue but it is what it is.\\n\r\nOverall- 10/10 This anime was so entertaining and really is a favorite, I give it a 5 our of 5 saying I wish it wasn't over!",
            "date": "2014-05-15T17:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 143401,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3031317.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Thirst122",
                "username": "Thirst122"
            },
            "url": "https://myanimelist.net/reviews.php?id=143401"
        },
        {
            "content": "Take it from someone who outright didn't like this to begin with.\r\n...This is pretty darn good.\r\nStory: 7/10\r\nIt's pretty slow up until episode 6. But after that, it really makes up for everything with hilarity, outrageousness and general sweetness.\r\nArt: 8/10\r\nDifferent from what I usually prefer. I swear, every girl looks like she's wearing some think eyeliner. That aside, still quite pleasant. The men are very goodlooking, and not in a overly girly way.\r\nSound: 5/10\r\nNot bad, not spectacular.\r\nCharacter: 8/10\r\nSo the main character had me pretty annoyed to begin with. So a guy makes a douchebag outta you...STOP WHINING!!!! But then, eventually, you sorta warm to her. Also,the more you watch, the more her evil side starts to slip out. By far, I love her evil side more. The character development is also really adorable. You really start to feel for the characters by episode 7. \\n\r\nI actually think it's nice to be able to warm up to fictional people so gradually. It's like falling in love without really noticing.\\n\\n\r\nEnjoyment: 8/10\\n\r\nIt's cute. It's funny. It's sweet. It's a ...little warped here and there. Yeah, you know it's enjoyable. =P\\n\\n\r\nOverall: 8/10\\n\r\nThis isn't one of the best comedy/romance animes I've watched, but it does do away with a few cliches and it is a fairly decent story. I watched it not so much for the story as I did for my love of the characters. Like I said, you really become quite fond of them. To the point where you find yourself wishing the best for them. I think it's one of the few animes where I really find myself being sucked into the characters' lives and genuinely liking them as much as I would like real people. (No, I'm not nuts and I have SOME friends and some of them are even visible!) lol Jokes aside, seriously, this is lovely.\\n\\n\r\nIf you run out of stuff and want a decent anime to watch, then by all means --this has to be one of them.\\n",
            "date": "2011-02-23T04:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 34674,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheSakurax",
                "username": "TheSakurax"
            },
            "url": "https://myanimelist.net/reviews.php?id=34674"
        },
        {
            "content": "I only have one thing to say. YES. Yes, yes, yes. \r\nThis is a hilarious, wonderful, fun, dramatic, and fantastic anime. It's so good, I may have to start reading the manga. This ticked all the shojo boxes for me and I am proud to say that it is now in my list of top anime.\r\nWhen I started on the first episode, I had a bad feeling that it was going to be your typical love story with a boring, soppy female lead character who cried all the time and had everything happen for her because she was cute. NOT SO! In the first fiveminutes, my fears were assuaged. I don't think I've laughed or enjoyed an anime so much since Azumanga came out. It's a good balance of humor and warmth, mixed with heart wrenching drama. You really connect with the characters, which I always find pleasing.\\n\\n\r\nThe only thing that I was slightly disappointed on was the ending as I was looking for a firmer resolution, which isn't available since the manga is still going and there might be a second series at some point. I really, really hope so.",
            "date": "2011-10-14T04:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 45507,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/560167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/baskervwatson",
                "username": "baskervwatson"
            },
            "url": "https://myanimelist.net/reviews.php?id=45507"
        },
        {
            "content": "There is only one word to describe this anime: BRILLIANT!\r\nKyoko Mogami a young girl tricked into going to the city with the childhood love of her life, to basically become his slave, vows to get revenge on him (after being dumped)by beating him in showbiz.\r\nYou can already see that this is one of the most original plotlines, you are ever gonna see and the main girl is just great. Unlike any other girl who would instantly start crying after she got dumped, she starts laughing and enters into acting.\r\nHonestly if you're into watching anime and you haven't seen this yet, you have no idea whatyou're missing",
            "date": "2011-10-15T04:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 45589,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/751283.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SkyRabbit",
                "username": "SkyRabbit"
            },
            "url": "https://myanimelist.net/reviews.php?id=45589"
        },
        {
            "content": "I enjoyed this anime show since the beginning (and i'm almost sure everyone else will enjoy it too) The characters stay with you long after you finish watching it. I was a little disappointed with the end, but other then that it will be the most rewatched anime on your VCR.",
            "date": "2015-06-09T18:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 189963,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4666336.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnimeOtakuMeme",
                "username": "AnimeOtakuMeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=189963"
        },
        {
            "content": "This anime is one of the best I've ever seen! I've only watched the first 12 episodes but it is just awesome. The storyline is unusual and totally not boring.\r\nThe characters are really well done and u get addicted to this series. I soon plan to read the manga causs i cannot wait that long for the episodes to come out. The art is high quality and very good and the opening is the best!! \r\nThe only thing left to say is that u really should watch this anime!! =)",
            "date": "2008-12-23T11:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 10594,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/120429.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kamikaze5513",
                "username": "kamikaze5513"
            },
            "url": "https://myanimelist.net/reviews.php?id=10594"
        },
        {
            "content": "What would you do if you got thrown away like a tissue paper by the guy you've always liked? You'd sulk over it, get depressed and feel hurt but our protagonist... isn't quite the normal one.\r\nStory: 9 - Kyouko Mogami had always been chasing after her childhood friend and crush Shoutaro as she even willingly came with him to Tokyo so that he can fulfill his dream of becoming an idol. One day when Kyouko overhears Shou's opinion of her as a boring housekeeper and will leave her soon, the innocent and sweet Kyouko goes berserk as she vows to get her revenge by defeatinghim in the entertainment industry. This story isn't quite original but the the way it was presented and how it actually turns out is what makes me love this anime.\\n\\n\r\nArt: 8 - The art is kind of old but that's expected from a 2006's anime. I think the art overall was quite good as well as the right movements used during the acting scenes.\\n\\n\r\nSound: 8 - ( I almost forgot this anime had a opening and ending...). Some of the soundtrach was...forgettable. But some songs and OST's used during the anime were good. The seiyuus had done a great job too.\\n\\n\r\nCharacter: 9 - I gave one extra point for Kyouko because no matter how many times I see her I just can't get enoughh as she is so hilarious and quirky yet dense. But generally all of the characters were good as they fulfilled their roles perfectly.\\n\\n\r\nEnjoyment: 10 - This is an extremely enjoyable anime and is suited for anyone.\\n\\n\r\nPeople who liked: Glass no Kamen,Kodomo No Omocha,Yamato Nadeshiko Shichi Henge,Kaleido Star,Full Moon Wo Sagashite and Paradise Kiss will enjoy this series due to some similar aspects.\\n\\n\r\nOverall: 9 - This is overall a great anime that can be enjoyed by anyone.",
            "date": "2014-05-25T13:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 144487,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2544801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tuva",
                "username": "tuva"
            },
            "url": "https://myanimelist.net/reviews.php?id=144487"
        },
        {
            "content": "Hell hath no fury like a schoolgirl halfway to housewifedom scorned.\r\nSubmissive, homey together-since-childhood girlfriend of an aspiring pop star, who works two jobs to pay his rent and spends her free time packing him exquisite lunches and stroking his ego, accidentally overhears him speak of just using borind old her - for her \"convenience\"... AND SNAPS.\r\nAnd oh boy, does she snap BIG TIME. And decides to destroy her ex - in his field, on his terms... Tokyo's showbiz doesn't know it yet, but it's just gained its newest, most lovable (and successful) schizo yet. Her niches: CUTENESS + HATRED.  \r\nPacking enough negative energy tostare down Darth Vader and make grown men cry, bullish stubbornness and banzai charge mentality enough for two Edward Elrics, the momentum of a freight train, a few voodoo dolls, human-shaped candles, and enough kindness (!) and heart to touch and defrost the coldest of Tokyo showbiz's hearts, she is about to unwittingly embark on a wonderful journey of self-discovery and self-improvement. Doing lots of good and scaring the bejesus out of a bunch of people along the way.\\n\\n\r\nIt's not the destination that matters - it's all about the road... Probably. Wouldn't know. This otherwise phenomenal anime's conclusion constitutes the last 2 mins of an otherwise regular episode. Not a single arc is wrapped up ;_((( The conclusion is basically \"ooh wonder what tomorrow will bring - but it'll probably be BEAUTIFUL\". Meh. \\n\\n\r\nDEFINITELY WATCH, though. Just treat it like a slice of life or something - finality will NOT be achieved, relationships will not culminate, seemingly recurring characters will not recurr, etc. etc.",
            "date": "2011-12-09T07:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 48819,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Adieu",
                "username": "Adieu"
            },
            "url": "https://myanimelist.net/reviews.php?id=48819"
        },
        {
            "content": "I absolutely loved this series but the ending i must say wasnt satisfying enough..It ended so abrubtly and some things i felt were not finnihed and left the audience yearning for more...I was having a fit with the way it ended...but still overall it was good..the characters and acting and experiences they had were fun to go along with ...intense...funny...all of that!",
            "date": "2013-06-20T11:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 101721,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2639079.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MiaMichelle",
                "username": "MiaMichelle"
            },
            "url": "https://myanimelist.net/reviews.php?id=101721"
        }
    ],
    [
        {
            "content": "Skip Beat!\r\nI am conflicted here. Nearly every episode ended with a cliff hanger that made me want to watch the next, and even after the anime was finished I wanted to watch more. I believe the reason for this is that there is a such a strong purpose to the story line and how the actors work their way through it.\r\nEvery day is filled with a passion for work, laughter, and a serious hatred towards the guy who broke the main character's heart. The main character's emotions are so extraordinarily vibrant that she can't help but act them out in front of people. She reallygoes the extra mile, and some people become confused when she does this because she totally is not paying attention to her surroundings.  Not in a clumsy kind of way, of course, though it's really quite the spectacle. \\n\\n\r\nWhat it comes down to in this anime is that the main character suffered an extreme heart break, and is willing to do what ever it takes to get revenge. In doing so, she becomes someone who she never imagined, meets many new people, and work extremely hard towards her goal. Such enthusiasm.\\n\\n\r\nI've been careful not to give away much of anything towards the story line, as it all kind of came as a surprise to me, and I think you would appreciate it if the story unfolded towards you as well.\\n\\n\r\nNow comes the ratings:\\n\r\nStory - 10 - There was one main objective here. The very same objective was consistently fueled with a renew fire, and it's kind of cool how this is dealt with near the end of the anime.\\n\r\nGraphics - 10 - The developers really went over and above in expressing the many different emotions and scenes in this anime. The use of flashbacks, dynamic view angles, alternative character displays, screen manipulating events, and many more.\\n\r\nSound - 9 - The background themes really set the mood, while the individual action sound, such as a chicken 'PIKAAAA'ing, were rather quite funny.\\n\r\nCharacter Personas - 10 - Every character had their strengths and flaws portrayed through this anime. I could sense a manner of honesty and outrageous activity between characters interactions, and I say that because different characters perceive each other differently. A spoiled rich girl believes that she is honestly more important than everyone else, so why does everyone get mad at her?.. These kinds of events occur between personas.\\n\r\nVoice Acting - 10 - WOW. The main character really had me at awe at times. She had a tendency to become a magician with her own voice at times. By the way, this is the Japanese actor that I am speaking of, Marina Inoue.\\n\\n\r\nOverall - 10 - I honestly wanted to give this anime a lower score because the pace can be slow, however I was never once bored with this show. In fact, some days I thought I had watched too many episodes. I recommend this anime as a humorous romance, and the show felt like an 8, but somehow I am giving it a 10.",
            "date": "2016-10-22T09:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 232324,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2166195.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrbeckham09",
                "username": "mrbeckham09"
            },
            "url": "https://myanimelist.net/reviews.php?id=232324"
        },
        {
            "content": "Skip beat was an awesome anime cuz it was really funny but romantic at some timez too so i deff reccomend this to anybuddy.\r\nSkip Beat is technically a girl named Kyoko Mogami that wants to get revenge against Fuwa Sho, her so called childhood friend. the way that kyoko gets revenge is through show biz. on her journey to the top she meets a lot of diff ppl. the most important person tho is tsuruga ren.",
            "date": "2009-04-02T23:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 13797,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/swagoshin",
                "username": "swagoshin"
            },
            "url": "https://myanimelist.net/reviews.php?id=13797"
        },
        {
            "content": "I'm not really a fan of this kind of anime but this really shows a good adaptation of manga and anime altogether. I've watched it first up to episode 20 and have re watched it 3 to 4 times already in my portable players between whenever I have breaks. It always gives me a smile in its scenes. \r\nThe story and inside story in between series is enjoyable. The content keeps you wanting for more. I even read the manga 100+ volumes afterwards overnight. It just shows how good this series is. \r\nI do hope that they will continue this anime even after episode 25.Maybe a second season or something. \\n\\n\\n\r\nCheers!",
            "date": "2009-03-09T02:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 13006,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/n_icis",
                "username": "n_icis"
            },
            "url": "https://myanimelist.net/reviews.php?id=13006"
        },
        {
            "content": "WOW...thats all i really have to say...i mean really this anime is my all time favorite..haha i mean it even topped JR! \r\nBut ok...I dont really feel like writing a super detailed review well because this is my 1st one and I'm watching another anime on my other page (teehee)\r\nbut i felt like i was 1 with Mogami...(don't hold it against the show if i spelled her name wrong!!). It's like i felt the same exact way she did!!....I hated that guy with a pasion for what he did to her lol, and at 1st i didn't like Ren either but as i watched oni really started liking him alot.\\n\r\nThe art is AMAZING i have watched alot of romantic comedy animes and lots of art is different and i can never find my favorite kind...(this had it....just so you know ^-^).\\n\r\nThe characters i love, except for Fuwa lol.\\n\r\nThe one thing i didn't like about this anime was the ending...WHAT HAPPENS NEXT?!??! Umm i heard it came out like 3 months ago?....correct me if I'm wrong cause i probally am, but the ending horrible lol when you watch it you will see there are so many loose ends in it!!\\n\r\nSo I\"m totally expecting a season 2...there is rumor but not for sure. So if your like me and fall in love with a anime and cry when its over and there is no second season....I don't wanna say i dont recomemd cause i could never do that!! lol but I would watch it when there is a definate 2nd season.",
            "date": "2009-09-01T19:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 18313,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ticklemelove",
                "username": "ticklemelove"
            },
            "url": "https://myanimelist.net/reviews.php?id=18313"
        },
        {
            "content": "A brilliant anime with a hysterical plot. Combine pavement pounding humor and heart palpitating romance and there you have skip beat. \r\nEven the manga's downright funny. Each chapter or episode cannot go ignored, since all of them contains the same witty sarcasm and comedy plus romance that you're looking for. \r\nA thirst quencher for romance-comedy addicts. I suggest you watch/read now.",
            "date": "2009-06-06T06:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 15522,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/190747.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DBayoty",
                "username": "DBayoty"
            },
            "url": "https://myanimelist.net/reviews.php?id=15522"
        },
        {
            "content": "Skip beat was a manga that made into an anime. Although the manga is still ongoing, i wander if there will be a second season on skip beat and i really hope that.",
            "date": "2009-08-20T14:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 17939,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/223582.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/animelol222",
                "username": "animelol222"
            },
            "url": "https://myanimelist.net/reviews.php?id=17939"
        },
        {
            "content": "First of all when i almost finished watching this it gave me a feeling that this anime is so incomplete.i felt disappointed when i search the manga version of it is still ongoing and on that point i knew that there's something missing in the end of the anime but to be honest this anime is pretty entertaining and very funny at the same time.It follows a young girl Kyoko to get revenge on his childhood friend Fuwa in the celebrity industry it may have many cliché moments and yet interesting for some reason to me its a fun anime to watch if you needa daily dose of laugh.",
            "date": "2012-08-08T03:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 69071,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1328181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Romcom-Lover",
                "username": "Romcom-Lover"
            },
            "url": "https://myanimelist.net/reviews.php?id=69071"
        },
        {
            "content": "Ahh!!! A story about sweet revenge. Indeed, revenge is best serve cold but in this case with lots and lots of laughter. While your laughing your hearts out, you will experience how great the feeling it is to see the main character serve her revenge.\r\nThere’s a long review coming!\r\nABOUT THE STORY\r\nThere’s nothing more fun and astonishing when getting revenge to the man who broke your heart. I can still feel how great the feeling is. The story didn’t have a magnificent-like story that needed an Oscar Award but the story of this series was undeniably captivating. Even though the romantic part was not well-explored likethe usual scenes in your typical love stories where the two main characters after realizing that they have feelings for each other started going out or ended up getting married but in this series you will still experience the wonderful feeling of falling in love. I also love how the main character struggled to achieve her goals and realized that though her primary goal was to have revenge, more than anything else she realized what she truly wants to do for herself. Not to satisfy her pride or anything but for her to know herself more. To know her boundaries and if she can do more after she realized her limits. But then again, my favorite part was when she showed that asshole what she can do without him in her life. That she can surpass him with her own perseverance and faith with herself.  Every episode was worth watching that I had to save it. I been an Anime lover for so many years and I always save up all the series that I treasure so that I can watch them again but I didn’t save every each episode of those series but Skip Beat! made me save every episode from first to last which is ver rare for me, that shows how great the series is. \\n\\n\r\nABOUT THE CHARACTERS\\n\r\nEvery character in the series lives up to their roles. Even the very much hated reason for Kyoko’s craziness was really annoying. Even you would want to see Kyoko crush the guts of that useless guy. Love the very mysterious and cool guy Ren. If you already read the manga, you’ll be fascinated by the mysterious dark past of Ren which is mostly contributes his will not to fall in love because he thinks he doesn’t have the rights to be happy. That romantic feeling you will have when the only person who can get him out of the darkness is none other than Kyouko. Let’s not forget that flamboyant President Takarada who knows everything and shows up at the right time and says the right words at the right time. He’s like a fairy godmother well in his case fairy godfather who would always support both main characters behind the scene. He always plots something as so the two can be together, overcome their issues and realize their feelings for each other. I really love his character so much. \\n\\n\r\nABOUT KYOKO AND REN\\n\r\nBut the best character, well of course, Kyoko’s character. Nowadays, women have more balls. I really love it when after she found out what Sho really felt for her, instead of crying like your typical frail goody-good-shoes heroine, Kyoko fought back right away. She struggled to achieve her goal and never got depress when she was dumped. Instead, she used those depressing feelings of being used so she can show him what he lost. When she has finally got the chance to show him what she’s made off, she did not only kick his sorry ass but also made him realize those feelings which he thought he didn’t have for her. And boy when she shows-off her acting skills it was so exciting. She’s also one hilarious girl. Every time she goes to her own world, you’ll laugh till you drop. Despite having an evil aura, she can be so damn hilarious which makes her more amazing. Another one that I really love about her was that despite having those depressing feelings she still managed to have a great outlook in life and even changed the people around her particularly the very calm and cool Ren. When you combine a not so honest with his true feelings type of guy and one hell of dense type girl, you ended up being irritated. For instance, when Ren was talking about the girl he might have feelings with, Kyoko didn’t even realize that she was the one Ren was describing. Ren, who didn’t know how to show his happiness whenever Kyoko was involved and kept denying his feelings for her. After I finished watching it, I genuinely wish that Kyoko would finally let go of his hatred for Sho and forget about him so she can focus more on her career and her growing feelings for Ren. Though the only thing that I hate about her is that she can be so dense at times, this is mostly in the manga.  Not even realizing that some people are using her, taking advantage of her, letting Sho kiss her, and most importantly, not even realizing that Ren is in love with her. Well that goes for both of them not realizing that the other is already in love with the other. But then again, it is still amazing how both of them influences each other‘s life for the better.\\n\\n\r\nABOUT THE ANIMATION\\n\r\nAnimation is great. Some characters are really gorgeous looking and a lot of important scenes are made magnificently.\\n\\n\r\nAll in all, I enjoyed it a lot. Another great treasure for my collection. This series made me laugh, cry, fall in love and most importantly amazed. It would be a sin not to remember this series even after so many years. I am dying to see that next season!\\n",
            "date": "2012-12-09T00:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 79542,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79542"
        },
        {
            "content": "Skip Beat! is about showbiz, but our heroine, Kyoko, is climbing up the showbiz ladder for revenge. Yes, revenge!\r\nKyoko has been supporting her childhood friend, Shotaro, wholeheartedly all this while, sacrificing herself just for her one and only Sho. Sho is pursuing a career in music and is currently ranked 7th most popular male celebrity of Japan. However, everything changes when Kyoko overheard a conversation between Sho and his manager, where Sho insults Kyoko, saying that he only keeps her for her usefulness in housekeeping matters. Further fueled by Sho flirting with the manager, Kyoko vows vengeance, so Sho teasingly challenges her to overtake him inshowbiz.\\n\\n\r\nAnd that’s exactly what Kyoko sought out to do. She makes new friends (and maybe even one that is more than a friend) throughout her new career and on the way, slowly pushes away the vengeful feelings that overwhelmed her at the beginning. Will she ever learn to love again\\n\\n\r\nThis is a shojo that incorporates showbiz as well as a whole load of comedy. Kyoko isn’t your weak-willed heroine, she’s fiery and has her eyes set on revenge. Immediately after vowing vengeance, Kyoko went for a makeover and joins Sho’s rival talent agency, hoping to crush Sho at his own game.\\n",
            "date": "2012-11-23T22:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 78259,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/EmoAnimeGirl",
                "username": "EmoAnimeGirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=78259"
        },
        {
            "content": "Story \r\n 9/10\r\nI fount the story to be quite different from the usual Shoujo manga style. It was honest and had a nice feel to it.\r\nBecause of this difference I think I enjoyed it all the more. I have the say that the acting in this anime is the best I've seen yet. They make a big deal of the littlest details which makes you enjoy it all the more.\r\nAnimation \r\n 8/10\r\nThe animation isn't all that great- just the usual kinda. But they were able to show case the different expression beautifully. Especially the one that involved acting scenes. \r\nIt was light and humorous henceit suited the anime.\\n\\n\r\nSound \\n\r\n 7/10\\n\\n\r\nIt's actually addictive. Certain phrases and words are used so many times that they pop up in your mind when you least expect it.\\n\\n\r\nCharacters \\n\r\n 9/10\\n\\n\r\nSuperb and unique cast of characters with their own type of persona. Whether it's the non-believer of love Kyoko or the angel like smile Tsuruga Ren gives when he is angry. \\n\r\nYou fall in love with them and their uniqueness.\\n\\n\r\nOverall \\n\r\n 9.5/10\\n\\n\r\nThis is a must-watch anime. \\n\r\nIt's hilarious, sad, breath-taking and absolutely wonderful. \\n\r\nNOT YOUR TYPICAL SHOUJO MANGA! \\n\r\nThe main character Kyoko is different and very like-able. \\n\r\nHer story is different, as well as her emotions. \\n\r\nA plot to become famous to exert revenge on the boy she loved after she finds out that he was just using her as a stepping stone. \\n\r\nSome scenes were so funny that you continue to laugh long after you have finished watching it. \\n\r\nI absolutely love this anime. \\n\r\nThe only downside to it, is the ending. \\n\r\nIt ended too soon!! Which forces you to read the manga. \\n\r\nI hope they make a season 2 of this great anime.\\n",
            "date": "2013-01-14T21:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 83707,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2025461.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Amehsk",
                "username": "Amehsk"
            },
            "url": "https://myanimelist.net/reviews.php?id=83707"
        },
        {
            "content": "Absolutely hilarious anime concerning a teenage girl’s unlikely entry into show business. Her attitude is awful, her reasons are terrible, but little by little, she begins to find meaning in her pursuit. It’s a great show, but I appreciate it more because of the trail of inquiry it put me on. Basically, anyone and everyone can agree that in mainstream western entertainment, there’s a dearth of female-centered narratives (mothers, girlfriends of main characters, sex objects seem to be the norm). Anime/manga seems more open to the idea of female-centered narratives in general; this includes generic shoujo romance to something more radical and/or atypical like TheTwelve Kingdoms. The point is this: it’s rare to find modern narrative features/TV works that focus so largely on presenting the mindset/interior states of its female characters, and I’m finding more of this in anime/manga than anywhere else. Skip Beat! is a perfect example of this: a total genre pleasure (comedy) that never skimps on its character development, treats its main subject with dignity and respect (even when she’s acting like an idiot) and sports a fully-realized female creation that remains fascinating and entertaining. This is rare.\\n\\n\r\ncopied/pasted from my blog: www.thenextthingblog.wordpress.com",
            "date": "2014-01-01T09:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 126657,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2310035.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TheNextThing",
                "username": "TheNextThing"
            },
            "url": "https://myanimelist.net/reviews.php?id=126657"
        },
        {
            "content": "I have the pleasure now of reviewing one of the best anime I have ever seen. I believe I initially did not give Skip Beat a fair shot because of its ending but after watching it again I remembered how good it really was. I'm assuming you already know what Skip Beat is about so I'll get right into it.\r\nStory: 9.5/10\r\nSuch a fun and fascinating story with great plot progression. Revenge and show business are things that are always interesting to watch. Mix in beautiful men, beautiful (but crazy) women and inner demons and you have a winning recipe for a shoujo manga. \r\nThe onlything keeping me from giving the story a 10 is the ending. The ending is so abrupt, it leaves so many ends untied and so many possibilities left to explore that I cannot say I was at all satisfied. The series was so good that the ending left a bitter taste. But the series is THAT good that I couldn't score it any lower than a 9.5. \\n\\n\r\nCharacter: 10/10\\n\r\nThe protagonist, Kyoko Mogami, is one of the best female characters in any anime. She is strong, crazy, fun, loveable and not to mention, SUPER TALENTED. Her acting skills are captivating to watch, making the characters she plays come to life (whether it is intentional or not). Her ex-\" boyfriend\" Shou is the scum of the earth, but you can't help but like how detestable he is. Ren Tsuraga may be the perfect male lead and love interest to counteract Kyoko's craziness and ability. There is also a great supporting cast of characters. There was decent plot progression but again the ending disrupts that flow. \\n\\n\r\nArt and Sound: both 8/10\\n\r\nBoth suitable for a shoujo anime. The colors and background music were used so well to express emotions. \\n\\n\r\nEnjoyment: 10/10\\n\r\nOverall: 9/10\\n\r\nSuch an enjoyable anime with some of the most memorable scenes in any anime I've watched to date. Episodes 6,7,13 and 14 were so enjoyable that I watched them twice through before moving on to the next episode (and this review is based on a REWATCH...that says a lot). The over-the-top nature of the characters is so funny to watch but the true enjoyment in this anime is seeing the development of Kyoko's natural and unbelievable talent, despite being constantly underestimated. \\n\r\nIf this series had gotten a second season or even a couple more episodes, it would be a definite 10/10 as they just don't wrap things up well at all. \\n\\n\r\nI would recommend watching this anime despite its ending, as the manga continues the story and is still on-going..... meaning there is so much more of Kyoko to enjoy. \\n\r\nSimilar recommendations to this anime I would say would be Nodame Cantabile and Special A because they all have girls with natural ability who work on their talents and look up to the male lead who is gorgeous, talented and constantly making fun of her. \\n\\n\r\nTo be honest, I cannot adequately express how highly I think of this anime. I would suggest at least watching the first episode. If you are not laughing hysterically or automatically fall in love with Kyoko's craziness and longing for revenge, then this anime definitely isn't for you.  \\n\\n",
            "date": "2014-06-24T11:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 148389,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3300487.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TokyoCrazyPXD",
                "username": "TokyoCrazyPXD"
            },
            "url": "https://myanimelist.net/reviews.php?id=148389"
        },
        {
            "content": "Skip beat is an interesting shojo anime about a young plain girl named kyoko. She lives the simple life of a high school drop out, working at what essentially amounts to a McDonalds and living in a small apartment. The one main drive in her life is her, idol, her beloved Sho, the man of her dreams who carried her from her home to live with him. Sho treats Kyoko like dirt, and Kyoko simply enjoys being within the same room as him... That is until she finds him cheating on her with his manager. Kyoko is furious and confronts Sho, only to be toldthat she was a stepping stone in his career to further gain his own goals. Kyoko then does something different, she doesn't walk away silently, or break into tears. No, she turns into Satan himself, and swears absolute vengeance on the tard Shotaro. \\n\\n\r\nThus the adventure begins for Kyoko to become a better starlet than Sho could ever be. Now overall the story while being fairly originial and told very well, is overall pretty simple... a girls struggle to be the best form a very meager start. The art and music are also above average, but for the most part nothing spectacular. What makes this show stand out more than any other show is the main character herself, kyoko. So much effort is put into the series to show off Kyoko's very VERY unstable emotions as she varies from evil to happy to depression all within the blink of an eye. While the change in mood is sudden and unpredictable you can't help but laugh every time Kyoko has a argument with herself, to the disbelief of passers by.\\n\\n\r\nOverall the show is pretty good, and would be worth watching even if Kyoko wasn't the main focus, but it is Kyoko's outstanding character that really sets this show aside from any other anime.",
            "date": "2010-04-04T21:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 24675,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/312392.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/leingodf8",
                "username": "leingodf8"
            },
            "url": "https://myanimelist.net/reviews.php?id=24675"
        },
        {
            "content": "Skip Beat! is the charming and altogether hilarious tale of Kyouko, a young girl who gave up everything for childhood friend Shou, only to learn he was only “using her for convince” once he’s made it to fame. A passionate and energetic girl, Kyouko quickly changes the course of her efforts from serving Shou, to taking revenge on him. Of course, the only way she can do this is to also join show biz, and best him in the process. \r\nThus Skip Beat! begins. The story was nothing spectacular, though it was unique enough, however, the characters were what made the anime, especially Kyouko, withher laughable and intimidating “Dark Side” and her thirst for revenge. I would definitely recommend this anime. \\n\\n\r\nStory: 7\\n\r\nThe story doesn’t leave you breathless or shocked; there are no wrenching twists or highly complicated ideas or morals. Despite this, it flowed believably and at a nice pace, with enough catches and emotion to keep you watching and get you hooked. While not perfect, it was strong enough to stand on its own and was well-tempered. It was also very refreshing to watch an anime—especially one of this genre—that presented a character with such a passionate and hilarious motive, a motive that she held onto, even along with story progression and character growth. \\n\\n\r\nArt: 6\\n\r\nThe art was attractive enough and the animation, while far from perfect, was adequately done. My one problem was the way the two male leads were drawn from the front, which rendered them rather horse-faced and jaw-less. However, I eventually got over that, and they look fine in profile and such. The characters also spent a lot of time in Chibi form, however it was done cleanly enough, except for a few times when the characters changed right in front of you.  \\n\\n\r\nSound: 7\\n\r\nThe sound was decent, but it didn’t stand out. The creators did a good job of accenting the different scenes with catchy music, and the voice acting was well-done. There wasn’t much else to it. However, I found the opening and ending songs really annoying…\\n\\n\r\nCharacter: 9\\n\r\nI really loved that characters and the character development. They were really what made this anime for me. Kyouko is likable, humorous, and soon has you rooting for her. I also really enjoyed her passion and motivation, and was glad that, even as you watch her grow and come to love acting, she still hangs on to her need for revenge. Ren is also well done, because you can see his love for his job, and the reasons for the way he treats Kyouko. The way both of them interact and help each other grow was also very well portrayed. Throughout the story, they also reveal deeper reasons for the characters actions and give them all deeper motivation, which I appreciated and thought was nicely done. My one problem was Shou, as he is portrayed as a heartless enemy till the last few episodes, where the creators begin to show that however shallow he is, he may really care about Kyouko, and maybe there is something more too him. It felt “too little too late” and kind of sloppy. I am desperately hoping they continue the series with a sequel, so hopefully they’ll get cleaned up by then. \\n\\n\r\nEnjoyment: 10\\n\r\nI would watch it again. And maybe again…and again. I was laughing hysterically almost the whole time, and two episodes in I was dreading the end of the show. As I said, I’ll be waiting for the second season with big expectations. \\n\\n\r\nOverall: 8\\n\r\nIt was funny, unique and lovable. There were a number of faults, but I still think Skip Beat! Is worth the time. I know I, at least, enjoyed myself…\\n",
            "date": "2011-07-06T19:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 38786,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/507442.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MidnightSol",
                "username": "MidnightSol"
            },
            "url": "https://myanimelist.net/reviews.php?id=38786"
        },
        {
            "content": "Felt like writing a review of Skip beat.\r\nNow I really hate Shoujo style animes, but in this one it didn't bother me as much since they had lot of chibi moments.\r\nEven though the subject didn't intrest me at all, I was compelled to follow the story throughout the whole season.\r\nIt was repetitive at parts and very boring at times when the characters were just contemplating stuff over and over again.\r\nSo much to complain, but yet an 8? It was the story.\r\nEvery time an episode end, I just had to start the next one to see what happens. \r\nFor that. Thumbs up.",
            "date": "2010-06-24T07:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 27517,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/79377.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NumbNuts",
                "username": "NumbNuts"
            },
            "url": "https://myanimelist.net/reviews.php?id=27517"
        },
        {
            "content": "Kyoko is in absolute love with her childhood friend shou, who told her to come to toyko to fulfil is dream of being in the entertainment business. Being in love with him she accepts. After looking after him and paying the rent out of love, one day she goes to give him some food, but ends up hearing that he's just using her. She has a fit and screams i will have my revenge but he just laughs, 'what you gonna do get the entertainment business, you can't touch me'.\r\nIt's a total revenge get back at that son of a bitch story, where Kyoko sendsherself into to show business with the company of Shou's biggest rival, but failing her audtion she is put inside a club which does things for show business people who points for jobs\\n\r\nSlowly she tries harder and harder to work out his downfall as she gets further and further into the business, she finds new talents and gains new friendships\\n\\n\r\nIt's an awesome story and i totally recommend it, i loved it so much, i cried there wasn't a second season\\n\\n\r\nI hope my review didnt spoil it much",
            "date": "2010-04-22T09:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 25313,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287823.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chiXcookie",
                "username": "chiXcookie"
            },
            "url": "https://myanimelist.net/reviews.php?id=25313"
        },
        {
            "content": "After reading the synopsis of Skip Beat, I hesitated a bit before give it a try but I ended up loved this anime a lot.  I liked the storyline which sets in the show-biz industry instead of plain boring school life comedy.  \r\nThe characters in Skip Beat are pretty well developed.  Each of them have a unique depth of history and how each character changes.  \r\nI wish there will be a second season coming soon because the ending was not satisfy at all.  The ending seems to be a rush and didn't explain what happens next.  Especially, how willKyoko continues to make her way to become a top actress, what happen to the relationship between Kyoko and Corn, did people recognize Kyoko's performance in Dark Moon as Mio...  All these questions are remain unknown.\\n",
            "date": "2010-09-28T20:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 30886,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/289106.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/riec",
                "username": "riec"
            },
            "url": "https://myanimelist.net/reviews.php?id=30886"
        },
        {
            "content": "Eternally selfless and loving Kyoko devoted her whole life to helping the man she loves achieve his dream of becoming a rock star. Only to one day overhear him bashing her opening admitting to using her and hitting on another woman. You know what they say, \r\nHell Hath No Furry Like A Woman Scorn. Something inside her snaps (or rather opens in this case) and she is reborn a new person with an unquenchable thirst for revenge and demon minions to aid in her quest. Unable to get close enough to him to settle her vendetta Kyoko decides to enter show business so she canpersonally ruin his life the way her the former love of her life ruined hers.\\n\\n\r\nSkip beat is surprisingly mature for a Shojo, walking the fine line between love and hate with tact and realism. It takes on fairly complex subjects but does so with lightheartedness and great sense of humor. At its core, it’s your standard coming of age story about a young woman discovering who she is. And Like your traditional, shojo there is still a romantic element to the story but, in many ways, that is secondary to Kyoko’s own personal journey. The character development is what really makes this anime so great; not just the star but all the characters are fully fleshed and well rounded. From self-centered rock star who broke her hear, to her reluctant best friend, to her flamboyant/eccentric boss, to the 8 occult loving 8 year old that haunts the talent agency, to the stoic workaholic movie star who becomes her new potential love interest all the charters endearing to watch. Even the career path Kyoko chooses (which I wont name to avoid spoilers) is presented in a way that will make the audience fall in love with it as much as Kyoko does.\\n\\n\r\nThe animation is solid with a lot of bright colors, although it does use the simplified chibiesqe character design for comedic effect occasionally.\\n\r\nThe music is nothing to write home about; its neither impressive nor annoying, it simply serves as ambience.\\n\r\nAs far as I know its only available in subs but the Japanese voice acting is great and there is an outstanding fan sub on youtube (just the first episode, sorry) that I invite anyone to check out.\\n",
            "date": "2011-04-07T19:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 35794,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/moxieme",
                "username": "moxieme"
            },
            "url": "https://myanimelist.net/reviews.php?id=35794"
        },
        {
            "content": "Skip beat.. i like this one too it's about a girl who wants to have a revenge by getting into showbiz.. story goes on she gained friends learn a lot of things in her experience.. this anime is worth the watch.. but i hate the ending though..\r\nit didn't relly finish the anime :c but i heard that there is a 2nd season of skip beat.. i hope it's true ;)",
            "date": "2011-04-11T20:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 35952,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/472346.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/princephoi20",
                "username": "princephoi20"
            },
            "url": "https://myanimelist.net/reviews.php?id=35952"
        },
        {
            "content": "Dont say crap about a really good anime. The drawings are better than a lot of animes out there lets see you draw better over and over again like the artists has to do.\r\nur mean :(\r\nanyways this anime/manga is really good if your into comedy romance/showbiz types of stuff\r\nits about this girl named Kyoko who joins showbiz for revenge against her crush Fuwa sho (a singer).She meets Ren Tsugrura(think i spelt tat wrong)\r\nand later they fight for her love,but shes too dense to notice.",
            "date": "2009-03-28T17:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 13556,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/82480.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mardog1993",
                "username": "mardog1993"
            },
            "url": "https://myanimelist.net/reviews.php?id=13556"
        }
    ],
    [
        {
            "content": "This anime was so good , It would still be successful if they made a reality T.V. show out of it. The plot is a bit overused at first but you can never tell what the characters are thinking. They are so unpredictable it just sucks you in. Hint : Kyoko defies odds. I think you'll love her the most.",
            "date": "2011-10-27T08:28:00+00:00",
            "helpful_count": 0,
            "mal_id": 46297,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/755627.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ally_taichou3",
                "username": "Ally_taichou3"
            },
            "url": "https://myanimelist.net/reviews.php?id=46297"
        },
        {
            "content": "Skip Beat can only be defined as a treat from the shoujo genre. When I watched this I remember thinking \"How have I never even heard about this show?\". Skip Beat is just another show that deserves hype but doesn't get it.\r\nSkip Beat is about Kyouko who follows her childhood friend Sho to Tokyo when he becomes a music star. She dedicates her life to him but he only uses her and then tosses her aside. Kyouko not allowing herself to be thus insulted vows to get revenge by becoming more successful than him in the entertainment industry and begins acting for his company's competitor.\\n\\n\r\nStory: 8\\n\r\nYes this is yet another shoujo about being a star in Japan's entertainment industry but unlike others it focuses less on the idea of being a star and much more on what it means to be an actor or actress. The anime displays acting as an artform and applies to it the wonderful Japanese perspective of everything being beautiful. As an active participant in theatre myself I could really understand and admire Kyouko's love of acting. I could also appreciate how realistic the anime was in that it explained the characters actions in the present by showing what had happened in the past to make them that way.\\n\\n\r\nArt: 8\\n\r\nThe art is good just kinda awkward in some places but appeasing enough to the eye.\\n\\n\r\nSound: 10\\n\r\nThe music is very good and compliments the anime. The voice acting is fantastic and really helps provoke emotion.\\n\\n\r\nCharacters: 10\\n\r\nThe characters make this anime each of them grows and works through problems of the past and present. They are all strong characters and it's really easy to appreciate their struggles.\\n\r\nWhen I first started watching I didn't really like Kyouko. I remember thinking that she overreacted when Sho used her and that she should have just gone on with her life and that revenge was stupid. I also thought she was stupid for not realizing she was being used in the first place. But in the end I loved Kyouko because the anime explained to me why she had done all those things and while the reasons may have been stupid you could really sympathise with her. Kyouko is actually a great character she's determined, intelligent, strong, and just plain awesome for a shoujo lead.\\n\r\nI liked Ren right off the bat because he was so down to earth and you just don't find that kind of calm maturity in many shoujo. While he has problems he mostly settles them in the quietness of his mind rather than displaying them to the whole world. I also liked that while he was serious he was also kind and even though he doesn't really need to grow as a character he still does.\\n\r\nSho is nothing but a spoiled teenager that you are set up and meant to hate but in an interesting twist of events I found myself actually caring about him. Rather than in most anime the antagonist is not clearly defined at first you think it's Sho but end up realizing its just life. Sho has common weaknesses that almost everyone struggles with and while those weaknesses originally make him the bad guy they are eventually twisted into making the audience sympathise with his struggles. In the end you realize that he isn't a bad person or character. This kind of well thought out deep and dynamic character is what makes this show good.\\n\r\nAnyway this show has awesome characters.\\n\\n\r\nEnjoyment: 10\\n\r\nI really loved this anime. At first when the groundwork was being laid I didn't really know what to think and almost quit after the second episode but I'm really glad I didn't because its awesome. Part of what threw me off is the very Japanese sense of humor that was more extreme than I had ever seen but after I got used to it I would almost bust a gut laughing at every random hand coming from mouth clip (and there are quite a few of these). I have rewatched this two times and it never gets boring.\\n\\n\r\nOverall: 9\\n\r\nThis is definitely up in my top shoujos and even in my top ten overall anime. I liked it as much as fruits basket and in some ways more because the main character was more realistic. It has a good story and wonderful characters and should simply be watched and enjoyed.\\n\\n",
            "date": "2013-10-30T19:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 118821,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hikari1414",
                "username": "Hikari1414"
            },
            "url": "https://myanimelist.net/reviews.php?id=118821"
        },
        {
            "content": "This is one of my favorite animes for sure. It even got me into reading the manga by reading it. The manga however did a tailspin for me and I had to stop. Though honestly I would have loved to see a second season of this. They stayed pretty original to the manga. The style is even almost the same except a few anatomy fixes which is great. Despite that the anatomy is still a bit off but it's part of the charm. \r\nThe animation holds up even after all these years though of course it still looks a bit dated. The anime itself isabout a girl following \"the love of her life\" to a big city and helping him get famous. That ends badly and it unlocks her pandora box of sorts and she wants revenge. So she joins acting and vowed to become more famous than him. \\n\\n\r\nIt's honestly such a funny anime that you can't help but laugh. You fall in love with the main character though she does follow the typical tropes. Not very smart, clumsy, a bit of a crybaby at times. If you look at her traits on paper it's nothing special but when you watch the anime you notice things about her that make her completely unique. You want her to succeed and find her true calling. \\n\\n\r\nYou end up rooting for her and watching a nice budding romance. The romance is what made me want a second season the most. Ren the brown haired male is by far one of my favorite characters and the way the two interact is beyond adorable and hilarious. It's a great anime from start to finish and it'll have you laughing and feeling for the girl. \\n\\n\r\nIt's a wonderful adaption to the source material that will keep you entranced. If you loved the manga you will love this and if you love this then I suggest giving the manga a try though it is very long. Over all this is one of my favorite animes and I wouldn't mind watching it a 3rd time.",
            "date": "2018-02-27T13:05:00+00:00",
            "helpful_count": 0,
            "mal_id": 272590,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6804054.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/faerefly",
                "username": "faerefly"
            },
            "url": "https://myanimelist.net/reviews.php?id=272590"
        },
        {
            "content": "One word thats most fitting for this anime would be captivating.\r\nActually i was rather surprised by this anime. I posponed watching it for at least 2 years thinking I wont like it too much. Well, I couldnt be more wrong!\r\nThe Story:\r\nThe whole story revolves basically around 3 characters: Kyoko, our female MC, Ren, who is considered a great actor and last but not least Sho, who made his name in showbiz by singing.\r\nBasically Kyoko, who is discribed as a wallflower by other co-workers lives pretty much only for Sho BUT thats going to change the moment she overhears what Sho really thinks about her. Thenshe wants revange, so she tries to become famous and actually manages to get into LME the same agency as actor Ren. So we follow her around as she tries to climb to the top and her feelings of revange start to get replaced by the love for acting and ofcourse her growing feelings for .......... :p (though for the last one you have to read the manga..)\\n\\n\r\nNow to be honest i found episodes 2-4 a little bit annoying. The reason? How Kyoko got into the agency just didnt make any sense to me. But .. its an anime so I guess its to be expected not to be 100% realistic xD\\n\r\nBut other than that I can mention just another 2 negative things about this anime:\\n\r\n1. No season 2 :'(\\n\r\n2. The anime stops exactly where the real romance actually starts, so that the romantic moments are rather rare.\\n\\n\r\nBUT none of these points are that important (although I normally hate it if an romance anime has not enough romace)! \\n\r\nI personally think Skip Beat! is well made. I like the characters even the supporting cast was so funny and their feelings where relatable. There were moments I had to laugh, I was angry and I was completely captivated. I was so absorbed, when the ending music started (really like the song in English and Japanese^^) I felt like I was woken up from a trance like state xD I love animes where not only the male but also the female MC is talented, strong and smart. Kyoko definetely is all of the above! Especially after episode 13 or so I couldnt stop watching. Actually I finished Skip Beat the same day I started it. When Kyoko is acting, its something else. \\n\r\nYou also see character developement not only between the 3 MCs but also with the supporting cast. The pace was perfect not too fast, not too slow.\\n\\n\r\nIf you want to know how this story ends just read the manga. I rarely read mangas mostly because Im too lazy and I easily get bored. Well guess what! With Skip Beat I never get bored. Its rather hard to stop reading :p I enjoyed the anime as well as the manga. (Also Rens backstory is rather intresting.)\\n\\n\r\nSoooo if you're looking for a funny, slighty romantic, most of the time easy going and highly enjoyable anime to watch I highly recommend you this one!^^",
            "date": "2018-06-21T20:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 281807,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7051799.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Astarte33",
                "username": "Astarte33"
            },
            "url": "https://myanimelist.net/reviews.php?id=281807"
        },
        {
            "content": "The plot and characters were awesome! This storyline wasn't very outstanding but the author managed to capture my attention and keep it there. At first I had thought that this was going to be heavy on the romance  with a lot of parts where the main character would humiliate herself in front of her love interest. I was wrong!\r\n     Even though the story did include romance, the main point was more about life and what true acting was. I believe the author did really well with the story and made it into something new and unseen before. The art wasvery good, and the characters were drawn extremely well, the main characters were all so cool and beautiful! (Especially Tsuruga Ren and Fuwa Sho) I really loved the artist's drawing style because the people looked real at some points but sometimes their faces were like little blobs, that was part of what made it so hilarious. Many of the outfits and items were absolutely gorgeous and the detail included was beautiful.\\n\r\n    I liked how instead of a cute, slightly dumb, but treated nicely be everyone the main character Kyouko was tough, wacko,extremely scary,very childish, but a person who would work hard for her goal. (Even though it was a bad one)\\n\r\n     I loved this anime and it is one of my favorites, I would recommend this for people who love seeing the main characters kick butt and have fun doing it.",
            "date": "2012-08-09T13:31:00+00:00",
            "helpful_count": 0,
            "mal_id": 69231,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cloverpntzy",
                "username": "cloverpntzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=69231"
        },
        {
            "content": "This anime is one pleasant surprise. I was not really looking forward to watching it, especially with a somewhat boring title, but I was curious because of the high scores given in the reviews.\r\nSound: 7 - There are 2 OP and ED songs and they were catchy enough. Background music was just okay for me also.\r\nStory/Art : 8 - At first, this would be a story of revenge. However, as the it progresses, it becomes a story of self-fulfillment and self-realization. The characters were pretty in an unconventional sort of way. All the men seem to have long limbs and long faces. The women werefrom cute to sexy (but not offensive). I love the 'chibi' parts because it makes the scenes funnier.\\n\\n\r\nCharacters/Enjoyment: 9 - We learn a lot about the main characters - their personality traits, weaknesses, (little) history - and that is what makes it so engrossing. The voice actors did a beautiful job since the 'acting' parts will really suck you in and make you feel that they were indeed actors. Those scenes were moving.\\n\\n\r\nOverall: 8 - I loved it, yes! I guess, I scored it an 8 because of the ending. Though, it was just right since you would definitely want more. For me, I simply did not want it to end... not at the 25th episode, at least. I might just pick up the manga... :)\\n",
            "date": "2012-06-20T04:08:00+00:00",
            "helpful_count": 0,
            "mal_id": 63885,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BBHood22",
                "username": "BBHood22"
            },
            "url": "https://myanimelist.net/reviews.php?id=63885"
        },
        {
            "content": "I typical don't enjoy animes with female leads, nor even try to watch them and i actually normally stay away from them. As anyone who start to watch this Anime, you will notice it seems that the creators of the show intended for a female audience. However, i've personally enjoy it, as for comedy, its not the funnest show you're see, but it is enjoyable and the animation is part of what makes the show funny. \r\nAs for the story, i didn't notice anything out of place, where something didn't make sense, well make sense \"in the anime world\" i mean. Overall i enjoyed it,everyone show at least try out the first episode, also as an audience, i began to enjoy the female lead and i think that what kept me watching, and the fact that there were no other good animes release at that time.",
            "date": "2009-11-21T20:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 20730,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/67552.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VincentLaw",
                "username": "VincentLaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=20730"
        },
        {
            "content": "Skip Beat was a good anime which I happen to come across. I love it. The first episode made me attract to it. Like none other anime, the storyboard was very original and unique. It just make you want to watch more. I would really recommend everyone to watch this anime!!!",
            "date": "2009-11-30T05:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 20980,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232280.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sakura-Hinamori",
                "username": "Sakura-Hinamori"
            },
            "url": "https://myanimelist.net/reviews.php?id=20980"
        },
        {
            "content": "I started watching this anime beacuse I wanted to watch something funny with a strong female character but I never expected to like it this much. The story is great and different I enjoy watching the main character trying and succeding in her goals. I like the supporing characters a lot too. Each one is just like her but in a different way and with she just being there everyone of the character show a different side. In overall the anime is oustanding the only problem is that it doesn't have quite an ending. It is a shame that they didn't continue the anime butin any case you can read the manga. I don't read manga but I have found out a couple of things that happen after that sound great. The anime is one of the best I have watched I enjoy from begining to end it is a must see.",
            "date": "2012-06-12T08:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 63251,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1321411.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lexie13",
                "username": "lexie13"
            },
            "url": "https://myanimelist.net/reviews.php?id=63251"
        },
        {
            "content": "The first time i heard about skip beat having an anime version i've been dying to watch it.... I first read the manga of this and it's really nice although at first i was really reluctant because of the first part of this series.....But when you start to watch it you'll get hook in it....I just hope that there'll be a 2nd season for this anime...",
            "date": "2009-03-30T22:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 13639,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/brentine",
                "username": "brentine"
            },
            "url": "https://myanimelist.net/reviews.php?id=13639"
        }
    ]
]