[
    [
        {
            "content": "Dagashi Kashi is that show that just doesn't stop giving you diabetes. Take that literally or not I mean it both ways. This season in particular was much better than the last especially since we got an excellent new character (Owari Hajime) along with Beniyutaka and the hilarious shenanigans just went on.\r\nI was quite skeptical of the studio change since the previous studio did a fine job and I was with the thought that Tezuka Productions couldn't manage such a show and couldn't bring it to greater heights. Let's just say I couldn't be more wrong. This season was a positive step up from thelast in that we got more jokes, more characters, less focus on the sweets jargon and a reinforced and improved cast that was just as brilliant as they were weird. I just couldn't stop laughing in this season at everyone compared to the last where I was seen Google searching the sweets for a but of context or relying on HorribleSubs to footnote the references for me to understand (not unlike Rumbel for Gintama) so I consider this a plus point. Then we had the sudden disappearance of an important character but to be honest I found that disappearance better since that departure led to further introductions of new characters like Owari Hajime and Beniyutaka who were vibrant, cheerful, unique and as mentioned hilarious. Did I mention they were also weird like everyone else? \\n\\n\r\nOwari Hajime's Character was that of a klutz I had perceived but she too had her amazing moments such as with the 8 candy and the website madness. Although I felt she was slightly more used for fanservice than I expected from last season but thankfully it wasn't overused to the point that it would deter us from the main point of view, literally. As for Beniyutaka, he was voiced by none other than Sugita Tomokazu and I think I only need to tell you his other roles and you'll know just how talented this fellow is, he played Gintoki (Gintama) and Kyon (Haruhi Suzumiya). Two very popular and fantastic roles. Apart from Sugita, the other voice actors did brilliant and I enjoyed the exaggerated expressions used in some of the scenes.\\n\\n\r\nScenes reminds me of the art. Now since this is a studio change as I mentioned before, the art changed as well, although not too drastically on the backgrounds the character designs looked clearly different from last season like for example the way the eyes looked this time. The eyes were more stretched than last time and I don't think this is a plus or minus since the characters' eyes were stretched last time as well, although not as much as this season. Apart from that the OP and ED used was unsurprisingly Dagashi themed. They were as playful as before and to be honest I was already addicted to the OP like 3-4 episodes in. As for the ED, well brilliant as always. Thankfully the Background music for the show didn't change from last time so it wasn't something that would need to get used to.\\n\\n\r\nSince there's little to no plot relation from last time I can easily advise others who haven't watched the previous season to view this first since they won't lose any context by watching this first. If they find this interesting then I'm sure they'll like season 1 as well, albeit some may find the Dagashi jargon a bit on the difficult to understand side. Regardless, both seasons were amazing, but personally I find this superior for the aforementioned reason as it's easy to understand and yet still such a beloved joy to watch.\\n\\n\r\nThis season was pretty interesting for me, since we had a different set of anime and I had maybe 2-3 sequels only out of which Saiki Kusuo and Dagashi were included and frankly the sequels this season didn't disappoint me one bit. Maybe because with sequels you know what is going to happen and if you're not a masochist you'll usually watch sequels if you liked the previous one (talking about people planning to watch that Isekai Smartphone sequel because it won't be good I tell you now). \\n\\n\r\nDo you want a show that makes you laugh and give you a little but of cultural knowledge? How about watch an anime all about sweets? Funny Characters and no plot to worry about? If that's the case then I give you a guarantee that Dagashi Kashi 2 won't disappoint you. Sometimes some shows don't handle endings well since Japanese sources generally are bad at endings from what I've experienced and heard (not trying to be racist here but it's what I've seen, it's like saying the Ancient Greeks loved happy endings or the Romans loved watching people fight in the Colosseum). Point is, if you're wanting to watch a funny slice of life anime, look no further than Dagashi Kashi because there's lots to laugh about at Shikada Dagashi! \\n\\n\r\nThe likelihood of a season 3 is very minimal since it's rare to see a niche title get two seasons in the first place but Dagashi fortunately received one. So there's still an inch of hope we get to see a season 3 so I have my fingers crossed. Do you?\\n\\n\r\nOverall Rating: 8.2\\n\\n\r\nP.S: Man I just LOOOOVE that ending!!! So brilliant! I won't spoil it but it was so amazing and Dagashi-like!",
            "date": "2018-03-31T08:10:00+00:00",
            "helpful_count": 33,
            "mal_id": 275864,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=275864"
        },
        {
            "content": "Let's be clear - I never thought that this series could get a 2nd season. No one thought, I believe. First season of Dagashi Kashi has been portrayed in the minds of people as \"12 episode sweet commercial\", but the second is something a bit different. I'm going to only compare it to the first season.\r\nThe story remains the same, there is Kokonotsu, whose dad wants him to take over the dagashi shop, there is Hotaru, who spends most of her time with him while telling him the story of sweets, and there are also Saya and To, who spend a lot of time withthem too and, of course, there are japanese sweets (and sometimes toys). The main difference between the story in the first one and the second is that... There is drama in this one. Drama in Dagashi Kashi, yeah.\\n\r\nKokonotsu fell in love with Hotaru and even forgot that he DIDN'T want to become a shop owner. After Hotaru lefts the town, he gets really depressed and that's when Kotoyama finally opens the door for the new characters, who are Hajime and Beniyutaka. While the second one doesn't really have much screen time, Hajime really shines. She is the one character who made this season as funny as it could be. Every scene with her is hilarious and she blends in with other people really well.\\n\\n\r\nThe biggest changes in this season are the new art style and shorter episode duration. \\n\r\nAt first, I didn't like the art, but after watching one episode it was proved that I was wrong. All characters (Except for Hotaru, I guess, she was gorgeous in the 1st season) look AMAZINGLY good. Background art is on point too. The art shouldn't be something that can make this series bad.\\n\r\nAs for the episode duration, it... also made the series better. The main point of Dagashi Kashi is promoting sweets while telling you it's history as you watch characters interact with each other, and some episodes in the first season were boring because this anime does not need to be 20 minutes long to do it's job.  \\n\r\nMy only complaint for this series would be TOO much fanservice in the first episodes. I mean, you're 2 episodes in and you already see Hotaru and Saya in one bath.\\n\\n\r\nAs for now, I think that second season is even better than the first one. It is more enjoyable and fun, while also remaining \"educative\" for those who want to know more about sweets.",
            "date": "2018-03-30T20:09:00+00:00",
            "helpful_count": 25,
            "mal_id": 275822,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5923758.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ne_gible",
                "username": "ne_gible"
            },
            "url": "https://myanimelist.net/reviews.php?id=275822"
        },
        {
            "content": "Dagashi Kashi s2 is a fun watch. \r\nWon't lie that I'm disappointed per episode being 12 mins. But it's enjoyable. The characters are fun to watch. Yes indeed most of the screen time in went to the advertising of food/chocolates. But it still has some sparks of romance that makes me want to watch the next episode. It has some added comedy too which is always nice. \r\nStory 5/10 \r\nSame story as first season. Hotaru comes describes a random food and the episode moves on from there \r\nArt 7/10 \r\nWon't lie I think the season 2 artstyle is better then the first one. The charactersare drawn nicely \\n\\n\r\nSound 6/10 \\n\r\nIt has some ost that are good and op and ed are well done but nothing worth saying. \\n\\n\r\nCharacters 8/10 \\n\r\nThis is the main reason to watch the show. Hotaru never ceases to amaze me. Saya and Kokonotsu are also fun. Can't forget Kokonotsu's dad who is still funny. \\n\\n\r\nEnjoyment 8/10 \\n\r\nI'm enjoying Dagashi kashi s2 yes indeed it has problems like the first season. But can't deny my enjoyment. \\n\\n\r\nSo should you watch it ? yes you should. If you liked the first season then you will like this one too. You didn't watch the first season ? then I would recommend finishing other anime before watching both of the seasons.",
            "date": "2018-02-03T06:01:00+00:00",
            "helpful_count": 19,
            "mal_id": 270500,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5349480.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Rezolut1on",
                "username": "Rezolut1on"
            },
            "url": "https://myanimelist.net/reviews.php?id=270500"
        },
        {
            "content": "To be honest: I'm disappointed with the second season of Dagashi Kashi so far( I'm on the fourth episode).\r\nI was looking forward to the second season because I was really enjoying the first one but I don't know, I feel like it's totally different.\r\nThe story still tells about sweets but it's told in less interesting way and there is more lovey-dovey stuff.\r\nWe were told from the beginning that characters are gonna look different from the previous season but it can be really bothering if you got used to the art of the first season. \r\nSound is similar, nothing really changed and it's quite good, openingis still kawaii.\\n\\n\r\nCharacters: they are funny and Hotaru is still weird but appealing in some way.\\n\\n\r\nEnjoyment: Well... I'm not waiting for each episode as I used to when the first season was airing.\\n\\n\r\nOverall: I would give it 6/10 because of simple sentiment.\\n\\n\r\nWould I recommend it? If you watched the first season, I would watch it because of curiosity and because of Hotaru.\\n\\n\r\nHope you liked it :)",
            "date": "2018-02-06T05:07:00+00:00",
            "helpful_count": 14,
            "mal_id": 270801,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5212507.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/antabakax",
                "username": "antabakax"
            },
            "url": "https://myanimelist.net/reviews.php?id=270801"
        },
        {
            "content": "Compared to season 1 there seems to be more story rather than just bits and piece thrown in with candy history. (Although there is still plenty of that too) \r\n   The characters are all great, and have their place in the show, and although the art style has changed a bit from season 1 I still find the show very enjoyable!\r\n   I am sadden that the run time was reduced to around 12 mins, but that can't be helped. (We are lucky to get a second season some shows don't)\r\n   Also this show is alwaysgreat for a laugh or two, and plus you can never get enough Hotaru!",
            "date": "2018-02-25T04:57:00+00:00",
            "helpful_count": 13,
            "mal_id": 272427,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5385307.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ZBRAillusion",
                "username": "ZBRAillusion"
            },
            "url": "https://myanimelist.net/reviews.php?id=272427"
        },
        {
            "content": "Dagashi Kashi is back and with some changes but changes are for the better!\r\nMild Spoilers ahead...\r\nNow the changes from the first to second season is from the studio change from Studio feel. to Tezuka Productions and with their changes they have changed the slick shiny character designs of feel to a flatter color palette to Tezuka but still looks good to look at and the most obvious change being the change from a 22 minute episode to a 12 minute one. Now the change of less screentime to Dagashi Kashi 2 is actually a good move as the first season of Dagashi Kashi had somefiller episodes within it's 22 minute screentime, while it's second season's 10 minutes however gets more focused as well as the heavy change to the second season's plot that occurs, so cutting the fat of the filler and being more focused is a good outlook of the second season of Dagashi Kashi. \\n\\n\r\nDagashi Kashi 2's plot still has it's comedic skits with it's various Japanese candies but the plot \"thickens\" halfway through the anime, that of the downside of Dagashi Kashi 2's plot...Hotaru Shidare just disappearing. This definitely changes some things mainly of Kokonotsu's trying even harder to make the dagashi shop work AND how about having a convenience store to be Kokonotsu's rival AND to substitute Hotaru's absence, Hajime Owari voiced by Chinatsu Akasaki, another \"sorta\" love interest but also Kokonotsu's in-shop employee of his dagashi shop. Yeah ALOT of this changes in this second season. Now for the most part these changes do affect the majority of this season especially Hotaru's absences is telling of Kokonotsu's love for Hotaru and even gives Kokonotsu to strive to both manage the dagashi shop because of his lingering feelings towards Hotaru and his initial goal of being a mangaka. Hajime Owari herself is also a good addition to the anime having great chemistry to the entire cast, Hajime almost being a mixture of Saya and Hotaru, so you can tell her having the chemistry work is a given. Now the final new character of this second season would be Beniyutaka voiced by Tomokazu Sugita being the owner of the convenience store and rival to Kokonotsu's dagashi shop and well...he's not a rival per say as he mostly wants tips from Kokonotsu in having a convenience store in the boonies still his eccentricities and those eyes...reminded LA of someone...but who.\\n\\n\r\nThe animation done now by Tezuka Productions have some minor changes especially with the flat yet similar character designs but still keeping the backgrounding on par with feel, but for the most part, LA did like the new changes to the character designs and even the shift in animation studio's, LA WOULD wanted Studio feel to do the second season with their polished and slick character designs but LA is still happy with Tezuka's either way.\\n\\n\r\nNow the voice acting, well LA has been watching the Funimation dub of it as well but first the Japanese. LA was always ok with the Japanese, with all the genkiness and comedic timing down pat and what with the second season going into more plot heavy dramatic moments, the only two voice actors for those were Ayana Taketatsu and Atsushi Abe as Hotaru and Kokonotsu respectively. Manami Numakura was great as always as Saya as well as Keiji Fujiwara as You and Tatsuhisa Suzuki as Tou. New voice actors like Chinatsu Akasaki as Hajime was a great addition to the anime as again Chinatsu had some great character chemistry with Abe and Manami and the over-eccentric Tomokazu Sugita as Beniyutaka was also welcomed, like it's Tomokazu Sugita going genki hammy as hell, what's not to love. Now the obvious elephant in the room would be because of Hotaru's mysterious absences, also means Ayana herself had less screentime as a result and LA did kinda felt that to the point LA was kinda missing Hotaru much like Kokonotsu himself did. Kinda makes you appreciate Hotaru and Ayana's genki vocals that much more. \\n\\n\r\n*ahem* on the Funimation side of things well same thing happened with Tabitha Ray due to her voicing Hotaru and LA missed her as well but still great to see her reprise her role as Hotaru. Sara Ragsdale, Justin Pate and Jeremy Inman were great in their respective roles as Saya, Tou and You and LA didn't expect Caitlin Glass to voice Hajime in the dub, LA was expecting Lindsay Seidel to do it instead but nonetheless Caitlin voicing Hajime was still on par with her Japanese counterpart nonetheless and Christopther Wehkamp as Beniyutaka was also welcomed though almost as genki as his original Japanese counterpart. The voice cast really on both the original and the dub was excellent despite some upsets no thanks to the major changes to the plot.\\n\\n\r\nDagashi Kashi 2 for LA is an excellent second season by effectively removing NEARLY all the flaws of the first season by condensing the screentime and plot to 10 minutes per episode as well as giving the plot of Kokonotsu as a character more purpose as a result, but still keeping the flavour of the original Dagashi Kashi intact with it's comedy with it's dagashi knowledge while keeping fresh with new developments in terms of plot and characters. Even if the second season's removed some of the flaws of the first season and it brought up it's own little flaws here and there, LA does see the second season of Dagashi Kashi as an improvement from the first season as a result, even at the cost of one character's screentime drastically reduced and the plot being more focused.",
            "date": "2018-03-30T20:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 275826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=275826"
        },
        {
            "content": "If yr here looking at S2 reviews, you probably already know the deal, so I'll get right into it.\r\nThe mostly new crew in charge of the second season managed to pretty much capture the same look and feel of the first season barring the addition of two new main characters, and one BIG difference—the episodes are only 12 minutes a piece instead of 24. They ended up getting away with this change easily enough, though, because the first season spent so much more time getting viewers acquainted with the original cast of characters.\r\nThere’s a line in the first season that goes something like “…the significanceof a dagashi shop. Not only is it a place for relaxation, but also a place where bonds are created by interacting customers. It’s a place that creates connections among people.”\\n\\n\r\nThis line represents the very essence of Dagashi Kashi. While the first season moves along at a pretty slow pace, it develops connections¬ between the characters themselves, and also between the characters and the audience. Season two then molds those relationships into something truly entertaining. Together, they combine for a subtly sweet mix of slice-of-life storytelling coated in educational opportunity, then sprinkled with just enough drama to keep it interesting.\\n\\n\r\n7.5/10",
            "date": "2018-04-18T10:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 278395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7112679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PrettiBoiSlim",
                "username": "PrettiBoiSlim"
            },
            "url": "https://myanimelist.net/reviews.php?id=278395"
        },
        {
            "content": "so this is the sequel and personally I enjoyed it more,  and to make it short it's becuase everything was done in a decent way, i'm not saying that the previous season wasn't but this is more better.\r\nthe story happened after season 1 with some random things going on and new candies (dagashi) to be introduced, but of course, but unlike before they put a little drama here, and yes I'm glad that they gives us a little something on Coconut's dream of becoming a mangaka, though I think they still lack story there regarding on convincing him to stay.\r\nthe characters are pretty muchthe same but now we see a little side of them as Saya being concerned with coconuts, also this is m oppinion, Hotaru and Tou we're getting kinda stale, and Coconut's father as well as Yutakabeni..well there's nothing to say to them.\\n\r\nHajime is my favorite character here though she's complex, she can be dumb but can be smart as well, not in a typical way, she just can sense whether coconuts is sad or something.\\n\r\nmy favorite change though is that it's only 12 minutes long..to make it short I think they did the right pacing this time..but still there are plot holes like Hotaru and Yutaka are siblings?\\n\\n\r\nanyway if you like a enjoyable anime with not much to say then I suggest you watch this",
            "date": "2018-05-11T02:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 280271,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=280271"
        },
        {
            "content": "TL;DR Dagashi Kashi Final Rating: 6.5/10\r\n    An above average show, especially considering its first season. Its 12 minute episode length makes it a far easier because its quick, sporadic humor finally feels fast in its pacing. Except, it still has its problems from its lack of awareness pertaining to its depth and emotional cues. Dagashi Kashi's second season tries to stymie this problem with the introduction of two new characters. But, the introduction of those characters and the improved pacing doesn't offset the fact it is a pretty bland show when Hotaru and Kokonotsu aren't interacting. There is not a reason towatch this show when there are better options like \"Bokura wa Minna Kawaisou\" ; \"Haiyore Naryuko-San\" ; \"Barakamon\" to name a few, that focus of character interactions between a singular or few eccentric characters that foil the MC. Dagashi Kashi is not a bad show, persay. That does not mean it's a good one either. \\n\\n\r\n----------\\n\\n\r\nThe first season of Dagashi Kashi was... well boring. It was repetitive, and its 24 minute episode length was far too long for a show that is mainly character interaction and exposition about Japanese sweets/candy. It may sound interesting to hear Hotaru or Kokonotsu talk about the history of various Dagashi, it can get overbearing when it lasts for over 20 minutes.\\n\\n\r\nLUCKILY~~~ The producers cut the screen time for Dagashi Kashi in half, literally. Moving from a 24 minute format into a 12 minute format. This actually helps the viewing experience of this anime tremendously. The exposition is shortened by a noticeable amount. The character interactions are fun and quick. Dagashi Kashi's 12-minute run-time finally allows for its pace to match its quick, sporadic humor. Every episode might seem to go by in a blink.\\n\\n\r\nExcept, the show isn't still what I would call \"good\" in an overall sense. It's an anime that you have, for lack of words, 'turn your brain off to enjoy'. There is little to not plot development that occurs over this show, and the romantic interests also go nowhere either. The introduction of Hajime and Beniyutaka might seem like a foot in the right direction, but their influence on this anime's plot is little to nothing because of the pace of this anime. I haven't read any of the source material, so they may have a larger role, but their own specific arcs within the show are punitive at best. They are interesting additions to the current cast of characters, but this anime is still very much carried by the antics of Hotaru and Kokonotsu. When that pairing is not seeing screen-time, the jokes and everything fall flat, to me.\\n\\n\r\nDagashi Kashi S2 is a step in the right direction for this series, and I mean a major step in the right direction. I would not be surprised if there is a third season because I believe that its funded by major Dagashi Companies in Japan, not mention it got simulcasted during its airing. However, its not something you should go out of your way to watch. There are better anime out there that kinda fill the same niche, \"Bokura wa Minna Kawaisou\" ; \"Haiyore Naryuko-San\" ; \"Barakamon\" to name a few, that focus of character interaction and day-to-day living with its focus on improvement surrounding either a singular or few eccentric characters foiling the MC.",
            "date": "2018-04-01T21:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 276454,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5744226.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ADelicateOrange",
                "username": "ADelicateOrange"
            },
            "url": "https://myanimelist.net/reviews.php?id=276454"
        },
        {
            "content": "Hey folks, this will be a review for Dagashi Kashi 2. Much better than season 1 in many ways, including making you want more.\r\nThe story picks up from season one with the Dagashi shop. However they make it much easier to watch than the first season. Each episode is only 12 minutes long and the Dagashi lessons are much more concise. It was much nicer to have a fun show to watch with the occasional Dagashi fun fact moment than sit for 20 minutes in a Dagashi classroom.\r\nThe art was pretty as usual, though there was less of the town and more of the shop.The music was enjoyable and I didn't feel compelled to skip the into like I normally do.\\n\\n\r\nThe characters are all the same, but we get less time with them. This season focused more heavily on Hotaru and Kokonotsu. Eventually sparking some drama, which honestly didn't feel necessary. A couple of new characters join the fun and have about an episode or two of progress. However with this new 12 minute an episode formula it no longer feels like we get to know anyone.\\n\\n\r\nDagashi Kashi 2 was a much more pleasant watch than the first. The first season I kept waiting on the lessons on Dagashi to be turned into humor and it never did. The flow of the show was slow and ultimately boring. This season however was quick and comedic. You get some moments in the show to really feel like they brought together the Dagashi moments and the story moments to create scenarios we can all enjoy. Part of me misses the full length episodes because it was enjoyable to spend time with the cast. Otherwise the show was fun to watch and would recommend it to people who may not have like the first season.\\n\\n\r\nTLDR: Better than season 1 for the most part.",
            "date": "2018-04-06T13:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 277139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=277139"
        },
        {
            "content": "So another anime with a food porn thing has just ended and it is it's sequel but unlike the first season this one has us missing someone and yes it was Hotaru. so:\r\nGood 7, Story:\r\nUnlike the first season where it involves your typical Japanese snacks, this one has Knick Knacks , the romance has been added, and a scenario where Hotaru suddenly left without a word in episode 4  and be replace by Owari Hajime, there is also You who suddenly has gone somewhere and was replaced by Hotaru's bother Beniyutaka. What makes the story good was that this time we the audience weremade to miss Hotaru through Kokonutsu, where we long for her return. However the plot hole here is why did she left? Then again for her to  appear again was the climax of this anime even if she was made to reemerge on the very last episode,  but even so studio Tezuka Production and original creator Kotoyama almost fooled us into believe that she has left again, which was quite cheeky.Well, since Hotaru was replace by Owari, it does't diminish the anime's story line in fact it was Owari that has provided an alternative for Hotaru, but unlike the oddball Hotaru, Owari on the other hand adds a sort of sotacon element in this anime, now I know all fo you would agree that the plot of Hotaru gone for a while and wanting to know her reason or when will she come back is something that keep us watching this anime.  \\n\\n\\n\\n\r\nMediocre 5, Art:\\n\\n\r\nThere  may have been some changes with Hotaru's illustration, but even so , we still see a buxom girl in a goth lolita dress  has not change. We may have seen Saya in her school uniform and still fashionable as usual . Tou is still this Hawaiian Haole who still should be fed to the sharks and even the addition of Owari in her business suit was just too out of place, since she now works in a small dagashi and does she have to wear it even sleeping?There is also Beniyutaka a guy managing a convenience  store who has to be in a coat less business attire, but then again it doesn't make any difference.  As long as there are resemblances with the character's illustration. Btw don't expect to see any onsen, shower, beach and panty services around here.\\n\\n\r\nMediocre 5, Sound:\\n\\n\r\nOk so is there anything for me to say about the seiyu's who did the character's voices around here????????Nope nothing to say around here nor do I have anything to say about the opening and closing themes.\\n\\n\r\nGood 7, Character:\\n\\n\r\nHere the thing about the characters that studio Tezuka Production and anime director Kuwahara Satoshi put around here, in fact it not who they've put around this sequel , it's what they did with the main heroine Hotaru, where they intentionally put her character on haitus after episode 4 and replaces her with Owari Hajime on the 7th episode, only to reemerge on the last episode, it maybe a cheeky move but then again seeing Kokonutsu with a Milf bring in a new life, since with here, we see what Hotaru should've done instead of commuting everyday by train which is quite a task that would have save her such trouble if she stayed with Kokonutsu.....But back to Owari, she sort act like this guardian to Kokonutsu even if he is her boss, but imao she can be this other girl who could have a sotacon romance with Kokonutsu. As for Saya, too bad that there hasn't been any development with her relationship with Kokonutsu and she still is this childhood friend who's gonna be left behind. Now on the last episode as Hotaru appears again, we're almost led to believe that she gonna walk out again from Kokonutsu's life now that's the climax a very cheeky climax that is.\\n\\n\r\nGood 7, Enjoyment:\\n\\n\r\nYa know I kinda hate to say this, but  I know everyone would agree with me that it was our longing for Hotaru's return  was the glue that keep us from dropping this anime, Thought Owari did serves as Hotaru's replacement we the audience we're  empathizing with Kokonutsu for his desire to see Hotaru again as if the romance has re-surges between the two, and it did deliver on the post credits where we see Kokonutsu and Hotaru on top of the roof of the Dagashi shop.\\n\\n\r\nVery Good 8, Overall:\\n\\n\r\nI got to hand it to studio Tezuka production and anime director Kuwahara Satoshi for their cheekiness for what they've done with Hotaru. Well, it wasn't always that such thing is done, so season 3???? Why not.\\n\\n\r\nThe End.     \\n\\n",
            "date": "2018-04-01T06:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 276283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=276283"
        },
        {
            "content": "For Starting i never thought that i might be able to see this anime again, i was just hoping and praying that this anime will get 2nd season, and finally it got the 2nd part, it make me so happy and first of all i want to thanks the team of Dagashi Kashi.\r\nAnd now about this anime - first season was quit amazing and funny and it had all interesting thing that needed it was really fun to watch, a really good and interesting dagashi anime.\r\nAnd the second season was also amazing, but the only thing that make it little different is the time ofeach episode 12 min and that was little surprising. 12 min was not enough for me , i really wanted it to enjoy more, i m just little sad that it ended little soon and i had small amount of time to enjoy it.\\n\r\nbut everything was too amazing, for some point i thought whats happening, is it really happening but in the end, the end was so amazing that made me so happy. i so happy that i started to watch this anime.\\n\r\nit was really fun to watch the 2nd season and the story was quit amazing well there was a little sad point though but the ending of season 2 it just healed everything in 2nd season....\\n\\n\r\nAnd i m again hoping and praying it to get 3rd Season, cant wait to for it, but need to wait though....\\n\r\nDAGASHI KASHI i m waiting for you again.....",
            "date": "2018-03-31T13:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 275906,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5925689.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Hentai_Prince_",
                "username": "_Hentai_Prince_"
            },
            "url": "https://myanimelist.net/reviews.php?id=275906"
        },
        {
            "content": "I won't lie, it's my first review, usually, i don't write review because of my horrible english, but i needed to write this one.\r\nI'm disappointed of the second season of Dagashi Kashi.\r\nNot only by the 12 minutes for each episode instead of the 24min in the first season, but the art changed a little (eyes of Hotaru, head and bodies of the characters...) and these changes affected to my vision of the anime.\r\nStory : 7/10\r\nThe anime is globaly, more focused to the story, and not the jokes and the humour, it's very different from the 1st season, it's not really bad, but not really goodtoo. But....the is so focused to the story, that the humour is just passing by and we don't even notice that.\\n\r\nThe story is cool, but no more.\\n\\n\r\nArt : 6/10 \\n\r\nThe second season's art is really disturbing me, it's changing from the 1st season but, i don't know, i just can't pass by and i notice every changes from the first season, and i can't get used to.\\n\\n\r\nSound : 7/10\\n\r\nThe OST, OP, Ending, are always great as the first season, but they still aren't noticable because we are too focused to the story.\\n\\n\r\nCharacter : 7/10\\n\r\nThe second season of Dagashi Kashi is introducing 2 news characters, 1 main et 1 supporting : Hajime and the owner of the supermaket Beniyutaka.\\n\r\nHajime is fun, but isn't fun as Hotaru was, and, talking to the wolf, Horatu is in a really good part of the anime, absent and away, we only see her in a fews episodes, and that is why my enjoyment regarding the anime gone lower. And I think that is really sad, i was expecting a lot apparition of Hotaru.\\n\\n\r\nEnjoyment : 6/10\\n\r\nUhm....i really don't know how to feel to the second season of this anime, i didn't really enjoyed and wasn't really waiting for each episode who were airing, but, i just know that i didn't feel that way for the first season of the anime, it was more enjoyable.\\n\\n\r\nOverall : 6/10 \\n\r\nI won't lie, the second season of Dagashi Kashi for me, isn't a good season, i was expecting too much i think, and it was by this way, that my enjoyment regarding the anime, gone really lower. I don't hate the second season, but don't love it either.\\n\r\nI'm just.....disappointed.",
            "date": "2018-03-30T11:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 275753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6366541.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheoSenpaii",
                "username": "TheoSenpaii"
            },
            "url": "https://myanimelist.net/reviews.php?id=275753"
        },
        {
            "content": "Really surprised with this second season, I didn't hope anything about this, only tried to see this new season for Hotaru and cause I have seen the first season. happily I was wrong.\r\nThis season have all that the before season didn't have; story, characters development, a objetive for the main character and a short duration for process the different types of candies that show you. I think that the change of studio was something good, and it could combine story, jokes, fanservice, romance and candies in some good and enjoyable to see without being overwhelming somehow.\r\nI just finished watching it and now if I wantto know more of this story.\\n",
            "date": "2018-05-02T12:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 279603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5179437.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Horoislife",
                "username": "Horoislife"
            },
            "url": "https://myanimelist.net/reviews.php?id=279603"
        },
        {
            "content": "I remember watching the original Dagashi Kashi series back when it aired. It wasn’t a particularly deep series, but I enjoyed the running gags throughout the series and the characters fit well into their setting. It never tried to take itself too seriously and reveled in being a lighthearted, episodic comedy. S2 could have followed suit, but tried to work with different forms of plot development.\r\nDagashi Kashi S2 certainly focuses more on having an overarching story, with multiple episodes following a single plot. Episodes usually had a unique candy to talk about, but the focus had certainly shifted to revolve around the characters rather thanthe snacks. This change in focus would prove fortunate for those looking for a more cohesive experience, but overall seemed to detract from the experience. \\n\\n\r\nThe characters of Dagashi Kashi are well realized for their setting, but that setting is in a candy store making jokes, not worrying about failure and deadlines. Perhaps it’s personal opinion, but the change in general feeling from lighthearted fun to more drama based interactions takes away from the overall light hearted and “fun” nature of the show. Not enough episodes centered around romping through the woods and hanging by the pier compared the number spent worrying about the competition for sales.\\n\\n\r\nOverall, Dagashi Kashi is a nice little continuation of the series, especially true with the episodes being half the length of a regular one at 12 minutes. The second season lacks some of the charm of the first season, but delivers a fun revisit to dagashi shop by the river.\\n",
            "date": "2018-04-05T20:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 277050,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655051.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Calcature",
                "username": "Calcature"
            },
            "url": "https://myanimelist.net/reviews.php?id=277050"
        },
        {
            "content": "Oh how i missed those crazed eyes.\r\nThis is now my 3rd show of the 2017 winter season that i am finishing and have a bunch more waiting for me. \r\nThis season did something kind of weird and unexpected. For almost all of the season we see no Hotaru, This character is one of the main attractions and you can honestly feel her character missing from the show. \r\nBut once i saw those crazed eyes again near the end of the season, Well i got shivers down my spine and i believe that shows you how exciting it was to finally see her back again. \r\nThestory itself seems to take a more Slice of Life approach instead of what ever you'd call the first season. First season we got more energetic and crazy stories happening but in this it's seems to be more calm. Even the color pallet has gotten a little more dark. \\n\\n\r\nThe show itself changed it's animation. I personally really liked the original and how everyone looked, Like previously mentioned the color pallet has taken on more dark and depressing tones. At times it kind of kills the funny atmosphere we should be getting or at least for me.\\n\\n\r\nDon't get me wrong. I still think the animation is nice and looks different then most other shows. \\n\\n\r\nWe are also introduced to a new character. Usually this doesn't go over well when you introduce a new character that is a part of the main story. But i'd say that she was a nice addition. Most people in the comment sections were assuming that she is Hotaru in disguise. But i like her. She is better then any other male character in the show still. \\n\\n\r\nI still feel that Hotaru and Saya are the best couple together. I wish we got them together cause they just seem to go so well with each other. Hell, I'd even through in the new girl character for a three way Yuri love triangle. \\n\\n\r\nThe main MC isn't that interesting and i'd rather have the show feature Hotaru and Saya and the MC's. \\n\\n\r\nI can honestly see a show where it starts out with Saya living her rather boring life and then all of a sudden a Dagashi shop opening next to her cafe. Turns out a new girl is at school and we later find out that the owner of the Dagashi shop is Hotaru ( The new girl) \\n\\n\r\nI feel that would be more enjoyable then watching the eh MC. \\n\\n\r\nI still don't like that we only got 13 minute episodes this time ,But oh well.\\n\\n\r\nThe ending though i feel deserves props. I ended the season feeling satisfied but also wanting more. I feel a charming feeling when we see both the MC and Hotaru in the train station by them self. Then the show actually bothering to show us returning to the Dagashi shop and her surprising everyone. Stuff like this i see very little shows do and it's a nice touch.\\n\\n\r\nOverall i still feel this is a underrated show and that i don't understand such low scores.\\n\\n",
            "date": "2018-04-02T23:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 276622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=276622"
        },
        {
            "content": "You know those ads on Youtube that let you skip them after 5 seconds?  Think of this as that and season 1 as the 30 second unskippable ones.  \r\nStory:\r\nAs expected of a sequel, Dagashi Kashi 2 returns back to Shikada Dagashi, where Kokonotsu continues his youth out in the sticks subjected to the eccentric Hotaru bringing about new cheap snacks and the history behind them before disappearing halfway and continuing that plotline anyway despite not having the character that made the show interesting in the first place do all of the narration.\r\nAlright in short, the show is...sorta like the first season with its runtime cut inhalf.  Much of what to expect from this is what is seen in the first season, just toned down because Hotaru being the girl whose sexual preference is snack isn't present for a good half of the show.  It's with this lack of hyper energy that season 2 feels dull by comparison, which doesn't help its case when its attempt at an overarching narrative at the end feels out of place and poorly executed because up till that point, the show never even bothered to tackle Kokonotsu's character or interests since prior to that he was just the guy who was either being talked to or talking about dagashi.  \\n\\n\r\nSo really at the end of the day you're left with a show that tries to break out of its mold, but fails to do so because it's still stuck and is content with being in it.  There's honestly not much to say about it since the show's total runtime is the sum total of half a cour, which while helped me get through it much faster because the twenty four minute runtime of the first season felt agonizing cause it almost felt like nothing was even happening aside from a history lesson on a snack I never heard of.  Even ads have to be interesting if you want people to watch them.\\n\\n\r\nOverview:\\n\r\n+/- Pretty much the first season chopped in half\\n\r\n-  Less energetic and therefore became less interesting\\n\r\n-  Poorly executed 'final arc'\\n\\n\r\nCharacters:\\n\\n\r\nOut of the entire main cast, Kokonotsu is really the only matters?  There's a focus on him in the later episodes, especially the last two that tries to give him characterization due to the polarizing paths that he's presented throughout the series, but it just...doesn't work out.  The tonal shift of it felt pretty out of place, especially with how somber the show tried to be in the very last episode, and at the end of day, Kokonotsu still remained as the son of a Dagashi shop owner with very few actual changes in his character despite what the show tries to paint.  \\n\\n\r\nThere are however two new characters that the show presents; Hajime, a new part-timer, and Beniyutaka, a man who seems way too obsessed with the concept of convenience stores.  In Hotaru's stead, these two attempt to fill in the gap by being both the 'Dagashi' and 'High-Energy' parts of her personality respectively, which only kind of worked because Hajime managed to be entertaining without being too over the top whereas Beniyutaka proved to be the opposite.  Apart from them, the rest of the tiny cast involving the Endo twins and Kokonotsu's father return with very few changes to them.  \\n\\n\r\nOverview:\\n\r\n+ Saya's still kinda awesome\\n\r\n+/- Kind of average characters\\n\\n\r\nArt:\\n\\n\r\nProduction this time was transferred from Feel to Tezuka Productions, which comparing the two is like seeing something in 1080p then going into 360p.  There's a certain lack of quality with how season 2 looks, with much of the colors looking much duller and darker in comparison to Feel's work in making everything look brighter and shinier by comparison. \\n\\n\r\nIt's a weird shock with how different the qualities are that honestly I feel was for the worse.  Yes, Kotoyama's style is still recognizable, but it's one of those things where you're used to one thing, and now seeing it in a different style ends up looking weird because it's not what you're familiar with, which is especially telling because the series's high octane and light hearted comedy is now contrasted by this super dull and dark color palette that doesn't match up.  \\n\\n\r\nOverview:\\n\r\n- Overall lower quality\\n\\n\r\nSound:\\n\\n\r\nBoth Ayana Taketatsu's \"OH MY Sugar Feeling!!\" and Hachimitsu Rocket's \"Okashi na Watashi to Hachimitsu no Kimi\" are songs that emphasis the show's energy as a snack-based comedy more than anything else.  They're not tracks that I would give praise for simply because I just didn't care for them.  They're alright I admit, but they didn't have anything interesting about them that truly grasped my attention, and for that I personally gave them a pass.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nI often put sequel seasons on my list for 'obligatory reasons', as I call them.  I'm usually in it for the long haul and very rarely do I not continue a series, even if I dislike it, whether that reason be its main character or if I get so annoyed by the plot that I flat out refuse to continue it.  While Dagashi Kashi doesn't fall into either of those categories, and even with a shorter runtime so at the end of the day I'm still watching less of the thing overall, I still don't think it was worth it.\\n\\n\r\nHonestly, I'm pinning it on the fact that the novelty of the idea ran out.  Sure there're a million different snacks and/or cheap toys that exist out there, but having that be the primary running joke/focus in the series runs the well dry pretty fast cause it's the exact same thing.  Sure the show tried to spice it up by bringing in new characters, but it did it at the sacrifice of getting rid of the one character that pretty much gave the show reason to exist, which again, doesn't help the show's case.  There's also a criminally small amount of Saya featured in this season, and that is a downright crime.  Best girl should not be benched like that, especially during the show's \"downtime\".\\n\\n\r\nSo if you ask me, unless you really like this show, you're best skipping this.  Granted I wasn't expecting anything grand from this sequel, but at least let me put \"It's a sequel, what you saw in the first season is what you're gonna get here\", cause that is not at all what happened damnit, and that's the bare minimum you could've done where you instead went directions that didn't help your case in the end.",
            "date": "2018-03-31T22:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 276156,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=276156"
        },
        {
            "content": "I couldn't ask for a better ending to a simple and relaxing anime. The second season of Dagashi Kashi focuses a lot more on character interaction than the first season, and every character is really likable too. Before watching either season I had no idea what even dagashi was to begin with, but I must say the idea behind it was used very effectively in making the plot for the anime. I couldn't help but think that the dagashi was essential in order for the story to make even the smallest bit of sense. Another surprisingly positive aspect of this season, was the episode length.Even though it was cut in half, it didn't seem like the story ended too early for any of the episodes. After all, the story didn't try to be too ambitious. This was especially important for Dagashi Kashi because it is exactly what dagashi itself is supposed to portray. The mindless fun that comes from Kokonotsu and his friends' interactions is incredibly comfortable to watch, at times inspiring, as we see them grow together.",
            "date": "2018-06-19T17:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 281608,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4508551.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Umaigenomu",
                "username": "Umaigenomu"
            },
            "url": "https://myanimelist.net/reviews.php?id=281608"
        },
        {
            "content": "*Slight Spoilers in the story segment, mostly ep5 spoilers and ep10 details*\r\nCandy is an amazing and wonderful thing. It's cheat, it's sweet, and enjoyable. However, too much candy ends up making you feel bad, so it's always recommended to eat them in small doses and not to overdo it. \r\nI've been a fan of the Dagashi Kashi manga since 2015 so I was extremely happy to hear it get an adaption in 2016. I thought it was a good adaption, but the biggest problem was that it was kind of....long. The manga was fun to read in its 8 pages at your own pace, butwhen you make an episode 24 minutes long, it can kind of start feel like a chore to watch, and you're watching an anime all the way because YOU want to, otherwise why would you even put up with it?\\n\\n\r\nDagashi Kashi 2 fixes that problem by being around 10 minutes long. By feeding the audience in small doses, it's much more enjoyable and it makes you crave for more after one is done. You don't stuff your mouth with the entire bag of skittles, you grab them in handfuls. \\n\\n\r\nStory & Characters:\\n\\n\r\nOnto the actual show, it's formula from the prior season doesn't change too drastically. It continues to revolve around the antics of Kokonotsu \"Coconuts\" Shikada and Hotaru Shidare and her quest to make Kokonotsu run his father's candy store. This changes by the time Hotaru, the driving force of the series, magically disappears for months in the story's time. Here, we are introduced to 2 new characters, Hajime Owari, a part timer for the candy store, and Beniyutaka Shidare, the owner of a convenience store across the river in front of the candy shop. They're both welcome additions to the series as they make the cast feel more bigger without feeling bloated and it feels like the small world of dagashi kashi has a lot going on.\\n\\n\r\nUnlike previous chapters/ season 1, this is the point where we see some character development and some changes in Kokonutsu's life. Between Hotaru disappearing without a word, Kokonutsu trying fix up the Candy Shop and him taking his dream of being a mangaka more serious, there's alot of small twists to the regular formula so it doesn't feel like we're getting more of the same thing without it becoming too stale. The cast genuinely care for one another and it really shows in the much more serious moments. They aren't deep or complex but they feel like good characters.\\n\\n\r\nArt:\\n\r\nNot much to really say here but it's fine. A lot of people seemed to have been iffy about the slightly different art style from S1 to S2 which might have been a result in a budget cut but I think the slightly darker feel fits the series just fine. No complaints.\\n\\n\r\nSound:\\n\r\nMostly just reusing the same soundtrack from S1, it's alright. The seiyuu's do a great job at making their characters feel like themselves and it was nice to hear Sugita Tomokazu as the convenience store owner because he totally captures the energy that character gives whenever he's on screen. Personally I never really cared about S2s OP or ED. I think S1 had it beat. Calorie Queen is still stuck in my head.\\n\\n\r\nEnjoyment:\\n\r\nYeah, it's very enjoyable, especially if you already liked season 1. S2 does things kind of different while still being dagashi kashi at heart so ultimately if you were hoping that it spices things up, I think you won't be too disappointed. \\n\\n\r\nOverall, I feel like S2 is a step up from S1 in every way. Although I wouldn't rule out a Season 3, I do think most people should continue reading the manga especially since, as of typing, the manga is set to end and Kotoyama has confirmed he's finished drawing the finale of the series. It feels like the fun characters weren't the only thing that carried the show and that's enough to make me feel satisfied.\\n",
            "date": "2018-03-31T01:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 275851,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1365707.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheOutlawZero",
                "username": "TheOutlawZero"
            },
            "url": "https://myanimelist.net/reviews.php?id=275851"
        }
    ],
    [
        {
            "content": "Dagashi Kashi is that show that just doesn't stop giving you diabetes. Take that literally or not I mean it both ways. This season in particular was much better than the last especially since we got an excellent new character (Owari Hajime) along with Beniyutaka and the hilarious shenanigans just went on.\r\nI was quite skeptical of the studio change since the previous studio did a fine job and I was with the thought that Tezuka Productions couldn't manage such a show and couldn't bring it to greater heights. Let's just say I couldn't be more wrong. This season was a positive step up from thelast in that we got more jokes, more characters, less focus on the sweets jargon and a reinforced and improved cast that was just as brilliant as they were weird. I just couldn't stop laughing in this season at everyone compared to the last where I was seen Google searching the sweets for a but of context or relying on HorribleSubs to footnote the references for me to understand (not unlike Rumbel for Gintama) so I consider this a plus point. Then we had the sudden disappearance of an important character but to be honest I found that disappearance better since that departure led to further introductions of new characters like Owari Hajime and Beniyutaka who were vibrant, cheerful, unique and as mentioned hilarious. Did I mention they were also weird like everyone else? \\n\\n\r\nOwari Hajime's Character was that of a klutz I had perceived but she too had her amazing moments such as with the 8 candy and the website madness. Although I felt she was slightly more used for fanservice than I expected from last season but thankfully it wasn't overused to the point that it would deter us from the main point of view, literally. As for Beniyutaka, he was voiced by none other than Sugita Tomokazu and I think I only need to tell you his other roles and you'll know just how talented this fellow is, he played Gintoki (Gintama) and Kyon (Haruhi Suzumiya). Two very popular and fantastic roles. Apart from Sugita, the other voice actors did brilliant and I enjoyed the exaggerated expressions used in some of the scenes.\\n\\n\r\nScenes reminds me of the art. Now since this is a studio change as I mentioned before, the art changed as well, although not too drastically on the backgrounds the character designs looked clearly different from last season like for example the way the eyes looked this time. The eyes were more stretched than last time and I don't think this is a plus or minus since the characters' eyes were stretched last time as well, although not as much as this season. Apart from that the OP and ED used was unsurprisingly Dagashi themed. They were as playful as before and to be honest I was already addicted to the OP like 3-4 episodes in. As for the ED, well brilliant as always. Thankfully the Background music for the show didn't change from last time so it wasn't something that would need to get used to.\\n\\n\r\nSince there's little to no plot relation from last time I can easily advise others who haven't watched the previous season to view this first since they won't lose any context by watching this first. If they find this interesting then I'm sure they'll like season 1 as well, albeit some may find the Dagashi jargon a bit on the difficult to understand side. Regardless, both seasons were amazing, but personally I find this superior for the aforementioned reason as it's easy to understand and yet still such a beloved joy to watch.\\n\\n\r\nThis season was pretty interesting for me, since we had a different set of anime and I had maybe 2-3 sequels only out of which Saiki Kusuo and Dagashi were included and frankly the sequels this season didn't disappoint me one bit. Maybe because with sequels you know what is going to happen and if you're not a masochist you'll usually watch sequels if you liked the previous one (talking about people planning to watch that Isekai Smartphone sequel because it won't be good I tell you now). \\n\\n\r\nDo you want a show that makes you laugh and give you a little but of cultural knowledge? How about watch an anime all about sweets? Funny Characters and no plot to worry about? If that's the case then I give you a guarantee that Dagashi Kashi 2 won't disappoint you. Sometimes some shows don't handle endings well since Japanese sources generally are bad at endings from what I've experienced and heard (not trying to be racist here but it's what I've seen, it's like saying the Ancient Greeks loved happy endings or the Romans loved watching people fight in the Colosseum). Point is, if you're wanting to watch a funny slice of life anime, look no further than Dagashi Kashi because there's lots to laugh about at Shikada Dagashi! \\n\\n\r\nThe likelihood of a season 3 is very minimal since it's rare to see a niche title get two seasons in the first place but Dagashi fortunately received one. So there's still an inch of hope we get to see a season 3 so I have my fingers crossed. Do you?\\n\\n\r\nOverall Rating: 8.2\\n\\n\r\nP.S: Man I just LOOOOVE that ending!!! So brilliant! I won't spoil it but it was so amazing and Dagashi-like!",
            "date": "2018-03-31T08:10:00+00:00",
            "helpful_count": 33,
            "mal_id": 275864,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=275864"
        },
        {
            "content": "Let's be clear - I never thought that this series could get a 2nd season. No one thought, I believe. First season of Dagashi Kashi has been portrayed in the minds of people as \"12 episode sweet commercial\", but the second is something a bit different. I'm going to only compare it to the first season.\r\nThe story remains the same, there is Kokonotsu, whose dad wants him to take over the dagashi shop, there is Hotaru, who spends most of her time with him while telling him the story of sweets, and there are also Saya and To, who spend a lot of time withthem too and, of course, there are japanese sweets (and sometimes toys). The main difference between the story in the first one and the second is that... There is drama in this one. Drama in Dagashi Kashi, yeah.\\n\r\nKokonotsu fell in love with Hotaru and even forgot that he DIDN'T want to become a shop owner. After Hotaru lefts the town, he gets really depressed and that's when Kotoyama finally opens the door for the new characters, who are Hajime and Beniyutaka. While the second one doesn't really have much screen time, Hajime really shines. She is the one character who made this season as funny as it could be. Every scene with her is hilarious and she blends in with other people really well.\\n\\n\r\nThe biggest changes in this season are the new art style and shorter episode duration. \\n\r\nAt first, I didn't like the art, but after watching one episode it was proved that I was wrong. All characters (Except for Hotaru, I guess, she was gorgeous in the 1st season) look AMAZINGLY good. Background art is on point too. The art shouldn't be something that can make this series bad.\\n\r\nAs for the episode duration, it... also made the series better. The main point of Dagashi Kashi is promoting sweets while telling you it's history as you watch characters interact with each other, and some episodes in the first season were boring because this anime does not need to be 20 minutes long to do it's job.  \\n\r\nMy only complaint for this series would be TOO much fanservice in the first episodes. I mean, you're 2 episodes in and you already see Hotaru and Saya in one bath.\\n\\n\r\nAs for now, I think that second season is even better than the first one. It is more enjoyable and fun, while also remaining \"educative\" for those who want to know more about sweets.",
            "date": "2018-03-30T20:09:00+00:00",
            "helpful_count": 25,
            "mal_id": 275822,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5923758.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ne_gible",
                "username": "ne_gible"
            },
            "url": "https://myanimelist.net/reviews.php?id=275822"
        },
        {
            "content": "Dagashi Kashi s2 is a fun watch. \r\nWon't lie that I'm disappointed per episode being 12 mins. But it's enjoyable. The characters are fun to watch. Yes indeed most of the screen time in went to the advertising of food/chocolates. But it still has some sparks of romance that makes me want to watch the next episode. It has some added comedy too which is always nice. \r\nStory 5/10 \r\nSame story as first season. Hotaru comes describes a random food and the episode moves on from there \r\nArt 7/10 \r\nWon't lie I think the season 2 artstyle is better then the first one. The charactersare drawn nicely \\n\\n\r\nSound 6/10 \\n\r\nIt has some ost that are good and op and ed are well done but nothing worth saying. \\n\\n\r\nCharacters 8/10 \\n\r\nThis is the main reason to watch the show. Hotaru never ceases to amaze me. Saya and Kokonotsu are also fun. Can't forget Kokonotsu's dad who is still funny. \\n\\n\r\nEnjoyment 8/10 \\n\r\nI'm enjoying Dagashi kashi s2 yes indeed it has problems like the first season. But can't deny my enjoyment. \\n\\n\r\nSo should you watch it ? yes you should. If you liked the first season then you will like this one too. You didn't watch the first season ? then I would recommend finishing other anime before watching both of the seasons.",
            "date": "2018-02-03T06:01:00+00:00",
            "helpful_count": 19,
            "mal_id": 270500,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5349480.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Rezolut1on",
                "username": "Rezolut1on"
            },
            "url": "https://myanimelist.net/reviews.php?id=270500"
        },
        {
            "content": "To be honest: I'm disappointed with the second season of Dagashi Kashi so far( I'm on the fourth episode).\r\nI was looking forward to the second season because I was really enjoying the first one but I don't know, I feel like it's totally different.\r\nThe story still tells about sweets but it's told in less interesting way and there is more lovey-dovey stuff.\r\nWe were told from the beginning that characters are gonna look different from the previous season but it can be really bothering if you got used to the art of the first season. \r\nSound is similar, nothing really changed and it's quite good, openingis still kawaii.\\n\\n\r\nCharacters: they are funny and Hotaru is still weird but appealing in some way.\\n\\n\r\nEnjoyment: Well... I'm not waiting for each episode as I used to when the first season was airing.\\n\\n\r\nOverall: I would give it 6/10 because of simple sentiment.\\n\\n\r\nWould I recommend it? If you watched the first season, I would watch it because of curiosity and because of Hotaru.\\n\\n\r\nHope you liked it :)",
            "date": "2018-02-06T05:07:00+00:00",
            "helpful_count": 14,
            "mal_id": 270801,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5212507.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/antabakax",
                "username": "antabakax"
            },
            "url": "https://myanimelist.net/reviews.php?id=270801"
        },
        {
            "content": "Compared to season 1 there seems to be more story rather than just bits and piece thrown in with candy history. (Although there is still plenty of that too) \r\n   The characters are all great, and have their place in the show, and although the art style has changed a bit from season 1 I still find the show very enjoyable!\r\n   I am sadden that the run time was reduced to around 12 mins, but that can't be helped. (We are lucky to get a second season some shows don't)\r\n   Also this show is alwaysgreat for a laugh or two, and plus you can never get enough Hotaru!",
            "date": "2018-02-25T04:57:00+00:00",
            "helpful_count": 13,
            "mal_id": 272427,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5385307.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ZBRAillusion",
                "username": "ZBRAillusion"
            },
            "url": "https://myanimelist.net/reviews.php?id=272427"
        },
        {
            "content": "Dagashi Kashi is back and with some changes but changes are for the better!\r\nMild Spoilers ahead...\r\nNow the changes from the first to second season is from the studio change from Studio feel. to Tezuka Productions and with their changes they have changed the slick shiny character designs of feel to a flatter color palette to Tezuka but still looks good to look at and the most obvious change being the change from a 22 minute episode to a 12 minute one. Now the change of less screentime to Dagashi Kashi 2 is actually a good move as the first season of Dagashi Kashi had somefiller episodes within it's 22 minute screentime, while it's second season's 10 minutes however gets more focused as well as the heavy change to the second season's plot that occurs, so cutting the fat of the filler and being more focused is a good outlook of the second season of Dagashi Kashi. \\n\\n\r\nDagashi Kashi 2's plot still has it's comedic skits with it's various Japanese candies but the plot \"thickens\" halfway through the anime, that of the downside of Dagashi Kashi 2's plot...Hotaru Shidare just disappearing. This definitely changes some things mainly of Kokonotsu's trying even harder to make the dagashi shop work AND how about having a convenience store to be Kokonotsu's rival AND to substitute Hotaru's absence, Hajime Owari voiced by Chinatsu Akasaki, another \"sorta\" love interest but also Kokonotsu's in-shop employee of his dagashi shop. Yeah ALOT of this changes in this second season. Now for the most part these changes do affect the majority of this season especially Hotaru's absences is telling of Kokonotsu's love for Hotaru and even gives Kokonotsu to strive to both manage the dagashi shop because of his lingering feelings towards Hotaru and his initial goal of being a mangaka. Hajime Owari herself is also a good addition to the anime having great chemistry to the entire cast, Hajime almost being a mixture of Saya and Hotaru, so you can tell her having the chemistry work is a given. Now the final new character of this second season would be Beniyutaka voiced by Tomokazu Sugita being the owner of the convenience store and rival to Kokonotsu's dagashi shop and well...he's not a rival per say as he mostly wants tips from Kokonotsu in having a convenience store in the boonies still his eccentricities and those eyes...reminded LA of someone...but who.\\n\\n\r\nThe animation done now by Tezuka Productions have some minor changes especially with the flat yet similar character designs but still keeping the backgrounding on par with feel, but for the most part, LA did like the new changes to the character designs and even the shift in animation studio's, LA WOULD wanted Studio feel to do the second season with their polished and slick character designs but LA is still happy with Tezuka's either way.\\n\\n\r\nNow the voice acting, well LA has been watching the Funimation dub of it as well but first the Japanese. LA was always ok with the Japanese, with all the genkiness and comedic timing down pat and what with the second season going into more plot heavy dramatic moments, the only two voice actors for those were Ayana Taketatsu and Atsushi Abe as Hotaru and Kokonotsu respectively. Manami Numakura was great as always as Saya as well as Keiji Fujiwara as You and Tatsuhisa Suzuki as Tou. New voice actors like Chinatsu Akasaki as Hajime was a great addition to the anime as again Chinatsu had some great character chemistry with Abe and Manami and the over-eccentric Tomokazu Sugita as Beniyutaka was also welcomed, like it's Tomokazu Sugita going genki hammy as hell, what's not to love. Now the obvious elephant in the room would be because of Hotaru's mysterious absences, also means Ayana herself had less screentime as a result and LA did kinda felt that to the point LA was kinda missing Hotaru much like Kokonotsu himself did. Kinda makes you appreciate Hotaru and Ayana's genki vocals that much more. \\n\\n\r\n*ahem* on the Funimation side of things well same thing happened with Tabitha Ray due to her voicing Hotaru and LA missed her as well but still great to see her reprise her role as Hotaru. Sara Ragsdale, Justin Pate and Jeremy Inman were great in their respective roles as Saya, Tou and You and LA didn't expect Caitlin Glass to voice Hajime in the dub, LA was expecting Lindsay Seidel to do it instead but nonetheless Caitlin voicing Hajime was still on par with her Japanese counterpart nonetheless and Christopther Wehkamp as Beniyutaka was also welcomed though almost as genki as his original Japanese counterpart. The voice cast really on both the original and the dub was excellent despite some upsets no thanks to the major changes to the plot.\\n\\n\r\nDagashi Kashi 2 for LA is an excellent second season by effectively removing NEARLY all the flaws of the first season by condensing the screentime and plot to 10 minutes per episode as well as giving the plot of Kokonotsu as a character more purpose as a result, but still keeping the flavour of the original Dagashi Kashi intact with it's comedy with it's dagashi knowledge while keeping fresh with new developments in terms of plot and characters. Even if the second season's removed some of the flaws of the first season and it brought up it's own little flaws here and there, LA does see the second season of Dagashi Kashi as an improvement from the first season as a result, even at the cost of one character's screentime drastically reduced and the plot being more focused.",
            "date": "2018-03-30T20:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 275826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=275826"
        },
        {
            "content": "If yr here looking at S2 reviews, you probably already know the deal, so I'll get right into it.\r\nThe mostly new crew in charge of the second season managed to pretty much capture the same look and feel of the first season barring the addition of two new main characters, and one BIG difference—the episodes are only 12 minutes a piece instead of 24. They ended up getting away with this change easily enough, though, because the first season spent so much more time getting viewers acquainted with the original cast of characters.\r\nThere’s a line in the first season that goes something like “…the significanceof a dagashi shop. Not only is it a place for relaxation, but also a place where bonds are created by interacting customers. It’s a place that creates connections among people.”\\n\\n\r\nThis line represents the very essence of Dagashi Kashi. While the first season moves along at a pretty slow pace, it develops connections¬ between the characters themselves, and also between the characters and the audience. Season two then molds those relationships into something truly entertaining. Together, they combine for a subtly sweet mix of slice-of-life storytelling coated in educational opportunity, then sprinkled with just enough drama to keep it interesting.\\n\\n\r\n7.5/10",
            "date": "2018-04-18T10:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 278395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7112679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PrettiBoiSlim",
                "username": "PrettiBoiSlim"
            },
            "url": "https://myanimelist.net/reviews.php?id=278395"
        },
        {
            "content": "so this is the sequel and personally I enjoyed it more,  and to make it short it's becuase everything was done in a decent way, i'm not saying that the previous season wasn't but this is more better.\r\nthe story happened after season 1 with some random things going on and new candies (dagashi) to be introduced, but of course, but unlike before they put a little drama here, and yes I'm glad that they gives us a little something on Coconut's dream of becoming a mangaka, though I think they still lack story there regarding on convincing him to stay.\r\nthe characters are pretty muchthe same but now we see a little side of them as Saya being concerned with coconuts, also this is m oppinion, Hotaru and Tou we're getting kinda stale, and Coconut's father as well as Yutakabeni..well there's nothing to say to them.\\n\r\nHajime is my favorite character here though she's complex, she can be dumb but can be smart as well, not in a typical way, she just can sense whether coconuts is sad or something.\\n\r\nmy favorite change though is that it's only 12 minutes long..to make it short I think they did the right pacing this time..but still there are plot holes like Hotaru and Yutaka are siblings?\\n\\n\r\nanyway if you like a enjoyable anime with not much to say then I suggest you watch this",
            "date": "2018-05-11T02:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 280271,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=280271"
        },
        {
            "content": "TL;DR Dagashi Kashi Final Rating: 6.5/10\r\n    An above average show, especially considering its first season. Its 12 minute episode length makes it a far easier because its quick, sporadic humor finally feels fast in its pacing. Except, it still has its problems from its lack of awareness pertaining to its depth and emotional cues. Dagashi Kashi's second season tries to stymie this problem with the introduction of two new characters. But, the introduction of those characters and the improved pacing doesn't offset the fact it is a pretty bland show when Hotaru and Kokonotsu aren't interacting. There is not a reason towatch this show when there are better options like \"Bokura wa Minna Kawaisou\" ; \"Haiyore Naryuko-San\" ; \"Barakamon\" to name a few, that focus of character interactions between a singular or few eccentric characters that foil the MC. Dagashi Kashi is not a bad show, persay. That does not mean it's a good one either. \\n\\n\r\n----------\\n\\n\r\nThe first season of Dagashi Kashi was... well boring. It was repetitive, and its 24 minute episode length was far too long for a show that is mainly character interaction and exposition about Japanese sweets/candy. It may sound interesting to hear Hotaru or Kokonotsu talk about the history of various Dagashi, it can get overbearing when it lasts for over 20 minutes.\\n\\n\r\nLUCKILY~~~ The producers cut the screen time for Dagashi Kashi in half, literally. Moving from a 24 minute format into a 12 minute format. This actually helps the viewing experience of this anime tremendously. The exposition is shortened by a noticeable amount. The character interactions are fun and quick. Dagashi Kashi's 12-minute run-time finally allows for its pace to match its quick, sporadic humor. Every episode might seem to go by in a blink.\\n\\n\r\nExcept, the show isn't still what I would call \"good\" in an overall sense. It's an anime that you have, for lack of words, 'turn your brain off to enjoy'. There is little to not plot development that occurs over this show, and the romantic interests also go nowhere either. The introduction of Hajime and Beniyutaka might seem like a foot in the right direction, but their influence on this anime's plot is little to nothing because of the pace of this anime. I haven't read any of the source material, so they may have a larger role, but their own specific arcs within the show are punitive at best. They are interesting additions to the current cast of characters, but this anime is still very much carried by the antics of Hotaru and Kokonotsu. When that pairing is not seeing screen-time, the jokes and everything fall flat, to me.\\n\\n\r\nDagashi Kashi S2 is a step in the right direction for this series, and I mean a major step in the right direction. I would not be surprised if there is a third season because I believe that its funded by major Dagashi Companies in Japan, not mention it got simulcasted during its airing. However, its not something you should go out of your way to watch. There are better anime out there that kinda fill the same niche, \"Bokura wa Minna Kawaisou\" ; \"Haiyore Naryuko-San\" ; \"Barakamon\" to name a few, that focus of character interaction and day-to-day living with its focus on improvement surrounding either a singular or few eccentric characters foiling the MC.",
            "date": "2018-04-01T21:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 276454,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5744226.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ADelicateOrange",
                "username": "ADelicateOrange"
            },
            "url": "https://myanimelist.net/reviews.php?id=276454"
        },
        {
            "content": "Hey folks, this will be a review for Dagashi Kashi 2. Much better than season 1 in many ways, including making you want more.\r\nThe story picks up from season one with the Dagashi shop. However they make it much easier to watch than the first season. Each episode is only 12 minutes long and the Dagashi lessons are much more concise. It was much nicer to have a fun show to watch with the occasional Dagashi fun fact moment than sit for 20 minutes in a Dagashi classroom.\r\nThe art was pretty as usual, though there was less of the town and more of the shop.The music was enjoyable and I didn't feel compelled to skip the into like I normally do.\\n\\n\r\nThe characters are all the same, but we get less time with them. This season focused more heavily on Hotaru and Kokonotsu. Eventually sparking some drama, which honestly didn't feel necessary. A couple of new characters join the fun and have about an episode or two of progress. However with this new 12 minute an episode formula it no longer feels like we get to know anyone.\\n\\n\r\nDagashi Kashi 2 was a much more pleasant watch than the first. The first season I kept waiting on the lessons on Dagashi to be turned into humor and it never did. The flow of the show was slow and ultimately boring. This season however was quick and comedic. You get some moments in the show to really feel like they brought together the Dagashi moments and the story moments to create scenarios we can all enjoy. Part of me misses the full length episodes because it was enjoyable to spend time with the cast. Otherwise the show was fun to watch and would recommend it to people who may not have like the first season.\\n\\n\r\nTLDR: Better than season 1 for the most part.",
            "date": "2018-04-06T13:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 277139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=277139"
        },
        {
            "content": "So another anime with a food porn thing has just ended and it is it's sequel but unlike the first season this one has us missing someone and yes it was Hotaru. so:\r\nGood 7, Story:\r\nUnlike the first season where it involves your typical Japanese snacks, this one has Knick Knacks , the romance has been added, and a scenario where Hotaru suddenly left without a word in episode 4  and be replace by Owari Hajime, there is also You who suddenly has gone somewhere and was replaced by Hotaru's bother Beniyutaka. What makes the story good was that this time we the audience weremade to miss Hotaru through Kokonutsu, where we long for her return. However the plot hole here is why did she left? Then again for her to  appear again was the climax of this anime even if she was made to reemerge on the very last episode,  but even so studio Tezuka Production and original creator Kotoyama almost fooled us into believe that she has left again, which was quite cheeky.Well, since Hotaru was replace by Owari, it does't diminish the anime's story line in fact it was Owari that has provided an alternative for Hotaru, but unlike the oddball Hotaru, Owari on the other hand adds a sort of sotacon element in this anime, now I know all fo you would agree that the plot of Hotaru gone for a while and wanting to know her reason or when will she come back is something that keep us watching this anime.  \\n\\n\\n\\n\r\nMediocre 5, Art:\\n\\n\r\nThere  may have been some changes with Hotaru's illustration, but even so , we still see a buxom girl in a goth lolita dress  has not change. We may have seen Saya in her school uniform and still fashionable as usual . Tou is still this Hawaiian Haole who still should be fed to the sharks and even the addition of Owari in her business suit was just too out of place, since she now works in a small dagashi and does she have to wear it even sleeping?There is also Beniyutaka a guy managing a convenience  store who has to be in a coat less business attire, but then again it doesn't make any difference.  As long as there are resemblances with the character's illustration. Btw don't expect to see any onsen, shower, beach and panty services around here.\\n\\n\r\nMediocre 5, Sound:\\n\\n\r\nOk so is there anything for me to say about the seiyu's who did the character's voices around here????????Nope nothing to say around here nor do I have anything to say about the opening and closing themes.\\n\\n\r\nGood 7, Character:\\n\\n\r\nHere the thing about the characters that studio Tezuka Production and anime director Kuwahara Satoshi put around here, in fact it not who they've put around this sequel , it's what they did with the main heroine Hotaru, where they intentionally put her character on haitus after episode 4 and replaces her with Owari Hajime on the 7th episode, only to reemerge on the last episode, it maybe a cheeky move but then again seeing Kokonutsu with a Milf bring in a new life, since with here, we see what Hotaru should've done instead of commuting everyday by train which is quite a task that would have save her such trouble if she stayed with Kokonutsu.....But back to Owari, she sort act like this guardian to Kokonutsu even if he is her boss, but imao she can be this other girl who could have a sotacon romance with Kokonutsu. As for Saya, too bad that there hasn't been any development with her relationship with Kokonutsu and she still is this childhood friend who's gonna be left behind. Now on the last episode as Hotaru appears again, we're almost led to believe that she gonna walk out again from Kokonutsu's life now that's the climax a very cheeky climax that is.\\n\\n\r\nGood 7, Enjoyment:\\n\\n\r\nYa know I kinda hate to say this, but  I know everyone would agree with me that it was our longing for Hotaru's return  was the glue that keep us from dropping this anime, Thought Owari did serves as Hotaru's replacement we the audience we're  empathizing with Kokonutsu for his desire to see Hotaru again as if the romance has re-surges between the two, and it did deliver on the post credits where we see Kokonutsu and Hotaru on top of the roof of the Dagashi shop.\\n\\n\r\nVery Good 8, Overall:\\n\\n\r\nI got to hand it to studio Tezuka production and anime director Kuwahara Satoshi for their cheekiness for what they've done with Hotaru. Well, it wasn't always that such thing is done, so season 3???? Why not.\\n\\n\r\nThe End.     \\n\\n",
            "date": "2018-04-01T06:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 276283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=276283"
        },
        {
            "content": "For Starting i never thought that i might be able to see this anime again, i was just hoping and praying that this anime will get 2nd season, and finally it got the 2nd part, it make me so happy and first of all i want to thanks the team of Dagashi Kashi.\r\nAnd now about this anime - first season was quit amazing and funny and it had all interesting thing that needed it was really fun to watch, a really good and interesting dagashi anime.\r\nAnd the second season was also amazing, but the only thing that make it little different is the time ofeach episode 12 min and that was little surprising. 12 min was not enough for me , i really wanted it to enjoy more, i m just little sad that it ended little soon and i had small amount of time to enjoy it.\\n\r\nbut everything was too amazing, for some point i thought whats happening, is it really happening but in the end, the end was so amazing that made me so happy. i so happy that i started to watch this anime.\\n\r\nit was really fun to watch the 2nd season and the story was quit amazing well there was a little sad point though but the ending of season 2 it just healed everything in 2nd season....\\n\\n\r\nAnd i m again hoping and praying it to get 3rd Season, cant wait to for it, but need to wait though....\\n\r\nDAGASHI KASHI i m waiting for you again.....",
            "date": "2018-03-31T13:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 275906,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5925689.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Hentai_Prince_",
                "username": "_Hentai_Prince_"
            },
            "url": "https://myanimelist.net/reviews.php?id=275906"
        },
        {
            "content": "I won't lie, it's my first review, usually, i don't write review because of my horrible english, but i needed to write this one.\r\nI'm disappointed of the second season of Dagashi Kashi.\r\nNot only by the 12 minutes for each episode instead of the 24min in the first season, but the art changed a little (eyes of Hotaru, head and bodies of the characters...) and these changes affected to my vision of the anime.\r\nStory : 7/10\r\nThe anime is globaly, more focused to the story, and not the jokes and the humour, it's very different from the 1st season, it's not really bad, but not really goodtoo. But....the is so focused to the story, that the humour is just passing by and we don't even notice that.\\n\r\nThe story is cool, but no more.\\n\\n\r\nArt : 6/10 \\n\r\nThe second season's art is really disturbing me, it's changing from the 1st season but, i don't know, i just can't pass by and i notice every changes from the first season, and i can't get used to.\\n\\n\r\nSound : 7/10\\n\r\nThe OST, OP, Ending, are always great as the first season, but they still aren't noticable because we are too focused to the story.\\n\\n\r\nCharacter : 7/10\\n\r\nThe second season of Dagashi Kashi is introducing 2 news characters, 1 main et 1 supporting : Hajime and the owner of the supermaket Beniyutaka.\\n\r\nHajime is fun, but isn't fun as Hotaru was, and, talking to the wolf, Horatu is in a really good part of the anime, absent and away, we only see her in a fews episodes, and that is why my enjoyment regarding the anime gone lower. And I think that is really sad, i was expecting a lot apparition of Hotaru.\\n\\n\r\nEnjoyment : 6/10\\n\r\nUhm....i really don't know how to feel to the second season of this anime, i didn't really enjoyed and wasn't really waiting for each episode who were airing, but, i just know that i didn't feel that way for the first season of the anime, it was more enjoyable.\\n\\n\r\nOverall : 6/10 \\n\r\nI won't lie, the second season of Dagashi Kashi for me, isn't a good season, i was expecting too much i think, and it was by this way, that my enjoyment regarding the anime, gone really lower. I don't hate the second season, but don't love it either.\\n\r\nI'm just.....disappointed.",
            "date": "2018-03-30T11:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 275753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6366541.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheoSenpaii",
                "username": "TheoSenpaii"
            },
            "url": "https://myanimelist.net/reviews.php?id=275753"
        },
        {
            "content": "Really surprised with this second season, I didn't hope anything about this, only tried to see this new season for Hotaru and cause I have seen the first season. happily I was wrong.\r\nThis season have all that the before season didn't have; story, characters development, a objetive for the main character and a short duration for process the different types of candies that show you. I think that the change of studio was something good, and it could combine story, jokes, fanservice, romance and candies in some good and enjoyable to see without being overwhelming somehow.\r\nI just finished watching it and now if I wantto know more of this story.\\n",
            "date": "2018-05-02T12:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 279603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5179437.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Horoislife",
                "username": "Horoislife"
            },
            "url": "https://myanimelist.net/reviews.php?id=279603"
        },
        {
            "content": "I remember watching the original Dagashi Kashi series back when it aired. It wasn’t a particularly deep series, but I enjoyed the running gags throughout the series and the characters fit well into their setting. It never tried to take itself too seriously and reveled in being a lighthearted, episodic comedy. S2 could have followed suit, but tried to work with different forms of plot development.\r\nDagashi Kashi S2 certainly focuses more on having an overarching story, with multiple episodes following a single plot. Episodes usually had a unique candy to talk about, but the focus had certainly shifted to revolve around the characters rather thanthe snacks. This change in focus would prove fortunate for those looking for a more cohesive experience, but overall seemed to detract from the experience. \\n\\n\r\nThe characters of Dagashi Kashi are well realized for their setting, but that setting is in a candy store making jokes, not worrying about failure and deadlines. Perhaps it’s personal opinion, but the change in general feeling from lighthearted fun to more drama based interactions takes away from the overall light hearted and “fun” nature of the show. Not enough episodes centered around romping through the woods and hanging by the pier compared the number spent worrying about the competition for sales.\\n\\n\r\nOverall, Dagashi Kashi is a nice little continuation of the series, especially true with the episodes being half the length of a regular one at 12 minutes. The second season lacks some of the charm of the first season, but delivers a fun revisit to dagashi shop by the river.\\n",
            "date": "2018-04-05T20:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 277050,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655051.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Calcature",
                "username": "Calcature"
            },
            "url": "https://myanimelist.net/reviews.php?id=277050"
        },
        {
            "content": "Oh how i missed those crazed eyes.\r\nThis is now my 3rd show of the 2017 winter season that i am finishing and have a bunch more waiting for me. \r\nThis season did something kind of weird and unexpected. For almost all of the season we see no Hotaru, This character is one of the main attractions and you can honestly feel her character missing from the show. \r\nBut once i saw those crazed eyes again near the end of the season, Well i got shivers down my spine and i believe that shows you how exciting it was to finally see her back again. \r\nThestory itself seems to take a more Slice of Life approach instead of what ever you'd call the first season. First season we got more energetic and crazy stories happening but in this it's seems to be more calm. Even the color pallet has gotten a little more dark. \\n\\n\r\nThe show itself changed it's animation. I personally really liked the original and how everyone looked, Like previously mentioned the color pallet has taken on more dark and depressing tones. At times it kind of kills the funny atmosphere we should be getting or at least for me.\\n\\n\r\nDon't get me wrong. I still think the animation is nice and looks different then most other shows. \\n\\n\r\nWe are also introduced to a new character. Usually this doesn't go over well when you introduce a new character that is a part of the main story. But i'd say that she was a nice addition. Most people in the comment sections were assuming that she is Hotaru in disguise. But i like her. She is better then any other male character in the show still. \\n\\n\r\nI still feel that Hotaru and Saya are the best couple together. I wish we got them together cause they just seem to go so well with each other. Hell, I'd even through in the new girl character for a three way Yuri love triangle. \\n\\n\r\nThe main MC isn't that interesting and i'd rather have the show feature Hotaru and Saya and the MC's. \\n\\n\r\nI can honestly see a show where it starts out with Saya living her rather boring life and then all of a sudden a Dagashi shop opening next to her cafe. Turns out a new girl is at school and we later find out that the owner of the Dagashi shop is Hotaru ( The new girl) \\n\\n\r\nI feel that would be more enjoyable then watching the eh MC. \\n\\n\r\nI still don't like that we only got 13 minute episodes this time ,But oh well.\\n\\n\r\nThe ending though i feel deserves props. I ended the season feeling satisfied but also wanting more. I feel a charming feeling when we see both the MC and Hotaru in the train station by them self. Then the show actually bothering to show us returning to the Dagashi shop and her surprising everyone. Stuff like this i see very little shows do and it's a nice touch.\\n\\n\r\nOverall i still feel this is a underrated show and that i don't understand such low scores.\\n\\n",
            "date": "2018-04-02T23:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 276622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=276622"
        },
        {
            "content": "You know those ads on Youtube that let you skip them after 5 seconds?  Think of this as that and season 1 as the 30 second unskippable ones.  \r\nStory:\r\nAs expected of a sequel, Dagashi Kashi 2 returns back to Shikada Dagashi, where Kokonotsu continues his youth out in the sticks subjected to the eccentric Hotaru bringing about new cheap snacks and the history behind them before disappearing halfway and continuing that plotline anyway despite not having the character that made the show interesting in the first place do all of the narration.\r\nAlright in short, the show is...sorta like the first season with its runtime cut inhalf.  Much of what to expect from this is what is seen in the first season, just toned down because Hotaru being the girl whose sexual preference is snack isn't present for a good half of the show.  It's with this lack of hyper energy that season 2 feels dull by comparison, which doesn't help its case when its attempt at an overarching narrative at the end feels out of place and poorly executed because up till that point, the show never even bothered to tackle Kokonotsu's character or interests since prior to that he was just the guy who was either being talked to or talking about dagashi.  \\n\\n\r\nSo really at the end of the day you're left with a show that tries to break out of its mold, but fails to do so because it's still stuck and is content with being in it.  There's honestly not much to say about it since the show's total runtime is the sum total of half a cour, which while helped me get through it much faster because the twenty four minute runtime of the first season felt agonizing cause it almost felt like nothing was even happening aside from a history lesson on a snack I never heard of.  Even ads have to be interesting if you want people to watch them.\\n\\n\r\nOverview:\\n\r\n+/- Pretty much the first season chopped in half\\n\r\n-  Less energetic and therefore became less interesting\\n\r\n-  Poorly executed 'final arc'\\n\\n\r\nCharacters:\\n\\n\r\nOut of the entire main cast, Kokonotsu is really the only matters?  There's a focus on him in the later episodes, especially the last two that tries to give him characterization due to the polarizing paths that he's presented throughout the series, but it just...doesn't work out.  The tonal shift of it felt pretty out of place, especially with how somber the show tried to be in the very last episode, and at the end of day, Kokonotsu still remained as the son of a Dagashi shop owner with very few actual changes in his character despite what the show tries to paint.  \\n\\n\r\nThere are however two new characters that the show presents; Hajime, a new part-timer, and Beniyutaka, a man who seems way too obsessed with the concept of convenience stores.  In Hotaru's stead, these two attempt to fill in the gap by being both the 'Dagashi' and 'High-Energy' parts of her personality respectively, which only kind of worked because Hajime managed to be entertaining without being too over the top whereas Beniyutaka proved to be the opposite.  Apart from them, the rest of the tiny cast involving the Endo twins and Kokonotsu's father return with very few changes to them.  \\n\\n\r\nOverview:\\n\r\n+ Saya's still kinda awesome\\n\r\n+/- Kind of average characters\\n\\n\r\nArt:\\n\\n\r\nProduction this time was transferred from Feel to Tezuka Productions, which comparing the two is like seeing something in 1080p then going into 360p.  There's a certain lack of quality with how season 2 looks, with much of the colors looking much duller and darker in comparison to Feel's work in making everything look brighter and shinier by comparison. \\n\\n\r\nIt's a weird shock with how different the qualities are that honestly I feel was for the worse.  Yes, Kotoyama's style is still recognizable, but it's one of those things where you're used to one thing, and now seeing it in a different style ends up looking weird because it's not what you're familiar with, which is especially telling because the series's high octane and light hearted comedy is now contrasted by this super dull and dark color palette that doesn't match up.  \\n\\n\r\nOverview:\\n\r\n- Overall lower quality\\n\\n\r\nSound:\\n\\n\r\nBoth Ayana Taketatsu's \"OH MY Sugar Feeling!!\" and Hachimitsu Rocket's \"Okashi na Watashi to Hachimitsu no Kimi\" are songs that emphasis the show's energy as a snack-based comedy more than anything else.  They're not tracks that I would give praise for simply because I just didn't care for them.  They're alright I admit, but they didn't have anything interesting about them that truly grasped my attention, and for that I personally gave them a pass.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nI often put sequel seasons on my list for 'obligatory reasons', as I call them.  I'm usually in it for the long haul and very rarely do I not continue a series, even if I dislike it, whether that reason be its main character or if I get so annoyed by the plot that I flat out refuse to continue it.  While Dagashi Kashi doesn't fall into either of those categories, and even with a shorter runtime so at the end of the day I'm still watching less of the thing overall, I still don't think it was worth it.\\n\\n\r\nHonestly, I'm pinning it on the fact that the novelty of the idea ran out.  Sure there're a million different snacks and/or cheap toys that exist out there, but having that be the primary running joke/focus in the series runs the well dry pretty fast cause it's the exact same thing.  Sure the show tried to spice it up by bringing in new characters, but it did it at the sacrifice of getting rid of the one character that pretty much gave the show reason to exist, which again, doesn't help the show's case.  There's also a criminally small amount of Saya featured in this season, and that is a downright crime.  Best girl should not be benched like that, especially during the show's \"downtime\".\\n\\n\r\nSo if you ask me, unless you really like this show, you're best skipping this.  Granted I wasn't expecting anything grand from this sequel, but at least let me put \"It's a sequel, what you saw in the first season is what you're gonna get here\", cause that is not at all what happened damnit, and that's the bare minimum you could've done where you instead went directions that didn't help your case in the end.",
            "date": "2018-03-31T22:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 276156,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=276156"
        },
        {
            "content": "I couldn't ask for a better ending to a simple and relaxing anime. The second season of Dagashi Kashi focuses a lot more on character interaction than the first season, and every character is really likable too. Before watching either season I had no idea what even dagashi was to begin with, but I must say the idea behind it was used very effectively in making the plot for the anime. I couldn't help but think that the dagashi was essential in order for the story to make even the smallest bit of sense. Another surprisingly positive aspect of this season, was the episode length.Even though it was cut in half, it didn't seem like the story ended too early for any of the episodes. After all, the story didn't try to be too ambitious. This was especially important for Dagashi Kashi because it is exactly what dagashi itself is supposed to portray. The mindless fun that comes from Kokonotsu and his friends' interactions is incredibly comfortable to watch, at times inspiring, as we see them grow together.",
            "date": "2018-06-19T17:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 281608,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4508551.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Umaigenomu",
                "username": "Umaigenomu"
            },
            "url": "https://myanimelist.net/reviews.php?id=281608"
        },
        {
            "content": "*Slight Spoilers in the story segment, mostly ep5 spoilers and ep10 details*\r\nCandy is an amazing and wonderful thing. It's cheat, it's sweet, and enjoyable. However, too much candy ends up making you feel bad, so it's always recommended to eat them in small doses and not to overdo it. \r\nI've been a fan of the Dagashi Kashi manga since 2015 so I was extremely happy to hear it get an adaption in 2016. I thought it was a good adaption, but the biggest problem was that it was kind of....long. The manga was fun to read in its 8 pages at your own pace, butwhen you make an episode 24 minutes long, it can kind of start feel like a chore to watch, and you're watching an anime all the way because YOU want to, otherwise why would you even put up with it?\\n\\n\r\nDagashi Kashi 2 fixes that problem by being around 10 minutes long. By feeding the audience in small doses, it's much more enjoyable and it makes you crave for more after one is done. You don't stuff your mouth with the entire bag of skittles, you grab them in handfuls. \\n\\n\r\nStory & Characters:\\n\\n\r\nOnto the actual show, it's formula from the prior season doesn't change too drastically. It continues to revolve around the antics of Kokonotsu \"Coconuts\" Shikada and Hotaru Shidare and her quest to make Kokonotsu run his father's candy store. This changes by the time Hotaru, the driving force of the series, magically disappears for months in the story's time. Here, we are introduced to 2 new characters, Hajime Owari, a part timer for the candy store, and Beniyutaka Shidare, the owner of a convenience store across the river in front of the candy shop. They're both welcome additions to the series as they make the cast feel more bigger without feeling bloated and it feels like the small world of dagashi kashi has a lot going on.\\n\\n\r\nUnlike previous chapters/ season 1, this is the point where we see some character development and some changes in Kokonutsu's life. Between Hotaru disappearing without a word, Kokonutsu trying fix up the Candy Shop and him taking his dream of being a mangaka more serious, there's alot of small twists to the regular formula so it doesn't feel like we're getting more of the same thing without it becoming too stale. The cast genuinely care for one another and it really shows in the much more serious moments. They aren't deep or complex but they feel like good characters.\\n\\n\r\nArt:\\n\r\nNot much to really say here but it's fine. A lot of people seemed to have been iffy about the slightly different art style from S1 to S2 which might have been a result in a budget cut but I think the slightly darker feel fits the series just fine. No complaints.\\n\\n\r\nSound:\\n\r\nMostly just reusing the same soundtrack from S1, it's alright. The seiyuu's do a great job at making their characters feel like themselves and it was nice to hear Sugita Tomokazu as the convenience store owner because he totally captures the energy that character gives whenever he's on screen. Personally I never really cared about S2s OP or ED. I think S1 had it beat. Calorie Queen is still stuck in my head.\\n\\n\r\nEnjoyment:\\n\r\nYeah, it's very enjoyable, especially if you already liked season 1. S2 does things kind of different while still being dagashi kashi at heart so ultimately if you were hoping that it spices things up, I think you won't be too disappointed. \\n\\n\r\nOverall, I feel like S2 is a step up from S1 in every way. Although I wouldn't rule out a Season 3, I do think most people should continue reading the manga especially since, as of typing, the manga is set to end and Kotoyama has confirmed he's finished drawing the finale of the series. It feels like the fun characters weren't the only thing that carried the show and that's enough to make me feel satisfied.\\n",
            "date": "2018-03-31T01:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 275851,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1365707.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheOutlawZero",
                "username": "TheOutlawZero"
            },
            "url": "https://myanimelist.net/reviews.php?id=275851"
        }
    ]
]