[
    [
        {
            "content": "How are you feeling today? Upbeat? Or perhaps a little down? Maybe you've had a long day at work and you just want an anime to take your mind off things. Well, grab your cup of tea and look no further my friend - Magi: The Kingdom of Magic is the anime you've been searching for!\r\nMagi: The Kingdom of Magic has everything you look for in an anime. Pleasing sounds (not in a dirty way!), bright (pun intended) characters who develop nicely throughout the duration of the anime and beautiful art. The characters are interesting, have depth and will make you feel for them, soprepare for a little emotional tug! A little bit of humour helps compliment the slower aspects of the story, and ensures theres never a dull moment - however, if you lack a funny bone you may find an early episode here and there a tad slow. But don't stop, because things get fast, fascinating and ferocious and before you know it you'll be looking at the screen like it's the last piece of chocolate cake on earth...What? You don't like chocolate cake? What's wrong with you!?\\n\\n\r\nNow. You may be thinking, \"Great! Time to go watch!\" But wait. I promise I won't overwhelm you with 2,000 words of ramble. But there is a little more you should know...\\n\\n\r\nFirstly, don't be retarded like me and at least be aware of the prequel, 'Magi: The Labyrinth of Magic' before you start. I was not, and felt really overwhelmed at the beginning of the anime, with thoughts running through my head such as, \"wow, whoever wrote this expects us to understand this new world instantly\", \"So. Many. New. Characters\" and my personal favourite thought, \"I'm not quite sure what's happening right now...but it's cool!\" Long story short, maybe watch the prequel first...but I didn't so I can't really talk. If you choose not to don't worry, you will catch on and you will still love this anime, as I did.\\n\\n\r\nSecondly, have faith in the plot! I was wondering how a meaningful ending was going to ensure around the episode 12 mark, but just know you won't be disappointed and that things ramp up fast! That's not to say the first episodes were meaningless or unrelated, so don't skip them or you may be confuzzled.\\n\\n\r\nLastly, why are you still here! Go watch it. Now! (And thank you very much for reading my review, I know it's a bit out there but I wanted to make it fun!)\\n\\n",
            "date": "2014-10-04T18:19:00+00:00",
            "helpful_count": 201,
            "mal_id": 163627,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3718217.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MrSparklePants",
                "username": "MrSparklePants"
            },
            "url": "https://myanimelist.net/reviews.php?id=163627"
        },
        {
            "content": "If I had to describe Magi, it would be more than just about magic. Sure, there are wands, hats, and spells along with magical kingdoms of witchcraft and wizardry. What sets Magi a bit different is its conventional way of presenting the series in a world building form. From the start, it’s easy to notice that Magi takes the tone of an adventurous tone following protagonists Alibaba, Aladdin, Morgania, and. Hakuryuu Ren. No exception is the fact that these characters all have gone through hardships and became who they are today. Magi: Kingdom of Magic explores not only the identities of these characters but alsotheir journey in a land of the unknown as they face challenges and struggles like never before.\\n\\n\r\nMagi: Kingdom of Magic is sequel of its predecessor Magi: Labyrinth of Magic based off the manga of the same name. It’s important to note that the series is a direct sequel hence watching the first season is imperative to get an understanding and appreciation. The first season concentrated its style on adventures, politics, and personal intuitions. This season instead focuses on discovery with our main characters as they go on separate journeys of development while major conflicts that developed from its backgrounds erupts and escalates into warfare.\\n\\n\r\nDiscovery is only a simple word to describe Magi but it focuses on that aspect centering our main protagonist, Aladdin. As young as he is, Aladdin is a kind boy with full of potential. He is a Magi, a character of great power that is known to “shape the world\". For Aladdin, he is still young and trying to climb the ladder to adolescence. His first steps involves going to the kingdom of magic known as Magnostadt. From there, he learns about the true essence of magic. Through training, he discovers exactly what is a Magi and its purpose. At the same time, Aladdin earns the respect of his friends, classmates, and instructors. Among these new characters are Titus Alexius, a bishounen with great potential and his roommate Sphintus. The sequel focuses on their relationships from rivals to great friends. They also discover secrets that can change the world they know forever. At the same time, it’s surprising that watching this anime almost feel like you’re a kid again. Aladdin is studying at a magical academy where he learns magic. Although vastly different from what you may have learned during your school years, the effort that Aladdin puts through can be admirable. His die-heard attitude to not give up and become a stronger person sets a great example for a character. At the same time, people wants to see Aladdin succeed. They want to see him make a difference. Magi or not, Aladdin is a boy that has influenced others for the better and that’s appreciable on many scales.\\n\\n\r\nOf course, Magi isn’t just about magic or Aladdin. We also can’t forget about Aladdin’s best friend Alibaba, Morgania, or Hakuyuu. The four are like the ingredients of a dish and even leaving one of them out will change the flavor. In this sequel, they go their separate ways in what is known as the “World Exploration arc” that chronicles their discoveries. Alibaba improves his own skills through training and becomes something he always dreamed of. Similar to Aladdin, he earns the respect of his peers as he shows the world who he is. On the other hand, the journey that Morgania and Hakuyuu feels a bit different that doesn’t necessarily follow the ‘growing up’ theme. Instead, they find out about both truth and horrors. Hakuyuu also goes through a drastic change that can leave some sour taste in our characters’ mouths.\\n\\n\r\nSimilar the style of most shounen, Magi divides its story into arcs. The first arc in fact feels like the adventurous stories that the audience might be more used to. After all, Magi always felt like a classic with its Arabian Nights Days setting. The story arcs often incorporates a variety of feelings to not just describe but show how the world of Magi is like. Our main characters discover how their world functions after various encounters with adversaries and obstacles. It challenges not only physically but mentally as they realize some grim truths to their world. This shouldn’t be surprising however. Magi always liked to dance around the concept of world building. Take the kingdom of Magnostadt as an example. Its cities is colored with details and magic on the outside but also holds dark secrets in the inside. The sequel adapts a format for the characters to explore kingdoms with their previous experience while writing new chapters to their lives. \\n\\n\r\nAs much as adventurous Magi can be, there are also mysteries relating to the whole term itself. Exactly, what is a “Magi”? What is their purpose? Why do they exist? Some of these questions will be explored in depth with focus on not just Aladdin but also other characters. Meanwhile, the audience will also learn about some grim histories relating to our main characters’ past. It’s definitely not something pleasant nor forgettable. Later events also leads to greater struggles between nations as the world of Magi become a battlefield twisted by egos and ideologies. Despite the series takes place in a fantasy setting, there’s also some themes that explores identities and more of the human nature. Discrimination becomes one such theme as Aladdin learns about the dark secrets of Magnostadt and the stories of Fanalis. \\n\\n\r\nAlthough Magi can be wistful and classic as it sounds, the show sometimes doesn’t take itself seriously. The comedy on most parts is presented well matching the moods while other times feel forced and gets in the way. Thankfully, there isn’t too much fan service that are distracting. Rather, they are usually replaced by humorous dialogues, expressions, and moments where we can’t help but laugh. This could serve as a double edged sword in some cases as the comedy might not suit for everyone’s tastes. Furthermore, some of the dialogues lacks any real feelings and at times feels dragged. Magi does however introduces more focuses on romance. It’s unusual for this series but it occurs early on that may take viewers by surprise. Unfortunately, the romance aspect feels abrupt and lacks any depth because for what it is, there just seems to be a lack of connection. Also for its worth, a few episodes of the story arcs doesn’t fit well together or feel predictable and dragged. The first arc doesn’t feel very attractive or unique in any aspect with its more oceanic setting. Some supporting characters also just seems to be there rather than being main players of the story. Prominent characters introduced previously from season 1 such as Judal and Sinbad also gets lesser role in this sequel that may make fans feel disappointed. There is also hidden maturity themes such as incest subtext and childhood scenes where we might not want to remember for what it is.\\n\\n\r\nOnce again, A-1 Pictures handles the visual production. There’s the fun atmosphere with the artwork and accurately depicts the way a magical kingdom should be as. However, the character designs’ face expression at times lacks excitement. Some of it comes off as blend humor. Other times, it seems forceful with the mood. The action scenes on most standards is decent and matches well in coordination to the battle sequences. Most of the character designs also reflects its Arabian theme well. All of them have their own distinctive features whether it’s Titus’ feminine like face, the Felianis tribe’s flamboyant scarlet hair, or Scheherazade’s fairy like stature. \\n\\n\r\nThe soundtrack does its job well on most parts. It mixes a Middle Eastern and Arabian theme together to perform a nature that can be appreciable. The OST features a new set of tracks that captures moments of emotions, climatic, or humorous. Both OP songs of Magi also performs well with cases of foreshadowing and montage of its many characters. Similarly the ED songs presents scenarios where our characters look on ahead and faces the world they are in. Finally, the voice acting for most characters expresses well especially for Titus, a character that sometimes can be mistaken for a female.\\n\\n\r\nMagi: Kingdom of Magic is not just a story about witchcraft and wizardry. It’s about a journey that chronicles the stories of our characters. We find out how they progress through by watching rather than reading a form of autobiography. At the same time, it’s easy to understand the story with its basic concepts and world building. There are times the series might seem off balance with its excessive comedy and cheesy dialogues. However, most these cases doesn’t directly disturb the story as a whole. Magi doesn’t just focus on ‘saving the world’ with friendship and power. Instead, it focuses on development and characterization that makes its journey most welcoming.  \\n",
            "date": "2014-04-04T17:13:00+00:00",
            "helpful_count": 107,
            "mal_id": 138663,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=138663"
        },
        {
            "content": "For this overall anime, I actually really really enjoyed this series.\r\nBoth Magi Season tell a great story that can bring you to tears of happiness and tears of feels that strike you right in the heart.\r\nAs always, the art and animation was amazing! Story was overall beautifully done. \r\nEven though, this season was mainly focused on Aladdin, I do wish to see Morgiana & Alibaba's training and what happened to them when Aladdin was in Magnoshuttat. \r\nI really hope they make a season 3! This anime series is truly something that I would recommend anyone to watch. The Fan service is mainly based on comedy.So for those who don't really like fan service in anime, I really do recommend this anime! Great story, wonderful character designs, amazing fighting scenes, hilarious moments, this anime has everything in one! \\n",
            "date": "2014-04-15T21:25:00+00:00",
            "helpful_count": 104,
            "mal_id": 140099,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2008988.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Tsuitachi",
                "username": "Tsuitachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=140099"
        },
        {
            "content": "Note: I'm writing this review under the assumption that you've seen Labyrinth of Magic (the first season), so if you haven't, I'd suggest watching that first and then reading this review. There will be minor spoilers from the first season. You have been warned.\r\nStory: 9/10\r\nKingdom of Magic had a better story than Labyrinth of Magic in my opinion. Labyrinth of Magic had an arc-based storyline where it was established by definitive arcs (the order being the beginning arc, separation, Balbadd, Sindria, and Zagan) that had some connection to each other, but were mostly standalone. There was some progression from one to the next (characters andcharacter development), but overall there was a disconnect.\\n\r\nKingdom of Magic, on the other hand, has an overarching story that isn't as clearly defined by arcs, so it's much harder to tell where they end and begin. Or, from the manga standpoint, Kingdom of Magic covers the Magnostadt arc (which is one really long arc) as well as all the mini-arcs leading up to it.\\n\r\nSimilarly to Labyrinth of Magic, this show starts off fairly lighthearted, but soon takes a turn for the darker. However, this show got much darker than Labyrinth of Magic did, and I was surprised at the degree to which it did get dark. We're introduced to a corrupt government, the struggle to want to be human, what the concept of humanity really means, and many more ideas.\\n\r\nSo when I started Kingdom of Magic, I was expecting the same type of narrative as the first season, but I was pleasantly surprised by how seriously the show took itself and how much worldbuilding was established.\\n\\n\r\nThis show also introduced the concept of Djinn Equip (which was only barely introduced in the first season), which essentially lets people with Metal Vessels undergo a magical girl-type transformation where their hair, clothes, and weapons are upgraded for a limited time. I thought that it was awesome to see the characters basically get ubered-up to fight large-scale battles, which actually served more of a purpose in the story than just for the sake of showing the audience epic battle sequences.\\n\\n\r\nThe only real problem I have with the story was that, with so many characters, not enough time was given to explain what each of the characters were doing while separated from each other. Aladdin's story was explained in depth, but the same luxury was not given to Alibaba or Morgiana. Alibaba at least got two episodes detailing what he was doing, but I still would've liked to see him studying, fighting, or learning to use his Djinn Equip. And Morgiana? We get about two-thirds of an episode describing her adventures and we're left with a lot of questions about what happened. I was hoping for at least a brief summary, but we get nothing. I was under the assumption that the manga went more into detail, but it unfortunately doesn't. We may never know......\\n\r\nAnother minor issue I have with the story is the comic relief. I felt that a lot of times it was rather a moodkiller. It made me rather uncomfortable to be watching a serious part of the show and then suddenly cheap jokes were cracked. It wasn't totally irredeemable (in the manga, the chibis are much funnier), but it wasn't exactly pleasant to watch either.\\n\\n\r\nOne of the things I especially liked about the story, however, is that the show opens with a scene from one of the final episodes completely out of context. It leads you to make an assumption about where the characters are going to go, but once you actually get to that scene in order, you realize that you were dead wrong. I think that was a nice choice of placement, since I personally was wondering what was going to come out of that confusing scene for practically the whole show. \\n\\n\r\nArt: 9/10\\n\r\nThe colors are bright and lively, the character designs are stunningly detailed, the animation is on point, and there's subtle CGI at a couple of points. Nothing majorly bad happening, though the budget got slashed toward the end, leading to some fights not being as awesome as they could have been.\\n\\n\r\nSound: 9/10\\n\r\nNo complaints here. The OP's were good, and the second one especially is awesome, though both also had amazing sequences.\\n\r\nThe ED's are another story though. Not only were the sequences awesome and tear-inducing, the songs themselves were really good. The first ED carried a kind of nostalgic tone to it, amplified by the montage of stills from the first season. The second ED started off echoey and dark, and while I didn't like it as much when it kicked up into a strong beat, it's still my favorite of the ED's.\\n\r\nThe only thing I would give as far as an issue is that sometimes the background music was kind of quiet, which is a bit of a shame since it's so awesome, particularly the battle theme, which is my personal favorite.\\n\r\nOn the voice acting end, this season had not yet received a dub when I watched it, so I watched it subbed, complete with Netflix's garbage subtitles. I'm not that good a judge of Japanese voice acting, but I didn't notice any big problems going on. I loved Yuki Kaji's performance as Alibaba, and I think he does a great job no matter which character he's voicing, so I think he was the standout for me.\\n\r\nSince I originally wrote this review, I have had a chance to check out the dub of some of the later episodes. While I like the voice acting and casting choices for the most part, I have two big problems with it.\\n\r\nMy first big problem with the dub (and something that was in the first season too) is Vic Mignogna and Todd Haberkorn being literally every single background character. This wouldn't be so bad if they both weren't already cast as secondary characters (Ka Kobun and Judar respectively), but on top of that they both have very recognizable voices.\\n\r\nMy second big problem is \"Teetus.\" I get that's how they pronounced Titus's name in the Japanese, but honestly, since when do dubs follow the exact pronounciation of every name (Free! dub, I'm looking at \"Reen\"). And on that note, the same criticism could be applied to the dub's pronounciation of \"Magi.\"\\n\\n\r\nCharacters: 9/10\\n\r\nThe characters were awesome this season. When the show took a turn for the darker, the characters developed and changed along with it, and I really liked it. There was a lot of development happening (particularly among the new characters) and it was handled well considering the vast amount of characters in Magi.\\n\r\nAladdin especially changed a lot through the show, and we get to see more of his backstory as well as what's happening to him at the time the show takes place.\\n\\n\r\nOne of the problems I did have was that since this season introduced so many new characters, a lot of the characters from Labyrinth of Magic took a backseat. It's a nice thing to hand over the spotlight to some of the newcomers, but I felt kind of underwhelmed since a lot of characters with a large presence (such as Sinbad) didn't appear as much as they should have. Not that I'm particularly mad about it though, since I loved Titus and Sphintus and the other new characters. But this problem is also due to the fact that Magi has a ton of characters interacting and developing simultaneously, so some of the older characters have to step back a bit.\\n\\n\r\nAnother problem is that since some of the older characters get less screentime due to the new characters, a lot of development seemingly takes place offscreen. I already mentioned this with Alibaba and Morgiana, and it's even more apparent with Hakuryuu. He isn't present for a large chunk of the show, and when he does reappear, he's changed a lot and it isn't explained. I was left painfully in the dark, so I can only hope this is less vague with the manga.\\n\r\nOnce again, the problems are due to the short amount of episodes and are therefore pretty much unavoidable.\\n\\n\r\nOverall I really liked a lot of the new characters, and they made me feel for them, and cry over them when it came to that.\\n\\n\r\nEnjoyment: 10/10\\n\r\nI marathoned this show in two days because Netflix had just put the whole show up, and I had already seen Labyrinth of Magic, so I was able to speed through Kingdom of Magic really quickly. It kept me glued the whole way through, and I definitely shed many tears in the episodes leading up to the ending, as well as the ending itself.\\n\r\nWhile I did have issues with the moodkilling comic relief moments and the dub, the discomfort it caused me wasn't enough to impact my overall enjoyment.\\n\\n\r\nOverall: 9/10\\n\r\nSome issues and hanging questions, mostly due to the constraint of 25 episodes, but even accounting for those it's a really solid show and impressed me time and time again with the depth of the narrative, the dynamic and varied characters, and the awesome animation.\\n\\n\r\nSo if you're still reading this and you haven't seen Labyrinth of Magic, go watch it, and then watch Kingdom of Magic. Magi is overall a really solid and important show that not enough people seem to watch, which is a shame since it's so good. Now all we need is a third season.",
            "date": "2014-11-09T10:13:00+00:00",
            "helpful_count": 104,
            "mal_id": 167985,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Leopah",
                "username": "Leopah"
            },
            "url": "https://myanimelist.net/reviews.php?id=167985"
        },
        {
            "content": "Yeah you read my ratings right, its that brilliant.\r\nThis anime gave me the vibes of F/Z. However unlike F/Z which fills you with despair, this fills you with hope and warmth. That is this show's huge plus.\r\nThe animation is spot on, vibrant and easy on the eye. The colours used are beautiful and aesthetically pleasing. The music is brilliant. Specially the the ending 2 of 2nd season. The in-show music is amazing actually, this just didnt get a 10 from me because the in show music was too soft, make it louder guys, we love it. The story is refreshingly original, though its like F/Zwhere several people fight for an ultimate prize, instead of heroic spirits and masters, we have here kings and magis. However the plot is more widespread than F/Z, however it fails to reach the \"super-epic\" levels of F/Z so the slight deduction in marks. About the characters, ths was supposed to be a chldren's anime, never dreamt of any character development but I was stunned with the brilliance in which this anime treated its characters in both seasons. And hell yeah I enjoyed the show.\\n\r\nVerdict:- The sad moments reminded me of Naruto, the pace of the story reminded me of FMAB, the story reminded me of F/Z, the magic reminded me of Fairy Tail, I dont need to say more, Go watch it guys you wont be disappointed.",
            "date": "2014-08-07T13:51:00+00:00",
            "helpful_count": 42,
            "mal_id": 155689,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776603.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Axel_Blaze",
                "username": "Axel_Blaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=155689"
        },
        {
            "content": "I'll start by saying that I'm both surprised yet not that this anime isn't as popular as it could've been (by far). As my first review, this might be paced awkwardly so bear with me. That being said, I've watched dozens of animes and can easily say this one is review-worthy :3\r\nThe first season aired 2012-2013 while the widely famous Attack on Titan/Shingeki no Kyojin became and instant hit (not surprising! I thoroughly enjoyed that anime as well!) that same year; claiming a lot of attention and leaving equally worthy animes-- Magi being one-- overlooked.\r\nI hadn't even started watching the first season until recently sinceI wasn't sure whether it was really going to be good, what with the lack of popularity and reviews. However after watching, I can say that this was the freshest breath of air I've had in a long while C:\\n\\n\r\nAlso, I made the mistake of mistaking this for the first season which is partially the reason why I dropped it after watching the first episode ^^; (Oops) That being said, you will want to want Magi: Labyrinth of Magic first if you have not! \\n\\n\r\nNow then!\\n\r\nStory: 9/10\\n\r\nThe story is quite the interesting one! I love the take on the classic middle-eastern/Persian story One thousand and one nights, and though I am no expert on Persian history or culture, I recognized the names Aladdin, Alibaba, Morgiana, and Sinbad right away. But make no mistake, this isn't a mere retelling! It takes the foundation from 1,001 Nights for the basic character personalities and likeness, but adds a completely new twist to them. It's a heartwarming adventure with a nice touch of comedy and the faintest hint of possible future romance but hardly any at that. With that being said, I don't want to spoil any of it, but this was definitely one of Magi's strong points. As an artist and writer myself, I did catch tiny plot-holes and inconsistencies however given that the series isn't finished, I will be looking forward to seeing those explained. So for that, I give it a 9!\\n\\n\r\nArt: 10/10\\n\r\nAbsolutely loved it! I'm a sucker for comedic chibis to lighten up the atmosphere, and this was no exception to that! Although whether or not you like the art style is up to your personal preference, the animation was solid and the colors were full of life. Not much more to say. For what it is as an anime of this age, it gets a 10 from me!\\n\\n\r\nSound: 10/10\\n\r\nI feel like this is more of a personal preference type of thing. But I definitely loved the combination of Persian tunes with a modern touch. I found the soundtrack fitting and everything from intense fight scenes to the opening and ending tracks all flowed smoothly. 10!\\n\\n\r\nCharacter: 9/10\\n\r\nThis is yet another strong point of Magi. Your main characters grow so much. It's hard to say without spoiling some of it, but Aladdin, Alibaba, and Morgiana start and end in the 50 episodes of both season as different people. Both mentally and physically (which was nice to see the physical growth as well! Especially in season 2!)\\n\r\nI definitely think the secondary characters didn't show much change (Sinbad, etc), though that wasn't too much of a surprise. Some did feel a little cliche-- Sinbad seems to me like your typical badass guy who can take on anything. There were hints of a darker side and perhaps his past but in the present, he isn't growing as much even though his presence is rather significant in the series. That being said, a side-manga is being published of Sinbad's past which should be interesting to read. Overall, characters get a 9. They're unique, have their own personalities, and what makes it for me ultimately is that you can relate to them. As much as Alibaba's weakness annoyed me, or Morgiana's stubbornness, etc, you can relate to them.\\n\\n\r\nEnjoyment: 10/10\\n\r\nFun fun fun! What can I say~ Finished both seasons in a matter of days.\\n\\n\r\nOverall: 9/10\\n\r\nIf this gets a third season (which I'm crossing my fingers for), then I'll hopefully be back to write a review that sums up more. Otherwise, this goes to my top favorites. My most favorites being Fullmetal Alchemist Brotherhood, Rurouni Kenshin, and the like. Although this comedic yet moralistic anime really does it for me. \\n\\n\r\nGive it a go! If you're into adventure, action, and that slice of comedy, then this is a great show for you!\\n\\n\r\n:D \\n\\n",
            "date": "2014-06-02T16:16:00+00:00",
            "helpful_count": 30,
            "mal_id": 145555,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3593375.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Capukat",
                "username": "Capukat"
            },
            "url": "https://myanimelist.net/reviews.php?id=145555"
        },
        {
            "content": "The realm of \"Shonen\" Anime & Manga is encompassed by two major things: Conformity and Mediocrity. The term itself; \"Shonen\",  immediately conjures a vast plethora of negatively inclined connotations, many of which are based off of only a small array of relatively insipid and generic titles, thus leading to an offhanded generalization that \"It's shonen, it must be bad.\",  leaving many other unknown titles failing to receive the attention they may or may not deserve.  This seems to have muddled a lot of the thoughts of the average anime viewer, and so when one is suggested a title, say, \"Magi: The Kingdomof Magic\", interest is initially sparked, only for it to dwindle down as quickly as it began upon their reading of the genres MAL gives (Shounen, Action, Magic etc.). Thankfully, the Magi Series gives us a refreshing and more mature indication of what a shonen series is capable of producing - A masterpiece.\\n\\n\r\nWhat Magi does to differentiate itself from it's counterparts in the genre is that it does not rely solely on fighting or mind-games  to solve the various conflicts that appear throughout the entirety of the show. While Magi does have it's fair share of Shonen-esque battles (Which mind you are absolutely stunning), Magi is a show which also has a heavy political and ethnic aspect towards the roots of it's overall story. The characters are faced with a range of different situations in which they must go through, and a lot of these encounters are heavily laced with issues that are incredibly relatable to our contemporary society. From political warfare to the most heated of battles, Magi definitely has a a variety of ways in which conflicts are solved which will keep you guessing and on your toes in tense anticipation of what is to come next. \\n\\n\r\nExpanding on the political and ethnic aspect of the story, Magi serves as a commentary of sorts on our society as a whole, raising considerably harrowing and terrifying questions as to whether our society is wrong or right in our actions both past and present. Though not majorly enforced and implied, the messages are there. From racism, discrimination and segregation, poverty all the way to the harsh and chilling realities of what a war does to a nation and it's inhabitants, Magi's storytelling is fantastically intertwined with social, political and ethnic problems/morals that we as a society seem to blatantly ignore. This critique is what truly makes Magi shine above above the rest, the only other shonen which consistently deliver the same level of complexity in story Full Metal Alchemist and HunterxHunter.\\n\\n\r\nEveryone in Magi has a role. Whether it be to act merely as a stepping stone for something greater or to bring calamity to the world, each character in Magi offers something different, something new, something exciting which will crack the biggest of smiles, the saddest of frowns and everything else in the spectrum of our emotions. Whether it be the ever-cheery, mysterious and hilariously perverted protagonist Aladdin; the altruistic, reckless and ridiculously relatable deuteragonist  Alibaba Saluja or the beautiful, shy and incredibly powerful glutton Morgiana, the characters in this show are by far it's highlight. The interactions between these characters are alluring and entertaining as well as thought provoking. Paying extra detail to the words and looks exchanged between individuals is key, as one line you heard here will have vast relevance and foreshadowing to scenes of future events. Each character is well developed, every mistake and step forward made adding to their maturity and sophistication, further personalizing each individual into distinguishable, multi-dimensional characters. With fantastic writing put into every one of the cast as well as brilliant voice acting (Yuki Kaji and Kana Hanazawa just to name a few), you are bound to fall in love with at least one of the characters this show has to offer.\\n\\n\r\nThe world Magi is set in is one based on the classic tale, \"1001 Nights\", however, do not let that trick you into thinking Magi: The Kingdom of Magic has it's foot firmly planted only in one era, quite far from it in fact. Though we are initially faced with the classic Arabian setting, the blazing sun encroaching everyone to take shade, Magi's setting is one of many cultures and religions all jumbled together into a brilliant mess. From Imperial China, the streets and slums of India, Lebanese architecture and trade all the way to bloody Gladiatorial bouts to the death in Ancient Rome, Magi has a dip of just about any mainstream ancient culture, cultivating an immensely enchanting and fascinating universe. How these different areas are explored and expanded upon are brilliantly done, the ways in which we are shown what each setting has to offer and how our characters traverse such interesting areas something I, despite the countless moments of watching over and over, will never lose interest in. \\n\\n\r\nMagi's artwork, both source material and adaptation, are both phenomenal and breath taking. As mentioned earlier with Magi's multicultural diversity in setting, different places give you completely different appearances, each character design becoming more unique and amazing as the one before. Though the main characters do have some generic hairstyles and colour, it is easily dismiss-able when faced with what the rest of the cast and surrounding environments have to offer. However, there are some instances (backstreets in urbanized areas especially) where a lot of the structures look copy-and-pasted, which is a great shame, given the fantastic and creative art style this series brings. Coupling the visuals is a soundtrack that truly knows it's purpose - that is, to add atmosphere to scenes where mere dialogue is simply not enough as well as fully encapsulate the audience into the theme of the show, which in essence is the Arabian Nights. With Shiro Sagisu behind it's score(Bleach, Berserk, Evangelion etc.),  Magi's soundtrack acts almost as invitation into the world itself, each track truly capturing the emotion it's accompanying scene is trying to deliver. Though not the most spectacular, Magi's soundtracks are most definitely memorable, some tracks you will find yourself dying to find out the name of upon hearing.\\n\\n\\n\r\nIn conclusion, Magi: The Kingdom of Magic is an anime you will most definitely not regret watching. With it's compelling themes and complex storyline as well as an expansive world filled with a variety of lovable and relatable characters, Magi has created an unforgettable experience which simply cannot be missed. Whether you're a fan of politics, or just want a fun yet intelligent shonen series, look out because Magi: The Kingdom of Magic has arrived and will clear you of depravity!\\n\r\nIt is highly recommended for you to have viewed the Prequel series, \"The Labyrinth of Magic\" before watching The Kingdom of Magic as major plot points and character developments are addressed.",
            "date": "2015-07-23T09:51:00+00:00",
            "helpful_count": 20,
            "mal_id": 194130,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3426467.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RedCloudNinja",
                "username": "RedCloudNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=194130"
        },
        {
            "content": "~ No spoilers, but I will assume that you have already seen Magi: The Labyrinth of Magic~\r\nMagi features a story driven plot supported by a HUGE cast of characters. As the mysteries of Aladdin's origins and the abnormalities in the world begin to unfold, this series manages to turn the prequel on its head with its increased intensity and scale. No longer is this simply a story of a lost boy trying to find himself in the world, but a much grander chain of events that shake the world.\r\nAlong with the bump up in scale of events, Magi: The Kingdom of Magic played out anumber of deeper themes, touching on topics of social hierarchy, moral superiority, order and chaos, and what we choose to spend what little time we have alive doing. These themes interact with the cast of characters to create a deeply woven plot that is beautifully written and presented as we follow Aladdin on his journeys.\\n\\n\r\nThis series includes some action, however, the action scenes sort of take a backseat to long dialogue and storytelling. I liked the action sequences much better than the first series, but keep in mind that, while they are very well animated, the story of Magi is not really a story that relies on a lot of action, and therefore is not very realistic in terms of battles. \\n\\n\r\nCharacters in Magi are varied and plenty, each of them unique and carrying depth that is not often seen in other series. What I love about these characters is that they are never truly who you expect them to be. Several characters who were introduced in the first series reveal a much deeper history to their characters. A meaningful message to take from this show is that a first impression is only ever a scratch on the surface of somebody who is much more than you think they are.\\n\\n\r\nMagi's production values were absolutely magnificent. Episodes were meaningful from the absolute beginning to the absolute end, and openings and endings were polished works of art. I almost never skipped an opening throughout the entire series. In addition, this show doesn't waste time on long summaries of previous episodes or previews of next ones - you won't find yourself lost transitioning from one episode to the next, but you won't get bored watching the same thing over again either.\\n\\n\r\nAnd finally, the art. Outstanding. Magi's distinct art style really shows itself in the level of detail and effort seen on the characters. Especially when Djinn equips are shown, I truly appreciated how much work was put into designing and displaying each character. Moreover, the art style of Magi follows closely of the previous series in that the bold use of color is splendidly displayed throughout the Magi world and is used to indicate both mood and intensity. This, along with the epic story and already well established soundtrack from the first series, brought tears to my eyes more than once.\\n\\n\r\nNeedless to say, I was very satisfied with this series. It started off, however, a little slow for my taste. The first 7 episodes were actually quite a drag for me. As Magi: The Kingdom of Magic is a continuation of an already existing series, it does not really pique your interest in the first few episodes with new content, but rather tries to ease you back into the story that is about to unfold in new, dramatic ways. After the story picks up, however, it really flies, all the way until the end.\\n\\n\r\n10/10",
            "date": "2014-10-24T03:14:00+00:00",
            "helpful_count": 19,
            "mal_id": 165983,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rh59kr7",
                "username": "rh59kr7"
            },
            "url": "https://myanimelist.net/reviews.php?id=165983"
        },
        {
            "content": "If it’s only enjoyment that you are after, then Magi: The Kingdom of Magic may suit your taste and entertain you well but if you are looking for an anime that has depth, then this may not be the closest one. Whether which is which, don’t get your expectations too high!\r\nThe story was interesting but there were major flaws such a lack of consistency and coherence. For one, a lot of information were unconcluded and simply left behind without explanations. For example, as from the title says, a magi is gifted magician who is tasked to choose a king candidate. Magis were mentioned frequently butthey weren’t given a particular depth of information or significance just like how one of the few magis barely did anything despite appearing the last few episodes of the show. Their importance was then very questionable. Second, the direction of the story is, least to say, inconsistent. The arcs, over time, tend be more unrelated and separate from the story. At one point, I was thinking as to where the story is really going to – the concept isn’t misleading, the delivery is.\\n\\n\r\nHaving a vast roster of characters with diverse personalities, perhaps abilities in this anime, could easily pique an audience’ interest. But while it raises expectations for viewers, failing to satisfy or reach the viewers’ demands could cost a reputable damage. While watching Magi, I constantly remember Fullmetal Alchemist Brotherhood as it reminded me of how many characters were introduced throughout its run but after finishing Magi: The Kingdom of Magic, I was able to tell the difference wherein FMAB succeeded and Magi failed. To make it clearer, several characters lacked background and significant role that it made them seem as mere decorations to make the show more appealing. Just when I thought a character is going to play a big role in the story after stepping into the light, the show drifts away from that character and wanders off to another focus. Other than that, the development of the three main characters were great but for the others, it just wasn’t that good.\\n\\n\r\n\tWhen it comes to the production, I couldn’t really tell anything wrong about it as the animation was great and the music even better. The soundtrack is what I found to stand out the most for its variety of tones suited perfectly for each mood and situation. I still think that the show is fun and highly entertaining despite of all its strengths and weaknesses. I myself wouldn’t watch an anime just to write reviews about them – enjoyment comes first!\\n\\n\r\n\tWith this, I would say Magi: The Kingdom of Magic is an average of its type. Although there can be flaws that are not noticeably erroneous but rather bothersome, you can still look away from them and enjoy the show because after all, the fun factor is this anime’s lead.\\n\\n",
            "date": "2016-11-28T06:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 234543,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5845415.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RavenSkye",
                "username": "RavenSkye"
            },
            "url": "https://myanimelist.net/reviews.php?id=234543"
        },
        {
            "content": "This review is for the second season of Magi, so expect light spoilers for season one.\r\n\tSeason one of Magi was a good watch overall, but it left a lot to be desired. So is season 2 a step up from the original, or is Magi simply overstaying its welcome? Well to answer that, first, we have to look at where we're at.\r\n\tAfter Sindria is saved, Aladdin, Alibaba, Morgiana, and Hakuryuu all decide to go their separate ways to become stronger. Morgiana to return to her homeland, Alibaba to hone his Magoi control, Hakuryuu to claim his revenge, and Aladdin to investigate the country of Magnostadt,rumored to have ties with Al Thaamen. But war is brewing on many fronts, and the secrets of Magnostadt may be darker than anyone ever imagined.\\n\r\n\tAs you can see, the plot of season two is already tighter and more focused than its predecessor. It's also considerably less rushed as well. That said, the first twelve episodes are somewhat of a snooze and aren't really all that interesting. They're not bad, and they certainly build the world nicely, but the conflicts are on a much smaller scale than the rest of the series. In Labyrinth, we had two country-wide clashes, which while a little anticlimactic, had a very large scope to them, whereas in Kingdom, the most interesting thing that happens in the first half is a Colosseum duel. \\n\r\n\tBut when Kingdom wants to get rolling, it gets rolling. The final third has some really engaging and sizable battles, while not making up for the earlier bore, certainly keep one's attention. They actually have a lot of tension, and give off a sense of danger, even if the finale is a little underwhelming.\\n\r\n\tIt's a shame that when the series reaches this high point, A1 Pictures decides to lower the budget. There are a few cuts early in the show, some looking downright awful, but at least they're brief. In the final third, the palette looks murky, the animation gets choppy, and the artwork loses almost all of it's detail. It's not unwatchable, but it certainly looks cheap compared to the rest of the show, which still holds up quite nicely. I can also give the animators credit for the fight scenes, which overall are very well choreographed, a big step up from season one. \\n\r\n\tOn the other hand, the soundtrack is pretty much more of the same, but not in a bad way. The tracks still use a lot of electric guitar, and they still have a middle-eastern feel, which is great! The battle tracks do a great job of building tension, some feeling gritty, some feeling regal, and some feeling surprisingly retro. Nothing feels out of place though, not even the English lyrics that show up in the choir pieces, all of which are ominous and sinister. Shiro Sagisu really hit it home.\\n\r\n\tBut cool songs on their own don't make a show great. Magi was never the most coherent show around, but sometimes Kingdom just gets ridiculous. Ridiculous like sticking the landing to a hundred foot fall, or breaking out of hypnosis through the power of friendship. I get that it's not trying to be all that realistic, but I can only suspend my disbelief so much, especially when the show gets as cliché as it does.\\n\r\n\tThese moments would've been a lot worse if not for the lovable cast, which gets some pretty hefty additions this time around. There are the Kou Princes, the Reim generals, the Magnostadt wizards, hell, there's even an entire troop of Fanalis badasses. Since there's so many, most are fairly one dimensional, but their personalities alone are more than enough to make you remember them, which at the end of the day, is all a side character needs to do.\\n\r\n\tBut that's not to say there weren't some standouts. Aladdin's rival Titus grows a lot over the show, and pulls quite a few heartstrings along the way. Him and Aladdin have very interesting chemistry, being so alike yet so drastically different. \\n\r\n\tThe two of them get the most focus, with characters like Morgiana and Hakuryuu being absent almost the entire time. Even Alibaba takes a back seat, which is definitely a risky move. I think the original four have a tighter dynamic overall, but Titus is worthy of the change for the most part. \\n\r\n\tThe real showstopper though, is Mogamett. His mindset is clearly warped, but every time he speaks, you just find yourself agreeing with him, even though you know what he's saying is wrong. His story is very believable, and it's quite easy to understand where he's coming from. He's a perfect fit for Kingdom's theme of racism, which admittedly is handled quite well.\\n\r\n\t The entire setup is extremely realistic, and we're given good insight on both opposing perspectives. The ending is a little too picture perfect, but the Magnostadt conflict is wrapped up quite nicely. There's some sequel baiting at the end, and definitely more stories to tell, but with Magi's success, a third season is almost guaranteed.\\n\r\n\tIf you liked Magi season one, you're going to like season two, and really have no reason not to watch it. The animation is pretty inconsistent, and there are holes in the plot, but if you're looking for a rich world with a lot of heart, you won't be disappointed. Is the show groundbreaking? No. Is it a solid watch? Yes. I give Magi: The Kingdom of Magic, 3 (out of 5) stars.",
            "date": "2015-02-20T16:42:00+00:00",
            "helpful_count": 17,
            "mal_id": 180865,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4004411.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AlexJetski",
                "username": "AlexJetski"
            },
            "url": "https://myanimelist.net/reviews.php?id=180865"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nSomething that people often do is \"fighting for what is right.\" This comes in a variety of forms, such as protecting the weak or exacting justice on the sinful. But it becomes interesting when it is more of a grey area. What do you do when someone is fighting a battle with seemingly good intentions but harboring ideals that go against what you believe? In the second season of Magi, Magi: The Kingdom of Magic explores this idea while still maintaining the balance of comedy and action that has made it so popular today.\r\nSTORY\r\nM:K starts where M:L leftoff. That is, Aladdin, Alibaba, and Morg have come back from the previous dungeon. However, all three of them decide that, in order to become stronger, they must journey on their own to find the path that will unlock their full potential.\\n\\n\r\nThis time, the show is split up into about four separate arcs: the journey as a group, their separate paths, the magic country arc, and the war arc. This is important because the show does something very well, and that is balancing exposition and action. Given what M:K is capable of in terms of its world, having more than just the characters duke it out all the time is important. And this is something that the show handles nicely. Learning about the different countries, understanding the Magi and the Djinn, comparing and contrasting the differing sides of the conflict; these are all things that the show develops when it isn't showcasing battles. Don't get me wrong, the battles are definitely fun to watch. But for me, learning about this world that I have spent almost 50 episodes watching is way more fulfilling.\\n\\n\r\nAs mentioned in my preview, one of the central themes in M:K is the idea that what someone fights for may seem wrong on one side but entirely correct on the other. This is a case of perception, or where one's ideologies lie. Learning to overcome ignorance in this regard is a huge step in becoming a mature human being. The show tests the audience's ignorance by showcasing this very same issue. There are multiple sides vying for conquest at the same time. In terms of technicality, everyone is right, because their fighting for something that they believe in. Now, this also makes them wrong, but only if you view it as such. These types of ideas can be applied to real life as well (such as current issues in politics and war), and the dynamics at play within Magi demonstrate this somewhat higher level of thinking.\\n\\n\r\nIf I was being nit-picky about the way in which the story was told, it would be that, despite all the explanations they give, it still wasn't enough. There are many questions left unanswered to the viewer when the season wraps itself up. However, I understand that a lot of them, for the moment, could not or can not be explained. The ending itself is fine for what it is, but a third season is absolutely needed to truly finish off Magi and to fully answer these immediate questions that have been raised.\\n\\n\r\nANIMATION\\n\\n\r\nM:K, like its predecessor, maintains its animation quality...for the most part.\\n\\n\r\nThe art style is the same as the first season. The show mostly sticks to one or two locales, so the majority of the \"flair\" comes from the characters and their designs. The show's ability to make the characters look unique and cool both in normal form and in Djinn Equip form makes it pleasing for the eye. On top of that, the fight scenes themselves are filled with massive explosions, many enemies, magic, and crazy acrobatics.\\n\\n\r\nThe actual animation for the show is almost always of good quality. However, there are times when it does dip, and it is noticeable. Whether this is having immobile characters or refraining from showing what characters are doing, there are times when corners are cut. It happens mostly during the final quarter of the season, so it was a shame that it had to end on a somewhat lackluster note.\\n\\n\r\nCHARACTERS\\n\\n\r\nM:K's characters this time around are a massive step forward from what M:L had to offer.\\n\\n\r\nM:L mostly focused on Aladdin, Alibaba, and Morgiana. This time, Alibaba and Morgiana after the first quarter of the show are almost entirely forgotten, and the focus switches to one old and two new characters: Aladdin, Mogamett, and Titus.\\n\\n\r\nAladdin's role this time isn't so much to develop as a character so much as he is a vessel (pun intended!) to expand on the world. His gain in knowledge is parallel to our gain in knowledge. Meaning, the things he learns and encounters give us insight into the world of Magi. At most, Aladdin becomes quite a bit stronger in his time at Magnostadt, but beyond that, he doesn't necessarily grow as a character. He doesn't witness hardship, nothing about his origin is revealed, and his character traits and personality remain mostly intact. This is all quite interesting because, being the center of the show, you would expect him to change somewhat. But that isn't the case here, because it doesn't need to be, thanks in part to the other two.\\n\\n\r\nTitus is a new character introduced about half-way through. Determined, strong, and emotional, he values life and the things that it provides. Not really having a place to call home or a family to hold dear, much of what Titus goes through are things that kids learn about in their early years. And much like a kid, his decisions and outlook on life itself is somewhat warped until he receives help from the many different people around him.\\n\\n\r\nBy far the most interesting and probably most important character this season was Mogamett. As the leader of Magnostadt, Mogamett is both a fatherly figure to his students and a stalwart fighter to his people. He is a very well done villain because he really isn't. While you may hate the things he says or does, his justifications and reasoning make sense. His stance on magicians and humans goes hand in hand with my previous sentiment on the ideologies people have. As a viewer, you both like and despise who he is, and in this case, his characterization works wonderfully.\\n\\n\r\nM:K has a ton of other characters, such as Hakuryuu, Scheherazade, and Sinbad. Their roles exist and do take precedence during certain parts of the story. But for the most part, their tale (for now) was and is inconsequential to the other characters.\\n\\n\r\nIf anything, I wish they had more Alibaba and Morgiana. I felt that they received the same treatment as Sinbad did in season one. That is, they are these great characters with seemingly good backgrounds and characterization, but they are either underutilized or cast aside in favor of other characters. This may just be a product of the genre it is in, but when these two comprise two-thirds of the main cast and they are barely used, that is definitely a problem in my eyes.\\n\\n\r\nSOUND\\n\\n\r\nThe first OP for M:K definitely fits for the mood of the first half of this season: uplifting and filled with the hope and desire of becoming something more. But for me, I'm personally not a fan of the song. The second OP, however, I am. It's strangely fun to listen to, both on its own and in conjunction with the events of the second half of the season.\\n\\n\r\nThe first ED perfectly matches with the visuals, in that it gives off this immense feeling of longing and wanting to be with the ones you love. The second ED is oddly hip-hop-ish and doesn't particularly mesh well with the show. I think it was aiming to create a sense of conflict by showing the many different characters in its visuals, but the song itself doesn't do this in any way, shape, or form.\\n\\n\r\nThe soundtrack is nicely done once again. There are darker pieces, the more Egyptian pieces, and the melancholy pieces, too. They complement the mood well when they are used and never feel out of place.\\n\\n\r\nVoice acting wise, I found every role to be fine. There were no outstanding performances by anyone, but everyone involved did at least an above average job.\\n\\n\r\nENJOYMENT\\n\\n\r\nI really wanted to enjoy M:K more than I did with M:L, but I couldn't.\\n\\n\r\nThis may sound like I didn't enjoy M:K at all, and that is absolutely not true. M:K's comedy is right up my alley, the fights are generally awesome to see, the characters are interesting, and the world is vibrant. But M:K once again succumbs to the same pitfall that M:L did, and this time it is in the separation of the characters. I understand that it is or was needed to develop the world and the characters equally. But Magi is strongest when the main three, Aladdin, Alibaba, and Morgiana, are together doing what they do best. And that is hanging out, fighting bad guys, and just plain having fun. Taking this away kind of makes the show feel somewhat empty or disjointed. They constantly reaffirm their relationship in the OPs, EDs, and throughout the show, but for the majority of it, they are never together.\\n\\n\r\nI want to point out one character relationship that I hate with a passion. And that is what transpires between Hakuryuu and Morgiana. Not wanting to spoil anything, I just want to say that if they go down the route that they presented in the show, I will definitely loathe it. Due to what happened and where things left off, I've been given no reconciliation otherwise. To be honest, because of what happened between the two, it made me want to make sure that nothing was going to come of it. And not getting the answer I was looking for is quite frustrating, to say the least.\\n\\n\r\nIs Magi: The Kingdom of Magic better than its previous season? I would say yes. While it does capitalize in a few of its weaker areas, it still tends to make the same mistakes over and over again. However, as they say, three times the charm!\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, wonderful balance between exposition and action\\n\\n\r\nAnimation: Good, art style and actual animation quality see brief drops\\n\\n\r\nCharacters: Good, great new \"villain\" and allies but underutilized main cast\\n\\n\r\nSound: Good, some good and bad OPs and EDs, nice soundtrack and VAs\\n\\n\r\nEnjoyment: Good, needs more Aladdin, Alibaba, and Morgiana, and infinitely less Hakuryuu\\n\\n\r\nFinal Score: 8/10",
            "date": "2014-10-21T23:48:00+00:00",
            "helpful_count": 15,
            "mal_id": 165693,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=165693"
        },
        {
            "content": "Magi: The Kingdom of Magic is the second season of Magi: The Labyrinth of Magic. For those of you who have not watched the first season, I highly recommend it unless you have zero interest in the fantasy-action-adventure genre. For those of you who have watched the first season, the good news is that Magi II does not disappoint. Everything that you enjoyed and liked about Magi, whether it be the diverse cast of characters, the battle orchestration, or the plot development, Magi II delivers. \r\nMagi II begins with the night after the battle at Sindria, after Sinbad and his people repelled the attack fromAl Thamen and after Hakuryuu obtained Zagan. Alibaba, Aladdin, Morgiana, and Hakuryuu then left Sindria and went their separate ways. Hakuryuu went back to Kou Empire, his intent revealed shortly into the season. Alibaba went to Rem Empire to work on his control over his djinn Amon. Morgiana went to find her fellow Fanalis people so she can learn about their past. Aladdin went to Magnostadt to investigate the origins of dark metal vessels and learn magic. Although Magi II spends some time on Hakuryuu, Alibaba, and Morgiana, most of the screentime is (rightfully) dedicated to Aladdin's time in Magnostadt, as the main plot develops from there. It takes a lot to carry a grand plot with a diverse cast of characters and still maintain layers of complexity that are only slowly peeled back as the story progresses. But Magi II manages to do just that. While the pacing might be a bit slow to start, I personally thought it to be one of the most satisfying series I've watched as things came together at the very end.\\n\\n\r\nIn addition to how the plot evolved in Magi II, it builds on Magi I in at least a few other respects. The way battles play out, for instance, are much more  impressive with Alibaba, Morgiana, and Aladdin all becoming more powerful.  But I think what's made it such a memorable season 2 is that by cutting away time from Morgiana and Alibaba, Magi II gets to spend a lot of time introducing new characters and portraying them in detail. This is an especially encouraging sign because by revealing more about each side, Magi moves away from the conventional good versus evil paradigm and gives us a little grey area. By the end, you really will find the entire cast having grown on you.\\n\\n\r\nVisually, I think Magi II sometimes looks like it's on low-budget. But I think that has less to do with its budget size than the style of the manga (the artist is notorious for sometimes drawing sketch-style art). Magi II, like Magi I, has almost zero CGI involved. Whether that’s good or bad is up to you to decide, but I think that stylistic choice continues to work well for this franchise. Sound-wise, Magi II features a good enough soundtrack. The first OP and ED are somewhat average, but the second OP and ED are very good and in my opinion makes up for the first ones. Unfortunately  the music is otherwise decent but unimpressive. The soundtrack is indeed one of the weaker points of Magi II, but at least does nothing to make it less enjoyable.\\n\\n\r\nMagi II picks up right where Magi I ended and immediately delves into an amazingly well put together adventure. For fans of the series, there's no reason to not continue with this second season. As for those who're scouting for something new to watch, both seasons of Magi have great entertainment value and it’s a franchise that shouldn't be missed -- which the ratings also attest to.",
            "date": "2015-01-17T18:09:00+00:00",
            "helpful_count": 15,
            "mal_id": 178253,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1212393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zannett",
                "username": "zannett"
            },
            "url": "https://myanimelist.net/reviews.php?id=178253"
        },
        {
            "content": "This series or aptly put the second season of Magi franchise is filled with themes of exploration and adventure. The story is a unique spin on Arabian Nights and creators have made it highly intriguing and fascinating by giving new shapes to our favorite characters. I liked it because I was excited by seeing the new Avatars of my beloved characters. It was exciting to see an all star squad of heroes. \r\nAs far as originality in story is considered this series has won grand respects. The central character Aladdin goes on many adventures and makes new friends. Aladdin has ofcourse his Djin with himbut his character is so much more captivating than the original one. Here he travels finds new comrades and fights battle and becomes stronger. His supporting characters, actually other heroes from Arabian nights are never his second in command or dependent upon his unique gifts. Each one progresses with him and becomes stronger, enough to fight and win their own battles. \\n\r\nAladdin is out of world character and most of the series is his journey for finding meanings of spiritual questions in life.\\n\r\nInteresting thing about characters is that almost all of them are shady and prone to darkness and evil. None is so pure and heroic that they can and will never do anything wrong and everyone makes mistakes.\\n\r\nI will finish here that Magi is an upcoming promising franchise and everyone should watch it. It is better to watch it's entire season at one length or over a weekend because the story rises at fast pace in 25 episode sequence and finishes there itself. No need to go about wondering what will happen in series.",
            "date": "2015-06-10T04:18:00+00:00",
            "helpful_count": 14,
            "mal_id": 189987,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rorschach_kills",
                "username": "rorschach_kills"
            },
            "url": "https://myanimelist.net/reviews.php?id=189987"
        },
        {
            "content": "If you haven't watched Magi: The Labyrinth of Magic, then read no further but if you have, continue as want.\r\n------------------------------------------------\r\nIf you enjoyed the first series of Magi, you will love this even more! There are more characters that you have haven't seen yet. More battles. Everything.\r\nStory: 9\r\nFrom the first series of Magi, to this, there is a battle of light vs. dark. An constant struggle for power. The Al-Thamen is the organization bent on destroying the world, sucking all the ruka from all lifeforms. Aladdin, Morgiana, Alibaba, Hakuryuu, all have something to complete. They set on a journey to find themselves and become stronger. KingSinbad has his priorities. Everyone knows he is a sly devil. But with Hakuryuu, there is an internal struggle with his mom. Al-Thamen have their leashes on Kou Empire. What will happen? You have to watch the anime to figure that out.\\n\\n\r\nArt: 9\\n\\n\r\nI have no complaints against the artwork. I enjoyed the characters designs and the djinn equip was something amazing to look at.\\n\\n\r\nSound: 9\\n\\n\r\nAll the characters voices were spot on, that is if you used Japanese subtitles, if not it would be some horrible voice acting. The openings are pleasant to listen to and the music in the anime is nice.\\n\\n\r\nCharacter: 9\\n\\n\r\nCompared to most anime, this has a huge lineup of characters. Most of the time when this is done, it is executed poorly but this isn't the case. You get to see the characters lives, personalities, and how they interact with people daily. I'm very impressed of how the characters are dynamic and continued to grow threw the series. \\n\\n\r\nEnjoyment: 10\\n\\n\r\nThroughout the series, I had myself chuckle because their is some \"WTF\" moments but that is what made this Magi. The fights were awesome and were different than a typical Shounen. You will not be let down if you watch it.\\n\\n\r\nOverall: 9\\n\\n\r\nThis anime is something that should be cherished. I highly recommend it to anime. It is not your average run of the mill Shounen. NO, it is something better. Further unique that sets itself apart from shows like Fairy Tail, Naruto, One Piece, etc. You will learn to appreciate for what this anime has done. Of why it got the praise. You see the high rating. You'll understand why after you watch the first series and this one as well. You will not be disappointed, I stake my life on it.\\n\\n\r\nSo many emotions boil throughout, laughter, sadness, happiness, are some feelings that I expressed. Not all anime does that where you can relate to it. But this anime surely did so. I wish there was another series to go after but we'll see. We can only hope...",
            "date": "2015-01-11T00:10:00+00:00",
            "helpful_count": 13,
            "mal_id": 177351,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2864133.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dustinator1991",
                "username": "dustinator1991"
            },
            "url": "https://myanimelist.net/reviews.php?id=177351"
        },
        {
            "content": "-\r\nAs per usual, this is part of a video review on youtube, and I'm proud how this turned out, so go watch/listen to it over there ~ \r\nhttps://www.youtube.com/watch?v=7i260HcpLSE\r\n-\r\nLike „The Labyrinth of Magic“, this is a fantasy-adventure borrowing themes from all around the world. Again, it was animated by studio A1-Pictures and directed by Masunari Koji. Obviously different is the original date of airing, which is now Fall 2013, and it adapts chapters 111 to 196 of Ohtaka Shinobu's manga.\r\nAfter the events of season 1 and successfully conquering the dungeon Zagan, our heroes stand before the question of what to do next. Stay in Sindria withSinbad or journey to another country? While befriending Dunya, the corrupted princess they fought in the dungeon, Aladdin decides to travel to Magnostadt, country of magicians and apparently source of the dark metal vessels. Much to Alibaba's dismay though, the wants to go there on his own. Morgiana decides to travel to Katarr, her homeland, and Alibaba still has problems with his full Djinn-Equip, for which he travels to the empire of Reim in the west, while Hakuryuu is called back to Kou.\\n\r\nWith the main cast parting ways, the focus of the story shifts, following only Aladdin with two episodes exception dedicated to Alibaba and Morgiana respectively. We do learn a bit more about Hakuryuu, especially what his reasoning for hating the current Kou empire is, but all 3 are as good as forgotten for the bigger part of the show.\\n\r\nGenerally though, there is not as much focus on any of the characters, except Mogamett, the director of Magnostadt's magic academy, which is basically Hogwarts, and Titus Alexius, a magician from Reim introduced after the first half. We also learn about many new characters, like the leader of Al-Thamen, the rest of the magi, and Kou's royal family, all with distinct characteristics and features. Sinbad also finally proves what a terrible person he is.\\n\\n\r\nThe focus taken from developing the main characters is set on developing and explaining the world instead. There's a lot of exposition on how magic works and the different empires. Sadly, that exposition is mostly dumped on the viewer and with the exception of the climax, there's as good as no action present, making this more a show about being told stuff, rather than an exciting adventure.\\n\\n\r\nThe missing action makes the first half at least passable to look at, as a drop in quality from the first season's start is already noticeable from the beginning, but at least doesn't hurt yet. The show does spend a lot more time in this chibi-style though, which I didn't appreciate. In contrast to its predecessor, I did notice a lot more bad CGI, and even a lot of it at unnecessary parts, like an army of soldiers looking all the same, but not moving. And there's a creature that's half drawn and half CGI, which looked absolutely terrible. Like season 1, the second half is incredibly lazy in terms of animation and wasn't fun to watch.\\n\\n\r\nThe soundtrack is mostly taken over from what we know of season 1, I personally hoped for more new stuff, but as it wasn't bad before, I won't complain.\\n\\n\r\nAnd now, once again, we pose the final question:\\n\r\nIs „Magi: The Kingdom of Magic“ worth the watch?\\n\r\nIf you're a big fan of season 1, this works well as an extension to the universe, but it's not a good show in itself. If you already struggled during „The labyrinth of Magic“, you won't get anything out of this. It's not just a build-up to a third season that doesn't exist, but at least a finished arc, so I won't say „wait for the next one before you watch it“. To sum it up: If you're interested, why not? But if you aren't, just ignore it and end your relationship with the franchise at this point.",
            "date": "2015-12-15T11:11:00+00:00",
            "helpful_count": 13,
            "mal_id": 205630,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3010187.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/UsaagiTsun",
                "username": "UsaagiTsun"
            },
            "url": "https://myanimelist.net/reviews.php?id=205630"
        },
        {
            "content": "A catastrophic collapse and blunder is what the kingdom of magic can be described as. It takes a weird direction in terms of storytelling, character building and world building and centers it around a conflict that is brought upon due to mere selfish desires. The first season subtly built its world through political conflict, internal strife between characters, and eccentric disney like environment/setting. The Kingdom of magic deviation from it's predecessor seemed like a wild decision because any viewer can tell from the first few episodes that Magi was taking a new approach in how it continues to build the world and characters. However, itfelt very superfluous because frankly, there wasn't enough screen time to continue meandering between characters and conflicts. However, the biggest fall was the central conflict because it developed from one's prejudice and was really underwhelming to create the abomination that was the enemy. \\n\\n\r\nNow the story begins right after the Labryinth of Magic, which directly involves the 4 people we follow in the beginning segments of the show. Now my problem right off the bat was how much screen time there was between the side characters. It seemed to have a lot of unnecessary interactions and most of the time didn't yield anything directly related to the story. There is way too many side characters for there to be any time to devote to all of them while still keeping up with the main core which is Alibaba, Aladdin, and Morgiana. The story maintains its comedic nature, relying heavily on chibi mode and funny reactions amongst the cast of characters. It feels at some points that the show didn't take itself seriously with many tropes that feel out of place, such as blushing for no reason. I can't comprehend what the writers were thinking when they decided to take the route of splitting the main cast. Of course, due to the nature of the story, it made sense that they wanted to split but it was a tall order to get enough screen time to each of them. What we have left is a convoluted plot that has many plotholes as well as one minute wonder insignificant characters. \\n\\n\r\nBut it wasn't all bad, there is a certain disney charm that Magi has with good characters that mesh with the setting. Midway, the tone of the story changed from stopping a bad guy to a more inquisitive theme. It came out of nowhere, but it was handled well with a combination of humor and lightheartedness while also having an undertone theme of mythical beings coexisting with humans. It explores prejudice within civilization and questions which side is truly evil or good. I feel like it came out of nowhere though, because there was nothing like this in Labyrinth. Is self desire the true evil within every living being? While it's not directly answered, it does give viewers something to challenge analytical thought processes. \\n\\n\r\nThe characters severely suffer from superfluous interactions and lack of screen time. It's hard to say something like Magi wasn't long enough, because it was 25 episodes, the equivalent of 2 seasons. I believed that some characters got too much screen time, such as one in the beginning arc, and Aladdin's arc. It seemed like they just so happened to be there when the main core gets caught up in trouble. Although, they do provide internal conflict amongst each other due to difference of opinions and statures. However, my biggest problem was the splitting of the main core. The incredibly reduced screen time amongst them is the biggest change from Labyrinth and much of the charm of the show came from their interactions and resolutions. It seemed like a way to eliminate characters with a lot of screen time so it can focus on the main one. I really disliked that because the ending rolls around and we're left to assume that the separation of these characters built them up individually enough for the conclusion. It was a cheap tactic and I didn't like it one bit. However, the show still had it's comedic touch among the main core, which is great because it shows a dynamic relationship between each other. \\n\\n\r\nI loved the soundtrack of Magi. It has a middle eastern like OST and what better way to implement that than a show that relies on its setting to continue it's story. There were many tracks that I feel is good enough to listen to as a standalone track and it overall enhanced action scenes, more intimate scenes, and brought life to the huge world. The sound effects are good and the voice acting is good, so no complaints at all from the sound department. Animation is good too, albeit a bit confusing due to it's grand scale of what's happening. There is just so many power moves that it can look like it's lagging a bit. \\n\\n\r\nMaybe with the exception of Psycho-Pass and Darker than Black, Kingdom of Magic is one of the worst sequels to a good series I've seen. It's poor execution of it's story direction leads me to believe that the writers are catering a target audience that I'm unaware of. It's separation of characters is the most catastrophic decision that could've happened in a show like this, where the main core was vital to the success of conflicts. Labyrinth had a existential undertone theme that was only explored minimally in Kingdom, which I see as a missed opportunity. Kingdom is a disappointment from a character standpoint, and a hit or miss from a story telling standpoint. The pacing was incredibly lackluster and slow and it sporadically shifted to incredibly fast, which makes the ending more laughable. Magi: The Kingdom of Magic, failed to utilize what it had to make it a powerhouse anime.",
            "date": "2016-05-10T12:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 218313,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4663713.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TakeTheWindward",
                "username": "TakeTheWindward"
            },
            "url": "https://myanimelist.net/reviews.php?id=218313"
        },
        {
            "content": "This might be the most underrated anime ever, I know it has a good place on the rankings but then not many people knows about it.\r\nStory: Watch the 1st season before the 2nd season, confuses you a lot if you don't. Is about a very realistic medieval times even though there is magic there.\r\nThe reason why I call it \"realistic\" because it very is if you understand the main core of the anime. Is about country affairs, back then when there are kings, most of them weren't wise and pretty much corrupt, while now a diplomatic government is the right thing since every one isequal. Since this anime has \\n\r\nmagic, where not everyone can use them but they still stand at top since they are the strongest and capable of protecting the country by themselves, but there is still war where every citizen is involve. There is a lot of relativity in this anime, back then in history where there is slavery and racism, similar to humans and magicians. Where someone has the talent for magic while others don't. Well mainly is about a guy name Aladdin and Alibaba, Aladdin in the incarnation of the Great King from a different world, which means he's kind of the incarnation of god. He journeys the current world and develop with more knowledge and power. He meets Alibaba, a discriminated Prince of a country, they work together and swore to each other to journey every across the world. Then they went across people where is an evil organization that tries to bring the world into despair just like they did in Aladdin's original world.\\n\\n\r\nArt: The Art is outstanding, beautiful but prefer in HD\\n\\n\r\nSound: The Soundtrack is deep and have the right sound for each and every scene, either is a deep scene or a comedy scene, they have the right soundtrack for it. I personally enjoy the sound track \"A Storm is Coming To Us All\", is a good sound track where it describes an overpowered character.\\n\\n\r\nCharacter: Each character has their own stories, Aladdin is the incarnation of god and a king from another world and he's trying to get those memories back to learn HIS meaning of him living. While Alibaba is the prince of a country that got corrupted because he wasn't responsible enough, and regrets his decisions and try to do the best for the country until it got capture by an enemy's country. Well in deep in each character, there is more but too many spoilers.\\n\\n\r\nEnjoyment: Is awesome, well in deep, similar to the modern world and the government. \\n\\n\r\nOverall: Is a must watch, it has it's elements, and one of them is for you. Surprising action scenes and deep/sad scenes.",
            "date": "2014-03-28T19:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 137629,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3273767.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shana5678",
                "username": "shana5678"
            },
            "url": "https://myanimelist.net/reviews.php?id=137629"
        },
        {
            "content": "Magi / マギ : The Kingdom of Magic Review\r\nStory (8/10) Very Good\r\nMore Specifically (8.75/10) Very Good+\r\nThe story I thought for the Kingdom of Magic was very good, I ended up following the manga while watching the anime at the same time and I thought from an accuracy standpoint it was damn near 1 to 1, Obviously not identical they definitely skipped over a couple of things but I personally thought the things they didn't cover are extremely debatable if they where scenes that were \"MUST HAVES\". The place the ended I thought was a decent stopping point but I wasn't a fan of them startingoff the season with a straight up spoiler of something we wouldn't see from episodes to come, if you were an anime only you are sitting there like \"wtf is this? did i miss something at the end of the last season?\" and if you were a manga reader you are like \"wtf are they showing this massive spoiler like right now?\" other than that the placement of other scenes definitely differ with it's manga counterpart but that one was the only one that I think shouldn't have been placed there.\\n\\n\r\nArt and Animation (9/10) Great\\n\r\nMore Specifically(9.5/10) \\n\\n\r\nA-1 Pictures definitely did their thing and if you are an anime-only you would probably give this a 10 and I probably would have if I didn't know how much better the Manga looked as far as art goes. Now the anime adaptation definitely didn't look bad but I personally think they couldn't get it to look as amazing as the manga which is sad because A-1 pictures probably gave it their best, that Managaka is an amazing artist her art style especially on full Jin-equipped character just look straight up outstanding and when you see how they look in the anime it doesn't do it justice, like I said the anime version doesn't look bad, you just might be disappointed if you've seen how they look in the manga. And as far as animation through majority of the anime was great BUT it wasn't consistent through the entire way. There are indeed scenes where if you've seen how they look in the manga and how she wanted it to look if a character is blitzing through enemies vs how it looks in the anime once again u might get disappointed but i think 95% of the adaptation was great as far as animation and art-style adaptation is concern, not a lot of studios could probably do her art style justice in an anime anyway so this is way I'm not being too hard on A-1 Pictures they did their best.\\n\\n\\n\r\nSound (10/10) Masterpiece\\n\\n\r\nThe sound is outstanding the OST (especially Sinbad's theme music) is straight up \\n\r\noutstanding, I'll definitely be listening to the OST when I continue onward while reading the manga because it would feel weird listening to anything else while reading it. Everything is on point sound effects, spells, voice acting (JP VA) all perfect.\\n\\n\r\nCharacters (9/10) Great\\n\r\nMore Specifically (9.75/10) Great+\\n\\n\r\nThe characters are great in Magi, the character development isn't really there I felt there was more in the first season but it's not non-exist just little for our main characters. Their progression as far as strength has definitely went up. Even though we didn't necessarily get to see Alibaba or Morgiana \"level up\" until the very last battle and for a split moment with everyone else but that's just nitpicking I guess. If there's any character that got the most character development whether u consider it a positive or negative development is Hakuyuu even though it feels like he's kind of taking the Sasuke route but oh well we'll see how that goes, not a lot of Judar this season either I enjoyed seeing him run wild in the first season but oh well to their also. Sindad is still awesome.. BA-RA-RA \\n\\n\r\nEnjoyment (8/10) Very Good\\n\\n\r\nThe start of the season I felt was slow and it took at while for me to get hooked honestly but when it got good it payed off. The hype was really real and the openings are still great A-1 Pictures knows how to make it work.\\n\\n\r\nOverall (9/10) Great\\n\r\nMore Specifically (9.20/10)\\n\\n\r\nMagi: The Kingdom of Magic aka Season 2 definitely is better than season 1 and I liked season 1 a lot also. I'll be starting the Magi hopefully I'll be caught up before Season 3 comes out and I'm going to most likely start that Sinbad no Bouken also since Sinbad is the hypest character in this series. Magi lived up to the hype I kept on hearing about it and I think it deserves to be a lot more popular than it is. I know it's quite popular right now but i think it should be a lot more.. like more than Fairy Tail which unfortunately I don't think it is..",
            "date": "2015-10-01T20:30:00+00:00",
            "helpful_count": 9,
            "mal_id": 200301,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4538743.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rikuson1",
                "username": "Rikuson1"
            },
            "url": "https://myanimelist.net/reviews.php?id=200301"
        },
        {
            "content": "Season 2 of Magi, in my opinion, falls short of the first season.\r\nIt takes the three characters through a mediocre arc and then decides to focus on each of the characters individually.  Problem is, one of the characters becomes the main focus while the others get put on the back burner.  By the end of the season, the back burner characters have developed without us seeing it happen with each of them gets about 3-4 episodes.  This leaves much to be desired as far as character development is concerned.\r\nAs for the main focus, I felt like I was watching Harry Potter fora good part of the season and was pretty disinterested, but the season does pick up near the end which has me excited for the next season.  I also would like to mention that the new characters are very interesting once they get into the swing of things.\\n\\n\r\nIf you liked the first season at all, I suggest watching this season to prepare you for the third season.  Things are about to get interesting.  It's just too bad that the season starts off kinda slow, then focuses on someone (suddenly Harry Potter), and drops off the other characters until near the end of the season.  At least, the season ends with you wanting more Magi.  It did for more anyway.  Cheers.",
            "date": "2014-06-10T09:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 146521,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1121513.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Baldark",
                "username": "Baldark"
            },
            "url": "https://myanimelist.net/reviews.php?id=146521"
        },
        {
            "content": "“There is no one in the world who is better than anyone else. Even if you come across someone so dazzling that he has ten times, hundred times the power of everyone else…You mustn’t entrust everything to him. Because there’s no one in this world who can live without making mistakes” …Lord Magomett\r\nI will be reviewing both seasons of this anime in my review. When I started watching this anime, I gave it a score of 7, as the show progressed I bumped up the score to 8, I finally ended up giving it a 9. In other words, this is an anime that justkeeps getting better and better as the show progresses. \\n\r\nOne of the things i really like about Magi, is that it not only has an interesting story, but that story is told well. The world of Magi is vast and an interesting one that touches on several elements like slavery, politics, even racism. The characters are not bland or boring, and as you journey with some of them, you see how they grow and develop. Magi isn't all about a bunch of serious characters, always looking like they just woke up and going on quests around the world to become stronger...Lol, sorry, but this anime can get really goofy at times, and i appreciate it. The sound is the only lacking department of this anime in my opinion. It's ok but not great, but I found a couple of soundtracks i really enjoyed (Season 2 ED by 9ine is noteworthy).\\n\r\nAll in all, i really enjoyed this anime. Can't wait for Sinbad's arc which is airing next month this year.\\n\r\nThanks for reading, have a good day :)\\n",
            "date": "2016-03-05T23:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 212337,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568231.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Taicho-",
                "username": "-Taicho-"
            },
            "url": "https://myanimelist.net/reviews.php?id=212337"
        }
    ],
    [
        {
            "content": "How are you feeling today? Upbeat? Or perhaps a little down? Maybe you've had a long day at work and you just want an anime to take your mind off things. Well, grab your cup of tea and look no further my friend - Magi: The Kingdom of Magic is the anime you've been searching for!\r\nMagi: The Kingdom of Magic has everything you look for in an anime. Pleasing sounds (not in a dirty way!), bright (pun intended) characters who develop nicely throughout the duration of the anime and beautiful art. The characters are interesting, have depth and will make you feel for them, soprepare for a little emotional tug! A little bit of humour helps compliment the slower aspects of the story, and ensures theres never a dull moment - however, if you lack a funny bone you may find an early episode here and there a tad slow. But don't stop, because things get fast, fascinating and ferocious and before you know it you'll be looking at the screen like it's the last piece of chocolate cake on earth...What? You don't like chocolate cake? What's wrong with you!?\\n\\n\r\nNow. You may be thinking, \"Great! Time to go watch!\" But wait. I promise I won't overwhelm you with 2,000 words of ramble. But there is a little more you should know...\\n\\n\r\nFirstly, don't be retarded like me and at least be aware of the prequel, 'Magi: The Labyrinth of Magic' before you start. I was not, and felt really overwhelmed at the beginning of the anime, with thoughts running through my head such as, \"wow, whoever wrote this expects us to understand this new world instantly\", \"So. Many. New. Characters\" and my personal favourite thought, \"I'm not quite sure what's happening right now...but it's cool!\" Long story short, maybe watch the prequel first...but I didn't so I can't really talk. If you choose not to don't worry, you will catch on and you will still love this anime, as I did.\\n\\n\r\nSecondly, have faith in the plot! I was wondering how a meaningful ending was going to ensure around the episode 12 mark, but just know you won't be disappointed and that things ramp up fast! That's not to say the first episodes were meaningless or unrelated, so don't skip them or you may be confuzzled.\\n\\n\r\nLastly, why are you still here! Go watch it. Now! (And thank you very much for reading my review, I know it's a bit out there but I wanted to make it fun!)\\n\\n",
            "date": "2014-10-04T18:19:00+00:00",
            "helpful_count": 201,
            "mal_id": 163627,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3718217.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MrSparklePants",
                "username": "MrSparklePants"
            },
            "url": "https://myanimelist.net/reviews.php?id=163627"
        },
        {
            "content": "If I had to describe Magi, it would be more than just about magic. Sure, there are wands, hats, and spells along with magical kingdoms of witchcraft and wizardry. What sets Magi a bit different is its conventional way of presenting the series in a world building form. From the start, it’s easy to notice that Magi takes the tone of an adventurous tone following protagonists Alibaba, Aladdin, Morgania, and. Hakuryuu Ren. No exception is the fact that these characters all have gone through hardships and became who they are today. Magi: Kingdom of Magic explores not only the identities of these characters but alsotheir journey in a land of the unknown as they face challenges and struggles like never before.\\n\\n\r\nMagi: Kingdom of Magic is sequel of its predecessor Magi: Labyrinth of Magic based off the manga of the same name. It’s important to note that the series is a direct sequel hence watching the first season is imperative to get an understanding and appreciation. The first season concentrated its style on adventures, politics, and personal intuitions. This season instead focuses on discovery with our main characters as they go on separate journeys of development while major conflicts that developed from its backgrounds erupts and escalates into warfare.\\n\\n\r\nDiscovery is only a simple word to describe Magi but it focuses on that aspect centering our main protagonist, Aladdin. As young as he is, Aladdin is a kind boy with full of potential. He is a Magi, a character of great power that is known to “shape the world\". For Aladdin, he is still young and trying to climb the ladder to adolescence. His first steps involves going to the kingdom of magic known as Magnostadt. From there, he learns about the true essence of magic. Through training, he discovers exactly what is a Magi and its purpose. At the same time, Aladdin earns the respect of his friends, classmates, and instructors. Among these new characters are Titus Alexius, a bishounen with great potential and his roommate Sphintus. The sequel focuses on their relationships from rivals to great friends. They also discover secrets that can change the world they know forever. At the same time, it’s surprising that watching this anime almost feel like you’re a kid again. Aladdin is studying at a magical academy where he learns magic. Although vastly different from what you may have learned during your school years, the effort that Aladdin puts through can be admirable. His die-heard attitude to not give up and become a stronger person sets a great example for a character. At the same time, people wants to see Aladdin succeed. They want to see him make a difference. Magi or not, Aladdin is a boy that has influenced others for the better and that’s appreciable on many scales.\\n\\n\r\nOf course, Magi isn’t just about magic or Aladdin. We also can’t forget about Aladdin’s best friend Alibaba, Morgania, or Hakuyuu. The four are like the ingredients of a dish and even leaving one of them out will change the flavor. In this sequel, they go their separate ways in what is known as the “World Exploration arc” that chronicles their discoveries. Alibaba improves his own skills through training and becomes something he always dreamed of. Similar to Aladdin, he earns the respect of his peers as he shows the world who he is. On the other hand, the journey that Morgania and Hakuyuu feels a bit different that doesn’t necessarily follow the ‘growing up’ theme. Instead, they find out about both truth and horrors. Hakuyuu also goes through a drastic change that can leave some sour taste in our characters’ mouths.\\n\\n\r\nSimilar the style of most shounen, Magi divides its story into arcs. The first arc in fact feels like the adventurous stories that the audience might be more used to. After all, Magi always felt like a classic with its Arabian Nights Days setting. The story arcs often incorporates a variety of feelings to not just describe but show how the world of Magi is like. Our main characters discover how their world functions after various encounters with adversaries and obstacles. It challenges not only physically but mentally as they realize some grim truths to their world. This shouldn’t be surprising however. Magi always liked to dance around the concept of world building. Take the kingdom of Magnostadt as an example. Its cities is colored with details and magic on the outside but also holds dark secrets in the inside. The sequel adapts a format for the characters to explore kingdoms with their previous experience while writing new chapters to their lives. \\n\\n\r\nAs much as adventurous Magi can be, there are also mysteries relating to the whole term itself. Exactly, what is a “Magi”? What is their purpose? Why do they exist? Some of these questions will be explored in depth with focus on not just Aladdin but also other characters. Meanwhile, the audience will also learn about some grim histories relating to our main characters’ past. It’s definitely not something pleasant nor forgettable. Later events also leads to greater struggles between nations as the world of Magi become a battlefield twisted by egos and ideologies. Despite the series takes place in a fantasy setting, there’s also some themes that explores identities and more of the human nature. Discrimination becomes one such theme as Aladdin learns about the dark secrets of Magnostadt and the stories of Fanalis. \\n\\n\r\nAlthough Magi can be wistful and classic as it sounds, the show sometimes doesn’t take itself seriously. The comedy on most parts is presented well matching the moods while other times feel forced and gets in the way. Thankfully, there isn’t too much fan service that are distracting. Rather, they are usually replaced by humorous dialogues, expressions, and moments where we can’t help but laugh. This could serve as a double edged sword in some cases as the comedy might not suit for everyone’s tastes. Furthermore, some of the dialogues lacks any real feelings and at times feels dragged. Magi does however introduces more focuses on romance. It’s unusual for this series but it occurs early on that may take viewers by surprise. Unfortunately, the romance aspect feels abrupt and lacks any depth because for what it is, there just seems to be a lack of connection. Also for its worth, a few episodes of the story arcs doesn’t fit well together or feel predictable and dragged. The first arc doesn’t feel very attractive or unique in any aspect with its more oceanic setting. Some supporting characters also just seems to be there rather than being main players of the story. Prominent characters introduced previously from season 1 such as Judal and Sinbad also gets lesser role in this sequel that may make fans feel disappointed. There is also hidden maturity themes such as incest subtext and childhood scenes where we might not want to remember for what it is.\\n\\n\r\nOnce again, A-1 Pictures handles the visual production. There’s the fun atmosphere with the artwork and accurately depicts the way a magical kingdom should be as. However, the character designs’ face expression at times lacks excitement. Some of it comes off as blend humor. Other times, it seems forceful with the mood. The action scenes on most standards is decent and matches well in coordination to the battle sequences. Most of the character designs also reflects its Arabian theme well. All of them have their own distinctive features whether it’s Titus’ feminine like face, the Felianis tribe’s flamboyant scarlet hair, or Scheherazade’s fairy like stature. \\n\\n\r\nThe soundtrack does its job well on most parts. It mixes a Middle Eastern and Arabian theme together to perform a nature that can be appreciable. The OST features a new set of tracks that captures moments of emotions, climatic, or humorous. Both OP songs of Magi also performs well with cases of foreshadowing and montage of its many characters. Similarly the ED songs presents scenarios where our characters look on ahead and faces the world they are in. Finally, the voice acting for most characters expresses well especially for Titus, a character that sometimes can be mistaken for a female.\\n\\n\r\nMagi: Kingdom of Magic is not just a story about witchcraft and wizardry. It’s about a journey that chronicles the stories of our characters. We find out how they progress through by watching rather than reading a form of autobiography. At the same time, it’s easy to understand the story with its basic concepts and world building. There are times the series might seem off balance with its excessive comedy and cheesy dialogues. However, most these cases doesn’t directly disturb the story as a whole. Magi doesn’t just focus on ‘saving the world’ with friendship and power. Instead, it focuses on development and characterization that makes its journey most welcoming.  \\n",
            "date": "2014-04-04T17:13:00+00:00",
            "helpful_count": 107,
            "mal_id": 138663,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=138663"
        },
        {
            "content": "For this overall anime, I actually really really enjoyed this series.\r\nBoth Magi Season tell a great story that can bring you to tears of happiness and tears of feels that strike you right in the heart.\r\nAs always, the art and animation was amazing! Story was overall beautifully done. \r\nEven though, this season was mainly focused on Aladdin, I do wish to see Morgiana & Alibaba's training and what happened to them when Aladdin was in Magnoshuttat. \r\nI really hope they make a season 3! This anime series is truly something that I would recommend anyone to watch. The Fan service is mainly based on comedy.So for those who don't really like fan service in anime, I really do recommend this anime! Great story, wonderful character designs, amazing fighting scenes, hilarious moments, this anime has everything in one! \\n",
            "date": "2014-04-15T21:25:00+00:00",
            "helpful_count": 104,
            "mal_id": 140099,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2008988.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Tsuitachi",
                "username": "Tsuitachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=140099"
        },
        {
            "content": "Note: I'm writing this review under the assumption that you've seen Labyrinth of Magic (the first season), so if you haven't, I'd suggest watching that first and then reading this review. There will be minor spoilers from the first season. You have been warned.\r\nStory: 9/10\r\nKingdom of Magic had a better story than Labyrinth of Magic in my opinion. Labyrinth of Magic had an arc-based storyline where it was established by definitive arcs (the order being the beginning arc, separation, Balbadd, Sindria, and Zagan) that had some connection to each other, but were mostly standalone. There was some progression from one to the next (characters andcharacter development), but overall there was a disconnect.\\n\r\nKingdom of Magic, on the other hand, has an overarching story that isn't as clearly defined by arcs, so it's much harder to tell where they end and begin. Or, from the manga standpoint, Kingdom of Magic covers the Magnostadt arc (which is one really long arc) as well as all the mini-arcs leading up to it.\\n\r\nSimilarly to Labyrinth of Magic, this show starts off fairly lighthearted, but soon takes a turn for the darker. However, this show got much darker than Labyrinth of Magic did, and I was surprised at the degree to which it did get dark. We're introduced to a corrupt government, the struggle to want to be human, what the concept of humanity really means, and many more ideas.\\n\r\nSo when I started Kingdom of Magic, I was expecting the same type of narrative as the first season, but I was pleasantly surprised by how seriously the show took itself and how much worldbuilding was established.\\n\\n\r\nThis show also introduced the concept of Djinn Equip (which was only barely introduced in the first season), which essentially lets people with Metal Vessels undergo a magical girl-type transformation where their hair, clothes, and weapons are upgraded for a limited time. I thought that it was awesome to see the characters basically get ubered-up to fight large-scale battles, which actually served more of a purpose in the story than just for the sake of showing the audience epic battle sequences.\\n\\n\r\nThe only real problem I have with the story was that, with so many characters, not enough time was given to explain what each of the characters were doing while separated from each other. Aladdin's story was explained in depth, but the same luxury was not given to Alibaba or Morgiana. Alibaba at least got two episodes detailing what he was doing, but I still would've liked to see him studying, fighting, or learning to use his Djinn Equip. And Morgiana? We get about two-thirds of an episode describing her adventures and we're left with a lot of questions about what happened. I was hoping for at least a brief summary, but we get nothing. I was under the assumption that the manga went more into detail, but it unfortunately doesn't. We may never know......\\n\r\nAnother minor issue I have with the story is the comic relief. I felt that a lot of times it was rather a moodkiller. It made me rather uncomfortable to be watching a serious part of the show and then suddenly cheap jokes were cracked. It wasn't totally irredeemable (in the manga, the chibis are much funnier), but it wasn't exactly pleasant to watch either.\\n\\n\r\nOne of the things I especially liked about the story, however, is that the show opens with a scene from one of the final episodes completely out of context. It leads you to make an assumption about where the characters are going to go, but once you actually get to that scene in order, you realize that you were dead wrong. I think that was a nice choice of placement, since I personally was wondering what was going to come out of that confusing scene for practically the whole show. \\n\\n\r\nArt: 9/10\\n\r\nThe colors are bright and lively, the character designs are stunningly detailed, the animation is on point, and there's subtle CGI at a couple of points. Nothing majorly bad happening, though the budget got slashed toward the end, leading to some fights not being as awesome as they could have been.\\n\\n\r\nSound: 9/10\\n\r\nNo complaints here. The OP's were good, and the second one especially is awesome, though both also had amazing sequences.\\n\r\nThe ED's are another story though. Not only were the sequences awesome and tear-inducing, the songs themselves were really good. The first ED carried a kind of nostalgic tone to it, amplified by the montage of stills from the first season. The second ED started off echoey and dark, and while I didn't like it as much when it kicked up into a strong beat, it's still my favorite of the ED's.\\n\r\nThe only thing I would give as far as an issue is that sometimes the background music was kind of quiet, which is a bit of a shame since it's so awesome, particularly the battle theme, which is my personal favorite.\\n\r\nOn the voice acting end, this season had not yet received a dub when I watched it, so I watched it subbed, complete with Netflix's garbage subtitles. I'm not that good a judge of Japanese voice acting, but I didn't notice any big problems going on. I loved Yuki Kaji's performance as Alibaba, and I think he does a great job no matter which character he's voicing, so I think he was the standout for me.\\n\r\nSince I originally wrote this review, I have had a chance to check out the dub of some of the later episodes. While I like the voice acting and casting choices for the most part, I have two big problems with it.\\n\r\nMy first big problem with the dub (and something that was in the first season too) is Vic Mignogna and Todd Haberkorn being literally every single background character. This wouldn't be so bad if they both weren't already cast as secondary characters (Ka Kobun and Judar respectively), but on top of that they both have very recognizable voices.\\n\r\nMy second big problem is \"Teetus.\" I get that's how they pronounced Titus's name in the Japanese, but honestly, since when do dubs follow the exact pronounciation of every name (Free! dub, I'm looking at \"Reen\"). And on that note, the same criticism could be applied to the dub's pronounciation of \"Magi.\"\\n\\n\r\nCharacters: 9/10\\n\r\nThe characters were awesome this season. When the show took a turn for the darker, the characters developed and changed along with it, and I really liked it. There was a lot of development happening (particularly among the new characters) and it was handled well considering the vast amount of characters in Magi.\\n\r\nAladdin especially changed a lot through the show, and we get to see more of his backstory as well as what's happening to him at the time the show takes place.\\n\\n\r\nOne of the problems I did have was that since this season introduced so many new characters, a lot of the characters from Labyrinth of Magic took a backseat. It's a nice thing to hand over the spotlight to some of the newcomers, but I felt kind of underwhelmed since a lot of characters with a large presence (such as Sinbad) didn't appear as much as they should have. Not that I'm particularly mad about it though, since I loved Titus and Sphintus and the other new characters. But this problem is also due to the fact that Magi has a ton of characters interacting and developing simultaneously, so some of the older characters have to step back a bit.\\n\\n\r\nAnother problem is that since some of the older characters get less screentime due to the new characters, a lot of development seemingly takes place offscreen. I already mentioned this with Alibaba and Morgiana, and it's even more apparent with Hakuryuu. He isn't present for a large chunk of the show, and when he does reappear, he's changed a lot and it isn't explained. I was left painfully in the dark, so I can only hope this is less vague with the manga.\\n\r\nOnce again, the problems are due to the short amount of episodes and are therefore pretty much unavoidable.\\n\\n\r\nOverall I really liked a lot of the new characters, and they made me feel for them, and cry over them when it came to that.\\n\\n\r\nEnjoyment: 10/10\\n\r\nI marathoned this show in two days because Netflix had just put the whole show up, and I had already seen Labyrinth of Magic, so I was able to speed through Kingdom of Magic really quickly. It kept me glued the whole way through, and I definitely shed many tears in the episodes leading up to the ending, as well as the ending itself.\\n\r\nWhile I did have issues with the moodkilling comic relief moments and the dub, the discomfort it caused me wasn't enough to impact my overall enjoyment.\\n\\n\r\nOverall: 9/10\\n\r\nSome issues and hanging questions, mostly due to the constraint of 25 episodes, but even accounting for those it's a really solid show and impressed me time and time again with the depth of the narrative, the dynamic and varied characters, and the awesome animation.\\n\\n\r\nSo if you're still reading this and you haven't seen Labyrinth of Magic, go watch it, and then watch Kingdom of Magic. Magi is overall a really solid and important show that not enough people seem to watch, which is a shame since it's so good. Now all we need is a third season.",
            "date": "2014-11-09T10:13:00+00:00",
            "helpful_count": 104,
            "mal_id": 167985,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Leopah",
                "username": "Leopah"
            },
            "url": "https://myanimelist.net/reviews.php?id=167985"
        },
        {
            "content": "Yeah you read my ratings right, its that brilliant.\r\nThis anime gave me the vibes of F/Z. However unlike F/Z which fills you with despair, this fills you with hope and warmth. That is this show's huge plus.\r\nThe animation is spot on, vibrant and easy on the eye. The colours used are beautiful and aesthetically pleasing. The music is brilliant. Specially the the ending 2 of 2nd season. The in-show music is amazing actually, this just didnt get a 10 from me because the in show music was too soft, make it louder guys, we love it. The story is refreshingly original, though its like F/Zwhere several people fight for an ultimate prize, instead of heroic spirits and masters, we have here kings and magis. However the plot is more widespread than F/Z, however it fails to reach the \"super-epic\" levels of F/Z so the slight deduction in marks. About the characters, ths was supposed to be a chldren's anime, never dreamt of any character development but I was stunned with the brilliance in which this anime treated its characters in both seasons. And hell yeah I enjoyed the show.\\n\r\nVerdict:- The sad moments reminded me of Naruto, the pace of the story reminded me of FMAB, the story reminded me of F/Z, the magic reminded me of Fairy Tail, I dont need to say more, Go watch it guys you wont be disappointed.",
            "date": "2014-08-07T13:51:00+00:00",
            "helpful_count": 42,
            "mal_id": 155689,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776603.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Axel_Blaze",
                "username": "Axel_Blaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=155689"
        },
        {
            "content": "I'll start by saying that I'm both surprised yet not that this anime isn't as popular as it could've been (by far). As my first review, this might be paced awkwardly so bear with me. That being said, I've watched dozens of animes and can easily say this one is review-worthy :3\r\nThe first season aired 2012-2013 while the widely famous Attack on Titan/Shingeki no Kyojin became and instant hit (not surprising! I thoroughly enjoyed that anime as well!) that same year; claiming a lot of attention and leaving equally worthy animes-- Magi being one-- overlooked.\r\nI hadn't even started watching the first season until recently sinceI wasn't sure whether it was really going to be good, what with the lack of popularity and reviews. However after watching, I can say that this was the freshest breath of air I've had in a long while C:\\n\\n\r\nAlso, I made the mistake of mistaking this for the first season which is partially the reason why I dropped it after watching the first episode ^^; (Oops) That being said, you will want to want Magi: Labyrinth of Magic first if you have not! \\n\\n\r\nNow then!\\n\r\nStory: 9/10\\n\r\nThe story is quite the interesting one! I love the take on the classic middle-eastern/Persian story One thousand and one nights, and though I am no expert on Persian history or culture, I recognized the names Aladdin, Alibaba, Morgiana, and Sinbad right away. But make no mistake, this isn't a mere retelling! It takes the foundation from 1,001 Nights for the basic character personalities and likeness, but adds a completely new twist to them. It's a heartwarming adventure with a nice touch of comedy and the faintest hint of possible future romance but hardly any at that. With that being said, I don't want to spoil any of it, but this was definitely one of Magi's strong points. As an artist and writer myself, I did catch tiny plot-holes and inconsistencies however given that the series isn't finished, I will be looking forward to seeing those explained. So for that, I give it a 9!\\n\\n\r\nArt: 10/10\\n\r\nAbsolutely loved it! I'm a sucker for comedic chibis to lighten up the atmosphere, and this was no exception to that! Although whether or not you like the art style is up to your personal preference, the animation was solid and the colors were full of life. Not much more to say. For what it is as an anime of this age, it gets a 10 from me!\\n\\n\r\nSound: 10/10\\n\r\nI feel like this is more of a personal preference type of thing. But I definitely loved the combination of Persian tunes with a modern touch. I found the soundtrack fitting and everything from intense fight scenes to the opening and ending tracks all flowed smoothly. 10!\\n\\n\r\nCharacter: 9/10\\n\r\nThis is yet another strong point of Magi. Your main characters grow so much. It's hard to say without spoiling some of it, but Aladdin, Alibaba, and Morgiana start and end in the 50 episodes of both season as different people. Both mentally and physically (which was nice to see the physical growth as well! Especially in season 2!)\\n\r\nI definitely think the secondary characters didn't show much change (Sinbad, etc), though that wasn't too much of a surprise. Some did feel a little cliche-- Sinbad seems to me like your typical badass guy who can take on anything. There were hints of a darker side and perhaps his past but in the present, he isn't growing as much even though his presence is rather significant in the series. That being said, a side-manga is being published of Sinbad's past which should be interesting to read. Overall, characters get a 9. They're unique, have their own personalities, and what makes it for me ultimately is that you can relate to them. As much as Alibaba's weakness annoyed me, or Morgiana's stubbornness, etc, you can relate to them.\\n\\n\r\nEnjoyment: 10/10\\n\r\nFun fun fun! What can I say~ Finished both seasons in a matter of days.\\n\\n\r\nOverall: 9/10\\n\r\nIf this gets a third season (which I'm crossing my fingers for), then I'll hopefully be back to write a review that sums up more. Otherwise, this goes to my top favorites. My most favorites being Fullmetal Alchemist Brotherhood, Rurouni Kenshin, and the like. Although this comedic yet moralistic anime really does it for me. \\n\\n\r\nGive it a go! If you're into adventure, action, and that slice of comedy, then this is a great show for you!\\n\\n\r\n:D \\n\\n",
            "date": "2014-06-02T16:16:00+00:00",
            "helpful_count": 30,
            "mal_id": 145555,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3593375.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Capukat",
                "username": "Capukat"
            },
            "url": "https://myanimelist.net/reviews.php?id=145555"
        },
        {
            "content": "The realm of \"Shonen\" Anime & Manga is encompassed by two major things: Conformity and Mediocrity. The term itself; \"Shonen\",  immediately conjures a vast plethora of negatively inclined connotations, many of which are based off of only a small array of relatively insipid and generic titles, thus leading to an offhanded generalization that \"It's shonen, it must be bad.\",  leaving many other unknown titles failing to receive the attention they may or may not deserve.  This seems to have muddled a lot of the thoughts of the average anime viewer, and so when one is suggested a title, say, \"Magi: The Kingdomof Magic\", interest is initially sparked, only for it to dwindle down as quickly as it began upon their reading of the genres MAL gives (Shounen, Action, Magic etc.). Thankfully, the Magi Series gives us a refreshing and more mature indication of what a shonen series is capable of producing - A masterpiece.\\n\\n\r\nWhat Magi does to differentiate itself from it's counterparts in the genre is that it does not rely solely on fighting or mind-games  to solve the various conflicts that appear throughout the entirety of the show. While Magi does have it's fair share of Shonen-esque battles (Which mind you are absolutely stunning), Magi is a show which also has a heavy political and ethnic aspect towards the roots of it's overall story. The characters are faced with a range of different situations in which they must go through, and a lot of these encounters are heavily laced with issues that are incredibly relatable to our contemporary society. From political warfare to the most heated of battles, Magi definitely has a a variety of ways in which conflicts are solved which will keep you guessing and on your toes in tense anticipation of what is to come next. \\n\\n\r\nExpanding on the political and ethnic aspect of the story, Magi serves as a commentary of sorts on our society as a whole, raising considerably harrowing and terrifying questions as to whether our society is wrong or right in our actions both past and present. Though not majorly enforced and implied, the messages are there. From racism, discrimination and segregation, poverty all the way to the harsh and chilling realities of what a war does to a nation and it's inhabitants, Magi's storytelling is fantastically intertwined with social, political and ethnic problems/morals that we as a society seem to blatantly ignore. This critique is what truly makes Magi shine above above the rest, the only other shonen which consistently deliver the same level of complexity in story Full Metal Alchemist and HunterxHunter.\\n\\n\r\nEveryone in Magi has a role. Whether it be to act merely as a stepping stone for something greater or to bring calamity to the world, each character in Magi offers something different, something new, something exciting which will crack the biggest of smiles, the saddest of frowns and everything else in the spectrum of our emotions. Whether it be the ever-cheery, mysterious and hilariously perverted protagonist Aladdin; the altruistic, reckless and ridiculously relatable deuteragonist  Alibaba Saluja or the beautiful, shy and incredibly powerful glutton Morgiana, the characters in this show are by far it's highlight. The interactions between these characters are alluring and entertaining as well as thought provoking. Paying extra detail to the words and looks exchanged between individuals is key, as one line you heard here will have vast relevance and foreshadowing to scenes of future events. Each character is well developed, every mistake and step forward made adding to their maturity and sophistication, further personalizing each individual into distinguishable, multi-dimensional characters. With fantastic writing put into every one of the cast as well as brilliant voice acting (Yuki Kaji and Kana Hanazawa just to name a few), you are bound to fall in love with at least one of the characters this show has to offer.\\n\\n\r\nThe world Magi is set in is one based on the classic tale, \"1001 Nights\", however, do not let that trick you into thinking Magi: The Kingdom of Magic has it's foot firmly planted only in one era, quite far from it in fact. Though we are initially faced with the classic Arabian setting, the blazing sun encroaching everyone to take shade, Magi's setting is one of many cultures and religions all jumbled together into a brilliant mess. From Imperial China, the streets and slums of India, Lebanese architecture and trade all the way to bloody Gladiatorial bouts to the death in Ancient Rome, Magi has a dip of just about any mainstream ancient culture, cultivating an immensely enchanting and fascinating universe. How these different areas are explored and expanded upon are brilliantly done, the ways in which we are shown what each setting has to offer and how our characters traverse such interesting areas something I, despite the countless moments of watching over and over, will never lose interest in. \\n\\n\r\nMagi's artwork, both source material and adaptation, are both phenomenal and breath taking. As mentioned earlier with Magi's multicultural diversity in setting, different places give you completely different appearances, each character design becoming more unique and amazing as the one before. Though the main characters do have some generic hairstyles and colour, it is easily dismiss-able when faced with what the rest of the cast and surrounding environments have to offer. However, there are some instances (backstreets in urbanized areas especially) where a lot of the structures look copy-and-pasted, which is a great shame, given the fantastic and creative art style this series brings. Coupling the visuals is a soundtrack that truly knows it's purpose - that is, to add atmosphere to scenes where mere dialogue is simply not enough as well as fully encapsulate the audience into the theme of the show, which in essence is the Arabian Nights. With Shiro Sagisu behind it's score(Bleach, Berserk, Evangelion etc.),  Magi's soundtrack acts almost as invitation into the world itself, each track truly capturing the emotion it's accompanying scene is trying to deliver. Though not the most spectacular, Magi's soundtracks are most definitely memorable, some tracks you will find yourself dying to find out the name of upon hearing.\\n\\n\\n\r\nIn conclusion, Magi: The Kingdom of Magic is an anime you will most definitely not regret watching. With it's compelling themes and complex storyline as well as an expansive world filled with a variety of lovable and relatable characters, Magi has created an unforgettable experience which simply cannot be missed. Whether you're a fan of politics, or just want a fun yet intelligent shonen series, look out because Magi: The Kingdom of Magic has arrived and will clear you of depravity!\\n\r\nIt is highly recommended for you to have viewed the Prequel series, \"The Labyrinth of Magic\" before watching The Kingdom of Magic as major plot points and character developments are addressed.",
            "date": "2015-07-23T09:51:00+00:00",
            "helpful_count": 20,
            "mal_id": 194130,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3426467.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RedCloudNinja",
                "username": "RedCloudNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=194130"
        },
        {
            "content": "~ No spoilers, but I will assume that you have already seen Magi: The Labyrinth of Magic~\r\nMagi features a story driven plot supported by a HUGE cast of characters. As the mysteries of Aladdin's origins and the abnormalities in the world begin to unfold, this series manages to turn the prequel on its head with its increased intensity and scale. No longer is this simply a story of a lost boy trying to find himself in the world, but a much grander chain of events that shake the world.\r\nAlong with the bump up in scale of events, Magi: The Kingdom of Magic played out anumber of deeper themes, touching on topics of social hierarchy, moral superiority, order and chaos, and what we choose to spend what little time we have alive doing. These themes interact with the cast of characters to create a deeply woven plot that is beautifully written and presented as we follow Aladdin on his journeys.\\n\\n\r\nThis series includes some action, however, the action scenes sort of take a backseat to long dialogue and storytelling. I liked the action sequences much better than the first series, but keep in mind that, while they are very well animated, the story of Magi is not really a story that relies on a lot of action, and therefore is not very realistic in terms of battles. \\n\\n\r\nCharacters in Magi are varied and plenty, each of them unique and carrying depth that is not often seen in other series. What I love about these characters is that they are never truly who you expect them to be. Several characters who were introduced in the first series reveal a much deeper history to their characters. A meaningful message to take from this show is that a first impression is only ever a scratch on the surface of somebody who is much more than you think they are.\\n\\n\r\nMagi's production values were absolutely magnificent. Episodes were meaningful from the absolute beginning to the absolute end, and openings and endings were polished works of art. I almost never skipped an opening throughout the entire series. In addition, this show doesn't waste time on long summaries of previous episodes or previews of next ones - you won't find yourself lost transitioning from one episode to the next, but you won't get bored watching the same thing over again either.\\n\\n\r\nAnd finally, the art. Outstanding. Magi's distinct art style really shows itself in the level of detail and effort seen on the characters. Especially when Djinn equips are shown, I truly appreciated how much work was put into designing and displaying each character. Moreover, the art style of Magi follows closely of the previous series in that the bold use of color is splendidly displayed throughout the Magi world and is used to indicate both mood and intensity. This, along with the epic story and already well established soundtrack from the first series, brought tears to my eyes more than once.\\n\\n\r\nNeedless to say, I was very satisfied with this series. It started off, however, a little slow for my taste. The first 7 episodes were actually quite a drag for me. As Magi: The Kingdom of Magic is a continuation of an already existing series, it does not really pique your interest in the first few episodes with new content, but rather tries to ease you back into the story that is about to unfold in new, dramatic ways. After the story picks up, however, it really flies, all the way until the end.\\n\\n\r\n10/10",
            "date": "2014-10-24T03:14:00+00:00",
            "helpful_count": 19,
            "mal_id": 165983,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rh59kr7",
                "username": "rh59kr7"
            },
            "url": "https://myanimelist.net/reviews.php?id=165983"
        },
        {
            "content": "If it’s only enjoyment that you are after, then Magi: The Kingdom of Magic may suit your taste and entertain you well but if you are looking for an anime that has depth, then this may not be the closest one. Whether which is which, don’t get your expectations too high!\r\nThe story was interesting but there were major flaws such a lack of consistency and coherence. For one, a lot of information were unconcluded and simply left behind without explanations. For example, as from the title says, a magi is gifted magician who is tasked to choose a king candidate. Magis were mentioned frequently butthey weren’t given a particular depth of information or significance just like how one of the few magis barely did anything despite appearing the last few episodes of the show. Their importance was then very questionable. Second, the direction of the story is, least to say, inconsistent. The arcs, over time, tend be more unrelated and separate from the story. At one point, I was thinking as to where the story is really going to – the concept isn’t misleading, the delivery is.\\n\\n\r\nHaving a vast roster of characters with diverse personalities, perhaps abilities in this anime, could easily pique an audience’ interest. But while it raises expectations for viewers, failing to satisfy or reach the viewers’ demands could cost a reputable damage. While watching Magi, I constantly remember Fullmetal Alchemist Brotherhood as it reminded me of how many characters were introduced throughout its run but after finishing Magi: The Kingdom of Magic, I was able to tell the difference wherein FMAB succeeded and Magi failed. To make it clearer, several characters lacked background and significant role that it made them seem as mere decorations to make the show more appealing. Just when I thought a character is going to play a big role in the story after stepping into the light, the show drifts away from that character and wanders off to another focus. Other than that, the development of the three main characters were great but for the others, it just wasn’t that good.\\n\\n\r\n\tWhen it comes to the production, I couldn’t really tell anything wrong about it as the animation was great and the music even better. The soundtrack is what I found to stand out the most for its variety of tones suited perfectly for each mood and situation. I still think that the show is fun and highly entertaining despite of all its strengths and weaknesses. I myself wouldn’t watch an anime just to write reviews about them – enjoyment comes first!\\n\\n\r\n\tWith this, I would say Magi: The Kingdom of Magic is an average of its type. Although there can be flaws that are not noticeably erroneous but rather bothersome, you can still look away from them and enjoy the show because after all, the fun factor is this anime’s lead.\\n\\n",
            "date": "2016-11-28T06:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 234543,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5845415.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RavenSkye",
                "username": "RavenSkye"
            },
            "url": "https://myanimelist.net/reviews.php?id=234543"
        },
        {
            "content": "This review is for the second season of Magi, so expect light spoilers for season one.\r\n\tSeason one of Magi was a good watch overall, but it left a lot to be desired. So is season 2 a step up from the original, or is Magi simply overstaying its welcome? Well to answer that, first, we have to look at where we're at.\r\n\tAfter Sindria is saved, Aladdin, Alibaba, Morgiana, and Hakuryuu all decide to go their separate ways to become stronger. Morgiana to return to her homeland, Alibaba to hone his Magoi control, Hakuryuu to claim his revenge, and Aladdin to investigate the country of Magnostadt,rumored to have ties with Al Thaamen. But war is brewing on many fronts, and the secrets of Magnostadt may be darker than anyone ever imagined.\\n\r\n\tAs you can see, the plot of season two is already tighter and more focused than its predecessor. It's also considerably less rushed as well. That said, the first twelve episodes are somewhat of a snooze and aren't really all that interesting. They're not bad, and they certainly build the world nicely, but the conflicts are on a much smaller scale than the rest of the series. In Labyrinth, we had two country-wide clashes, which while a little anticlimactic, had a very large scope to them, whereas in Kingdom, the most interesting thing that happens in the first half is a Colosseum duel. \\n\r\n\tBut when Kingdom wants to get rolling, it gets rolling. The final third has some really engaging and sizable battles, while not making up for the earlier bore, certainly keep one's attention. They actually have a lot of tension, and give off a sense of danger, even if the finale is a little underwhelming.\\n\r\n\tIt's a shame that when the series reaches this high point, A1 Pictures decides to lower the budget. There are a few cuts early in the show, some looking downright awful, but at least they're brief. In the final third, the palette looks murky, the animation gets choppy, and the artwork loses almost all of it's detail. It's not unwatchable, but it certainly looks cheap compared to the rest of the show, which still holds up quite nicely. I can also give the animators credit for the fight scenes, which overall are very well choreographed, a big step up from season one. \\n\r\n\tOn the other hand, the soundtrack is pretty much more of the same, but not in a bad way. The tracks still use a lot of electric guitar, and they still have a middle-eastern feel, which is great! The battle tracks do a great job of building tension, some feeling gritty, some feeling regal, and some feeling surprisingly retro. Nothing feels out of place though, not even the English lyrics that show up in the choir pieces, all of which are ominous and sinister. Shiro Sagisu really hit it home.\\n\r\n\tBut cool songs on their own don't make a show great. Magi was never the most coherent show around, but sometimes Kingdom just gets ridiculous. Ridiculous like sticking the landing to a hundred foot fall, or breaking out of hypnosis through the power of friendship. I get that it's not trying to be all that realistic, but I can only suspend my disbelief so much, especially when the show gets as cliché as it does.\\n\r\n\tThese moments would've been a lot worse if not for the lovable cast, which gets some pretty hefty additions this time around. There are the Kou Princes, the Reim generals, the Magnostadt wizards, hell, there's even an entire troop of Fanalis badasses. Since there's so many, most are fairly one dimensional, but their personalities alone are more than enough to make you remember them, which at the end of the day, is all a side character needs to do.\\n\r\n\tBut that's not to say there weren't some standouts. Aladdin's rival Titus grows a lot over the show, and pulls quite a few heartstrings along the way. Him and Aladdin have very interesting chemistry, being so alike yet so drastically different. \\n\r\n\tThe two of them get the most focus, with characters like Morgiana and Hakuryuu being absent almost the entire time. Even Alibaba takes a back seat, which is definitely a risky move. I think the original four have a tighter dynamic overall, but Titus is worthy of the change for the most part. \\n\r\n\tThe real showstopper though, is Mogamett. His mindset is clearly warped, but every time he speaks, you just find yourself agreeing with him, even though you know what he's saying is wrong. His story is very believable, and it's quite easy to understand where he's coming from. He's a perfect fit for Kingdom's theme of racism, which admittedly is handled quite well.\\n\r\n\t The entire setup is extremely realistic, and we're given good insight on both opposing perspectives. The ending is a little too picture perfect, but the Magnostadt conflict is wrapped up quite nicely. There's some sequel baiting at the end, and definitely more stories to tell, but with Magi's success, a third season is almost guaranteed.\\n\r\n\tIf you liked Magi season one, you're going to like season two, and really have no reason not to watch it. The animation is pretty inconsistent, and there are holes in the plot, but if you're looking for a rich world with a lot of heart, you won't be disappointed. Is the show groundbreaking? No. Is it a solid watch? Yes. I give Magi: The Kingdom of Magic, 3 (out of 5) stars.",
            "date": "2015-02-20T16:42:00+00:00",
            "helpful_count": 17,
            "mal_id": 180865,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4004411.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AlexJetski",
                "username": "AlexJetski"
            },
            "url": "https://myanimelist.net/reviews.php?id=180865"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nSomething that people often do is \"fighting for what is right.\" This comes in a variety of forms, such as protecting the weak or exacting justice on the sinful. But it becomes interesting when it is more of a grey area. What do you do when someone is fighting a battle with seemingly good intentions but harboring ideals that go against what you believe? In the second season of Magi, Magi: The Kingdom of Magic explores this idea while still maintaining the balance of comedy and action that has made it so popular today.\r\nSTORY\r\nM:K starts where M:L leftoff. That is, Aladdin, Alibaba, and Morg have come back from the previous dungeon. However, all three of them decide that, in order to become stronger, they must journey on their own to find the path that will unlock their full potential.\\n\\n\r\nThis time, the show is split up into about four separate arcs: the journey as a group, their separate paths, the magic country arc, and the war arc. This is important because the show does something very well, and that is balancing exposition and action. Given what M:K is capable of in terms of its world, having more than just the characters duke it out all the time is important. And this is something that the show handles nicely. Learning about the different countries, understanding the Magi and the Djinn, comparing and contrasting the differing sides of the conflict; these are all things that the show develops when it isn't showcasing battles. Don't get me wrong, the battles are definitely fun to watch. But for me, learning about this world that I have spent almost 50 episodes watching is way more fulfilling.\\n\\n\r\nAs mentioned in my preview, one of the central themes in M:K is the idea that what someone fights for may seem wrong on one side but entirely correct on the other. This is a case of perception, or where one's ideologies lie. Learning to overcome ignorance in this regard is a huge step in becoming a mature human being. The show tests the audience's ignorance by showcasing this very same issue. There are multiple sides vying for conquest at the same time. In terms of technicality, everyone is right, because their fighting for something that they believe in. Now, this also makes them wrong, but only if you view it as such. These types of ideas can be applied to real life as well (such as current issues in politics and war), and the dynamics at play within Magi demonstrate this somewhat higher level of thinking.\\n\\n\r\nIf I was being nit-picky about the way in which the story was told, it would be that, despite all the explanations they give, it still wasn't enough. There are many questions left unanswered to the viewer when the season wraps itself up. However, I understand that a lot of them, for the moment, could not or can not be explained. The ending itself is fine for what it is, but a third season is absolutely needed to truly finish off Magi and to fully answer these immediate questions that have been raised.\\n\\n\r\nANIMATION\\n\\n\r\nM:K, like its predecessor, maintains its animation quality...for the most part.\\n\\n\r\nThe art style is the same as the first season. The show mostly sticks to one or two locales, so the majority of the \"flair\" comes from the characters and their designs. The show's ability to make the characters look unique and cool both in normal form and in Djinn Equip form makes it pleasing for the eye. On top of that, the fight scenes themselves are filled with massive explosions, many enemies, magic, and crazy acrobatics.\\n\\n\r\nThe actual animation for the show is almost always of good quality. However, there are times when it does dip, and it is noticeable. Whether this is having immobile characters or refraining from showing what characters are doing, there are times when corners are cut. It happens mostly during the final quarter of the season, so it was a shame that it had to end on a somewhat lackluster note.\\n\\n\r\nCHARACTERS\\n\\n\r\nM:K's characters this time around are a massive step forward from what M:L had to offer.\\n\\n\r\nM:L mostly focused on Aladdin, Alibaba, and Morgiana. This time, Alibaba and Morgiana after the first quarter of the show are almost entirely forgotten, and the focus switches to one old and two new characters: Aladdin, Mogamett, and Titus.\\n\\n\r\nAladdin's role this time isn't so much to develop as a character so much as he is a vessel (pun intended!) to expand on the world. His gain in knowledge is parallel to our gain in knowledge. Meaning, the things he learns and encounters give us insight into the world of Magi. At most, Aladdin becomes quite a bit stronger in his time at Magnostadt, but beyond that, he doesn't necessarily grow as a character. He doesn't witness hardship, nothing about his origin is revealed, and his character traits and personality remain mostly intact. This is all quite interesting because, being the center of the show, you would expect him to change somewhat. But that isn't the case here, because it doesn't need to be, thanks in part to the other two.\\n\\n\r\nTitus is a new character introduced about half-way through. Determined, strong, and emotional, he values life and the things that it provides. Not really having a place to call home or a family to hold dear, much of what Titus goes through are things that kids learn about in their early years. And much like a kid, his decisions and outlook on life itself is somewhat warped until he receives help from the many different people around him.\\n\\n\r\nBy far the most interesting and probably most important character this season was Mogamett. As the leader of Magnostadt, Mogamett is both a fatherly figure to his students and a stalwart fighter to his people. He is a very well done villain because he really isn't. While you may hate the things he says or does, his justifications and reasoning make sense. His stance on magicians and humans goes hand in hand with my previous sentiment on the ideologies people have. As a viewer, you both like and despise who he is, and in this case, his characterization works wonderfully.\\n\\n\r\nM:K has a ton of other characters, such as Hakuryuu, Scheherazade, and Sinbad. Their roles exist and do take precedence during certain parts of the story. But for the most part, their tale (for now) was and is inconsequential to the other characters.\\n\\n\r\nIf anything, I wish they had more Alibaba and Morgiana. I felt that they received the same treatment as Sinbad did in season one. That is, they are these great characters with seemingly good backgrounds and characterization, but they are either underutilized or cast aside in favor of other characters. This may just be a product of the genre it is in, but when these two comprise two-thirds of the main cast and they are barely used, that is definitely a problem in my eyes.\\n\\n\r\nSOUND\\n\\n\r\nThe first OP for M:K definitely fits for the mood of the first half of this season: uplifting and filled with the hope and desire of becoming something more. But for me, I'm personally not a fan of the song. The second OP, however, I am. It's strangely fun to listen to, both on its own and in conjunction with the events of the second half of the season.\\n\\n\r\nThe first ED perfectly matches with the visuals, in that it gives off this immense feeling of longing and wanting to be with the ones you love. The second ED is oddly hip-hop-ish and doesn't particularly mesh well with the show. I think it was aiming to create a sense of conflict by showing the many different characters in its visuals, but the song itself doesn't do this in any way, shape, or form.\\n\\n\r\nThe soundtrack is nicely done once again. There are darker pieces, the more Egyptian pieces, and the melancholy pieces, too. They complement the mood well when they are used and never feel out of place.\\n\\n\r\nVoice acting wise, I found every role to be fine. There were no outstanding performances by anyone, but everyone involved did at least an above average job.\\n\\n\r\nENJOYMENT\\n\\n\r\nI really wanted to enjoy M:K more than I did with M:L, but I couldn't.\\n\\n\r\nThis may sound like I didn't enjoy M:K at all, and that is absolutely not true. M:K's comedy is right up my alley, the fights are generally awesome to see, the characters are interesting, and the world is vibrant. But M:K once again succumbs to the same pitfall that M:L did, and this time it is in the separation of the characters. I understand that it is or was needed to develop the world and the characters equally. But Magi is strongest when the main three, Aladdin, Alibaba, and Morgiana, are together doing what they do best. And that is hanging out, fighting bad guys, and just plain having fun. Taking this away kind of makes the show feel somewhat empty or disjointed. They constantly reaffirm their relationship in the OPs, EDs, and throughout the show, but for the majority of it, they are never together.\\n\\n\r\nI want to point out one character relationship that I hate with a passion. And that is what transpires between Hakuryuu and Morgiana. Not wanting to spoil anything, I just want to say that if they go down the route that they presented in the show, I will definitely loathe it. Due to what happened and where things left off, I've been given no reconciliation otherwise. To be honest, because of what happened between the two, it made me want to make sure that nothing was going to come of it. And not getting the answer I was looking for is quite frustrating, to say the least.\\n\\n\r\nIs Magi: The Kingdom of Magic better than its previous season? I would say yes. While it does capitalize in a few of its weaker areas, it still tends to make the same mistakes over and over again. However, as they say, three times the charm!\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, wonderful balance between exposition and action\\n\\n\r\nAnimation: Good, art style and actual animation quality see brief drops\\n\\n\r\nCharacters: Good, great new \"villain\" and allies but underutilized main cast\\n\\n\r\nSound: Good, some good and bad OPs and EDs, nice soundtrack and VAs\\n\\n\r\nEnjoyment: Good, needs more Aladdin, Alibaba, and Morgiana, and infinitely less Hakuryuu\\n\\n\r\nFinal Score: 8/10",
            "date": "2014-10-21T23:48:00+00:00",
            "helpful_count": 15,
            "mal_id": 165693,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=165693"
        },
        {
            "content": "Magi: The Kingdom of Magic is the second season of Magi: The Labyrinth of Magic. For those of you who have not watched the first season, I highly recommend it unless you have zero interest in the fantasy-action-adventure genre. For those of you who have watched the first season, the good news is that Magi II does not disappoint. Everything that you enjoyed and liked about Magi, whether it be the diverse cast of characters, the battle orchestration, or the plot development, Magi II delivers. \r\nMagi II begins with the night after the battle at Sindria, after Sinbad and his people repelled the attack fromAl Thamen and after Hakuryuu obtained Zagan. Alibaba, Aladdin, Morgiana, and Hakuryuu then left Sindria and went their separate ways. Hakuryuu went back to Kou Empire, his intent revealed shortly into the season. Alibaba went to Rem Empire to work on his control over his djinn Amon. Morgiana went to find her fellow Fanalis people so she can learn about their past. Aladdin went to Magnostadt to investigate the origins of dark metal vessels and learn magic. Although Magi II spends some time on Hakuryuu, Alibaba, and Morgiana, most of the screentime is (rightfully) dedicated to Aladdin's time in Magnostadt, as the main plot develops from there. It takes a lot to carry a grand plot with a diverse cast of characters and still maintain layers of complexity that are only slowly peeled back as the story progresses. But Magi II manages to do just that. While the pacing might be a bit slow to start, I personally thought it to be one of the most satisfying series I've watched as things came together at the very end.\\n\\n\r\nIn addition to how the plot evolved in Magi II, it builds on Magi I in at least a few other respects. The way battles play out, for instance, are much more  impressive with Alibaba, Morgiana, and Aladdin all becoming more powerful.  But I think what's made it such a memorable season 2 is that by cutting away time from Morgiana and Alibaba, Magi II gets to spend a lot of time introducing new characters and portraying them in detail. This is an especially encouraging sign because by revealing more about each side, Magi moves away from the conventional good versus evil paradigm and gives us a little grey area. By the end, you really will find the entire cast having grown on you.\\n\\n\r\nVisually, I think Magi II sometimes looks like it's on low-budget. But I think that has less to do with its budget size than the style of the manga (the artist is notorious for sometimes drawing sketch-style art). Magi II, like Magi I, has almost zero CGI involved. Whether that’s good or bad is up to you to decide, but I think that stylistic choice continues to work well for this franchise. Sound-wise, Magi II features a good enough soundtrack. The first OP and ED are somewhat average, but the second OP and ED are very good and in my opinion makes up for the first ones. Unfortunately  the music is otherwise decent but unimpressive. The soundtrack is indeed one of the weaker points of Magi II, but at least does nothing to make it less enjoyable.\\n\\n\r\nMagi II picks up right where Magi I ended and immediately delves into an amazingly well put together adventure. For fans of the series, there's no reason to not continue with this second season. As for those who're scouting for something new to watch, both seasons of Magi have great entertainment value and it’s a franchise that shouldn't be missed -- which the ratings also attest to.",
            "date": "2015-01-17T18:09:00+00:00",
            "helpful_count": 15,
            "mal_id": 178253,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1212393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zannett",
                "username": "zannett"
            },
            "url": "https://myanimelist.net/reviews.php?id=178253"
        },
        {
            "content": "This series or aptly put the second season of Magi franchise is filled with themes of exploration and adventure. The story is a unique spin on Arabian Nights and creators have made it highly intriguing and fascinating by giving new shapes to our favorite characters. I liked it because I was excited by seeing the new Avatars of my beloved characters. It was exciting to see an all star squad of heroes. \r\nAs far as originality in story is considered this series has won grand respects. The central character Aladdin goes on many adventures and makes new friends. Aladdin has ofcourse his Djin with himbut his character is so much more captivating than the original one. Here he travels finds new comrades and fights battle and becomes stronger. His supporting characters, actually other heroes from Arabian nights are never his second in command or dependent upon his unique gifts. Each one progresses with him and becomes stronger, enough to fight and win their own battles. \\n\r\nAladdin is out of world character and most of the series is his journey for finding meanings of spiritual questions in life.\\n\r\nInteresting thing about characters is that almost all of them are shady and prone to darkness and evil. None is so pure and heroic that they can and will never do anything wrong and everyone makes mistakes.\\n\r\nI will finish here that Magi is an upcoming promising franchise and everyone should watch it. It is better to watch it's entire season at one length or over a weekend because the story rises at fast pace in 25 episode sequence and finishes there itself. No need to go about wondering what will happen in series.",
            "date": "2015-06-10T04:18:00+00:00",
            "helpful_count": 14,
            "mal_id": 189987,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rorschach_kills",
                "username": "rorschach_kills"
            },
            "url": "https://myanimelist.net/reviews.php?id=189987"
        },
        {
            "content": "If you haven't watched Magi: The Labyrinth of Magic, then read no further but if you have, continue as want.\r\n------------------------------------------------\r\nIf you enjoyed the first series of Magi, you will love this even more! There are more characters that you have haven't seen yet. More battles. Everything.\r\nStory: 9\r\nFrom the first series of Magi, to this, there is a battle of light vs. dark. An constant struggle for power. The Al-Thamen is the organization bent on destroying the world, sucking all the ruka from all lifeforms. Aladdin, Morgiana, Alibaba, Hakuryuu, all have something to complete. They set on a journey to find themselves and become stronger. KingSinbad has his priorities. Everyone knows he is a sly devil. But with Hakuryuu, there is an internal struggle with his mom. Al-Thamen have their leashes on Kou Empire. What will happen? You have to watch the anime to figure that out.\\n\\n\r\nArt: 9\\n\\n\r\nI have no complaints against the artwork. I enjoyed the characters designs and the djinn equip was something amazing to look at.\\n\\n\r\nSound: 9\\n\\n\r\nAll the characters voices were spot on, that is if you used Japanese subtitles, if not it would be some horrible voice acting. The openings are pleasant to listen to and the music in the anime is nice.\\n\\n\r\nCharacter: 9\\n\\n\r\nCompared to most anime, this has a huge lineup of characters. Most of the time when this is done, it is executed poorly but this isn't the case. You get to see the characters lives, personalities, and how they interact with people daily. I'm very impressed of how the characters are dynamic and continued to grow threw the series. \\n\\n\r\nEnjoyment: 10\\n\\n\r\nThroughout the series, I had myself chuckle because their is some \"WTF\" moments but that is what made this Magi. The fights were awesome and were different than a typical Shounen. You will not be let down if you watch it.\\n\\n\r\nOverall: 9\\n\\n\r\nThis anime is something that should be cherished. I highly recommend it to anime. It is not your average run of the mill Shounen. NO, it is something better. Further unique that sets itself apart from shows like Fairy Tail, Naruto, One Piece, etc. You will learn to appreciate for what this anime has done. Of why it got the praise. You see the high rating. You'll understand why after you watch the first series and this one as well. You will not be disappointed, I stake my life on it.\\n\\n\r\nSo many emotions boil throughout, laughter, sadness, happiness, are some feelings that I expressed. Not all anime does that where you can relate to it. But this anime surely did so. I wish there was another series to go after but we'll see. We can only hope...",
            "date": "2015-01-11T00:10:00+00:00",
            "helpful_count": 13,
            "mal_id": 177351,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2864133.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dustinator1991",
                "username": "dustinator1991"
            },
            "url": "https://myanimelist.net/reviews.php?id=177351"
        },
        {
            "content": "-\r\nAs per usual, this is part of a video review on youtube, and I'm proud how this turned out, so go watch/listen to it over there ~ \r\nhttps://www.youtube.com/watch?v=7i260HcpLSE\r\n-\r\nLike „The Labyrinth of Magic“, this is a fantasy-adventure borrowing themes from all around the world. Again, it was animated by studio A1-Pictures and directed by Masunari Koji. Obviously different is the original date of airing, which is now Fall 2013, and it adapts chapters 111 to 196 of Ohtaka Shinobu's manga.\r\nAfter the events of season 1 and successfully conquering the dungeon Zagan, our heroes stand before the question of what to do next. Stay in Sindria withSinbad or journey to another country? While befriending Dunya, the corrupted princess they fought in the dungeon, Aladdin decides to travel to Magnostadt, country of magicians and apparently source of the dark metal vessels. Much to Alibaba's dismay though, the wants to go there on his own. Morgiana decides to travel to Katarr, her homeland, and Alibaba still has problems with his full Djinn-Equip, for which he travels to the empire of Reim in the west, while Hakuryuu is called back to Kou.\\n\r\nWith the main cast parting ways, the focus of the story shifts, following only Aladdin with two episodes exception dedicated to Alibaba and Morgiana respectively. We do learn a bit more about Hakuryuu, especially what his reasoning for hating the current Kou empire is, but all 3 are as good as forgotten for the bigger part of the show.\\n\r\nGenerally though, there is not as much focus on any of the characters, except Mogamett, the director of Magnostadt's magic academy, which is basically Hogwarts, and Titus Alexius, a magician from Reim introduced after the first half. We also learn about many new characters, like the leader of Al-Thamen, the rest of the magi, and Kou's royal family, all with distinct characteristics and features. Sinbad also finally proves what a terrible person he is.\\n\\n\r\nThe focus taken from developing the main characters is set on developing and explaining the world instead. There's a lot of exposition on how magic works and the different empires. Sadly, that exposition is mostly dumped on the viewer and with the exception of the climax, there's as good as no action present, making this more a show about being told stuff, rather than an exciting adventure.\\n\\n\r\nThe missing action makes the first half at least passable to look at, as a drop in quality from the first season's start is already noticeable from the beginning, but at least doesn't hurt yet. The show does spend a lot more time in this chibi-style though, which I didn't appreciate. In contrast to its predecessor, I did notice a lot more bad CGI, and even a lot of it at unnecessary parts, like an army of soldiers looking all the same, but not moving. And there's a creature that's half drawn and half CGI, which looked absolutely terrible. Like season 1, the second half is incredibly lazy in terms of animation and wasn't fun to watch.\\n\\n\r\nThe soundtrack is mostly taken over from what we know of season 1, I personally hoped for more new stuff, but as it wasn't bad before, I won't complain.\\n\\n\r\nAnd now, once again, we pose the final question:\\n\r\nIs „Magi: The Kingdom of Magic“ worth the watch?\\n\r\nIf you're a big fan of season 1, this works well as an extension to the universe, but it's not a good show in itself. If you already struggled during „The labyrinth of Magic“, you won't get anything out of this. It's not just a build-up to a third season that doesn't exist, but at least a finished arc, so I won't say „wait for the next one before you watch it“. To sum it up: If you're interested, why not? But if you aren't, just ignore it and end your relationship with the franchise at this point.",
            "date": "2015-12-15T11:11:00+00:00",
            "helpful_count": 13,
            "mal_id": 205630,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3010187.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/UsaagiTsun",
                "username": "UsaagiTsun"
            },
            "url": "https://myanimelist.net/reviews.php?id=205630"
        },
        {
            "content": "A catastrophic collapse and blunder is what the kingdom of magic can be described as. It takes a weird direction in terms of storytelling, character building and world building and centers it around a conflict that is brought upon due to mere selfish desires. The first season subtly built its world through political conflict, internal strife between characters, and eccentric disney like environment/setting. The Kingdom of magic deviation from it's predecessor seemed like a wild decision because any viewer can tell from the first few episodes that Magi was taking a new approach in how it continues to build the world and characters. However, itfelt very superfluous because frankly, there wasn't enough screen time to continue meandering between characters and conflicts. However, the biggest fall was the central conflict because it developed from one's prejudice and was really underwhelming to create the abomination that was the enemy. \\n\\n\r\nNow the story begins right after the Labryinth of Magic, which directly involves the 4 people we follow in the beginning segments of the show. Now my problem right off the bat was how much screen time there was between the side characters. It seemed to have a lot of unnecessary interactions and most of the time didn't yield anything directly related to the story. There is way too many side characters for there to be any time to devote to all of them while still keeping up with the main core which is Alibaba, Aladdin, and Morgiana. The story maintains its comedic nature, relying heavily on chibi mode and funny reactions amongst the cast of characters. It feels at some points that the show didn't take itself seriously with many tropes that feel out of place, such as blushing for no reason. I can't comprehend what the writers were thinking when they decided to take the route of splitting the main cast. Of course, due to the nature of the story, it made sense that they wanted to split but it was a tall order to get enough screen time to each of them. What we have left is a convoluted plot that has many plotholes as well as one minute wonder insignificant characters. \\n\\n\r\nBut it wasn't all bad, there is a certain disney charm that Magi has with good characters that mesh with the setting. Midway, the tone of the story changed from stopping a bad guy to a more inquisitive theme. It came out of nowhere, but it was handled well with a combination of humor and lightheartedness while also having an undertone theme of mythical beings coexisting with humans. It explores prejudice within civilization and questions which side is truly evil or good. I feel like it came out of nowhere though, because there was nothing like this in Labyrinth. Is self desire the true evil within every living being? While it's not directly answered, it does give viewers something to challenge analytical thought processes. \\n\\n\r\nThe characters severely suffer from superfluous interactions and lack of screen time. It's hard to say something like Magi wasn't long enough, because it was 25 episodes, the equivalent of 2 seasons. I believed that some characters got too much screen time, such as one in the beginning arc, and Aladdin's arc. It seemed like they just so happened to be there when the main core gets caught up in trouble. Although, they do provide internal conflict amongst each other due to difference of opinions and statures. However, my biggest problem was the splitting of the main core. The incredibly reduced screen time amongst them is the biggest change from Labyrinth and much of the charm of the show came from their interactions and resolutions. It seemed like a way to eliminate characters with a lot of screen time so it can focus on the main one. I really disliked that because the ending rolls around and we're left to assume that the separation of these characters built them up individually enough for the conclusion. It was a cheap tactic and I didn't like it one bit. However, the show still had it's comedic touch among the main core, which is great because it shows a dynamic relationship between each other. \\n\\n\r\nI loved the soundtrack of Magi. It has a middle eastern like OST and what better way to implement that than a show that relies on its setting to continue it's story. There were many tracks that I feel is good enough to listen to as a standalone track and it overall enhanced action scenes, more intimate scenes, and brought life to the huge world. The sound effects are good and the voice acting is good, so no complaints at all from the sound department. Animation is good too, albeit a bit confusing due to it's grand scale of what's happening. There is just so many power moves that it can look like it's lagging a bit. \\n\\n\r\nMaybe with the exception of Psycho-Pass and Darker than Black, Kingdom of Magic is one of the worst sequels to a good series I've seen. It's poor execution of it's story direction leads me to believe that the writers are catering a target audience that I'm unaware of. It's separation of characters is the most catastrophic decision that could've happened in a show like this, where the main core was vital to the success of conflicts. Labyrinth had a existential undertone theme that was only explored minimally in Kingdom, which I see as a missed opportunity. Kingdom is a disappointment from a character standpoint, and a hit or miss from a story telling standpoint. The pacing was incredibly lackluster and slow and it sporadically shifted to incredibly fast, which makes the ending more laughable. Magi: The Kingdom of Magic, failed to utilize what it had to make it a powerhouse anime.",
            "date": "2016-05-10T12:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 218313,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4663713.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TakeTheWindward",
                "username": "TakeTheWindward"
            },
            "url": "https://myanimelist.net/reviews.php?id=218313"
        },
        {
            "content": "This might be the most underrated anime ever, I know it has a good place on the rankings but then not many people knows about it.\r\nStory: Watch the 1st season before the 2nd season, confuses you a lot if you don't. Is about a very realistic medieval times even though there is magic there.\r\nThe reason why I call it \"realistic\" because it very is if you understand the main core of the anime. Is about country affairs, back then when there are kings, most of them weren't wise and pretty much corrupt, while now a diplomatic government is the right thing since every one isequal. Since this anime has \\n\r\nmagic, where not everyone can use them but they still stand at top since they are the strongest and capable of protecting the country by themselves, but there is still war where every citizen is involve. There is a lot of relativity in this anime, back then in history where there is slavery and racism, similar to humans and magicians. Where someone has the talent for magic while others don't. Well mainly is about a guy name Aladdin and Alibaba, Aladdin in the incarnation of the Great King from a different world, which means he's kind of the incarnation of god. He journeys the current world and develop with more knowledge and power. He meets Alibaba, a discriminated Prince of a country, they work together and swore to each other to journey every across the world. Then they went across people where is an evil organization that tries to bring the world into despair just like they did in Aladdin's original world.\\n\\n\r\nArt: The Art is outstanding, beautiful but prefer in HD\\n\\n\r\nSound: The Soundtrack is deep and have the right sound for each and every scene, either is a deep scene or a comedy scene, they have the right soundtrack for it. I personally enjoy the sound track \"A Storm is Coming To Us All\", is a good sound track where it describes an overpowered character.\\n\\n\r\nCharacter: Each character has their own stories, Aladdin is the incarnation of god and a king from another world and he's trying to get those memories back to learn HIS meaning of him living. While Alibaba is the prince of a country that got corrupted because he wasn't responsible enough, and regrets his decisions and try to do the best for the country until it got capture by an enemy's country. Well in deep in each character, there is more but too many spoilers.\\n\\n\r\nEnjoyment: Is awesome, well in deep, similar to the modern world and the government. \\n\\n\r\nOverall: Is a must watch, it has it's elements, and one of them is for you. Surprising action scenes and deep/sad scenes.",
            "date": "2014-03-28T19:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 137629,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3273767.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shana5678",
                "username": "shana5678"
            },
            "url": "https://myanimelist.net/reviews.php?id=137629"
        },
        {
            "content": "Magi / マギ : The Kingdom of Magic Review\r\nStory (8/10) Very Good\r\nMore Specifically (8.75/10) Very Good+\r\nThe story I thought for the Kingdom of Magic was very good, I ended up following the manga while watching the anime at the same time and I thought from an accuracy standpoint it was damn near 1 to 1, Obviously not identical they definitely skipped over a couple of things but I personally thought the things they didn't cover are extremely debatable if they where scenes that were \"MUST HAVES\". The place the ended I thought was a decent stopping point but I wasn't a fan of them startingoff the season with a straight up spoiler of something we wouldn't see from episodes to come, if you were an anime only you are sitting there like \"wtf is this? did i miss something at the end of the last season?\" and if you were a manga reader you are like \"wtf are they showing this massive spoiler like right now?\" other than that the placement of other scenes definitely differ with it's manga counterpart but that one was the only one that I think shouldn't have been placed there.\\n\\n\r\nArt and Animation (9/10) Great\\n\r\nMore Specifically(9.5/10) \\n\\n\r\nA-1 Pictures definitely did their thing and if you are an anime-only you would probably give this a 10 and I probably would have if I didn't know how much better the Manga looked as far as art goes. Now the anime adaptation definitely didn't look bad but I personally think they couldn't get it to look as amazing as the manga which is sad because A-1 pictures probably gave it their best, that Managaka is an amazing artist her art style especially on full Jin-equipped character just look straight up outstanding and when you see how they look in the anime it doesn't do it justice, like I said the anime version doesn't look bad, you just might be disappointed if you've seen how they look in the manga. And as far as animation through majority of the anime was great BUT it wasn't consistent through the entire way. There are indeed scenes where if you've seen how they look in the manga and how she wanted it to look if a character is blitzing through enemies vs how it looks in the anime once again u might get disappointed but i think 95% of the adaptation was great as far as animation and art-style adaptation is concern, not a lot of studios could probably do her art style justice in an anime anyway so this is way I'm not being too hard on A-1 Pictures they did their best.\\n\\n\\n\r\nSound (10/10) Masterpiece\\n\\n\r\nThe sound is outstanding the OST (especially Sinbad's theme music) is straight up \\n\r\noutstanding, I'll definitely be listening to the OST when I continue onward while reading the manga because it would feel weird listening to anything else while reading it. Everything is on point sound effects, spells, voice acting (JP VA) all perfect.\\n\\n\r\nCharacters (9/10) Great\\n\r\nMore Specifically (9.75/10) Great+\\n\\n\r\nThe characters are great in Magi, the character development isn't really there I felt there was more in the first season but it's not non-exist just little for our main characters. Their progression as far as strength has definitely went up. Even though we didn't necessarily get to see Alibaba or Morgiana \"level up\" until the very last battle and for a split moment with everyone else but that's just nitpicking I guess. If there's any character that got the most character development whether u consider it a positive or negative development is Hakuyuu even though it feels like he's kind of taking the Sasuke route but oh well we'll see how that goes, not a lot of Judar this season either I enjoyed seeing him run wild in the first season but oh well to their also. Sindad is still awesome.. BA-RA-RA \\n\\n\r\nEnjoyment (8/10) Very Good\\n\\n\r\nThe start of the season I felt was slow and it took at while for me to get hooked honestly but when it got good it payed off. The hype was really real and the openings are still great A-1 Pictures knows how to make it work.\\n\\n\r\nOverall (9/10) Great\\n\r\nMore Specifically (9.20/10)\\n\\n\r\nMagi: The Kingdom of Magic aka Season 2 definitely is better than season 1 and I liked season 1 a lot also. I'll be starting the Magi hopefully I'll be caught up before Season 3 comes out and I'm going to most likely start that Sinbad no Bouken also since Sinbad is the hypest character in this series. Magi lived up to the hype I kept on hearing about it and I think it deserves to be a lot more popular than it is. I know it's quite popular right now but i think it should be a lot more.. like more than Fairy Tail which unfortunately I don't think it is..",
            "date": "2015-10-01T20:30:00+00:00",
            "helpful_count": 9,
            "mal_id": 200301,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4538743.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rikuson1",
                "username": "Rikuson1"
            },
            "url": "https://myanimelist.net/reviews.php?id=200301"
        },
        {
            "content": "Season 2 of Magi, in my opinion, falls short of the first season.\r\nIt takes the three characters through a mediocre arc and then decides to focus on each of the characters individually.  Problem is, one of the characters becomes the main focus while the others get put on the back burner.  By the end of the season, the back burner characters have developed without us seeing it happen with each of them gets about 3-4 episodes.  This leaves much to be desired as far as character development is concerned.\r\nAs for the main focus, I felt like I was watching Harry Potter fora good part of the season and was pretty disinterested, but the season does pick up near the end which has me excited for the next season.  I also would like to mention that the new characters are very interesting once they get into the swing of things.\\n\\n\r\nIf you liked the first season at all, I suggest watching this season to prepare you for the third season.  Things are about to get interesting.  It's just too bad that the season starts off kinda slow, then focuses on someone (suddenly Harry Potter), and drops off the other characters until near the end of the season.  At least, the season ends with you wanting more Magi.  It did for more anyway.  Cheers.",
            "date": "2014-06-10T09:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 146521,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1121513.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Baldark",
                "username": "Baldark"
            },
            "url": "https://myanimelist.net/reviews.php?id=146521"
        },
        {
            "content": "“There is no one in the world who is better than anyone else. Even if you come across someone so dazzling that he has ten times, hundred times the power of everyone else…You mustn’t entrust everything to him. Because there’s no one in this world who can live without making mistakes” …Lord Magomett\r\nI will be reviewing both seasons of this anime in my review. When I started watching this anime, I gave it a score of 7, as the show progressed I bumped up the score to 8, I finally ended up giving it a 9. In other words, this is an anime that justkeeps getting better and better as the show progresses. \\n\r\nOne of the things i really like about Magi, is that it not only has an interesting story, but that story is told well. The world of Magi is vast and an interesting one that touches on several elements like slavery, politics, even racism. The characters are not bland or boring, and as you journey with some of them, you see how they grow and develop. Magi isn't all about a bunch of serious characters, always looking like they just woke up and going on quests around the world to become stronger...Lol, sorry, but this anime can get really goofy at times, and i appreciate it. The sound is the only lacking department of this anime in my opinion. It's ok but not great, but I found a couple of soundtracks i really enjoyed (Season 2 ED by 9ine is noteworthy).\\n\r\nAll in all, i really enjoyed this anime. Can't wait for Sinbad's arc which is airing next month this year.\\n\r\nThanks for reading, have a good day :)\\n",
            "date": "2016-03-05T23:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 212337,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568231.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Taicho-",
                "username": "-Taicho-"
            },
            "url": "https://myanimelist.net/reviews.php?id=212337"
        }
    ],
    [
        {
            "content": "Magi the kingdom of magic was absolutely amazing. I am surprised at the fact that Magi isn't that well know. I love how vibrant the colors are. I liked how this season focused more on Aladdin and how he learns how to use his magic. Also like the bits of comedy within this series as well as the adventure. The ending was amazing as well. It was great to see Sinbad in action and to see the Kou Empire in battle as well. I really hope they make season 3 soon. I also liked how the antagonists where revealed. It was something I didn't seecoming and it also gets me excited to see season 3",
            "date": "2014-08-07T14:46:00+00:00",
            "helpful_count": 8,
            "mal_id": 155695,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3958331.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RoughHead",
                "username": "RoughHead"
            },
            "url": "https://myanimelist.net/reviews.php?id=155695"
        },
        {
            "content": "I watched this sequel to Labyrinth of Magic an entire year and a half afterward. Since I already started watching with the dub I had to wait for the Kingdom of magic to be dub, and boy did they take their sweet-ass time.\r\nAnyway, I watched this anime with such a lengthy time span in between the first and this one so I didn't remember all that much of the first when I watched the second. If I remembered I probably would have given it a higher rating maybe? Oh well.\r\nStory: 9/10\r\nJust like the first season it had an excellent story (I guess). What I likeda lot from this season is more character development and the depth and details of the nations and their people. There espesially that of Magnostadt. Who's right? Who's wrong? The world isn't so black and white but some people tend to handle thins in a single-minded way due to the suffering and the challenges they faced in their life. And so the story unfolds further. This season there was a major war and out of that, came the joined forces to prevent the destruction of their world. I have to admit, that a major part of me enjoy this season was the Major that took about 1/3 of the entire season. It was one thing after the other just as war is supposed to be and this had me on the edge of my seat.\\n\\n\r\nArt: 9/10\\n\\n\r\nSo many characters in this anime. Entire families. So many colors and ethnicities and personalities need to be portray in the art. I believe they did a great job on in this aspect. The fights, battles and even the portrayal of the Rukh was well done. One of the small details I noted was when a volcano erupted, there was smoke AND lighting discharge along with the lava... real volcanoes have electric discharge like that (yeah I notice that), and I appreciated that little detail lol\\n\\n\r\nSound: 10/10\\n\\n\r\nMy little brother made me realize how awesome the OST for this was! Especially during battle. Intense! The explosions are awesome too, the explosions' sounds are proportional to their sizes (yeah I noticed that)\\n\\n\r\nCharacter: 8/10\\n\\n\r\nThey really make you care for the characters and want to route for them. If one of them would become a traitor it would hurt you to your core especially since you like them so much. As I said before, there are entire families and they each play a role in the anime so there are a LOT of characters. They focus on the right ones when necessary so I give an 8.\\n\\n\\n\r\nOverall I give this anime, just as I did the first season, a 9/10!\\n\\n\r\nWould definitely watch season 1 and 2 again sometime.",
            "date": "2016-02-08T21:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 210474,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/For_Reign",
                "username": "For_Reign"
            },
            "url": "https://myanimelist.net/reviews.php?id=210474"
        },
        {
            "content": "Well, I am very late since I just made an account yesterday.\r\nIf you have watched a lot of anime, you'll acknowledge that the plot for Magi is one of a kind. Only this anime will fall under the theme, \"Arabian\" with magic and intense action. \r\nThis anime left me speechless. I've re-watched this for a lot of times already, and still, it doesn't fail to make my heart pound. This anime has a special place in my heart, along with FMA brotherhood.\r\nI am not good at making reviews, but please do watch this. This underrated anime deserves A LOT of love and recognition.",
            "date": "2019-03-31T05:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 305011,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bakaichigo",
                "username": "Bakaichigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=305011"
        },
        {
            "content": "The Kingdom of Magic is Magi's greatest season and an absolute masterpiece. And I'm going to tell you why without spoilers so you can read this review, especially if you haven't watched it yet.\r\nNot since Full Metal Alchemist: Brotherhood have I binged a series this hard. (FMA: Brotherhood still holds the record for my biggest binge; 31 episodes in a day, basically watching half of it in less than 24 hours)\r\nMagi: The Kingdom of Magic is filled with complex characters, to both love and hate, with very few being purely evil. The two OPs in this are both great and fun, and you will neverwant to skip them. \\n\\n\r\nIt takes the trio in Labyrinth of Magic; Aladdin, Alibaba, and Morgiana, and builds on them even more in this season while introducing new characters to love, more challenges to overcome, and powerful, intriguing enemies to face. The political intrigue of Labyrinth of Magic is still present in this season but feels dialed back a little, while still holding its presence. Like the previous season, it isn't afraid to separate our group for them to explore their individual struggles and desires; \\n\\n\r\nMorgiana wants to see her homeland.\\n\\n\r\nAladdin wants to become a more powerful mage, rather than just relying on his Magi abilities for power, so he can be of more help to the world and his friends.\\n\\n\r\nAlibaba wants to become strong enough to take back his kingdom, which includes learning to better harness his Djinn and even how to hold himself as a leader.\\n\\n\r\nWe get to see them tackle these goals both together and alone, sometimes their journies give them the power to handle situations they must handle along the way, allowing us to see how far they've come. It makes for a fun journey in which we get to see and experience their growth both literally and figuratively.\\n\\n\r\nThe art is fairly simplistic in this anime; nothing very realistic, but not so simplistic it seems barebones or abstract. It's a middle-ground between the two. This allows it to be very detailed when it needs to be, as well as colorful and filled with personality, and also show something grounded and serious when required, as this show also explores dark concepts about humanity.\\n\\n\r\nShowing both these good and bad sides through the characters and plot, which this show does well, gives a complex story that will get you thinking. Very few villains in this anime are simply black and white in means of who is bad and good; being driven to do bad things because of their bad, horrible experiences/past and choosing to be hateful/evil rather than just simply being a bad person or coming out of it a better person. This makes them seem more human and gives them that complexity, which makes it thought-provoking and interesting. This story doesn't use \"simplistic evil\" as some others do for their villains.\\n\\n\r\nOverall, you will be on a roller-coaster ride watching The Kingdom of Magic. You will laugh, cry, be enraged, maybe even confused. Characters who you thought were evil may do something that doesn't seem at all like something a villain would do. One of the heroes may do something questionable, or even against their nature. Their intentions may even be pure. But much like humanity itself, it's complex, rather than simply black and white.\\n\\n\r\nHowever, this anime shows how much of a difference kindness can make in the world, and how much humanity can make a difference when we're not constantly fighting and feuding with each other, but that doesn't mean those have done wrong aren't punished for their actions, or don't have consequences to face. You will most definitely be inspired by this anime, especially when you finish it. I most certainly was. And the animes I give a 10/10 are the ones that go that extra mile and inspire me. I hope Magi: The Kingdom of Magic does that for you too. \\n\\n\r\nStory: 10/10\\n\r\nArt: 9/10\\n\r\nSound: 9/10\\n\r\nCharacters: 10/10\\n\r\nEnjoyment: 10/10\\n\\n\r\nOVERALL: 10/10; Magi's best season and an absolute masterpiece. (A-1 Pictures, please get Season 3 out before I die)",
            "date": "2019-03-27T10:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 304491,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6351255.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheFabledHero",
                "username": "TheFabledHero"
            },
            "url": "https://myanimelist.net/reviews.php?id=304491"
        },
        {
            "content": "Magi: The Kingdom of Magic,\r\nHaving watched both The Adventures of Sinbad and The Labyrinth of Magic I was really excited to carry on to this. The Magi series is fantastic and really enjoyable.\r\nThis season picks up where the first left us, Aladdin, Alibaba, Morgiana and Hakuryuu completed the dungeon and have gathered back together with Sinbad in Sindria. \r\nThey've grown a lot since arriving there, but it's coming to the time where they need to set off on their next adventures.\r\nYou get to see them grow separately and together in this season which is really nice. They keep their promises of adventuring together, though theyalso set out for their goals alone. Seeing them go off by themselves but always striving to make the others proud adds a lot to the feeling of the anime. They maintain their close friendship even while miles apart. \\n\r\nYou get to see them learn a lot more about themselves and become stronger, mainly with the goal of being able to protect each other and all the good people they've become friends with along the way.\\n\\n\r\nAladdin is just as pervy as always. Seeing him make friends with Titus and Sphintus is great, he gathers friends that are very similar to each other. They all have something to fight for.\\n\r\nI do wish there was more of a focus on what Alibaba and Morgiana were doing while they were all separated. Finding out there was a year gap toward the end, it didn't feel that way at all which gave it a bit of a disconnect. If it was portrayed better time-wise then that would have been good, but you can see the amount of time reflected in the growth of their powers so that kind of makes up for it.\\n\\n\r\nThe battles in this felt a lot greater, with the amount of people and armies battling and also how much stronger they've become. \\n\r\nSeeing everybody gather at the end was really impressive and one of those great goosebumps moments.\\n\\n\r\nThis season was a bit better than the first in some ways, like stronger story and growth. \\n\r\nIt all came together really well and the end trails off so there's a possibility of another season which is great. It was really fun and exciting to watch and I'm very hopeful for more.",
            "date": "2016-12-28T04:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 236747,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=236747"
        },
        {
            "content": "I love Magi. Out of all the shounen anime and manga that I have come across this is probably my favorite and the best so far. I say this because the main characters aren't OTP and it's not about nakama power or big ass battles. This is about who can be a political wiz in a world that's in disarray with slavery, poverty and war on the rise. In a world where magic exists and you don't know who your friend or foe is. \r\nIt's great because it gives you a look as to the political structure of the countries that Aladdin, Alibaba and Morgianago into and how the current systems are faulty. I will be honest, personally I prefered the first season more compared to this one because I really like Alibaba and Morgiana's stories in the show. However, I do see that this season was in many aspects about growing Aladdin as a more powerful magi and maturing up the blue haired pervert XD it did that beautifully while also introducing new characters and making them well rounded even if they are only supporting characters. \\n\\n\r\nI also enjoy the expansion of the the Magi world. That not only are their people with Djins but also those with magical power who aren't always the top dogs of the food chain. Compared to the first season where it seemed as if those with magical power had a lot of power and influence in the world, this season showed that their are two sides to the same coin.\\n\\n\r\nAs someone who reads the manga, I would love if they did another season for this series because OMG, the twists and turns and emotional rollar coaster that this series has developed would be an amazing feast to behold in anime format.\\n\\n\r\nThat is why if you really enjoyed the second season and you really want to discover the things that Aladdin knows, I suggest reading the manga series. You won't be dissappointed.",
            "date": "2016-05-06T22:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 218058,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3164339.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/I_Love_Pikachu",
                "username": "I_Love_Pikachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=218058"
        },
        {
            "content": "I really enjoyed \"Magi: The Kingdom of Magic\". When watching \"Magi: Labyrinth of Magic\", I was introduced to a lot of characters, and was able to learn about the main characters and their importance. I found that when watching \"Magi: The Kingdom of Magic\", there was a lot \"self improvement\" between the main characters. The main characters learned more about themselves and how they could successfully follow there own paths. I do not believe that the anime balanced the amount of \"self improvement\" time for each character. Otherwise, I found the art and characters amazing. I felt that the story was an excellent continuation of\"Magi: Labyrinth of Magic\", and I loved seeing additional challenges and adventures. I especially loved learning more about characters that had been briefly discussed in the 'Magi: Labyrinth of Magic\". I enjoyed the anime greatly, and recommend it to those who enjoyed \"Magi: Labryinth of Magic\"! Currently there is no season three, but I really hope that it will be made!",
            "date": "2017-06-30T21:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 251611,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4807075.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Otaku_101_Queen",
                "username": "Otaku_101_Queen"
            },
            "url": "https://myanimelist.net/reviews.php?id=251611"
        },
        {
            "content": "Story (9/10): Magi: The Kingdom of Magic is a continuation of Magi: The Labyrinth of Magic. The show starts off at the end of the first season, Aladdin and his friends are on their separate paths to go after their own personal goals. Unlike the first season, this season will be an overarching storyline that will primarily be centered around Aladdin and the country of Magnostadt. Like the first season, dark themes surround this anime ranging from war to discrimination and imprisonment.\r\nCharacters (9/10): In the second season, more characters have been added to the show. Because of this, I will only discuss vital characters pertainingto the plot.\\n\\n\r\nAladdin is still childish but he's growing up. He is shown to be much wiser and skillful as he uses of his newfound experience during combat. Unfortunately, as the story progresses (and secrets are revealed) he will become conflicted in his sense of right and wrong.\\n\\n\r\nIn this season, Alibaba and Morgiana have now been downgraded to supporting cast members in order to make way for new characters. At the very least, both of them do have their own episodes concerning their desired goals before the story shifts back towards Aladdin.\\n\\n\r\nTitus Alexius is a student of the Magnostadt Academy who later becomes Aladdin's friend. Because of his situation/condition, he sees life as precious and seeks to make the most of his life by protecting his friends.\\n\\n\r\nScheherazade is one of the three original Magi of this world who is the High Priestess/co-creator of the Reim Empire. Her backstory intertwines with that of Titus so this is all that I can say about her.\\n\\n\r\nMatal Mogamett is the main antagonist of this story arc. The character development for him is very good. He is a very discriminative anti-villain who will stop at nothing to maintain the current status quo of Magnostadt and the magicians who live there. His reasons and actions are so well developed that it just blurs your moral perception.\\n\\n\r\nSupporting Characters: There is even more supporting characters than the first season. Again, each one of them have unique personalities and values. Unlike the first season, many of the new characters have minor backstories/development. This is justified seeing as how most of them are soldiers or participants in the coming conflict so not much backstory is needed.\\n\\n\r\nArt/Animation (10/10): The art/animation is modern. The characters are drawn with extremely detail when in their Metal Vessel/Household Vessel forms. The backgrounds are also very detailed and colored brightly. The same goes for any battle scenes that take place; the animation is very fluid.\\n\\n\r\nSound/Music (9.5/10): The sound/music was good. The opening theme music was exciting, upbeat and joyful like in the first season. The second opening theme music was more emotional. The soundtrack over the adventure and battles were also really good.\\n\\n\r\nEnjoyment (9/10): I enjoyed it. But by the series' end, my desire to watch more has become insatiable; especially due to the massive cliffhanger ending; which I felt could be completed with a few OVAs.\\n\\n\r\nSummary/Overall (9/10): The story was good and exciting. The character development is excellent. The music is also very good. The amount of satisfaction after watching this is very high.\\n\\n\r\nReview #12",
            "date": "2015-08-28T14:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 197317,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4744961.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Anim3Punk",
                "username": "Anim3Punk"
            },
            "url": "https://myanimelist.net/reviews.php?id=197317"
        },
        {
            "content": "At first, I was a bit reluctant to watch this second series, as many recent ones have been much worse than the original (freezing, chuunibyou, etc.).  But, this was not the case with Magi: The Kingdom of Magic.  \r\nSide note: 10/10 for me is not perfect, it just means I had no reason to mark it down.\r\nStory: 9/10\r\nAs an avid fan of the first season, I was greatly surprised by the story (in a good way.  Each character's story was intriguing and helped build a lot of tension for the ending.  Now, the main reason this is a 9 a nota 10 is Morgiana's story.  Her story was lightly touched on and she kind of just appeared at the end where all the characters gather which made it a bit cheesy.  The ending was left open, mostly because the manga needs to produce more content, and I was left yearning for more.\\n\\n\r\nArt: 10/10\\n\r\nOne of the most memorable things in this anime was the comedy for me, and the art fabulously complemented it.  As with the first season, there were many moments where the character's art completely changed to match the comedy.  (I don't really know what it's called)  Also, the fighting scenes were smooth enough so that I didn't notice anything bad.  \\n\\n\r\nSound: 10/10\\n\r\nThe 2nd ED in particular is one of my favorites.  But, both of the OP and the 1st ED were also good.  I don't really pay too much attention to the soundtracks during the anime, so I can only really tell if it's repetitive or doesn't match the animations, which in this case, was not repetitive and went well with the animations.\\n\\n\r\nCharacter: 9/10\\n\r\nWith such a large cast of characters and somewhat banal villains, I find it hard to care about any characters besides the main ones.  But that being said, the main characters were expanded on splendidly and are quite different than they were at the end of the first season. \\n\\n\r\nEnjoyment: 10/10\\n\r\nFor me, some animes take a while to get interesting or have some boring episodes, but Magi: The Kingdom of Magic didn't.  From the very first episode, I was hooked.  Aladdin's story in particular was one of the best I've seen and left me wanting to watch the next episode.\\n\\n\r\nOverall: 10/10\\n\r\nThis anime was by far one of best I've seen in a while.  I'd definitely recommend it to others. \\n\\n\r\nIf you're stuck wondering if this is worth you're time, as I often am, don't hesitate to give this one a go.  You won't regret it. \\n\\n\\n",
            "date": "2014-06-08T23:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 146359,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3205089.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kilreffz",
                "username": "kilreffz"
            },
            "url": "https://myanimelist.net/reviews.php?id=146359"
        },
        {
            "content": "Does the second season top the original? The answer is yes, - yes it does, launching off straight from where the last season ended, Kingdom of Magic takes you on journey that forever changes our characters and world forever.\r\nEven though most of setting stays the same throughout, new locations and factions are presented from the magical city of Magnostadt to the deadly Reim Empire that's based upon the real world's Roman Empire as well as including nations from the previous series like the Kou Empire and Sindria, while also being given an in depth look at there working to get a sense of scale ontohow powerful these nations are and how they effect the Magi World, this is a great addition to the series as it helped immerse me in the world and care more for it. \\n\\n\r\nNow on the other hand the start of the plot was a little disappointing, as it did something I hate which was show the end or close to the end of series at the start of the show which was totally unnecessary. Other then that though the story is fantastic and well written taking each of the four main characters on different journeys to better improve there characters, well for the most part as Morigiana and Hakuryuu barely make an appearance, having very little screen time but on the other side Aladdin and Alibaba become the driving points of the plot have great amount of detail being put into there growth even if Alibaba's is shorter, but nevertheless these characters help drive you through a fantastic plot full of twists, fun battles and new interesting characters through interesting and fun arcs even if it was a little predictable. Though even though the ending was great it does cliffhanger and unlike the first there's no next season in sight which was a disappointment.  \\n\\n\r\nAs I've just said out of the four main characters only three get any real development and out of those three only the one getting vast amounts of screen time which is Aladdin who as said before has good screen time and development changing from that small naive child from the first season to a wise magi, while others like Hakuryuu and Alibaba get good development that helps shape there new personalities for the rest of the season. While with Morigiana, I'm not sure what happens with her as she is only in a few episodes where nothing really happens which was a disappointment. \\n\\n\r\nBut on a brighter side the support characters flourish in this series once again, well new ones do and some older ones, such as older characters get new back-story, in particular members of the Kou Empire (Kougyoku) are given a much needed back story though other characters like Sinbad don't. But leaving the old behind, lets focus on the new, with newer characters being shown at every corner that are all fun and interesting to look at while story or two that helps drive the plot forwards. \\n\\n\r\nSpeaking of fun to look at, characters designs in this show are as great as ever, with new character looking unique and refreshing and old characters getting re designed which helps keep the feeling that the world of Magi gives out. The art in a similar fashion while remaining the same looks better and animation is faster and improved. \\n\\n\r\nWhich can also said about the soundtrack as well, which resonates well with the world the anime has build and makes you feel at home, but this can not be said of the Openings and Endings, as I found the first opening and ending to be boring and forgetful like they where missing that spark that made the the first enjoyable, but on another side the second opening and ending help capture that again.       \\n\\n\r\nIn conclusion, the Kingdom of Magic is a worthy second season and is a must watch for people who loved the first. Even if is held back by a few errors.",
            "date": "2015-12-20T08:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 206118,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=206118"
        },
        {
            "content": "Story - 9\r\nThe story of Magi is such an adventurous experiment from start to end, with the evolution of the characters, setting, and general happiness of the town changing as the events due in a way that feels very natural.\r\nYou can understand and sympathize with (nearly) every character, and the actions that drive the story and the events seem genuine, if a bit exaggerated.\r\nArt - 7\r\nNothing special, pretty generic, with a couple cool looking scenes (Mainly Ali Baba's \"\"\"fight\"\"\" with Sinbad). Next\r\nSound - 5\r\nAgain, nothing special, but the music specifically is so impartial and impending that it didn't help me engage at all, but atleast it wasn't bad.\\n\r\nCharacter - 10\\n\r\nAll of the characters, even the 1-off villains, have an effect on the characters and are themselves interesting characters. None of the main characters are boring and seeing it from one of their perspectives makes the mind blow greater when the other does something surprising.\\n\r\n All of the characters are very lovable and are hard to hate even when they aren't on your favorite character's side\\n\r\nEnjoyment - 10\\n\r\nI very much enjoyed this show, because I'm a simple girl. I get fights, I get cute boys, I get great characters, Im gucci. \\n\r\nOverall - 9\\n\r\nAlthough I enjoyed the show, there are enough flaws for me to understand why someone wouldn't and some of which put me off a tiny bit.\\n\r\nI very much suggest this title, I enjoyed it very much and still adore it.",
            "date": "2019-02-26T18:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 302534,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7843621.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/1Phoenixian1",
                "username": "1Phoenixian1"
            },
            "url": "https://myanimelist.net/reviews.php?id=302534"
        },
        {
            "content": "I liked the 1st season of the show so I continued watching the second one hoping that it will be awesome as the previous.\r\nStory:\r\nIt goes on from the last season and it starts nicely with the trio alibaba , aladin and mor everyone goes to train themselves so they become stronger , but you will not see them until the last episode together and nations fighting for the land it all goes away just for this certain enemy , the most thing that made me dislike the story that every time aladin goes to a fight he tries to rescue everyone I wish that atleast for once he just snap and unleash hes true power.\\n\r\n6/10\\n\\n\r\nArt:\\n\r\nGood just like the last Season.\\n\r\n8/10\\n\r\nSound :\\n\r\nThe same as last season.\\n\r\n8/10\\n\r\nCharacters:\\n\r\nThe anime got a potential for being the best in characters but they didn’t show at all for 24 episode last one all came and show their all moves I didn’t feel it because I didn’t know them and feel their story like the people who came with king Sindbad.\\n\r\n7/10\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed but the problem is that I compare it to the 1st season that’s why I didn’t like much like the previous one.\\n\r\n7/10\\n\r\nOverall: 7/10 \\n",
            "date": "2014-08-01T05:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 154707,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2563171.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/greenblood1991",
                "username": "greenblood1991"
            },
            "url": "https://myanimelist.net/reviews.php?id=154707"
        },
        {
            "content": "Very unique story and it was unbelievably good. I've never seen another anime like it and I still want more, but I feel like the second season lacked a little of that which made the first season superb.",
            "date": "2015-08-05T14:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 195254,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4510126.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Dr3w99Dr3w",
                "username": "Dr3w99Dr3w"
            },
            "url": "https://myanimelist.net/reviews.php?id=195254"
        },
        {
            "content": "Magi review\r\nI love this show and I can’t express how much I adore the three main characters Alibaba, Aladin and Morgiana ,so I decided to put all of my love and raw emotions this show delivered to me into words.\r\nYou go into a bookstore and from the thousands of books laying in the shelves you stood upon  a particular book with a unique and vivid cover  . At first you are hesitant to buy it not being sure of what to expect from its content. Once you open that book you will find out how wrong you were to judge it just byits colorful cover. This is Magi , a book that should not be judged by its cover but for its rich and beautiful content that it offers for its readers. \\n\\n\r\nReading through the pages you will discover a fantastic world, a world filled with dungeons , djinns , metal vessels , household vessels, ruckh, magoi and many other references from the  Arabian culture and history.    The story is what will captivate and persuade you to finish that book, it’s a story about encounters , about the virtue of friendship ,about forming bonds and trust, a emotional story about love, family told through the help of our three main characters experiences Alibaba, Alladin and Morgiana.\\n\\n\r\nIn Magi is not all about the fights it’s more about the reason behind them  giving a meaning to the characters who take part in those battles. Be it for a dear friend, be it to  protect the country you love , be it for your family , everyone has a  reason to stand up and fight for its own cause . In Magi there is not such thing as a villain or hero the anime let’s its audience to decide who is the real villain or hero by presenting the circumstances and reasons for each conflict.\\n\\n\r\nWhat’s the most important thing in a story? Well the characters they are the essence that make the story attractive and Magi doesn’t disappoint us in that domain. The characters are the main reason why you should watch Magi. They have unique and vivid personalities , they provide a lot of entertainment and their stories manage to bring fourth the raw emotions from its audience .  They are times when you hate the characters , times when you love them , times when you laugh and cry with them , times when  you are amazed by their skills and courage,  this is what the characters are supposed to do for its audience in Magi to tell their story through their experiences and overcoming their inner struggles across the  development of the story. \\n\\n\r\nMagi has something else to offer for its audience other  than beautiful colors and fights. Something that holds a deep meaning for the world and plot in Magi called The Ruckh. Divided in two main categories:\\n\r\nThe White Ruckh who represents the flow of life and guidance of fate  which has its origin from  the hope , dreams and happiness of all living beings in that world.The Black Ruckh  who represents those who defy the guidance of fate and fall into depravity , which has its origin from the despair , misery , and fuels of hatred of all livings beings in that world. These two forces are the main conflict for the plot and story in Magi and have different traits and types of using them.  Also Magi offers an insight on some aspects from the politics and economics  and using them for the characterization and plot.\\n\\n\r\nIn conclusion this anime is something that will hold a special meaning in your heart after watching it, its story and characters will draw forward your raw emotions and tears will flow  down on your cheeks , you will love and hate at the same time the characters and finally you will have a great time enjoying the good comedy and well executed fights.  I Fucking love this anime!\\n\\n\r\nOverall 8/10 \\n",
            "date": "2017-07-09T05:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 252356,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=252356"
        },
        {
            "content": "I feel like Magi: The Kingdom of Magic is a slight improvement over the original season (which I quite liked). I want to give this an 8.5, but half points aren't permitted. So I settled on an 8 instead.\r\nSTORY - 9/10:\r\nWhile the characters were really what helped push a first season that was a bit weaker on story, those elements are reversed here. The second season spends most of its time following Aladdin. We get brief glimpses of Alibaba and Morg, and they each make a triumphant return towards the end of the season, but we're really focused on Aladdin here.\r\nAladdin is at the magicschool in the magical country (I'm not even going to try to spell the name out). He's there for a few reasons: he wants to improve his magical skills; he wants to investigate potential links to Al-Thamen; and he wants to find out more about the way the magical vs non-magical citizens live. The story starts out a little weak, with a weird pirate arc taking up the first few episodes. I guess they wanted to give us a little adventure with the team before everyone split up. But once we get into Aladdin's story, the pacing picks up nicely.\\n\\n\r\nAs with the first season, Magi really dives into some dark themes. I wouldn't consider death to necessarily be a mature theme, as its present in a lot of material aimed at children (Bambi, Old Yeller, etc.). But Magi goes into some really sinister areas: the idea that there are different classes of citizens (they touched on slavery in season one, but this stuff goes way beyond that); the idea that people are essentially being farmed for their souls; the idea that these people willingly chose that in exchange for an easy life and the mage's protections - is it okay to treat someone like dirt if they've given their consent? These are some really deep ideas to be presented in a shounen series. It adds a lot of emotional heft and complexity to a plot that would otherwise be pretty straightforward.\\n\\n\r\nWar breaks out towards the end of the season, and it's actually quite interesting to try and determine which side is in the right. The Ko Empire's militaristic ideals aside, you could really make an argument for either side between the Rem Empire and the magical academy. Which is how wars usually work. We really get to see Aladdin shine towards the end, once he takes the crystal off and unleashes his full power. And by the final battle with the dark void, where just about every djinn-equipper in the world shows up to fight, we get to see some pretty cool action. \\n\\n\r\nArt - 8/10:\\n\\n\r\nThe art and animation are solid, if not spectacular. There's a bit more fanservice this season, with Aladdin's instructor's boobs playing a major role in his motivation. But the fight scenes and the magical spells all look great. \\n\\n\r\nSound - 8/10:\\n\\n\r\nI watched the English dub again. I liked most of the voices. The OST was good. Not much to say here.\\n\\n\r\nCharacter - 7/10:\\n\\n\r\nLike I said earlier, I think this section is the biggest detraction to the second season. Character was the strength of the first season, but because we're now spending 90% of the time with just Aladdin, we have to meet a whole new host of characters. And, unfortunately, they don't seem as interesting or nuanced as the first season's characters. \\n\\n\r\nTitus is probably the guy that we spend the most time with, and its clear that the show wants us to consider him the emotional anchor. But given his backstory, he's really just a child, exploring the world for the first time. He's a likeable, endearing character, but he's a simple character. \\n\\n\r\nThe director the academy (again, not even going to try to spell his name) is probably the most interesting character we meet, but he's kind of despicable in a lot of ways. In terms of themes, it's quite intriguing (and repugnant) to see how he views humans with no magical ability. He treats them with absolute indifference, like they're animals or objects. Aladdin is confused by the fact that the director seems like a genuinely warm and caring person until he realizes that the director holds these views. We get some nice backstory through the use of flashback scenes that show the director as a caring individual who wants to use his magical powers to help all humans, but loses that love and positivity along the way.\\n\\n\r\nAladdin himself continues to grow, both as a character and a mage. Nothing earth-shattering, but it's nice to see the incremental development of Aladdin. You can clearly see how he will one day be a true Magi, a leader of humans. \\n\\n\r\nAlibaba gets a couple episodes and Morg gets one, which is enough to give us a taste of what they've been up to, but their development occurs mostly off-screen. \\n\\n\r\nENJOYMENT - 9/10:\\n\\n\r\nI ripped through the second season pretty fast. Part of that was because I wanted to watch Iron Fist on Netflix, and I liked to finish the show I'm watching first. But I genuinely enjoyed the second season of Magi. It's a fun show with a lot to enjoy. And I liked the pacing this season. By focusing squarely on Aladdin (who probably had the most interesting story out of the three anyway), it lends an air of mystery as to when Alibaba and Morg would re-appear. The story handles that aspect quite nicely, and it leads to great moments when they do eventually re-appear. Not having Sinbad around for most of the season was a bit of a downer, as he was probably my favourite character from the first season. But he gets some pretty epic moments in the final battle, so that was nice.\\n\\n\r\nOVERALL - 8.5/10\\n\\n\r\nThis season was an 8.5 for me. But since MAL doesn't allow half-points, I'll give it an 8 here and a 9 on  my list to split the difference. Magi is a definitely a typical shounen in a lot of distinct ways, but it has a mature air about a lot of the themes that it delves into. It hits satisfying emotional beats, has mostly likeable characters, and offers up an interesting setting based on the Arabian Nights. All in all, I would recommend this show to most people.",
            "date": "2017-03-19T06:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 242956,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2664111.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/elrond99",
                "username": "elrond99"
            },
            "url": "https://myanimelist.net/reviews.php?id=242956"
        }
    ]
]