[
    [
        {
            "content": "We’ve all been through a phrase where we were once a kid and behaved exactly as one. It’s human nature and God gave us a life to be part of society. What does that mean for a show like Gakuen Babysitters? The real question here if you ever felt experienced the feel of responsibility. No, I’m not talking about doing the chores and helping around the house. I’m talking about taking care of someone else in your life, perhaps a stranger or someone much younger than you are. Welcome to the world of Gakuen Babysitters.\r\nI should say right off the bat that the show isexactly what it looks like. Translated as “School Babysitters”, the series is about taking responsibility and being able to take care of kids. I’ve never took the task of caretaking before so watching this show felt like a refreshing experience to me. As a reader of the manga, this anime does what it has to do get its message across and that’s to deliver an experience about taking responsibility. \\n\\n\r\nThe first few episodes lets the audience know about the situation of the protagonists, Ryuichi and Kotarou. Their parents died and with no place to be called home. Morinomiya Academy’s chairwoman decides to give Ryuichi a home along with free schooling in exchange for taking on the role of a caretaker. Now I have to admit, such a premise sounds like a potential moody story for tearjerking moments. However, the show really isn’t but instead formulated into a heartwarming lighthearted story. Ryuichi is really someone that’s kind hearted and has a bottom to earth type of personality. The show chronicles his life as a babysitter as he learns the ins and outs. While I can’t say there’s anything exceptional about him, it’s shown that Ryuichi is an incredibly helpful individual and puts others before himself. You’d think that after losing their parents, he would venture down a path of depression. No. Here, this guy makes a huge comeback after life knocks him down and it’s inspirational. Sometimes though, I feel like his personality is too friendly and can get him into unintentional trouble. Similarly, his brother sees the joy of life. While Koutarou is nowhere near as mature, he’s definitely a kid who is growing up in the right way.\\n\\n\r\nAs I’m watching more and more of Gakuen Babysitters, I realized that the show really tried to make us experience something. The realism of being responsible is part of growing up and this show really feels like one to capitalize that. Besides just the Kashima brothers, we also meet other caretakers at the school. Most of their circumstances are in a better position and they have more experience than Ryuichi. Despite that, they get along fairly well with him because of his gentle personality. On the other hand, Ryuichi does meet someone at school with an underwhelming impression of him. Her name is Maria Inomata and it won’t take for viewers to quickly realize her blunt personality. Compared to others, Inomata is someone that is hard to get along with. She is extremely serious and dedicated to studying (as she claims as one of the most important things in life). However, she also gets involved with the kids at the caretaker after unusual circumstances and shows a much more caring side. The easy picture to look at is Ryuichi’s influence on her. She begins to realize that life is more than just about studying but also being responsible. Watching her development is one of the dynamics of this show as it shows how people can change. Similarly, Ryuichi learns a lot from his daycare duties and if I were his parent, I’d be damn proud of him.\\n\\n\r\nFeaturing a cast of younger characters, Gakuen Babysitters does its best to create an atmosphere of innocence and youth. The kids in this show are very young and behaves in ways you can easily guess. Some of the things they say can be misunderstood or brutally honest. Because of their age, you can expect a lot of shenanigans in their daily lives. Characters such as Taka, Kirin, and even Koutarou can cause trouble despite being unintentional. It’s such traits that make them kids. Despite that, I find this cast to be very charming and realistic. Their attachment to their older siblings and parents is also heartwarming to watch once you understand them more. \\n\\n\r\nSimilar to the manga, the anime adaptation follows more of a slice of life storytelling so you really shouldn’t expect a complicated story. Every day is an adventure of its own. Because the show takes place at school, you can also expect some drama to develop between the older characters. A prime example is Inomata as feelings are developed about Ryuichi. While this show isn’t a love story, it gets more and more obvious. While I can’t say the show is really well written in that respect, it does capture the feel of what school life is like for girls of her age. At the caretaker center, Ryuichi’s bonds with others is perhaps a key selling point of the show. He is able to earn the trust of the kids and other caretakers. However, the story itself still needs a lot of work. I’ve read the manga and as a 12 episode TV anime adaptation, it felt like a lot was missing. There’s also some uncomfortable moments in this show that ventures into controversial territory. (I’m looking at you Tomoya Yagi) The overall tone of the show can also be a bit dull once you realize it’s not the type of anime for you. It’s a blend of slice of life and shoujo so be aware of what’s ahead.\\n\\n\r\nAdapted by Brain’s Base, this show is an example of a realistic slice of life. While the raw visual quality isn’t overly impressive, every character in the show can be relatable and their character designs is an example of that. The kids are adorably charming and their character expressions is exactly how they should behave. Character chemistry is imperative to capture the mood of the show and thankfully, Brain’s Base and the director is able to meet such expectations. Some characters’ designs definitely stand out more than others such as the school chairwoman and her signature hair. To say the least, the artwork gets the job done and not be overlooked.\\n\\n\r\nTo portray such a younger cast takes skill and thankfully, the VA skillfully does just that. From crying to the happy moments, every child in this anime make us believe that they are real. The students at the school all have their own personalities as the VA easily fits into their shoes. The only character that I have a problem with in this anime is Yuki. She’s the annoying type of school girl that I can’t stand and seems to be just there to make everything looks more than silly than it is. Compared to other characters, she isn’t likable and sometimes, I find the kids to be more mature than she is because of her personality. On the other hand, the theme songs in this anime is definitely appealing to watch with its pure innocence. The catchy and lighthearted tone of the soundtrack is also easy to get used to.\\n\\n\r\nAfter watching Gakuen Babysitters, I can easily say that the show can be recommendable to almost everyone. It’s probably targeted to a more specific demographic but anyone should be able to watch this with an easy and open mind. From its daily slice of life adventures to the charming character chemistry, this is a show that tells what heartwarming is really about.\\n",
            "date": "2018-03-25T07:13:00+00:00",
            "helpful_count": 40,
            "mal_id": 274991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=274991"
        },
        {
            "content": "Now that 4 episodes have aired, I can redo my review, but keep it true to what I originally had it as. I don't typically write reviews because I don't see the point. I can't describe it as well as others and most of the time the things I loved/hated have already been commented on in more detail than I could ever have written. But not for this one. Not this time. TLDR at the end. \r\nGakuen Babysitters is fantastic. It is by no means thought-provoking or action-packed. It does exactly what it sets out to do: be a relaxing and sweet anime about childrenand their families or, in some cases, what is left of them. If you're expecting more than that then I'm sure that you'll be disappointed. This is Winter seasons \"I've had a long day and I hate everyone,\" anime. Sit down, watch kids do stupid things and be adorable, and relax. \\n\\n\r\nThe 3rd episode introduced us to this \"pedophile\" character as some people have described him as. I saw him as weird, but not once did he seem like a pedophile. His nose bleeds when he's around the children because they're adorable and he strains himself. People tend to forget that nosebleeds are from being overly excited and because the anime industry consistently uses nosebleeds as a \"sexual desire\" indicator. Yeah, no, you can get a nosebleed from strenuous activities such as being overly excited or being stressed. I've seen a friend get a nosebleed because he was extremely pissed. Was he turned on? No. Is the character in the show turned on when he looks at the kids? No. The human body creates nosebleeds when the body undergoes a certain amount of stress. I know all the anime industry shows is nosebleeds when they're sexually interested but please take the time to research other causes of nosebleeds. I can't say I'm sexually excited when I wake up in the morning and have a nosebleed from the stress of the dry season. If you remove the nosebleed from his character, does it change anything about the way he behaves with them? No, it really doesn't. If you saw him without the nosebleed, what would you think? \"Oh, he just really likes kids!\" That is what I see. I've yet to see him display any pedophilic behavior but it's immediately written as such simply because of the nosebleed cliche. I want to see this sexual nosebleed cliche end and I'm hoping this character is a step towards that. \\n\\n\r\nIf you're looking for an actual pedophile character, watch Papa no Iukoto wo Kikinasai and then come back to this anime. They actually legit had him stalking her, taking pictures of her, and drooling over her. He completely wanted to be with her in every way imaginable and it was \"totally okay.\" Which one is the pedophile? The one who wants to pinch their cheeks and watch them be adorable or the one who wants to drool over a 10 year old in a bikini and act like it's totally okay for him to want to have sex with her?\\n\\n\r\nI really think this anime has the potential to break our hearts. It shows itself as just a nonsense anime about children and their activities, but then it takes a dark turn and reminds us that the protagonists parents are dead. It is not just about comedy, but the tragedy of loss and how it can affect the human mind. I enjoyed the 4th episode very much as we saw a side of our protagonist that we hadn't seen before. He's lonely. Jealous, even.  He has the kids but what about people his age? He has the duty of the babysitting club but what about his own interests? I want to see them expand upon this unless the babysitting club will just be full of people by the end of the anime. Either route will do. Every character is interesting and I hope to see them continue to grow and heal. \\n\\n\r\nTLDR: The character is not a pedophile. Nosebleeds are caused by being overly excited, not only from \"sexual desire\" like the anime industry tries to say. I've been fangirling over how cute the kids in this anime are and I've easily wanted to pinch their cheeks the same way. Am I a pedophile? No, they're just really cute. Get over it. If the character chooses to slowly devolve into what everyone assumes he is, then I will happily delete this review. Until then, I am getting serious grandparent vibes from him. Odd? Yes. Far too happy? Yes. Pedophilic? No. I have high expectations for this anime and they have been fulfilling them quite well.",
            "date": "2018-01-28T11:47:00+00:00",
            "helpful_count": 39,
            "mal_id": 269921,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5380503.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kookerz32",
                "username": "Kookerz32"
            },
            "url": "https://myanimelist.net/reviews.php?id=269921"
        },
        {
            "content": "[Spoiler Warning]\r\nWhether or not you find Gakuen Babysitters unsettling, there is no denying it teaches awful life lessons.\r\nTo summarize why I dropped it; it’s a show about a kid who has to take care of babies, but it somehow fails at this easy plot conceit. It tries to teach the audience life lessons about responsibilities that come with growing up, yet at the same time, it teaches awful lessons.\r\nWhat makes it so unbearable:\r\n1. Pedophile side character that the show plays off as a joke. His name’s Yagi and he gets nosebleeds when going near the babies. He’s pretty gross and I wouldn’t be surprised ifI saw him in Hajimete no Gal. It’s good that the other characters call him out for being a weirdo but why does he exist?? I would have been fine if the show called him a weirdo and ended his presence on the show, but he’s cutesy comic relief. \\n\r\nHe’s in the opening too so he’ll most likely show up in later episodes. \\n\\n\r\n2. A shady hooded character is seen spying on the babies then is later revealed to be one of their fathers. Said father is an actor who played a kidnapper in his recent movie, therefore, his kid wasn’t afraid of him… A kidnapper. Let that sink in. The reason why the kid wasn’t afraid was that his mother showed him the movie and her reason for showing him something horrible like that she thought he looked cool in the role... AS A KIDNAPPER! It was like the show was teaching kids to not be afraid of kidnappers. This crosses the line between shockingly moronic writing into a dangerously stupid territory. The show is clearly targeted at kids so why doesn't it realize it's sending a message like this?\\n\\n\r\n3. One of the main characters classmates wacks his little brother. His baby brother. This wasn’t as big of an issue as the previous ones, but it was the icing on the bad life lesson cake that the show feeds to the audience. \\n\\n\r\nIf I had known Gakuen Babysitters had so many off-putting and downright creepy parts to it I wouldn’t have bothered to watch it. If you still aren’t off-put by the terrible morals the show teaches, then at least you’ll enjoy the cute babies and occasional but well-handled drama segments. But I’m tapping out here, How to Keep a Mummy is basically the same thing as this, but better. The writer of that show is actually aware of their audience and offers an adorable slice of life with much better vibes.\\n",
            "date": "2018-01-28T12:59:00+00:00",
            "helpful_count": 35,
            "mal_id": 269931,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=269931"
        },
        {
            "content": "I don't write reviews often (or at all) but thought I'd leave one for Gakuen Babysitters.  I spent 2 years in Japan working with kids aged 0-3 and this show brought back so many memories.  It really is quite spot-on with the behaviour and stereotypes of the Japanese toddlers.  Rules and regulations are far more relaxed in Japan compared to, say, North America, so this anime gave a fairly accurate portrayal of what life is like in a Japanese daycare.  Mind, the head teacher sleeping so much may be a slight exaggeration.. XD\r\nWhile a bit biased due to my own pastexperiences, this show does offer a refreshing take on the SoL genre.  Would recommend to anyone in childcare, lots of entertaining quirks and relative topics.",
            "date": "2018-03-25T17:20:00+00:00",
            "helpful_count": 31,
            "mal_id": 275071,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Canadian_Otaku",
                "username": "Canadian_Otaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=275071"
        },
        {
            "content": "This anime is so adorably fun to watch! The first and second episode made me excited to keep watching, but when I got to episode 3- I was sold! I was a bit nervous when I saw people reviewing negatively because of a potentially \"Pedophile-like\" character. I proceeded to watch with a friend and am STILL confused as to why people call this character a pedo.. He got a nosebleed around the small babies and became excited. That does not mean that he wanted to act out anything sexual.. It isn't just an anime thing when people get nosebleeds over getting excited. Some people canget them when their blood pressure sky rockets suddenly in real life too. This character was just excited to be around the babies and was just happy in general. So, I am still going to watch because the rest of the episode was simply adorable and so lovely. Episode 4 is even better than the last too! I adore this anime to bits :D",
            "date": "2018-01-28T14:12:00+00:00",
            "helpful_count": 17,
            "mal_id": 269936,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5500071.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Halivia",
                "username": "Halivia"
            },
            "url": "https://myanimelist.net/reviews.php?id=269936"
        },
        {
            "content": "A trend I find with children in anime is that they're always painted 'cute'.  Small human beings surrounded by glittery and sparkly effects who do cute things so that the audience falls in love with the tiny people characters.  It's not often that I see children portrayed as what they actually are, monsters, and it's even stranger to see a more realistic representation portrayed in a shoujo series of all things, a genre where virtually everything is depicted a lot more flowery than they actually are.\r\nStory:\r\nKashima Ryuuichi and his little brother Kotaro have met with the unfortunate fate of becoming orphans after their parents passingdue to a plane crash.  It is then that the boy is contacted by the headmistress of the high school that he will be attending, and told that from that day forward, he will live with her with room and board all taken care of, but in exchange, he must spend his spare time at the babysitters club, a daycare center at school dedicated to the teachers' children while their mothers work.\\n\\n\r\nThe show is pretty standard for what one can expect from a shoujo-style slice of life.  The story is very lax in nature with the only real high points being slight bumps that get resolved in the episode, thus leading to the show's mostly episodic nature with very few connecting points.  The episodes are based around Ryuuichi and his relationships with both the people he meets at school and the children in the daycare center, without really much weight to them since the show ends up going back to the status quo and resetting all but a few plot elements that don't get touched very much in the later episodes.\\n\\n\r\nBut there are some points that I found irritating, mainly the fact that the parents of our two main protagonists ARE DEAD.  It is the story of a four year old and a fifteen year old entering a stage in their life with their parents just recently deceased.  Yes, this is a happy go lucky slice of life show, but you cannot ignore this looming fact.  They do touch on this point a fair bit in the early episodes, but it felt like it was played off and largely ignored in sacrifice to showcase Ryuuichi playing with kids, which does not feel right considering how heavy of a topic this is.\\n\\n\r\nAnother more glaring problem is the romantic subplot.  There are two girls in this show that seem to have an interest for Ryuuichi, and everything about their interactions with him feels so unsatisfying, as these scenes feature either a tsundere who does the classic tsundere thing of being a bitch before regretting it later because that's apparently how people work, and a super shy girl who very clearly has a crush on the guy, but never gets the time of day because the show's not about her, but we still have to know she exists anyway.  The subplot eats up a surprising amount of the show's time and while none of the runtime is really lost since the episodic episodes featuring the children are wrapped up well enough to not warrant me yelling at Brain's Base for wasting time, I can't help but feel cheated because they set up the potential romance only to have it not go anywhere because audiences apparently like unresolved plot points/ideas.\\n\\n\r\nOverall, Gakuen Babysitters is pretty much a show that's what you get on the box.  It's a show about a guy babysitting kids with the occasional funny thing happening cause it's a slice of life comedy show that entertains.  It wraps itself neatly at the end to show how far the two brothers have come, as a sort of recap episode to show the fruits of the labor the entire runtime has built up to, but largely what you're going to be seeing here are \"School babysitters\".  Babysitters who babysit at school.\\n\\n\r\nOverview:\\n\r\n+/-  Pretty much what you'd expect with the title of the series\\n\r\n+  Has some heartwarming moments\\n\r\n-   Romance goes nowhere, so why even include it in the first place\\n\\n\r\nCharacters:\\n\\n\r\nRyuuichi is about as interesting as sandpaper.  He cares very much for his little brother (to be to an obsessive degree for various reasons), and is extremely passive, being far too nice to everyone and not getting upset in the slightest.  Honestly there's not much to say about this guy cause weirdly enough, he's not involved with the plot all that much despite being the protagonist and the story beyond the first few episodes doesn't do much to shed light on the reality of him now being an orphan despite a few choice moments.  Kotaro is sort of an off-branch of his character since the two in the show are basically inseparable, and Kotaro on his own doesn't really have any traits of his own either cause the kid is usually silent with this perpetual bored expression that makes me question whether or not he knows what's even going on in his life.\\n\\n\r\nThen there're the kids.  Who, if you know what kids really are like, will probably be reflective in your experience with them.  Simply put; they're loud, they're jerks, they do whatever the hell they want, and they can be cute.  Sometimes.  As the core of the show's existence, the six children featured in the show each take turns and sometimes altogether being the show's focus (some more than others), taking the protagonist and various members of the side cast along with them on their little adventures doing what children do.  The brat, the girl, the twins, Kotaro, and the baby; I have my own gripes with each of the kids, as their actual characters are something of personal preference, but I have to say they did a good job at showing their audience what snot-nosed brats children are actually like most of the time.  So I guess they did get the important thing right.\\n\\n\r\nThe rest of the cast involving recurring characters like Kamitami Hayato and Yoshihito Usaida, two characters who are commonly seen around Ryuuichi, the childrens' parents, and other members of the side cast all weirdly enough have more personality than our main protagonist in that they fill in the gaps to enrich the world surrounding Ryuuichi with people who're more experienced with the other kids in the series, being family members and other people who simply have been around the children longer to be able to handle the little headaches much easier.  The outliers to this rule are Inomata Maria and Ushimaru Yuki, both of whom are the girls that seem to catch Ryuuichi's fancy, but don't do anything about it cause even if you try, romance isn't wanted in this story.\\n\\n\r\nOverview:\\n\r\n+ Realistic depictions of toddler behavior\\n\r\n+ Amusing sidecast (for the most part)\\n\r\n-  MC's not very interesting\\n\\n\r\nArt:\\n\\n\r\nProduced by Brain's Base, Gakuen Babysitters focuses more on the light aesthetic with very few points of animation to take note of.  The show itself is very consistent with its art quality, vying for a simple style with pastel colors that emulate the show's normally cheery and bright nature cause the show isn't a slice of life shoujo for nothing.\\n\\n\r\nComedy is relegated primarily to very simple comedic faces that at times don't even feel like a real anime comedy cause nothing's exaggerated which I guess by extension makes it less intrusive on the situation as a whole.  Though I do question what kind of comedy can be derived from a family who disciplines their members with a sharp blow to the head.  I mean it's kinda funny, but it got kind of stale after the twentieth time they did it, which doesn't help when the Kamitami family has the most irritating child in the entire series as one of its members.\\n\\n\r\nOverview:\\n\r\n+  Consistent quality\\n\r\n+  Soothing and simple style\\n\\n\r\nSound:\\n\\n\r\nBoth Daisuke Ono's \"Endless Happy World\" and Hyorotto Danshi's \"Oshiete yo\", which is sung by the VAs of Ryuuichi and Hayato are both mellow songs that emulate the slice of life/happy go lucky tune that the show sings to featuring the day to day lives of looking after children who spend half their time drowning in their own imaginations playing.\\n\\n\r\nSuffice to say, they're not really the most memorable tracks, but they do their job in emulating the feeling the audience is supposed to get when watching this series cause everything about these songs is meant to create the feeling of children having fun more than anything else.  Personally though, I'm not much of a fan and I found them to be kind of generic and nothing really noteworthy.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nHonestly, I watched this show more for the novelty of the idea more so than any interest in the show itself.  I sat there looking at 'Gakuen Babysitters' and thought to myself what the actual hell they could do with a show as literally titled as this.  The show pretty much met my expectation on what I thought it was going to do, but kind of killed them at the same time cause the show's attempt at a romantic subplot was one of those things that shouldn't have been there, but surprise surprise, was there because why not.  I was actively upset at Yuki's lack of involvement in the plot because she kept showing up in the series with nothing of value to add with every appearance.  Which is sad because they try to mix her into everything by the end of the series and every fiber of my being was asking \"Why didn't you do this earlier?\"\\n\\n\r\nBut I think the one part of the show that irked me the most was Taka, Hayato's little brother and quite possibly the worst character in this entire show.  Simply put, he's a brat.  An annoying kid that spends the entire show trying to get his way and shove his way into everything without any acknowledgment for anyone else's thoughts or feelings.  I don't like him because not only is he an annoying character, but he reminds me of a member of my own family who is the exact same way, and that's not a fun comparison to think about when you're watching an episode of anime on Sunday night to relax dreading the coming week.\\n\\n\r\nBut all in all, Gakuen Babysitters is a show that I felt was...alright, I guess.  I don't think it helps that I'm not much of a shoujo fan, and the shoujo-style of storytelling isn't my favorite, so I think my enjoyment of the show would've been skewed from the beginning.  If you're a fan of the shoujo genre and you got some time to kill, this would be a fun show to watch if you're trying to fill in time.  Just be prepared to turn down your volume at times cause like a real group of children, the kids in this show can get pretty loud, and Taka's voice is like cheese graters, so here's your early warning.",
            "date": "2018-03-25T09:38:00+00:00",
            "helpful_count": 15,
            "mal_id": 275013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=275013"
        },
        {
            "content": "The story is about two young...well one High School Student Ryuuichi and his VERY young brother Kotaro. These two brothers end up losing their parents in a plane crash and are sent to live with the Chairwoman of a high school. The reason being is that her Son and Daughter in Law were also in said plane crash and felt like it was necessary to take these two into her home. \r\nOf course the catch is for Ryuuichi to live in the house he must become part of the \"Babysitters Club\" in his High School. So basically the babysitters club is a club where theteachers leave their young kids who are not able to attend Pre or Elementary school yet. It's actually a pretty cool thing because it shows a development of Ryuuichi being accustomed to high school life, and Kotaro breaking out of his shyness being surrounded by kids his age and not being with his brother constantly.\\n\\n\r\nAlong the way we get some awesome characters introduced in the show. Of course we get the kids in the Club, but we also get to meet the person in charge of the club when Ryuuichi is in class, the kids parents and Ryuuichi's classmates as well. The development and story over time in this series was really well done. At time you find yourself holding back tears, and other times you find yourself rooting for certain characters to come over there fear of doing something, for example just playing with the children.\\n\\n\r\nThe art and animation were not anything special. Not the worst thing in this word since there's no action or over the top scenes. Considering this was a more relaxing anime the animation did not have to be top tier to enjoy it.\\n\\n\r\nThe sound was pretty average as well. I enjoyed the ending more then the opening, but that's not saying much since overall the ending was \"meh\"\\n\\n\r\nThe characters were super enjoyable. From the teachers down to the Ryuuichi's classmates this was one awesome cast of characters. Even the kids were super enjoyable. When it came to the High school kids you could really relate to most of them especially if you have young siblings, or even issues when it comes to handling small children. I was constantly comparing myself to Inomata. While she enjoyed being with the children it was hard for her to control them or even understand them without making them cry or be hurt in the end. However over time she was able to better her self while spending more time with Ryuuichi and the kids.\\n\\n\r\nI found myself waiting patiently every Sunday afternoon so I could watch this anime. That is how much I enjoyed it. \\n\\n\r\nOverall this was a unexpectedly great anime. Even with the score it has now i feel like it super underrated and definitely overlooked. I think the title of the anime plays a huge role in that. I would highly recommend this anime to anyone who would like a break from anything serious or over the top and just enjoy a very conditional slice of life anime.",
            "date": "2018-03-25T09:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 275008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275008"
        },
        {
            "content": "I started this anime out LOVING it, I really enjoy cute animes and this one seemed really good. The premise starts out a little sad but it starts picking up and becoming something cute and enjoyable. \r\nThen it hits episode 3 and we get a new character in the mix.\r\nHe's explained as someone who's usually seen glaring at children, so I was wondering if it was another instance of someone disliking children, which is fine! I don't like children myself so I get it. However, we find out later, that's not the case. \r\nHe's a pedophile, played for a joke. He stalks children because they'resoft and cute and he really likes them because \"he's a degenerate\". And his pedophilia is played for a joke. The whole time. \\n\\n\r\nI didn't want to support an anime like that, so i dropped it immediately.",
            "date": "2018-03-06T16:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 273224,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7036056.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jinxthewicked",
                "username": "jinxthewicked"
            },
            "url": "https://myanimelist.net/reviews.php?id=273224"
        },
        {
            "content": "KAWAIIIIIII!!\r\nThis is one cute anime I'm telling Y'all...\r\nI finished the anime in one sitting it's very good, it's fun, it's emotional I'll explain each point and why I gave it an 8.\r\nFirst of all, the story, a Definite 8 out of 10 some plot holes, unfortunately, some unexplained stuff too but overall it's amazing it shows kindness and how a highschooler could take care of his small brother which is really emotional in a way.\r\nThe Art, Outstanding Incredible, Unbelievable.\r\nI was amazed how well it's drawn xD, I miss this drawing style honestly it's rare yet Beautiful and pleasing to the eye, I really like howeach character is different even in simple matters like eyes, body, shape, and hair for example,the main character's eyes are huge and bright yet nobody in the whole show got the same eyes, same when it comes to other characters it's magnificent.\\n\\n\r\nThe Sound, Still undescribable it's outstanding great voice acting. A great sound quality it's just incredible honestly.\\n\\n\r\nThe characters, one of the most important factors I wasn't able to give it a 10, unfortunately, some characters aren't well developed I can't really include any spoilers but it's still good I can't deny it that's why I gave it an 8 No Less, No More. It is the perfect rate in my opinion.\\n\\n\r\nI really enjoyed the anime really fun to watch and love, for the enjoyment it's a definite 9 <3.\\n\\n\r\nOverall it's a great anime you should watch it and feel the love <3.\\n\r\nPs: I don't know if it matters but The opening is Soooooo good <3<3<3.",
            "date": "2018-04-20T04:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 278545,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6520076.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yorrito",
                "username": "Yorrito"
            },
            "url": "https://myanimelist.net/reviews.php?id=278545"
        },
        {
            "content": "After watching countless shows about ecchi and shounen I thought why not watch this show about babies. Seeing so many babies run around made me feel good, and when I mean good I mean GOOD. In the sense that they were cute and what not. Or as you people prefer to say: Kawaii. Anyway, let me move on into detail about why the rating I have given it is a below average 3.\r\n    The story is about high-school kid Ryuuchi and his brother Kotarou who get abandoned, but get adopted by some rich old hag with a crankyattitude who just puts up the 'ol \"I'm a big old mean lady and I hate everyone\" act and in truth is a nice 'ol tsundere archetype lady. The reason for their abandonment is so cliche and forced it feels completely unrealistic and lacking in emotional impact. Ryuuchi handles it well, but maybe it's because he doesn't give a crap about them or because it is irrelevant to the main plot about watching babies. Anyway, 'ol lady or chairwoman lady runs a school with a daycare club and has Ryuuchi run it as a babysitter during his off time from classes, which is then how we get introduced to the cute babies. \\n\\n\r\n    Most of the characters are bland archetypes we have seen already. Three examples being Hayato, the chairwoman, and butler guy. Hayato and Youko a.k.a chairowoman chick each have a competition with the audience to prove who is the most tsundere out of the anime. I'd have to give it to Hayato since he seems like the tougher egg to crack. Butler guy is just your stereotypical anime butler guy - quite and useful. Although who would want a useless butler anyway. Moving on, there's a girl who craves Ryuuchi's dong as soon as he appears in class and some other tsundere girl who also craves it, but not as much.  Ryuuchi is alright, but his clinginess to his little brother Kotarou and how he makes Kotarou cling to him as well is quite annoying. Usaida or the first babysitter in the club is chill and probably the most likable of the cast, though his presence usually just consists of him sleeping.\\n\\n\r\nOn to the baby tier list: \\n\r\nS-tier : Kotarou\\n\r\nA-tier : Kirin\\n\r\nB-tier : Takuma and his crying brother (forgot his name) \\n\r\nC-tier : weird-eyed toddler\\n\r\nShit tier : Taka\\n\\n\r\nThe music is there... I think. If it was memorable or moving in some way I would have mentioned it by now.\\n\r\nThe anime felt more like a drag as I continued to watch it, but I still got some enjoyment from it. Only watch this if you like typical cute anime crap.\\n\\n\r\nStory: 1\\n\r\nArt: 5 \\n\r\nSound: 3\\n\r\nCharacter: 3 \\n\r\nEnjoyment: 4\\n\r\nOverall: 3",
            "date": "2018-03-26T12:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 275198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2442049.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/leosapathy",
                "username": "leosapathy"
            },
            "url": "https://myanimelist.net/reviews.php?id=275198"
        },
        {
            "content": "This anime is too cute. I have read/been reading the manga, and it's quite similar, but of course there are some things that are not accounted for or rushed. \r\nIt's basically a student in a babysitting club with his younger brother, a sweet and simple anime that is just too adorable. \r\nIt is sometimes annoying because in the manga, you don't hear the children actually crying, but what can you do? \r\nThe first few episodes were a real tearjerker (for me), which was quite surprising.\r\nSome say there's a pedophile character, but honestly this anime is really innocent and there is no \"hidden\" meanings. It isjust a response to seeing something adorable. It is just a show on kids being cute and doing cute things. \\n\\n\r\nStory: 7, there's no real story, just a slice of life\\n\r\nArt: 9, very cute, I love her art style and have read many other manga that she has drawn.\\n\r\nSound: 6, I dont hate the sound track, but it isnt great, perse\\n\r\nCharacter: 8, there are few, but they are unique\\n\r\nEnjoyment: 8, a good show to relax \\n\r\nOverall: 8. It is a cute show about children, nothing more, nothing less\\n\\n",
            "date": "2018-01-28T15:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 269944,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4508379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zucchinichop",
                "username": "zucchinichop"
            },
            "url": "https://myanimelist.net/reviews.php?id=269944"
        },
        {
            "content": "Gakuen Babysitters seemed like a decently good anime for me at the beginning. But as Gakuen Babysitters played out with more story clichés, and started making some parts unbearable, I stopped liking this anime that much.\r\nStory: (6/10)\r\nIn this anime, all the episodes are disjointed and have no connection whatsoever with each other. The storyline in every episode is fine, I just felt that using clichés, such as the 'beach' cliché degraded my experience with this anime. However, to make up for it, it has some well-thought out drama scenes. \r\nArt: (7/10)\r\nThe art was decent and enough to discern most characters from each other. However, Ibelieve they could have still worked on making some characters not as noticeably similar in design.\\n\\n\r\nSound: (5/10)\\n\r\nThe op and ed were just normal anime songs. However, none of the soundtracks themselves pop out and really give a special feel to the anime itself imo.\\n\\n\r\nCharacter: (4/10)\\n\r\nAt first I found the babies outright extremely cute. However, over time, the anime makers used the babysitters as a cheap way to cover up so many moments that could have been used to develop other parts of the story, becoming very annoying. The characters also are mildly disturbing, such as a father who dresses like a kidnapper, and a high school student who bleeds from excitement when seeing one of the babies.\\n\\n\r\nOverall: (6/10)\\n\r\nOverall a decent anime that may or may not be worth your time. If you like babysitters and babies a lot, go for it. Otherwise, you should look for other slice of life animes instead",
            "date": "2018-03-27T13:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 275360,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6310268.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dragontail",
                "username": "Dragontail"
            },
            "url": "https://myanimelist.net/reviews.php?id=275360"
        },
        {
            "content": "I gonna give it to you straight: nothing about this anime is special or surprising in the least. \"Then why'd you give it a 9?\" you ask. This anime has this whimsical charisma of its own: it's ineffable. There's just some unique appeal to it that can't be explained, pinpointed, or replicated. Believe me, if I knew what it was, I would try to find as much of this as I can, because to put it lightly, I'm ADDICTED to this now. \r\nThe story was simple. A boy and his baby brother are adopted by a rich childless woman after they're orphaned. This boy, ourmain character, takes care of babies for his teachers. It sounds dreary, but it's not boring in the least. I was a little worried about watching it because of the boring-sounding summary, but after seeing too many gifs on tumblr, I decided to take a shot, and I've never been happier with an anime choice before. The story was always interesting, engaging, and heartfelt. Nothing ever felt rushed, overdone, or in-genuine. \\n\\n\r\nThe art was this beautiful pastel effect that's calming and beautiful. It reminds me of Wonderland and Oz and Narnia somehow: it reminds one of the light, fleeting beauty of childhood and fittingly, nursery walls. \\n\\n\r\nThe sound was pretty well done. The voice actors did their job decently. The opening and closing themes weren't anything special, but I never skipped either because of the adorable babies that made me feel guilty if I ever wanted to skip it. \\n\\n\r\nThe characters, oh dear. Every single one (even the babies) has a distinct, fresh character that doesn't just feed off of a stereotype. Are they really all that deep? Perhaps not. After all, the show is just 12 episodes. But everything they DO do is meaningful and makes my heart melt.\\n\\n\r\nI enjoyed this way too much. Before I go into my recommendations, a few important notes: \\n\\n\r\n1. some people dropped this anime because of a 'pedophile'. I will warn you right now that this character DOES seem kinda like a pedophile to me, but it's also revealed that he suffered from similar 'nosebleeds' around babies when HE was a baby, so I'm inclined to believe it has less to do with pedophilia and more to do with just cuteness in general. Either way, I couldn't bring myself to take off too many points for that since he only appears once or twice. I could just pretend he never showed up. Also keep in mind that Japanese age of consent is 13 (or was 13 as far as I know, correct me if I'm wrong) so the public perception of him might be different for them. \\n\\n\r\n2. be prepared for tears. I cried twice per episode, once per ministory minumum. I cried multiple times sometimes. I'm an emotional person to begin with, but ultimate adorableness combined with sibling-love and orphans and friendship and babies is like all my weaknesses combined. If you're emotional, watch out. If you're not, still keep your guard up-- this is more feelzy than it looks. \\n\\n\r\n3. while some classify this as a shoujo, don't expect any shipping. There are some prospective ships with a possible boyxboy, boyxgirl (two different girls actually), and girlxgirl. There's that flexibility, but these ships are barely even hinted at. If you need a ship to watch a show, you probably have to be okay with it being just in your head. \\n\\n\r\nWith that, I'll finish this off. \\n\\n\r\nI would recommend this if you: like babies, like cute things, like sibling relationships, have a weakness for cute guys taking care of babies, like things that make you emotional, like crying (lol me), love family feelz, like feelz in general, like wholesome purity \\n\\n\r\nI would NOT recommend this if you: want something dark, want lots of plot or character development, don't like children, like conflict and sadness, aren't into relationships etc.\\n\\n\r\nHave a great day everyone!",
            "date": "2018-03-26T19:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 275247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=275247"
        },
        {
            "content": "So great so far! This is a very adorable and wholesome anime. A cute brother and brother relationship, they truly care for each other and always try to have fun even after losing their parents.It shows how much fun is to be around children; personally I dislike children but now I wanted to take care of one after watching this. It has a lot of life-lessons such as everyone is not alone, you can't know someone's feelings if they don't speak up etc. The opening is cute and calming. I can't help but laugh and smile so much in a lot of certain scenes andcry in some parts. The characters are okay; cute boys taking care of cute children; how could you not love that?, a couple of somehow tsundere people who acts that they don't care but actually do. \\n\\n\r\n I saw people doing negative reviews due to this certain character who nosebleeds around children implying a \"sexual desire\" towards them. I thought he was weird, disgusting and an unnecessary background character but I don't think this character can do any harm because; he did said himself it was the best for him not to join and there is someone watching over him. Well, I'm just ignoring he exists.\\n\\n\r\nThough just one small negativity doesn't mean this anime is automatically bad; I'm sure I don't need to explain that I mean everyone knows that right? This are all just my opinions and thoughts. If you like cute people doing cute little things then I suggest you to watch this.<3\\n\r\nAnyways! Definitely looking forward for more episodes, cuteness, wholesome content and hilarious content. Love it so far; I might add more info in this review soon! <3\\n\\n\r\nStory: 8\\n\r\nArt: 9\\n\r\nSound: 8\\n\r\nCharacter: 8\\n\r\nEnjoyment: 9\\n\\n",
            "date": "2018-01-29T06:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 270001,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6606303.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yvolenne",
                "username": "Yvolenne"
            },
            "url": "https://myanimelist.net/reviews.php?id=270001"
        },
        {
            "content": "MINOR SPOILER WARNING - contains information from the first few episodes\r\nGakuen Babysitters is an excellent anime to watch. The anime came out during a time when I was really getting back into anime, and was like a second gateway anime. It draws you in with its simple premise and story, and sticks to it throughout the entire show. \r\nThe story of Gakuen Babysitters is very simple. Our main characters, Ryuichi and Kotarou, currently don't have a home due to their parents dying in a plane crash. The Academy Chairwoman decides to give the boys a home, and gives Ryuichi free education should he help atthe school's daycare centre after school. However simple the premise is, it is able to constantly deliver on it, and shows us a great time that we can appreciate at home. \\n\r\nThere are many shows that have filler episodes to stretch an anime out, but this is a show that develops each of your characters at an excellent pace and in great ways. In every single episode, the simple story is progressed through, with problems being presented, and then solved in a timely fashion. \\n\\n\r\nHowever simple the art style and music are, they help to create a simple and ecstatically pleasing anime, showing off how not everything needs to be flashy or sparking to be attractive. The anime keeps everything nice and clean, with Brain's Base animating, keeping everything pleasing to look at. \\n\\n\r\nThe show is an easy comedy and slice of life, and with a simple plot and excellent characters (even though they are 3 year olds!). It is something you can come home to and just sit and enjoy. Something pleasing to watch as you relax. \\n\\n\r\nGakuen Babysitters is an excellent show, and although I won't speak for every single person, it is a really good watch. Set aside an afternoon, sit down with friends (or by yourself, I'm not judging), and enjoy.",
            "date": "2019-04-17T04:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 306505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7986214.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SomeRandomWeebs",
                "username": "SomeRandomWeebs"
            },
            "url": "https://myanimelist.net/reviews.php?id=306505"
        },
        {
            "content": "I'm not used to writing reviews, but I will anyway because I can.\r\nI personally gave the story a 6. It's okay I guess. The episodes don't really connect much in story, but it's an anime about babysitting cute kids at school. I'd be disappointed if it did, really. I actually like anime like this. they're the best to watch when you're doing homework or sick and bored or something.\r\nI think the art is okay. I gave it a 7 because there weren't any times where i saw it and went 'oh, that's ugly', so.. yeah.\r\nI gave the sound a 7 because I can't remember muchbut the OP and ED were lowkey bangers.\\n\\n\r\nI gave the characters a 7 because I liked 'em. There were two characters where i was like 'haha no' and they're both eh.... not... ckjcjfjkvkjbi. The first one is named Yagi or something. He isn't really a pedophile but there's one joke in the show that insinuates he is one. Seriously, anime really ruined nose bleeds. IF SOMEONE HAS A NOSE BLEED IT DOES NOT MEAN THEY'RE TURNED ON. I don't even know why they chose to make him have nose bleeds because he quite obviously has no sexual intentions with the children. If he was a girl, most people wouldn't think this way because double standards I guess. All he wants to do is buy the children presents and squish their cheeks and play with them like LITERALLY ALL OF US DO! Personally, I just found his pretty boy personality annoying. I don't think he's a pedo because he hasn't done anything to make me think that. I have an anemic friend who gets nosebleeds all the time. It's just an anime BS thing that nobody but Americans and other foreigners will get offended over.\\n\\n\r\nIf you're going to be creeped out by anyone, you should really be creeped out by Kirin's father, saying shit like \"If I were 30 years younger I'd ask for your hand (in marriage)\" to a 1-year-old baby. and the same thing to the main character when he thought he was a girl. Ryuuichi is like, what, 15? And nobody's saying anything about this but they're saying something about a guy who just loves children. I love children too! They're adorable and it's a natural human instinct to want to protect them! What ISN'T a natural instinct is to say \"Where are the cute high school babysitter girls?\" to your own goddamn wife.\\n\\n\r\nSome people also hate Kamitani, the older brother of one of the kids, because he hits his little brother whenever he's a brat. Clearly, these people didn't grow up with younger siblings; because sometimes i want to punt my little brother over a fence, but I don't because he's my brother and I love him so I hit him instead. Not hard enough to actually hurt him, but he cries anyway because he's an overdramatic brat who's spoiled to the bones. Again, get over yourselves.\\n\\n\r\nAnother character I saw getting hated on for no reason is the blonde twins' dad. Guys, he's famous. If he'd went out without a disguise he'd be chased down for autographs and pictures BECAUSE HE'S FAMOUS. All he wants to do is see his kids, but they're scared of him because of the MOTHER's stupid decision to show them a movie where he plays a kidnapper. What awful parenting SHE has. HER. It's not his fault for HER actions, because that's how he gets money. Do you hate every actor that plays a kidnapper role or do you have any fucking common sense? They knew it was their father because otherwise they wouldn't of fucking introduced him as one. OF COURSE they didn't want him to go because he's their father. The whole fucking reason she showed them his movies is because they wanted to see him. He HATES being away from them and they HATE being away from him. Use your head for a whole 10 seconds maybe and you'd be able to see that, but i digress.\\n\\n\r\nI gave enjoyment a 10 because.. there's something about cute babies waddling around and doing cute baby things that just make me UwU in satisfaction. I watched this when I was sick and had nothing to do, so maybe that's some of it.\\n\\n\r\nOverall it's a 7. It wasn't the best and I probably won't rewatch it religiously, but Kotaro is my best boy and I'll be damned if I never get to see his cute little face again. I can remember the first time I held my baby brother. I was like 10 years old and it was so weird because it was the first time i held a baby but i was so good at it. The egg/chick episode really got to me bc I was like 'same' every 5 seconds.\\n\\n\r\nThis was a mess but so am I.",
            "date": "2019-04-03T09:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 305332,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7944621.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lsod-felix",
                "username": "lsod-felix"
            },
            "url": "https://myanimelist.net/reviews.php?id=305332"
        },
        {
            "content": "this awoke every maternal instinct in my cold, dead heart. at this point if i see even one (1) picture of kotarou i visibly melt this is the cutest show i've ever seen. \r\neverything about it is just tooth-rotting fluff, the children are endearing (i would d*e for kazuma he opens his mouth and i just go heart eyes), the side characters are all great, and the main brothers are just so sweet ;A; feel good story of the year 10/10 goat\r\n(just to note: there is a character [yagi] they imply is something terrible which he is not, in the manga his story is exploredmore and he definitely isn't what the show pretends he is, and i hope if (when? it better be wheN) there's another season they fix that storyline.)\\n\\n\r\nif you want a show that is just mindless fun that tugs on your heartstrings in a loving, cuddly type of way this is a great show to watch.",
            "date": "2018-08-29T16:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 287724,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5749292.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/vexahlia",
                "username": "vexahlia"
            },
            "url": "https://myanimelist.net/reviews.php?id=287724"
        },
        {
            "content": "TL;DR – Cute and fun school slice of life with a warm, mellow and pleasant atmosphere.\r\nBasic breakdown below ⬎\r\n== Impressions / Presentation: 6.5 ==\r\nThe art style can simply be described as \"shoujo aesthetics\", and it's most notable in its colour scheme and character designs. However, the designs are subdued enough so it doesn’t feel like the show is unnecessarily rubbing hot guys in my face. Rather, the aesthetics is where that warm, mellow and pleasant atmosphere comes from, and it does a good job getting that feeling across.\r\n== Story: 6 ==\r\nThere’s not much in the way of an overarching plot, but there is enough togive the show a sense of direction, and that is more than sufficient.\\n\\n\r\nStories within the (more or less) self-contained episodes are actually pretty nice. They're delivered in a simple way, but this actually makes them more effective at delivering the emotions and messages they want to communicate.\\n\\n\\n\\n\r\n== Characters: 6 ==\\n\\n\r\nThe series plays characters safe with noticeable tropes and simple personalities. But they're otherwise likeable and are generally fun to watch.\\n\\n\\n\\n\r\n== Enjoyment: 6 ==\\n\\n\r\nI like the anime, but the charm did wear off on me as it progressed. My commitment to the series basically came down to watching specific characters I had taken a liking to.\\n\\n\r\nThe show is nice, but there's otherwise not much else to say about it.",
            "date": "2018-04-03T23:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 276812,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879943.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/afwcal",
                "username": "afwcal"
            },
            "url": "https://myanimelist.net/reviews.php?id=276812"
        },
        {
            "content": "Gakuen Babysitters \r\nAKA: I think I just felt a little tug on my heartstrings\r\nThis is one of those ‘healing’ anime that helps you see the goodness in the world. It’s pure, it’s uplifting, it’s adorable. It’s not what you would call a masterpiece – it’s similar to watching a baby giraffe try to walk for the first time. Its clumsiness is part of what makes it so endearing.\r\nEven people who don’t tend to like little kids much – me, for instance – will find that this show appeals on a level you wouldn’t think possible. It’s hard to describe just how many times this seriesmade me smile, go ‘awww’ or dance around in sheer unrestrained joy at their adorableness. (In my head of course, I didn’t actually go dancing round.)\\n\r\nBut there’s more to the anime than just kiddy antics. It’s the reason Ryuji puts up with the kids, and the reason they love him.\\n\\n\r\nHe sees them as people. He doesn’t like cleaning up messes, changing diapers, or trying to stop a tantrum any more than the average person. He doesn’t enjoy not being able to spend as much time with his friends as he would otherwise, and he definitely doesn’t enjoy having his stuff ruined. But he loves the kids. He sees each tot as a human being with his/her own distinct personality, struggles, and likes and dislikes. They’re almost like family to him (Kotaro is actually family of course). Just being with them, seeing how they warm to him and come to trust and love him in return is one of the most purely satisfying parts of this show, and the reason I loved it so much. Ryuji is exactly the type of person that shines best when taking care of others, because of his gentle, patient and selfless nature. It’s also the reason he’s so good at it. His only fault is that he can be a bit too soft on the kids, but Kamitani and the others are there to balance that out.\\n\\n\r\nUsaida, on the other hand, has got to be one of the most irresponsible babysitters out there. Seriously, leaving a kid that small outside by themselves, what was he thinking? Sure, he didn’t realise they were gone, but that only makes it worse. It’s not like it was a one-off either. I know it’s meant to be a gag primarily used to highlight Ryuji’s heroism, but he should have been made out as a bit more responsible all the same.\\n\\n\r\nHe’s not the only character who’s a bit unrealistic. There’s the crybaby father, the child-loving deviant (as he’s so called in the anime), the weary older brother and the tsundere who thinks the kids hate her. Whilst none of them were integral to the story (except maybe Inomata, who got some decent development), they were rather funny to watch at times. I suppose they did provide a bit of a distraction from the kids every now and again by injecting a bit of drama, which was refreshing. The love triangle scenario was unnecessary, but that didn’t mean it was bad in this case. I did think it was rather sweet, and the innocent way it was shown was consistent with the innocence of the anime on the whole.\\n\\n\r\nThe real gem, though, was watching Ryuji and Kotaro’s interactions. It’s incredibly rare to see the loss of parents in anime handled so maturely, normally it’s just a ‘let’s ignore the fact that the parents are dead until it’s time for a tragic backstory arc!’. Here it was realistically done. Ryuji loved his parents very much, and truly misses them. He treasures Kotaro in their absence, and Kotaro in return thinks Ryuji exemplifies everything good in the world. Parental death in this case brought Ryuji and Kotaro all the closer as the only surviving members of the family, and the way they cherish each other is heart-wrenching. Watching Ryu try and raise his brother in place of their parents, and watching Kotaro try and help Ryu as much as his tiny little body is able, was beautiful. It’s love in its purest form, and I’m glad I got to see it.\\n\\n\r\nThe other members of their new family, the Chairwoman and butler Saikawa, are also great characters. The Chairwoman is a good person, even though you wouldn’t guess it at first glance. She looks like a crotchety old lady, doesn’t mince words and makes Ryuji and Kotaro earn their keep, but watch her long enough and you’ll see a little smile creep over her face as she watches them bring life back into the too empty house. She has the ability of giving over lessons that seem harsh, until you reflect on what she said and realise how much care and wisdom was behind it. Saikawa, too, has a lot more to him than meets the eye. He appears enigmatic, but is hiding a wicked sense of humour and a heart of gold. He helps them a lot more than they even realise. Both play a big part in Ryuji and Kotaro’s respective developments.\\n\\n\r\nWhat can I say about the rest of the aspects, like the sound and art? The sound is very tender and warms your heart. The voice actors, especially those that play the kids, are brilliant and really make you believe actual tiny humans are speaking. The art is mellow and has a lot of pastel tones and soft designs. The kids are ridiculously chibi, but that’s done on purpose to make them seem cuter. It works, too.\\n\\n\r\nAltogether I’m unreasonably glad I watched this. I’ll probably go to bed with a fuller heart for the next week than I have done in a while. And I think I might even like little kids more on the whole after this. If you want a pure, adorable and heart-warming slice of life about a day-care, this is the one for you. XD\\n",
            "date": "2018-03-28T18:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 275514,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=275514"
        },
        {
            "content": "Anime: School Babysitters\r\nGenre: Slice of Life, Harem (?)\r\nAge Rating: Good for All\r\nStudio: Brain's Base\r\nMusic: Ruka Kawada\r\nAuthor: Hari Tokeino\r\nDub/Sub: Subs\r\nEcchi Level: Non-Existant (There's one boob gag, but nothing even close to shows.)\r\nOoOoO\r\nFound this while browsing CR's show list and decided to check it out. And my Dende am I glad I did. This is very possibly the most adorable anime I've ever watched. Maybe I'm just biased because I adore kids, but this anime takes the cake in the category of cute. It's almost like the modern (and Japanese) adaptation of Rugrats.\r\nI might as well get the issues I had with the series out of theway first so I can gush later. First, I found it odd that all the episodes were untitled. That's like, a staple in anime almost. So seeing it happen here was very puzzling, but didn't detract anything from the show itself. Secondly, I groaned in agony when one of the first jokes in the series was a fart joke. HOWEVER, I can let that easily slide because it was the kids of toddler age making it, and they will always get a pass. And last of all, there was almost zero effort or time given to the young women crushing on Ryūichi. This is almost sinful, but given that it's only season 1, and it was aired only recently, which gives me hope that they will change this horrible lack of romantic emphasis.\\n\\n\r\nNow, onto the good stuff. While the animation wasn't anything to write home about, the kids in this show were drawn so adorably that I got a tooth ache every time they were on screen. Each one of them has a varied and unique personality that shines like a golden light after previous anime that I've seen. It amazes me just how simple this author created such distinct characters in kid form when most mangaka can only seem to write bland, hollow, or stereotypical characters. Seriously, I love them all. And the music, while it wasn't anything special for anime, it definitely fit the charming atmosphere of the settings.\\n\\n\r\nConsidering it's a slice of life, there isn't much story to judge. Ryūichi goes to school, then when he gets out of class he goes to watch the kids in the daycare while being oblivious to the non-advances of two (technically three) of his classmates. I suppose this allows the author to focus more on characters rather than splitting time between characters and plot. Whatever the case, it works well.\\n\\n\r\nBuuuut, at the same time, there is a lack of character development in two characters present throughout the anime. And that would be the ones crushing on Ryūichi, as I mentioned previously. I really wanted to see their characters develop more, but what I got was sorely lacking. I definitely hope they fix this is season 2, and I definitely hope there is a season 2. I do have to call out the author on making Ryūichi just as oblivious to love as every anime character in existence. Shit gets old man...\\n\\n\r\nThat being said, there was something I wanted to put this anime on a pedestal for. Two things actually. One was for actually portraying a varying amount of fathers in this series, which is stupidly lacking in anime in general. In fact, Kirin-chan's father was probably one of my favorite characters of all. Second, was actually portraying a poor family in everyday life, and the struggle they have to go through. Even if it was fairly short and limited to one episode, it was still cool of the author to do.\\n\\n\r\nHonestly...and again, this may just be my bias, but my favorite part of the entire series was the kids. I adored each one of them, especially Kotarō. Kid was the highlight of the show, and I think if you give this anime a watch, you'll agree. The entire interaction between teenagers and toddlers was amazing, and I really can't wait to see more.\\n\\n\r\nOoOoO\\n\\n\r\nTLDR: This anime was sweet enough to put an elephant into a diabetic coma. It doesn't have action, mystery, plot twists, or romance thus far. But even without all that, I enjoyed every episode of the short 12 part series. If you enjoy cute things like I do (if you tell anyone, just know that I have a certain set of skills to find you), then you'll love this.\\n\\n\r\nOoOoO\\n\\n\r\nSPOILER TALK:\\n\\n\r\nBest Girl: Midori Sawatari. I'd have liked to have put Maria Inomata and Yuki Ushimaru both in this spot, but as I mentioned above, there wasn't nearly enough time in the anime devoted to them for me to feasibly give them this role. Meanwhile, little Midori-chan stole the show anytime to camera focused on her. She was the cutest of all the kids, and I'm proud to say that she is best girl.\\n\\n\r\nReally, the only character in the show that I wasn't a fan of was Tomoya Yagi. He could have easily been my most identifiable character in the show due to his love of adorable children. However, the fact that he gets a nosebleed from being around them is...concerning to say the least. He could have just been someone who gushed too much over cute kids, but for some reason the author had to take that extra step to make him look perverted, and I don't really like that.\\n\\n\r\nLast thing I'm saying, Shizuka Kamitani is the hottest teacher, hottest mom, hottest everything in the entire show. She didn't get best girl because she is best woman. Holy Dende did I love every scene she was in.",
            "date": "2018-03-27T15:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 275368,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7096706.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/RiotDragonX",
                "username": "RiotDragonX"
            },
            "url": "https://myanimelist.net/reviews.php?id=275368"
        }
    ],
    [
        {
            "content": "We’ve all been through a phrase where we were once a kid and behaved exactly as one. It’s human nature and God gave us a life to be part of society. What does that mean for a show like Gakuen Babysitters? The real question here if you ever felt experienced the feel of responsibility. No, I’m not talking about doing the chores and helping around the house. I’m talking about taking care of someone else in your life, perhaps a stranger or someone much younger than you are. Welcome to the world of Gakuen Babysitters.\r\nI should say right off the bat that the show isexactly what it looks like. Translated as “School Babysitters”, the series is about taking responsibility and being able to take care of kids. I’ve never took the task of caretaking before so watching this show felt like a refreshing experience to me. As a reader of the manga, this anime does what it has to do get its message across and that’s to deliver an experience about taking responsibility. \\n\\n\r\nThe first few episodes lets the audience know about the situation of the protagonists, Ryuichi and Kotarou. Their parents died and with no place to be called home. Morinomiya Academy’s chairwoman decides to give Ryuichi a home along with free schooling in exchange for taking on the role of a caretaker. Now I have to admit, such a premise sounds like a potential moody story for tearjerking moments. However, the show really isn’t but instead formulated into a heartwarming lighthearted story. Ryuichi is really someone that’s kind hearted and has a bottom to earth type of personality. The show chronicles his life as a babysitter as he learns the ins and outs. While I can’t say there’s anything exceptional about him, it’s shown that Ryuichi is an incredibly helpful individual and puts others before himself. You’d think that after losing their parents, he would venture down a path of depression. No. Here, this guy makes a huge comeback after life knocks him down and it’s inspirational. Sometimes though, I feel like his personality is too friendly and can get him into unintentional trouble. Similarly, his brother sees the joy of life. While Koutarou is nowhere near as mature, he’s definitely a kid who is growing up in the right way.\\n\\n\r\nAs I’m watching more and more of Gakuen Babysitters, I realized that the show really tried to make us experience something. The realism of being responsible is part of growing up and this show really feels like one to capitalize that. Besides just the Kashima brothers, we also meet other caretakers at the school. Most of their circumstances are in a better position and they have more experience than Ryuichi. Despite that, they get along fairly well with him because of his gentle personality. On the other hand, Ryuichi does meet someone at school with an underwhelming impression of him. Her name is Maria Inomata and it won’t take for viewers to quickly realize her blunt personality. Compared to others, Inomata is someone that is hard to get along with. She is extremely serious and dedicated to studying (as she claims as one of the most important things in life). However, she also gets involved with the kids at the caretaker after unusual circumstances and shows a much more caring side. The easy picture to look at is Ryuichi’s influence on her. She begins to realize that life is more than just about studying but also being responsible. Watching her development is one of the dynamics of this show as it shows how people can change. Similarly, Ryuichi learns a lot from his daycare duties and if I were his parent, I’d be damn proud of him.\\n\\n\r\nFeaturing a cast of younger characters, Gakuen Babysitters does its best to create an atmosphere of innocence and youth. The kids in this show are very young and behaves in ways you can easily guess. Some of the things they say can be misunderstood or brutally honest. Because of their age, you can expect a lot of shenanigans in their daily lives. Characters such as Taka, Kirin, and even Koutarou can cause trouble despite being unintentional. It’s such traits that make them kids. Despite that, I find this cast to be very charming and realistic. Their attachment to their older siblings and parents is also heartwarming to watch once you understand them more. \\n\\n\r\nSimilar to the manga, the anime adaptation follows more of a slice of life storytelling so you really shouldn’t expect a complicated story. Every day is an adventure of its own. Because the show takes place at school, you can also expect some drama to develop between the older characters. A prime example is Inomata as feelings are developed about Ryuichi. While this show isn’t a love story, it gets more and more obvious. While I can’t say the show is really well written in that respect, it does capture the feel of what school life is like for girls of her age. At the caretaker center, Ryuichi’s bonds with others is perhaps a key selling point of the show. He is able to earn the trust of the kids and other caretakers. However, the story itself still needs a lot of work. I’ve read the manga and as a 12 episode TV anime adaptation, it felt like a lot was missing. There’s also some uncomfortable moments in this show that ventures into controversial territory. (I’m looking at you Tomoya Yagi) The overall tone of the show can also be a bit dull once you realize it’s not the type of anime for you. It’s a blend of slice of life and shoujo so be aware of what’s ahead.\\n\\n\r\nAdapted by Brain’s Base, this show is an example of a realistic slice of life. While the raw visual quality isn’t overly impressive, every character in the show can be relatable and their character designs is an example of that. The kids are adorably charming and their character expressions is exactly how they should behave. Character chemistry is imperative to capture the mood of the show and thankfully, Brain’s Base and the director is able to meet such expectations. Some characters’ designs definitely stand out more than others such as the school chairwoman and her signature hair. To say the least, the artwork gets the job done and not be overlooked.\\n\\n\r\nTo portray such a younger cast takes skill and thankfully, the VA skillfully does just that. From crying to the happy moments, every child in this anime make us believe that they are real. The students at the school all have their own personalities as the VA easily fits into their shoes. The only character that I have a problem with in this anime is Yuki. She’s the annoying type of school girl that I can’t stand and seems to be just there to make everything looks more than silly than it is. Compared to other characters, she isn’t likable and sometimes, I find the kids to be more mature than she is because of her personality. On the other hand, the theme songs in this anime is definitely appealing to watch with its pure innocence. The catchy and lighthearted tone of the soundtrack is also easy to get used to.\\n\\n\r\nAfter watching Gakuen Babysitters, I can easily say that the show can be recommendable to almost everyone. It’s probably targeted to a more specific demographic but anyone should be able to watch this with an easy and open mind. From its daily slice of life adventures to the charming character chemistry, this is a show that tells what heartwarming is really about.\\n",
            "date": "2018-03-25T07:13:00+00:00",
            "helpful_count": 40,
            "mal_id": 274991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=274991"
        },
        {
            "content": "Now that 4 episodes have aired, I can redo my review, but keep it true to what I originally had it as. I don't typically write reviews because I don't see the point. I can't describe it as well as others and most of the time the things I loved/hated have already been commented on in more detail than I could ever have written. But not for this one. Not this time. TLDR at the end. \r\nGakuen Babysitters is fantastic. It is by no means thought-provoking or action-packed. It does exactly what it sets out to do: be a relaxing and sweet anime about childrenand their families or, in some cases, what is left of them. If you're expecting more than that then I'm sure that you'll be disappointed. This is Winter seasons \"I've had a long day and I hate everyone,\" anime. Sit down, watch kids do stupid things and be adorable, and relax. \\n\\n\r\nThe 3rd episode introduced us to this \"pedophile\" character as some people have described him as. I saw him as weird, but not once did he seem like a pedophile. His nose bleeds when he's around the children because they're adorable and he strains himself. People tend to forget that nosebleeds are from being overly excited and because the anime industry consistently uses nosebleeds as a \"sexual desire\" indicator. Yeah, no, you can get a nosebleed from strenuous activities such as being overly excited or being stressed. I've seen a friend get a nosebleed because he was extremely pissed. Was he turned on? No. Is the character in the show turned on when he looks at the kids? No. The human body creates nosebleeds when the body undergoes a certain amount of stress. I know all the anime industry shows is nosebleeds when they're sexually interested but please take the time to research other causes of nosebleeds. I can't say I'm sexually excited when I wake up in the morning and have a nosebleed from the stress of the dry season. If you remove the nosebleed from his character, does it change anything about the way he behaves with them? No, it really doesn't. If you saw him without the nosebleed, what would you think? \"Oh, he just really likes kids!\" That is what I see. I've yet to see him display any pedophilic behavior but it's immediately written as such simply because of the nosebleed cliche. I want to see this sexual nosebleed cliche end and I'm hoping this character is a step towards that. \\n\\n\r\nIf you're looking for an actual pedophile character, watch Papa no Iukoto wo Kikinasai and then come back to this anime. They actually legit had him stalking her, taking pictures of her, and drooling over her. He completely wanted to be with her in every way imaginable and it was \"totally okay.\" Which one is the pedophile? The one who wants to pinch their cheeks and watch them be adorable or the one who wants to drool over a 10 year old in a bikini and act like it's totally okay for him to want to have sex with her?\\n\\n\r\nI really think this anime has the potential to break our hearts. It shows itself as just a nonsense anime about children and their activities, but then it takes a dark turn and reminds us that the protagonists parents are dead. It is not just about comedy, but the tragedy of loss and how it can affect the human mind. I enjoyed the 4th episode very much as we saw a side of our protagonist that we hadn't seen before. He's lonely. Jealous, even.  He has the kids but what about people his age? He has the duty of the babysitting club but what about his own interests? I want to see them expand upon this unless the babysitting club will just be full of people by the end of the anime. Either route will do. Every character is interesting and I hope to see them continue to grow and heal. \\n\\n\r\nTLDR: The character is not a pedophile. Nosebleeds are caused by being overly excited, not only from \"sexual desire\" like the anime industry tries to say. I've been fangirling over how cute the kids in this anime are and I've easily wanted to pinch their cheeks the same way. Am I a pedophile? No, they're just really cute. Get over it. If the character chooses to slowly devolve into what everyone assumes he is, then I will happily delete this review. Until then, I am getting serious grandparent vibes from him. Odd? Yes. Far too happy? Yes. Pedophilic? No. I have high expectations for this anime and they have been fulfilling them quite well.",
            "date": "2018-01-28T11:47:00+00:00",
            "helpful_count": 39,
            "mal_id": 269921,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5380503.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kookerz32",
                "username": "Kookerz32"
            },
            "url": "https://myanimelist.net/reviews.php?id=269921"
        },
        {
            "content": "[Spoiler Warning]\r\nWhether or not you find Gakuen Babysitters unsettling, there is no denying it teaches awful life lessons.\r\nTo summarize why I dropped it; it’s a show about a kid who has to take care of babies, but it somehow fails at this easy plot conceit. It tries to teach the audience life lessons about responsibilities that come with growing up, yet at the same time, it teaches awful lessons.\r\nWhat makes it so unbearable:\r\n1. Pedophile side character that the show plays off as a joke. His name’s Yagi and he gets nosebleeds when going near the babies. He’s pretty gross and I wouldn’t be surprised ifI saw him in Hajimete no Gal. It’s good that the other characters call him out for being a weirdo but why does he exist?? I would have been fine if the show called him a weirdo and ended his presence on the show, but he’s cutesy comic relief. \\n\r\nHe’s in the opening too so he’ll most likely show up in later episodes. \\n\\n\r\n2. A shady hooded character is seen spying on the babies then is later revealed to be one of their fathers. Said father is an actor who played a kidnapper in his recent movie, therefore, his kid wasn’t afraid of him… A kidnapper. Let that sink in. The reason why the kid wasn’t afraid was that his mother showed him the movie and her reason for showing him something horrible like that she thought he looked cool in the role... AS A KIDNAPPER! It was like the show was teaching kids to not be afraid of kidnappers. This crosses the line between shockingly moronic writing into a dangerously stupid territory. The show is clearly targeted at kids so why doesn't it realize it's sending a message like this?\\n\\n\r\n3. One of the main characters classmates wacks his little brother. His baby brother. This wasn’t as big of an issue as the previous ones, but it was the icing on the bad life lesson cake that the show feeds to the audience. \\n\\n\r\nIf I had known Gakuen Babysitters had so many off-putting and downright creepy parts to it I wouldn’t have bothered to watch it. If you still aren’t off-put by the terrible morals the show teaches, then at least you’ll enjoy the cute babies and occasional but well-handled drama segments. But I’m tapping out here, How to Keep a Mummy is basically the same thing as this, but better. The writer of that show is actually aware of their audience and offers an adorable slice of life with much better vibes.\\n",
            "date": "2018-01-28T12:59:00+00:00",
            "helpful_count": 35,
            "mal_id": 269931,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=269931"
        },
        {
            "content": "I don't write reviews often (or at all) but thought I'd leave one for Gakuen Babysitters.  I spent 2 years in Japan working with kids aged 0-3 and this show brought back so many memories.  It really is quite spot-on with the behaviour and stereotypes of the Japanese toddlers.  Rules and regulations are far more relaxed in Japan compared to, say, North America, so this anime gave a fairly accurate portrayal of what life is like in a Japanese daycare.  Mind, the head teacher sleeping so much may be a slight exaggeration.. XD\r\nWhile a bit biased due to my own pastexperiences, this show does offer a refreshing take on the SoL genre.  Would recommend to anyone in childcare, lots of entertaining quirks and relative topics.",
            "date": "2018-03-25T17:20:00+00:00",
            "helpful_count": 31,
            "mal_id": 275071,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Canadian_Otaku",
                "username": "Canadian_Otaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=275071"
        },
        {
            "content": "This anime is so adorably fun to watch! The first and second episode made me excited to keep watching, but when I got to episode 3- I was sold! I was a bit nervous when I saw people reviewing negatively because of a potentially \"Pedophile-like\" character. I proceeded to watch with a friend and am STILL confused as to why people call this character a pedo.. He got a nosebleed around the small babies and became excited. That does not mean that he wanted to act out anything sexual.. It isn't just an anime thing when people get nosebleeds over getting excited. Some people canget them when their blood pressure sky rockets suddenly in real life too. This character was just excited to be around the babies and was just happy in general. So, I am still going to watch because the rest of the episode was simply adorable and so lovely. Episode 4 is even better than the last too! I adore this anime to bits :D",
            "date": "2018-01-28T14:12:00+00:00",
            "helpful_count": 17,
            "mal_id": 269936,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5500071.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Halivia",
                "username": "Halivia"
            },
            "url": "https://myanimelist.net/reviews.php?id=269936"
        },
        {
            "content": "A trend I find with children in anime is that they're always painted 'cute'.  Small human beings surrounded by glittery and sparkly effects who do cute things so that the audience falls in love with the tiny people characters.  It's not often that I see children portrayed as what they actually are, monsters, and it's even stranger to see a more realistic representation portrayed in a shoujo series of all things, a genre where virtually everything is depicted a lot more flowery than they actually are.\r\nStory:\r\nKashima Ryuuichi and his little brother Kotaro have met with the unfortunate fate of becoming orphans after their parents passingdue to a plane crash.  It is then that the boy is contacted by the headmistress of the high school that he will be attending, and told that from that day forward, he will live with her with room and board all taken care of, but in exchange, he must spend his spare time at the babysitters club, a daycare center at school dedicated to the teachers' children while their mothers work.\\n\\n\r\nThe show is pretty standard for what one can expect from a shoujo-style slice of life.  The story is very lax in nature with the only real high points being slight bumps that get resolved in the episode, thus leading to the show's mostly episodic nature with very few connecting points.  The episodes are based around Ryuuichi and his relationships with both the people he meets at school and the children in the daycare center, without really much weight to them since the show ends up going back to the status quo and resetting all but a few plot elements that don't get touched very much in the later episodes.\\n\\n\r\nBut there are some points that I found irritating, mainly the fact that the parents of our two main protagonists ARE DEAD.  It is the story of a four year old and a fifteen year old entering a stage in their life with their parents just recently deceased.  Yes, this is a happy go lucky slice of life show, but you cannot ignore this looming fact.  They do touch on this point a fair bit in the early episodes, but it felt like it was played off and largely ignored in sacrifice to showcase Ryuuichi playing with kids, which does not feel right considering how heavy of a topic this is.\\n\\n\r\nAnother more glaring problem is the romantic subplot.  There are two girls in this show that seem to have an interest for Ryuuichi, and everything about their interactions with him feels so unsatisfying, as these scenes feature either a tsundere who does the classic tsundere thing of being a bitch before regretting it later because that's apparently how people work, and a super shy girl who very clearly has a crush on the guy, but never gets the time of day because the show's not about her, but we still have to know she exists anyway.  The subplot eats up a surprising amount of the show's time and while none of the runtime is really lost since the episodic episodes featuring the children are wrapped up well enough to not warrant me yelling at Brain's Base for wasting time, I can't help but feel cheated because they set up the potential romance only to have it not go anywhere because audiences apparently like unresolved plot points/ideas.\\n\\n\r\nOverall, Gakuen Babysitters is pretty much a show that's what you get on the box.  It's a show about a guy babysitting kids with the occasional funny thing happening cause it's a slice of life comedy show that entertains.  It wraps itself neatly at the end to show how far the two brothers have come, as a sort of recap episode to show the fruits of the labor the entire runtime has built up to, but largely what you're going to be seeing here are \"School babysitters\".  Babysitters who babysit at school.\\n\\n\r\nOverview:\\n\r\n+/-  Pretty much what you'd expect with the title of the series\\n\r\n+  Has some heartwarming moments\\n\r\n-   Romance goes nowhere, so why even include it in the first place\\n\\n\r\nCharacters:\\n\\n\r\nRyuuichi is about as interesting as sandpaper.  He cares very much for his little brother (to be to an obsessive degree for various reasons), and is extremely passive, being far too nice to everyone and not getting upset in the slightest.  Honestly there's not much to say about this guy cause weirdly enough, he's not involved with the plot all that much despite being the protagonist and the story beyond the first few episodes doesn't do much to shed light on the reality of him now being an orphan despite a few choice moments.  Kotaro is sort of an off-branch of his character since the two in the show are basically inseparable, and Kotaro on his own doesn't really have any traits of his own either cause the kid is usually silent with this perpetual bored expression that makes me question whether or not he knows what's even going on in his life.\\n\\n\r\nThen there're the kids.  Who, if you know what kids really are like, will probably be reflective in your experience with them.  Simply put; they're loud, they're jerks, they do whatever the hell they want, and they can be cute.  Sometimes.  As the core of the show's existence, the six children featured in the show each take turns and sometimes altogether being the show's focus (some more than others), taking the protagonist and various members of the side cast along with them on their little adventures doing what children do.  The brat, the girl, the twins, Kotaro, and the baby; I have my own gripes with each of the kids, as their actual characters are something of personal preference, but I have to say they did a good job at showing their audience what snot-nosed brats children are actually like most of the time.  So I guess they did get the important thing right.\\n\\n\r\nThe rest of the cast involving recurring characters like Kamitami Hayato and Yoshihito Usaida, two characters who are commonly seen around Ryuuichi, the childrens' parents, and other members of the side cast all weirdly enough have more personality than our main protagonist in that they fill in the gaps to enrich the world surrounding Ryuuichi with people who're more experienced with the other kids in the series, being family members and other people who simply have been around the children longer to be able to handle the little headaches much easier.  The outliers to this rule are Inomata Maria and Ushimaru Yuki, both of whom are the girls that seem to catch Ryuuichi's fancy, but don't do anything about it cause even if you try, romance isn't wanted in this story.\\n\\n\r\nOverview:\\n\r\n+ Realistic depictions of toddler behavior\\n\r\n+ Amusing sidecast (for the most part)\\n\r\n-  MC's not very interesting\\n\\n\r\nArt:\\n\\n\r\nProduced by Brain's Base, Gakuen Babysitters focuses more on the light aesthetic with very few points of animation to take note of.  The show itself is very consistent with its art quality, vying for a simple style with pastel colors that emulate the show's normally cheery and bright nature cause the show isn't a slice of life shoujo for nothing.\\n\\n\r\nComedy is relegated primarily to very simple comedic faces that at times don't even feel like a real anime comedy cause nothing's exaggerated which I guess by extension makes it less intrusive on the situation as a whole.  Though I do question what kind of comedy can be derived from a family who disciplines their members with a sharp blow to the head.  I mean it's kinda funny, but it got kind of stale after the twentieth time they did it, which doesn't help when the Kamitami family has the most irritating child in the entire series as one of its members.\\n\\n\r\nOverview:\\n\r\n+  Consistent quality\\n\r\n+  Soothing and simple style\\n\\n\r\nSound:\\n\\n\r\nBoth Daisuke Ono's \"Endless Happy World\" and Hyorotto Danshi's \"Oshiete yo\", which is sung by the VAs of Ryuuichi and Hayato are both mellow songs that emulate the slice of life/happy go lucky tune that the show sings to featuring the day to day lives of looking after children who spend half their time drowning in their own imaginations playing.\\n\\n\r\nSuffice to say, they're not really the most memorable tracks, but they do their job in emulating the feeling the audience is supposed to get when watching this series cause everything about these songs is meant to create the feeling of children having fun more than anything else.  Personally though, I'm not much of a fan and I found them to be kind of generic and nothing really noteworthy.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nHonestly, I watched this show more for the novelty of the idea more so than any interest in the show itself.  I sat there looking at 'Gakuen Babysitters' and thought to myself what the actual hell they could do with a show as literally titled as this.  The show pretty much met my expectation on what I thought it was going to do, but kind of killed them at the same time cause the show's attempt at a romantic subplot was one of those things that shouldn't have been there, but surprise surprise, was there because why not.  I was actively upset at Yuki's lack of involvement in the plot because she kept showing up in the series with nothing of value to add with every appearance.  Which is sad because they try to mix her into everything by the end of the series and every fiber of my being was asking \"Why didn't you do this earlier?\"\\n\\n\r\nBut I think the one part of the show that irked me the most was Taka, Hayato's little brother and quite possibly the worst character in this entire show.  Simply put, he's a brat.  An annoying kid that spends the entire show trying to get his way and shove his way into everything without any acknowledgment for anyone else's thoughts or feelings.  I don't like him because not only is he an annoying character, but he reminds me of a member of my own family who is the exact same way, and that's not a fun comparison to think about when you're watching an episode of anime on Sunday night to relax dreading the coming week.\\n\\n\r\nBut all in all, Gakuen Babysitters is a show that I felt was...alright, I guess.  I don't think it helps that I'm not much of a shoujo fan, and the shoujo-style of storytelling isn't my favorite, so I think my enjoyment of the show would've been skewed from the beginning.  If you're a fan of the shoujo genre and you got some time to kill, this would be a fun show to watch if you're trying to fill in time.  Just be prepared to turn down your volume at times cause like a real group of children, the kids in this show can get pretty loud, and Taka's voice is like cheese graters, so here's your early warning.",
            "date": "2018-03-25T09:38:00+00:00",
            "helpful_count": 15,
            "mal_id": 275013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=275013"
        },
        {
            "content": "The story is about two young...well one High School Student Ryuuichi and his VERY young brother Kotaro. These two brothers end up losing their parents in a plane crash and are sent to live with the Chairwoman of a high school. The reason being is that her Son and Daughter in Law were also in said plane crash and felt like it was necessary to take these two into her home. \r\nOf course the catch is for Ryuuichi to live in the house he must become part of the \"Babysitters Club\" in his High School. So basically the babysitters club is a club where theteachers leave their young kids who are not able to attend Pre or Elementary school yet. It's actually a pretty cool thing because it shows a development of Ryuuichi being accustomed to high school life, and Kotaro breaking out of his shyness being surrounded by kids his age and not being with his brother constantly.\\n\\n\r\nAlong the way we get some awesome characters introduced in the show. Of course we get the kids in the Club, but we also get to meet the person in charge of the club when Ryuuichi is in class, the kids parents and Ryuuichi's classmates as well. The development and story over time in this series was really well done. At time you find yourself holding back tears, and other times you find yourself rooting for certain characters to come over there fear of doing something, for example just playing with the children.\\n\\n\r\nThe art and animation were not anything special. Not the worst thing in this word since there's no action or over the top scenes. Considering this was a more relaxing anime the animation did not have to be top tier to enjoy it.\\n\\n\r\nThe sound was pretty average as well. I enjoyed the ending more then the opening, but that's not saying much since overall the ending was \"meh\"\\n\\n\r\nThe characters were super enjoyable. From the teachers down to the Ryuuichi's classmates this was one awesome cast of characters. Even the kids were super enjoyable. When it came to the High school kids you could really relate to most of them especially if you have young siblings, or even issues when it comes to handling small children. I was constantly comparing myself to Inomata. While she enjoyed being with the children it was hard for her to control them or even understand them without making them cry or be hurt in the end. However over time she was able to better her self while spending more time with Ryuuichi and the kids.\\n\\n\r\nI found myself waiting patiently every Sunday afternoon so I could watch this anime. That is how much I enjoyed it. \\n\\n\r\nOverall this was a unexpectedly great anime. Even with the score it has now i feel like it super underrated and definitely overlooked. I think the title of the anime plays a huge role in that. I would highly recommend this anime to anyone who would like a break from anything serious or over the top and just enjoy a very conditional slice of life anime.",
            "date": "2018-03-25T09:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 275008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275008"
        },
        {
            "content": "I started this anime out LOVING it, I really enjoy cute animes and this one seemed really good. The premise starts out a little sad but it starts picking up and becoming something cute and enjoyable. \r\nThen it hits episode 3 and we get a new character in the mix.\r\nHe's explained as someone who's usually seen glaring at children, so I was wondering if it was another instance of someone disliking children, which is fine! I don't like children myself so I get it. However, we find out later, that's not the case. \r\nHe's a pedophile, played for a joke. He stalks children because they'resoft and cute and he really likes them because \"he's a degenerate\". And his pedophilia is played for a joke. The whole time. \\n\\n\r\nI didn't want to support an anime like that, so i dropped it immediately.",
            "date": "2018-03-06T16:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 273224,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7036056.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jinxthewicked",
                "username": "jinxthewicked"
            },
            "url": "https://myanimelist.net/reviews.php?id=273224"
        },
        {
            "content": "KAWAIIIIIII!!\r\nThis is one cute anime I'm telling Y'all...\r\nI finished the anime in one sitting it's very good, it's fun, it's emotional I'll explain each point and why I gave it an 8.\r\nFirst of all, the story, a Definite 8 out of 10 some plot holes, unfortunately, some unexplained stuff too but overall it's amazing it shows kindness and how a highschooler could take care of his small brother which is really emotional in a way.\r\nThe Art, Outstanding Incredible, Unbelievable.\r\nI was amazed how well it's drawn xD, I miss this drawing style honestly it's rare yet Beautiful and pleasing to the eye, I really like howeach character is different even in simple matters like eyes, body, shape, and hair for example,the main character's eyes are huge and bright yet nobody in the whole show got the same eyes, same when it comes to other characters it's magnificent.\\n\\n\r\nThe Sound, Still undescribable it's outstanding great voice acting. A great sound quality it's just incredible honestly.\\n\\n\r\nThe characters, one of the most important factors I wasn't able to give it a 10, unfortunately, some characters aren't well developed I can't really include any spoilers but it's still good I can't deny it that's why I gave it an 8 No Less, No More. It is the perfect rate in my opinion.\\n\\n\r\nI really enjoyed the anime really fun to watch and love, for the enjoyment it's a definite 9 <3.\\n\\n\r\nOverall it's a great anime you should watch it and feel the love <3.\\n\r\nPs: I don't know if it matters but The opening is Soooooo good <3<3<3.",
            "date": "2018-04-20T04:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 278545,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6520076.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yorrito",
                "username": "Yorrito"
            },
            "url": "https://myanimelist.net/reviews.php?id=278545"
        },
        {
            "content": "After watching countless shows about ecchi and shounen I thought why not watch this show about babies. Seeing so many babies run around made me feel good, and when I mean good I mean GOOD. In the sense that they were cute and what not. Or as you people prefer to say: Kawaii. Anyway, let me move on into detail about why the rating I have given it is a below average 3.\r\n    The story is about high-school kid Ryuuchi and his brother Kotarou who get abandoned, but get adopted by some rich old hag with a crankyattitude who just puts up the 'ol \"I'm a big old mean lady and I hate everyone\" act and in truth is a nice 'ol tsundere archetype lady. The reason for their abandonment is so cliche and forced it feels completely unrealistic and lacking in emotional impact. Ryuuchi handles it well, but maybe it's because he doesn't give a crap about them or because it is irrelevant to the main plot about watching babies. Anyway, 'ol lady or chairwoman lady runs a school with a daycare club and has Ryuuchi run it as a babysitter during his off time from classes, which is then how we get introduced to the cute babies. \\n\\n\r\n    Most of the characters are bland archetypes we have seen already. Three examples being Hayato, the chairwoman, and butler guy. Hayato and Youko a.k.a chairowoman chick each have a competition with the audience to prove who is the most tsundere out of the anime. I'd have to give it to Hayato since he seems like the tougher egg to crack. Butler guy is just your stereotypical anime butler guy - quite and useful. Although who would want a useless butler anyway. Moving on, there's a girl who craves Ryuuchi's dong as soon as he appears in class and some other tsundere girl who also craves it, but not as much.  Ryuuchi is alright, but his clinginess to his little brother Kotarou and how he makes Kotarou cling to him as well is quite annoying. Usaida or the first babysitter in the club is chill and probably the most likable of the cast, though his presence usually just consists of him sleeping.\\n\\n\r\nOn to the baby tier list: \\n\r\nS-tier : Kotarou\\n\r\nA-tier : Kirin\\n\r\nB-tier : Takuma and his crying brother (forgot his name) \\n\r\nC-tier : weird-eyed toddler\\n\r\nShit tier : Taka\\n\\n\r\nThe music is there... I think. If it was memorable or moving in some way I would have mentioned it by now.\\n\r\nThe anime felt more like a drag as I continued to watch it, but I still got some enjoyment from it. Only watch this if you like typical cute anime crap.\\n\\n\r\nStory: 1\\n\r\nArt: 5 \\n\r\nSound: 3\\n\r\nCharacter: 3 \\n\r\nEnjoyment: 4\\n\r\nOverall: 3",
            "date": "2018-03-26T12:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 275198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2442049.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/leosapathy",
                "username": "leosapathy"
            },
            "url": "https://myanimelist.net/reviews.php?id=275198"
        },
        {
            "content": "This anime is too cute. I have read/been reading the manga, and it's quite similar, but of course there are some things that are not accounted for or rushed. \r\nIt's basically a student in a babysitting club with his younger brother, a sweet and simple anime that is just too adorable. \r\nIt is sometimes annoying because in the manga, you don't hear the children actually crying, but what can you do? \r\nThe first few episodes were a real tearjerker (for me), which was quite surprising.\r\nSome say there's a pedophile character, but honestly this anime is really innocent and there is no \"hidden\" meanings. It isjust a response to seeing something adorable. It is just a show on kids being cute and doing cute things. \\n\\n\r\nStory: 7, there's no real story, just a slice of life\\n\r\nArt: 9, very cute, I love her art style and have read many other manga that she has drawn.\\n\r\nSound: 6, I dont hate the sound track, but it isnt great, perse\\n\r\nCharacter: 8, there are few, but they are unique\\n\r\nEnjoyment: 8, a good show to relax \\n\r\nOverall: 8. It is a cute show about children, nothing more, nothing less\\n\\n",
            "date": "2018-01-28T15:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 269944,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4508379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zucchinichop",
                "username": "zucchinichop"
            },
            "url": "https://myanimelist.net/reviews.php?id=269944"
        },
        {
            "content": "Gakuen Babysitters seemed like a decently good anime for me at the beginning. But as Gakuen Babysitters played out with more story clichés, and started making some parts unbearable, I stopped liking this anime that much.\r\nStory: (6/10)\r\nIn this anime, all the episodes are disjointed and have no connection whatsoever with each other. The storyline in every episode is fine, I just felt that using clichés, such as the 'beach' cliché degraded my experience with this anime. However, to make up for it, it has some well-thought out drama scenes. \r\nArt: (7/10)\r\nThe art was decent and enough to discern most characters from each other. However, Ibelieve they could have still worked on making some characters not as noticeably similar in design.\\n\\n\r\nSound: (5/10)\\n\r\nThe op and ed were just normal anime songs. However, none of the soundtracks themselves pop out and really give a special feel to the anime itself imo.\\n\\n\r\nCharacter: (4/10)\\n\r\nAt first I found the babies outright extremely cute. However, over time, the anime makers used the babysitters as a cheap way to cover up so many moments that could have been used to develop other parts of the story, becoming very annoying. The characters also are mildly disturbing, such as a father who dresses like a kidnapper, and a high school student who bleeds from excitement when seeing one of the babies.\\n\\n\r\nOverall: (6/10)\\n\r\nOverall a decent anime that may or may not be worth your time. If you like babysitters and babies a lot, go for it. Otherwise, you should look for other slice of life animes instead",
            "date": "2018-03-27T13:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 275360,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6310268.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dragontail",
                "username": "Dragontail"
            },
            "url": "https://myanimelist.net/reviews.php?id=275360"
        },
        {
            "content": "I gonna give it to you straight: nothing about this anime is special or surprising in the least. \"Then why'd you give it a 9?\" you ask. This anime has this whimsical charisma of its own: it's ineffable. There's just some unique appeal to it that can't be explained, pinpointed, or replicated. Believe me, if I knew what it was, I would try to find as much of this as I can, because to put it lightly, I'm ADDICTED to this now. \r\nThe story was simple. A boy and his baby brother are adopted by a rich childless woman after they're orphaned. This boy, ourmain character, takes care of babies for his teachers. It sounds dreary, but it's not boring in the least. I was a little worried about watching it because of the boring-sounding summary, but after seeing too many gifs on tumblr, I decided to take a shot, and I've never been happier with an anime choice before. The story was always interesting, engaging, and heartfelt. Nothing ever felt rushed, overdone, or in-genuine. \\n\\n\r\nThe art was this beautiful pastel effect that's calming and beautiful. It reminds me of Wonderland and Oz and Narnia somehow: it reminds one of the light, fleeting beauty of childhood and fittingly, nursery walls. \\n\\n\r\nThe sound was pretty well done. The voice actors did their job decently. The opening and closing themes weren't anything special, but I never skipped either because of the adorable babies that made me feel guilty if I ever wanted to skip it. \\n\\n\r\nThe characters, oh dear. Every single one (even the babies) has a distinct, fresh character that doesn't just feed off of a stereotype. Are they really all that deep? Perhaps not. After all, the show is just 12 episodes. But everything they DO do is meaningful and makes my heart melt.\\n\\n\r\nI enjoyed this way too much. Before I go into my recommendations, a few important notes: \\n\\n\r\n1. some people dropped this anime because of a 'pedophile'. I will warn you right now that this character DOES seem kinda like a pedophile to me, but it's also revealed that he suffered from similar 'nosebleeds' around babies when HE was a baby, so I'm inclined to believe it has less to do with pedophilia and more to do with just cuteness in general. Either way, I couldn't bring myself to take off too many points for that since he only appears once or twice. I could just pretend he never showed up. Also keep in mind that Japanese age of consent is 13 (or was 13 as far as I know, correct me if I'm wrong) so the public perception of him might be different for them. \\n\\n\r\n2. be prepared for tears. I cried twice per episode, once per ministory minumum. I cried multiple times sometimes. I'm an emotional person to begin with, but ultimate adorableness combined with sibling-love and orphans and friendship and babies is like all my weaknesses combined. If you're emotional, watch out. If you're not, still keep your guard up-- this is more feelzy than it looks. \\n\\n\r\n3. while some classify this as a shoujo, don't expect any shipping. There are some prospective ships with a possible boyxboy, boyxgirl (two different girls actually), and girlxgirl. There's that flexibility, but these ships are barely even hinted at. If you need a ship to watch a show, you probably have to be okay with it being just in your head. \\n\\n\r\nWith that, I'll finish this off. \\n\\n\r\nI would recommend this if you: like babies, like cute things, like sibling relationships, have a weakness for cute guys taking care of babies, like things that make you emotional, like crying (lol me), love family feelz, like feelz in general, like wholesome purity \\n\\n\r\nI would NOT recommend this if you: want something dark, want lots of plot or character development, don't like children, like conflict and sadness, aren't into relationships etc.\\n\\n\r\nHave a great day everyone!",
            "date": "2018-03-26T19:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 275247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=275247"
        },
        {
            "content": "So great so far! This is a very adorable and wholesome anime. A cute brother and brother relationship, they truly care for each other and always try to have fun even after losing their parents.It shows how much fun is to be around children; personally I dislike children but now I wanted to take care of one after watching this. It has a lot of life-lessons such as everyone is not alone, you can't know someone's feelings if they don't speak up etc. The opening is cute and calming. I can't help but laugh and smile so much in a lot of certain scenes andcry in some parts. The characters are okay; cute boys taking care of cute children; how could you not love that?, a couple of somehow tsundere people who acts that they don't care but actually do. \\n\\n\r\n I saw people doing negative reviews due to this certain character who nosebleeds around children implying a \"sexual desire\" towards them. I thought he was weird, disgusting and an unnecessary background character but I don't think this character can do any harm because; he did said himself it was the best for him not to join and there is someone watching over him. Well, I'm just ignoring he exists.\\n\\n\r\nThough just one small negativity doesn't mean this anime is automatically bad; I'm sure I don't need to explain that I mean everyone knows that right? This are all just my opinions and thoughts. If you like cute people doing cute little things then I suggest you to watch this.<3\\n\r\nAnyways! Definitely looking forward for more episodes, cuteness, wholesome content and hilarious content. Love it so far; I might add more info in this review soon! <3\\n\\n\r\nStory: 8\\n\r\nArt: 9\\n\r\nSound: 8\\n\r\nCharacter: 8\\n\r\nEnjoyment: 9\\n\\n",
            "date": "2018-01-29T06:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 270001,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6606303.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yvolenne",
                "username": "Yvolenne"
            },
            "url": "https://myanimelist.net/reviews.php?id=270001"
        },
        {
            "content": "MINOR SPOILER WARNING - contains information from the first few episodes\r\nGakuen Babysitters is an excellent anime to watch. The anime came out during a time when I was really getting back into anime, and was like a second gateway anime. It draws you in with its simple premise and story, and sticks to it throughout the entire show. \r\nThe story of Gakuen Babysitters is very simple. Our main characters, Ryuichi and Kotarou, currently don't have a home due to their parents dying in a plane crash. The Academy Chairwoman decides to give the boys a home, and gives Ryuichi free education should he help atthe school's daycare centre after school. However simple the premise is, it is able to constantly deliver on it, and shows us a great time that we can appreciate at home. \\n\r\nThere are many shows that have filler episodes to stretch an anime out, but this is a show that develops each of your characters at an excellent pace and in great ways. In every single episode, the simple story is progressed through, with problems being presented, and then solved in a timely fashion. \\n\\n\r\nHowever simple the art style and music are, they help to create a simple and ecstatically pleasing anime, showing off how not everything needs to be flashy or sparking to be attractive. The anime keeps everything nice and clean, with Brain's Base animating, keeping everything pleasing to look at. \\n\\n\r\nThe show is an easy comedy and slice of life, and with a simple plot and excellent characters (even though they are 3 year olds!). It is something you can come home to and just sit and enjoy. Something pleasing to watch as you relax. \\n\\n\r\nGakuen Babysitters is an excellent show, and although I won't speak for every single person, it is a really good watch. Set aside an afternoon, sit down with friends (or by yourself, I'm not judging), and enjoy.",
            "date": "2019-04-17T04:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 306505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7986214.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SomeRandomWeebs",
                "username": "SomeRandomWeebs"
            },
            "url": "https://myanimelist.net/reviews.php?id=306505"
        },
        {
            "content": "I'm not used to writing reviews, but I will anyway because I can.\r\nI personally gave the story a 6. It's okay I guess. The episodes don't really connect much in story, but it's an anime about babysitting cute kids at school. I'd be disappointed if it did, really. I actually like anime like this. they're the best to watch when you're doing homework or sick and bored or something.\r\nI think the art is okay. I gave it a 7 because there weren't any times where i saw it and went 'oh, that's ugly', so.. yeah.\r\nI gave the sound a 7 because I can't remember muchbut the OP and ED were lowkey bangers.\\n\\n\r\nI gave the characters a 7 because I liked 'em. There were two characters where i was like 'haha no' and they're both eh.... not... ckjcjfjkvkjbi. The first one is named Yagi or something. He isn't really a pedophile but there's one joke in the show that insinuates he is one. Seriously, anime really ruined nose bleeds. IF SOMEONE HAS A NOSE BLEED IT DOES NOT MEAN THEY'RE TURNED ON. I don't even know why they chose to make him have nose bleeds because he quite obviously has no sexual intentions with the children. If he was a girl, most people wouldn't think this way because double standards I guess. All he wants to do is buy the children presents and squish their cheeks and play with them like LITERALLY ALL OF US DO! Personally, I just found his pretty boy personality annoying. I don't think he's a pedo because he hasn't done anything to make me think that. I have an anemic friend who gets nosebleeds all the time. It's just an anime BS thing that nobody but Americans and other foreigners will get offended over.\\n\\n\r\nIf you're going to be creeped out by anyone, you should really be creeped out by Kirin's father, saying shit like \"If I were 30 years younger I'd ask for your hand (in marriage)\" to a 1-year-old baby. and the same thing to the main character when he thought he was a girl. Ryuuichi is like, what, 15? And nobody's saying anything about this but they're saying something about a guy who just loves children. I love children too! They're adorable and it's a natural human instinct to want to protect them! What ISN'T a natural instinct is to say \"Where are the cute high school babysitter girls?\" to your own goddamn wife.\\n\\n\r\nSome people also hate Kamitani, the older brother of one of the kids, because he hits his little brother whenever he's a brat. Clearly, these people didn't grow up with younger siblings; because sometimes i want to punt my little brother over a fence, but I don't because he's my brother and I love him so I hit him instead. Not hard enough to actually hurt him, but he cries anyway because he's an overdramatic brat who's spoiled to the bones. Again, get over yourselves.\\n\\n\r\nAnother character I saw getting hated on for no reason is the blonde twins' dad. Guys, he's famous. If he'd went out without a disguise he'd be chased down for autographs and pictures BECAUSE HE'S FAMOUS. All he wants to do is see his kids, but they're scared of him because of the MOTHER's stupid decision to show them a movie where he plays a kidnapper. What awful parenting SHE has. HER. It's not his fault for HER actions, because that's how he gets money. Do you hate every actor that plays a kidnapper role or do you have any fucking common sense? They knew it was their father because otherwise they wouldn't of fucking introduced him as one. OF COURSE they didn't want him to go because he's their father. The whole fucking reason she showed them his movies is because they wanted to see him. He HATES being away from them and they HATE being away from him. Use your head for a whole 10 seconds maybe and you'd be able to see that, but i digress.\\n\\n\r\nI gave enjoyment a 10 because.. there's something about cute babies waddling around and doing cute baby things that just make me UwU in satisfaction. I watched this when I was sick and had nothing to do, so maybe that's some of it.\\n\\n\r\nOverall it's a 7. It wasn't the best and I probably won't rewatch it religiously, but Kotaro is my best boy and I'll be damned if I never get to see his cute little face again. I can remember the first time I held my baby brother. I was like 10 years old and it was so weird because it was the first time i held a baby but i was so good at it. The egg/chick episode really got to me bc I was like 'same' every 5 seconds.\\n\\n\r\nThis was a mess but so am I.",
            "date": "2019-04-03T09:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 305332,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7944621.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lsod-felix",
                "username": "lsod-felix"
            },
            "url": "https://myanimelist.net/reviews.php?id=305332"
        },
        {
            "content": "this awoke every maternal instinct in my cold, dead heart. at this point if i see even one (1) picture of kotarou i visibly melt this is the cutest show i've ever seen. \r\neverything about it is just tooth-rotting fluff, the children are endearing (i would d*e for kazuma he opens his mouth and i just go heart eyes), the side characters are all great, and the main brothers are just so sweet ;A; feel good story of the year 10/10 goat\r\n(just to note: there is a character [yagi] they imply is something terrible which he is not, in the manga his story is exploredmore and he definitely isn't what the show pretends he is, and i hope if (when? it better be wheN) there's another season they fix that storyline.)\\n\\n\r\nif you want a show that is just mindless fun that tugs on your heartstrings in a loving, cuddly type of way this is a great show to watch.",
            "date": "2018-08-29T16:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 287724,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5749292.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/vexahlia",
                "username": "vexahlia"
            },
            "url": "https://myanimelist.net/reviews.php?id=287724"
        },
        {
            "content": "TL;DR – Cute and fun school slice of life with a warm, mellow and pleasant atmosphere.\r\nBasic breakdown below ⬎\r\n== Impressions / Presentation: 6.5 ==\r\nThe art style can simply be described as \"shoujo aesthetics\", and it's most notable in its colour scheme and character designs. However, the designs are subdued enough so it doesn’t feel like the show is unnecessarily rubbing hot guys in my face. Rather, the aesthetics is where that warm, mellow and pleasant atmosphere comes from, and it does a good job getting that feeling across.\r\n== Story: 6 ==\r\nThere’s not much in the way of an overarching plot, but there is enough togive the show a sense of direction, and that is more than sufficient.\\n\\n\r\nStories within the (more or less) self-contained episodes are actually pretty nice. They're delivered in a simple way, but this actually makes them more effective at delivering the emotions and messages they want to communicate.\\n\\n\\n\\n\r\n== Characters: 6 ==\\n\\n\r\nThe series plays characters safe with noticeable tropes and simple personalities. But they're otherwise likeable and are generally fun to watch.\\n\\n\\n\\n\r\n== Enjoyment: 6 ==\\n\\n\r\nI like the anime, but the charm did wear off on me as it progressed. My commitment to the series basically came down to watching specific characters I had taken a liking to.\\n\\n\r\nThe show is nice, but there's otherwise not much else to say about it.",
            "date": "2018-04-03T23:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 276812,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879943.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/afwcal",
                "username": "afwcal"
            },
            "url": "https://myanimelist.net/reviews.php?id=276812"
        },
        {
            "content": "Gakuen Babysitters \r\nAKA: I think I just felt a little tug on my heartstrings\r\nThis is one of those ‘healing’ anime that helps you see the goodness in the world. It’s pure, it’s uplifting, it’s adorable. It’s not what you would call a masterpiece – it’s similar to watching a baby giraffe try to walk for the first time. Its clumsiness is part of what makes it so endearing.\r\nEven people who don’t tend to like little kids much – me, for instance – will find that this show appeals on a level you wouldn’t think possible. It’s hard to describe just how many times this seriesmade me smile, go ‘awww’ or dance around in sheer unrestrained joy at their adorableness. (In my head of course, I didn’t actually go dancing round.)\\n\r\nBut there’s more to the anime than just kiddy antics. It’s the reason Ryuji puts up with the kids, and the reason they love him.\\n\\n\r\nHe sees them as people. He doesn’t like cleaning up messes, changing diapers, or trying to stop a tantrum any more than the average person. He doesn’t enjoy not being able to spend as much time with his friends as he would otherwise, and he definitely doesn’t enjoy having his stuff ruined. But he loves the kids. He sees each tot as a human being with his/her own distinct personality, struggles, and likes and dislikes. They’re almost like family to him (Kotaro is actually family of course). Just being with them, seeing how they warm to him and come to trust and love him in return is one of the most purely satisfying parts of this show, and the reason I loved it so much. Ryuji is exactly the type of person that shines best when taking care of others, because of his gentle, patient and selfless nature. It’s also the reason he’s so good at it. His only fault is that he can be a bit too soft on the kids, but Kamitani and the others are there to balance that out.\\n\\n\r\nUsaida, on the other hand, has got to be one of the most irresponsible babysitters out there. Seriously, leaving a kid that small outside by themselves, what was he thinking? Sure, he didn’t realise they were gone, but that only makes it worse. It’s not like it was a one-off either. I know it’s meant to be a gag primarily used to highlight Ryuji’s heroism, but he should have been made out as a bit more responsible all the same.\\n\\n\r\nHe’s not the only character who’s a bit unrealistic. There’s the crybaby father, the child-loving deviant (as he’s so called in the anime), the weary older brother and the tsundere who thinks the kids hate her. Whilst none of them were integral to the story (except maybe Inomata, who got some decent development), they were rather funny to watch at times. I suppose they did provide a bit of a distraction from the kids every now and again by injecting a bit of drama, which was refreshing. The love triangle scenario was unnecessary, but that didn’t mean it was bad in this case. I did think it was rather sweet, and the innocent way it was shown was consistent with the innocence of the anime on the whole.\\n\\n\r\nThe real gem, though, was watching Ryuji and Kotaro’s interactions. It’s incredibly rare to see the loss of parents in anime handled so maturely, normally it’s just a ‘let’s ignore the fact that the parents are dead until it’s time for a tragic backstory arc!’. Here it was realistically done. Ryuji loved his parents very much, and truly misses them. He treasures Kotaro in their absence, and Kotaro in return thinks Ryuji exemplifies everything good in the world. Parental death in this case brought Ryuji and Kotaro all the closer as the only surviving members of the family, and the way they cherish each other is heart-wrenching. Watching Ryu try and raise his brother in place of their parents, and watching Kotaro try and help Ryu as much as his tiny little body is able, was beautiful. It’s love in its purest form, and I’m glad I got to see it.\\n\\n\r\nThe other members of their new family, the Chairwoman and butler Saikawa, are also great characters. The Chairwoman is a good person, even though you wouldn’t guess it at first glance. She looks like a crotchety old lady, doesn’t mince words and makes Ryuji and Kotaro earn their keep, but watch her long enough and you’ll see a little smile creep over her face as she watches them bring life back into the too empty house. She has the ability of giving over lessons that seem harsh, until you reflect on what she said and realise how much care and wisdom was behind it. Saikawa, too, has a lot more to him than meets the eye. He appears enigmatic, but is hiding a wicked sense of humour and a heart of gold. He helps them a lot more than they even realise. Both play a big part in Ryuji and Kotaro’s respective developments.\\n\\n\r\nWhat can I say about the rest of the aspects, like the sound and art? The sound is very tender and warms your heart. The voice actors, especially those that play the kids, are brilliant and really make you believe actual tiny humans are speaking. The art is mellow and has a lot of pastel tones and soft designs. The kids are ridiculously chibi, but that’s done on purpose to make them seem cuter. It works, too.\\n\\n\r\nAltogether I’m unreasonably glad I watched this. I’ll probably go to bed with a fuller heart for the next week than I have done in a while. And I think I might even like little kids more on the whole after this. If you want a pure, adorable and heart-warming slice of life about a day-care, this is the one for you. XD\\n",
            "date": "2018-03-28T18:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 275514,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=275514"
        },
        {
            "content": "Anime: School Babysitters\r\nGenre: Slice of Life, Harem (?)\r\nAge Rating: Good for All\r\nStudio: Brain's Base\r\nMusic: Ruka Kawada\r\nAuthor: Hari Tokeino\r\nDub/Sub: Subs\r\nEcchi Level: Non-Existant (There's one boob gag, but nothing even close to shows.)\r\nOoOoO\r\nFound this while browsing CR's show list and decided to check it out. And my Dende am I glad I did. This is very possibly the most adorable anime I've ever watched. Maybe I'm just biased because I adore kids, but this anime takes the cake in the category of cute. It's almost like the modern (and Japanese) adaptation of Rugrats.\r\nI might as well get the issues I had with the series out of theway first so I can gush later. First, I found it odd that all the episodes were untitled. That's like, a staple in anime almost. So seeing it happen here was very puzzling, but didn't detract anything from the show itself. Secondly, I groaned in agony when one of the first jokes in the series was a fart joke. HOWEVER, I can let that easily slide because it was the kids of toddler age making it, and they will always get a pass. And last of all, there was almost zero effort or time given to the young women crushing on Ryūichi. This is almost sinful, but given that it's only season 1, and it was aired only recently, which gives me hope that they will change this horrible lack of romantic emphasis.\\n\\n\r\nNow, onto the good stuff. While the animation wasn't anything to write home about, the kids in this show were drawn so adorably that I got a tooth ache every time they were on screen. Each one of them has a varied and unique personality that shines like a golden light after previous anime that I've seen. It amazes me just how simple this author created such distinct characters in kid form when most mangaka can only seem to write bland, hollow, or stereotypical characters. Seriously, I love them all. And the music, while it wasn't anything special for anime, it definitely fit the charming atmosphere of the settings.\\n\\n\r\nConsidering it's a slice of life, there isn't much story to judge. Ryūichi goes to school, then when he gets out of class he goes to watch the kids in the daycare while being oblivious to the non-advances of two (technically three) of his classmates. I suppose this allows the author to focus more on characters rather than splitting time between characters and plot. Whatever the case, it works well.\\n\\n\r\nBuuuut, at the same time, there is a lack of character development in two characters present throughout the anime. And that would be the ones crushing on Ryūichi, as I mentioned previously. I really wanted to see their characters develop more, but what I got was sorely lacking. I definitely hope they fix this is season 2, and I definitely hope there is a season 2. I do have to call out the author on making Ryūichi just as oblivious to love as every anime character in existence. Shit gets old man...\\n\\n\r\nThat being said, there was something I wanted to put this anime on a pedestal for. Two things actually. One was for actually portraying a varying amount of fathers in this series, which is stupidly lacking in anime in general. In fact, Kirin-chan's father was probably one of my favorite characters of all. Second, was actually portraying a poor family in everyday life, and the struggle they have to go through. Even if it was fairly short and limited to one episode, it was still cool of the author to do.\\n\\n\r\nHonestly...and again, this may just be my bias, but my favorite part of the entire series was the kids. I adored each one of them, especially Kotarō. Kid was the highlight of the show, and I think if you give this anime a watch, you'll agree. The entire interaction between teenagers and toddlers was amazing, and I really can't wait to see more.\\n\\n\r\nOoOoO\\n\\n\r\nTLDR: This anime was sweet enough to put an elephant into a diabetic coma. It doesn't have action, mystery, plot twists, or romance thus far. But even without all that, I enjoyed every episode of the short 12 part series. If you enjoy cute things like I do (if you tell anyone, just know that I have a certain set of skills to find you), then you'll love this.\\n\\n\r\nOoOoO\\n\\n\r\nSPOILER TALK:\\n\\n\r\nBest Girl: Midori Sawatari. I'd have liked to have put Maria Inomata and Yuki Ushimaru both in this spot, but as I mentioned above, there wasn't nearly enough time in the anime devoted to them for me to feasibly give them this role. Meanwhile, little Midori-chan stole the show anytime to camera focused on her. She was the cutest of all the kids, and I'm proud to say that she is best girl.\\n\\n\r\nReally, the only character in the show that I wasn't a fan of was Tomoya Yagi. He could have easily been my most identifiable character in the show due to his love of adorable children. However, the fact that he gets a nosebleed from being around them is...concerning to say the least. He could have just been someone who gushed too much over cute kids, but for some reason the author had to take that extra step to make him look perverted, and I don't really like that.\\n\\n\r\nLast thing I'm saying, Shizuka Kamitani is the hottest teacher, hottest mom, hottest everything in the entire show. She didn't get best girl because she is best woman. Holy Dende did I love every scene she was in.",
            "date": "2018-03-27T15:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 275368,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7096706.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/RiotDragonX",
                "username": "RiotDragonX"
            },
            "url": "https://myanimelist.net/reviews.php?id=275368"
        }
    ],
    [
        {
            "content": "Gakuen Babysitters. School Babysitters.\r\nIf you have a child or a baby and you need a babysitter, how should that person be? I would say, he or she needs to be a friendly, responsibly person. Let that sink deep in your heart. Please before you read my review. Take one minute. Think of a cute little child, which laughs and wants to be hold by you. In your arms. Saying that she or he loves you and you love your child too.\r\nBefore I watched the anime, I came across a few videos of Youtube, showing me how cute those little babies are. And yes, I wanteda baby after that. Because I am a girl and I guess it is in our nature, I haved strong feelings which were overwhelming. I cried during a few scenes. Maybe it is because the nature of woman or the author of Gakuen Babysitters is a good writer.\\n\\n\r\nThe first episode was heartbreaking. We have those brothers Ryuuichi and Kotarou which losts their parents by a plane accident.\\n\r\nRyuuichi, the older brother is looking after his younger brother carefully and lovley. \\n\r\nOf course they can't live alone. Ryuuichi is a student, doesn't have much money or time for looking after his younger brother Kotarou.\\n\r\nFortunatly a director of a special school gives them a new home under one condition. The school has his own \"kindergarten\" where teachers can bring their own childrens to the daycare so they can go to work. The elder brother just need to look after those babies as club activity.\\n\\n\r\nWell, so far so good. I think the animation is overall cute, the opening is okay.\\n\r\nBut what made me think bad of this anime?\\n\\n\r\nBefore I jump to my final argument I want to speak up to everyone to not be offended in any way. I think that the author just thought it would be funny or is \"harmless\", but this is my opinion and I couldn't watch it any further because my stomach hurt really bad. I wasn't feeling well and I think this isn't healthy.\\n\\n\r\nI have a big problem with the characters and with one I have the biggest problem.\\n\r\nI want to start of with the best characters in my opinion and those are the brothers Ryuuichi and Kotarou, the director and I guess her butler.\\n\r\nWell, I think the anime would have been deeper and more dramatic if Ryuuichi wasn't an A+ Brother because we are all humans and sometimes we get upset, angry and we cry a lot. I don't say that he needs to have a personality change but It would have been good seeing this lovely brother a bit angry about his sitaution but anyways, he isn't the main problem.\\n\r\nDespite of one of Ryuuichis friends (although has his younger brother in Daycare) who is a total douche for telling his younger brother that he hates him there is another schoolmate who is a pedophille.\\n\\n\r\nYes you read at right. Pedophille. The anime introduces him as the nice guy, the pretty guy, the handsome guy, the popular guy who is being loved by all girls in school.\\n\r\nHe wants to be part of the Daycare club activity. At first I thought he wants to be part of it just so he gets more attention by girls, but I was so wrong.\\n\r\nWhen he has his \"first playing\" with one of those daycare babies he gets overwhelmed by a feeling. Nosebleeding. \\n\\n\r\nEvery anime fan knows what nosebleeding means. \\n\\n\r\nAt first I wanted to forget about it and I wanted to continue watching, because I thought that because of that scene, this character would be the villian, a character everybody wants to hate. \\n\r\nBut no. \\n\r\nOf course he isn't part of the club anymore which is great. But his character\\n\r\nappeared again in the same episode, making him loveable and funny.\\n\r\nThe whole situation was made like a joke. \\n\r\nIf you haven't  had this disgusted feeling like me, so be it. But I can't go any further. I wanted to continue but another characters made me sick. \\n\\n\r\nWe have this \"father\" of twins, which dressed like a kidnapper and he appeard like that in front of his son. Ryuuichi seeing the situation runs towards them to protect the child. But the child was like \"meh, he is my father, I just recognized him because of his kidnapper outfit because he is famous and because okachan let me watch his horror/thriller movies\".\\n\r\nAhahahah. No.\\n\\n\r\nI don't want to write more. Just the pedophille argument is strong enough to drop this anime. Like I said, don't get offended and please don't message me saying \" You can't write a review if you did not watch the whole anime \".\\n\r\nI don't and I will not watch it. It is my opinion and I am hell right.\\n\r\nPedophilles should go to hell and leave our childrens in peace.\\n\r\nIf this isn't a real argument for you, you having the big problems.\\n\\n\\n\\n\r\nTschüß.",
            "date": "2018-03-27T07:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 275318,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2248197.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nurfee",
                "username": "nurfee"
            },
            "url": "https://myanimelist.net/reviews.php?id=275318"
        },
        {
            "content": "Gakuen Babysitters is a light and cute anime that surprisingly leaves a lesson for its viewer after each episode. It makes viewers appreciate life and all that comes along with it. It shows how even at a young age, challenges are there to be faced, and how we react to these circumstances, also leaves an impact to others (even the babies/kids in the series show this kind of growth). Almost all the episodes I've watched made me tear up... I just came to watch something fluffy and cute, but got much more than that. For anyone reading this, give it a try, it's worth it.",
            "date": "2018-03-03T06:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 272884,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PatissiereBear",
                "username": "PatissiereBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=272884"
        },
        {
            "content": "This show is odd in that the main driving force for the show and the reason you stay isn't necessarily the interactions like most SoL shows but the general cuteness the show radiates. The character designs for the older characters including the protagonist and the supporting cast were very good and were perfect for each character's defining trait like Ryu's design encompassing his compassion or Kamitani's being slightly menacing but approachable when the show needed it. The character designs of the kids were a bit weird when I saw them for promotional stuff but in the show, they worked really well for showing off howcute kids could be. Outside of that cute factor, the show also shows the problems of children like them being brats, gross, and outright annoying at times which reassured me at the beginning this wouldn't be a weird show that forces procreation on a population of youth that don't do so in Japan. \\n\\n\r\nThe story actually allows justification for how character's act like Ryu's compassion or \"bro-con\" to an extent due to his brother being his only family and how over the show he learns to let go a bit from his brother and focus on himself. However outside of this gradual development, not much happens that is really interesting. It's got generic SoL situations with the added twist of little kid(s) in the equation but it doesn't really use that to its advantage that much to explore ideas outside of the barebones message these shows contain. \\n\\n\r\nThe art is very odd at first as I described with the character designs but works very well in the context of the actual animation style and is overall very consistent throughout the show. Backgrounds and setting unfortunately suffer in this show as they never linger on them for long before transitioning into character shots and the few occasions where background or setting are spotlighted, its very bland artwork and almost lifeless in shots like the opening of the culture festival.\\n\\n\r\nMy biggest issue with the show outside of its sometimes bland moments is its sometimes atrocious sound design. One moment you have fine sound design with the character's speaking to one another and then all of a sudden the sound quality will dip into the nether realms when another character enters the scene. This issue was fixed as the show progressed but it was too jarring in certain parts for me to focus on the cute factor, the main driving force of the show, which is a huge problem. The performances of the VA's are also quite lifeless outside of the VA's of the children. Our main protagonist seems to only have one tone he ever speaks in outside of some shocking moments and outside of him its worse with character's speaking in only ONE way throughout the entirety of the show. If a character speaks in a high voice with overtly cutesy inflections on the end of her sentences, that is how they will always speak no matter the situation and it bothers me a lot. The music is also very generic and doesn't even bother giving me at least a catchy op or ed to latch on to. It's not bad music per say but its so bland and generic that it might as well be.\\n\\n\r\nOverall, my enjoyment for the series was high and my main grievances never truly took me out of the show but did bring it down slowly over its course. With another season, I could see this show developing its characters a bit more and having these cute kids into cute preschoolers would be fun and switch up the show when it's situations get bland. I don't think this show needs or really deserves another season though so this wish or desire is a mute point. Fix the sound design, add more variety to the situations you put the character's in and add some more good background/setting shots, with this I think we would have a SoL show on our hands but these issues unfortunately weigh the show down too much. With that, I give the show a 6/10 (fine) rating and implore the audience to seek this out only if the idea of kids being cute is very intriguing to you. \\n\\n\r\nSome more recs for SoL shows or fans of this I'd point them towards Kobayashi Dragon Maid, a show that has a kid character a bit older than the ones in the show that actually puts her in interesting situations, and Sweetness and Lightning, for those who really want the cute factor with kids but felt this show underperformed in that regard.",
            "date": "2019-03-22T13:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 304038,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6587031.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SergeantOtter",
                "username": "SergeantOtter"
            },
            "url": "https://myanimelist.net/reviews.php?id=304038"
        },
        {
            "content": "This show started as a heart warming slice of life show about showing the struggle and responsibilities of high-schooled  orphan boy trying to overcome those struggles while looking after his brother and that is a good thing. But in this series, pedophile character is represented as a joke and treated him like a normal person and that  quickly destroyed the potential of the show. I thought this pedophile will not include after episode 3 but he showed up again as a \"good\" guy.This show really have good pacing, good character representation and development except from that pedophile.This anime should have been on mytop favorite Slice of Life show list if the pedophile character is not represented as a \"normal and funny character.\" \\n",
            "date": "2019-01-02T15:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 297844,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7225656.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OlieAMK28",
                "username": "OlieAMK28"
            },
            "url": "https://myanimelist.net/reviews.php?id=297844"
        },
        {
            "content": "I am a two sided coin if you ask me about babies, kids, and children. Sometimes, I hate them and sometimes, I just freaking love them. Thus, that is a reason why I skipped this one last season because I thought the kids in this anime would be whiny and annoying. Boy, was I wrong? My cousin said to me that I should watch Gakuen Babysitters and I did. Now, I am barely alive from a diabetes.\r\nThe story itself is very family friendly as it explores majorly on brotherly relationship between Kotaro and his older brother Ryuuichi and let the story and other character developmentrevolved around them. But from there, this anime revealed a flaw that is a repetitive story structure. Every episode of this anime falls under the same structure : A problem with the side character ended with a resolution that will affect Kotaro and Ryuuichi's relationship and people around them. But because of that, this anime has a great character development for both brothers and characters around them. The best character development aside from the brothers is handed over to Maria Inomata as her interaction with the kids really helped her to overcome her social anxiety and even made the \"love rival\" as her own friend.\\n\\n\r\nAnd of course, the major surplus for this anime is located on its level of sweetness and cuteness. Everyone who has a soft spot for kids and babies would eventually died from diabetes as the kids in this anime are less whiny and so innocent at the same time. Added with that familial bonds with each other, this anime became a major sugar bomb for anyone who watch this.\\n\\n\r\nOverall, I like this anime because of its sweetness and cuteness. I would like to recommend this anime to anyone who just want to relieve their stress just like how cute cats and dogs videos did to them.",
            "date": "2018-06-22T20:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 281962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5318995.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Its-Maki-kun",
                "username": "Its-Maki-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=281962"
        },
        {
            "content": "It so much fun to watch this anime.\r\nThere were some parts in this anime that have been remove and added which made a bit different from the manga.\r\nBut, overall it was still fun to watch, cause the babies were too cuteee..\r\nThey are so adorable..\r\n1. The powerful boy Taka\r\n2. The pretty and smart girl Kirin\r\n3. The cute twin Takuma and Kazuma\r\n4. The cheerful girl Midori\r\n5. And the last one \"The Adorable Kotarou\"\r\nI loved to watch them messing around with Usaida or terrified when Kamitani (Taka's Big Bro) threatened them.\r\nBut, still my number one is Kotarou, I just want to hug him so hard.",
            "date": "2018-04-20T05:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 278547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6455366.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ninditya_md",
                "username": "ninditya_md"
            },
            "url": "https://myanimelist.net/reviews.php?id=278547"
        },
        {
            "content": "There are few series where the first episode gives me the feeling of “boy I'm going to love this”, and Gakuen Babysitters was definitely one of them.\r\nAfter a plane crash took away the life of the parents of our protagonist Ryuuichi and his brother Kotarou, leaving them behind, they ended up living in an academy thanks to the offer of the chairwoman with the condition of Ryuuichi becoming a babysitter of the school. This anime nailed the emotional impact of that tragedy and quickly made me root to these two characters in their new home.\r\nAnd that's definitely not the only time where this anime gaveme this feeling, together with all the sweet and adorable moments one would expect that will happen while taking care of the kids, it also throws some really touching scenes where you can see how the characters grew closer, and I definitely did too because it's hard to not get attached to them.\\n\\n\r\nThe cast of this anime caught me quite off guard in terms of numbers, together with the 5 kids and a baby (his brother included) Ryuuichi takes care of, there is also the other helpers at the day care, the chairwoman and her secretary, the other students who are friends of the protagonist, and all the parents of the kids, this creates a lot of different situations that the series properly uses to provide variety, and combined with how likeable and different each of them are makes the series a blast to watch no matter who gets the protagonism in that moment.\\n\\n\r\nBrain's Base shows are generally very appealing in terms of art style and this one was no exception, with nice backgrounds and character designs together with consistent, but not particularly impressive animation, the music didn't stand out much, but both OP and ED themes were good.\\n\\n\r\nGakuen Babysitters was a really enjoyable anime full of cute, touching and heartwarming moments, and a really likeable cast of characters, all in one package, I can't recommend enough to try it out!",
            "date": "2018-04-12T15:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 277889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4759794.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MetaThPr4h",
                "username": "MetaThPr4h"
            },
            "url": "https://myanimelist.net/reviews.php?id=277889"
        },
        {
            "content": "I had looked forward to this anime so much because I've been reading the manga for a long time and was so excited when they finally announced that an anime was on the way. Perhaps it was because I had such high expectations that I felt really let down and disappointed with the anime when I finally watched it.\r\nFirstly, I felt that the voices did not suit the characters very well and did not manage to bring out the characters' inner personality colours out. And I'm not talking about toddlers (I mean it isn't easy to voice for such a young child character like Kotaroor Taka) but characters like Ryuichi, the moms and the Chairwoman did not have very well-suited voices.\\n\\n\r\nThe art was simplified a lot, which again disappointed me but maybe it's because they were trying to keep things flat and simple as there are a lot of child characters. \\n\\n\r\nOverall, this anime is nice to watch when you have nothing else to watch and you like kids and fluff. But personally, I'd recommend you to read the manga instead because the feels are stronger there, the characters' inner voices are very clear and the life lessons are also more apparent. Somehow, even though the anime was pretty faithful to the manga, I felt that the life lessons were not very well conveyed through as compared to the manga. \\n\\n\r\nMaybe that's just me because I read the manga. My friend who did not read the manga thoroughly enjoyed this anime so go ahead and give this anime a go if the plot intrigues you! I hope you'll enjoy it more than I did!",
            "date": "2018-04-01T04:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 276250,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6215843.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/himawaripencil",
                "username": "himawaripencil"
            },
            "url": "https://myanimelist.net/reviews.php?id=276250"
        },
        {
            "content": "Gakuen Babysitters....\r\nIt feels good man, it feels good.\r\nIt is cute, and brings peace to my troubled soul.\r\nThe story is a simple one. A boy, Ryuichi, and his little brother, Kotaro, are orphaned and taken in by the older chairwoman of a school on the condition that Ryuichi helps take care of the school's daycare. Ryuichi and Kotaro make new friends and have good times. It's not complex by any means but it doesn't need to be, it's a Slice of Life anime. If you want something more complex, you're better off going somewhere else. If you come to watch this show, you come for thegood feelings.\\n\\n\r\nAs for the art, it's good for the show's purpose. It uses a lot of pastels and softer colors which is good considering it's just a heartwarming story about a teen trying to take of his baby brother and interacting with his classmates and small children. The art style also makes the kids he looks after EXTREMELY CUTE and I want to hug every single one of them. There aren't any amazing feats of animation by any means but to be honest, it doesn't really need it as I don't think it would really add much to the show's storytelling capabilities.\\n\\n\r\nThe sound in the anime is okay. The background music didn't really stand out to me much but I enjoyed the songs that went with the opening and ending. They were very cute and fit very well with the tone of the show.\\n\\n\r\nI liked most of the characters. None of them were particularly offensive. I liked that the female teachers were still working in spite of having kids. It seems common in Japanese culture for a woman to become a housewife as soon as she was married so seeing otherwise was refreshing. I liked Ryuichi and Kotaro's relationship. It was very sweet and genuine but I'm also glad that the show didn't shy away from the fact that Ryuichi sort of \"lost\" the complete freedom of adolescence because he has to take care of his brother all the time. Kamitani is also a total bro and great bromantic foil for Ryuichi.\\n\\n\r\nI really, really enjoyed this show. I feel like it's one of the few shows that I would buy on DVD just so I can watch it and feel good anytime. It was funny and it gave me diabetes....In a good way.\\n\\n\r\nOverall, I say to anyone reading this: Watch it. Good times will ensue\\n\\n",
            "date": "2018-03-30T09:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 275738,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5080773.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Areeta9",
                "username": "Areeta9"
            },
            "url": "https://myanimelist.net/reviews.php?id=275738"
        },
        {
            "content": "Gakuen Babysitters really resonate with me. Being a father of a 2 year old child I enjoy a lot of this show ALTHOUGH this is not a true realistic view of parenting - at all....\r\nFrom the babysitter who sleeps while taking care of children, to let them wander alone in a school to other neglectic matters not that important here.\r\nThis show, a pure slice-of-life / comedy, is a show about brotherly love that must cope with the death of their parents. This is why normal in anime losing parents and dealing with it (normally quite easy).  This way the first couple of episodes weget to see both Kotarou (the young boy) & Ryuuichi (the older one) dealing with that loss and trying to live by it. By the sixth or seventh episode that was over and almost it neither that subject come into play.\\n\\n\r\nAs the episodes pogress we get to know Morinomiya (a older woman who adopt them) and Saikawa (her butler?). We also get to know Hayato who befriends Ryuuichi althought he is a bit anti-social kind of guy but has a brother in the Babysitter club called Taka.\\n\\n\r\nTaka is the complete oposite of Kotarou. Taka is always running and smashing things while Kotarou is almost a statue. Probably or not, its interesting that Hayato punish his brother by hitting him in the head while Ryuuichi is more gentle and never resorting to violence. \\n\\n\r\nOne thing that really interest me was the children. First I thought they were mis-characterize. They talk a lot (althought small sentences) but also were very considerative (it's a word?) and with great awareness. One of the girls deduce Maria Inomata (our Tsundere) hated Ryuuichi but later understands that after he loves/likes him. I don't think a child of 3 has that capacity. But mine is not 3 years old yet....\\n\\n\r\nLets be real... children are smart but... my wife is blind and she has a guide dog. He don't understand that she is blind yet. He cannot phantom that BUT we teach him that the dog we have (Quickie) helps her. On what he do he does not know or why. From time to time he says \"a mãe tem doidoi nos olhos - o Quickie ajuda\" - roughly translated - \"Mommy has a owie in her eyes - Quickie helps\" but that's about it... sometimes when she goes against something and hurts himself he calls the dog to help her. They are funny...\\n\r\nSo when Kotarou went great length in episode 8 to grab a lemon because he thought Ryuuchi was feeling sick (cold) because Ryuuichi demonstrated a lot of pressure on what to answer to a girl who said she loved him - I laugh out loud...\\n\\n\\n\r\nThis show is not to everybody. Maybe people with young kids or people with young brother they have to take care off (episode 9) shows Hayato and Ryuuichi talk about that pressure and that difficult their lives in some ways I really resonate with it. Hayato says that he don't care about what his brother Taka broke but he knows he was being malicious and even asking for forgiving he knew he didn't meant it - that's so true man! But they are not malicious - they are kids and have to learn.. It takes time. I have great control on my stuff being a avid reader and with thousands books at home and boardgames but one time he scribble on one of my books but whose fault was that? his? It's mine. It's a kid... he doesn't understand value of things or why he can write on a blank page but not in a 40$ book. They are kids and we are the adults... so Youko (the old woman) teaches the boy and it was funny. I had the same thought. Gonna try sometime :D\\n\\n\r\nAs Kotorou says \"Little boys do grow up...\"\\n\\n\r\nReally loving anime. Slice of Life, Drama, Comedy & a bit of Romance (not that much). I say again. Slice of Life were great this season. It's a shame next season there aren't that many...\\n\\n\r\nSorry forgot to mention about art and such... Well in terms of Art the animation was great because it was focus on comedy and these cute boys and girls. The sound was okay I guess (love the kids voices).",
            "date": "2018-03-30T09:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 275731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4740367.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Paulo_Goncalves",
                "username": "Paulo_Goncalves"
            },
            "url": "https://myanimelist.net/reviews.php?id=275731"
        },
        {
            "content": "Gakuen Babysitters isn't a particularly flashy or drawing series.\r\nBut it is an extremely enjoyable slice-of-life series that's very heartwarming and cute.\r\nStory - 7/10\r\nArt - 8/10\r\nSound - 7/10\r\nCharacters - 7/10\r\nEnjoyment - 10/10\r\nOverall - 8/10\r\nThe show gets away with having some unremarkable characters by including a few standouts that are some of my favorite characters from this anime season. The art isn't very flashy, but it gets the key details right, especially in the small children. The slice-of-life stories and the sound get it done as well.\r\nOverall, Gakuen Babysitters exceeds in its subtlety. While it doesn't impress or \"wow\" in most cases, it stands its ground well.",
            "date": "2018-03-25T19:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 275087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6825749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tfreeman42",
                "username": "tfreeman42"
            },
            "url": "https://myanimelist.net/reviews.php?id=275087"
        },
        {
            "content": "Gakuen Babysitters has finished this Winter 2018 season. It was a different twist from the normal moe aspect of other anime I've seen. This anime is about a high school age kid and his baby brother who's parents has recently died. They then move in with they're older relative who runs a school, where the older brother joins the daycare club. Instead of watching cute girls do things, we, in its place, have babies. Just normal toddlers doing toddler things. Its sweet and heart warming. But it has a backstory that is darker then it should be. Its not like they ignore this fact either,they make note of it and how it affects the brothers. That's very mature of the show. I enjoy this show and give it a 7 out of 10. Its not like it changed my world view, but its a good thing to watch if you want something cute in your life. This has been your spoiler free but not really review on Gakuen Babysitters.",
            "date": "2018-03-25T18:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 275080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=275080"
        },
        {
            "content": "his would be a perspective from a college student who is stressed out 24/7 HAHAHA.\r\nAnyways, if you are looking for a light-hearted anime that aids in making you smile or relax and laugh, this would be the anime for you\r\nStory: 7\r\nThe story is somewhat repetitive where the babysitter club goes through various issues and problems ultimately always ending in a good way however, I enjoyed the fact that despite this different scenarios and such, we do get a glimpse of some of the characters background and life stories . As such, the character development and story in itself really is enjoyable.\r\nArt and Sound: 10\r\nThe Arthere is your typical anime design with big eyes and the babies as well being all cute and cuddly however, the music (opening and ending) I truly felt that it complemented the anime itself. Despite its surface level of happiness and humour, there is a hint of emotional development and the music enhances this I feel very well. The character voices I feel was spot on and it definitely elevated their character designs. I LOOOVEEE Kotarou's character design and the voice was spot onnnn\\n\\n\r\nAnyways, overall it was a 9 fr me really close to 10. The reason it ain't a 10 was probably due to some lack in character backstory (impt to note that the manga is still ongoing so this view may change) however, i feel it definitely deserves a 10. ESPECIALLY IF YOU STRESS AND NEED A BREAK FROM YOUR TESTS",
            "date": "2018-03-22T03:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 274515,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FujoshElly",
                "username": "FujoshElly"
            },
            "url": "https://myanimelist.net/reviews.php?id=274515"
        }
    ]
]