[
    [
        {
            "content": "Slapstick, Spice and everything nice. These were the ingredients chosen to create the perfect little story. But the mangaka, Hiroyuki accidentally added an extra ingredient to the concoction - Chemical X (pantsu). Thus, Mangaka-san to assistant-san was born! The episodic series contains 12 episodes with the duration of each being 13 minutes long. This is all it takes to create laughter, laughter and more laughter from its viewers. This was definitely a home run for Spring season and easily digestible since it’s comedy shorts and half the normal time for a standard episode. This is a gag-show at heart so don’t go into the seriesthinking there is some sort of plot.\\n\\n\r\nThe heart and soul of Mangaka-san to assistant-san is Yuuki Aito, a perverted young man and his daily life of being a Mangaka who is trying to make it to the big time. He lacks focus for the most part and normally finds himself getting off-track thanks to his careless free nature that always has him struggling to make the deadlines. To help him with his manga \"Hajecafe\" that is dedicated to his love of cute girls and their lingerie are the Assistants that also play a part to keep him on the straight and narrow in Sahoto Ashisu, the sadist. Sena Kuroi, the kodomo and Rinna Fuwa who is the normal one. All are later hired by his Editor and High School peer Mihari Otosuna, the tsundere. All the characters are twisted, in a good way. From here on out is just a roller coaster of hysterics.\\n\\n\r\nAnd immediately it gets straight into things without a proper introduction, which was sort off expected, after all, this kind of gag-show does not really depend on introductions, but for you to fully immerse yourself into the jokes and slapstick scenes. Right off the bat, you’re welcomed to Yuuki’s workplace, home and love-nest, all bundled into one location where the majority of the scenes take place. But don’t worry, that room will hardly take precedence as compared to all of the scenes which occur there. This is where the magic happens.\\n\\n\r\nZexcs studio did a great job with this adaption, not only does it look like the source material but it also follows it closely. The visuals are super clean, bright and vibrant and the animation is consistent. The designs of the characters add to the contrast of the series, such a colourful cast and all fitting the look of their personalities very well. Most ecchi tend to step over that fine-line with a heavy amount of scandalous character designs but it did well to keep things standard. The art of the facial expressions and also how it was animated made the characters reactions priceless and many segments much more hilarious. \\n\\n\r\nThe Opening song, \"Junsui na Fujunbutsu\" by StylipS sets the mood instantly, just a fun and catchy song. Since it airs early morning for me, the song wakes me up like a cup of coffee. The soundtrack overall compliments the dialogues and makes most of the comedic moments and punchlines even more of an enjoyable experience. The voice acting for the characters fits superbly, they are all on point and fit each character’s personalities. I found that Yoshitsugu Matsuoka who plays Yuuki's character did a fantastic job, he really brought that character to life and made the 'over the top' moments in an excellent manner without overdoing it. The Ending song, \"Spica\" also by StylipS is a much calmer and peaceful melody, I was expecting something that keeps the happy vibe going but I'm not complaining. \\n\\n\r\nI like the fact that the producers were very daring, some of the scenes here are NSFW. I really like this show because of the fact it follows a real-life setting, and it’s always great to have an anime like this to have a break from some of the other genres. In conclusion, Mangaka-san to Assistant-san is a nicely executed and an excellent comedy series that has become one of my favourites of the season. I would feel really comfortable recommending this to anyone that is a fan of comedy, which should mean everyone, I mean, who doesn’t love comedy? If you are looking for a fun show that’s rich in humorous moments that make you laugh so hard that it hurts than look no further than here. \\n",
            "date": "2014-06-23T11:11:00+00:00",
            "helpful_count": 91,
            "mal_id": 148229,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3264993.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/papsoshea",
                "username": "papsoshea"
            },
            "url": "https://myanimelist.net/reviews.php?id=148229"
        },
        {
            "content": "Mangaka san to Assistant san is a slice of life harem comedy depicting the life of a perverted mangaka who makes the monthly manga \"HajiCafe\" with his assistants. It's a nice comedy. The animation and art is pretty good and the characters are all likeable.\r\nStory 7/10:\r\nNot much of a story. The 12 episodes pass by showing different situations of the team. Just like in Lucky Star, Danshi Koukousei and Nichijou, this anime also shows different skits. Almost every skit is funny and nice to watch.\r\nArt 9/10:\r\nI really enjoyed the animation and artwork of this anime. The character designs were really amazing. It looked kinda likethe average anime should. Not much fancy but not too dull to make it look bad. Nonetheless, the character designs are really amazing for a short anime series. Really enjoyed watching the characters.\\n\\n\r\nCharacter 8/10:\\n\r\nOur protagonist and mangaka, Aito Yuuki is a pervert. Not those perverts which you hate but one of those who are cool and funny. He can be thoughtful sometimes but his pervertness ruins the mood. A really funny character.\\n\r\nEach of his assistants has her own special personality. Some of the girls get more screen time than the others due to their importance or relation with Aito. But each girl gives the show it's own unique twist. \\n\\n\r\nEnjoyment 8/10:\\n\r\nJust as enjoyable as any other comedy anime. You've got your average events in check e.g. beach event, hot springs event, Take care of me I'm sick event etc. The animation is really nice and comedy is laughable. It's quite an enjoyable short series which is a good time pass with loads of laughter.\\n\\n\r\nOverall, a splendid comedy short to watch with a nice dose of eye candy.",
            "date": "2015-02-05T09:48:00+00:00",
            "helpful_count": 59,
            "mal_id": 179713,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017315.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AbsarNaeem",
                "username": "AbsarNaeem"
            },
            "url": "https://myanimelist.net/reviews.php?id=179713"
        },
        {
            "content": "This is an anime about a man and his dream. His dream of panties. Seeing panties, smelling panties, touching panties.... Yeah that's honestly most of what this show is about. Oh, and a there's also little stuff about making manga. But it's ecchi manga about panties anyway. Each episode is divided into three or four different scenes, and almost all of them deal with panties and Aito's love for them in one way or another.\r\nThis is a harem anime about a mangaka of an ecchi manga and the girls around him. His three assistants (though two are hardly ever seen actually helping his manga atall), his editor, and several other minor characters. The main character, Aito, is absolutely ridiculous. His emotions seem bipolar and he can quickly flip from being a perverted idiot to a sympathetic and kind mentor in the blink of an eye. His voice during many of the perverted scenes gets so high it's annoying (though I will give credit to his voice actor for having excellent vocal range) yet at other times he can be quite likable. He has balls of steel and, unlike many male protagonists in ecchi anime, has almost no fear of asking to see a girl's underwear or to touch them (in fact he even succeeds a couple times).\\n\\n\r\nAs for the girls, they are mostly archetypal, though they do break out of their archetypes and become unique on several occasions. Aito's main assistant, Ashisu, is the girl who least fits into any archetype. She is Aito's main love interest (of course she would rather die than feel the same way about him). Being an assistant, she has dreams of debuting and becoming a real mangaka. She has a love-hate relationship with Aito which can range from her going along with his perverted schemes to acting like a dominating yandere around him. Mihari is Aito's editor and friend from high school who has long had a crush on him. Aito has no clue of course because Mihari is your typical, lovable tsundere. Rinna, a well-endowed airhead, and Sena, a spoiled-rotten weakling, are much less important and only have a few important scenes despite being main characters.\\n\\n\r\nThe animation is fairly well done for an ecchi anime. Despite all of it's focus on panties, the amount of ecchi content is probably not as much as you're expecting. There are more moments with sexual innuendos and Aito asking to see panties than there are actual moments of near-nudity. The character designs are average and since most of the anime takes place inside of Aito's apartment studio, the characters are usually seen close up and tend to avoid being shown with minimal detail when far away from the viewer like many shows do to save some of the animation budget. Still, this means there are not too many scenery changes, though there are still a beach/hot spring episode and several trips to lingerie stores in the mall. As for the sound, the music is typical an for ecchi and comedy anime. Most of the time it is light-hearted, but it can get intense to match Aito's bizarre outbreaks. Still, it does nothing more than fit the mood fairly well at the time and is often unnoticeable.\\n\\n\r\n\"Mangaka-san to Assistant-san to\" is a fairly entertaining, simple, and short (12 minute long episodes) ecchi comedy. If that's all your looking for, then you've found something you'll enjoy. If you're looking for one of the best ecchi shows out there, or something with tons of nudity, then you'll probably be disappointed. The show does get a little better as it goes and as you grow somewhat attached to the characters (I personally enjoyed Mihari with her crush on Aito the most and I was happy that there was an entire episode dedicated to that). Also, if you're going into this expecting a lot of focus on making manga, you would be better to check out something like Bakuman as this only occasionally focuses on how tiring the process can really be.",
            "date": "2014-06-23T12:05:00+00:00",
            "helpful_count": 46,
            "mal_id": 148243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=148243"
        },
        {
            "content": "Mangaka-san to Assistant-san to The Animation, is simply an anime about a guy named Aito who is a manga artist, and works closely with various people, such as Ashisu.   The show has a harem-like feel since it is a 'one guy, lots of girls', but no matter how perverted Aito is, he does not have any intention to do any of the girls wrong, even if what he says and does, comes off the wrong way.\r\nStory:   To be blunt, there is very little story to the show, aside from Aito being a perverted manga artist, and Ashisu wanting to be amanga artist herself.  From the first episode to the last, there is no real progression in the story.\\n\\n\r\nArt:  I do not know how to properly describe it, but the style is a nice and simple design that is good overall.  The many exaggerations used in different cases, along with the facial expressions when certain things were said, were well done.\\n\\n\r\nSound:   The music, although minimal, was fine, and the sound effects used for many awkward and non-awkward scenes, were perfect.\\n\\n\r\nEnjoyment:   I enjoyed the show because it had the right mix of silly and perverted humor, without overly using the typical ecchi things like 'guy falls on girl and gropes breasts' or 'guy bends over to tie shoe and looks up at girls panties', so it gave it the right amount to be enjoyable, without being too overly weird or creepy.\\n\\n\\n\\n\r\nOverall, the show was not bad.  The only gripe I have with it, was simply that the episodes, were only 13 minutes long, instead of the usual 24 minutes.   So in short, if you enjoy silly and perverted humor that doesn't have the overload of ecchi cliches, then you should enjoy this.",
            "date": "2014-10-12T16:02:00+00:00",
            "helpful_count": 40,
            "mal_id": 164593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666651.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LawfulEngineer",
                "username": "LawfulEngineer"
            },
            "url": "https://myanimelist.net/reviews.php?id=164593"
        },
        {
            "content": "Welcome to the 13 minute classic - Mangaka-san to Assist-san to The Animation.\r\nStory: 7/10\r\nThe story in itself isn't anything special, of course. It follows the perverted, young mangaka Aito Yuuki, which, because of his lack of zeal, is about to miss the deadline once again.\r\nThe story is pure comedy, so I don't really mind if its not worked out perfectly.\r\nArt: 7/10\r\nCute character designs, as well as good backgrounds and just as good animations definitely help making a good anime. Just like in this case. The colors are lively, the qualitiy is consistent, nothing to rant about.\r\nSound: 8/10\r\nKugimiya Rie in action. I think I don't needto tell much. But since I like her, I'll do so nonetheless.\\n\r\nThe CVs are top notch. The seiyus of Kirito/Sora, Kagura/Louise/Shana, Haqua/Yotsugi/Yukino as well as Tsukihi/Index just deliver. Newcomer Noto Arisa does a good job as well.\\n\r\nNext, openings and endings. The opening \"Junsui na Fujunbutsu\" stood out and perfectly sets the mood for the 13 minutes to come. The ending on the other hand, while still a good song, is rather unmemorable.\\n\r\nBGMs suffer from the same cause. Good, but unmemorable.\\n\r\nThey do complement the anime though.\\n\\n\r\nCharacters: 8/10\\n\r\nThe characters aren't new at all, instead, they're pretty much archetypical, yet still really likeable. The interactions between the characters are hillarious, but the characters miss a bit of background story. There IS backgroundstory, yes, but not that much. But then again, its an comedy anime. My personnal favorite Sena got me to the 8 points though. The second-best role of Kugimiya Rie up to date, with only Kagura being even better, but not as loveable though.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI ended up laughting every episode, so why not 10 points? Because this anime also holds the hardest borderline experience of all anime. (***SPOILER***) Beware of Episode 8 (***SPOILER END***) It really gave me the creeps, but at the same time made me jealous...\\n\\n\r\nOverall: 8/10\\n\r\nDefinitely a great comedy anime to calm down. Having just 12 episodes á 13 minutes predistines it as a filler to calm down, or when you want to relax on some busy days.\\n\r\nRecommended for nearly everyone, who doesn't mind a fair share of ecchi and dirty jokes.",
            "date": "2014-07-23T07:45:00+00:00",
            "helpful_count": 19,
            "mal_id": 153367,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2505579.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Play2X",
                "username": "Play2X"
            },
            "url": "https://myanimelist.net/reviews.php?id=153367"
        },
        {
            "content": "\"Pantsu are number one!\" -Aito Yuuki\r\nThis slice of life - or rather, a slice of a perverted mangaka's life anime contains a wonderful mix of colourful characters, absurd settings and best of all: the erotic, crude humour. Slap all these ingredients together, and you bake up this tasty treat: Mangaka-san to Assistant-san to: The Animation, almost guaranteeing laughter in every episode.\r\nStory:- 6 out of 10.\r\nYou really wouldn't expect it to be driven  by plot given it's premise and so it follows the main character; Aito, an extremely perverted mangaka; and his assistants in their chemistry of daily happenings. Humour is the central concept thatdrives this anime with some sub-concepts here and there.\\n\\n\r\nArt:- 7 out of 10.\\n\r\nThe art is solid, crisp, consistent and sensible. The animation smartly split into sections (to match the manga's structure), which keeps the anime fresh so it doesn't get stale over the 13 minutes. The body language, facial expressions are very well done.\\n\\n\r\nSound:- 8 out of 10.\\n\r\nI feel like this is one of the winning point, no, not the catchy music, not the beautiful OSTs but the voice acting. They definitely got the perfect voice actors for each of the characters. The way they express through voice is flawless, this is especially true for the main character Aito (Matsuoka, Yoshitsugu or Kirito from SAO, yeah.. I know). A mesh of tone, amplitude and pitch really sets the mood and allows you to properly connect to the anime and its scenes for example: you could just listen to the audio and figure out what they're doing.\\n\\n\r\nCharacter:- 8 out of 10.\\n\r\nIf you could describe the anime's two winning points as a one-two punch: one being the voice acting, then two would definitely be the character chemistry and interactions.\\n\r\nThe characters themselves all hold true to the generic band of tsundere, sensible girl, loli, and etc. However with the dynamics being in harmony with the magnificent voice acting, it really packs the punch when the characters interact with each other and differentiates themselves from other anime's by giving each of the characters distinctiveness: e.g. Ashisu's S side. I feel like this gives a better comedic sense in the anime i.e. certain reactions would only work between characters which have built up a certain relationship and this works with Mangaka-to because they communicate well.\\n\r\nThis being said, there is almost no character development except for maybe one or two other characters.\\n\\n\r\nEnjoyment:- 10 out of 10.\\n\r\nDespite being 13 minutes long, and something I first didn't think would be worth watching - oh boy was I wrong on so many levels. I would always anticipate for the next episode and would wish the episodes would be longer - and hope for a 2nd season. Definitely recommended for people who love perverted humour in strong small segments. It's very unfortunate this is overlooked and underrated.\\n\\n\\n\r\nSo wrapping it all up I think this anime is very deserving of a 8 out of 10, despite its weak plot, the voice acting and character dynamics really pull through an extremely good sense of humour.\\n\\n\r\n(N/B: The scoring system I used is relative to it's genre,)",
            "date": "2014-06-24T05:23:00+00:00",
            "helpful_count": 17,
            "mal_id": 148341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3818459.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/junpants",
                "username": "junpants"
            },
            "url": "https://myanimelist.net/reviews.php?id=148341"
        },
        {
            "content": "Spoiler Alert: \r\nLoved this anime from the first episode and I wanted more. The best part of the show has to be the sounds and I do say I have never heard anything like it. The way the sounds and reactions of the anime characters progressively get better is captivating.\r\nQuite like another anime I know 'Bakuman' only with art aspect; with the short glimpses of artwork some of which is detailed in this anime come across my mind when doing my artwork I found it even more appealing and oddly motivating.",
            "date": "2014-07-11T22:30:00+00:00",
            "helpful_count": 13,
            "mal_id": 151615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/314093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cxp0_0shaw",
                "username": "Cxp0_0shaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=151615"
        },
        {
            "content": "Ok, time to make my review.\r\nPoor 3.\r\nStory- Co'z I find the plot pretty simple and most of it were pretty random to say the least, and that's as simple as I can put it. \r\nDecent 4.\r\nArt- Well, despite of some fanservice, I guess I could forgive this anime, since such thing doesn't make it too erotic.\r\nGood 7.\r\nSound- I have no problem as who did who about the character's voice, also I kinda like the opening, but not the closing, and that's as simple as it is.\r\nCharacter- I may have hated Aito as this perverted predator, but he is one predator that I like, since itwas his predatory acts that make this anime funny.\\n\\n\r\nAlso, Ashisu does compliment Aito's funny antics as a victim who knows how to keep him at bay that adds to the gag and Mihari whom Aito fears the most, of course given that this anime has a harem genre won't be complete without a sadistic tsundere, Rinna and Kuroi were the quintessential bimbo and cute tsundere who as always completes the harem, but it too bad that more screen time are allocated between Aito and Ashisu which at time disgusted me .\\n\\n\r\nEnjoyment- Well, the anime maybe 13 mins long per episode, but with such comedy that make me laugh despite of its naughtiness was well worth it.\\n\\n\r\nOverall- It's good though, but since the anime depends on such naughtiness, I can only give such score, since it only rides on the male character's perversion.\\n\\n\\n\r\nBTW: This is another repost.",
            "date": "2014-08-08T07:55:00+00:00",
            "helpful_count": 12,
            "mal_id": 155785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=155785"
        },
        {
            "content": "OOOOOOH, that was sweet another harem theme anime has ended, so time to make my review........and I'm gonna keep it simple.\r\nStory, Enjoyment and Overall: Very Good.8.\r\nOk, there isn't any story at all its just a plot where it revolves around a perverted manga artist and his pretty assistant, even so the plot alone was sufficient enough to carry this anime's 13 min per episode around, sure there were the usual fanservices, but I have to admit it really does add to this anime's enjoyment and I really have no reservation to give this anime's overall  a high score.\r\nArt: Good .7.\r\nIt's the ecchi and Ido mean the ecchi that for me is the good part of this anime, especially when we talk about the fanservice.\\n\\n\r\nSound and Character: Fair.6.\\n\\n\r\nWell.....for the sound, I have no qualms as to who did who about the character's voices, except that i kinda like the opening theme, but not the closing.....well except the last one where it was Aito who sang \"Endless Panty\" was really funny and frankly I look forward of downloading it as soon as links are available. As for the characters.........let's put it in this manner:\\n\\n\r\nAito Yuuki- The thing about him was that his character really can't hold on its own without his harem around, now Ashisu can provide such stability but not enough, which is one reason why this category deserves such score.\\n\\n\r\nAshisu Sahoto-  The impact of her character really depend on Aito for this anime's comedy genre, now let's face it eventhough her character was to keep Aito in check and keep her sexual advances at bay, it was those very things that gives her character such impact.\\n\\n\r\nMihari Otosuna- Also another character that's supports Aito as the main protagonist (ok so he's a bit of a predator), but, her being this tsundere really gives Aito the impact it needs to add to this anime's comedy genre.\\n\\n\r\nSena Kuroi- As they say every pervert needs a good victim, and as much as I hate to say it she kinda serves that role as the unwilling victim of Aito's perversion.\\n\\n\r\nRinna Fuwa- well let's just say that she serves as the town bimbo, though it unfortunate that her role was a bit limited, which is one reason why it is another reason why this category gets such score.\\n\\n\r\n Matome Minano and Sahono Ashisu- Another characters who kinda be this wanna be victim but cannot.\\n\\n\\n\\n",
            "date": "2014-06-23T12:49:00+00:00",
            "helpful_count": 11,
            "mal_id": 148249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=148249"
        },
        {
            "content": "This. This is how ecchi should be done.\r\nNow before I go onto my review about Mangaka-san to Assistant-san, I want to preface by saying that this show will go over a lot of people’s heads. Ecchi is usually either a big hit or a complete whiff; that’s the reality. And for me, it was a homerun.\r\nMangaka-san to Assistant-san is formatted with 13 minute long episodes. Many people may question this, as we are all accustomed to the usual 23 minute setting, but regardless of its short length, this show managed to maintain an astounding “laughs per episode” for me (if I were to pull anumber out of my ass, I’d say I laughed out loud at least 10 times each episode).\\n\\n\r\nUnlike a normal review, I will not go in-depth about the production quality like animations, sound, plot, scripting, etc. Why? This is a comedy. An ecchi one, to be exact. It has only one objective: make the viewer laugh. \\n\\n\r\nSo if I were to make a concise statement about the production quality of Mangaka-san to Assistant-san, I’d say: “nothing worth mentioning”. The sound was a bit poor, and the art, excluding the characters’ reactions to gags, was sub-par. The voice acting was decent, fitting the characters well when they went off on their antics, but the scripting was sometimes awkward, and the character development was little to none. In reality, if I were to rate this series based solely on the aspects mentioned above, this wouldn’t even get a 4/10.\\n\\n\r\nThe aspect that really made Mangaka-san a success was the humor. I felt my ribs were in stitches at the end of every episode, and really lifted my mood whenever finished an episode. Bottom line, it’s fucking hilarious.\\n\\n\r\nBut if someone were to ask me if they should watch this series, I would hesitate because this kind of comedy is gold to some, while utter horseshit to the rest (also, if I knew them in real life, they may question my well-being). So what is my final verdict? Spare 13 minutes out of your life and watch the first episode. You liked it? Continue. Hated it? Go watch something more serious like Bakuman.\\n\\n\r\nFinal score: Elevator scene/10.\\n",
            "date": "2015-11-27T16:05:00+00:00",
            "helpful_count": 9,
            "mal_id": 204291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4792203.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/amb1d3x",
                "username": "amb1d3x"
            },
            "url": "https://myanimelist.net/reviews.php?id=204291"
        },
        {
            "content": "Pantsu Pantsu Pantsu. \r\nIf I could comprehend this anime into three words it will be those magical, hallucinating words- Pantsu. \r\nMangaka-san to Assistant-san to, as the name suggest is an anime about a Mangaka, Aito, and his female assistants. It is a complete fun ride, I had a blast watching this anime. A very light hearted harem story with just right amount of graphic ecchi to make it funny but staying away from overdoing. I would recommend it to anyone looking for a good laugh, especially to a guy. \r\nBeing a 13 min per episode ecchi-comedy there is not much to expect from the story.Each episode is divided into 3 plays and each of them plays out different from the other one. Though the next episode does picks up the elements devised in the last one, story is still not the strong point of Mangaka-san to Assistant-san to. \\n\\n\r\nIf you have ever at a point read the manga, you would definitely notice the difference in art style. And luckily a difference that makes stuff even better and interesting. The characters are drawn in a slender, stereotypical anime form yet retaining all their charm from the manga. On the other hand, the sound is good. No complains to that side, its nothing too big to talk about but its just right and its right there. \\n\\n\r\nFor a 13 min episode you can expect a lot of character development of all major characters, there is nothing to fear and to drift towards manga. The anime did a really good job to define all the characters well into their position. The voice acting is superb, especially the main character. He would definitely hit a lot of punches right at the moment you least expect them. Even though the main character is the titular Mangaka, the cards are easily stolen by the awesome side characters. Even the typical tsundere of the show is extremely enjoyable. \\n\\n\r\nTo conclude I would say, it might not have been my one anime I was waiting eagerly the whole month. But damn- it was hilarious.",
            "date": "2014-06-26T11:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 148757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2579473.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lucax",
                "username": "lucax"
            },
            "url": "https://myanimelist.net/reviews.php?id=148757"
        },
        {
            "content": "It's a cute show, it knows what it wants to do and does it pretty well. Animation isn't that good but that's not the important part. The characters interactions are funny and adorable and there are some heartfelt moments. The panties obsessed MC is very funny and likeable, and the show doesn't go too overboard with is obsession. The other characters are mainly just the generic tropes; tsundere, airhead, and loli, but they are all very likeable and funny. In the end its a nice 12 episode 13 minute show, if you have some free time it can easily be watched in an afternoon.",
            "date": "2015-11-06T14:12:00+00:00",
            "helpful_count": 8,
            "mal_id": 202808,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4444138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Original_Don",
                "username": "Original_Don"
            },
            "url": "https://myanimelist.net/reviews.php?id=202808"
        },
        {
            "content": "The Comic Artist & His Assistants\r\nArt: For a show that is pretty much just an animation of a manga, it had pretty good art. While the characters were pretty generic when it came to how they were drawn and how they acted, it was cute to watch them interact with each other, even if none of them were particularity intelligent. The landscapes were not varied hardly at all, almost every episode took place in the room of Aito, but every so often they would go somewhere else for maybe a minute or two. There was a single episode when the crew went to a hotspring and inn, it was nice to have a change of scenery. \\n\\n\r\nMusic: Music really did not play a major part in this anime adaptation. Really the only music there was, happened to be in the intro/outro and very softly in the rest of the show. Most of it just felt so repetitive though, it really took me out of the world to listen to the same song over and over again, rather than having a little bit of variety. \\n\\n\r\nStory: What kind of story can be told in twelve, 13-minute, episodes? Not a very good one sadly. While really this is just “in the life of Aito” there was no real story to speak of. Aito is always late and his publisher is always pissed. Aito is a pervert that only thinks about panties and boobs. That being said there is a lot of fan service in this show, however it is more just the clothing rather than girls in those pieces of clothing. There was a bit of charm to this however, Ashisu and Aito have an interesting chemistry that is really lovable and the episode where her little sister comes to visit has to be my favorite. \\n\\n\r\nPersonal Reflection: I had no prior knowledge of this show before going into it, and I really wasn’t sure what to think after the first episode ended. But I kept watching because the episodes were short and I liked the way the characters interacted. Sure, Aito is a pervert and the joke is a bit dry, the characters aren’t at all original, and overall this is pretty much a rehash of some other shows that did it better, but aside from all that it was still a show that was fun to watch and easy to laugh to. If you are a fan of the cheesy and cliche, then check this one out.\\n\\n\r\nOverall Score: 6.8/10",
            "date": "2016-05-06T20:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 218053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4688864.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Chiburo",
                "username": "Chiburo"
            },
            "url": "https://myanimelist.net/reviews.php?id=218053"
        },
        {
            "content": "Somewhere in me is a cynic that I refuse to give in to, because I don’t want to make the mistake of judging shows by their cover. And every so often, I have reason to be optimistic, as a number of shows I’ve doubted have proven to be not just pleasant surprises, but fantastic works in their own right. But damn it, Japan, when you release shows like this, it’s very hard to stay positive.\r\n‘The Mangaka and His Assistants’ focuses on the daily lives of manga artist Yuki and his all-female assistants. When he’s not drawing manga, he’s usually trying to subject them to hisperverted desires. Among the assistants, Rinna would go along with him if Sena, Mahiru, and Sahoto aren’t there to stop her, while the latter three thrash him for his advances. This is the entire show, and unfortunately there are deeper problems than the humor not being to one’s liking.\\n\\n\r\nA major problem with The Mangaka and His Assistants is its cast lacks development, personality, or anything I could use to call them interesting. Everyone who isn’t Rinna has two personalities, with nothing between to make those two sides believable as part of the same person; Yuki is perverted then nice, Sahoto is indifferent and then motivated, while Mahiru and Sena are basically the same character, feisty on the outside but warm on the inside. Not that Rinna is any better, because the way she would accept Yuki’s advances were it not for the others is disturbing.\\n\\n\r\nIt isn’t just a lack of development, but how much that development doesn’t make sense. Yuki is relentless in his perverse advances and Sena, Mahiru, and Sahoto all bash him for it. Makes sense. What doesn’t make sense is Sena and Mahiru showing signs of falling for Yuki, supposedly because he’s a nice guy despite his perversion, except that even in flashbacks, we don’t see enough of Yuki being that nice guy. The only one who doesn’t fall for Yuki is Sahoto, and even then she’s supposedly going to stay with him because she pities him. Yeah. Really.\\n\\n\r\nIt gets even better when the show tries to justify its lack of development in favor of Yuki being perverted. His main reason for making manga is because he wants to draw panties, and Mahiru points out that the reason his manga is losing popularity is because he’s focusing too much on panties and not enough on the story. Quite frankly this sort of self-referential humor only works when the show is at least decent, but do things sound even decent so far?\\n\\n\r\nBut fine, clearly asking for decent characters is too much. Too bad the humor can be outright repulsive. There is a scene where Yuki is crossdressing so he can understand what it’s like being a woman. After being shrugged off by his assistants, one of them falls asleep. He then tries to breast feed that sleeping girl so he can ‘also’ understand what it’s like being a mom. The girl wakes up with a mouthful of man chest and promptly thrashes him. This scene was so uncomfortable I had to stop the episode. Comedies are not supposed to do that.\\n\\n\r\nActually, most of comedy in this show—and by extension, most of the show itself—is just uncomfortable. Between the brand of humor, lack of development, and self-awareness, I sometimes wonder if the show is just poking fun at the reason people watch ecchi shows. Are we supposed to go ‘good thing I’m not part of that audience!’ or ‘at least I’m not as depraved as that guy!’? Maybe some people can find this funny, but I don’t. All the humor did was remind me of people who really can’t divorce reality from fiction, on top of reinforcing bad stereotypes of Japanese animation.\\n\\n\r\nThe animation itself is serviceable but nothing impressive or distinct. But aside from the lack of inspiration to differentiate between Sena and Mahiru, the characters designs are at least pleasant to look at thanks to somewhat vibrant colors. The sound isn’t all that great either, lacking much of a proper soundtrack, but nothing is particularly out of place. The aesthetics of this show on a whole are just really, really standard.\\n\\n\r\nI just wish I could describe this show as even being ‘standard.’ While I wasn’t expecting something groundbreaking, I did expect a reasonable story or at least some decent characters. Unfortunately there’s uncomfortable humor in place of development on top of the show trying to shrug off its own faults. Even if you’re an ecchi fan—no wait, ESPECIALLY if you’re an ecchi fan—skip this patronizing, heartless garbage.\\n\\n\r\nI say ‘heartless’ because even something like Mayo Chiki really tries. Amagami tries. Mashiro Symphony tries. This show doesn’t. It doesn’t understand that panties and fanservice only go so far, because what any kind of show needs is heart. And for The Mangaka and His Assistants, it isn’t something they’re going to have no matter how many times they go back to the drawing board.",
            "date": "2015-02-02T06:51:00+00:00",
            "helpful_count": 6,
            "mal_id": 179496,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/396401.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/iSuckAtWriting",
                "username": "iSuckAtWriting"
            },
            "url": "https://myanimelist.net/reviews.php?id=179496"
        },
        {
            "content": "Anime shorts are a very interesting genre of anime.  They can vary from a wide range of topics and ideas, as well as their run times, such as Pupa with its four minute run time, and Tonari no Seki-kun with its 7-10 minute run time.  Today, Mangaka-san to Assistant-san to The Animation.  An...interesting short with a 12-13 minute run time.\r\nStory (7.22/10):  A ecchi manga artist and his four assistants.  That is literally the plot.  Throughout the span of the 12 episode run length, the show varies from topic to topic, as with most episodic anime, ranging from several shortstories within one episode of its small run time, or one big one that spans the whole of the episode.  \\n\\n\r\nWhat I think this show does well in, is the fact that the show doesn't stray from what it was trying to do.  From the first episode, it kept a consistent theme of what it wanted to be, and didn't stray far away from it.  While every episode is about different things, the show keeps itself at bay with its central plot points and figures, that works quite well.  \\n\\n\r\nApart from that, there's not really much to say.  It's a shorts series, and there's nothing really more to say about it other than the fact that well, it's a good time killer if there ever was one, as the show never creates any deep plot that one has to follow and there's not much to remember apart from the characters' names.  \\n\\n\r\nOverview:\\n\r\n+  Very simple plot that is easy to follow\\n\r\n+  Kept central idea of the show intact throughout\\n\\n\r\nCharacters (8.08/10):  Now, we're getting into the good part. \\n\\n\r\nAito Yuuki, our main protagonist.  Out of this guy, you'll get pantsu, um...pantsu, pantsu, let's see, more pantsu, and...pantsu.  Yes, this guy is not ashamed of his love for the female undergarment that is panties.  As the so-called Mangaka in this series, Aito stays as the show's main focus as he is not only a pervert, but a rather interesting character to watch.  Over the course of the show, you can see him flail around and try to balance his work, his pervert life, and his impression on people all in the same moment of time.  This guy is the pinnacle of the show's idea as watching him bounce around all over the place is rather amusing.\\n\\n\r\nAshisu Sahoto, the more or less main female protagonist of the series.  This girl has quite a tolerance to the guy that she works for.  With the generous aspiration of becoming a manga artist herself, Ashisu takes the role of being Aito's main assistant, while also taking quite a brunt of this guy's absurd actions.  All the while still focusing on her work and giving a proper scolding when necessary.\\n\\n\r\nOtosuna Mihari, a tsundere with a flat chest that is somehow not voiced by Rie Kugumiya.  As Aito's old classmate and co-worker, Mihari is an interesting character as you can't really assumptions of who she is, as being a tsundere, her feelings are somewhat conflicted and never really brought out.  Like Ashisu, she is a girl who is more focused on her work, as well as being quite tolerable to Aito's antics.  \\n\\n\r\nRinna Fuwa.  While this girl out of everyone gets the least amount of screen time, for what she does have, it is quite obvious what kind of character she is.  She is rather easy-going, doing really whatever she needs to do at the time, and agreeing to go along with whatever Aito wants her to do.  Which to me, seems like a danger in all fairness.  \\n\\n\r\nAnd then we have Sena Kuroi, the girl who is actually voiced by Rie Kugumiya.  Though introduced a little late in the show, Sena makes up her lack of appearance tenfold, by being a character that mostly anyone who's seen Rie's characters are, is.  A somewhat sadistic and proud girl in her introduction, it is shown later that she is a girl that has a soft spot for cute things and is quite the character being with the title \"Super assistant!\" in the manga world.\\n\\n\r\nApart from these 5 main characters, we get a few characters that serve little purpose in the grand plot, but are quite interesting characters nonetheless, as they make up their lack of screen time with very memorable moments when they are on screen.  \\n\\n\r\nOverview:\\n\r\n+  Very colorful main cast\\n\r\n+  Supporting cast that really makes the most of what they get\\n\\n\r\nArt and sound (7.22/10):  In all fairness, the art is pretty standard.  Nothing is really eye-popping, (aside from the insane amounts of underwear shows), and nothing really seems jarring to look at.  Personally, I think the style fits on the fact that the anime itself features a more laid-back idea rather than one that requires a lot of detail.  Plus, it doesn't take away from what the actual characters are doing at that moment.\\n\\n\r\nOn occasion though, whenever a pause for the joke's punch-line is needed, the animation will go into a momentary frame of a color gradient, where the entirety of the screen will go from one color, and descend to white in various places, giving the outline of the actual character.  It doesn't take anything away from the show, but I thought it needed to be mentioned.  \\n\\n\r\nAs for sound, well, nothing really stands out, right?  We have the opening and the ending that sound good, but aren't really tracks that make the show fantastic in the sound category.  That is, until you finish the 12th episode.  There lies the flagship track of the series, Aito's pantsu song.  While the song isn't fantastic, it was probably one of the most memorable moments for me in anime history, as the surprise of it made me laugh hard in my chair due to the fact that well, it's a song about freaking underwear, and the fact that it made a great end to the series.\\n\\n\r\nOverview:\\n\r\n+  Standard art \\n\r\n+  Decent sounding music\\n\\n\r\nPersonal Enjoyment (8.67/10):  I have an on and off relationship with this show.  On one hand, I love it because of how ridiculous and wonderful it was with its insane antics and gags.  I laughed like a little schoolkid at the things that were occurring in the show, and I found it to be an amusing experience.  \\n\\n\r\nOn the other hand, I saw things that I cannot unsee.  What I mean is, the show does some pretty...bold, things.  (Yeah, let's use bold.)  Without spoiling anything, the show does things that a lot of anime (even ecchi shows), probably wouldn't even think of doing.  Personally, I was shocked when I saw these events occur.  To say it bluntly, this show is definitely an experience.  \\n\\n\r\nOverall, this show is a bucket of laughs.  It has a crude style of humor, what with it being focused on the antics of our perverted only male in the entire show main protagonist.  Personally, I found this show to be enjoyable, and hopefully, if you pick it up, you will too.  \\n\\n\r\nOverall Score: (7.34/10)",
            "date": "2014-06-26T00:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 148679,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=148679"
        },
        {
            "content": "Pantsu! This is what this anime was about. It was a slice of life harem/comedy/ecchi without an actual over-arching plot. All episodes had 3 sketches mostly focused on things like misunderstandings, accidents etc. in which boobs and (especially) panties were well represented as in any ecchi show. It was mostly alright entertainment, nothing too serious, at times bit too generic and hence predictable.\r\nCharacters were pretty stereotypic. Main character Aito Yuuki is perverted mangaka who is especially interested in panties. He has several female assistants and female editor with whom he used to be classmates with. Most of the time Aito says and does stupid thingsthat makes those girls angry. Yet he is trying to be kind and decent fellow, he just can’t help himself. He often apologizes and begs for forgiveness. In the end all those girls actually like him, most in very tsundere way though, cheerful, although bit airheaded Rinna being an exception, she openly adores her ”sensei”.  \\n\\n\r\nAito is very dramatic and obsessed, so mainly the comedy was about his mad fetish for undergarments. I think nothing especially rememberable happens in this show. Some situations are pretty weird, and potentially funny, but I have seen so much ecchi comedies that I cannot say this would’ve been especially fun or creative in that regard.\\n\\n\r\nStory: 3 Poor\\n\r\nNot story to speak off, as usual in comedies romantic developments doesn’t happen and there is no over-arching plot really.\\n\\n\r\nArt: 7 Good\\n\r\nThis looked nice to me, no complaints. Nothing special though. Generic but good style.\\n\\n\r\nSound: 5 Mediocre\\n\r\nSeiyuus were good, there was lot of screaming and stuff and voice acting often sounded funny, even though nothing especially funny was happening. OP was good but ED was very long, bit boring and it’s style didn’t suit to this anime at all. It was too soft, emotional and slow compared to this anime. I had to skip it almost always. That’s why only Mediocre. \\n\\n\r\nCharacter: 6 Fair\\n\r\nStereotypes, tsunderes, sadists, perverts. Yeah not very unique characters.\\n\\n\r\nEnjoyment: 6 Fair\\n\r\nIt was okay, offered some laughs \\n\\n\r\nOverall: 5 Mediocre\\n\r\nNot a bad show, but it had nothing especially good to make it stand out from the rest. If you love panties this anime might be for you though. I don’t personally adore them that much to be honest, so  overall is only 5 this time.\\n",
            "date": "2018-07-25T08:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 284751,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Herr_Meister",
                "username": "Herr_Meister"
            },
            "url": "https://myanimelist.net/reviews.php?id=284751"
        },
        {
            "content": "Mangaka-San a short anime about a perverted manga artist and his female assistants in their daily lives.\r\nActual Score 6.8\r\nStory: 7\r\nThe story was pretty simple as it follows main MC Aito in his daily lives drawing manga with his assistant Ashisu while dealing with various other girls in his life. Their is no real main plot but is made up of small sketches that take over two per episode, which focus on one of the main girls and Aito with lots of comedy thrown in which is fun but can get a bit samey. \r\nArt: 7\r\nThe art is pretty standard with it being rather good norbad and doesn't ruin the experience.\\n\\n\r\nSound: 7\\n\r\nThe opening of the anime is up lifting and fun to watch and listen to as it fits into the slice of life feeling the show has; the ending is different in that it felt it didn't belong as it feels like it belongs to a romance anime rather than slice of life as is rather slow compared to the first.\\n\\n\r\nCharacter: 6\\n\r\nThe characters were fairly normal for a harem anime with the main cast only really appearing with few support characters, but even the main cast felt one-dimensional with them all going into character archetypes and having very little development, but they were fun and enjoyable to watch and interact.\\n\\n\r\nEnjoyment: 7\\n\r\nI did like it as make every know and then series as it was fun and a good idea for a short anime.\\n",
            "date": "2014-06-23T12:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 148245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=148245"
        },
        {
            "content": "This kinds of anime is very good in my opinion.. Because it combine both slice of life and comedy in a quite good anime.. I've read the manga and really enjoy both of them! I just hope they made it more longer and more many in anime because the anime one feels more good and easy to understand instead of the manga. Well the \" Ecchi\" Doesn't seems to frankly and I really enjoy it XD\r\nBecause personally Comedy and ecchi it is a bad combo.. but this one is different! I really enjoy both of them! You have to try this! It will worth yourtime!\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-12-01T07:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 204572,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5025358.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nyonyoh",
                "username": "Nyonyoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=204572"
        },
        {
            "content": "Despite all the jokes about Pantsu and ... vicinity is not something that has never been seen, still feel this anime comedy ecchi different from the usual. Perhaps the reason is because this anime is able tokeep itself so it does not get as bad others. Using job Yuuki as a manga authorecchi and to describe its behavior so that it looks so innocent, jokes in this anime was more likely to seem like an everyday occurrence, like the only form of delinquency an innocent child who has a way of looking a little unique, and not hokey irritating power of someone who is dirty-mindedor who continue to happen to accidentally forced repeatedly to good-natured young man who unusually lucky. In other words, even though he never stopped talking about things ecchi, anime is still prefers the comedy section, raised as a star in the show that the audience is always going first to laugh before she was uncomfortable with the topic being discussed. Erotisismenya level may still be too high for some people, but it does not prevent this anime from being a great comedy.",
            "date": "2017-02-26T15:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 241455,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241455"
        },
        {
            "content": "Pantz & Oppai!!! Haha! That's what I said.\r\nSpring 2014 anime is a breathe of fresh air from the terrible winter 2014 anime season. \r\nSTORY (8):\r\nThe story follows Yuki Aito, a manga author, who has an interest in boobs and panties. One day, Mihari Otosuna, Aito's editor, sends an assistant by the name of Ashisu Sahoto to work closely with him. Basically, crazy things happen.\r\nThe story has a lot of funny moments like for example when Sena is whipping Aito. Normally, an anime requires a beach episode, am I right?\r\nAnyway, jokes aside. Not only that, I did like the way how they develop Aito's relationship withthe girls. However, I feel that these episodes are not enough to make me get invested into the characters more. \\n\\n\r\nART (7):\\n\\n\r\nThe animation is all right. Nothing spectacular. \\n\\n\r\nSOUND (9):\\n\\n\r\nThe opening is more addictive than compared to the ending song. The opening \"Pure Impurities\" gives a fun and exciting vibe while the ending song \"Spica\" gives a melodramatic tone, like a sad tone actually.\\n\\n\r\nBoth opening and ending songs are sung by StylipS. One of the member is a voice actress of Mihari and her name is Arisa Noto. I will later get into her character soon.\\n\\n\r\nCHARACTER (8):\\n\\n\r\nYuki Aito was a person who is trying to be nice and helpful even though he has these perverted ideas of panties and boobs. In fact, I did like the way how he really grows as a character. He was just trying to be accepted into society. Yoshitsugu Matsuoka voiced this character especially Kirito from SAO. He did a great job in portraying the voice of Aito.\\n\\n\r\nAshisu Sahoto is calm and composed. Her character reminds me of Yukinoshita from Oregairu. Both characters are voiced by Saori Hayami whose voice sounds similar like Asami Imai & Noto Mamiko. \\n\\n\r\nRinna Fuwa is cheerful and she always cares for Aito. Her character design is similar to Megumi Yamamoto from Special A by the pink tops and her hair. \\n\\n\r\nAshisu Sahono is Sahoto's sister, I wished she has more material to work with because she is just there to watch on Aito & Sahoto. She is an interesting character.\\n\\n\r\nMihari is your tsundere type just like Sena Kuroi. Sena Kuroi was voiced by Rie Kugimiya who voiced a lot of tsundere characters. Even Iori Minase from Idolmaster. She keeps saying \"Hentai\"! \\n\\n\r\nEven though these characters have go through a development, I also feel that this anime is lacking in their back story. I just feel that they could have developed their character more so that at least I can be pulled into their profile. For what it's worth, I enjoyed the characters for the most part.\\n\\n\r\nCONCLUSION (8):\\n\\n\r\nI really did like the way how Aito guides Sahoto in making good manga. In fact, this anime has something which we can take back from. \"Be who you really are\", this quote tells us that when we do things, we have to put our heart and soul into it otherwise there is no meaning behind it. Just like be honest with yourself and go with what you love.\\n\\n\r\nI also wished that some characters have given more time to shine like Matome Minano. \\n\\n\r\nNevertheless, I did enjoy \"Mangaka-san to Assistant-san to\" and I give it an 8 out of 10.",
            "date": "2014-06-24T08:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 148357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=148357"
        }
    ],
    [
        {
            "content": "Slapstick, Spice and everything nice. These were the ingredients chosen to create the perfect little story. But the mangaka, Hiroyuki accidentally added an extra ingredient to the concoction - Chemical X (pantsu). Thus, Mangaka-san to assistant-san was born! The episodic series contains 12 episodes with the duration of each being 13 minutes long. This is all it takes to create laughter, laughter and more laughter from its viewers. This was definitely a home run for Spring season and easily digestible since it’s comedy shorts and half the normal time for a standard episode. This is a gag-show at heart so don’t go into the seriesthinking there is some sort of plot.\\n\\n\r\nThe heart and soul of Mangaka-san to assistant-san is Yuuki Aito, a perverted young man and his daily life of being a Mangaka who is trying to make it to the big time. He lacks focus for the most part and normally finds himself getting off-track thanks to his careless free nature that always has him struggling to make the deadlines. To help him with his manga \"Hajecafe\" that is dedicated to his love of cute girls and their lingerie are the Assistants that also play a part to keep him on the straight and narrow in Sahoto Ashisu, the sadist. Sena Kuroi, the kodomo and Rinna Fuwa who is the normal one. All are later hired by his Editor and High School peer Mihari Otosuna, the tsundere. All the characters are twisted, in a good way. From here on out is just a roller coaster of hysterics.\\n\\n\r\nAnd immediately it gets straight into things without a proper introduction, which was sort off expected, after all, this kind of gag-show does not really depend on introductions, but for you to fully immerse yourself into the jokes and slapstick scenes. Right off the bat, you’re welcomed to Yuuki’s workplace, home and love-nest, all bundled into one location where the majority of the scenes take place. But don’t worry, that room will hardly take precedence as compared to all of the scenes which occur there. This is where the magic happens.\\n\\n\r\nZexcs studio did a great job with this adaption, not only does it look like the source material but it also follows it closely. The visuals are super clean, bright and vibrant and the animation is consistent. The designs of the characters add to the contrast of the series, such a colourful cast and all fitting the look of their personalities very well. Most ecchi tend to step over that fine-line with a heavy amount of scandalous character designs but it did well to keep things standard. The art of the facial expressions and also how it was animated made the characters reactions priceless and many segments much more hilarious. \\n\\n\r\nThe Opening song, \"Junsui na Fujunbutsu\" by StylipS sets the mood instantly, just a fun and catchy song. Since it airs early morning for me, the song wakes me up like a cup of coffee. The soundtrack overall compliments the dialogues and makes most of the comedic moments and punchlines even more of an enjoyable experience. The voice acting for the characters fits superbly, they are all on point and fit each character’s personalities. I found that Yoshitsugu Matsuoka who plays Yuuki's character did a fantastic job, he really brought that character to life and made the 'over the top' moments in an excellent manner without overdoing it. The Ending song, \"Spica\" also by StylipS is a much calmer and peaceful melody, I was expecting something that keeps the happy vibe going but I'm not complaining. \\n\\n\r\nI like the fact that the producers were very daring, some of the scenes here are NSFW. I really like this show because of the fact it follows a real-life setting, and it’s always great to have an anime like this to have a break from some of the other genres. In conclusion, Mangaka-san to Assistant-san is a nicely executed and an excellent comedy series that has become one of my favourites of the season. I would feel really comfortable recommending this to anyone that is a fan of comedy, which should mean everyone, I mean, who doesn’t love comedy? If you are looking for a fun show that’s rich in humorous moments that make you laugh so hard that it hurts than look no further than here. \\n",
            "date": "2014-06-23T11:11:00+00:00",
            "helpful_count": 91,
            "mal_id": 148229,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3264993.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/papsoshea",
                "username": "papsoshea"
            },
            "url": "https://myanimelist.net/reviews.php?id=148229"
        },
        {
            "content": "Mangaka san to Assistant san is a slice of life harem comedy depicting the life of a perverted mangaka who makes the monthly manga \"HajiCafe\" with his assistants. It's a nice comedy. The animation and art is pretty good and the characters are all likeable.\r\nStory 7/10:\r\nNot much of a story. The 12 episodes pass by showing different situations of the team. Just like in Lucky Star, Danshi Koukousei and Nichijou, this anime also shows different skits. Almost every skit is funny and nice to watch.\r\nArt 9/10:\r\nI really enjoyed the animation and artwork of this anime. The character designs were really amazing. It looked kinda likethe average anime should. Not much fancy but not too dull to make it look bad. Nonetheless, the character designs are really amazing for a short anime series. Really enjoyed watching the characters.\\n\\n\r\nCharacter 8/10:\\n\r\nOur protagonist and mangaka, Aito Yuuki is a pervert. Not those perverts which you hate but one of those who are cool and funny. He can be thoughtful sometimes but his pervertness ruins the mood. A really funny character.\\n\r\nEach of his assistants has her own special personality. Some of the girls get more screen time than the others due to their importance or relation with Aito. But each girl gives the show it's own unique twist. \\n\\n\r\nEnjoyment 8/10:\\n\r\nJust as enjoyable as any other comedy anime. You've got your average events in check e.g. beach event, hot springs event, Take care of me I'm sick event etc. The animation is really nice and comedy is laughable. It's quite an enjoyable short series which is a good time pass with loads of laughter.\\n\\n\r\nOverall, a splendid comedy short to watch with a nice dose of eye candy.",
            "date": "2015-02-05T09:48:00+00:00",
            "helpful_count": 59,
            "mal_id": 179713,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017315.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AbsarNaeem",
                "username": "AbsarNaeem"
            },
            "url": "https://myanimelist.net/reviews.php?id=179713"
        },
        {
            "content": "This is an anime about a man and his dream. His dream of panties. Seeing panties, smelling panties, touching panties.... Yeah that's honestly most of what this show is about. Oh, and a there's also little stuff about making manga. But it's ecchi manga about panties anyway. Each episode is divided into three or four different scenes, and almost all of them deal with panties and Aito's love for them in one way or another.\r\nThis is a harem anime about a mangaka of an ecchi manga and the girls around him. His three assistants (though two are hardly ever seen actually helping his manga atall), his editor, and several other minor characters. The main character, Aito, is absolutely ridiculous. His emotions seem bipolar and he can quickly flip from being a perverted idiot to a sympathetic and kind mentor in the blink of an eye. His voice during many of the perverted scenes gets so high it's annoying (though I will give credit to his voice actor for having excellent vocal range) yet at other times he can be quite likable. He has balls of steel and, unlike many male protagonists in ecchi anime, has almost no fear of asking to see a girl's underwear or to touch them (in fact he even succeeds a couple times).\\n\\n\r\nAs for the girls, they are mostly archetypal, though they do break out of their archetypes and become unique on several occasions. Aito's main assistant, Ashisu, is the girl who least fits into any archetype. She is Aito's main love interest (of course she would rather die than feel the same way about him). Being an assistant, she has dreams of debuting and becoming a real mangaka. She has a love-hate relationship with Aito which can range from her going along with his perverted schemes to acting like a dominating yandere around him. Mihari is Aito's editor and friend from high school who has long had a crush on him. Aito has no clue of course because Mihari is your typical, lovable tsundere. Rinna, a well-endowed airhead, and Sena, a spoiled-rotten weakling, are much less important and only have a few important scenes despite being main characters.\\n\\n\r\nThe animation is fairly well done for an ecchi anime. Despite all of it's focus on panties, the amount of ecchi content is probably not as much as you're expecting. There are more moments with sexual innuendos and Aito asking to see panties than there are actual moments of near-nudity. The character designs are average and since most of the anime takes place inside of Aito's apartment studio, the characters are usually seen close up and tend to avoid being shown with minimal detail when far away from the viewer like many shows do to save some of the animation budget. Still, this means there are not too many scenery changes, though there are still a beach/hot spring episode and several trips to lingerie stores in the mall. As for the sound, the music is typical an for ecchi and comedy anime. Most of the time it is light-hearted, but it can get intense to match Aito's bizarre outbreaks. Still, it does nothing more than fit the mood fairly well at the time and is often unnoticeable.\\n\\n\r\n\"Mangaka-san to Assistant-san to\" is a fairly entertaining, simple, and short (12 minute long episodes) ecchi comedy. If that's all your looking for, then you've found something you'll enjoy. If you're looking for one of the best ecchi shows out there, or something with tons of nudity, then you'll probably be disappointed. The show does get a little better as it goes and as you grow somewhat attached to the characters (I personally enjoyed Mihari with her crush on Aito the most and I was happy that there was an entire episode dedicated to that). Also, if you're going into this expecting a lot of focus on making manga, you would be better to check out something like Bakuman as this only occasionally focuses on how tiring the process can really be.",
            "date": "2014-06-23T12:05:00+00:00",
            "helpful_count": 46,
            "mal_id": 148243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=148243"
        },
        {
            "content": "Mangaka-san to Assistant-san to The Animation, is simply an anime about a guy named Aito who is a manga artist, and works closely with various people, such as Ashisu.   The show has a harem-like feel since it is a 'one guy, lots of girls', but no matter how perverted Aito is, he does not have any intention to do any of the girls wrong, even if what he says and does, comes off the wrong way.\r\nStory:   To be blunt, there is very little story to the show, aside from Aito being a perverted manga artist, and Ashisu wanting to be amanga artist herself.  From the first episode to the last, there is no real progression in the story.\\n\\n\r\nArt:  I do not know how to properly describe it, but the style is a nice and simple design that is good overall.  The many exaggerations used in different cases, along with the facial expressions when certain things were said, were well done.\\n\\n\r\nSound:   The music, although minimal, was fine, and the sound effects used for many awkward and non-awkward scenes, were perfect.\\n\\n\r\nEnjoyment:   I enjoyed the show because it had the right mix of silly and perverted humor, without overly using the typical ecchi things like 'guy falls on girl and gropes breasts' or 'guy bends over to tie shoe and looks up at girls panties', so it gave it the right amount to be enjoyable, without being too overly weird or creepy.\\n\\n\\n\\n\r\nOverall, the show was not bad.  The only gripe I have with it, was simply that the episodes, were only 13 minutes long, instead of the usual 24 minutes.   So in short, if you enjoy silly and perverted humor that doesn't have the overload of ecchi cliches, then you should enjoy this.",
            "date": "2014-10-12T16:02:00+00:00",
            "helpful_count": 40,
            "mal_id": 164593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666651.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LawfulEngineer",
                "username": "LawfulEngineer"
            },
            "url": "https://myanimelist.net/reviews.php?id=164593"
        },
        {
            "content": "Welcome to the 13 minute classic - Mangaka-san to Assist-san to The Animation.\r\nStory: 7/10\r\nThe story in itself isn't anything special, of course. It follows the perverted, young mangaka Aito Yuuki, which, because of his lack of zeal, is about to miss the deadline once again.\r\nThe story is pure comedy, so I don't really mind if its not worked out perfectly.\r\nArt: 7/10\r\nCute character designs, as well as good backgrounds and just as good animations definitely help making a good anime. Just like in this case. The colors are lively, the qualitiy is consistent, nothing to rant about.\r\nSound: 8/10\r\nKugimiya Rie in action. I think I don't needto tell much. But since I like her, I'll do so nonetheless.\\n\r\nThe CVs are top notch. The seiyus of Kirito/Sora, Kagura/Louise/Shana, Haqua/Yotsugi/Yukino as well as Tsukihi/Index just deliver. Newcomer Noto Arisa does a good job as well.\\n\r\nNext, openings and endings. The opening \"Junsui na Fujunbutsu\" stood out and perfectly sets the mood for the 13 minutes to come. The ending on the other hand, while still a good song, is rather unmemorable.\\n\r\nBGMs suffer from the same cause. Good, but unmemorable.\\n\r\nThey do complement the anime though.\\n\\n\r\nCharacters: 8/10\\n\r\nThe characters aren't new at all, instead, they're pretty much archetypical, yet still really likeable. The interactions between the characters are hillarious, but the characters miss a bit of background story. There IS backgroundstory, yes, but not that much. But then again, its an comedy anime. My personnal favorite Sena got me to the 8 points though. The second-best role of Kugimiya Rie up to date, with only Kagura being even better, but not as loveable though.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI ended up laughting every episode, so why not 10 points? Because this anime also holds the hardest borderline experience of all anime. (***SPOILER***) Beware of Episode 8 (***SPOILER END***) It really gave me the creeps, but at the same time made me jealous...\\n\\n\r\nOverall: 8/10\\n\r\nDefinitely a great comedy anime to calm down. Having just 12 episodes á 13 minutes predistines it as a filler to calm down, or when you want to relax on some busy days.\\n\r\nRecommended for nearly everyone, who doesn't mind a fair share of ecchi and dirty jokes.",
            "date": "2014-07-23T07:45:00+00:00",
            "helpful_count": 19,
            "mal_id": 153367,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2505579.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Play2X",
                "username": "Play2X"
            },
            "url": "https://myanimelist.net/reviews.php?id=153367"
        },
        {
            "content": "\"Pantsu are number one!\" -Aito Yuuki\r\nThis slice of life - or rather, a slice of a perverted mangaka's life anime contains a wonderful mix of colourful characters, absurd settings and best of all: the erotic, crude humour. Slap all these ingredients together, and you bake up this tasty treat: Mangaka-san to Assistant-san to: The Animation, almost guaranteeing laughter in every episode.\r\nStory:- 6 out of 10.\r\nYou really wouldn't expect it to be driven  by plot given it's premise and so it follows the main character; Aito, an extremely perverted mangaka; and his assistants in their chemistry of daily happenings. Humour is the central concept thatdrives this anime with some sub-concepts here and there.\\n\\n\r\nArt:- 7 out of 10.\\n\r\nThe art is solid, crisp, consistent and sensible. The animation smartly split into sections (to match the manga's structure), which keeps the anime fresh so it doesn't get stale over the 13 minutes. The body language, facial expressions are very well done.\\n\\n\r\nSound:- 8 out of 10.\\n\r\nI feel like this is one of the winning point, no, not the catchy music, not the beautiful OSTs but the voice acting. They definitely got the perfect voice actors for each of the characters. The way they express through voice is flawless, this is especially true for the main character Aito (Matsuoka, Yoshitsugu or Kirito from SAO, yeah.. I know). A mesh of tone, amplitude and pitch really sets the mood and allows you to properly connect to the anime and its scenes for example: you could just listen to the audio and figure out what they're doing.\\n\\n\r\nCharacter:- 8 out of 10.\\n\r\nIf you could describe the anime's two winning points as a one-two punch: one being the voice acting, then two would definitely be the character chemistry and interactions.\\n\r\nThe characters themselves all hold true to the generic band of tsundere, sensible girl, loli, and etc. However with the dynamics being in harmony with the magnificent voice acting, it really packs the punch when the characters interact with each other and differentiates themselves from other anime's by giving each of the characters distinctiveness: e.g. Ashisu's S side. I feel like this gives a better comedic sense in the anime i.e. certain reactions would only work between characters which have built up a certain relationship and this works with Mangaka-to because they communicate well.\\n\r\nThis being said, there is almost no character development except for maybe one or two other characters.\\n\\n\r\nEnjoyment:- 10 out of 10.\\n\r\nDespite being 13 minutes long, and something I first didn't think would be worth watching - oh boy was I wrong on so many levels. I would always anticipate for the next episode and would wish the episodes would be longer - and hope for a 2nd season. Definitely recommended for people who love perverted humour in strong small segments. It's very unfortunate this is overlooked and underrated.\\n\\n\\n\r\nSo wrapping it all up I think this anime is very deserving of a 8 out of 10, despite its weak plot, the voice acting and character dynamics really pull through an extremely good sense of humour.\\n\\n\r\n(N/B: The scoring system I used is relative to it's genre,)",
            "date": "2014-06-24T05:23:00+00:00",
            "helpful_count": 17,
            "mal_id": 148341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3818459.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/junpants",
                "username": "junpants"
            },
            "url": "https://myanimelist.net/reviews.php?id=148341"
        },
        {
            "content": "Spoiler Alert: \r\nLoved this anime from the first episode and I wanted more. The best part of the show has to be the sounds and I do say I have never heard anything like it. The way the sounds and reactions of the anime characters progressively get better is captivating.\r\nQuite like another anime I know 'Bakuman' only with art aspect; with the short glimpses of artwork some of which is detailed in this anime come across my mind when doing my artwork I found it even more appealing and oddly motivating.",
            "date": "2014-07-11T22:30:00+00:00",
            "helpful_count": 13,
            "mal_id": 151615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/314093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cxp0_0shaw",
                "username": "Cxp0_0shaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=151615"
        },
        {
            "content": "Ok, time to make my review.\r\nPoor 3.\r\nStory- Co'z I find the plot pretty simple and most of it were pretty random to say the least, and that's as simple as I can put it. \r\nDecent 4.\r\nArt- Well, despite of some fanservice, I guess I could forgive this anime, since such thing doesn't make it too erotic.\r\nGood 7.\r\nSound- I have no problem as who did who about the character's voice, also I kinda like the opening, but not the closing, and that's as simple as it is.\r\nCharacter- I may have hated Aito as this perverted predator, but he is one predator that I like, since itwas his predatory acts that make this anime funny.\\n\\n\r\nAlso, Ashisu does compliment Aito's funny antics as a victim who knows how to keep him at bay that adds to the gag and Mihari whom Aito fears the most, of course given that this anime has a harem genre won't be complete without a sadistic tsundere, Rinna and Kuroi were the quintessential bimbo and cute tsundere who as always completes the harem, but it too bad that more screen time are allocated between Aito and Ashisu which at time disgusted me .\\n\\n\r\nEnjoyment- Well, the anime maybe 13 mins long per episode, but with such comedy that make me laugh despite of its naughtiness was well worth it.\\n\\n\r\nOverall- It's good though, but since the anime depends on such naughtiness, I can only give such score, since it only rides on the male character's perversion.\\n\\n\\n\r\nBTW: This is another repost.",
            "date": "2014-08-08T07:55:00+00:00",
            "helpful_count": 12,
            "mal_id": 155785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=155785"
        },
        {
            "content": "OOOOOOH, that was sweet another harem theme anime has ended, so time to make my review........and I'm gonna keep it simple.\r\nStory, Enjoyment and Overall: Very Good.8.\r\nOk, there isn't any story at all its just a plot where it revolves around a perverted manga artist and his pretty assistant, even so the plot alone was sufficient enough to carry this anime's 13 min per episode around, sure there were the usual fanservices, but I have to admit it really does add to this anime's enjoyment and I really have no reservation to give this anime's overall  a high score.\r\nArt: Good .7.\r\nIt's the ecchi and Ido mean the ecchi that for me is the good part of this anime, especially when we talk about the fanservice.\\n\\n\r\nSound and Character: Fair.6.\\n\\n\r\nWell.....for the sound, I have no qualms as to who did who about the character's voices, except that i kinda like the opening theme, but not the closing.....well except the last one where it was Aito who sang \"Endless Panty\" was really funny and frankly I look forward of downloading it as soon as links are available. As for the characters.........let's put it in this manner:\\n\\n\r\nAito Yuuki- The thing about him was that his character really can't hold on its own without his harem around, now Ashisu can provide such stability but not enough, which is one reason why this category deserves such score.\\n\\n\r\nAshisu Sahoto-  The impact of her character really depend on Aito for this anime's comedy genre, now let's face it eventhough her character was to keep Aito in check and keep her sexual advances at bay, it was those very things that gives her character such impact.\\n\\n\r\nMihari Otosuna- Also another character that's supports Aito as the main protagonist (ok so he's a bit of a predator), but, her being this tsundere really gives Aito the impact it needs to add to this anime's comedy genre.\\n\\n\r\nSena Kuroi- As they say every pervert needs a good victim, and as much as I hate to say it she kinda serves that role as the unwilling victim of Aito's perversion.\\n\\n\r\nRinna Fuwa- well let's just say that she serves as the town bimbo, though it unfortunate that her role was a bit limited, which is one reason why it is another reason why this category gets such score.\\n\\n\r\n Matome Minano and Sahono Ashisu- Another characters who kinda be this wanna be victim but cannot.\\n\\n\\n\\n",
            "date": "2014-06-23T12:49:00+00:00",
            "helpful_count": 11,
            "mal_id": 148249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=148249"
        },
        {
            "content": "This. This is how ecchi should be done.\r\nNow before I go onto my review about Mangaka-san to Assistant-san, I want to preface by saying that this show will go over a lot of people’s heads. Ecchi is usually either a big hit or a complete whiff; that’s the reality. And for me, it was a homerun.\r\nMangaka-san to Assistant-san is formatted with 13 minute long episodes. Many people may question this, as we are all accustomed to the usual 23 minute setting, but regardless of its short length, this show managed to maintain an astounding “laughs per episode” for me (if I were to pull anumber out of my ass, I’d say I laughed out loud at least 10 times each episode).\\n\\n\r\nUnlike a normal review, I will not go in-depth about the production quality like animations, sound, plot, scripting, etc. Why? This is a comedy. An ecchi one, to be exact. It has only one objective: make the viewer laugh. \\n\\n\r\nSo if I were to make a concise statement about the production quality of Mangaka-san to Assistant-san, I’d say: “nothing worth mentioning”. The sound was a bit poor, and the art, excluding the characters’ reactions to gags, was sub-par. The voice acting was decent, fitting the characters well when they went off on their antics, but the scripting was sometimes awkward, and the character development was little to none. In reality, if I were to rate this series based solely on the aspects mentioned above, this wouldn’t even get a 4/10.\\n\\n\r\nThe aspect that really made Mangaka-san a success was the humor. I felt my ribs were in stitches at the end of every episode, and really lifted my mood whenever finished an episode. Bottom line, it’s fucking hilarious.\\n\\n\r\nBut if someone were to ask me if they should watch this series, I would hesitate because this kind of comedy is gold to some, while utter horseshit to the rest (also, if I knew them in real life, they may question my well-being). So what is my final verdict? Spare 13 minutes out of your life and watch the first episode. You liked it? Continue. Hated it? Go watch something more serious like Bakuman.\\n\\n\r\nFinal score: Elevator scene/10.\\n",
            "date": "2015-11-27T16:05:00+00:00",
            "helpful_count": 9,
            "mal_id": 204291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4792203.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/amb1d3x",
                "username": "amb1d3x"
            },
            "url": "https://myanimelist.net/reviews.php?id=204291"
        },
        {
            "content": "Pantsu Pantsu Pantsu. \r\nIf I could comprehend this anime into three words it will be those magical, hallucinating words- Pantsu. \r\nMangaka-san to Assistant-san to, as the name suggest is an anime about a Mangaka, Aito, and his female assistants. It is a complete fun ride, I had a blast watching this anime. A very light hearted harem story with just right amount of graphic ecchi to make it funny but staying away from overdoing. I would recommend it to anyone looking for a good laugh, especially to a guy. \r\nBeing a 13 min per episode ecchi-comedy there is not much to expect from the story.Each episode is divided into 3 plays and each of them plays out different from the other one. Though the next episode does picks up the elements devised in the last one, story is still not the strong point of Mangaka-san to Assistant-san to. \\n\\n\r\nIf you have ever at a point read the manga, you would definitely notice the difference in art style. And luckily a difference that makes stuff even better and interesting. The characters are drawn in a slender, stereotypical anime form yet retaining all their charm from the manga. On the other hand, the sound is good. No complains to that side, its nothing too big to talk about but its just right and its right there. \\n\\n\r\nFor a 13 min episode you can expect a lot of character development of all major characters, there is nothing to fear and to drift towards manga. The anime did a really good job to define all the characters well into their position. The voice acting is superb, especially the main character. He would definitely hit a lot of punches right at the moment you least expect them. Even though the main character is the titular Mangaka, the cards are easily stolen by the awesome side characters. Even the typical tsundere of the show is extremely enjoyable. \\n\\n\r\nTo conclude I would say, it might not have been my one anime I was waiting eagerly the whole month. But damn- it was hilarious.",
            "date": "2014-06-26T11:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 148757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2579473.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lucax",
                "username": "lucax"
            },
            "url": "https://myanimelist.net/reviews.php?id=148757"
        },
        {
            "content": "It's a cute show, it knows what it wants to do and does it pretty well. Animation isn't that good but that's not the important part. The characters interactions are funny and adorable and there are some heartfelt moments. The panties obsessed MC is very funny and likeable, and the show doesn't go too overboard with is obsession. The other characters are mainly just the generic tropes; tsundere, airhead, and loli, but they are all very likeable and funny. In the end its a nice 12 episode 13 minute show, if you have some free time it can easily be watched in an afternoon.",
            "date": "2015-11-06T14:12:00+00:00",
            "helpful_count": 8,
            "mal_id": 202808,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4444138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Original_Don",
                "username": "Original_Don"
            },
            "url": "https://myanimelist.net/reviews.php?id=202808"
        },
        {
            "content": "The Comic Artist & His Assistants\r\nArt: For a show that is pretty much just an animation of a manga, it had pretty good art. While the characters were pretty generic when it came to how they were drawn and how they acted, it was cute to watch them interact with each other, even if none of them were particularity intelligent. The landscapes were not varied hardly at all, almost every episode took place in the room of Aito, but every so often they would go somewhere else for maybe a minute or two. There was a single episode when the crew went to a hotspring and inn, it was nice to have a change of scenery. \\n\\n\r\nMusic: Music really did not play a major part in this anime adaptation. Really the only music there was, happened to be in the intro/outro and very softly in the rest of the show. Most of it just felt so repetitive though, it really took me out of the world to listen to the same song over and over again, rather than having a little bit of variety. \\n\\n\r\nStory: What kind of story can be told in twelve, 13-minute, episodes? Not a very good one sadly. While really this is just “in the life of Aito” there was no real story to speak of. Aito is always late and his publisher is always pissed. Aito is a pervert that only thinks about panties and boobs. That being said there is a lot of fan service in this show, however it is more just the clothing rather than girls in those pieces of clothing. There was a bit of charm to this however, Ashisu and Aito have an interesting chemistry that is really lovable and the episode where her little sister comes to visit has to be my favorite. \\n\\n\r\nPersonal Reflection: I had no prior knowledge of this show before going into it, and I really wasn’t sure what to think after the first episode ended. But I kept watching because the episodes were short and I liked the way the characters interacted. Sure, Aito is a pervert and the joke is a bit dry, the characters aren’t at all original, and overall this is pretty much a rehash of some other shows that did it better, but aside from all that it was still a show that was fun to watch and easy to laugh to. If you are a fan of the cheesy and cliche, then check this one out.\\n\\n\r\nOverall Score: 6.8/10",
            "date": "2016-05-06T20:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 218053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4688864.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Chiburo",
                "username": "Chiburo"
            },
            "url": "https://myanimelist.net/reviews.php?id=218053"
        },
        {
            "content": "Somewhere in me is a cynic that I refuse to give in to, because I don’t want to make the mistake of judging shows by their cover. And every so often, I have reason to be optimistic, as a number of shows I’ve doubted have proven to be not just pleasant surprises, but fantastic works in their own right. But damn it, Japan, when you release shows like this, it’s very hard to stay positive.\r\n‘The Mangaka and His Assistants’ focuses on the daily lives of manga artist Yuki and his all-female assistants. When he’s not drawing manga, he’s usually trying to subject them to hisperverted desires. Among the assistants, Rinna would go along with him if Sena, Mahiru, and Sahoto aren’t there to stop her, while the latter three thrash him for his advances. This is the entire show, and unfortunately there are deeper problems than the humor not being to one’s liking.\\n\\n\r\nA major problem with The Mangaka and His Assistants is its cast lacks development, personality, or anything I could use to call them interesting. Everyone who isn’t Rinna has two personalities, with nothing between to make those two sides believable as part of the same person; Yuki is perverted then nice, Sahoto is indifferent and then motivated, while Mahiru and Sena are basically the same character, feisty on the outside but warm on the inside. Not that Rinna is any better, because the way she would accept Yuki’s advances were it not for the others is disturbing.\\n\\n\r\nIt isn’t just a lack of development, but how much that development doesn’t make sense. Yuki is relentless in his perverse advances and Sena, Mahiru, and Sahoto all bash him for it. Makes sense. What doesn’t make sense is Sena and Mahiru showing signs of falling for Yuki, supposedly because he’s a nice guy despite his perversion, except that even in flashbacks, we don’t see enough of Yuki being that nice guy. The only one who doesn’t fall for Yuki is Sahoto, and even then she’s supposedly going to stay with him because she pities him. Yeah. Really.\\n\\n\r\nIt gets even better when the show tries to justify its lack of development in favor of Yuki being perverted. His main reason for making manga is because he wants to draw panties, and Mahiru points out that the reason his manga is losing popularity is because he’s focusing too much on panties and not enough on the story. Quite frankly this sort of self-referential humor only works when the show is at least decent, but do things sound even decent so far?\\n\\n\r\nBut fine, clearly asking for decent characters is too much. Too bad the humor can be outright repulsive. There is a scene where Yuki is crossdressing so he can understand what it’s like being a woman. After being shrugged off by his assistants, one of them falls asleep. He then tries to breast feed that sleeping girl so he can ‘also’ understand what it’s like being a mom. The girl wakes up with a mouthful of man chest and promptly thrashes him. This scene was so uncomfortable I had to stop the episode. Comedies are not supposed to do that.\\n\\n\r\nActually, most of comedy in this show—and by extension, most of the show itself—is just uncomfortable. Between the brand of humor, lack of development, and self-awareness, I sometimes wonder if the show is just poking fun at the reason people watch ecchi shows. Are we supposed to go ‘good thing I’m not part of that audience!’ or ‘at least I’m not as depraved as that guy!’? Maybe some people can find this funny, but I don’t. All the humor did was remind me of people who really can’t divorce reality from fiction, on top of reinforcing bad stereotypes of Japanese animation.\\n\\n\r\nThe animation itself is serviceable but nothing impressive or distinct. But aside from the lack of inspiration to differentiate between Sena and Mahiru, the characters designs are at least pleasant to look at thanks to somewhat vibrant colors. The sound isn’t all that great either, lacking much of a proper soundtrack, but nothing is particularly out of place. The aesthetics of this show on a whole are just really, really standard.\\n\\n\r\nI just wish I could describe this show as even being ‘standard.’ While I wasn’t expecting something groundbreaking, I did expect a reasonable story or at least some decent characters. Unfortunately there’s uncomfortable humor in place of development on top of the show trying to shrug off its own faults. Even if you’re an ecchi fan—no wait, ESPECIALLY if you’re an ecchi fan—skip this patronizing, heartless garbage.\\n\\n\r\nI say ‘heartless’ because even something like Mayo Chiki really tries. Amagami tries. Mashiro Symphony tries. This show doesn’t. It doesn’t understand that panties and fanservice only go so far, because what any kind of show needs is heart. And for The Mangaka and His Assistants, it isn’t something they’re going to have no matter how many times they go back to the drawing board.",
            "date": "2015-02-02T06:51:00+00:00",
            "helpful_count": 6,
            "mal_id": 179496,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/396401.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/iSuckAtWriting",
                "username": "iSuckAtWriting"
            },
            "url": "https://myanimelist.net/reviews.php?id=179496"
        },
        {
            "content": "Anime shorts are a very interesting genre of anime.  They can vary from a wide range of topics and ideas, as well as their run times, such as Pupa with its four minute run time, and Tonari no Seki-kun with its 7-10 minute run time.  Today, Mangaka-san to Assistant-san to The Animation.  An...interesting short with a 12-13 minute run time.\r\nStory (7.22/10):  A ecchi manga artist and his four assistants.  That is literally the plot.  Throughout the span of the 12 episode run length, the show varies from topic to topic, as with most episodic anime, ranging from several shortstories within one episode of its small run time, or one big one that spans the whole of the episode.  \\n\\n\r\nWhat I think this show does well in, is the fact that the show doesn't stray from what it was trying to do.  From the first episode, it kept a consistent theme of what it wanted to be, and didn't stray far away from it.  While every episode is about different things, the show keeps itself at bay with its central plot points and figures, that works quite well.  \\n\\n\r\nApart from that, there's not really much to say.  It's a shorts series, and there's nothing really more to say about it other than the fact that well, it's a good time killer if there ever was one, as the show never creates any deep plot that one has to follow and there's not much to remember apart from the characters' names.  \\n\\n\r\nOverview:\\n\r\n+  Very simple plot that is easy to follow\\n\r\n+  Kept central idea of the show intact throughout\\n\\n\r\nCharacters (8.08/10):  Now, we're getting into the good part. \\n\\n\r\nAito Yuuki, our main protagonist.  Out of this guy, you'll get pantsu, um...pantsu, pantsu, let's see, more pantsu, and...pantsu.  Yes, this guy is not ashamed of his love for the female undergarment that is panties.  As the so-called Mangaka in this series, Aito stays as the show's main focus as he is not only a pervert, but a rather interesting character to watch.  Over the course of the show, you can see him flail around and try to balance his work, his pervert life, and his impression on people all in the same moment of time.  This guy is the pinnacle of the show's idea as watching him bounce around all over the place is rather amusing.\\n\\n\r\nAshisu Sahoto, the more or less main female protagonist of the series.  This girl has quite a tolerance to the guy that she works for.  With the generous aspiration of becoming a manga artist herself, Ashisu takes the role of being Aito's main assistant, while also taking quite a brunt of this guy's absurd actions.  All the while still focusing on her work and giving a proper scolding when necessary.\\n\\n\r\nOtosuna Mihari, a tsundere with a flat chest that is somehow not voiced by Rie Kugumiya.  As Aito's old classmate and co-worker, Mihari is an interesting character as you can't really assumptions of who she is, as being a tsundere, her feelings are somewhat conflicted and never really brought out.  Like Ashisu, she is a girl who is more focused on her work, as well as being quite tolerable to Aito's antics.  \\n\\n\r\nRinna Fuwa.  While this girl out of everyone gets the least amount of screen time, for what she does have, it is quite obvious what kind of character she is.  She is rather easy-going, doing really whatever she needs to do at the time, and agreeing to go along with whatever Aito wants her to do.  Which to me, seems like a danger in all fairness.  \\n\\n\r\nAnd then we have Sena Kuroi, the girl who is actually voiced by Rie Kugumiya.  Though introduced a little late in the show, Sena makes up her lack of appearance tenfold, by being a character that mostly anyone who's seen Rie's characters are, is.  A somewhat sadistic and proud girl in her introduction, it is shown later that she is a girl that has a soft spot for cute things and is quite the character being with the title \"Super assistant!\" in the manga world.\\n\\n\r\nApart from these 5 main characters, we get a few characters that serve little purpose in the grand plot, but are quite interesting characters nonetheless, as they make up their lack of screen time with very memorable moments when they are on screen.  \\n\\n\r\nOverview:\\n\r\n+  Very colorful main cast\\n\r\n+  Supporting cast that really makes the most of what they get\\n\\n\r\nArt and sound (7.22/10):  In all fairness, the art is pretty standard.  Nothing is really eye-popping, (aside from the insane amounts of underwear shows), and nothing really seems jarring to look at.  Personally, I think the style fits on the fact that the anime itself features a more laid-back idea rather than one that requires a lot of detail.  Plus, it doesn't take away from what the actual characters are doing at that moment.\\n\\n\r\nOn occasion though, whenever a pause for the joke's punch-line is needed, the animation will go into a momentary frame of a color gradient, where the entirety of the screen will go from one color, and descend to white in various places, giving the outline of the actual character.  It doesn't take anything away from the show, but I thought it needed to be mentioned.  \\n\\n\r\nAs for sound, well, nothing really stands out, right?  We have the opening and the ending that sound good, but aren't really tracks that make the show fantastic in the sound category.  That is, until you finish the 12th episode.  There lies the flagship track of the series, Aito's pantsu song.  While the song isn't fantastic, it was probably one of the most memorable moments for me in anime history, as the surprise of it made me laugh hard in my chair due to the fact that well, it's a song about freaking underwear, and the fact that it made a great end to the series.\\n\\n\r\nOverview:\\n\r\n+  Standard art \\n\r\n+  Decent sounding music\\n\\n\r\nPersonal Enjoyment (8.67/10):  I have an on and off relationship with this show.  On one hand, I love it because of how ridiculous and wonderful it was with its insane antics and gags.  I laughed like a little schoolkid at the things that were occurring in the show, and I found it to be an amusing experience.  \\n\\n\r\nOn the other hand, I saw things that I cannot unsee.  What I mean is, the show does some pretty...bold, things.  (Yeah, let's use bold.)  Without spoiling anything, the show does things that a lot of anime (even ecchi shows), probably wouldn't even think of doing.  Personally, I was shocked when I saw these events occur.  To say it bluntly, this show is definitely an experience.  \\n\\n\r\nOverall, this show is a bucket of laughs.  It has a crude style of humor, what with it being focused on the antics of our perverted only male in the entire show main protagonist.  Personally, I found this show to be enjoyable, and hopefully, if you pick it up, you will too.  \\n\\n\r\nOverall Score: (7.34/10)",
            "date": "2014-06-26T00:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 148679,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=148679"
        },
        {
            "content": "Pantsu! This is what this anime was about. It was a slice of life harem/comedy/ecchi without an actual over-arching plot. All episodes had 3 sketches mostly focused on things like misunderstandings, accidents etc. in which boobs and (especially) panties were well represented as in any ecchi show. It was mostly alright entertainment, nothing too serious, at times bit too generic and hence predictable.\r\nCharacters were pretty stereotypic. Main character Aito Yuuki is perverted mangaka who is especially interested in panties. He has several female assistants and female editor with whom he used to be classmates with. Most of the time Aito says and does stupid thingsthat makes those girls angry. Yet he is trying to be kind and decent fellow, he just can’t help himself. He often apologizes and begs for forgiveness. In the end all those girls actually like him, most in very tsundere way though, cheerful, although bit airheaded Rinna being an exception, she openly adores her ”sensei”.  \\n\\n\r\nAito is very dramatic and obsessed, so mainly the comedy was about his mad fetish for undergarments. I think nothing especially rememberable happens in this show. Some situations are pretty weird, and potentially funny, but I have seen so much ecchi comedies that I cannot say this would’ve been especially fun or creative in that regard.\\n\\n\r\nStory: 3 Poor\\n\r\nNot story to speak off, as usual in comedies romantic developments doesn’t happen and there is no over-arching plot really.\\n\\n\r\nArt: 7 Good\\n\r\nThis looked nice to me, no complaints. Nothing special though. Generic but good style.\\n\\n\r\nSound: 5 Mediocre\\n\r\nSeiyuus were good, there was lot of screaming and stuff and voice acting often sounded funny, even though nothing especially funny was happening. OP was good but ED was very long, bit boring and it’s style didn’t suit to this anime at all. It was too soft, emotional and slow compared to this anime. I had to skip it almost always. That’s why only Mediocre. \\n\\n\r\nCharacter: 6 Fair\\n\r\nStereotypes, tsunderes, sadists, perverts. Yeah not very unique characters.\\n\\n\r\nEnjoyment: 6 Fair\\n\r\nIt was okay, offered some laughs \\n\\n\r\nOverall: 5 Mediocre\\n\r\nNot a bad show, but it had nothing especially good to make it stand out from the rest. If you love panties this anime might be for you though. I don’t personally adore them that much to be honest, so  overall is only 5 this time.\\n",
            "date": "2018-07-25T08:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 284751,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Herr_Meister",
                "username": "Herr_Meister"
            },
            "url": "https://myanimelist.net/reviews.php?id=284751"
        },
        {
            "content": "Mangaka-San a short anime about a perverted manga artist and his female assistants in their daily lives.\r\nActual Score 6.8\r\nStory: 7\r\nThe story was pretty simple as it follows main MC Aito in his daily lives drawing manga with his assistant Ashisu while dealing with various other girls in his life. Their is no real main plot but is made up of small sketches that take over two per episode, which focus on one of the main girls and Aito with lots of comedy thrown in which is fun but can get a bit samey. \r\nArt: 7\r\nThe art is pretty standard with it being rather good norbad and doesn't ruin the experience.\\n\\n\r\nSound: 7\\n\r\nThe opening of the anime is up lifting and fun to watch and listen to as it fits into the slice of life feeling the show has; the ending is different in that it felt it didn't belong as it feels like it belongs to a romance anime rather than slice of life as is rather slow compared to the first.\\n\\n\r\nCharacter: 6\\n\r\nThe characters were fairly normal for a harem anime with the main cast only really appearing with few support characters, but even the main cast felt one-dimensional with them all going into character archetypes and having very little development, but they were fun and enjoyable to watch and interact.\\n\\n\r\nEnjoyment: 7\\n\r\nI did like it as make every know and then series as it was fun and a good idea for a short anime.\\n",
            "date": "2014-06-23T12:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 148245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=148245"
        },
        {
            "content": "This kinds of anime is very good in my opinion.. Because it combine both slice of life and comedy in a quite good anime.. I've read the manga and really enjoy both of them! I just hope they made it more longer and more many in anime because the anime one feels more good and easy to understand instead of the manga. Well the \" Ecchi\" Doesn't seems to frankly and I really enjoy it XD\r\nBecause personally Comedy and ecchi it is a bad combo.. but this one is different! I really enjoy both of them! You have to try this! It will worth yourtime!\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-12-01T07:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 204572,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5025358.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nyonyoh",
                "username": "Nyonyoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=204572"
        },
        {
            "content": "Despite all the jokes about Pantsu and ... vicinity is not something that has never been seen, still feel this anime comedy ecchi different from the usual. Perhaps the reason is because this anime is able tokeep itself so it does not get as bad others. Using job Yuuki as a manga authorecchi and to describe its behavior so that it looks so innocent, jokes in this anime was more likely to seem like an everyday occurrence, like the only form of delinquency an innocent child who has a way of looking a little unique, and not hokey irritating power of someone who is dirty-mindedor who continue to happen to accidentally forced repeatedly to good-natured young man who unusually lucky. In other words, even though he never stopped talking about things ecchi, anime is still prefers the comedy section, raised as a star in the show that the audience is always going first to laugh before she was uncomfortable with the topic being discussed. Erotisismenya level may still be too high for some people, but it does not prevent this anime from being a great comedy.",
            "date": "2017-02-26T15:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 241455,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241455"
        },
        {
            "content": "Pantz & Oppai!!! Haha! That's what I said.\r\nSpring 2014 anime is a breathe of fresh air from the terrible winter 2014 anime season. \r\nSTORY (8):\r\nThe story follows Yuki Aito, a manga author, who has an interest in boobs and panties. One day, Mihari Otosuna, Aito's editor, sends an assistant by the name of Ashisu Sahoto to work closely with him. Basically, crazy things happen.\r\nThe story has a lot of funny moments like for example when Sena is whipping Aito. Normally, an anime requires a beach episode, am I right?\r\nAnyway, jokes aside. Not only that, I did like the way how they develop Aito's relationship withthe girls. However, I feel that these episodes are not enough to make me get invested into the characters more. \\n\\n\r\nART (7):\\n\\n\r\nThe animation is all right. Nothing spectacular. \\n\\n\r\nSOUND (9):\\n\\n\r\nThe opening is more addictive than compared to the ending song. The opening \"Pure Impurities\" gives a fun and exciting vibe while the ending song \"Spica\" gives a melodramatic tone, like a sad tone actually.\\n\\n\r\nBoth opening and ending songs are sung by StylipS. One of the member is a voice actress of Mihari and her name is Arisa Noto. I will later get into her character soon.\\n\\n\r\nCHARACTER (8):\\n\\n\r\nYuki Aito was a person who is trying to be nice and helpful even though he has these perverted ideas of panties and boobs. In fact, I did like the way how he really grows as a character. He was just trying to be accepted into society. Yoshitsugu Matsuoka voiced this character especially Kirito from SAO. He did a great job in portraying the voice of Aito.\\n\\n\r\nAshisu Sahoto is calm and composed. Her character reminds me of Yukinoshita from Oregairu. Both characters are voiced by Saori Hayami whose voice sounds similar like Asami Imai & Noto Mamiko. \\n\\n\r\nRinna Fuwa is cheerful and she always cares for Aito. Her character design is similar to Megumi Yamamoto from Special A by the pink tops and her hair. \\n\\n\r\nAshisu Sahono is Sahoto's sister, I wished she has more material to work with because she is just there to watch on Aito & Sahoto. She is an interesting character.\\n\\n\r\nMihari is your tsundere type just like Sena Kuroi. Sena Kuroi was voiced by Rie Kugimiya who voiced a lot of tsundere characters. Even Iori Minase from Idolmaster. She keeps saying \"Hentai\"! \\n\\n\r\nEven though these characters have go through a development, I also feel that this anime is lacking in their back story. I just feel that they could have developed their character more so that at least I can be pulled into their profile. For what it's worth, I enjoyed the characters for the most part.\\n\\n\r\nCONCLUSION (8):\\n\\n\r\nI really did like the way how Aito guides Sahoto in making good manga. In fact, this anime has something which we can take back from. \"Be who you really are\", this quote tells us that when we do things, we have to put our heart and soul into it otherwise there is no meaning behind it. Just like be honest with yourself and go with what you love.\\n\\n\r\nI also wished that some characters have given more time to shine like Matome Minano. \\n\\n\r\nNevertheless, I did enjoy \"Mangaka-san to Assistant-san to\" and I give it an 8 out of 10.",
            "date": "2014-06-24T08:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 148357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=148357"
        }
    ],
    [
        {
            "content": "Nekoyaki here, watched this anime when staying over my pal's dorm, and really liven the atmosphere! Really great crack from matsuoka yoshitsugu!\r\nI've been reading the comic and also the sequel ones! There ya go, nekoyaki's favorite review, comedy~~~\r\nAt first why the heck scores that I give are really high?\r\nIt's story is really good (in the comedy way), the crack, stupid joke, usual ecchi joke, and else! Artwork is quick paced and my eyes were really enjoyed it! Music, good! Characters, all superb, cool ashisu, tsundere loli blonde, big-breasted tenden bokke, and childhood friend editor! \r\nBut for the romance, if you want more story or relationshipdevelopment, this anime would be a bad choice. Don't expect romantic development since Aito want harem. You can get cute expressions of the characters from the romantic atmosphere (sometime). \\n\\n\r\nKYAN! ECCHI! (in Matsuoka Yoshitsugu's voice). IS the very my own and friends impressions of this anime. Thanks to this anime for liven my overnight stay in my pal's dorm.\\n\\n\r\nFeel free to contact/support me~",
            "date": "2014-11-21T22:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 169451,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/169109.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nekoyaki",
                "username": "nekoyaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=169451"
        },
        {
            "content": "Mangaka-san to Assistant-san to is your basic harem/comedy anime and here is what I honestly have to say about it after finishing 12 episodes just recently.\r\nStory [7/10]:\r\nOk, here's the thing, I'm not saying the story is boring, matter of fact, I like it, but it's kinda cliché if you get me. The anime is episodic with each episode being unique every character of the show and each episode having a new comedic skit. \r\nArt [8/10]:\r\nWell, to be honest with you, there's not much I can say about the art. Zexcs did a brilliant job making the art soothing. Also, I love the character designs ofeach character. \\n\\n\r\nCharacter [9/10]:\\n\r\nAhaha, I'm speechless, I honestly love the characters in this anime. You have your two main characters, Yuuki Aito, who is a perverted manga artist and loves to draw panties and Sahoto Ashisu, who is Aito's assistant, who keeps up with Aito's schemes and sometimes tends to be caring for him. And you have your other support characters which I can't really talk about (the review would be long, so go watch the anime).\\n\\n\r\nEnjoyment [8/10]:\\n\r\n2 hours of my time well spent to be honest, this anime would go down as one of my best comedy anime. It did a great job making me love each character and I would love it if they make a second season (Zexcs, PLEASE), cause I don't mind watching this anime again.\\n\\n\r\nOverall, an anime worth watching by everyone who loves comedy/harem/slice of life anime",
            "date": "2015-10-26T01:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 202016,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4424627.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 0,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Epopee",
                "username": "Epopee"
            },
            "url": "https://myanimelist.net/reviews.php?id=202016"
        },
        {
            "content": "A good Alternate title for this Anime would be \"It's not sexual harassment if you're in a Harem.\"\r\nThe setup could best be described as a slice of life involving an incredibly perverted manga artist and the various shenanigans he and his editor/assistants get into. There isn't much in terms of story aside from that, with the exceptions of some plot-lines towards the end that flesh out the supporting cast in a really good way.\r\nThe comedy, as is the case in most ecchi animes, is based around setting up the raunchiest scenarios possible as the setup, with the character's (and by extension our) reactions to saidraunchiness being the punchline. In this framework, the show does about average, with I'd estimate as 3 or 4 scenes in particular being so memorable as to prevent this aspect from falling into mediocre territory.\\n\\n\r\nIn terms of characters, while the MC is a unlikable wretch, the show in the aforementioned fleshing out scenes at least explains why all the women around him haven't taken him to court. For me though, the MC can be overlooked as I found pretty much all of the supporting cast enjoyable. The fact that the great Rie Kugimiya voices one of the crazier characters certainly helps boost this category. But I would say, as a testament to the supporting cast, She wound up at probably 2nd place for me by the end of everything, meaning the rest of the supporting cast is pulling some serious weight.\\n\\n\r\nOverall, I would say this falls into the category of \"popcorn\" anime for me; not good enough to be a main course, but makes for an enjoyable snack when you have nothing else going on.\\n\\n",
            "date": "2019-04-09T23:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 305940,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7765031.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/FlagCrusherTaka",
                "username": "FlagCrusherTaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=305940"
        },
        {
            "content": "This is a short anime, composed of twelve 13-minute episodes and six 8-minute special episodes, which are pretty much exactly like the main episodes other than being shorter. It should be noted however, that the OP/ED is still present at the normal length for all of these, and hence in terms of content it's more like twelve 10 minute episodes, which is about half of a normal episode, and six 5-minute episodes, which is about a quarter. This is my first short anime, and hence I found that it felt even shorter than expected. It works fine with the structure of the anime however, whereineven these small episodes are composed of even smaller somewhat self contained short segments. The focus here is primarily on comedy and not on any sort of overarching plot. Now that's not to say there isn't a focus on characters, as many shorts are focused on developing or fleshing out the various characters, and it does a reasonably good job of that considering the time allotted. However, it's the comedy that the true draw of the anime, and I think that aspect is reasonably solid. It's not enough to constantly have you laughing, but it does stay pretty amusing throughout, and though there isn't a lot of range to it, primarily being focused on how strange or pathetic the main character is, the anime isn't long enough for the comedy to get repetitive, and hence I consider it pretty solid, and enough to successfully hold up the anime. The art and animation were okay. The OP/ED were decent.\\n\\n\r\nA short anime held up pretty well by its comedy.\\n\\n\r\n8/10\\n\\n\r\nI will also note that there was inherent amusement to be had in that the main character is voiced by the same voice actor as Kirito from SAO, and the main heroine is voiced by the same voice actor as Yukino  from Oregairu.",
            "date": "2018-09-16T18:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 289206,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=289206"
        },
        {
            "content": "The anime should have been named\r\n\"Young Harvey Weinstein: The Manga Artist\"\r\nThink of all the possible ways someone can behave inappropriately in a work place, this anime has probably got it\r\nIntentionally Fondling your assistant's boobs. Check\r\nTaking off the assistant's clothes while she is sick and passed out. Check\r\nRepeatedly commenting about your editor's boob size. Check\r\nThings like this happen several times in every episode and are presented as \"Jokes\".\r\nThere is only ONE \"joke\" in this whole anime and the punchline is MC Sexually harassing someone.\r\nCharacters are truly terrible.\r\nMC is one of the worst part of the show. If we take out the weird mannerisms and slapstick hecould easily be the villain/rapist in a hentai.\\n\\n\r\nThe rest of the cast is the collection of a generic cookie cutter harem members.\\n\\n\r\nThere is nothing worthwhile in this show. Don't waste your time on it",
            "date": "2018-09-10T21:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 288724,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4613499.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/LazyPanther",
                "username": "LazyPanther"
            },
            "url": "https://myanimelist.net/reviews.php?id=288724"
        },
        {
            "content": "OMFG.... [this is the only way i can describe this anime] anyways 1 more thing \r\nWTF is wrong with ep 8 it worse than boku no f*cking pico \r\nsigh......\r\nlets get started also before you start watching this anime be sure to be ready mentally and physically i ain't telling you why but be ready mentally and physically i warning you\r\nStory 7/10\r\ni rated the story seven because it just a story about a mangaka guy who likes drawing panties and due to his obssesion his manga is not that ppular being dead last in the most popular\r\nArt 8/10\r\nart was good especially if you watch the animein HD \\n\\n\r\nSound 8/10 \\n\r\njust like i said in my other reviews i don't really pay attention to the sound of the characters or the music of the anime honestly sometimes i just skip the whole opening song \\n\\n\r\nCharacter 9/10\\n\r\nwell worth remembering the characters if you like Ecchi equvalent to boku no pico and the anime is more of a harem but the harem genre is not encluded\\n\\n\r\nEnjoyment 9/10\\n\r\nit was good the funny moments especially \\n\\n\\n\r\nOverall 9/10\\n\\n\r\nP:S after watching this anime if you aren't mentally prepared and physically prepared call an ambulance",
            "date": "2018-05-20T20:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 281051,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178860.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FTOPICD",
                "username": "FTOPICD"
            },
            "url": "https://myanimelist.net/reviews.php?id=281051"
        },
        {
            "content": "Mangaka-san to Assistan-san is a show about a perverted mangaka with a bunch of female assistants, who does perverted things and then gets away with it because he's \"nice\" and...that's about it, really.\r\nAlready it is a bit difficult to buy into the premise, but good execution can make all sorts of things work - so, how is the execution? This is supposed to be a comedy, and it is by no means an ambitious one. That being said, I probably only genuinely laughed once or twice throughout the whole thing. I understand that humor is subjective, but the jokes were just not very well-crafted. Itis easy to see most punchlines coming from a mile away, which would not be as big of a problem if it wasn't applicable to almost every joke in the series, but sadly that is not the case. If you've seen one episode, you've seen almost all the jokes. \\n\\n\r\nFor instance (I just realized that I don't remember anyone's name - time to look those up!): Aito says or does something perverted. Sahoto, his assistant, not amused by his antics, tells him off in some way. Aito asks something to the effect of \"do you not like me?\" or \"do you think I'm creepy?\" and Sahoto responds that, yes, she finds him or his act to be creepy/perverted/annoying or what have you. Aito freaks the fuck out. Sahoto calms him down. \\n\\n\r\nThis kind of thing happens all the time and there is almost never any interesting twist on this joke, or any of the other uninspired, repetitive jokes. Usually if there is, the joke just becomes uncomfortable instead of funny (like a certain breastfeeding scene). Not that I have a problem with \"uncomfortable\" humor in and of itself, but the tone and characters of this series do not lend itself to that kind of humor, as it generally attempts to stay somewhat grounded (unlike, say, Prison School).\\n\\n\r\nSpeaking of the characters, they are not anything to write home about. Aito is a pervert obsessed with panties who often acts incredibly childish for a 20-something year old, and he's also a really nice guy who says nice things. That about covers it. Sahoto's personality is sort of deadpan and blunt, but she also has a bit of a domineering side to her. Mihari is an abrasive tsundere with a soft spot and the only one who gets any sort of development, although the way they presented her transition into a more abrasive personality in her backstory was a bit silly (it just kinda happened after she realized she had to leave personal feelings out of a work environment because she...stayed over at Aito's and, uh, did nothing in a situation where she could do nothing?) - perhaps the point of that was to be comedic, in which case it's no surprise that that may be lost on one not sold on the show's comedy. I don't expect development that's particularly meaningful from a 1-cour comedy with 10-minute episodes, but it could at least be interesting in that department. Sena is basically the same character as Mihari, sans backstory, but she also acts more childish and is weak. Sena and Mihari both have a crush on Aito for whatever reason, by the way. Rinna is a super cute girl who is completely incompetent and instantly loves Aito for no reason, and we are supposed to enjoy her stupidity because it's cute, apparently.\\n\\n\r\nYou might notice that the characters' personalities, sans Rinna, are a little inconsistent. This is not a bad thing on its own, but the problem is that we fail to see how the different aspects to each characters' respective personalities feed into one another. That is to say, it is not so much that the characters have many facets to their personalities as it is that they feel like different people when the situation calls for it. The characters' personalities were not handled with much finesse in this regard.\\n\\n\r\nTo the show's credit, it did at least show the audience that writing and illustrating manga is no easy task. Aito often has to pull all-nighters in order to get his manuscripts done (I don't get how he pulls off playing gal games for 10 hours on certain days though). Sahoto also has to try over and over to make her debut as a professional mangaka (I wonder how Aito managed, though, with how incompetent he often seems in the storytelling department). As you might guess, however, the execution still leaves much to be desired and it doesn't succeed in giving the show any flavor. Also, since the focus is on the comedy, this aspect ultimately isn't even that important.\\n\\n\r\nI watched the first two episodes with some folks on that rabbit streaming thing very late at night, and I watched the rest of it a few days later when I was half-asleep at 4 a.m. and felt that I wouldn't be able to comprehend anything else I tried to watch. I would only recommend this show under similar circumstances to those, but even then, there are still better options out there. I did not expect much, but I still felt underwhelmed in my semi-braindead state.\\n\\n\r\nNote: I said nothing of the audiovisuals in this review. That is because they are just unremarkable and therefore not worth mentioning. But I guess I did mention them after all, so there you go.",
            "date": "2016-08-20T18:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 227233,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2613313.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/fatdinosaur",
                "username": "fatdinosaur"
            },
            "url": "https://myanimelist.net/reviews.php?id=227233"
        },
        {
            "content": "If I was to describe \"Mangaka-san to Assistant-san the Animation\" with an emotion, I would probably say, \"hopeful.\" The beginning of the animation was certainly interesting, and for the harem lovers, it displays a great potential for a progressive love track, complete with hilarious let downs, awfully hidden attractions, and ultimate acceptance of the situation and the womans' feelings for our male lead. However, it does not quite play out like this, even with its immense potential to do so.\r\nStory - 4. The story starts off at a running pace, with the characters lined up and doing what they're supposed to do, and details oforigins are fed throughout the animation bit by bit. This is relatively common for an animation and there's nothing wrong with it particularly. However, the format is a leaves a bit to be desired. Each episode is a standard twenty minutes long, but each episode is only comprised of short stories, each of which do not flow very well together in terms of timing, setting, or happening events. On top of which, the progression of the story is quite stagnant, despite the suggestive hints that there would be a romantic progression for a storyline. I give it a 4 (which is described as decent) because of the suggestive hints, because it has the potential to be a romantic story as the writers probably wanted it to be. Unfortunately, the format just did not do it justice as the short stories did not allow us to invest emotionally towards an underlying plot.\\n\\n\r\nArt - 9. Skillfully drawn and animated smoothly, there's really nothing left to be desired in this department, as the transitions, were timed appropriately and the animation remained consistent whenever not transitioning.\\n\\n\r\nSound - 7. The sound does not have much to it either, as it was fluent, and abrasive, interrupting, or distracting. It honestly does not add to the animation as some would manipulate sound to do, but it does not take away from the animation either. Making the sound simply, no more and no less, \"good.\"\\n\\n\r\nCharacter - 5. The characters all seem very unique and interesting. Again giving them great potential as individuals for people to relate to and/or cheer for as the story progressed. Unfortunately, the format again worked against this particular category. With the short stories focusing on the task at hand, there was really no room for character development. There was no time for character development, and there was certainly no time for viewers to invest in characters emotionally.\\n\\n\r\nEnjoyment - 7. I had fun with this animation, as each episode was pretty nonsensical comedy with hints towards a deeper meaning. It was fun to watch the characters unique interactions as they encountered each other in different situations, with the male lead being the pivot for what would happen in each encounter.\\n\\n\r\nOverall - 6. The deal breaker would just be the format, as it did not allow me to feel a story unfolding, nor characters to relate to, and that truly is regrettable, as I would have loved to see the actual underlying story and root for a character as each path our male lead takes brings him closer to one of the female characters.",
            "date": "2016-06-10T16:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 220447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1311859.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/weiluntong",
                "username": "weiluntong"
            },
            "url": "https://myanimelist.net/reviews.php?id=220447"
        },
        {
            "content": "Most unnecessary \"ecchi\" tag ever. It is true that the talk about panties are common and you can see some really small talks about breasts as well however it is nowhere near enough to give this an ecchi tag. You never see ANY nudity, not one bit in this anime. I am not talking about nipples, there is not even any revealing clothing except a few scenes and 1 standard swimsuit episode. Although the main character talks about how panties are world's treasures here and there, other characters never do that. Dirty jokes makes up at most half the show and they are as lightas it gets.\\n\\n\r\n\"Harem\" tag there is also a bit incorrect.  While calling this show \"harem\" is much more legit than calling it \"ecchi\", it is still nowhere near enough in my honest opinion. This show doesn't have any romance in it. It is only indicated, and even this indication is extremely rare. Show doesn't even have a considerable plotline to contain romance. You won't even see just one scene with any girl getting jealous. I think although not completely a mistake, I should say that it is barely a \"harem\" title. If you are going to pass this show just because it has a harem tag, you shouldn't worry about it.\\n\\n\r\nOn to the actual review then:\\n\\n\r\nThe story follows a mangaka and his interactions with a few girls. 3 of them are his assisstants, 1 of them is his editor also on some rare occasions there is an imouto and a kuudere loli. Most of the story is about he is doing something idiotic like buying lots of panties to be able to draw them well or making innocent yet dirty comments like \"I like your boobs small\" to the girls. It should be noted that none of the jokes are negative towards characters and not really directly about sex. In that regard jokes are not as dirty as Seitokai Yakuindomo for example.\\n\\n\r\nEvery episode is 13 mins long and even divided into 3 pieces. All of them are funny and light. Nothing serious happens.\\n\\n\r\nArt and animation is good. I really liked the characters and scenes. Emotions are very well done on the character's faces and their eyes are somehow looking too good. Cute girls look cute, beautiful girls look beautiful. Nice job here.\\n\\n\r\nVoice acting is amazingly well done.\\n\\n\r\nCharacters are all likable. They are all stereotypes to some extent but they have their consistent personalities. You can't hate any of them.\\n\\n\r\nSound is ok. It is as good as it gets for such a light hearted, short comedy.\\n\\n\r\nResult is a nice and short comedy anime I recommend to everyone unless they are extremely (EXTREMELY) sensitive to light dirty jokes. \\n\\n",
            "date": "2016-04-06T06:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 215661,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2461397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sk8erbyern",
                "username": "sk8erbyern"
            },
            "url": "https://myanimelist.net/reviews.php?id=215661"
        },
        {
            "content": "Honestly, this show is one of the best I have seen if you need something to watch to just make you happy and improve your spirits.  It's constantly making you smile/laugh and is highly enjoyable.  If you only watch shows for an in depth story though, this show might not be for you.\r\nStory: 5\r\nI give it a lower score here only because there isn't really much of a story.  It's just a guy writing manga and having a blast doing stupid shit.\r\nArt: 7\r\nI really liked the art and the grills were all Kawaii/10 so thats good enough for me.\r\nSound: 7\r\nI thought itwas pretty good, but not great.  I don't really have issues with sound for most shows, so I don't have much of an opinion on this one.  Didn't stand out in a good or bad way.\\n\\n\r\nCharacter: 9\\n\r\nI really liked basically every character.  Harem with many different types of girls, covered most common ones.  MC was hilariously perverted.  If you don't enjoy perverts, probably not for you.\\n\\n\r\nEnjoyment: 10\\n\r\nHonestly, I was either smiling or laughing for about 80% of this show.  Hilarious interactions between the MC and the girls.  Has a little romance in it, but nothing serious.  Kinda a tease in that aspect.\\n\\n\r\nOverall: 9\\n\r\nI liked the MC, all of the girls, and the idea behind the story.  I don't really care about a complicated story, so this simple one was great for me.  Comedy was on point and the ecchi wasn't overwhelming, but it was a nice addition.  I've watched it twice so far and I enjoyed it equally each time.",
            "date": "2016-02-08T14:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 210453,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skillzrock",
                "username": "Skillzrock"
            },
            "url": "https://myanimelist.net/reviews.php?id=210453"
        },
        {
            "content": "Oh frell, another ecchi, harem, comedy; let’s prepare for the series of clichés and tropes to parade forth and justify the hatred this genre gets. HANG ON… this series isn’t as bad or clichéd as most other entries in this genre and that makes it work. First, it’s not heavy on the fanservice, of course there is some but it doesn’t go out of it’s way to throw upskirt shots at you; and lacks giant breasts with physics that only exist in anime. Even I get tired of that last one and I’m a pervert. \r\nThe main reason this show works is because of themain character, Aito. Yes he’s a pervert but that doesn’t make him a bad person. And the relationship he develops with the other cast members showcases how society teaches that a pervert is intrinsically a bad person. Accidents and misunderstandings are met with wholly justified reactions simply because of the knowledge that Aito is a pervert. But then there are the quiet tender moments when the girls get to see there’s more to Aito than just the fact he’s a pervert. He actually is a person with hopes and dreams. \\n\r\nAnother reason the show works is the fact that the girls aren’t just head over heels in love with Aito for reasons that are never explained. In fact it’s quite the opposite; Otosuna & Kuroi must hate his guts given the way they behave. I loathe the harem show with the main character surrounded by a harem of girls who all like him and he never chooses one for reasons that are never explained (I’m lookin’ at you Tenchi Muyo!). \\n\r\nAnd, they’re all adults in the work environment. That gives it a more realistic feel as schools are conformity factories; while the work environment forces individuals to adapt and tolerate different individuals with unique personality quirks. The cast is unique and varied so they don’t blend together. The colors are rich and vibrant, and I was especially fond of the mono colored background extras.\\n\r\nIn conclusion I found it better than most shows of this variety.It is what it is and doesn’t try to pretend it’s anything more. It does serve as an amusing reminder that perverts are people too and just because someone is a pervert doesn’t mean they a violent felon. I recommend it.\\n\\n\\n",
            "date": "2016-12-10T21:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 235228,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=235228"
        },
        {
            "content": "I think this is less Harem/ecchi fantasy, and more shallow anime with no emotion characters or any meaning, I get this after the actual introduction of characters, \r\n     A world where rejection and isolation is praised then a loud scream and bang which I don't find funny I find it sad.\r\nSo for the story it is a slice of life with constant bad jokes,\r\nnothing original very plain and boring.\r\nThe art is acctualy enjoyable with average defining and less so with movement.\r\nThe characters have a good design, but are all a blank slate with no personalityin the same empty basket around the same feeling, just like drawing neghbours as a background then zooming in.\\n\\n\r\nI did ejoy a few laughs at some first scenes but that after that very few and far in betwen.\\n\\n\r\nOverall i'm very bored after 6 semiepisodes and don't recomend it, i find the claimed genres misleading: a poorly attempt at them badly executed,they should be more focused if they can't handle some complexity.\\n\\n\\n\\n",
            "date": "2016-05-02T01:27:00+00:00",
            "helpful_count": 0,
            "mal_id": 217677,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2491307.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/zh0so",
                "username": "zh0so"
            },
            "url": "https://myanimelist.net/reviews.php?id=217677"
        }
    ]
]