[
    [
        {
            "content": "In the heat of all the millions of One Punch Man reviews, I've decided to take on the task of reviewing this series onto myself. This will be quick and spoiler free, yay!\r\nOh Monogatari, a strange one you certainly are. The way I see it is that there are 2 types of reviews for this series - the people praising it for being a complete masterpiece of the modern age with no flaws what so ever and the people that hate it for... what again? Oh that's right, it's \"devoid of a functioning storyline and character development\" as pointed out by some pleb on thiswebsite. Now, I respect your opinion and everything but..  you're wrong. \\n\\n\r\nWhat's so special about this series is how it handles exactly that. It doesn't follow a strict route in storytelling, it just kinda does whatever the hell it wants. Apart from the occasional obnoxious panty shots I think the story is very unique and engaging for the most part. As for the characters - you've got our protagonist who while being a borderline lolicon also happens to be a vampire, a sadistic tsundere with a daddy complex, a cat girl, etc. Point is that if not on the most complex side of things (also arguable), the cast is one of the most entertaining I have ever seen. The story combined with these characters and breaking the 4th wall humor makes this show what it is. However while I do praise it, the fact still remains that the Monogatari series is an overrated one.\\n\\n\r\nPretty edgy, huh? Anyway, Owarimonogatari is the final installment of the Final Season and it focuses on the mysterious transfer student, Ougi Oshino, who is seemingly Oshino Meme's niece. Ougi has appeared through various arcs of the series but never really got over an episode of screen time as far as I can remember. Something interesting as well is that Kanbaru referred to Ougi as a guy, what gives? So yeah, not knowing a characters gender is pretty mysterious to me. Owarimonogatari is divided into 2 arcs or 3 parts - Sodachi Riddle / Sodachi Lost and Shinobu Time.\\n\\n\r\nThe first arc is very mystery driven. It starts off with Araragi and Ougi getting trapped in a classroom. Pretty plain and simple, right? Turns out that a pretty big event took place in that classroom a couple of years ago. Soon after we get introduced to Araragi's former classmate who seems to hold some kind of grudge against him. To be honest, I thought I was going to hate this character. While I still somewhat do it turns out that she is a lot more complex than I originally imagined. What is her story and how is she related to Arararagi apart from being his classmate? That's pretty much all that can be said without spoiling. There also happens to be a pretty cool random James Bond reference thrown in there because why not.\\n\\n\r\nSurprisingly enough, even though the 2nd arc is called \"Shinobu time\" there is no Shinobu to speak off for the first 2-3 episodes. No worries though, the show does compensate. We start off with Araragi meeting up with Kanbaru in the middle of the night in the abandoned school. The possibilities of that scenario are endless but sadly Koyomin is just acting on orders of Gaen, as we knew she wanted to meet with Kanbaru. All of a sudden a strange samurai appears. After seemingly defeating him they realize that it was just an empty suit of armor. The building is then lit on fire but they are saved by Yotsugi. Saying anything else would be getting into spoiler territory so let's avoid that.\\n\\n\r\nKanbaru has also gained quite a lot of best girl points from this arc. Every moment with her is just pure gold, she may provide the best fanservice in the entire series actually. \"Eat up!\" All that was needed was more of Senjougahara and/or Kaiki-chan but I'll let it slide this time.\\n\\n\r\nThe production value is top notch as to be expected from Shaft. The entire Soundtrack is filled with variations of music that work perfectly as the series changes tone and the voice acting is great as always. It might just be me but I feel like this is the peak of the Monogatari series in terms of animation. Everything just looks so smooth and nice to look at. Probably just me though, amazing nonetheless.\\n\\n\r\nSo all in all, Owarimonogatari follows the same general formula as all of the other series, filled with witty dialogue, amplified by all the shaft shafting. Should you watch Owarimonogatari? Probably, just keep in mind that it's not as good as Bake or Second Season and that the 2nd arc is inferior to the first. 6.5, best of the season.\\n",
            "date": "2015-12-19T10:55:00+00:00",
            "helpful_count": 115,
            "mal_id": 205994,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4723931.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Captain220",
                "username": "Captain220"
            },
            "url": "https://myanimelist.net/reviews.php?id=205994"
        },
        {
            "content": "The Monogatari franchise has been a creative narrative with some of the most intriguing dialogues found in the light novel medium. Owarimonogatari isn’t so far different either as the series takes on three separate arcs that is molded into 1-cour adaptation of 12 episodes. Adapted by studio Shaft, which is well known for an avant-gante style of artwork, the series makes it bold return. And any fan of the Monogatari franchise should be excited because this latest work will leave some classic memories.\r\nFor storytelling, Owarimonogatari is divided into three parts. They are known as “Ougi Formula”, “Sodaichi Riddle”, and “Sodachi Lost”. All three parts drawsconnections with each other that interconnects the story as a whole. Araragi is once again a centerpiece for the story. But that’s not all, there’s also the mysterious Ougi who plays a sort of lead character to guide others. The most pivotal moments of the season involves Ougi’s relationship and conversation with Araragi. Their interactions brings about a battle of emotions and bizarre mystery from two years ago. Ougi Formula covers Araragi’s growth as a character and how he uses his experiences to solve problems. What I also find interesting for the episodes of this arc is the clever geometric usage of the artwork style. Add a bit of mathematics and you’ll feel like it’s back to school.\\n\\n\r\nSodaichi Riddle takes on a different approach, one that’s more based on personal problems and also pits Araragi with his former classmate, Oikura. The interesting parts about these episodes is the amount of emotional expression. Oikura’s hatred for Araragi is explained based on her past background story that has connections with him. Tsubasa Hanekawa also gets involved that pits her in a unique angle between herself, Araragi, and Ougi. Speaking of which, Ougi’s presence in the show is still the most mysterious. It’s hard to trust or know what her true intentions are. However, her role in the arc is meaningful as she guides Araragi to the truth. Yet at the same time, Ougi’s actions seems to also suggest that she is attacking Araragi’s insecurities. Hanekawa’s role in this arc seems to stand for as an antithesis of Oikura’s character, especially in family values. What the arc ultimately brings is an iconic buildup and execution in Monogatari fashion at its finest.\\n\\n\r\nSodachi Lost, the final part of the season, brings together the reunion of some of the characters from the Monogatari franchise that fans are well aware of. These include Shinobu, Gaen, Kanbaru, and even Ononoki will feel like a refreshing sight. The arc also introduces some other mysterious supernatural beings that while seems gimmicky can also be unique. Their role in the arc is also very important that makes the story compelling. For fans who are familiar with Bakemonogatari, it will even feel somewhat nostalgic with the strange apparitions that makes their appearances. Do be aware that the timeline and info dumping of this arc can feel confusing at times so it’s better to rewatch some scenes carefully. However, the reward is the distinctive amount of word plays with Shaft’s clever adaptation. Furthermore, there’s some attractive references and facial expressions coming from Araragi. Kanbaru’s role as a comic foil is also fun to watch especially with some of her suggestive innuendo jokes.\\n\\n\r\nThat being said, Owarimonogatari is a unique show but definitely not something everyone can get used to. For any new fans, watching this show will feel confusing even with knowledge of the previous seasons. The most enjoyable way I find to watch this season is getting a feeling of attachment with the characters. In particular, Ougi is the most mysterious of the cast and it’s intriguing just to anticipate what she will do next. Her unpredictable behavior will often get viewers thinking what her true intentions are. Araragi’s interactions with the others will show more of his character on a more personal level. Add a bit of comedy and this will feel quite like an unorthodox adventure in Monogatari style. On the other hand, the season does omit some parts of the novel. Not every adaptation can be focus on a panel-by-panel level after all.\\n\\n\r\nAs with most Monogatari series, Shaft once again proves that it’s capable of delivering its clever artwork. There are many word plays that works well in conjunction with the dialogues. There is also three different OP theme songs for each of the different arcs that is quite artistic with the style it delivers. Most often, I find a lot of the scenes for this season to be fun to look at whether they are for plot development, comedy, and references. The show appears to be self-aware of its own traits and have fun with itself. Just be aware that there is an abundance amount of sex jokes and suggestive references as some fans may find it uncomfortable to watch at times. In addition, character designs are also fairly unique. Ougi’s black hollow eyes and ambiguous gender is one of the most bizarre character designs I’ve seen. Not to mention, her pendulum-like body movements reinforces her mysterious presence and role overall for the season. Swinging back, swinging forth…\\n\\n\r\nSoundtrack is also a unique feature that I think not too many people notice often. But when examining it more carefully, it’s iconic. The eerie mood of the season in all three arcs can only work with the dynamics of the OST. And to be quite honest, it fits very well. Furthermore, the character voices matches in credibility with the personalities of everyone this season. Again, I have to emphasize that Ougi’s voice is the most mysterious. Kaori Mizuhashi’s performance with her character is to be praised as she is able to step into the shoes of such a character. Finally, the ED theme song has a nice eerie rhythm with its thrilling cinematics.\\n\\n\r\nOwarimonogatari is a fairly unique show for its ability to convince viewers to watch and read at the same time to appreciate the story. By reading, I mean it more like trying to understand what the characters’ roles, dialogues, and word plays mean. It may feel like a brain fart at times but also fairly entertaining to comprehend the story’s intentions. The emotional expressions and character interactions will be what seasoned fans will expect – dynamic and one that continues with a thrilling resurgence with its trend. It’s twisty that’s filled with mysteries and moments that will tear the house down.",
            "date": "2015-12-19T07:42:00+00:00",
            "helpful_count": 114,
            "mal_id": 205976,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=205976"
        },
        {
            "content": "The final season for the Monogatari series...I never thought I'd reach this point. This obviously isn't the final show for the series. There's still the 2nd cour for Owarimonogatari, a bunch of Koyomi arcs and Kizumonogatari.\r\n(There will be SPOILERS in my review)\r\n[Story]: (9/10) (SPOILERS)\r\nOwarimonogatari is a sequel to Tsukimonogatari but it does not take place after Tsuki.  The first 3 arcs chronologically takes place after Onimonogatari and Nekomonogatari: Shiro and the last arc chronologically takes place immediately after Onimonogatari. The show features Ougi Oshino, an underclassman introduced to Araragi by Kanbaru Suruga. \r\nI thought Second Season was going to be the only Monogatari seriesthat's better than Bakemonogatari. I mean, out of 6 Monogatari that was released, only 1 was able to beat Bake and that's Second Season. After finishing Owarimonogatari, it's safe to say that there are now 2 Monogatari that is better than Bakemonogatari and that's Second Season and Owarimonogatari. I'm going to explain as you read through the review. \\n\\n\r\nThe series is divided into 4 arcs...These arcs are called \"Ougi Formula\", \"Sodachi Riddle\", \"Sodachi Lost\", and \"Shinobu Mail. I guess you can count Sodachi Riddle and Sodachi Lost as one arc because these 2 arcs revolve around the same character except both arcs have 2 different mysteries. Just do whatever feels best for you. In this review, however, I'm going to count the 2nd and 3rd arc as one whole 2nd arc. \\n\r\nNow this is where the spoiler comes in. In fact, at this point, it's going to be filled with heavy spoilers as I'm going to review each arc. Just like I did with Second Season. \\n\\n\r\nThe first arc is \"Ougi Formula\". Technically, this arc lasted for 2 episodes but this was a one hour episode. So..what's in this arc? Basically, Ougi and Koyomi are trapped in a classroom and they start thinking of how to get out of the classroom. Is that it? No, that's just a simple summary. In fact, this is the first arc in the whole series that doesn't deal with any aberrations. In other words, this arc is like one of those mystery novels. A mystery that's got something to do with one of Koyomi's past. The dialogue scenes in this arc are really engaging. This is why I love mystery, it forces me to ask questions about this and that and Ougi Formula also did the same thing for me. I was asking questions such as the relationship between Koyomi and Sodachi, who actually stole the test answer sheet, and et cetera.  The mystery of this arc was well thought out. It was actually almost similar to Hyouka's mysteries with an added Nisio Isin flair in it and the answer to the whole mystery was pretty unpredictable. I mean, first second you thought you figured out the answer, the next second, they throw more information at you that invalidates your previous answer. \\n\\n\r\nNext up is Sodachi Riddle/Lost arc. Just like the first arc, this was also a huge \"mystery\" arc that doesn't have to do with any aberrations. The first half of the arc (Sodachi Riddle) basically expands the first arc and starts to ask more questions like \"who is Sodachi\" and \"why does Sodachi hate Koyomi like he murdered her family?\". This arc also visits Koyomi's past and explains why he is the way he is right now. The second half of the arc explores Sodachi and her parents and what actually happened to her mom. \\n\r\nI honestly DO NOT GET why some people hate this arc. Please give me reasons..One of the reasons why I love this arc is it's something different from your usual \"girl's abberation problem\" arcs that you've seen countless times in previous Monogatari series. Another reason is I'm a big fan of mystery. The way the mystery is handled in this arc is just absolutely amazing. \\n\r\nLet me give you a few mysteries that was from the Sodachi Riddle arc. Why did Sodachi begin teaching Koyomi \"Math\"? Why did Sodachi specifically choose Koyomi and invited him into her house? Why does Sodachi hate Koyomi's guts?. You think you know the answer? Wrong, you don't (Unless you've seen the show). The answers to these mysteries are not as straightforward as you think they are. The mysteries are so well-thought out that figuring out the answer to said mystery is complicated as hell unless you hear the character's backstory. Even their backstory might not be enough, unless you're a smartass. \\n\\n\r\nLastly, the \"Shinobu Mail\" arc. Unlike the first 2 arcs, this arc is all about \"aberrations\" again. It's not a new \"aberration\" though. This arc just expands and wraps up on the story Shinobu told to Araragi in \"Shinobu Time\" arc. The arc took place during (or slightly before) the events of the Tsubasa Tiger arc so they finally showed us where Araragi came from before jumping in to save Tsubasa. Anyways, you remember that first minion that Shinobu was talking about right? You better because he makes a return for this arc. The reason why he returned is actually rather kind of sweet...I think. At first, I thought he had some kind of diabolical plan but turns out, he just wants his sword back and wants to apologize to Shinobu for what he did 400 years ago. There's a bunch of reasons why I love this arc so much. Firstly, the Araragi and Kanbaru pairing and no I'm not talking about pairing as in love pairing. It's just like the previous Monogatari series where Araragi and X female character pairs up together to solve a mystery/problem. I love their pairing because it creates tons of hilarious moments. Half of it being perverted. Secondly, I just love the character dynamics between Araragi and Shinobu. If you see these 2 characters together, it creates a ton of best moments. Third and lastly, obviously is the character development for Shinobu and Kanbaru. The only downside to this arc is it felt a bit underwhelming. The dialogue scenes aren't really on par with the Second Season. However, I'm not saying that the dialogue scenes were bad. They were pretty good actually.   \\n\\n\r\nPutting the story aside, I now want to talk about the show's 3 points. Fanservice, the Pacing, and the dialogue scenes. Firstly, the amount of fanservice scenes in Owarimonogatari is almost the same as Second Season. In other words, there's a not a lot..Thank.God!. Secondly, the pacing of the show is great. For a 12 episode anime, they managed to have the same pacing as Second Season which I found to be almost perfect. They didn't go too fast like Bake nor did it go too slow like Hana. Third and lastly is, of course, the dialogue scenes. It's back which is not a surprise. The dialogue scenes for the first 3 arcs are great and like I said above, the dialogue scenes for the final arc is a bit underwhelming but it's still pretty good. \\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (10/10)\\n\r\nThe visuals and animation of Owarimonogatari looks great..I mean, if you've already seen Tsukimonogatari then you shouldn't have any problems with the animation as the 2 shows have the exact same animation. The character designs looks great too, especially the way Ougi is designed. To this day, I'm still wondering why her eyes looks different than the rest of the characters. \\n\\n\r\nEver since Tsukimonogatari, the flashing text that appears randomly on the show has been different. Owari is no different. The way they designed the flashing text resembles the character's arc. For example, the flashing text in Sodachi's arc has a bunch of drawings on the background that resembles math and algebra. \\n\r\n______________________________________________________________\\n\r\n[Sound]: (8/10)\\n\r\nHonestly, I was quite disappointed with most of the show's OP theme song. Before I get into that, I want to get into the soundtrack of the show. Just like the previous Monogatari shows, a background theme would play every time a dialogue scene plays out. So did Owari's background theme impress me? Of course, it did. It just made the already-engaging dialogue scenes more engaging. Now the OP and ED theme songs. \\n\\n\r\nThe OP theme songs are \"Decent black\" by Ougi Oshino, \"mathematics\" by Sodachi Oikura and \"mein schatz\" by Ryuichi Takada. The ED theme song is \"Sayonara no Yukue\" by Alisa Takigawa. I'm going to have to be brutally honest here..the 2nd and 3rd OP theme song sucks. Sodachi's VA is a crappy singer and I still have no idea what's the deal with Shinobu's VA not being able to sing in an opening. The only great OP theme song for Owari is the first one and it only played for 1 episode. I gotta say though, SHAFT put in a lot of effort on the 1st OP theme song even though it's only for 1 episode. The ED theme song sounds pretty decent but the Second Seasons' ED theme  song is still better. \\n\\n\r\nMaybe this is just me but I didn't like Sodachi's VA that much. It's not that she's bad or anything..Her voice just doesn't fit. She sounds like a 35-40 year old girl. If her voice was a bit lighter then it would have fit. Ougi's VA, on the other hand, is f*cking amazing. She has that voice that makes her a more mysterious person than she already is. That's all the VA's I'm going to review. \\n\r\n______________________________________________________________\\n\r\n[Characters]: (9.5/10) (SPOILERS)\\n\r\nIf you were expecting characters like Senjougahara, Koyomi's sister or even Kaiki then don't. Senjougahara barely gets any screentime and the last 3 characters I mentioned did not make an appearance at all. I guess it's only fair. They already got enough screentime in previous Monogatari shows. There were some major characters that made an appearance like Hanekawa (Sodachi Lost), Kanbaru and Yotsugi (Shinobu Mail). I now want to focus on characters such as Ougi Oshino and Sodachi Oikura. I'll also also get on other characters if I can but I'm going to have to write it shortly. \\n\\n\r\nAfter making many mysterious appearances in previous Monogatari shows, Ougi finally gets her own arc here in Owari and obviously, some background about her and who she really is. In short, she is a transfer student and is introduced to Araragi Koyomi by Kanbaru Suruga. Even after getting her own arc and being a major character in Sodachi Riddle arc, she's still the most mysterious and the most creepiest character in the Monogatari series. I mean, why does her eyes look so dead? Just try looking at her eyes for an hour and see if you don't get any nightmares. What's more mysterious about her is the fact that she's as smart as Sherlock Holmes. She's the one who solved the mystery in \"Ougi Formula\" and \"Sodachi Riddle/Lost\" arc. She even provides concrete evidence to support her conclusion. I really want to know which part of the Oshino family gave her that trait because Oshino Meme is a bum and not a smart-ass. \\n\\n\r\nNow that's out of the way, I'm now going to talk about Sodachi Oikura. Sodachi is a new character introduced in Owari. Unlike most of Araragi's harem *cough I mean, the girls having an aberration status, Sodachi doesn't have one. The show instead uses Sodachi not only to build her character but to develop Araragi's character as well. Turns out, Sodachi had a terrible childhood past. Calling it \"terrible\" would be an understatement. \"Horrific\" is probably the word I'm looking for. Anyways, Sodachi didn't have a great childhood. She had terrible parents, her mother died in a locked room without her knowing (she probably knew) and what's worse is Araragi forgot the reason why he is what he is today. Basically, Sodachi is the reason why Araragi has loads of friends and why he is great at math. \\n\\n\r\nLast characters that I want to talk about are Hanekawa and Kanbaru. Hanekawa got a fair amount of screentime in Sodachi Lost arc. Instead of Ougi helping out in this arc, Hanekawa helped Araragi out. I will leave the interpretations to you on why Hanekawa helped Araragi out and not Ougi. Kanbara also got a fair amount of screentime in Shinobu Time arc. Kanbaru really surprised me in this arc and might have became one of my new favorite characters in the Monogatari series. If you've seen Episode 11 then you know what I'm talking about. That's right, the conversation between Kanbaru and Shinobu. Kanbaru just put Shinobu to shame with their argument. \\n\r\n______________________________________________________________\\n\r\n[Enjoyment]: (9/10)\\n\r\nI didn't really enjoy Owari as much as Second Season but I definitely enjoyed the show way more than Bakemonogatari. If \"Shinobu Mail\" was as great as the Second Season's arc then I would have enjoyed Owari as much as Second Season. \\n\r\n______________________________________________________________\\n\r\n[VERDICT]\\n\r\n\"Owarimonogatari\" is a great addition to the Monogatari series. Owari is definitely on par with the Second Season in terms of great character arcs, pacing, and the characters and Owari is a lot better than Bakemonogatari; making Owari the 2nd best Monogatari series just under Second Season. The only issue I found in Owari is the \"Shinobu Mail\" arc which felt a bit underwhelming compared to Second Season. It's still a great arc though. \\n\\n\r\n[OVERALL]: (9.3/10)\\n\\n\\n\r\nPros:\\n\r\n+Great Story\\n\r\n+Mystery-like arcs\\n\r\n+Dialogue scenes are as engaging as ever\\n\r\n+Outstanding and Unique Animation\\n\r\n+Soundtrack was not heavily changed\\n\r\n+Main heroines of all arcs are fleshed out and developed\\n\r\n+Second Season's near-perfect pacing returns\\n\r\n+Fanservice reduced significantly\\n\\n\r\nCons:\\n\r\n-2 out of 3 OP theme songs are terrible\\n\r\n-\"Shinobu Mail\" felt a bit underwhelming compared to Second Season\\n",
            "date": "2016-01-16T10:07:00+00:00",
            "helpful_count": 36,
            "mal_id": 208658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=208658"
        },
        {
            "content": "To start with the good news, Owarimonogatari is a breath of fresh air in this rather stale year in animes. The bad news? While its second half provides hints of what was the aftermath of Kizumonogatari film to be aired next year, it is one of the worse arcs in the Monogatari universe.\r\nStory and Character: 6/10\r\nThe Sodachi Lost Arc is an oddball even by Monogatari standards. It started with solving the supernatural right away then proceeded with detailed explanation behind the titular character in the arc. The pacing is slower than normal albeit more even which gave enough time to layout the foundation of thisfantastic case and the characters to develop well. For the plot, it is straightforward this time and avoided some irritating Monogatari quirks that marred the show.\\n\\n\r\nEvery character was utilized to the extent that removing one of them leads to the series' failure. Sodachi, in particular, stood out given her neurotic nature and her background which justifies why she hates Araragi. Ougi, on the other hand, is still an enigma to the viewer but is not as abrasive during her presence in Shinobu Time so she gets a pass. The arc also gets a big plus because Araragi is not portrayed as your typical loli-loving pedophile but as a person who is trying to resolve some issues in the past and is trying to find the missing part of him which he repressed in his memories. Moreover, the Sodachi Lost Arc explained as to why Araragi was like what we saw through the course of Monogatari series.\\n\\n\r\nIn that sense, the first half of Owarimonogatari could be viewed as a coming of age story because Araragi and Sodachi managed to settle everything between them. As for Araragi, he finally reconciled with Sodachi. As for the latter, she is now able to move on because she found what she hoped to look for. (Spoiler: It's not romantic in nature)\\n\\n\r\nThe end product is a compelling and emotional piece that is reminiscent of what Monogatari can offer in its prime. \\n\\n\r\nThe second half? Not so much. The disappointment could be from the unrealistic expectation Owarimonogatari brought but it is no doubt that this arc is one of the subpar ones in the series. The majority of Shinobu Mail did what your typical bad Monogatari episode does: there was too much talking that did not move the plot.\\n\\n\r\nThe bad omen began when this particular arc opened with Araragi and Kanbaru had their banter which was seen too many times in the series that the jokes grew old. Gaen talks too much to the extent that her ramble took half of an episode with much of the details flying to the viewer's heads. The comedy in Shinobu Time didn't help either. This is because we already saw those jokes and there are certain points in the series where you have to really know Japanese to appreciate some of their gags. \\n\\n\r\nWhich was a shame, because the premise of this arc could be the more nuanced than the first arc. We have Shinobu and her first minion showed again after being supposedly dead for 400 years. How cool was that? Instead, we get an unnecessary slow arc with Gaen side trips and loli-tripping that took four episodes to be good. The output is just as emotional as in Sodachi Lost Arc but the way this arc was executed was really questionable.\\n\\n\r\nSound: 8/10\\n\\n\r\nAgain, Shaft is still excellent in providing the right music for a Monogatari show. It knows how to employ OSTs with fast beats when the characters try to come up with something and strings when things go dramatic. The soundtrack helped both arcs in reaching the emotional impact the studio wants. The OPs and the EDs are also strong in this one which is typical for the Monogatari series.\\n\\n\r\nVisuals: 8/10\\n\\n\r\nNow that's where this series excelled. While it may not be able to beat One Punch Man visually, it succeeded in entertaining its audience by its visual quirks. Keeping an audience awake over the span of 24 minutes is a tall task if the characters are just talking for most of the time. Shaft pulled every trick from its sleeve that ranged from visually fun (Araragi and Kanbaru's BL-centric banters) to entirely neurotic (Araragi's class search for the culprit).\\n\\n\\n\r\nEnjoyment: 6/10 (8/10 for Sodachi Lost Case and 4/10 for Shinobu Mail) \\n\\n\r\nOwarimonogatari still stands as one of the best shows in 2015 due to the lack of competition. However, if the second arc is the indication of what will happen in Kizumonogatari, it's getting real hard to be excited for the next Monogatari series.",
            "date": "2015-12-20T05:05:00+00:00",
            "helpful_count": 26,
            "mal_id": 206098,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4369563.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/samui26",
                "username": "samui26"
            },
            "url": "https://myanimelist.net/reviews.php?id=206098"
        },
        {
            "content": "(9.0/10)\r\nA pure, distilled version of what made both Season 1 and Season 2 so fascinating, Owarimonogatari works on almost every level. \r\nIf I were to write a review of the entirety of season 3, i'd include Tsukimonogatari, however, that's a separate review, so feel free to look at my review for that if you haven't before. That being said, I will be factoring my enjoyment of that arc with my overall enjoyment of the third season. \r\nThis will be my wrap up before i delve into the OVA and the movies. \r\n_____________________________________\r\n[PART 1] : Extraction\r\nThe shows first three arcs serve as a big overarching storyabout an anime cliche done well. With Oikura Sudachi playing the role of the \"forgotten friend\" or perhaps \"forgotten love-interest\" that is seen so often in anime and i'm assuming light novels. \\n\\n\r\nHowever, much like every other cliche this show addresses, its both addressed bluntly and flipped on its head. She plays a tragic character that is used expertly to subvert every expectation I had going into the arc. \\n\\n\r\nBut i'm getting ahead of myself. This comes after a wonderfully exposited story delivered by Ougi Oshino; the shows most mysterious character. \\n\\n\r\nAlthough i'm disappointed we don't get to know more about her, in a way, its nice to see this show leaving room for more stories to tell. With Ougi, who has a spectacular character design may i add... using flat colors and completely darkened eyes, she never feels like she belongs in a very alien way. \\n\\n\r\n...\\n\\n\r\nHer arc leads us, as i said, to Oikura who serves as a good exploration into both Araragi and herself as a new character. The arc reveals a darker backstory and elaborates a lot on Araragi's increasingly compelling character. \\n\\n\r\n...\\n\\n\r\nWhile I wasn't huge on Oikura's initial character design, what with her Hachikuji-esq pigtails (except grey) and general lack of uniqueness. The more I thought about it, the more I appreciated the juxtaposition between her entire symmetrical self and her entirely crazy backstory. \\n\\n\r\nWithout delving into spoilers, this arc doesn't go where I expected it to. This subversion really served to create a fascinating story. \\n\\n\r\n__________________________________\\n\\n\r\n[PART 2] : Combination\\n\\n\\n\r\nWhen I said that this show is akin to a distilled version of season 1's positives and season 2's positives, I meant it. \\n\\n\r\nIf Oikura's story played out like something out of season 2, and Tsukimonogatari played out like something from Bake or Nisemonogatari, the final arc was a different beast. \\n\\n\r\nWith Shinobu Mail, there's the sense that this show has a total direction to follow. It deals with Shinobu's past and relates her story with the overarching themes that this show's entire structure has been built upon. Romance. \\n\\n\r\nA lot of people mistake romance for an ideal. Like, \"I've been feeling romance\", or something stupid like that. Its not \"love\", its not a metaphoric object that you can have... like love. \\n\\n\r\nIts a feeling of mystery, as well as a feeling of excitement that comes from this mystery. Yes, it relates totally to love, but its a concept from that metaphoric object. \\n\\n\r\nThat's the true beauty of this final arc, and honestly, the entire show. It reflects the feeling of romance in almost every way. What makes this even more obvious is my initial confusion towards this show in my rambling first review of Bake and Nisemonogatari (All in one post under Bakemonogatari). \\n\\n\r\nThis show makes you feel, essentially, the emotions one could feel in romance. The excitement from seeing something you shouldn't. The mystery of an unfolding story. The fact that this unfolding story relates to something you shouldn't be seeing. The very idea that another definition of romance is \"a quality or feeling of mystery, excitement, and remoteness from everyday life.\" \\n\\n\r\nNow tell me that doesn't reflect the entire concept of this show! The feeling of mystery from a conversation that goes nowhere! The feeling of excitement from seeing your sexy classmate. The feeling of remoteness from locations completely devoid of people! \\n\\n\r\nThis makes me love the idea of Kanbaru, the shows more overtly romantic character, being Araragi's companion in the final arc. Its something that fits so well I didn't even realize it until Kanbaru and Shinobu's big conversation. Its perfect. The shows more romantic character addressing romanticism in a show about romance. Its so hilariously blunt, especially with her characterization involved. \\n\\n\r\nMuch like Araragi and his romantic view, she sees the world through a lovers glasses. Everything she sees and experiences is out of impulsive romance. There's even this big hilarious detour into romance-driven light novels.\\n\\n\r\nThis show is the embodiment of romance. It takes every idea and feeling given from romance and puts it on screen for you to experience. Araragi can be kind of like a surrogate for yourself, but also serve as a more fleshed out character than he was back in season 1. \\n\\n\r\nWith this shows final arc, this feeling has never been more obvious to me. People hate romance, people love romance, people have a feeling of uneasiness towards the concept of romance. I've seen every reaction to this show before. \\n\\n\r\n___________________________________\\n\\n\r\n[PART 3] : Misunderstanding\\n\\n\\n\r\nNow this is why i'm baffled by the amount of reviews I see of this third season saying that this show \"lacks developement\", or more audaciously, \"has no more action,\" all the while touting the quality of season 2. \\n\\n\r\nI feel like a lot of people are missing the point. This show isn't supposed to be some action-packed rom-com with quirky characters and an eccentric harem-having lead. Sure it mocked that concept with Bake and in a way, with Nise. But i don't think i'm giving it too much credit when I say that that's not all it is.\\n\\n\r\nMuch like real life, and much like romance, a lot of this show acts like a subversion. A subversion towards what it means to climax is prevalent throughout the shows run-time too. This is even stated multiple times in multiple different occasions.  \\n\\n\r\nBut who knows, maybe it will be that in the future. But i'm sure its not what it is now, at this point after Owarimonogatari ended. I'm left with the feeling that the writer and director created and adapted this show to portray that feeling of romance. \\n\\n\r\nHow to address romance, how to live with it, the situations it can put you in. How seeing everyday life can be a romantic experience in a way. One day your going to school, the next day your bitten by the most highly regarded vampire ever... and just continuing with school and living a regular life. Its a romantic way of looking at a mundane life, no? A romantic way of looking at nonsensical interactions and absurd progression. \\n\\n\r\n___________________________________\\n\\n\r\n[PART 4] : Reflection\\n\\n\\n\r\nIn a way, i'm rating this show in its entirety right now. The way I watched season 1 directly influenced the way I saw season 2. Those two seasons and my opinions of them undoubtedly determined my final thoughts on the third season as well. \\n\\n\r\nThat's how television works. Every episode builds on another and creates an overarching view of the show. You remember the good and the bad. \\n\\n\r\nWhat this final arc did in Shinobu Mail is the unbelievable, by making my most despised arc, Nekomonogatari (White), somewhat more bearable and understanding in context. \\n\\n\r\nThis is because the entire structure of the show often feels like a puzzle. Once again, the characters do address this, so trust me, i'm not pulling it out of my ass. \\n\\n\r\nMany times in its second and third seasons, Monogatari skips time and tells its stories like pieces of a large puzzle. Although we've gotten a lot of the endgame, we are still missing a few pieces making up the base, which is what the movies will deliver I believe. \\n\\n\r\nThis exquisite puzzle slowly forms in front of us and missing pieces just appear. So it only makes sense that it helps the disappointing Nadeko arc become just a tad bit better. \\n\\n\r\n_____________________________________\\n\\n\r\n[PART 5] : Conclusion\\n\\n\\n\r\nAll of these thoughts are coming from someone who not only has a negative opinion on anime, but went into this show wanting to dislike it. So whether everything i'm saying was something planned by the writers, or simply the ramblings of a pretentious film student; I can't help but be slightly amazed at the result. \\n\\n\r\nSeason 3 of Monogatari does what i've wanted to see in the show. It takes the heavy romance-inspired themes and the comedy of season 1 and mixes it with the well-written plot-heavy storytelling of season 2. \\n\\n\r\nWhile my favorite arc of the show is still most likely Hitagi End from season 2. There is no doubt in my mind that the most solid and truly great season is season 3. Starting from Tsukimonogatari and going through Owarimonogatari. \\n\\n\r\n________________________________\\n\\n\r\nEPILOGUE \\n\\n\\n\r\nIts very difficult for me to come to terms with what this show means for me. I feel like it did a lot with helping me come to terms with my enjoyments, and perhaps cheekily even gave me a romantics view on storytelling in some areas. \\n\\n\r\nIt means a lot though. I feel like everything it delivered to me was confusing at worst and eye-opening at best. There's no doubt in my mind that I will remember these characters in the future, whether there's more to watch after the trilogy of films air. \\n\\n\r\nI feel like I remember every character now. Going all the way back to my first review written about Monogatari. How memorable these characters are. Or how distinctly cool the show feels in so many ways. I audibly said, \"Man, this character is so fucking cool.\" More times than I'd like to admit. \\n\\n\r\nThis is something i'd love more anime to take note of. There are so many shows that simply try to over-do the \"coolness\" factor and end up making everything very same-y and boring. However, with every jolt of action or creatively designed character that's introduced, I feel an air of excitement and mystery. An air of romance? If we're going by its very dictionary-defined meaning. \\n\\n\r\nWhether its Ougi's mystery, or Gaen's hipster know-it-all-ness, or Episode's completely bonkers weapon, or Kagenui's menacing and spectacularly original character design, or Ononoki's special power... everything is delivered with the idea that its cool but it doesn't need to rub it into your face. There's no need for dramatic monologues about how badass a character is, or how scary the villain is... Its just delivered. I wish more anime did things like this. Its refreshing subversion of something that's old and tired in the anime format. \\n\\n\r\nBut i'm rambling. Point is, this show is extremely unique. Its something that can be endlessly read into but equally surface-level. Its a dangerous amalgamation of something I can't help but romanticize when I go to bed and think about it. \\n\\n\r\nTo hearken back to my first review; Monogatari is exploitative, gross, sleazy, sexist, beautiful, fascinating, memorable, and confusing. \\n\\n\r\nIt's romance. \\n\\n",
            "date": "2016-08-14T01:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 226690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5554102.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Artrill",
                "username": "Artrill"
            },
            "url": "https://myanimelist.net/reviews.php?id=226690"
        },
        {
            "content": "Story + Overview 10 / 10\r\nThe Monogatari Series is an Anime on it's entirety broken down into themes that contain one or more Arcs. The arcs themselves are shuffled on such a unique way by Nishio Ishin (NisiOisin) the author behind the series that takes mystery to a whole new level.  Each of themes or seasonal themes I'd rather call them call upon a subject. Owari meaning End, Conclusion and Monogatari meaning Story, Tale. So we know this particular season deals with closure.\r\nArt + Animation 10 / 10\r\nThis anime like the entirety of the series is done by SHAFT Studios and now that i havecome so far into the series I doubt there is another studio out there that is or would have enough game to animate something of this caliber. I bow down to SHAFT as their concept of the series is on point and has meticulously been carried out. The animation is flawless.\\n\\n\r\nSound + Voice Actors & Actresses 10/10 \\n\r\nAs someone who has read the majority of the novels I have to say i am impressed with what i heard. The work of the actors matches my expectations if not surpassed them by a long shot. You can feel their all into each one of the lines they do and their matching to the art is flawless.\\n\\n\r\nCharacters 10 / 10\\n\r\nDownright scary good well thought out, I'm most impressed with how much the voice actors and SHAFT stepped up their game.\\n\\n\r\nSORTING:\\n\r\nThe arc themselves draw upon themes with lots of engaging dialogues and multiple references to further extend their point from either literature to popular anime and many times known films.\\n\\n\\n\r\n4TH WALL BREAK \\n\r\nThis show is the only show that shatters the 4th wall like no others many times taunting, and talking to the audience challenging you many times and daring you to even make a hypothesis throughout the series. (Owarimonogatari Ep 01)\\n\\n\r\nWORDPLAY & SKITS\\n\r\nAs mentioned before this anime plays with the Japanese language. For this very reason a dub would be the most devastating thing to this series and it will never be dubbed.\\n\\n\r\nWord play is ingrained in the series and often the characters will do skits performing skits on which Kanji meanings are slightly altered to be given new meanings. Often done with the use of comedy and sometimes sexual humor.\\n\\n\r\n(See Owarimonogatari E07 for examples)\\n\\n\r\nThere is no wasted frames on the show and this can be the only show on my experience that it doesn't allow you to be lazy. Every shot has a purpose believe it or not. This show can pride itself with subtle movements and body language that literally argues with the dialogue itself. Sharpening your intuition without you noticing it. The series does this by showing and often zooming in on the characters or limbs, As if you were right in front of them and they were looking at you dead on the eye. The harmony between subtle hints of body movement and dialogue it's a perfect 10. The Backgrounds shifts of art is on point regarding the subject of dialogues or / and states of mind of the character, Often shifting regarding the mood of the situation.\\n\\n\r\nTHE NOOBS or CASUALS: [You can skip this section if you don't want some perspective breakdown on charts, grading or human psychology]\\n\\n\r\nMany inexperienced viewers will confuse the purposes of many shots for Fan Service, Many with the IQ of a Gold Fish. It is human nature of course to critique that which they don't understand harshly so that they may feel better about themselves; humans often degrade something beyond their understanding it's often done because their expectations aren't met regarding their knowledge. \\n\\n\r\nWhat do i mean? Well is that they're used to things be done a certain way and when something different comes along they're unable to deal with it. It is because they can't deal with it that they critique, Because their limited chart can't cover different style, different anything.\\n\\n\r\nThey forget that Anime, Manga, Light Novels are a medium on which a single persons imagination it's given exterior life through Drawing and Writing for the masses to view. One does not simply say, Hold on a minute imagination, Let me check the current grading scale and make sure you adhere to what these people who don't and can't write, draw or animate for shit want. \\n\\n\r\nThe medium is often used to please a crowd that connects with the artist via sheer entertainment, deliver a message through unique styles that each author / artist have. Many do the foolish mistake onto compare to other series, Why is it foolish? Well because no one that does this out of his imagination has the time to copy others and do so with the same purpose. I find it tasteless to compare writers and / or artist onto each other they don't please each other but those who is meant to experience their work. Leaving that aside.\\n\\n\r\nMEANINGS:\\n\r\nThe Show itself translates to \"A Series of Stories\" on which the main character Araragi Koyomi tells many stories from his point of view of various events that shaped and took his ordinary youth to the most twisted and unique forms as possible. The path he was taken after just one fated meeting with a beautiful vampire on a spring break, a vampire of over 500+ years of age discussed on Kizumonogatari airing 01 / 08 / 2016 as a film trilogy. The Book on english is released on Dec 15th of 2015 by VERTICAL. That's the beginning of everything. The beginning of \"A Series of Stories\".\\n\\n\r\nTHEME EXPLORATION & DEVELOPMENT:\\n\r\nMany stories that reach to the very beginning of life and emerges from the darker human nature. It grabs many topics and shifts perspectives with the characters done nicely. All done in such a unique way that comparing it to any other anime is nothing short of foolish.\\n\\n\r\nThough for the fans the Chronological order is quite simple once viewing the series on it's entirety, The airing order follows the volumes on a shuffled order on which it's meant to be enjoyed as. Many mystery series pride themselves on having mystery on the plot itself, This show decides to hide many stories from you leaving you plotting the loose ends. That's the mystery, The fact that you don't know anything, You're literally with the main character and he tells you stories but you still don't know anything. It's because you don't know anything that you can't predict anything, This often frustrates viewers that are used to easy flows of plots.\\n\\n\r\nAs said earlier many times the background changes according to the argument and shows you where is the character on state of mind. Anything from chaos, stress and / or reveal to you each character thought process and contrast it to the others in the cast. All this done is harmony sharpening your intuition and mind overall.\\n\\n\r\n(See Owarimonogatari Episode 4 - 6 for examples)\\n\\n\r\nThe characters are featured with distinct and varied facial expressions that exploit dark nature of people and / intentions, Hints traits such as SADISM portrayed by Ougi on Ep 01 of Owarimonogatari. This show is no stranger to exploration of word play of the Japanese language taking it apart and setting example of different connotations of meanings. Funny enough you will learn Kanji throughout the show.\\n\\n\r\nEnjoyment 10/10\\n\r\nOn my point of view the show is a true work of art as it explores anything and everything and takes digs at society and it's norms through exploration and debates with heavy dialogues. This show every aspect it's unique and often explores subtle facts that we often ignore or take for granted. \\n\\n\r\n(Example set on the opening of Ougi Formula Arc)\\n\\n\r\n------------------------------------------------------------------------------------------\\n\r\nTHE MONOGATARI SERIES AS A WHOLE:\\n\\n\r\nBakemonogatari = Monster Story [This is 15 Episodes. For some reason Crunchyroll only has 12 Episodes available for streaming, Ep 13 - 15 end this particular theme]\\n\r\nNisemonogatari = Fakes Story or A Story of Fakes\\n\r\nKizumonogatari = Wound Story, Damaged Goods Story or Deflowered Story\\n\r\nNekomonogatari Kuro = Cat Story Black or The Story of a Black Cat\\n\r\n--------------------------------------------------------------------------------------\\n\r\nMonogatari Series 2nd Season [These were aired together on 2013 as 26 Episodes, Three of them are Recap.]\\n\\n\r\n[As Blue-Rays they're sold separately]\\n\\n\r\nNekomonogatari Shiro = Cat Story White or The Story of a White Cat\\n\r\nKabukimonogatari = Twisted Story or A Story of Twists\\n\r\nOtorimonogatari = Bait Story\\n\r\nOnimonogatari = Demon Story\\n\r\nKoimonogatari = Love Story\\n\\n\r\nHanamonogatari = Flower Story\\n\r\n-----------------------------------------------------------------------------------------\\n\r\nMONOGATARI SERIES FINAL SEASON:\\n\\n\r\nTsukimonogatari = Possess Story\\n\r\nOwarimonogatari = End Story\\n\\n\r\nLike the tittle hints on Owarimonogatari, The story deals with conclusions, A Certain End. A story of end or conclusions\\n\\n\r\nEach of the arcs on this End Story deals with lessons and conclusion with different characters that have come into play throughout the series. Conclusions that come from a different perspective that many of us deal with, have dealt with with the addition of the supernatural element. Things that are often familiar with the masses.\\n\\n\r\nMY CONCLUSION TOWARDS THE SERIES:\\n\r\nNever have i been so impressed with a story like this one or rather stories. Anyone with a high degree of understanding will love this series. A true masterpiece. I can't throw spoilers but give it a go and do so without a chart, This series can't be compared to anything and it will stand on it's on category for years to come. That's the key to understanding \"The Monogatari Series\". \\n\\n\r\nWatch it with no other comparison. After that you will then realize that this series are Elite!.\\n\\n\r\nONLY DOWNSIDE:\\n\r\nOwarimonogatari is composed of three volumes and this anime only has adapted 2 out of 3 volumes. Volume 3 comes later on 2016.\\n\\n\r\n-------------------------------------------------------------------------------------------\\n\\n\r\n[SIDE NOTE]\\n\r\nKoyomimonogatari airs Jan 9th of 2015 Through a App offered through Google Play Store on December 19th of 2015 Japan for now. It's probable that western countries will gain access to it through Crunchyroll. The stories are as follows!\\n\\n\r\n-Koyomi Stone\\n\r\n-Koyomi Flower\\n\r\n-Koyomi Sand\\n\r\n-Koyomi Water\\n\r\n-Koyomi Wind\\n\r\n-Koyomi Tree\\n\r\n-Koyomi Tea\\n\r\n-Koyomi Mountain\\n\r\n-Koyomi Torus\\n\r\n-Koyomi Seed\\n\r\n-Koyomi Nothing\\n\r\n-Koyomi Dead\\n\\n\r\nOwarimonogatari as of now based on the Light Novel that have aired!\\n\\n\r\nVolume 1: [Aired]\\n\r\n-Ougi Formula \\n\r\n-Sodachi Riddle\\n\r\n-Sodachi Lost\\n\\n\r\nVolume 2: [Aired]\\n\r\n-Shinobu Mail\\n\\n\r\n-------------------------------------------------------------------------------------\\n\r\nOwarimonogatari Part Two speculated to be previewed after Koyomimonogatari reaches it's climax!.[ANIME ADAPTATION TBA]\\n\\n\\n\r\nVolume 3: [Pending]\\n\r\n-Mayoi Hell\\n\r\n-Hitagi Rendezvous\\n\r\n-Ougi Dark\\n\\n\r\n-------------------------------------------------------------------------------------\\n\r\nThis title comes after Owarimonogatari and it's still part of Monogatari Series Final Season!.\\n\\n\r\nZoku-Owarimonogatari\\n\r\n-Koyomi Reverse\\n\\n\r\n--------------------------------------------------------------------------------------\\n\r\nMONOGATARI SERIES OFF SEASON [ANIME ADAPTATION TBA]\\n\\n\r\nOrakamonogatari\\n\r\n-Sodachi Fiasco\\n\r\n-Suruga Bonehead\\n\r\n-Tsukihi Undo\\n\\n\r\nWazamonogatari\\n\r\n-Princess Beauty\\n\r\n-Acerola Bon Appétit\\n\r\n-Karen Ogre\\n\r\n-Tsubasa Sleeping\\n\\n\r\n(Wazamonogatari deals with Kiss-Shot Acerola-Orion Heart-Under-Blade, As her former self that is. The story as she once was a human and the identity who granted her vampire name. The story of Shinobu!)\\n\\n\r\n2016 New Tittles [ANIME ADAPTATION TBA]\\n\\n\r\nNademonogatari\\n\r\nMusubimonogatari\\n\\n\r\nOverall 10 / 10\\n\r\nIf you're a monogatari fan, Prepare yourself. The series just got better and radical.\\n",
            "date": "2015-12-20T19:23:00+00:00",
            "helpful_count": 12,
            "mal_id": 206207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316339.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChaoticThinker",
                "username": "ChaoticThinker"
            },
            "url": "https://myanimelist.net/reviews.php?id=206207"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’ve always grown up loving math; I’ve always grown up performing well in math. I’m still unsure if both of these are mutually exclusive or not, but I like to think that some connection exists.\r\nThe fun of mathematics comes from the complexity. Using variables, taking integrals, and memorizing formulae turn the field from crunching numbers into a brain-powered game. Of course, there are certain areas that can be tiresome – I’ve always had trouble with graphs and graphing – but it wouldn’t be math without a difficult derivative or two.\r\nOwarimonogatari may not feature sines andcosines, but it does have math. And symmetry. And intrigue. All of this (and more) come together to equal one of the best entries the Monogatari series has seen so far.\\n\\n\r\nSTORY\\n\\n\r\nOwarimonogatari acts as both a prequel and a sequel. Taking place after some important arcs and before others, this iteration is meant for folks who have seen (most of) the series already. However, while it expects one to know and understand certain events, and that these events are closely (and obviously) tied to everything else, the tales told stand on their own.\\n\\n\r\nAnd they’re wonderful.\\n\\n\r\nThe season is essentially split up into two halves: Sodachi’s arc and Shinobu’s arc. Technically Sodachi’s arc is three separate ones – Ougi’s Formula, Sodachi Riddle, and Sodachi Lost – but they all more or less build upon each other.\\n\\n\r\nOn a surface level, the different tales have their own goals, their own direction, that make them interesting to watch. Ougi Formula goes creepy, using a constrained setting for its foundation and a strange mystery for its backbone. Sodachi Riddle uncovers bits and pieces of Araragi’s past, a past that has largely been ignored up until this point. Sodachi Lost gets extremely real and serious and sad.\\n\\n\r\nShinobu Mail is a longer, fuller arc, and, for that reason, it goes beyond just a singular mood. The introduction of an all-powerful, samurai-armor-wearing demon creates anxiety and tension. Kanbaru arrives to bring comedic relief and sage advice, depending on the circumstances. Shinobu brings both forgiveness and sadness. It’s a bit much to declare this arc as emotional, but the arc certainly makes the audience experience various thoughts and feelings over the course of just six episodes. All the more so since, to reiterate, this tale is meant to be watched after seeing nearly everything else the whole series has to offer.\\n\\n\r\nAnd while it may almost go without saying, the dialogue of Owarimonogatari remains as top-notch as always. The long-winded conversations that rarely dip into tedium. The witty banter between Araragi, Kanbaru, and the rest of the cast. The signature catch phrases and laughs and wordplay. It’s all there once again.\\n\\n\r\nThis level is just the surface, though. Going beyond reveals that Owarimonogatari is just as strong in its execution at even the deepest depths.\\n\\n\r\nSimply breaking the surface lets one discover two important themes in Sodachi’s arc: time and relationships. Diving further reveals that these same themes also exist in Shinobu’s arc, too. This parallelism already demonstrates the focus of Owarimonogatari (and an important motif explained later).\\n\\n\r\nAcross both arcs, time stands as an essential obstacle. Sodachi’s rage festered for years and years. Her brooding prevented her from finding peace and jumpstarted her hatred for Araragi. For her, time does not heal but rather exacerbates. Seishirou’s feelings are a bit more complex, but he, too, had time (400 years to be exact) act as a catalyst for his current mood and actions.\\n\\n\r\nIn this manner, Owarimonogatari argues that time may not necessarily heal all wounds. It heals some but not all. Be it half a decade or half a millennium, something else is needed to make amends. That something is the second theme: relationships.\\n\\n\r\nRelationships are important regardless of context. They can provide happiness, opportunities, and connections that people thrive on. For Owarimonogatari, however, relationships are vital to the culmination and conclusion of the events.\\n\\n\r\nFor example, Sodachi’s entire arc revolves around a mystery motif. It’s not until Araragi talks with Sodachi, reestablishes his relationship with her, that the truth is revealed and their friendship solidifies. Shinobu’s entire arc is the same way. The problem of an onset, immortal demon originates from a previous relationship that went sour back then that she had refused to sweeten until just now.\\n\\n\r\nSo it’s more than just relationships heal wounds and let people move on. It’s that relationships start new beginnings. They unveil characteristics and thoughts of those involved. They give life meaning. As Senjougahara says, no relationship is perfect. That’s fine. Because what matters most is being that special person who can share that special relationship.\\n\\n\r\nBut beyond all of this lays Owarimonogatari’s most amazing triumph.\\n\\n\r\nConsider both arcs. Both are about someone who does not want to rekindle a relationship (Sodachi with Araragi and Shinobu with Seishirou). Both center on a group of four characters (Araragi, Sodachi, Ougi, and Hanakawa, and Araragi, Shinobu, Kanbaru, and Gaen). Both deal with ruined lives (Sodachi slowly dwindling, and Seishirou slowly regaining). Both deal with envy (Sodachi wanted Araragi’s perfect life, and Seishirou wanted Araragi’s place). Both have puzzles that need to be pieced together by all-knowing people (Ougi for Sodachi and Gaen for Shinobu). Both have…\\n\\n\r\n…them visiting important landmarks (Sodachi’s mansion and the hilltop shrine). Both have the main antagonist being “the past” (Sodachi and Seishirou). Both have a character that diffuses tension (Hanekawa and Kanbaru). Both have a small aside with Senjougahara (when she punches Sodachi and when she talks with Araragi over the phone). The list goes on and on.\\n\\n\r\nThis symmetry reveals an astounding revelation: Owarimonogatari is the same tale told twice.\\n\\n\r\nIt’s not just the anime being able to essentially repeat its contents that makes it so grand. It’s how this symmetric presentation reinforces its themes on time and relationships. That is, time is the same for everyone, and relationships are the same for everyone.\\n\\n\r\nAnd that is remarkable.\\n\\n\r\nAnd to top everything off, there are the subtle yet beautiful ways in which each tale ends. Araragi not revealing what was in Sodachi’s letter to him, acting as their own, personal mystery, is so heartwarming and unbelievably fitting. And Shinobu overcoming pride and fear by forgiving her long-lost minion, in about as respectful a manner as she could, is amazing on a bunch of narrative and emotional levels.\\n\\n\r\nThe entire season comes together to be one of the best pair of stories that the series has provided to date.\\n\\n\r\nANIMATION\\n\\n\r\nOwarimonogatari continues its stride with its animation and its art.\\n\\n\r\nStarting with the character designs, the returning cast remain relatively the same minus a few outfit switches or changes based on the outcomes from other parts of the series. For instance, Araragi still wears his metaphorical ahoge, Hanekawa proves that she dyes her hair, and Ononoki dons a bathrobe.\\n\\n\r\nWhere the character designs get quite interesting are with the newcomers. Namely, Ougi, Sodachi, and Seishirou.\\n\\n\r\nOugi takes first place when it comes to the best new design. Her all-black eyes, hidden hands (which are covered by black gloves seen for a brief moment), and pale skin turn her into the creepy and manipulative character that she loves to be.\\n\\n\r\nSodachi’s hair is faded, signaling the stress she has experienced over her life thus far, but it’s her plainness that fits her best. To Araragi, she was forgotten, so having a design that follows this motif is more than perfect.\\n\\n\r\nAs for Seishirou, his strange, red-filled eyes, long ponytail, and smaller stature make him effeminate, blurring the line between friend and foe.\\n\\n\r\nAnimation-wise, the series does not actually have much of it for long periods of time. Lots of speaking while standing or sitting is common, leading to characters hardly moving on-screen. That’s not to say no movement exists because there is animation. And what is given is quite nice. Slow-motion segments, free-flowing hair, and up-close mouths all have top-notch animation, demonstrating the anime’s animating chops.\\n\\n\r\nAnd to be fair, those areas where talking and standing take over are filled with the series’ signature style. Imaginative scenarios, crazy angles, and those all-important head-tilts return to make the show feel at ease alongside its prequels and sequels.\\n\\n\r\nOf course, these descriptions say nothing of the different lights, colors, and perspectives provided. But best of all is how the visuals tie back in with the symmetry of the story. That is, the anime makes heavy use of symmetry and asymmetry to construct not just cool-looking shots but also visuals that convey meaning for the narrative and the cast involved.\\n\\n\r\nIt’s all a treat to behold.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Owarimonogatari is more positive than negative, but, at the minimum, it’s a clear step down from both the story and the art.\\n\\n\r\nThis time around, the cast has to be split up into two categories: those who are not important and those who are. The former camp holds Hanekawa, Kanbaru, and Izuko Gaen. The latter camp holds Sodachi, Ougi, Shinobu, Seishirou, and Araragi. Other characters, like Senjougahara and Episode, while having an impact on the proceedings, are notextremely relevant to the stories at hand.\\n\\n\r\nAt any rate, Hanekawa, Kanbaru, and Gaen are present in the season, but they are characters that do not develop whatsoever. That’s perfectly fine. Hanekawa and Kanbaru serve the role of tension diffusers – Hanekawa leads, Kanbaru protects, and they both have their own sexual asides. They also act as people who can relate to their respective, distressed counterparts. I.e., Hanekawa had trouble at home as Sodachi did, and Kanbaru had romance issues just as Shinobu did. Plus, they have already had their time in the limelight. Twice each.\\n\\n\r\nGaen has technically never had an arc (let alone two) all to herself, but what she does best is showing up, injecting her wisdom, and then disappearing until she is needed once more. Just like all of the other apparition specialists. Meaning, she is excused, too.\\n\\n\r\nThat just leaves the important characters.\\n\\n\r\nSodachi is the first new character this season to be added to the series’ cast. She also takes the title as the best character that Owarimonogatari offers.\\n\\n\r\nHer character unfolds in a complicated manner. First, Sodachi from a couple of years ago is shown. Then it jumps back to the present. Then it goes back five years or so. Then even further back in time. Then back to the present only to head immediately back to the past. Finally, when the end is reached, she looks ahead towards an uncertain yet hopeful future.\\n\\n\r\nThis confusing back-and-forth pattern of character development reflects her as a character: conflicted and scrambled. She was accused by her classmates (and her teacher, the true culprit) of cheating. Her mother passed away unbeknownst to her. The “household” she lived in had abusive parents. In essence, her whole life has been nothing short of unfair.\\n\\n\r\nShe’s a tragic character. Arguably the most tragic that the entire series, let alone Owarimonogatari, has ever seen. Her troubles not only reveal just how good Araragi has it – a nice family, a girlfriend, numerous friends, a college-going future, and so on – but also how good the audience has it. The majority of people have never experienced hardship on the level Sodachi had, causing the audience to appreciate what they have in their own lives.\\n\\n\r\nBut she does more than impart self-reflection. Indeed, her most important character contribution is a subtle one, a forgetful one: going unnoticed. The majority of people are not like Sodachi, but there are people who unfortunately go through similar circumstances. Yet, like Araragi, people are not always aware of someone else’s tragedy. It’s not that they don’t have sympathy; it’s that they just don’t know. So while her character can be pitied, she has hopefully allowed people to think about the situations that others may be going through.\\n\\n\r\nHer tragedy turns her into a person with an unbelievable amount of negative emotions: anger, envy, sadness, and so on. And that leads into probably her only problem as a character – her turnaround is a bit too quick. She goes from despising to reconciling within the span of an evening despite broiling with hate for years on end.\\n\\n\r\nStill, she brings a new perspective on life and on people that is not often thought about. The doors she has had to open in her life have been filled with nothing but goats. But now, as she continues forward, that shiny new car remains on the horizon. Probability demands so.\\n\\n\r\nFrom tragic to creepy, Ougi is quite the strange person even for the series’ standard. Her stand-out trait is her spooky behavior. She invites herself into most of Araragi’s affairs. She invades the personal space of others constantly. And she invents solutions to the mysteries at hand at a pace that seems almost impossible.\\n\\n\r\nOugi also has another defining trait: She acts useless. During some conversations, she will outright say so, calling herself an “unreliable underclassman” (episode one) or declaring “And yours truly, though unworthy…” (episode two). She pretends to be innocent to trick others (most noticeably Araragi) so that she may manipulate them even more than she already does.\\n\\n\r\nAnd just like many of the cast members, she, too, has a signature phrase. A phrase that describes her all-too-well: “I don’t know anything. It’s what you know.” The first sentence calls back to her faux uselessness. (She clearly knows a lot.) The second sentence calls back to her keen interest in others. (She always investigates problems of people.)\\n\\n\r\nAltogether, Ougi becomes a character that forces others to act. In her short time, she did a lot: She had Kanbaru introduce her to Araragi, made Araragi confront his past, and even caused Hanekawa to offer up her chest. The first and the third are arguably minor points, but the middle influences Araragi to an enormous extent. She may not develop as a character, but, without her meddling, almost nothing would have been accomplished.\\n\\n\r\nOugi gets traded in for Gaen in the second arc, and Sodachi gets traded in for Shinobu. Shinobu, however, does not see nearly as much attention as Ougi and Sodachi. She has her cute moments and her intimidating moments, but nothing too grandiose. Except her interaction with Kanbaru. As Araragi describes it, it’s the first time she has ever lost a “battle,” so getting to see the top-tier Kiss-Shot be put in her place (and later on actually showing some human emotion) added another dimension to her character.\\n\\n\r\nSeishirou – the “first minion” to follow Shinobu – is arguably the only weak character in the season. The audience first learned about him through a tale that Shinobu told during a different season in the series, but, in Owarimonogatari, he makes his grand entrance. The problem? He’s not around enough. The anime builds him up as this pivotal character, but he ends up barely being around. Less time means less to learn about him. Less time means fewer interactions between him and other characters. Less time means less of an impact on the overall story.\\n\\n\r\nLast but not least and rivaling Sodachi’s character is none other than Araragi. Up to this point in the whole series, Araragi has not had a whole lot of focus. Understandably, it’s been on the other girls in the harem – Senjougahara, Hachikuji, and so on – and he has been there doing what he can to support them. But the stories have never reallybeen about him. Until now.\\n\\n\r\nThis season sees Araragi earning quite a bit of attention character-wise. In Sodachi’s arc, his past is revealed, the audience learning more about where he started, how he got there, and what his brand of justice meant to him. In Shinobu’s arc, Araragi learns where he stands in relation to those he cares about: Kanbaru regards him as someone she would do anything for, Shinobu regards him as her (currently) only companion, and so on.\\n\\n\r\nIn short, Araragi comes to understand more about himself. He comes to understand who he is as a person today, and who he wants to be tomorrow. He comes to understand how fortunate he is. He comes to understand that he’s a different “special person” to those he cares for.\\n\\n\r\nHe puts it best right near the end, tying everything back to the themes of the anime in an asymmetric manner: relationships don’t always bring joy. But that’s what time is for. While there may not be an endless supply, time allows people to take chances, start anew, and perhaps, just maybe, find that happiness.\\n\\n\r\nSo while the cast may not be amazing, they are certainly more than purposeful.\\n\\n\r\nSOUND\\n\\n\r\nVoice acting takes the crown in the sound department with ease. Returning characters have their respective voice actors and voice actresses reprising their roles. Hiroshi Kamiya as Araragi and Miyuki Sawashiro as Kanbaru bring their normalcy and silliness in droves. Kaori Mizuhashi as Ougi does a nice job as well, elevating the girl’s creepiness through a calm and conniving voice.\\n\\n\r\nBut it’s Marina Inoue as Sodachi who steals the show. Her performance as the grief-stricken, math-loving student, with inflections ranging from depravity to simple acceptance, made the character more than the sum of her parts.\\n\\n\r\nWhile the rest of the music does not top the voice acting, they still hold their own. Ougi’s OP takes on quite the techno tone; a different vibe from her usual self. Sodachi’s OP has a mysterious and cool composition. (Her other OP was not used during the televised airing.) Shinobu’s OP goes cultural, adopting a poetic feel aided by its shortened length.\\n\\n\r\nBut, similar to Ms. Inoue as Sodachi, the ending track wins hands down. From the gentle choir to the wonderful composition to the ending optimism, the whole ED comes together in resounding fashion.\\n\\n\r\nThe remainder of the original soundtrack does not reach the same level as the OPs and the ED, but they do hit that atmospheric mark. In particular, the frantic, tension-fueling track – played when Araragi and Sodachi’s class are quarreling about the culprit and when Sodachi meets Araragi in the present – and Kanbaru’s piece – with its high energy and silly sounds – make their respective moments that much stronger.\\n\\n\r\nAnd to top it all off, Owarimonogatari plays with its sound on occasion. Special sound-effects during certain sections are used, like when Ononoki’s foot on Araragi’s face made squishy noises (matching the absurdity of the action) and Gaen’s explanation sounded like an old-timey film (matching the conversation being about the distant past).\\n\\n\r\nENJOYMENT\\n\\n\r\nThe first half of the season – i.e., Sodachi’s arc – was easily my favorite. Stellar moments such as Ougi laughing, Senjougahara punching Sodachi, and Hanekawa giving perhaps the definitive “I can’t believe this person right now…” face. That’s listing just a few of my favorite scenes. Sodachi alone had stellar moments too: her tirade, her unable to pronounce Araragi’s name, and her following through on (part) of her promise got reactions out of me.\\n\\n\r\nThe second half – i.e., Shinobu’s arc – was not as strong, but that’s not saying a whole lot. Nearly all of Kanbaru’s antics, from her “Okeydokey” to her background perverseness, had me smiling, laughing, or both. Senjougahara’s part, while small once again, also managed to be a highlight. Araragi’s quick reference to The Shawshank Redemptionin episode ten had me cheering.\\n\\n\r\nHowever, if I am being honest, there are negatives. I did not much care for Seishirou and his plight no matter how bittersweet Shinobu’s forgiving happened to be. Also, despite me liking both Ougi and Gaen, I am (still) not a fan of seemingly infallible characters. Yes, that’s how they are designed and used, but when a character never does anything remotely wrong or a character is always right, I simply get peeved. They admittedly have slipups, but they are inconsequential or so tiny that they barely register as such.\\n\\n\r\nStill, the anime was fun and dramatic and entertaining – which is pretty much all I could ask it to be.\\n\\n\r\nOwarimonogatari nails almost everything. The story is meaningful, the art is slick, the characters are purposeful, the music is passionate, and the entertainment is high. Simply put, this entry in the series graphs well above average.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, themes on time and relationships, a symmetric presentation, and beautiful moments create a wonderful narrative through and through\\n\\n\r\nAnimation: Great, nice character designs and animation with an awesome artistic direction\\n\\n\r\nCharacters: Good, while Seishirou ends up as a weak character, Sodachi, Araragi, and the rest of the cast make up for many of his shortcomings\\n\\n\r\nSound: Great, nice OPs, awesome ED, strong VA performances, an atmospheric OST, and nifty design choices\\n\\n\r\nEnjoyment: Good, stellar, funny, and interesting, with only a couple of negatives to speak of\\n\\n\r\nFinal Score: 9/10",
            "date": "2016-09-21T19:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 229769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=229769"
        },
        {
            "content": "Love it, hate it, indifferent to it, or once-loved-then-hated-now-extremely indifferent to it, Owarimonogatari (literally 'end story', though the series doesn't conclude here) will most likely meet your expectations of the long-running light novel adaptation. For me, that means occasionally witty dialogue shoehorned with ecchi, traces of pedophilia, and genuinely interesting ideas muffled by execution. And yup, it's got all three. NisiOisiN really knows how to keep his writing consistent! \r\nSee, the joke there was that Monogatari is as inconsistent as can be, and widely varies in quality from arc to arc. Got it? No? I'll wait.\r\n…OK? Let's move on.\r\nWhile technically a four-arc series, there arethree distinct arcs in this season's offerings: Ougi Formula, the one-hour premiere, Sodachi Riddle/Lost, and Shinobu Mail. Part of what makes this season strange to review is that each and every one can be summarized with a single sentence, but I am generous enough to provide you with multiple sentences. I will do my best to go over them all without spoiling anything, because Monogatari is serious business. \\n\\n\r\nOugi Formula is the series' standard fare. Not only is it a locked room mystery, it's forty-some minutes of dialogue that's not exactly justified by its contents. Were there no philosophical questions and characteristically abstract classrooms, it could be concluded in ten minutes, or even a heavy twenty. Instead, you will spend roughly five percent of your day watching Ougi and Araragi solve a seemingly unimportant puzzle. You almost reach a point where you think all this time spent will be inconsequential, yet that is saved by a graceful transition into the second arc. \\n\\n\r\nThus ensues Sodachi Lost and its conjoined twin, Sodachi Riddle, which go above and beyond the series' standard fare. It's maybe the most straightforward, mature story the Monogatari series has given us, which concerns a classmate's displacement and the unknown circumstances of her family. Marina Inoue's fantastic (or shall I say phantasmic) portrayal of Oikura may send a chill or two down your spine, and there's no lack of interrogation or detective work on Araragi's part. Unlike the previous arc, there is a feeling of consequence to every word muttered or yelled, which helps portray the shattered mental state of Oikura rather sympathetically. It's an approach most artists wouldn't dare to take, so I wholeheartedly appreciate the effort and delicacy put into handling it. There are still the rough points along the way, like a few boob jokes and some off-topic discussion, yet they're minor enough to be promptly excusable. The whole thing is best summed up by the words of the show's official subtitles (which are garbage that you shouldn't use): \"I'm terribly sorry. I had underestimated you, to be honest.\"\\n\\n\r\nTo round it all out, Shinobu Mail is well below the series' standard fare. After how much I was impressed by the Sodachi stories, I was hoping for the best. All of that hope left my body after watching the first episode of Shinobu Mail. There are some parallels to be drawn to your typical superhero movies—there's a big bad which everyone works together to defeat, yet nobody thinks they'll be able to. It wouldn't be such a major issue if any of the major action was shown, WHICH IT IS NOT. NOTHING IS SACRED. We instead follow Araragi and a piggybacking Kanbaru, who continues her trend of making annoying sexual jokes and innuendos toward him wherever possible. It's like being alone in a room with a 12-year-old, which is something that Araragi would probably like. Later on is a twenty-minute infodump which concludes with Kanbaru and Shinobu sharing an unnecessary and crude sexual pose, a cake that is topped by the most anticlimactic of endings. I don't want to ruin that, but it's definitely an open-ended conclusion you've seen before. \\n\\n\r\nI'm not going to say much about the directing, other than that I think it uses artistic value as a crutch. There is no attempt made to portray things as-is, so everything is abstract. Maybe the director and I just value different things.\\n\\n\r\nUnless you're telling an overarching story, variety is the spice of life. Then it gets questionable. Unlike other shows in the same supernatural episodic vein (Mushishi, Cardcaptor Sakura), there's no consistent tone or guideline for the Monogatari series' plot. It's a bit all over the place. Maybe you, unlike me, are a fan of these random variables, and therefore may like Owarimonogatari a lot more than I did. If you do like this more than I did, good job. If you dislike this more than I did, good job. Having an opinion is the first step, and you are fantastic for that. Do not let anyone tell you otherwise. \\n\\n\r\nUnless you're using the official subtitles. Then you're wrong.",
            "date": "2015-12-22T07:57:00+00:00",
            "helpful_count": 10,
            "mal_id": 206407,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/vegetablespirit",
                "username": "vegetablespirit"
            },
            "url": "https://myanimelist.net/reviews.php?id=206407"
        },
        {
            "content": "Owarimonogatari 1/Formula Ougi/ Sodachi Riddle/ Sodachi Lost:\r\nSurreal.\r\nThe premise is intelligent and greedy, because it presents a new character at the time of 45 seconds — even with the arc coming a bit before the start of the Second Season.\r\nThe run begins, someone is shown and someone that has already been shown must be presented as a beginner now. Really interesting, the mysterious mood, the subtle air, it’s all part of a little mystery’s set that hasn’t even been mentioned before and that it's now featured — or so it has seemed.\r\nThe insertion of said Ougi, the memory of said Oikura. It’s mentioned like a dichotomy,or rather, “convergence”, even if both of them havn’t ever met, they had a relationship in common, the said protagonist.\\n\\n\r\nHowever, in a courageous way, Oikura is inserted in the story, having, until then, the weapons to be a character of weight, which she doesn’t only accomplishes to become one in the end, with the vague idea of a return (which has already been confirmed), as she have a very solid representation in the protagonist.\\n\\n\r\nThe pace isn’t slow, isn’t weak, isn’t without desire. It’s intense, gradual and even ominous.\\n\\n\r\nThe said formula it’s a practical lecture of human relationship, the majority rule, the pure representation of mankind’s ugliness as an inventor.\\n\\n\r\nThe said riddle, as insinuated, it’s a solid question, the warning in the end saying to check the beginning again, the pure representation of human forgetfulness, of its ugliness as a defect.\\n\\n\r\nThe said lost one, the mystery, the engaged, the prideful promise of a closing to the whole riddle, to the whole formula; it’s indeed a truth about human frustration.\\n\\n\r\nIn the end, Owarimonogatari 1 it’s a promise of mystery, which only tends to grow and become better, where the end it’s satisfactory and surreal, where the three works as one and three at the same time, therefore, it’s great (9.0 in a whole).\\n\\n\r\n------------------------------------------------------------------\\n\\n\r\nOwarimonogatari 2/Shinobu Mail:\\n\\n\r\nEnd, the closing of said arc, what’s there to say about it? What can really be said about it?\\n\r\nIn a cruel way, the word “boring” could be used in a brutal and even condescending way, but, this would be said just envisioning the usurpation of the arc’s focus to one character in particular, and that would be unjust.\\n\\n\r\nBeing that way, no, because it is that way, it’s necessary to quote the divergences and convergences until the end — or rather, from the start.\\n\r\nBeginning with a suggestive presentation of the plot, the tale, passing through a roller coaster of quality, goes from the momentary fun to the cumulus of tedium, but not in a sequential order, of course.\\n\r\nWith the apparition of a new character, the interesting Seishirou, the first oddity-slayer, the first servant, the first love, maybe? The relationship between he and the said iron-blooded, hot-blooded and cold-blooded vampire, Kiss-shot, it’s indeed intriguing. In certain point, it’s understood that the exchange of feelings between the two it’s almost the opposite. In the end, their relationship it’s like any other, of any kind, therefore, it’s something good.\\n\\n\r\nThe closing events, like the duel, the devouring, the consolation, everything fulfill a emptiness of almost three 1/5 of the arc, which occults it with a speech that’s even irritating.\\n\\n\r\nEven so, the end, the said summary, the pay-off it’s really beautiful, therefore, it’s something good. The connected dots and the ones that are left at the end of the protagonist’s report to the coadjuvant Ougi are really well-made; more so with the collaboration of the “chat” between said protagonist and the said coadjuvant Yotsugi.\\n\\n\r\nIn the end, Owarimonogatari 2, Shinobu Mail, it’s a well-presented arc that screw its way to its beautiful end, which leaves a great tip and close other ones. We can catalog everything as a whole as being great (8.5-9), but, the bad use of explanations in the filling of this cake leaves it tasteless, therefore, good (7.5-8.0 for the end).\\n\\n\r\n------------------------------------------------------------------\\n\\n\r\nOwarimonogatari/As an anime altogether.\\n\\n\r\nGood adaptation, great display of scenes and metaphors from the book in form of frames, frameworks and even the ending.\\n\\n\r\nIf both parts are to be divided, like in the books, it would be a 9 and a 7 in sequence, but, as they’re put together, I risk myself at giving it a 9.\\n\\n\r\nThere’s no meaning in despise the first part for the slouch of the second one.",
            "date": "2015-12-22T19:28:00+00:00",
            "helpful_count": 10,
            "mal_id": 206487,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3930997.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MatheusSantos",
                "username": "MatheusSantos"
            },
            "url": "https://myanimelist.net/reviews.php?id=206487"
        },
        {
            "content": "Owarimonogatari is the telling of two stories. The first one is about Oikura Sodachi, which is a long lost friend of Koyomi Araragi; the other is about Shinobu Oshino. \r\nThe Sodachi arc of Owarimonogatari is one of the top 2 best arcs in the series. For one, extremely surprisingly, it does not feature an aberration. The Sodachi arc is a straight drama; one giant emotional rollercoaster. I don’t even know exactly what to say about it other than it tugged at my heartstrings like very few other anime have before. The plot is the best of any arc and is developed mastefully. The Sodachi arcplot is handled and executed like a tragic mystery, and resolved elegantly. \\n\\n\r\nThe Sodachi arc features Ougi Oshino, who we have met before, yet Koyomi hasn’t (chronologically speaking) and Tsubasa Hanekawa; these two being the smartest characters in the series. This is crucial to the plot since it cannot advance, especially as a mystery arc, without the intellect of both of these characters. The mystery is resolved by them two, leaving Koyomi clueless in the dust, but he serves as the emotional connection between the plot and Oikura. Every character is cast perfectly in this manner creating the illusion they were created solely for this role. \\n\\n\r\nThe Sodachi arc is about childhood trauma, trust, interpersonal responsibility and expectations, tragedy, and coming to peace with reality while striving for happiness. The Sodachi arc is extremely deep and serious and delves with mature topics. It features this hyperrealism that hits home very hard. The events that took place in the Sodachi arc happen, they happen all the time. Both the tragedy and regularity of this plot paired with the Monogatari Series style makes it truly a unique masterpiece. \\n\\n\r\nThe only thing I could compare this arc to would be Nekomonogatari: Shiro. They’re so completely different that I cannot distinguish the the two in quality. I can very easily and confidently say that these two arcs are by far the best two of the series. They dwarf everything else in terms of purpose, conviction, and content. Arcs like these are the reason I watch the Monogatari series and anime in general. \\n\\n\r\nThe Shinobu Mail arc of Owarimonogatari is a much lower quality arc. It is a continuation of the previous Shinobu arc. I have very little to say about this one. I’m guessing it’s because of how underwhelmed I am after watching the previous arc. Aberration arrives, characters deal with it with help of Koyomi Araragi, character arc resolved. It’s your standard Monogatari Series arc. At this point, the non-standard arcs have become more common than arcs like this, so it definitely feels underwhelming. It’s like we’re back in Bakemonogatari. This is not a bad thing, it’s just that the arc before was so amazing and different that you kind of expect the only other arc in the same series to be similar. \\n\\n\r\nTaking an average of these two arcs, I would simply say what I’ve said in every other Monogatari Series review; that is, ‘it’s just more Monogatari.’ But this series is so much more than that having the Sodachi arc in there. Owarimonogatari is a must watch anime, for everyone. Even if you’re reading this without watching any Monogatari before, you can watch the Sodachi arc without any context and it’s still incredible.",
            "date": "2019-04-30T13:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 307483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4169795.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Falco2424",
                "username": "Falco2424"
            },
            "url": "https://myanimelist.net/reviews.php?id=307483"
        },
        {
            "content": "Here we are with my fanboy review of another installment of the monogatari series. This series definitely stands out from heaps of other anime with very few series being like it. At first people might go into this series thinking its supposed to be something super artsy with hidden messages and metaphors everywhere but honestly all it does is take a fairly generic story and take a new approach with it. People criticize this series for its lack of character development and plot. A lot of these people  watched 3 episodes and quit. Character development in this series is actually very interesting. The maincharacter Araragi actually doesn't really go through any character development this is true. However he is not a one note character that is stagnant throughout the series. He changes based of the main character of the arc to be able to play off of them better. This is what the real selling point of this series is. Everything including even the environment changes in order to fit the heroine of every arch. \\n\r\nFinally the actual review part about this installment specifically. The main heroin's of these arch's were unfortunately not really as interesting as in some of the other installments. They still have enough support from araragi and the environment and other supporting characters to make this an extremely enjoyable series but its not as interesting as the arch's about senjougahara and hanekawa. \\n\r\nAs for the plot I also found this to be weaker than in the other installments. Each arch has their own separate plot that doesn't necessarily fall into any chronological order however they all do connect in some way as you see in the last arch. The first arch was an Araragi backstory which is instantly made more boring because it's about Araragi. There is a heroine that is eventually introduced and she is a tsundere meaning she is instantly overshadowed by senjougahara and she actually ends up being one of my least favorite heroines. \\n\r\nThere is oshino's niece who follows Araragi around the whole season but once again her interactions simply weren't as interesting as the other characters.\\n\r\nIn the final arch kanbaru comes in to save us by being one of the best characters in the series meaning Araragi can play off of her extremely well. Also we see some characters that we didn't see all that much of before but they don't really have that much dialogue that isn't exposition so its hard to judge them as interesting or not interesting characters. \\n\r\nThis installment for me is definitely the worst one. However having the smallest golden bathtub amongst your neighbors isn't something to be disappointed in and if you liked the other installments you will definitely like this one. \\n\r\nLastly art and sound is exactly as you would expect for this series however the first arch was definitely grayer than anything else in the series mostly due to it being about the past and also somewhat grim.",
            "date": "2015-12-20T11:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 206143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2203125.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hoeze",
                "username": "hoeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=206143"
        },
        {
            "content": "Now this installment of the Monogatari series was fairly odd, since it tried to incorporate new characters as well as one old character that we don't know too much about. The show is split up into two stories, both being six episodes long. Although both stories are under the same title (Owarimonogarati) they don't really have anything to do with each other. \r\nFIRST STORY\r\nFor the first story we are thrown into a very long first episode, you're pretty much watching a movie so make sure you're comfortable. The episode is pretty slow considering it takes place in one room for the entire time, but theytell a a story about a girl who mysteriously stopped coming to school. Then after that episode the following five are left to find her and her reason for ditching school. This story is pretty dark and I did enjoy it a lot, but the way they told it was slow. They made every little detail drastic (which is expected from this series), but the details they were talking about weren't too interesting and they dragged scenes out for quite some time. Over all the first story was nice, but it may lose your interest if you aren't interested or if you don't follow along.\\n\\n\r\nSECOND STORY\\n\r\nNow the second story started off with a huge bang, and I thought that this might finally be a interesting story, maybe on par with Nekomonogatari. Although it not being as nice as Neko, it still was a nice addition to the series. There are a couple of episodes though that are a little slow, but those episodes are to explain the situation at hand, and the story they tell is nice. There aren't too many negatives to this one besides maybe a lot of narrative to a story that we had no idea about until now.\\n\\n\r\nFinal notes about this show, it was good and all but I surely do miss the story told by ongoing problems that the characters have themselves, as in spirits ruining their lives pretty much. Hopefully we'll get more of that.\\n\\n\r\nPROS\\n\r\nNice addition, good and interesting stories, Some good humor thrown in as well\\n\\n\r\nCONS\\n\r\nSlow, may lose interest, some dragged scenes",
            "date": "2015-12-23T20:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 206617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3763225.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShadowBunny",
                "username": "ShadowBunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=206617"
        },
        {
            "content": "Many people who gave this monogatari series or owarimonogatari a lower than average rating, let me say this. The meaning of \"owari\" or the prefix name of this monogatari means the resolution or the end of something. By this sense, many of the monogatari that we saw with its prefix name tells you, and predetermine what you are about to see, within those monogatari series that will entails as its main theme or topic of the anime's discussion or introductory standpoints, until it meets it resolution or the end of that specific monogatari series. And if you notice something about this owarimonogatari series. Both shinobu'sproblem and Araragi problem are resolved when the story meet its ending or the last episode of the owarimonogatari. For Araragi it's the realization or understanding about his forgotten past. In which later helps him to deal with his contemporary problem with Oikura Sodachi (not spoiling, it's what he planned to do when she returned and was exposed in episode 1). \\n\\n\r\nIs it out of context of the story? No. Is it not related to the main arc? No. Is it meaningless to the development of the story? No, liked i said before. It helps with Araragi's understandings to unravel and resolve his past problem with the way he does or thinks things logically, to his contemporary time's problems with Oikura Sodachi. \\n\\n\r\nA filler episode tend to have no meaning to further the progression of a story and holds no relevance towards the goal of achieving it. Conversely, the not really a  filler or rather the detective game that Ougi tries to resolve or rather helps Araragi to resolve it, are just a style of the author's story telling where you, the audience can think and theorize along the points that were given visually or verbally through its dialogue and visuals, about the answer or the act of using deduction by Ougi to further the understandings related to the happenings at the current topic of discussion or whether or not. With your guess or theory is being right or wrong at Ougi's deduction about the case of rationalism in human's actions and causation of it. That's the whole point of a detective game in Owarimonogatari or deducing points or rationalizing the reason for each character's actions with its possibilities in mind. By this sense, it was an extremely a well done job for Nisio Isin (the author) to organized and formalize these argumentative ways of deduction and rationalizing assumptions in this monogatari series. Incidentally, in some cases, Ougi ask Araragi to give an ending statement on the very near end of the episodes to shows the end of the deduction in theorizing Oikura Sodachi's reasons for her particular actions. If you go to law school or study philosophy or any argument related subject then you'll get how it's done. \\n\\n\r\nMy enjoyment for this is 9, the sound is 9 (Oikura Sodachi voice acting was top notched lmao) with a fitted OST for a specific scene or talks in the anime, while the story is a subjective matter whether you like this kind of story with its premise given in the prefix of the \"-monogatari\" while ending the show with the conclusion of how the prefix it, is exactly what it's. But i'll give it a 9 since I enjoy it hella lot. And i like how they make the random text that usually pops up sporadically alot more noticeable and easy to read thanks to the cool and slightly bit slow transition into those random texts, so you have enough time to read all of them or possibly pauses it. Despite the shorter amount of dialogue for this. There are plentiful of westerner's references like \"monty hall\" (and some other ones) and uses of english words like, \"field work\", \" Do your best\" etc. And some indication of the fallacy that the character is committing like the ,\"red herring\" that was mentioned by either Ougi or Araragi in a certain Episode. The cutted in short dialogue did a hell lot of job for the audience to follow onto the story and understanding the happenings much easier than the previous monogatari series. Plus, their ways of smooth talking through the same topic or premise over and over again, while adding new info in over the extended period of their dialogue is pretty interesting as well. It's kinda clever to see this around. Nevertheless my overall is a 9, It's the best monogatari series so far in my subjective opinion.",
            "date": "2016-03-01T22:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 212076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=212076"
        },
        {
            "content": "I was highly disappointed with Owarimonogatari. In my opinion it was a major step down compared to the rest of the series/stories. I thought if I gave it more time that maybe there would be a better chance of me liking it and changing my rating, however to my disappointment it did just the opposite. \r\nTo begin, with the story, there were so many things that could have been done to make the show better and actually worth watching. The best example I will give would be having a huge cut of the dialogue, reflecting on the past, flashbacks, and obviously talking. I felt likeit was just filler, in fact I will call it that. Next I didn't like the final story, \"Shinobu mail.\" There were way too many episodes during the final arc of just talking and reflecting on the past (while uncommon in this series) it made it difficult for me to enjoy.In addition to that the lack of action and engagement between characters (that were not talk related) made things even worst. \\n\\n\r\nI felt like I was being teased through the majority of the final arc. It was like the director was telling me \"here is a little bit of awesome action now we are going to give you some more talking.\" Another thing that bothered me immensely about this arc was that the information and things talked about between Gaen, Kanbaru, Shinobu, and Koyomi. By now we should all know that Araragi is stupid. Just about everything Gaen was saying to him didn't matter nor did it better help him to understand completely what was going on during the shinobu arc. It literally took is underclassman (Kanbaru) to explain even the simplest things to him (even Shinobu's feelings.) I would have really liked to see more psychical action and drama to keep me, the viewer interested and engaged. Compared to the rest of the series this one is a major step down both story and plot related-wise.\\n\\n\r\nI wanted to see more surprising revelations like in the other stories in the series. However, for Owarimonogatari to start off so interesting and mysterious, then end with little sense of accomplishment was just utterly disappointing especially since the last arc was Shinobu related. \\n\\n\r\nThe art style in Owarimonogatari didn't really change comparing it to the rest of the series. It still had that unique Shaft animation style that most of us have grown to love and cherish. I liked the little things that animators had added. For example there were a few western themes or styles for example, one part in I believe \"Sodachi Riddle\" had a western cartoon theme (Maybe powerpuff girl) where Ougi was on a sports car.\\n\\n\r\nThe soundtrack and voice acting was still pretty good. One thing that stood out most to me was the outro song of this series. Especially since after the first stories were done the character on the little train thing changed to Shinobu who is one of my favorite characters on the show. Overall I felt disappointed with Owarimonogatari. I felt that most of it wasn't really worth watching. \\n\\n\r\nFinal thoughts, if you have watched the entire series, and are just starting Owarimonogatari don't have your expectations up to high.\\n",
            "date": "2016-12-24T05:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 236342,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=236342"
        },
        {
            "content": "This series is beginning to wear on me. Bakemonogatari, with all its hints of a rich, expansive world of seemingly unrelated yet subtly interconnected occult stories, showed a great deal of promise. Yet, as things wind down toward a conclusion, the high feeling I had at the resolution to that initial story is being slowly sapped away from me.\r\nOwarimonogatari certainly has much to offer visually, with a few key moments demonstrating how Shaft's techniques have been refined over the years. The first episode in particular is perhaps even more visually interesting and engagingly written than anything in Bakemonogatari, but unfortunately that creative drive seems tohave died down by around the middle of this run. That lessening of this season's visual flair certainly does not help the increasingly bloated dialogue.\\n\\n\r\nIt may seem the height of redundancy to describe a dialogue-driven series like Monogatari as being too wordy, but that is precisely the problem with many of Owari's scenes. Even characters with the mystique of Gaen Izuko cannot help but fail to carry an entire episode and a half of rambling, one-sided exposition that still manages to end without having made its major point in a convincing fashion. A particular low point for the whole of Monogatari occurs when Shinobu and Kanbaru manage to have one of the longest-seeming conversations in the series in about six to seven minutes of circulating illogic. \\n\\n\r\nWhile it is still definitively Monogatari, retaining many of the humorous character interactions of its predecessors, Owari gives the distinct feeling of spinning the series' wheels rather than bringing in new and interesting ideas, or building to a conclusive climax. Yet again, another girl appears to become hopelessly in love with Araragi for no good reason. Yet again, we're treated to a professional apparition hunter explaining to our main characters exactly how our current circumstances arose and how to solve them. Etc. Etc.\\n\\n\r\nI worry that even the charm of Bakemonogatari will eventually be lost with the realization that its characters are unable to carry such a character-driven story for this long. Poor Araragi looks more witless and indecisive than ever, our formerly great heroine Senjougahara has nothing particularly interesting to say even in her brief time on screen, and Hanekawa's supposed awakening at the end of the Tsubasa Tiger arc is significantly cheapened by the fact that she acts about the same here as she always has before.\\n\\n\r\nMore than anything, I hope that the next major anime adaptation will finish off Monogatari in at least a somewhat stylish fashion. Studio Shaft has much to offer the anime industry, and I would hate to see that potential squandered milking the sore udders of this particular cash cow. So please, let this overwrought cast of characters fret its final hour upon the stage, and then be heard no more.",
            "date": "2016-11-19T19:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 234031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5609233.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Laputan_Machine",
                "username": "Laputan_Machine"
            },
            "url": "https://myanimelist.net/reviews.php?id=234031"
        },
        {
            "content": "In general, \"The Cycle of Histories\" is not a title for everyone, but it has its own zest. Before you look at the \"Owarimonogatari\", you need to look at the previous 6 stories, otherwise there will be no point in understanding the whole essence of this work. The \"owarimonogatari\" consists of 12 episodes, of which 1 is a hourly spell, the next 5 are sort of as flow from it, telling about Ougi Oshino and are more or less a separate story. But the last six are already full-fledged stories, by the way the first 6 series occur after the actions of the second 6series. The first 6 episodes (some mix of detective and mysticism) are very dull and do not say that this is a cool start to the season, the second part of it is more interesting, here you have more action, there are old characters and a very nice ending. What pleased, this is a small amount of fan service. Was the season successful? The answer, yes was a success. Enjoy your viewing.",
            "date": "2018-04-07T11:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 277255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6631073.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Aynu5h",
                "username": "Aynu5h"
            },
            "url": "https://myanimelist.net/reviews.php?id=277255"
        },
        {
            "content": "::Alright here's a quick summing up of my thoughts. Consider it a short review. No need to waste your time with long-ass pretentious writing that doesnt cut to the chase::\r\nSo I just saw Owarimonogatari. And it was quite the fun time. The writing is just as impeccable, and it goes without saying that the franchise still is able to maintain my undivided attention despite 65 episodes of conversations stretched across several cours. \r\nOugi Oshino proves to be a surprisingly interesting character. Back when I first started Bakemonogatari and I saw the front cover for Owarimonogatari, I thought Ougi would just be another member of Koyomi'sharem, who would essentially be \"the Weird and Quirky one\". Ougi is a surprisingly intimidating character for someone who looks so unassuming (for lack of a better word). Her (or His) words cut pretty deep, and everything Ougi says has this ominous undertone that I find unsettling. To say any more would be to cheapen or spoil the experience, so sit and watch as she (or he) talks your ear off About things you'd never normally find this interesting (as is common practice in Monogatari).\\n\\n\r\nThe other standout character this time around is Sodachi Oikura, a childhood \"friend\" of Araragi who, unlike all the other girls, hates him with a passion (talk about a departure!). Her short time with the cast has proven to be quite powerful, and her presence felt just as strong as any of the other cast members (as Ougi would likely call them). Sodachi is easily my favorite character in this particular title of the franchise. Not only is she not involved with aberrations, but also is a spiteful and hateful ball of depression and resentment. Her connection to Araragi's past means she's very important to his development as a person, and is even a catalyst for how Araragi became the man he is. Sodachi's seiyu does a fantastic job at portraying her to be snobbish and unforgiving. She's quite the hottie to boot.\\n\\n\r\nThe arc called Shinobu Mail takes up the second half and is told by Araragi as a flashback to what he was up to while Hanekawa dealt with a rather troublesome Tiger in the Tsubasa Tiger arc. I mostly consider this arc to be a follow-up to Shinobu Time, and what happens in Shinobu Mail is pretty relevant to a lot of the strange occurrences in Araragi's hometown, which i was very satisfied to see. Needless to say, it began about as engaging as the rest of Monogatari. The renewed focus on Shinobu was very nice seeing as I really like her character, and Kanbaru being around was also really nice to see, because she's also a big favorite of mine. It answered a lot of questions, and yet, despite being a part of Owarimonogatari, Shinobu Mail feels more at home when compared to Monogatari Series Second Season. Nonetheless, for some inexplicable reason, this arc felt a little less engaging than usual, as it went on. The likelihood that this is my fault is pretty high, considering I was getting pretty tired by the end of it. Regardless, I still enjoyed it immensely.\\n\\n\r\nI give Owarimonogatari a 9 out 10\\n\\n\r\nOh yeah, as usual, the show looks amazing and distinct, and the music is pretty great, blah blah blah. It's monogatari, what else would you expect?",
            "date": "2017-01-08T03:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 237762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5336817.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FalseShepherd13",
                "username": "FalseShepherd13"
            },
            "url": "https://myanimelist.net/reviews.php?id=237762"
        },
        {
            "content": "Owarimonogatari is yet another installment in the adaptation of the Monogatari LN series. This follows 3 stories, two of which focus on one character exclusively and resolve in a way that's both satisfactory and at the same time, kind of disappointing. The VA's of the focal female characters are doing their own openings with exception given (yet again) to Maaya Sakamoto. Decent Black strikes the nerves a funny bit the first few listens, but it soon becomes catchy and you find yourself obsessively looking it up on youtube. Mathemagics on the other hand, has a rather James Bond-esque feel to it that works really wellwith the overall theme of the second story. \\n\\n\r\nThe series is short at 12 episodes, but thankfully does a good job of fleshing out its characters, finalizing its plots, and giving an overall impression of quality. The negative points are more relevant to the one-off characters (Oikura is around for the span of maybe 2 episodes in total appearance time and the Oddity-Slayer does little more than act like a spoiled brat) in that for Monogatari, they're kind of one-dimensional. Oikura seems defined by her one characteristic of \"I hate Araragi\" (not to take anything away from her character as a whole, because there is a character outside of that one quality) while OS is sort of... There. The latter doesn't do much aside provide a minor inconvenience for everyone until Shinobu shows up and tells him how she really feels (and by then, it's kind of an after-thought). \\n\\n\r\nOugi is prominent throughout. Even in the stuff that doesn't exclusively include her, you know she's around, lurking in the shadows and watching things unfold. If not, she's being told the story and somehow has the answer to the questions that aren't asked. Her role in all this was spoiled for me by the LN people, so if you haven't read them, don't ask! Just enjoy the mystery. \\n\\n\r\nAll in all, Owarimonogatari is a Monogatari season through and through, the show has been stumbling a bit since Second Season, too. If this is a sign of things to come, I'm confident that we're on the right track!",
            "date": "2016-01-03T11:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 207658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4317493.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SentiOnikawa",
                "username": "SentiOnikawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=207658"
        },
        {
            "content": "It is another monogatari title. Meaning you'll see a lot of characters that look at you with their head tilted, abstract backgrounds resembling post-modern art, and it'll once again involve Araragi Koyemi plus some of the characters you've seen in the past.\r\nNow... my feeling of the anime were, in the end positive. Detailed breakdown is below.\r\nImpression/details in no particular order.\r\nThe overall story is fairly weak for a monogatari series, and feels very drawn out. The first story ark in monogatari has a very strange choice of a subject that is very unusual for monogatari series, and felt out of place. The character of the firstarc (around which the mystery was centered) felt like a character borrowed from some different series.\\n\\n\r\nThere are many situations where prolonged monologues and dialogues feel a bit too drawn out, even for monogatari.\\n\\n\r\nI'm also not exactly sure why this anime is so obsessed with school desks. In almost every abstract background this anime uses, you'll see a large number number of school desks moving around, being repositioned, displayed from different angles and so on. Monogatari uses repeated/patterned art/episodes a lot, but this is pretty much the first monogatari season where I started noticing school desk reuse in the scene.\\n\\n\r\nOverall, my impression of owarimonogatari would've been negative, BUT.\\n\\n\r\nFirst, the series had opening song (\"decent black\") in first episodes which I greatly enjoyed.\\n\\n\r\nThe second positive is ... each arc of owarimonogatari has a character araragi interacts with a lot, and in all cases that character is fairly well written and interesting to watch. Interactions with a \"focus character\" bring life to all arcs of this anime.\\n\\n\r\nSpeaking of characters, Oshino Ougi is a very powerful presence in scenes where she appears,  and aside from her there is an infrequent but highly entertaining scenes with witty/entertaining comedic dialogue, which is not really related to the story.\\n\\n\r\nSo the bottom line is...\\n\\n\r\nAside from final episode that has a genuinely interesting moment, the \"central story\" is not that interesting, but the show is worth watching because of interesting opening song, powerful \"side\" characters and humor in non-story related dialogue. Oshino Ougi alone is a good reason to check the serious out. Just don't get your hopes too high about the central story of this season: while there are great characters and scenes where this anime shines, there are plenty of disappointing moments. The reason why I've rated the anime high despite this issue is because good moments overshadowed bad ones. So, basically, there are a lot of moment where the anime doesn't feel very special, but among those there are less frequent moments where it becomes really great.",
            "date": "2016-08-12T16:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 226590,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=226590"
        },
        {
            "content": "What else can be said about the Monogatari series at this point in the game?  It's been around for what feels like forever, presenting one of the best examples of dialogue, character and story-driven excellence in anime.  Owarimonogatari is literally just a handful of prolonged conversations.  The action within it can be summarized with one slap, a retaliatory punch, a brief fight with a samurai, a face grab and a touch to the chest.  That's it.  If any other anime that is supposed to be a mystery/action show tried getting away with that, it would be panned as boring.But, that is the strength of all of the Monogatari series, even those with more action.  \\n\\n\r\nThe dialog is so excellent, so engaging, they don't really have to do much in the way of action.  You find yourself glued to the screen reading every line as they unwrap each mystery, and for this season, the mystery was particularly morbid.  While funny, everything isn't a joke.  Why witty, nothing becomes pretentious.  It's just flawless writing, which produces flawless characters, which in turn produces flawless stories.  That is what the Monogatari series is all about and Owarimonogatari is just another prime example of it.\\n\\n\r\nThis is like the 10th installment of this series.  You already know you should be watching it.  \\n\\n\r\nStory: 10\\n\r\nArt: 10\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 10\\n\r\nOverall: 10\\n",
            "date": "2018-12-28T21:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 297277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=297277"
        }
    ],
    [
        {
            "content": "In the heat of all the millions of One Punch Man reviews, I've decided to take on the task of reviewing this series onto myself. This will be quick and spoiler free, yay!\r\nOh Monogatari, a strange one you certainly are. The way I see it is that there are 2 types of reviews for this series - the people praising it for being a complete masterpiece of the modern age with no flaws what so ever and the people that hate it for... what again? Oh that's right, it's \"devoid of a functioning storyline and character development\" as pointed out by some pleb on thiswebsite. Now, I respect your opinion and everything but..  you're wrong. \\n\\n\r\nWhat's so special about this series is how it handles exactly that. It doesn't follow a strict route in storytelling, it just kinda does whatever the hell it wants. Apart from the occasional obnoxious panty shots I think the story is very unique and engaging for the most part. As for the characters - you've got our protagonist who while being a borderline lolicon also happens to be a vampire, a sadistic tsundere with a daddy complex, a cat girl, etc. Point is that if not on the most complex side of things (also arguable), the cast is one of the most entertaining I have ever seen. The story combined with these characters and breaking the 4th wall humor makes this show what it is. However while I do praise it, the fact still remains that the Monogatari series is an overrated one.\\n\\n\r\nPretty edgy, huh? Anyway, Owarimonogatari is the final installment of the Final Season and it focuses on the mysterious transfer student, Ougi Oshino, who is seemingly Oshino Meme's niece. Ougi has appeared through various arcs of the series but never really got over an episode of screen time as far as I can remember. Something interesting as well is that Kanbaru referred to Ougi as a guy, what gives? So yeah, not knowing a characters gender is pretty mysterious to me. Owarimonogatari is divided into 2 arcs or 3 parts - Sodachi Riddle / Sodachi Lost and Shinobu Time.\\n\\n\r\nThe first arc is very mystery driven. It starts off with Araragi and Ougi getting trapped in a classroom. Pretty plain and simple, right? Turns out that a pretty big event took place in that classroom a couple of years ago. Soon after we get introduced to Araragi's former classmate who seems to hold some kind of grudge against him. To be honest, I thought I was going to hate this character. While I still somewhat do it turns out that she is a lot more complex than I originally imagined. What is her story and how is she related to Arararagi apart from being his classmate? That's pretty much all that can be said without spoiling. There also happens to be a pretty cool random James Bond reference thrown in there because why not.\\n\\n\r\nSurprisingly enough, even though the 2nd arc is called \"Shinobu time\" there is no Shinobu to speak off for the first 2-3 episodes. No worries though, the show does compensate. We start off with Araragi meeting up with Kanbaru in the middle of the night in the abandoned school. The possibilities of that scenario are endless but sadly Koyomin is just acting on orders of Gaen, as we knew she wanted to meet with Kanbaru. All of a sudden a strange samurai appears. After seemingly defeating him they realize that it was just an empty suit of armor. The building is then lit on fire but they are saved by Yotsugi. Saying anything else would be getting into spoiler territory so let's avoid that.\\n\\n\r\nKanbaru has also gained quite a lot of best girl points from this arc. Every moment with her is just pure gold, she may provide the best fanservice in the entire series actually. \"Eat up!\" All that was needed was more of Senjougahara and/or Kaiki-chan but I'll let it slide this time.\\n\\n\r\nThe production value is top notch as to be expected from Shaft. The entire Soundtrack is filled with variations of music that work perfectly as the series changes tone and the voice acting is great as always. It might just be me but I feel like this is the peak of the Monogatari series in terms of animation. Everything just looks so smooth and nice to look at. Probably just me though, amazing nonetheless.\\n\\n\r\nSo all in all, Owarimonogatari follows the same general formula as all of the other series, filled with witty dialogue, amplified by all the shaft shafting. Should you watch Owarimonogatari? Probably, just keep in mind that it's not as good as Bake or Second Season and that the 2nd arc is inferior to the first. 6.5, best of the season.\\n",
            "date": "2015-12-19T10:55:00+00:00",
            "helpful_count": 115,
            "mal_id": 205994,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4723931.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Captain220",
                "username": "Captain220"
            },
            "url": "https://myanimelist.net/reviews.php?id=205994"
        },
        {
            "content": "The Monogatari franchise has been a creative narrative with some of the most intriguing dialogues found in the light novel medium. Owarimonogatari isn’t so far different either as the series takes on three separate arcs that is molded into 1-cour adaptation of 12 episodes. Adapted by studio Shaft, which is well known for an avant-gante style of artwork, the series makes it bold return. And any fan of the Monogatari franchise should be excited because this latest work will leave some classic memories.\r\nFor storytelling, Owarimonogatari is divided into three parts. They are known as “Ougi Formula”, “Sodaichi Riddle”, and “Sodachi Lost”. All three parts drawsconnections with each other that interconnects the story as a whole. Araragi is once again a centerpiece for the story. But that’s not all, there’s also the mysterious Ougi who plays a sort of lead character to guide others. The most pivotal moments of the season involves Ougi’s relationship and conversation with Araragi. Their interactions brings about a battle of emotions and bizarre mystery from two years ago. Ougi Formula covers Araragi’s growth as a character and how he uses his experiences to solve problems. What I also find interesting for the episodes of this arc is the clever geometric usage of the artwork style. Add a bit of mathematics and you’ll feel like it’s back to school.\\n\\n\r\nSodaichi Riddle takes on a different approach, one that’s more based on personal problems and also pits Araragi with his former classmate, Oikura. The interesting parts about these episodes is the amount of emotional expression. Oikura’s hatred for Araragi is explained based on her past background story that has connections with him. Tsubasa Hanekawa also gets involved that pits her in a unique angle between herself, Araragi, and Ougi. Speaking of which, Ougi’s presence in the show is still the most mysterious. It’s hard to trust or know what her true intentions are. However, her role in the arc is meaningful as she guides Araragi to the truth. Yet at the same time, Ougi’s actions seems to also suggest that she is attacking Araragi’s insecurities. Hanekawa’s role in this arc seems to stand for as an antithesis of Oikura’s character, especially in family values. What the arc ultimately brings is an iconic buildup and execution in Monogatari fashion at its finest.\\n\\n\r\nSodachi Lost, the final part of the season, brings together the reunion of some of the characters from the Monogatari franchise that fans are well aware of. These include Shinobu, Gaen, Kanbaru, and even Ononoki will feel like a refreshing sight. The arc also introduces some other mysterious supernatural beings that while seems gimmicky can also be unique. Their role in the arc is also very important that makes the story compelling. For fans who are familiar with Bakemonogatari, it will even feel somewhat nostalgic with the strange apparitions that makes their appearances. Do be aware that the timeline and info dumping of this arc can feel confusing at times so it’s better to rewatch some scenes carefully. However, the reward is the distinctive amount of word plays with Shaft’s clever adaptation. Furthermore, there’s some attractive references and facial expressions coming from Araragi. Kanbaru’s role as a comic foil is also fun to watch especially with some of her suggestive innuendo jokes.\\n\\n\r\nThat being said, Owarimonogatari is a unique show but definitely not something everyone can get used to. For any new fans, watching this show will feel confusing even with knowledge of the previous seasons. The most enjoyable way I find to watch this season is getting a feeling of attachment with the characters. In particular, Ougi is the most mysterious of the cast and it’s intriguing just to anticipate what she will do next. Her unpredictable behavior will often get viewers thinking what her true intentions are. Araragi’s interactions with the others will show more of his character on a more personal level. Add a bit of comedy and this will feel quite like an unorthodox adventure in Monogatari style. On the other hand, the season does omit some parts of the novel. Not every adaptation can be focus on a panel-by-panel level after all.\\n\\n\r\nAs with most Monogatari series, Shaft once again proves that it’s capable of delivering its clever artwork. There are many word plays that works well in conjunction with the dialogues. There is also three different OP theme songs for each of the different arcs that is quite artistic with the style it delivers. Most often, I find a lot of the scenes for this season to be fun to look at whether they are for plot development, comedy, and references. The show appears to be self-aware of its own traits and have fun with itself. Just be aware that there is an abundance amount of sex jokes and suggestive references as some fans may find it uncomfortable to watch at times. In addition, character designs are also fairly unique. Ougi’s black hollow eyes and ambiguous gender is one of the most bizarre character designs I’ve seen. Not to mention, her pendulum-like body movements reinforces her mysterious presence and role overall for the season. Swinging back, swinging forth…\\n\\n\r\nSoundtrack is also a unique feature that I think not too many people notice often. But when examining it more carefully, it’s iconic. The eerie mood of the season in all three arcs can only work with the dynamics of the OST. And to be quite honest, it fits very well. Furthermore, the character voices matches in credibility with the personalities of everyone this season. Again, I have to emphasize that Ougi’s voice is the most mysterious. Kaori Mizuhashi’s performance with her character is to be praised as she is able to step into the shoes of such a character. Finally, the ED theme song has a nice eerie rhythm with its thrilling cinematics.\\n\\n\r\nOwarimonogatari is a fairly unique show for its ability to convince viewers to watch and read at the same time to appreciate the story. By reading, I mean it more like trying to understand what the characters’ roles, dialogues, and word plays mean. It may feel like a brain fart at times but also fairly entertaining to comprehend the story’s intentions. The emotional expressions and character interactions will be what seasoned fans will expect – dynamic and one that continues with a thrilling resurgence with its trend. It’s twisty that’s filled with mysteries and moments that will tear the house down.",
            "date": "2015-12-19T07:42:00+00:00",
            "helpful_count": 114,
            "mal_id": 205976,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=205976"
        },
        {
            "content": "The final season for the Monogatari series...I never thought I'd reach this point. This obviously isn't the final show for the series. There's still the 2nd cour for Owarimonogatari, a bunch of Koyomi arcs and Kizumonogatari.\r\n(There will be SPOILERS in my review)\r\n[Story]: (9/10) (SPOILERS)\r\nOwarimonogatari is a sequel to Tsukimonogatari but it does not take place after Tsuki.  The first 3 arcs chronologically takes place after Onimonogatari and Nekomonogatari: Shiro and the last arc chronologically takes place immediately after Onimonogatari. The show features Ougi Oshino, an underclassman introduced to Araragi by Kanbaru Suruga. \r\nI thought Second Season was going to be the only Monogatari seriesthat's better than Bakemonogatari. I mean, out of 6 Monogatari that was released, only 1 was able to beat Bake and that's Second Season. After finishing Owarimonogatari, it's safe to say that there are now 2 Monogatari that is better than Bakemonogatari and that's Second Season and Owarimonogatari. I'm going to explain as you read through the review. \\n\\n\r\nThe series is divided into 4 arcs...These arcs are called \"Ougi Formula\", \"Sodachi Riddle\", \"Sodachi Lost\", and \"Shinobu Mail. I guess you can count Sodachi Riddle and Sodachi Lost as one arc because these 2 arcs revolve around the same character except both arcs have 2 different mysteries. Just do whatever feels best for you. In this review, however, I'm going to count the 2nd and 3rd arc as one whole 2nd arc. \\n\r\nNow this is where the spoiler comes in. In fact, at this point, it's going to be filled with heavy spoilers as I'm going to review each arc. Just like I did with Second Season. \\n\\n\r\nThe first arc is \"Ougi Formula\". Technically, this arc lasted for 2 episodes but this was a one hour episode. So..what's in this arc? Basically, Ougi and Koyomi are trapped in a classroom and they start thinking of how to get out of the classroom. Is that it? No, that's just a simple summary. In fact, this is the first arc in the whole series that doesn't deal with any aberrations. In other words, this arc is like one of those mystery novels. A mystery that's got something to do with one of Koyomi's past. The dialogue scenes in this arc are really engaging. This is why I love mystery, it forces me to ask questions about this and that and Ougi Formula also did the same thing for me. I was asking questions such as the relationship between Koyomi and Sodachi, who actually stole the test answer sheet, and et cetera.  The mystery of this arc was well thought out. It was actually almost similar to Hyouka's mysteries with an added Nisio Isin flair in it and the answer to the whole mystery was pretty unpredictable. I mean, first second you thought you figured out the answer, the next second, they throw more information at you that invalidates your previous answer. \\n\\n\r\nNext up is Sodachi Riddle/Lost arc. Just like the first arc, this was also a huge \"mystery\" arc that doesn't have to do with any aberrations. The first half of the arc (Sodachi Riddle) basically expands the first arc and starts to ask more questions like \"who is Sodachi\" and \"why does Sodachi hate Koyomi like he murdered her family?\". This arc also visits Koyomi's past and explains why he is the way he is right now. The second half of the arc explores Sodachi and her parents and what actually happened to her mom. \\n\r\nI honestly DO NOT GET why some people hate this arc. Please give me reasons..One of the reasons why I love this arc is it's something different from your usual \"girl's abberation problem\" arcs that you've seen countless times in previous Monogatari series. Another reason is I'm a big fan of mystery. The way the mystery is handled in this arc is just absolutely amazing. \\n\r\nLet me give you a few mysteries that was from the Sodachi Riddle arc. Why did Sodachi begin teaching Koyomi \"Math\"? Why did Sodachi specifically choose Koyomi and invited him into her house? Why does Sodachi hate Koyomi's guts?. You think you know the answer? Wrong, you don't (Unless you've seen the show). The answers to these mysteries are not as straightforward as you think they are. The mysteries are so well-thought out that figuring out the answer to said mystery is complicated as hell unless you hear the character's backstory. Even their backstory might not be enough, unless you're a smartass. \\n\\n\r\nLastly, the \"Shinobu Mail\" arc. Unlike the first 2 arcs, this arc is all about \"aberrations\" again. It's not a new \"aberration\" though. This arc just expands and wraps up on the story Shinobu told to Araragi in \"Shinobu Time\" arc. The arc took place during (or slightly before) the events of the Tsubasa Tiger arc so they finally showed us where Araragi came from before jumping in to save Tsubasa. Anyways, you remember that first minion that Shinobu was talking about right? You better because he makes a return for this arc. The reason why he returned is actually rather kind of sweet...I think. At first, I thought he had some kind of diabolical plan but turns out, he just wants his sword back and wants to apologize to Shinobu for what he did 400 years ago. There's a bunch of reasons why I love this arc so much. Firstly, the Araragi and Kanbaru pairing and no I'm not talking about pairing as in love pairing. It's just like the previous Monogatari series where Araragi and X female character pairs up together to solve a mystery/problem. I love their pairing because it creates tons of hilarious moments. Half of it being perverted. Secondly, I just love the character dynamics between Araragi and Shinobu. If you see these 2 characters together, it creates a ton of best moments. Third and lastly, obviously is the character development for Shinobu and Kanbaru. The only downside to this arc is it felt a bit underwhelming. The dialogue scenes aren't really on par with the Second Season. However, I'm not saying that the dialogue scenes were bad. They were pretty good actually.   \\n\\n\r\nPutting the story aside, I now want to talk about the show's 3 points. Fanservice, the Pacing, and the dialogue scenes. Firstly, the amount of fanservice scenes in Owarimonogatari is almost the same as Second Season. In other words, there's a not a lot..Thank.God!. Secondly, the pacing of the show is great. For a 12 episode anime, they managed to have the same pacing as Second Season which I found to be almost perfect. They didn't go too fast like Bake nor did it go too slow like Hana. Third and lastly is, of course, the dialogue scenes. It's back which is not a surprise. The dialogue scenes for the first 3 arcs are great and like I said above, the dialogue scenes for the final arc is a bit underwhelming but it's still pretty good. \\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (10/10)\\n\r\nThe visuals and animation of Owarimonogatari looks great..I mean, if you've already seen Tsukimonogatari then you shouldn't have any problems with the animation as the 2 shows have the exact same animation. The character designs looks great too, especially the way Ougi is designed. To this day, I'm still wondering why her eyes looks different than the rest of the characters. \\n\\n\r\nEver since Tsukimonogatari, the flashing text that appears randomly on the show has been different. Owari is no different. The way they designed the flashing text resembles the character's arc. For example, the flashing text in Sodachi's arc has a bunch of drawings on the background that resembles math and algebra. \\n\r\n______________________________________________________________\\n\r\n[Sound]: (8/10)\\n\r\nHonestly, I was quite disappointed with most of the show's OP theme song. Before I get into that, I want to get into the soundtrack of the show. Just like the previous Monogatari shows, a background theme would play every time a dialogue scene plays out. So did Owari's background theme impress me? Of course, it did. It just made the already-engaging dialogue scenes more engaging. Now the OP and ED theme songs. \\n\\n\r\nThe OP theme songs are \"Decent black\" by Ougi Oshino, \"mathematics\" by Sodachi Oikura and \"mein schatz\" by Ryuichi Takada. The ED theme song is \"Sayonara no Yukue\" by Alisa Takigawa. I'm going to have to be brutally honest here..the 2nd and 3rd OP theme song sucks. Sodachi's VA is a crappy singer and I still have no idea what's the deal with Shinobu's VA not being able to sing in an opening. The only great OP theme song for Owari is the first one and it only played for 1 episode. I gotta say though, SHAFT put in a lot of effort on the 1st OP theme song even though it's only for 1 episode. The ED theme song sounds pretty decent but the Second Seasons' ED theme  song is still better. \\n\\n\r\nMaybe this is just me but I didn't like Sodachi's VA that much. It's not that she's bad or anything..Her voice just doesn't fit. She sounds like a 35-40 year old girl. If her voice was a bit lighter then it would have fit. Ougi's VA, on the other hand, is f*cking amazing. She has that voice that makes her a more mysterious person than she already is. That's all the VA's I'm going to review. \\n\r\n______________________________________________________________\\n\r\n[Characters]: (9.5/10) (SPOILERS)\\n\r\nIf you were expecting characters like Senjougahara, Koyomi's sister or even Kaiki then don't. Senjougahara barely gets any screentime and the last 3 characters I mentioned did not make an appearance at all. I guess it's only fair. They already got enough screentime in previous Monogatari shows. There were some major characters that made an appearance like Hanekawa (Sodachi Lost), Kanbaru and Yotsugi (Shinobu Mail). I now want to focus on characters such as Ougi Oshino and Sodachi Oikura. I'll also also get on other characters if I can but I'm going to have to write it shortly. \\n\\n\r\nAfter making many mysterious appearances in previous Monogatari shows, Ougi finally gets her own arc here in Owari and obviously, some background about her and who she really is. In short, she is a transfer student and is introduced to Araragi Koyomi by Kanbaru Suruga. Even after getting her own arc and being a major character in Sodachi Riddle arc, she's still the most mysterious and the most creepiest character in the Monogatari series. I mean, why does her eyes look so dead? Just try looking at her eyes for an hour and see if you don't get any nightmares. What's more mysterious about her is the fact that she's as smart as Sherlock Holmes. She's the one who solved the mystery in \"Ougi Formula\" and \"Sodachi Riddle/Lost\" arc. She even provides concrete evidence to support her conclusion. I really want to know which part of the Oshino family gave her that trait because Oshino Meme is a bum and not a smart-ass. \\n\\n\r\nNow that's out of the way, I'm now going to talk about Sodachi Oikura. Sodachi is a new character introduced in Owari. Unlike most of Araragi's harem *cough I mean, the girls having an aberration status, Sodachi doesn't have one. The show instead uses Sodachi not only to build her character but to develop Araragi's character as well. Turns out, Sodachi had a terrible childhood past. Calling it \"terrible\" would be an understatement. \"Horrific\" is probably the word I'm looking for. Anyways, Sodachi didn't have a great childhood. She had terrible parents, her mother died in a locked room without her knowing (she probably knew) and what's worse is Araragi forgot the reason why he is what he is today. Basically, Sodachi is the reason why Araragi has loads of friends and why he is great at math. \\n\\n\r\nLast characters that I want to talk about are Hanekawa and Kanbaru. Hanekawa got a fair amount of screentime in Sodachi Lost arc. Instead of Ougi helping out in this arc, Hanekawa helped Araragi out. I will leave the interpretations to you on why Hanekawa helped Araragi out and not Ougi. Kanbara also got a fair amount of screentime in Shinobu Time arc. Kanbaru really surprised me in this arc and might have became one of my new favorite characters in the Monogatari series. If you've seen Episode 11 then you know what I'm talking about. That's right, the conversation between Kanbaru and Shinobu. Kanbaru just put Shinobu to shame with their argument. \\n\r\n______________________________________________________________\\n\r\n[Enjoyment]: (9/10)\\n\r\nI didn't really enjoy Owari as much as Second Season but I definitely enjoyed the show way more than Bakemonogatari. If \"Shinobu Mail\" was as great as the Second Season's arc then I would have enjoyed Owari as much as Second Season. \\n\r\n______________________________________________________________\\n\r\n[VERDICT]\\n\r\n\"Owarimonogatari\" is a great addition to the Monogatari series. Owari is definitely on par with the Second Season in terms of great character arcs, pacing, and the characters and Owari is a lot better than Bakemonogatari; making Owari the 2nd best Monogatari series just under Second Season. The only issue I found in Owari is the \"Shinobu Mail\" arc which felt a bit underwhelming compared to Second Season. It's still a great arc though. \\n\\n\r\n[OVERALL]: (9.3/10)\\n\\n\\n\r\nPros:\\n\r\n+Great Story\\n\r\n+Mystery-like arcs\\n\r\n+Dialogue scenes are as engaging as ever\\n\r\n+Outstanding and Unique Animation\\n\r\n+Soundtrack was not heavily changed\\n\r\n+Main heroines of all arcs are fleshed out and developed\\n\r\n+Second Season's near-perfect pacing returns\\n\r\n+Fanservice reduced significantly\\n\\n\r\nCons:\\n\r\n-2 out of 3 OP theme songs are terrible\\n\r\n-\"Shinobu Mail\" felt a bit underwhelming compared to Second Season\\n",
            "date": "2016-01-16T10:07:00+00:00",
            "helpful_count": 36,
            "mal_id": 208658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=208658"
        },
        {
            "content": "To start with the good news, Owarimonogatari is a breath of fresh air in this rather stale year in animes. The bad news? While its second half provides hints of what was the aftermath of Kizumonogatari film to be aired next year, it is one of the worse arcs in the Monogatari universe.\r\nStory and Character: 6/10\r\nThe Sodachi Lost Arc is an oddball even by Monogatari standards. It started with solving the supernatural right away then proceeded with detailed explanation behind the titular character in the arc. The pacing is slower than normal albeit more even which gave enough time to layout the foundation of thisfantastic case and the characters to develop well. For the plot, it is straightforward this time and avoided some irritating Monogatari quirks that marred the show.\\n\\n\r\nEvery character was utilized to the extent that removing one of them leads to the series' failure. Sodachi, in particular, stood out given her neurotic nature and her background which justifies why she hates Araragi. Ougi, on the other hand, is still an enigma to the viewer but is not as abrasive during her presence in Shinobu Time so she gets a pass. The arc also gets a big plus because Araragi is not portrayed as your typical loli-loving pedophile but as a person who is trying to resolve some issues in the past and is trying to find the missing part of him which he repressed in his memories. Moreover, the Sodachi Lost Arc explained as to why Araragi was like what we saw through the course of Monogatari series.\\n\\n\r\nIn that sense, the first half of Owarimonogatari could be viewed as a coming of age story because Araragi and Sodachi managed to settle everything between them. As for Araragi, he finally reconciled with Sodachi. As for the latter, she is now able to move on because she found what she hoped to look for. (Spoiler: It's not romantic in nature)\\n\\n\r\nThe end product is a compelling and emotional piece that is reminiscent of what Monogatari can offer in its prime. \\n\\n\r\nThe second half? Not so much. The disappointment could be from the unrealistic expectation Owarimonogatari brought but it is no doubt that this arc is one of the subpar ones in the series. The majority of Shinobu Mail did what your typical bad Monogatari episode does: there was too much talking that did not move the plot.\\n\\n\r\nThe bad omen began when this particular arc opened with Araragi and Kanbaru had their banter which was seen too many times in the series that the jokes grew old. Gaen talks too much to the extent that her ramble took half of an episode with much of the details flying to the viewer's heads. The comedy in Shinobu Time didn't help either. This is because we already saw those jokes and there are certain points in the series where you have to really know Japanese to appreciate some of their gags. \\n\\n\r\nWhich was a shame, because the premise of this arc could be the more nuanced than the first arc. We have Shinobu and her first minion showed again after being supposedly dead for 400 years. How cool was that? Instead, we get an unnecessary slow arc with Gaen side trips and loli-tripping that took four episodes to be good. The output is just as emotional as in Sodachi Lost Arc but the way this arc was executed was really questionable.\\n\\n\r\nSound: 8/10\\n\\n\r\nAgain, Shaft is still excellent in providing the right music for a Monogatari show. It knows how to employ OSTs with fast beats when the characters try to come up with something and strings when things go dramatic. The soundtrack helped both arcs in reaching the emotional impact the studio wants. The OPs and the EDs are also strong in this one which is typical for the Monogatari series.\\n\\n\r\nVisuals: 8/10\\n\\n\r\nNow that's where this series excelled. While it may not be able to beat One Punch Man visually, it succeeded in entertaining its audience by its visual quirks. Keeping an audience awake over the span of 24 minutes is a tall task if the characters are just talking for most of the time. Shaft pulled every trick from its sleeve that ranged from visually fun (Araragi and Kanbaru's BL-centric banters) to entirely neurotic (Araragi's class search for the culprit).\\n\\n\\n\r\nEnjoyment: 6/10 (8/10 for Sodachi Lost Case and 4/10 for Shinobu Mail) \\n\\n\r\nOwarimonogatari still stands as one of the best shows in 2015 due to the lack of competition. However, if the second arc is the indication of what will happen in Kizumonogatari, it's getting real hard to be excited for the next Monogatari series.",
            "date": "2015-12-20T05:05:00+00:00",
            "helpful_count": 26,
            "mal_id": 206098,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4369563.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/samui26",
                "username": "samui26"
            },
            "url": "https://myanimelist.net/reviews.php?id=206098"
        },
        {
            "content": "(9.0/10)\r\nA pure, distilled version of what made both Season 1 and Season 2 so fascinating, Owarimonogatari works on almost every level. \r\nIf I were to write a review of the entirety of season 3, i'd include Tsukimonogatari, however, that's a separate review, so feel free to look at my review for that if you haven't before. That being said, I will be factoring my enjoyment of that arc with my overall enjoyment of the third season. \r\nThis will be my wrap up before i delve into the OVA and the movies. \r\n_____________________________________\r\n[PART 1] : Extraction\r\nThe shows first three arcs serve as a big overarching storyabout an anime cliche done well. With Oikura Sudachi playing the role of the \"forgotten friend\" or perhaps \"forgotten love-interest\" that is seen so often in anime and i'm assuming light novels. \\n\\n\r\nHowever, much like every other cliche this show addresses, its both addressed bluntly and flipped on its head. She plays a tragic character that is used expertly to subvert every expectation I had going into the arc. \\n\\n\r\nBut i'm getting ahead of myself. This comes after a wonderfully exposited story delivered by Ougi Oshino; the shows most mysterious character. \\n\\n\r\nAlthough i'm disappointed we don't get to know more about her, in a way, its nice to see this show leaving room for more stories to tell. With Ougi, who has a spectacular character design may i add... using flat colors and completely darkened eyes, she never feels like she belongs in a very alien way. \\n\\n\r\n...\\n\\n\r\nHer arc leads us, as i said, to Oikura who serves as a good exploration into both Araragi and herself as a new character. The arc reveals a darker backstory and elaborates a lot on Araragi's increasingly compelling character. \\n\\n\r\n...\\n\\n\r\nWhile I wasn't huge on Oikura's initial character design, what with her Hachikuji-esq pigtails (except grey) and general lack of uniqueness. The more I thought about it, the more I appreciated the juxtaposition between her entire symmetrical self and her entirely crazy backstory. \\n\\n\r\nWithout delving into spoilers, this arc doesn't go where I expected it to. This subversion really served to create a fascinating story. \\n\\n\r\n__________________________________\\n\\n\r\n[PART 2] : Combination\\n\\n\\n\r\nWhen I said that this show is akin to a distilled version of season 1's positives and season 2's positives, I meant it. \\n\\n\r\nIf Oikura's story played out like something out of season 2, and Tsukimonogatari played out like something from Bake or Nisemonogatari, the final arc was a different beast. \\n\\n\r\nWith Shinobu Mail, there's the sense that this show has a total direction to follow. It deals with Shinobu's past and relates her story with the overarching themes that this show's entire structure has been built upon. Romance. \\n\\n\r\nA lot of people mistake romance for an ideal. Like, \"I've been feeling romance\", or something stupid like that. Its not \"love\", its not a metaphoric object that you can have... like love. \\n\\n\r\nIts a feeling of mystery, as well as a feeling of excitement that comes from this mystery. Yes, it relates totally to love, but its a concept from that metaphoric object. \\n\\n\r\nThat's the true beauty of this final arc, and honestly, the entire show. It reflects the feeling of romance in almost every way. What makes this even more obvious is my initial confusion towards this show in my rambling first review of Bake and Nisemonogatari (All in one post under Bakemonogatari). \\n\\n\r\nThis show makes you feel, essentially, the emotions one could feel in romance. The excitement from seeing something you shouldn't. The mystery of an unfolding story. The fact that this unfolding story relates to something you shouldn't be seeing. The very idea that another definition of romance is \"a quality or feeling of mystery, excitement, and remoteness from everyday life.\" \\n\\n\r\nNow tell me that doesn't reflect the entire concept of this show! The feeling of mystery from a conversation that goes nowhere! The feeling of excitement from seeing your sexy classmate. The feeling of remoteness from locations completely devoid of people! \\n\\n\r\nThis makes me love the idea of Kanbaru, the shows more overtly romantic character, being Araragi's companion in the final arc. Its something that fits so well I didn't even realize it until Kanbaru and Shinobu's big conversation. Its perfect. The shows more romantic character addressing romanticism in a show about romance. Its so hilariously blunt, especially with her characterization involved. \\n\\n\r\nMuch like Araragi and his romantic view, she sees the world through a lovers glasses. Everything she sees and experiences is out of impulsive romance. There's even this big hilarious detour into romance-driven light novels.\\n\\n\r\nThis show is the embodiment of romance. It takes every idea and feeling given from romance and puts it on screen for you to experience. Araragi can be kind of like a surrogate for yourself, but also serve as a more fleshed out character than he was back in season 1. \\n\\n\r\nWith this shows final arc, this feeling has never been more obvious to me. People hate romance, people love romance, people have a feeling of uneasiness towards the concept of romance. I've seen every reaction to this show before. \\n\\n\r\n___________________________________\\n\\n\r\n[PART 3] : Misunderstanding\\n\\n\\n\r\nNow this is why i'm baffled by the amount of reviews I see of this third season saying that this show \"lacks developement\", or more audaciously, \"has no more action,\" all the while touting the quality of season 2. \\n\\n\r\nI feel like a lot of people are missing the point. This show isn't supposed to be some action-packed rom-com with quirky characters and an eccentric harem-having lead. Sure it mocked that concept with Bake and in a way, with Nise. But i don't think i'm giving it too much credit when I say that that's not all it is.\\n\\n\r\nMuch like real life, and much like romance, a lot of this show acts like a subversion. A subversion towards what it means to climax is prevalent throughout the shows run-time too. This is even stated multiple times in multiple different occasions.  \\n\\n\r\nBut who knows, maybe it will be that in the future. But i'm sure its not what it is now, at this point after Owarimonogatari ended. I'm left with the feeling that the writer and director created and adapted this show to portray that feeling of romance. \\n\\n\r\nHow to address romance, how to live with it, the situations it can put you in. How seeing everyday life can be a romantic experience in a way. One day your going to school, the next day your bitten by the most highly regarded vampire ever... and just continuing with school and living a regular life. Its a romantic way of looking at a mundane life, no? A romantic way of looking at nonsensical interactions and absurd progression. \\n\\n\r\n___________________________________\\n\\n\r\n[PART 4] : Reflection\\n\\n\\n\r\nIn a way, i'm rating this show in its entirety right now. The way I watched season 1 directly influenced the way I saw season 2. Those two seasons and my opinions of them undoubtedly determined my final thoughts on the third season as well. \\n\\n\r\nThat's how television works. Every episode builds on another and creates an overarching view of the show. You remember the good and the bad. \\n\\n\r\nWhat this final arc did in Shinobu Mail is the unbelievable, by making my most despised arc, Nekomonogatari (White), somewhat more bearable and understanding in context. \\n\\n\r\nThis is because the entire structure of the show often feels like a puzzle. Once again, the characters do address this, so trust me, i'm not pulling it out of my ass. \\n\\n\r\nMany times in its second and third seasons, Monogatari skips time and tells its stories like pieces of a large puzzle. Although we've gotten a lot of the endgame, we are still missing a few pieces making up the base, which is what the movies will deliver I believe. \\n\\n\r\nThis exquisite puzzle slowly forms in front of us and missing pieces just appear. So it only makes sense that it helps the disappointing Nadeko arc become just a tad bit better. \\n\\n\r\n_____________________________________\\n\\n\r\n[PART 5] : Conclusion\\n\\n\\n\r\nAll of these thoughts are coming from someone who not only has a negative opinion on anime, but went into this show wanting to dislike it. So whether everything i'm saying was something planned by the writers, or simply the ramblings of a pretentious film student; I can't help but be slightly amazed at the result. \\n\\n\r\nSeason 3 of Monogatari does what i've wanted to see in the show. It takes the heavy romance-inspired themes and the comedy of season 1 and mixes it with the well-written plot-heavy storytelling of season 2. \\n\\n\r\nWhile my favorite arc of the show is still most likely Hitagi End from season 2. There is no doubt in my mind that the most solid and truly great season is season 3. Starting from Tsukimonogatari and going through Owarimonogatari. \\n\\n\r\n________________________________\\n\\n\r\nEPILOGUE \\n\\n\\n\r\nIts very difficult for me to come to terms with what this show means for me. I feel like it did a lot with helping me come to terms with my enjoyments, and perhaps cheekily even gave me a romantics view on storytelling in some areas. \\n\\n\r\nIt means a lot though. I feel like everything it delivered to me was confusing at worst and eye-opening at best. There's no doubt in my mind that I will remember these characters in the future, whether there's more to watch after the trilogy of films air. \\n\\n\r\nI feel like I remember every character now. Going all the way back to my first review written about Monogatari. How memorable these characters are. Or how distinctly cool the show feels in so many ways. I audibly said, \"Man, this character is so fucking cool.\" More times than I'd like to admit. \\n\\n\r\nThis is something i'd love more anime to take note of. There are so many shows that simply try to over-do the \"coolness\" factor and end up making everything very same-y and boring. However, with every jolt of action or creatively designed character that's introduced, I feel an air of excitement and mystery. An air of romance? If we're going by its very dictionary-defined meaning. \\n\\n\r\nWhether its Ougi's mystery, or Gaen's hipster know-it-all-ness, or Episode's completely bonkers weapon, or Kagenui's menacing and spectacularly original character design, or Ononoki's special power... everything is delivered with the idea that its cool but it doesn't need to rub it into your face. There's no need for dramatic monologues about how badass a character is, or how scary the villain is... Its just delivered. I wish more anime did things like this. Its refreshing subversion of something that's old and tired in the anime format. \\n\\n\r\nBut i'm rambling. Point is, this show is extremely unique. Its something that can be endlessly read into but equally surface-level. Its a dangerous amalgamation of something I can't help but romanticize when I go to bed and think about it. \\n\\n\r\nTo hearken back to my first review; Monogatari is exploitative, gross, sleazy, sexist, beautiful, fascinating, memorable, and confusing. \\n\\n\r\nIt's romance. \\n\\n",
            "date": "2016-08-14T01:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 226690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5554102.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Artrill",
                "username": "Artrill"
            },
            "url": "https://myanimelist.net/reviews.php?id=226690"
        },
        {
            "content": "Story + Overview 10 / 10\r\nThe Monogatari Series is an Anime on it's entirety broken down into themes that contain one or more Arcs. The arcs themselves are shuffled on such a unique way by Nishio Ishin (NisiOisin) the author behind the series that takes mystery to a whole new level.  Each of themes or seasonal themes I'd rather call them call upon a subject. Owari meaning End, Conclusion and Monogatari meaning Story, Tale. So we know this particular season deals with closure.\r\nArt + Animation 10 / 10\r\nThis anime like the entirety of the series is done by SHAFT Studios and now that i havecome so far into the series I doubt there is another studio out there that is or would have enough game to animate something of this caliber. I bow down to SHAFT as their concept of the series is on point and has meticulously been carried out. The animation is flawless.\\n\\n\r\nSound + Voice Actors & Actresses 10/10 \\n\r\nAs someone who has read the majority of the novels I have to say i am impressed with what i heard. The work of the actors matches my expectations if not surpassed them by a long shot. You can feel their all into each one of the lines they do and their matching to the art is flawless.\\n\\n\r\nCharacters 10 / 10\\n\r\nDownright scary good well thought out, I'm most impressed with how much the voice actors and SHAFT stepped up their game.\\n\\n\r\nSORTING:\\n\r\nThe arc themselves draw upon themes with lots of engaging dialogues and multiple references to further extend their point from either literature to popular anime and many times known films.\\n\\n\\n\r\n4TH WALL BREAK \\n\r\nThis show is the only show that shatters the 4th wall like no others many times taunting, and talking to the audience challenging you many times and daring you to even make a hypothesis throughout the series. (Owarimonogatari Ep 01)\\n\\n\r\nWORDPLAY & SKITS\\n\r\nAs mentioned before this anime plays with the Japanese language. For this very reason a dub would be the most devastating thing to this series and it will never be dubbed.\\n\\n\r\nWord play is ingrained in the series and often the characters will do skits performing skits on which Kanji meanings are slightly altered to be given new meanings. Often done with the use of comedy and sometimes sexual humor.\\n\\n\r\n(See Owarimonogatari E07 for examples)\\n\\n\r\nThere is no wasted frames on the show and this can be the only show on my experience that it doesn't allow you to be lazy. Every shot has a purpose believe it or not. This show can pride itself with subtle movements and body language that literally argues with the dialogue itself. Sharpening your intuition without you noticing it. The series does this by showing and often zooming in on the characters or limbs, As if you were right in front of them and they were looking at you dead on the eye. The harmony between subtle hints of body movement and dialogue it's a perfect 10. The Backgrounds shifts of art is on point regarding the subject of dialogues or / and states of mind of the character, Often shifting regarding the mood of the situation.\\n\\n\r\nTHE NOOBS or CASUALS: [You can skip this section if you don't want some perspective breakdown on charts, grading or human psychology]\\n\\n\r\nMany inexperienced viewers will confuse the purposes of many shots for Fan Service, Many with the IQ of a Gold Fish. It is human nature of course to critique that which they don't understand harshly so that they may feel better about themselves; humans often degrade something beyond their understanding it's often done because their expectations aren't met regarding their knowledge. \\n\\n\r\nWhat do i mean? Well is that they're used to things be done a certain way and when something different comes along they're unable to deal with it. It is because they can't deal with it that they critique, Because their limited chart can't cover different style, different anything.\\n\\n\r\nThey forget that Anime, Manga, Light Novels are a medium on which a single persons imagination it's given exterior life through Drawing and Writing for the masses to view. One does not simply say, Hold on a minute imagination, Let me check the current grading scale and make sure you adhere to what these people who don't and can't write, draw or animate for shit want. \\n\\n\r\nThe medium is often used to please a crowd that connects with the artist via sheer entertainment, deliver a message through unique styles that each author / artist have. Many do the foolish mistake onto compare to other series, Why is it foolish? Well because no one that does this out of his imagination has the time to copy others and do so with the same purpose. I find it tasteless to compare writers and / or artist onto each other they don't please each other but those who is meant to experience their work. Leaving that aside.\\n\\n\r\nMEANINGS:\\n\r\nThe Show itself translates to \"A Series of Stories\" on which the main character Araragi Koyomi tells many stories from his point of view of various events that shaped and took his ordinary youth to the most twisted and unique forms as possible. The path he was taken after just one fated meeting with a beautiful vampire on a spring break, a vampire of over 500+ years of age discussed on Kizumonogatari airing 01 / 08 / 2016 as a film trilogy. The Book on english is released on Dec 15th of 2015 by VERTICAL. That's the beginning of everything. The beginning of \"A Series of Stories\".\\n\\n\r\nTHEME EXPLORATION & DEVELOPMENT:\\n\r\nMany stories that reach to the very beginning of life and emerges from the darker human nature. It grabs many topics and shifts perspectives with the characters done nicely. All done in such a unique way that comparing it to any other anime is nothing short of foolish.\\n\\n\r\nThough for the fans the Chronological order is quite simple once viewing the series on it's entirety, The airing order follows the volumes on a shuffled order on which it's meant to be enjoyed as. Many mystery series pride themselves on having mystery on the plot itself, This show decides to hide many stories from you leaving you plotting the loose ends. That's the mystery, The fact that you don't know anything, You're literally with the main character and he tells you stories but you still don't know anything. It's because you don't know anything that you can't predict anything, This often frustrates viewers that are used to easy flows of plots.\\n\\n\r\nAs said earlier many times the background changes according to the argument and shows you where is the character on state of mind. Anything from chaos, stress and / or reveal to you each character thought process and contrast it to the others in the cast. All this done is harmony sharpening your intuition and mind overall.\\n\\n\r\n(See Owarimonogatari Episode 4 - 6 for examples)\\n\\n\r\nThe characters are featured with distinct and varied facial expressions that exploit dark nature of people and / intentions, Hints traits such as SADISM portrayed by Ougi on Ep 01 of Owarimonogatari. This show is no stranger to exploration of word play of the Japanese language taking it apart and setting example of different connotations of meanings. Funny enough you will learn Kanji throughout the show.\\n\\n\r\nEnjoyment 10/10\\n\r\nOn my point of view the show is a true work of art as it explores anything and everything and takes digs at society and it's norms through exploration and debates with heavy dialogues. This show every aspect it's unique and often explores subtle facts that we often ignore or take for granted. \\n\\n\r\n(Example set on the opening of Ougi Formula Arc)\\n\\n\r\n------------------------------------------------------------------------------------------\\n\r\nTHE MONOGATARI SERIES AS A WHOLE:\\n\\n\r\nBakemonogatari = Monster Story [This is 15 Episodes. For some reason Crunchyroll only has 12 Episodes available for streaming, Ep 13 - 15 end this particular theme]\\n\r\nNisemonogatari = Fakes Story or A Story of Fakes\\n\r\nKizumonogatari = Wound Story, Damaged Goods Story or Deflowered Story\\n\r\nNekomonogatari Kuro = Cat Story Black or The Story of a Black Cat\\n\r\n--------------------------------------------------------------------------------------\\n\r\nMonogatari Series 2nd Season [These were aired together on 2013 as 26 Episodes, Three of them are Recap.]\\n\\n\r\n[As Blue-Rays they're sold separately]\\n\\n\r\nNekomonogatari Shiro = Cat Story White or The Story of a White Cat\\n\r\nKabukimonogatari = Twisted Story or A Story of Twists\\n\r\nOtorimonogatari = Bait Story\\n\r\nOnimonogatari = Demon Story\\n\r\nKoimonogatari = Love Story\\n\\n\r\nHanamonogatari = Flower Story\\n\r\n-----------------------------------------------------------------------------------------\\n\r\nMONOGATARI SERIES FINAL SEASON:\\n\\n\r\nTsukimonogatari = Possess Story\\n\r\nOwarimonogatari = End Story\\n\\n\r\nLike the tittle hints on Owarimonogatari, The story deals with conclusions, A Certain End. A story of end or conclusions\\n\\n\r\nEach of the arcs on this End Story deals with lessons and conclusion with different characters that have come into play throughout the series. Conclusions that come from a different perspective that many of us deal with, have dealt with with the addition of the supernatural element. Things that are often familiar with the masses.\\n\\n\r\nMY CONCLUSION TOWARDS THE SERIES:\\n\r\nNever have i been so impressed with a story like this one or rather stories. Anyone with a high degree of understanding will love this series. A true masterpiece. I can't throw spoilers but give it a go and do so without a chart, This series can't be compared to anything and it will stand on it's on category for years to come. That's the key to understanding \"The Monogatari Series\". \\n\\n\r\nWatch it with no other comparison. After that you will then realize that this series are Elite!.\\n\\n\r\nONLY DOWNSIDE:\\n\r\nOwarimonogatari is composed of three volumes and this anime only has adapted 2 out of 3 volumes. Volume 3 comes later on 2016.\\n\\n\r\n-------------------------------------------------------------------------------------------\\n\\n\r\n[SIDE NOTE]\\n\r\nKoyomimonogatari airs Jan 9th of 2015 Through a App offered through Google Play Store on December 19th of 2015 Japan for now. It's probable that western countries will gain access to it through Crunchyroll. The stories are as follows!\\n\\n\r\n-Koyomi Stone\\n\r\n-Koyomi Flower\\n\r\n-Koyomi Sand\\n\r\n-Koyomi Water\\n\r\n-Koyomi Wind\\n\r\n-Koyomi Tree\\n\r\n-Koyomi Tea\\n\r\n-Koyomi Mountain\\n\r\n-Koyomi Torus\\n\r\n-Koyomi Seed\\n\r\n-Koyomi Nothing\\n\r\n-Koyomi Dead\\n\\n\r\nOwarimonogatari as of now based on the Light Novel that have aired!\\n\\n\r\nVolume 1: [Aired]\\n\r\n-Ougi Formula \\n\r\n-Sodachi Riddle\\n\r\n-Sodachi Lost\\n\\n\r\nVolume 2: [Aired]\\n\r\n-Shinobu Mail\\n\\n\r\n-------------------------------------------------------------------------------------\\n\r\nOwarimonogatari Part Two speculated to be previewed after Koyomimonogatari reaches it's climax!.[ANIME ADAPTATION TBA]\\n\\n\\n\r\nVolume 3: [Pending]\\n\r\n-Mayoi Hell\\n\r\n-Hitagi Rendezvous\\n\r\n-Ougi Dark\\n\\n\r\n-------------------------------------------------------------------------------------\\n\r\nThis title comes after Owarimonogatari and it's still part of Monogatari Series Final Season!.\\n\\n\r\nZoku-Owarimonogatari\\n\r\n-Koyomi Reverse\\n\\n\r\n--------------------------------------------------------------------------------------\\n\r\nMONOGATARI SERIES OFF SEASON [ANIME ADAPTATION TBA]\\n\\n\r\nOrakamonogatari\\n\r\n-Sodachi Fiasco\\n\r\n-Suruga Bonehead\\n\r\n-Tsukihi Undo\\n\\n\r\nWazamonogatari\\n\r\n-Princess Beauty\\n\r\n-Acerola Bon Appétit\\n\r\n-Karen Ogre\\n\r\n-Tsubasa Sleeping\\n\\n\r\n(Wazamonogatari deals with Kiss-Shot Acerola-Orion Heart-Under-Blade, As her former self that is. The story as she once was a human and the identity who granted her vampire name. The story of Shinobu!)\\n\\n\r\n2016 New Tittles [ANIME ADAPTATION TBA]\\n\\n\r\nNademonogatari\\n\r\nMusubimonogatari\\n\\n\r\nOverall 10 / 10\\n\r\nIf you're a monogatari fan, Prepare yourself. The series just got better and radical.\\n",
            "date": "2015-12-20T19:23:00+00:00",
            "helpful_count": 12,
            "mal_id": 206207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316339.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChaoticThinker",
                "username": "ChaoticThinker"
            },
            "url": "https://myanimelist.net/reviews.php?id=206207"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’ve always grown up loving math; I’ve always grown up performing well in math. I’m still unsure if both of these are mutually exclusive or not, but I like to think that some connection exists.\r\nThe fun of mathematics comes from the complexity. Using variables, taking integrals, and memorizing formulae turn the field from crunching numbers into a brain-powered game. Of course, there are certain areas that can be tiresome – I’ve always had trouble with graphs and graphing – but it wouldn’t be math without a difficult derivative or two.\r\nOwarimonogatari may not feature sines andcosines, but it does have math. And symmetry. And intrigue. All of this (and more) come together to equal one of the best entries the Monogatari series has seen so far.\\n\\n\r\nSTORY\\n\\n\r\nOwarimonogatari acts as both a prequel and a sequel. Taking place after some important arcs and before others, this iteration is meant for folks who have seen (most of) the series already. However, while it expects one to know and understand certain events, and that these events are closely (and obviously) tied to everything else, the tales told stand on their own.\\n\\n\r\nAnd they’re wonderful.\\n\\n\r\nThe season is essentially split up into two halves: Sodachi’s arc and Shinobu’s arc. Technically Sodachi’s arc is three separate ones – Ougi’s Formula, Sodachi Riddle, and Sodachi Lost – but they all more or less build upon each other.\\n\\n\r\nOn a surface level, the different tales have their own goals, their own direction, that make them interesting to watch. Ougi Formula goes creepy, using a constrained setting for its foundation and a strange mystery for its backbone. Sodachi Riddle uncovers bits and pieces of Araragi’s past, a past that has largely been ignored up until this point. Sodachi Lost gets extremely real and serious and sad.\\n\\n\r\nShinobu Mail is a longer, fuller arc, and, for that reason, it goes beyond just a singular mood. The introduction of an all-powerful, samurai-armor-wearing demon creates anxiety and tension. Kanbaru arrives to bring comedic relief and sage advice, depending on the circumstances. Shinobu brings both forgiveness and sadness. It’s a bit much to declare this arc as emotional, but the arc certainly makes the audience experience various thoughts and feelings over the course of just six episodes. All the more so since, to reiterate, this tale is meant to be watched after seeing nearly everything else the whole series has to offer.\\n\\n\r\nAnd while it may almost go without saying, the dialogue of Owarimonogatari remains as top-notch as always. The long-winded conversations that rarely dip into tedium. The witty banter between Araragi, Kanbaru, and the rest of the cast. The signature catch phrases and laughs and wordplay. It’s all there once again.\\n\\n\r\nThis level is just the surface, though. Going beyond reveals that Owarimonogatari is just as strong in its execution at even the deepest depths.\\n\\n\r\nSimply breaking the surface lets one discover two important themes in Sodachi’s arc: time and relationships. Diving further reveals that these same themes also exist in Shinobu’s arc, too. This parallelism already demonstrates the focus of Owarimonogatari (and an important motif explained later).\\n\\n\r\nAcross both arcs, time stands as an essential obstacle. Sodachi’s rage festered for years and years. Her brooding prevented her from finding peace and jumpstarted her hatred for Araragi. For her, time does not heal but rather exacerbates. Seishirou’s feelings are a bit more complex, but he, too, had time (400 years to be exact) act as a catalyst for his current mood and actions.\\n\\n\r\nIn this manner, Owarimonogatari argues that time may not necessarily heal all wounds. It heals some but not all. Be it half a decade or half a millennium, something else is needed to make amends. That something is the second theme: relationships.\\n\\n\r\nRelationships are important regardless of context. They can provide happiness, opportunities, and connections that people thrive on. For Owarimonogatari, however, relationships are vital to the culmination and conclusion of the events.\\n\\n\r\nFor example, Sodachi’s entire arc revolves around a mystery motif. It’s not until Araragi talks with Sodachi, reestablishes his relationship with her, that the truth is revealed and their friendship solidifies. Shinobu’s entire arc is the same way. The problem of an onset, immortal demon originates from a previous relationship that went sour back then that she had refused to sweeten until just now.\\n\\n\r\nSo it’s more than just relationships heal wounds and let people move on. It’s that relationships start new beginnings. They unveil characteristics and thoughts of those involved. They give life meaning. As Senjougahara says, no relationship is perfect. That’s fine. Because what matters most is being that special person who can share that special relationship.\\n\\n\r\nBut beyond all of this lays Owarimonogatari’s most amazing triumph.\\n\\n\r\nConsider both arcs. Both are about someone who does not want to rekindle a relationship (Sodachi with Araragi and Shinobu with Seishirou). Both center on a group of four characters (Araragi, Sodachi, Ougi, and Hanakawa, and Araragi, Shinobu, Kanbaru, and Gaen). Both deal with ruined lives (Sodachi slowly dwindling, and Seishirou slowly regaining). Both deal with envy (Sodachi wanted Araragi’s perfect life, and Seishirou wanted Araragi’s place). Both have puzzles that need to be pieced together by all-knowing people (Ougi for Sodachi and Gaen for Shinobu). Both have…\\n\\n\r\n…them visiting important landmarks (Sodachi’s mansion and the hilltop shrine). Both have the main antagonist being “the past” (Sodachi and Seishirou). Both have a character that diffuses tension (Hanekawa and Kanbaru). Both have a small aside with Senjougahara (when she punches Sodachi and when she talks with Araragi over the phone). The list goes on and on.\\n\\n\r\nThis symmetry reveals an astounding revelation: Owarimonogatari is the same tale told twice.\\n\\n\r\nIt’s not just the anime being able to essentially repeat its contents that makes it so grand. It’s how this symmetric presentation reinforces its themes on time and relationships. That is, time is the same for everyone, and relationships are the same for everyone.\\n\\n\r\nAnd that is remarkable.\\n\\n\r\nAnd to top everything off, there are the subtle yet beautiful ways in which each tale ends. Araragi not revealing what was in Sodachi’s letter to him, acting as their own, personal mystery, is so heartwarming and unbelievably fitting. And Shinobu overcoming pride and fear by forgiving her long-lost minion, in about as respectful a manner as she could, is amazing on a bunch of narrative and emotional levels.\\n\\n\r\nThe entire season comes together to be one of the best pair of stories that the series has provided to date.\\n\\n\r\nANIMATION\\n\\n\r\nOwarimonogatari continues its stride with its animation and its art.\\n\\n\r\nStarting with the character designs, the returning cast remain relatively the same minus a few outfit switches or changes based on the outcomes from other parts of the series. For instance, Araragi still wears his metaphorical ahoge, Hanekawa proves that she dyes her hair, and Ononoki dons a bathrobe.\\n\\n\r\nWhere the character designs get quite interesting are with the newcomers. Namely, Ougi, Sodachi, and Seishirou.\\n\\n\r\nOugi takes first place when it comes to the best new design. Her all-black eyes, hidden hands (which are covered by black gloves seen for a brief moment), and pale skin turn her into the creepy and manipulative character that she loves to be.\\n\\n\r\nSodachi’s hair is faded, signaling the stress she has experienced over her life thus far, but it’s her plainness that fits her best. To Araragi, she was forgotten, so having a design that follows this motif is more than perfect.\\n\\n\r\nAs for Seishirou, his strange, red-filled eyes, long ponytail, and smaller stature make him effeminate, blurring the line between friend and foe.\\n\\n\r\nAnimation-wise, the series does not actually have much of it for long periods of time. Lots of speaking while standing or sitting is common, leading to characters hardly moving on-screen. That’s not to say no movement exists because there is animation. And what is given is quite nice. Slow-motion segments, free-flowing hair, and up-close mouths all have top-notch animation, demonstrating the anime’s animating chops.\\n\\n\r\nAnd to be fair, those areas where talking and standing take over are filled with the series’ signature style. Imaginative scenarios, crazy angles, and those all-important head-tilts return to make the show feel at ease alongside its prequels and sequels.\\n\\n\r\nOf course, these descriptions say nothing of the different lights, colors, and perspectives provided. But best of all is how the visuals tie back in with the symmetry of the story. That is, the anime makes heavy use of symmetry and asymmetry to construct not just cool-looking shots but also visuals that convey meaning for the narrative and the cast involved.\\n\\n\r\nIt’s all a treat to behold.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Owarimonogatari is more positive than negative, but, at the minimum, it’s a clear step down from both the story and the art.\\n\\n\r\nThis time around, the cast has to be split up into two categories: those who are not important and those who are. The former camp holds Hanekawa, Kanbaru, and Izuko Gaen. The latter camp holds Sodachi, Ougi, Shinobu, Seishirou, and Araragi. Other characters, like Senjougahara and Episode, while having an impact on the proceedings, are notextremely relevant to the stories at hand.\\n\\n\r\nAt any rate, Hanekawa, Kanbaru, and Gaen are present in the season, but they are characters that do not develop whatsoever. That’s perfectly fine. Hanekawa and Kanbaru serve the role of tension diffusers – Hanekawa leads, Kanbaru protects, and they both have their own sexual asides. They also act as people who can relate to their respective, distressed counterparts. I.e., Hanekawa had trouble at home as Sodachi did, and Kanbaru had romance issues just as Shinobu did. Plus, they have already had their time in the limelight. Twice each.\\n\\n\r\nGaen has technically never had an arc (let alone two) all to herself, but what she does best is showing up, injecting her wisdom, and then disappearing until she is needed once more. Just like all of the other apparition specialists. Meaning, she is excused, too.\\n\\n\r\nThat just leaves the important characters.\\n\\n\r\nSodachi is the first new character this season to be added to the series’ cast. She also takes the title as the best character that Owarimonogatari offers.\\n\\n\r\nHer character unfolds in a complicated manner. First, Sodachi from a couple of years ago is shown. Then it jumps back to the present. Then it goes back five years or so. Then even further back in time. Then back to the present only to head immediately back to the past. Finally, when the end is reached, she looks ahead towards an uncertain yet hopeful future.\\n\\n\r\nThis confusing back-and-forth pattern of character development reflects her as a character: conflicted and scrambled. She was accused by her classmates (and her teacher, the true culprit) of cheating. Her mother passed away unbeknownst to her. The “household” she lived in had abusive parents. In essence, her whole life has been nothing short of unfair.\\n\\n\r\nShe’s a tragic character. Arguably the most tragic that the entire series, let alone Owarimonogatari, has ever seen. Her troubles not only reveal just how good Araragi has it – a nice family, a girlfriend, numerous friends, a college-going future, and so on – but also how good the audience has it. The majority of people have never experienced hardship on the level Sodachi had, causing the audience to appreciate what they have in their own lives.\\n\\n\r\nBut she does more than impart self-reflection. Indeed, her most important character contribution is a subtle one, a forgetful one: going unnoticed. The majority of people are not like Sodachi, but there are people who unfortunately go through similar circumstances. Yet, like Araragi, people are not always aware of someone else’s tragedy. It’s not that they don’t have sympathy; it’s that they just don’t know. So while her character can be pitied, she has hopefully allowed people to think about the situations that others may be going through.\\n\\n\r\nHer tragedy turns her into a person with an unbelievable amount of negative emotions: anger, envy, sadness, and so on. And that leads into probably her only problem as a character – her turnaround is a bit too quick. She goes from despising to reconciling within the span of an evening despite broiling with hate for years on end.\\n\\n\r\nStill, she brings a new perspective on life and on people that is not often thought about. The doors she has had to open in her life have been filled with nothing but goats. But now, as she continues forward, that shiny new car remains on the horizon. Probability demands so.\\n\\n\r\nFrom tragic to creepy, Ougi is quite the strange person even for the series’ standard. Her stand-out trait is her spooky behavior. She invites herself into most of Araragi’s affairs. She invades the personal space of others constantly. And she invents solutions to the mysteries at hand at a pace that seems almost impossible.\\n\\n\r\nOugi also has another defining trait: She acts useless. During some conversations, she will outright say so, calling herself an “unreliable underclassman” (episode one) or declaring “And yours truly, though unworthy…” (episode two). She pretends to be innocent to trick others (most noticeably Araragi) so that she may manipulate them even more than she already does.\\n\\n\r\nAnd just like many of the cast members, she, too, has a signature phrase. A phrase that describes her all-too-well: “I don’t know anything. It’s what you know.” The first sentence calls back to her faux uselessness. (She clearly knows a lot.) The second sentence calls back to her keen interest in others. (She always investigates problems of people.)\\n\\n\r\nAltogether, Ougi becomes a character that forces others to act. In her short time, she did a lot: She had Kanbaru introduce her to Araragi, made Araragi confront his past, and even caused Hanekawa to offer up her chest. The first and the third are arguably minor points, but the middle influences Araragi to an enormous extent. She may not develop as a character, but, without her meddling, almost nothing would have been accomplished.\\n\\n\r\nOugi gets traded in for Gaen in the second arc, and Sodachi gets traded in for Shinobu. Shinobu, however, does not see nearly as much attention as Ougi and Sodachi. She has her cute moments and her intimidating moments, but nothing too grandiose. Except her interaction with Kanbaru. As Araragi describes it, it’s the first time she has ever lost a “battle,” so getting to see the top-tier Kiss-Shot be put in her place (and later on actually showing some human emotion) added another dimension to her character.\\n\\n\r\nSeishirou – the “first minion” to follow Shinobu – is arguably the only weak character in the season. The audience first learned about him through a tale that Shinobu told during a different season in the series, but, in Owarimonogatari, he makes his grand entrance. The problem? He’s not around enough. The anime builds him up as this pivotal character, but he ends up barely being around. Less time means less to learn about him. Less time means fewer interactions between him and other characters. Less time means less of an impact on the overall story.\\n\\n\r\nLast but not least and rivaling Sodachi’s character is none other than Araragi. Up to this point in the whole series, Araragi has not had a whole lot of focus. Understandably, it’s been on the other girls in the harem – Senjougahara, Hachikuji, and so on – and he has been there doing what he can to support them. But the stories have never reallybeen about him. Until now.\\n\\n\r\nThis season sees Araragi earning quite a bit of attention character-wise. In Sodachi’s arc, his past is revealed, the audience learning more about where he started, how he got there, and what his brand of justice meant to him. In Shinobu’s arc, Araragi learns where he stands in relation to those he cares about: Kanbaru regards him as someone she would do anything for, Shinobu regards him as her (currently) only companion, and so on.\\n\\n\r\nIn short, Araragi comes to understand more about himself. He comes to understand who he is as a person today, and who he wants to be tomorrow. He comes to understand how fortunate he is. He comes to understand that he’s a different “special person” to those he cares for.\\n\\n\r\nHe puts it best right near the end, tying everything back to the themes of the anime in an asymmetric manner: relationships don’t always bring joy. But that’s what time is for. While there may not be an endless supply, time allows people to take chances, start anew, and perhaps, just maybe, find that happiness.\\n\\n\r\nSo while the cast may not be amazing, they are certainly more than purposeful.\\n\\n\r\nSOUND\\n\\n\r\nVoice acting takes the crown in the sound department with ease. Returning characters have their respective voice actors and voice actresses reprising their roles. Hiroshi Kamiya as Araragi and Miyuki Sawashiro as Kanbaru bring their normalcy and silliness in droves. Kaori Mizuhashi as Ougi does a nice job as well, elevating the girl’s creepiness through a calm and conniving voice.\\n\\n\r\nBut it’s Marina Inoue as Sodachi who steals the show. Her performance as the grief-stricken, math-loving student, with inflections ranging from depravity to simple acceptance, made the character more than the sum of her parts.\\n\\n\r\nWhile the rest of the music does not top the voice acting, they still hold their own. Ougi’s OP takes on quite the techno tone; a different vibe from her usual self. Sodachi’s OP has a mysterious and cool composition. (Her other OP was not used during the televised airing.) Shinobu’s OP goes cultural, adopting a poetic feel aided by its shortened length.\\n\\n\r\nBut, similar to Ms. Inoue as Sodachi, the ending track wins hands down. From the gentle choir to the wonderful composition to the ending optimism, the whole ED comes together in resounding fashion.\\n\\n\r\nThe remainder of the original soundtrack does not reach the same level as the OPs and the ED, but they do hit that atmospheric mark. In particular, the frantic, tension-fueling track – played when Araragi and Sodachi’s class are quarreling about the culprit and when Sodachi meets Araragi in the present – and Kanbaru’s piece – with its high energy and silly sounds – make their respective moments that much stronger.\\n\\n\r\nAnd to top it all off, Owarimonogatari plays with its sound on occasion. Special sound-effects during certain sections are used, like when Ononoki’s foot on Araragi’s face made squishy noises (matching the absurdity of the action) and Gaen’s explanation sounded like an old-timey film (matching the conversation being about the distant past).\\n\\n\r\nENJOYMENT\\n\\n\r\nThe first half of the season – i.e., Sodachi’s arc – was easily my favorite. Stellar moments such as Ougi laughing, Senjougahara punching Sodachi, and Hanekawa giving perhaps the definitive “I can’t believe this person right now…” face. That’s listing just a few of my favorite scenes. Sodachi alone had stellar moments too: her tirade, her unable to pronounce Araragi’s name, and her following through on (part) of her promise got reactions out of me.\\n\\n\r\nThe second half – i.e., Shinobu’s arc – was not as strong, but that’s not saying a whole lot. Nearly all of Kanbaru’s antics, from her “Okeydokey” to her background perverseness, had me smiling, laughing, or both. Senjougahara’s part, while small once again, also managed to be a highlight. Araragi’s quick reference to The Shawshank Redemptionin episode ten had me cheering.\\n\\n\r\nHowever, if I am being honest, there are negatives. I did not much care for Seishirou and his plight no matter how bittersweet Shinobu’s forgiving happened to be. Also, despite me liking both Ougi and Gaen, I am (still) not a fan of seemingly infallible characters. Yes, that’s how they are designed and used, but when a character never does anything remotely wrong or a character is always right, I simply get peeved. They admittedly have slipups, but they are inconsequential or so tiny that they barely register as such.\\n\\n\r\nStill, the anime was fun and dramatic and entertaining – which is pretty much all I could ask it to be.\\n\\n\r\nOwarimonogatari nails almost everything. The story is meaningful, the art is slick, the characters are purposeful, the music is passionate, and the entertainment is high. Simply put, this entry in the series graphs well above average.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, themes on time and relationships, a symmetric presentation, and beautiful moments create a wonderful narrative through and through\\n\\n\r\nAnimation: Great, nice character designs and animation with an awesome artistic direction\\n\\n\r\nCharacters: Good, while Seishirou ends up as a weak character, Sodachi, Araragi, and the rest of the cast make up for many of his shortcomings\\n\\n\r\nSound: Great, nice OPs, awesome ED, strong VA performances, an atmospheric OST, and nifty design choices\\n\\n\r\nEnjoyment: Good, stellar, funny, and interesting, with only a couple of negatives to speak of\\n\\n\r\nFinal Score: 9/10",
            "date": "2016-09-21T19:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 229769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=229769"
        },
        {
            "content": "Love it, hate it, indifferent to it, or once-loved-then-hated-now-extremely indifferent to it, Owarimonogatari (literally 'end story', though the series doesn't conclude here) will most likely meet your expectations of the long-running light novel adaptation. For me, that means occasionally witty dialogue shoehorned with ecchi, traces of pedophilia, and genuinely interesting ideas muffled by execution. And yup, it's got all three. NisiOisiN really knows how to keep his writing consistent! \r\nSee, the joke there was that Monogatari is as inconsistent as can be, and widely varies in quality from arc to arc. Got it? No? I'll wait.\r\n…OK? Let's move on.\r\nWhile technically a four-arc series, there arethree distinct arcs in this season's offerings: Ougi Formula, the one-hour premiere, Sodachi Riddle/Lost, and Shinobu Mail. Part of what makes this season strange to review is that each and every one can be summarized with a single sentence, but I am generous enough to provide you with multiple sentences. I will do my best to go over them all without spoiling anything, because Monogatari is serious business. \\n\\n\r\nOugi Formula is the series' standard fare. Not only is it a locked room mystery, it's forty-some minutes of dialogue that's not exactly justified by its contents. Were there no philosophical questions and characteristically abstract classrooms, it could be concluded in ten minutes, or even a heavy twenty. Instead, you will spend roughly five percent of your day watching Ougi and Araragi solve a seemingly unimportant puzzle. You almost reach a point where you think all this time spent will be inconsequential, yet that is saved by a graceful transition into the second arc. \\n\\n\r\nThus ensues Sodachi Lost and its conjoined twin, Sodachi Riddle, which go above and beyond the series' standard fare. It's maybe the most straightforward, mature story the Monogatari series has given us, which concerns a classmate's displacement and the unknown circumstances of her family. Marina Inoue's fantastic (or shall I say phantasmic) portrayal of Oikura may send a chill or two down your spine, and there's no lack of interrogation or detective work on Araragi's part. Unlike the previous arc, there is a feeling of consequence to every word muttered or yelled, which helps portray the shattered mental state of Oikura rather sympathetically. It's an approach most artists wouldn't dare to take, so I wholeheartedly appreciate the effort and delicacy put into handling it. There are still the rough points along the way, like a few boob jokes and some off-topic discussion, yet they're minor enough to be promptly excusable. The whole thing is best summed up by the words of the show's official subtitles (which are garbage that you shouldn't use): \"I'm terribly sorry. I had underestimated you, to be honest.\"\\n\\n\r\nTo round it all out, Shinobu Mail is well below the series' standard fare. After how much I was impressed by the Sodachi stories, I was hoping for the best. All of that hope left my body after watching the first episode of Shinobu Mail. There are some parallels to be drawn to your typical superhero movies—there's a big bad which everyone works together to defeat, yet nobody thinks they'll be able to. It wouldn't be such a major issue if any of the major action was shown, WHICH IT IS NOT. NOTHING IS SACRED. We instead follow Araragi and a piggybacking Kanbaru, who continues her trend of making annoying sexual jokes and innuendos toward him wherever possible. It's like being alone in a room with a 12-year-old, which is something that Araragi would probably like. Later on is a twenty-minute infodump which concludes with Kanbaru and Shinobu sharing an unnecessary and crude sexual pose, a cake that is topped by the most anticlimactic of endings. I don't want to ruin that, but it's definitely an open-ended conclusion you've seen before. \\n\\n\r\nI'm not going to say much about the directing, other than that I think it uses artistic value as a crutch. There is no attempt made to portray things as-is, so everything is abstract. Maybe the director and I just value different things.\\n\\n\r\nUnless you're telling an overarching story, variety is the spice of life. Then it gets questionable. Unlike other shows in the same supernatural episodic vein (Mushishi, Cardcaptor Sakura), there's no consistent tone or guideline for the Monogatari series' plot. It's a bit all over the place. Maybe you, unlike me, are a fan of these random variables, and therefore may like Owarimonogatari a lot more than I did. If you do like this more than I did, good job. If you dislike this more than I did, good job. Having an opinion is the first step, and you are fantastic for that. Do not let anyone tell you otherwise. \\n\\n\r\nUnless you're using the official subtitles. Then you're wrong.",
            "date": "2015-12-22T07:57:00+00:00",
            "helpful_count": 10,
            "mal_id": 206407,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/vegetablespirit",
                "username": "vegetablespirit"
            },
            "url": "https://myanimelist.net/reviews.php?id=206407"
        },
        {
            "content": "Owarimonogatari 1/Formula Ougi/ Sodachi Riddle/ Sodachi Lost:\r\nSurreal.\r\nThe premise is intelligent and greedy, because it presents a new character at the time of 45 seconds — even with the arc coming a bit before the start of the Second Season.\r\nThe run begins, someone is shown and someone that has already been shown must be presented as a beginner now. Really interesting, the mysterious mood, the subtle air, it’s all part of a little mystery’s set that hasn’t even been mentioned before and that it's now featured — or so it has seemed.\r\nThe insertion of said Ougi, the memory of said Oikura. It’s mentioned like a dichotomy,or rather, “convergence”, even if both of them havn’t ever met, they had a relationship in common, the said protagonist.\\n\\n\r\nHowever, in a courageous way, Oikura is inserted in the story, having, until then, the weapons to be a character of weight, which she doesn’t only accomplishes to become one in the end, with the vague idea of a return (which has already been confirmed), as she have a very solid representation in the protagonist.\\n\\n\r\nThe pace isn’t slow, isn’t weak, isn’t without desire. It’s intense, gradual and even ominous.\\n\\n\r\nThe said formula it’s a practical lecture of human relationship, the majority rule, the pure representation of mankind’s ugliness as an inventor.\\n\\n\r\nThe said riddle, as insinuated, it’s a solid question, the warning in the end saying to check the beginning again, the pure representation of human forgetfulness, of its ugliness as a defect.\\n\\n\r\nThe said lost one, the mystery, the engaged, the prideful promise of a closing to the whole riddle, to the whole formula; it’s indeed a truth about human frustration.\\n\\n\r\nIn the end, Owarimonogatari 1 it’s a promise of mystery, which only tends to grow and become better, where the end it’s satisfactory and surreal, where the three works as one and three at the same time, therefore, it’s great (9.0 in a whole).\\n\\n\r\n------------------------------------------------------------------\\n\\n\r\nOwarimonogatari 2/Shinobu Mail:\\n\\n\r\nEnd, the closing of said arc, what’s there to say about it? What can really be said about it?\\n\r\nIn a cruel way, the word “boring” could be used in a brutal and even condescending way, but, this would be said just envisioning the usurpation of the arc’s focus to one character in particular, and that would be unjust.\\n\\n\r\nBeing that way, no, because it is that way, it’s necessary to quote the divergences and convergences until the end — or rather, from the start.\\n\r\nBeginning with a suggestive presentation of the plot, the tale, passing through a roller coaster of quality, goes from the momentary fun to the cumulus of tedium, but not in a sequential order, of course.\\n\r\nWith the apparition of a new character, the interesting Seishirou, the first oddity-slayer, the first servant, the first love, maybe? The relationship between he and the said iron-blooded, hot-blooded and cold-blooded vampire, Kiss-shot, it’s indeed intriguing. In certain point, it’s understood that the exchange of feelings between the two it’s almost the opposite. In the end, their relationship it’s like any other, of any kind, therefore, it’s something good.\\n\\n\r\nThe closing events, like the duel, the devouring, the consolation, everything fulfill a emptiness of almost three 1/5 of the arc, which occults it with a speech that’s even irritating.\\n\\n\r\nEven so, the end, the said summary, the pay-off it’s really beautiful, therefore, it’s something good. The connected dots and the ones that are left at the end of the protagonist’s report to the coadjuvant Ougi are really well-made; more so with the collaboration of the “chat” between said protagonist and the said coadjuvant Yotsugi.\\n\\n\r\nIn the end, Owarimonogatari 2, Shinobu Mail, it’s a well-presented arc that screw its way to its beautiful end, which leaves a great tip and close other ones. We can catalog everything as a whole as being great (8.5-9), but, the bad use of explanations in the filling of this cake leaves it tasteless, therefore, good (7.5-8.0 for the end).\\n\\n\r\n------------------------------------------------------------------\\n\\n\r\nOwarimonogatari/As an anime altogether.\\n\\n\r\nGood adaptation, great display of scenes and metaphors from the book in form of frames, frameworks and even the ending.\\n\\n\r\nIf both parts are to be divided, like in the books, it would be a 9 and a 7 in sequence, but, as they’re put together, I risk myself at giving it a 9.\\n\\n\r\nThere’s no meaning in despise the first part for the slouch of the second one.",
            "date": "2015-12-22T19:28:00+00:00",
            "helpful_count": 10,
            "mal_id": 206487,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3930997.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MatheusSantos",
                "username": "MatheusSantos"
            },
            "url": "https://myanimelist.net/reviews.php?id=206487"
        },
        {
            "content": "Owarimonogatari is the telling of two stories. The first one is about Oikura Sodachi, which is a long lost friend of Koyomi Araragi; the other is about Shinobu Oshino. \r\nThe Sodachi arc of Owarimonogatari is one of the top 2 best arcs in the series. For one, extremely surprisingly, it does not feature an aberration. The Sodachi arc is a straight drama; one giant emotional rollercoaster. I don’t even know exactly what to say about it other than it tugged at my heartstrings like very few other anime have before. The plot is the best of any arc and is developed mastefully. The Sodachi arcplot is handled and executed like a tragic mystery, and resolved elegantly. \\n\\n\r\nThe Sodachi arc features Ougi Oshino, who we have met before, yet Koyomi hasn’t (chronologically speaking) and Tsubasa Hanekawa; these two being the smartest characters in the series. This is crucial to the plot since it cannot advance, especially as a mystery arc, without the intellect of both of these characters. The mystery is resolved by them two, leaving Koyomi clueless in the dust, but he serves as the emotional connection between the plot and Oikura. Every character is cast perfectly in this manner creating the illusion they were created solely for this role. \\n\\n\r\nThe Sodachi arc is about childhood trauma, trust, interpersonal responsibility and expectations, tragedy, and coming to peace with reality while striving for happiness. The Sodachi arc is extremely deep and serious and delves with mature topics. It features this hyperrealism that hits home very hard. The events that took place in the Sodachi arc happen, they happen all the time. Both the tragedy and regularity of this plot paired with the Monogatari Series style makes it truly a unique masterpiece. \\n\\n\r\nThe only thing I could compare this arc to would be Nekomonogatari: Shiro. They’re so completely different that I cannot distinguish the the two in quality. I can very easily and confidently say that these two arcs are by far the best two of the series. They dwarf everything else in terms of purpose, conviction, and content. Arcs like these are the reason I watch the Monogatari series and anime in general. \\n\\n\r\nThe Shinobu Mail arc of Owarimonogatari is a much lower quality arc. It is a continuation of the previous Shinobu arc. I have very little to say about this one. I’m guessing it’s because of how underwhelmed I am after watching the previous arc. Aberration arrives, characters deal with it with help of Koyomi Araragi, character arc resolved. It’s your standard Monogatari Series arc. At this point, the non-standard arcs have become more common than arcs like this, so it definitely feels underwhelming. It’s like we’re back in Bakemonogatari. This is not a bad thing, it’s just that the arc before was so amazing and different that you kind of expect the only other arc in the same series to be similar. \\n\\n\r\nTaking an average of these two arcs, I would simply say what I’ve said in every other Monogatari Series review; that is, ‘it’s just more Monogatari.’ But this series is so much more than that having the Sodachi arc in there. Owarimonogatari is a must watch anime, for everyone. Even if you’re reading this without watching any Monogatari before, you can watch the Sodachi arc without any context and it’s still incredible.",
            "date": "2019-04-30T13:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 307483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4169795.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Falco2424",
                "username": "Falco2424"
            },
            "url": "https://myanimelist.net/reviews.php?id=307483"
        },
        {
            "content": "Here we are with my fanboy review of another installment of the monogatari series. This series definitely stands out from heaps of other anime with very few series being like it. At first people might go into this series thinking its supposed to be something super artsy with hidden messages and metaphors everywhere but honestly all it does is take a fairly generic story and take a new approach with it. People criticize this series for its lack of character development and plot. A lot of these people  watched 3 episodes and quit. Character development in this series is actually very interesting. The maincharacter Araragi actually doesn't really go through any character development this is true. However he is not a one note character that is stagnant throughout the series. He changes based of the main character of the arc to be able to play off of them better. This is what the real selling point of this series is. Everything including even the environment changes in order to fit the heroine of every arch. \\n\r\nFinally the actual review part about this installment specifically. The main heroin's of these arch's were unfortunately not really as interesting as in some of the other installments. They still have enough support from araragi and the environment and other supporting characters to make this an extremely enjoyable series but its not as interesting as the arch's about senjougahara and hanekawa. \\n\r\nAs for the plot I also found this to be weaker than in the other installments. Each arch has their own separate plot that doesn't necessarily fall into any chronological order however they all do connect in some way as you see in the last arch. The first arch was an Araragi backstory which is instantly made more boring because it's about Araragi. There is a heroine that is eventually introduced and she is a tsundere meaning she is instantly overshadowed by senjougahara and she actually ends up being one of my least favorite heroines. \\n\r\nThere is oshino's niece who follows Araragi around the whole season but once again her interactions simply weren't as interesting as the other characters.\\n\r\nIn the final arch kanbaru comes in to save us by being one of the best characters in the series meaning Araragi can play off of her extremely well. Also we see some characters that we didn't see all that much of before but they don't really have that much dialogue that isn't exposition so its hard to judge them as interesting or not interesting characters. \\n\r\nThis installment for me is definitely the worst one. However having the smallest golden bathtub amongst your neighbors isn't something to be disappointed in and if you liked the other installments you will definitely like this one. \\n\r\nLastly art and sound is exactly as you would expect for this series however the first arch was definitely grayer than anything else in the series mostly due to it being about the past and also somewhat grim.",
            "date": "2015-12-20T11:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 206143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2203125.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hoeze",
                "username": "hoeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=206143"
        },
        {
            "content": "Now this installment of the Monogatari series was fairly odd, since it tried to incorporate new characters as well as one old character that we don't know too much about. The show is split up into two stories, both being six episodes long. Although both stories are under the same title (Owarimonogarati) they don't really have anything to do with each other. \r\nFIRST STORY\r\nFor the first story we are thrown into a very long first episode, you're pretty much watching a movie so make sure you're comfortable. The episode is pretty slow considering it takes place in one room for the entire time, but theytell a a story about a girl who mysteriously stopped coming to school. Then after that episode the following five are left to find her and her reason for ditching school. This story is pretty dark and I did enjoy it a lot, but the way they told it was slow. They made every little detail drastic (which is expected from this series), but the details they were talking about weren't too interesting and they dragged scenes out for quite some time. Over all the first story was nice, but it may lose your interest if you aren't interested or if you don't follow along.\\n\\n\r\nSECOND STORY\\n\r\nNow the second story started off with a huge bang, and I thought that this might finally be a interesting story, maybe on par with Nekomonogatari. Although it not being as nice as Neko, it still was a nice addition to the series. There are a couple of episodes though that are a little slow, but those episodes are to explain the situation at hand, and the story they tell is nice. There aren't too many negatives to this one besides maybe a lot of narrative to a story that we had no idea about until now.\\n\\n\r\nFinal notes about this show, it was good and all but I surely do miss the story told by ongoing problems that the characters have themselves, as in spirits ruining their lives pretty much. Hopefully we'll get more of that.\\n\\n\r\nPROS\\n\r\nNice addition, good and interesting stories, Some good humor thrown in as well\\n\\n\r\nCONS\\n\r\nSlow, may lose interest, some dragged scenes",
            "date": "2015-12-23T20:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 206617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3763225.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShadowBunny",
                "username": "ShadowBunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=206617"
        },
        {
            "content": "Many people who gave this monogatari series or owarimonogatari a lower than average rating, let me say this. The meaning of \"owari\" or the prefix name of this monogatari means the resolution or the end of something. By this sense, many of the monogatari that we saw with its prefix name tells you, and predetermine what you are about to see, within those monogatari series that will entails as its main theme or topic of the anime's discussion or introductory standpoints, until it meets it resolution or the end of that specific monogatari series. And if you notice something about this owarimonogatari series. Both shinobu'sproblem and Araragi problem are resolved when the story meet its ending or the last episode of the owarimonogatari. For Araragi it's the realization or understanding about his forgotten past. In which later helps him to deal with his contemporary problem with Oikura Sodachi (not spoiling, it's what he planned to do when she returned and was exposed in episode 1). \\n\\n\r\nIs it out of context of the story? No. Is it not related to the main arc? No. Is it meaningless to the development of the story? No, liked i said before. It helps with Araragi's understandings to unravel and resolve his past problem with the way he does or thinks things logically, to his contemporary time's problems with Oikura Sodachi. \\n\\n\r\nA filler episode tend to have no meaning to further the progression of a story and holds no relevance towards the goal of achieving it. Conversely, the not really a  filler or rather the detective game that Ougi tries to resolve or rather helps Araragi to resolve it, are just a style of the author's story telling where you, the audience can think and theorize along the points that were given visually or verbally through its dialogue and visuals, about the answer or the act of using deduction by Ougi to further the understandings related to the happenings at the current topic of discussion or whether or not. With your guess or theory is being right or wrong at Ougi's deduction about the case of rationalism in human's actions and causation of it. That's the whole point of a detective game in Owarimonogatari or deducing points or rationalizing the reason for each character's actions with its possibilities in mind. By this sense, it was an extremely a well done job for Nisio Isin (the author) to organized and formalize these argumentative ways of deduction and rationalizing assumptions in this monogatari series. Incidentally, in some cases, Ougi ask Araragi to give an ending statement on the very near end of the episodes to shows the end of the deduction in theorizing Oikura Sodachi's reasons for her particular actions. If you go to law school or study philosophy or any argument related subject then you'll get how it's done. \\n\\n\r\nMy enjoyment for this is 9, the sound is 9 (Oikura Sodachi voice acting was top notched lmao) with a fitted OST for a specific scene or talks in the anime, while the story is a subjective matter whether you like this kind of story with its premise given in the prefix of the \"-monogatari\" while ending the show with the conclusion of how the prefix it, is exactly what it's. But i'll give it a 9 since I enjoy it hella lot. And i like how they make the random text that usually pops up sporadically alot more noticeable and easy to read thanks to the cool and slightly bit slow transition into those random texts, so you have enough time to read all of them or possibly pauses it. Despite the shorter amount of dialogue for this. There are plentiful of westerner's references like \"monty hall\" (and some other ones) and uses of english words like, \"field work\", \" Do your best\" etc. And some indication of the fallacy that the character is committing like the ,\"red herring\" that was mentioned by either Ougi or Araragi in a certain Episode. The cutted in short dialogue did a hell lot of job for the audience to follow onto the story and understanding the happenings much easier than the previous monogatari series. Plus, their ways of smooth talking through the same topic or premise over and over again, while adding new info in over the extended period of their dialogue is pretty interesting as well. It's kinda clever to see this around. Nevertheless my overall is a 9, It's the best monogatari series so far in my subjective opinion.",
            "date": "2016-03-01T22:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 212076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=212076"
        },
        {
            "content": "I was highly disappointed with Owarimonogatari. In my opinion it was a major step down compared to the rest of the series/stories. I thought if I gave it more time that maybe there would be a better chance of me liking it and changing my rating, however to my disappointment it did just the opposite. \r\nTo begin, with the story, there were so many things that could have been done to make the show better and actually worth watching. The best example I will give would be having a huge cut of the dialogue, reflecting on the past, flashbacks, and obviously talking. I felt likeit was just filler, in fact I will call it that. Next I didn't like the final story, \"Shinobu mail.\" There were way too many episodes during the final arc of just talking and reflecting on the past (while uncommon in this series) it made it difficult for me to enjoy.In addition to that the lack of action and engagement between characters (that were not talk related) made things even worst. \\n\\n\r\nI felt like I was being teased through the majority of the final arc. It was like the director was telling me \"here is a little bit of awesome action now we are going to give you some more talking.\" Another thing that bothered me immensely about this arc was that the information and things talked about between Gaen, Kanbaru, Shinobu, and Koyomi. By now we should all know that Araragi is stupid. Just about everything Gaen was saying to him didn't matter nor did it better help him to understand completely what was going on during the shinobu arc. It literally took is underclassman (Kanbaru) to explain even the simplest things to him (even Shinobu's feelings.) I would have really liked to see more psychical action and drama to keep me, the viewer interested and engaged. Compared to the rest of the series this one is a major step down both story and plot related-wise.\\n\\n\r\nI wanted to see more surprising revelations like in the other stories in the series. However, for Owarimonogatari to start off so interesting and mysterious, then end with little sense of accomplishment was just utterly disappointing especially since the last arc was Shinobu related. \\n\\n\r\nThe art style in Owarimonogatari didn't really change comparing it to the rest of the series. It still had that unique Shaft animation style that most of us have grown to love and cherish. I liked the little things that animators had added. For example there were a few western themes or styles for example, one part in I believe \"Sodachi Riddle\" had a western cartoon theme (Maybe powerpuff girl) where Ougi was on a sports car.\\n\\n\r\nThe soundtrack and voice acting was still pretty good. One thing that stood out most to me was the outro song of this series. Especially since after the first stories were done the character on the little train thing changed to Shinobu who is one of my favorite characters on the show. Overall I felt disappointed with Owarimonogatari. I felt that most of it wasn't really worth watching. \\n\\n\r\nFinal thoughts, if you have watched the entire series, and are just starting Owarimonogatari don't have your expectations up to high.\\n",
            "date": "2016-12-24T05:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 236342,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=236342"
        },
        {
            "content": "This series is beginning to wear on me. Bakemonogatari, with all its hints of a rich, expansive world of seemingly unrelated yet subtly interconnected occult stories, showed a great deal of promise. Yet, as things wind down toward a conclusion, the high feeling I had at the resolution to that initial story is being slowly sapped away from me.\r\nOwarimonogatari certainly has much to offer visually, with a few key moments demonstrating how Shaft's techniques have been refined over the years. The first episode in particular is perhaps even more visually interesting and engagingly written than anything in Bakemonogatari, but unfortunately that creative drive seems tohave died down by around the middle of this run. That lessening of this season's visual flair certainly does not help the increasingly bloated dialogue.\\n\\n\r\nIt may seem the height of redundancy to describe a dialogue-driven series like Monogatari as being too wordy, but that is precisely the problem with many of Owari's scenes. Even characters with the mystique of Gaen Izuko cannot help but fail to carry an entire episode and a half of rambling, one-sided exposition that still manages to end without having made its major point in a convincing fashion. A particular low point for the whole of Monogatari occurs when Shinobu and Kanbaru manage to have one of the longest-seeming conversations in the series in about six to seven minutes of circulating illogic. \\n\\n\r\nWhile it is still definitively Monogatari, retaining many of the humorous character interactions of its predecessors, Owari gives the distinct feeling of spinning the series' wheels rather than bringing in new and interesting ideas, or building to a conclusive climax. Yet again, another girl appears to become hopelessly in love with Araragi for no good reason. Yet again, we're treated to a professional apparition hunter explaining to our main characters exactly how our current circumstances arose and how to solve them. Etc. Etc.\\n\\n\r\nI worry that even the charm of Bakemonogatari will eventually be lost with the realization that its characters are unable to carry such a character-driven story for this long. Poor Araragi looks more witless and indecisive than ever, our formerly great heroine Senjougahara has nothing particularly interesting to say even in her brief time on screen, and Hanekawa's supposed awakening at the end of the Tsubasa Tiger arc is significantly cheapened by the fact that she acts about the same here as she always has before.\\n\\n\r\nMore than anything, I hope that the next major anime adaptation will finish off Monogatari in at least a somewhat stylish fashion. Studio Shaft has much to offer the anime industry, and I would hate to see that potential squandered milking the sore udders of this particular cash cow. So please, let this overwrought cast of characters fret its final hour upon the stage, and then be heard no more.",
            "date": "2016-11-19T19:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 234031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5609233.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Laputan_Machine",
                "username": "Laputan_Machine"
            },
            "url": "https://myanimelist.net/reviews.php?id=234031"
        },
        {
            "content": "In general, \"The Cycle of Histories\" is not a title for everyone, but it has its own zest. Before you look at the \"Owarimonogatari\", you need to look at the previous 6 stories, otherwise there will be no point in understanding the whole essence of this work. The \"owarimonogatari\" consists of 12 episodes, of which 1 is a hourly spell, the next 5 are sort of as flow from it, telling about Ougi Oshino and are more or less a separate story. But the last six are already full-fledged stories, by the way the first 6 series occur after the actions of the second 6series. The first 6 episodes (some mix of detective and mysticism) are very dull and do not say that this is a cool start to the season, the second part of it is more interesting, here you have more action, there are old characters and a very nice ending. What pleased, this is a small amount of fan service. Was the season successful? The answer, yes was a success. Enjoy your viewing.",
            "date": "2018-04-07T11:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 277255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6631073.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Aynu5h",
                "username": "Aynu5h"
            },
            "url": "https://myanimelist.net/reviews.php?id=277255"
        },
        {
            "content": "::Alright here's a quick summing up of my thoughts. Consider it a short review. No need to waste your time with long-ass pretentious writing that doesnt cut to the chase::\r\nSo I just saw Owarimonogatari. And it was quite the fun time. The writing is just as impeccable, and it goes without saying that the franchise still is able to maintain my undivided attention despite 65 episodes of conversations stretched across several cours. \r\nOugi Oshino proves to be a surprisingly interesting character. Back when I first started Bakemonogatari and I saw the front cover for Owarimonogatari, I thought Ougi would just be another member of Koyomi'sharem, who would essentially be \"the Weird and Quirky one\". Ougi is a surprisingly intimidating character for someone who looks so unassuming (for lack of a better word). Her (or His) words cut pretty deep, and everything Ougi says has this ominous undertone that I find unsettling. To say any more would be to cheapen or spoil the experience, so sit and watch as she (or he) talks your ear off About things you'd never normally find this interesting (as is common practice in Monogatari).\\n\\n\r\nThe other standout character this time around is Sodachi Oikura, a childhood \"friend\" of Araragi who, unlike all the other girls, hates him with a passion (talk about a departure!). Her short time with the cast has proven to be quite powerful, and her presence felt just as strong as any of the other cast members (as Ougi would likely call them). Sodachi is easily my favorite character in this particular title of the franchise. Not only is she not involved with aberrations, but also is a spiteful and hateful ball of depression and resentment. Her connection to Araragi's past means she's very important to his development as a person, and is even a catalyst for how Araragi became the man he is. Sodachi's seiyu does a fantastic job at portraying her to be snobbish and unforgiving. She's quite the hottie to boot.\\n\\n\r\nThe arc called Shinobu Mail takes up the second half and is told by Araragi as a flashback to what he was up to while Hanekawa dealt with a rather troublesome Tiger in the Tsubasa Tiger arc. I mostly consider this arc to be a follow-up to Shinobu Time, and what happens in Shinobu Mail is pretty relevant to a lot of the strange occurrences in Araragi's hometown, which i was very satisfied to see. Needless to say, it began about as engaging as the rest of Monogatari. The renewed focus on Shinobu was very nice seeing as I really like her character, and Kanbaru being around was also really nice to see, because she's also a big favorite of mine. It answered a lot of questions, and yet, despite being a part of Owarimonogatari, Shinobu Mail feels more at home when compared to Monogatari Series Second Season. Nonetheless, for some inexplicable reason, this arc felt a little less engaging than usual, as it went on. The likelihood that this is my fault is pretty high, considering I was getting pretty tired by the end of it. Regardless, I still enjoyed it immensely.\\n\\n\r\nI give Owarimonogatari a 9 out 10\\n\\n\r\nOh yeah, as usual, the show looks amazing and distinct, and the music is pretty great, blah blah blah. It's monogatari, what else would you expect?",
            "date": "2017-01-08T03:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 237762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5336817.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FalseShepherd13",
                "username": "FalseShepherd13"
            },
            "url": "https://myanimelist.net/reviews.php?id=237762"
        },
        {
            "content": "Owarimonogatari is yet another installment in the adaptation of the Monogatari LN series. This follows 3 stories, two of which focus on one character exclusively and resolve in a way that's both satisfactory and at the same time, kind of disappointing. The VA's of the focal female characters are doing their own openings with exception given (yet again) to Maaya Sakamoto. Decent Black strikes the nerves a funny bit the first few listens, but it soon becomes catchy and you find yourself obsessively looking it up on youtube. Mathemagics on the other hand, has a rather James Bond-esque feel to it that works really wellwith the overall theme of the second story. \\n\\n\r\nThe series is short at 12 episodes, but thankfully does a good job of fleshing out its characters, finalizing its plots, and giving an overall impression of quality. The negative points are more relevant to the one-off characters (Oikura is around for the span of maybe 2 episodes in total appearance time and the Oddity-Slayer does little more than act like a spoiled brat) in that for Monogatari, they're kind of one-dimensional. Oikura seems defined by her one characteristic of \"I hate Araragi\" (not to take anything away from her character as a whole, because there is a character outside of that one quality) while OS is sort of... There. The latter doesn't do much aside provide a minor inconvenience for everyone until Shinobu shows up and tells him how she really feels (and by then, it's kind of an after-thought). \\n\\n\r\nOugi is prominent throughout. Even in the stuff that doesn't exclusively include her, you know she's around, lurking in the shadows and watching things unfold. If not, she's being told the story and somehow has the answer to the questions that aren't asked. Her role in all this was spoiled for me by the LN people, so if you haven't read them, don't ask! Just enjoy the mystery. \\n\\n\r\nAll in all, Owarimonogatari is a Monogatari season through and through, the show has been stumbling a bit since Second Season, too. If this is a sign of things to come, I'm confident that we're on the right track!",
            "date": "2016-01-03T11:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 207658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4317493.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SentiOnikawa",
                "username": "SentiOnikawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=207658"
        },
        {
            "content": "It is another monogatari title. Meaning you'll see a lot of characters that look at you with their head tilted, abstract backgrounds resembling post-modern art, and it'll once again involve Araragi Koyemi plus some of the characters you've seen in the past.\r\nNow... my feeling of the anime were, in the end positive. Detailed breakdown is below.\r\nImpression/details in no particular order.\r\nThe overall story is fairly weak for a monogatari series, and feels very drawn out. The first story ark in monogatari has a very strange choice of a subject that is very unusual for monogatari series, and felt out of place. The character of the firstarc (around which the mystery was centered) felt like a character borrowed from some different series.\\n\\n\r\nThere are many situations where prolonged monologues and dialogues feel a bit too drawn out, even for monogatari.\\n\\n\r\nI'm also not exactly sure why this anime is so obsessed with school desks. In almost every abstract background this anime uses, you'll see a large number number of school desks moving around, being repositioned, displayed from different angles and so on. Monogatari uses repeated/patterned art/episodes a lot, but this is pretty much the first monogatari season where I started noticing school desk reuse in the scene.\\n\\n\r\nOverall, my impression of owarimonogatari would've been negative, BUT.\\n\\n\r\nFirst, the series had opening song (\"decent black\") in first episodes which I greatly enjoyed.\\n\\n\r\nThe second positive is ... each arc of owarimonogatari has a character araragi interacts with a lot, and in all cases that character is fairly well written and interesting to watch. Interactions with a \"focus character\" bring life to all arcs of this anime.\\n\\n\r\nSpeaking of characters, Oshino Ougi is a very powerful presence in scenes where she appears,  and aside from her there is an infrequent but highly entertaining scenes with witty/entertaining comedic dialogue, which is not really related to the story.\\n\\n\r\nSo the bottom line is...\\n\\n\r\nAside from final episode that has a genuinely interesting moment, the \"central story\" is not that interesting, but the show is worth watching because of interesting opening song, powerful \"side\" characters and humor in non-story related dialogue. Oshino Ougi alone is a good reason to check the serious out. Just don't get your hopes too high about the central story of this season: while there are great characters and scenes where this anime shines, there are plenty of disappointing moments. The reason why I've rated the anime high despite this issue is because good moments overshadowed bad ones. So, basically, there are a lot of moment where the anime doesn't feel very special, but among those there are less frequent moments where it becomes really great.",
            "date": "2016-08-12T16:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 226590,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=226590"
        },
        {
            "content": "What else can be said about the Monogatari series at this point in the game?  It's been around for what feels like forever, presenting one of the best examples of dialogue, character and story-driven excellence in anime.  Owarimonogatari is literally just a handful of prolonged conversations.  The action within it can be summarized with one slap, a retaliatory punch, a brief fight with a samurai, a face grab and a touch to the chest.  That's it.  If any other anime that is supposed to be a mystery/action show tried getting away with that, it would be panned as boring.But, that is the strength of all of the Monogatari series, even those with more action.  \\n\\n\r\nThe dialog is so excellent, so engaging, they don't really have to do much in the way of action.  You find yourself glued to the screen reading every line as they unwrap each mystery, and for this season, the mystery was particularly morbid.  While funny, everything isn't a joke.  Why witty, nothing becomes pretentious.  It's just flawless writing, which produces flawless characters, which in turn produces flawless stories.  That is what the Monogatari series is all about and Owarimonogatari is just another prime example of it.\\n\\n\r\nThis is like the 10th installment of this series.  You already know you should be watching it.  \\n\\n\r\nStory: 10\\n\r\nArt: 10\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 10\\n\r\nOverall: 10\\n",
            "date": "2018-12-28T21:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 297277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=297277"
        }
    ],
    [
        {
            "content": "*THE RATINGS FOR THIS ARE SPECIFIC TO THE PART, BUT THE REVIEW IS FOR THE OVERALL SERIES*\r\n[STORY: 10/10]\r\nThe Monogatiri series comes together well to create a masterpiece of a story. This show is much deeper than alot of people think. It is filled to the brim with philosophical arguments and great storytelling. The focus isn't mainly on action, though it does have some visually stunning action scenes. Alot of the time, it will just be conversations between characters, but this is the blood that keeps this series alive and flourishing. Without it, you'd have a normal show with above average production. This type of showisn't for everyone, but I personally love it.\\n\\n\r\n[ART: 10/10]\\n\r\nThe animators went all out animating this show, as detail and flamboyance embody the artistic direction of this show. Each character's design and set piece is carefully planned out, and it shows. \\n\\n\r\n[SOUND: 10/10]\\n\r\nThe voice actors become their characters when they act them out, that's how into them they get. They really care about their role, you can tell. And sound effects are well done as well, nothing seems off in that department.\\n\\n\r\n[CHARACTER: 10/10]\\n\r\nMost every character is important to the main plot of the story and if they aren't a main character, the style of the show makes it seem as if they don't even exist. Whether they be designed as set pieces or outlines, the show really puts emphasis on those we really care about. These characters are no joke either, pretty much none of them are one-dimensional wastes of time, which is very appeciated.\\n\\n\r\n[ENJOYMENT/OVERALL: 10/10]\\n\r\nThough some parts of the series are better than others, the series as a whole is truly an amazing body of work that I consider a masterpiece. This story is filled to the brim with beautifully crafted characters, artwork, sound design, and an amazing story that philosophically challenges the observer to think. A masterful work by Isin Nisio.",
            "date": "2018-04-03T04:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 276647,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6971623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/godofmankind",
                "username": "godofmankind"
            },
            "url": "https://myanimelist.net/reviews.php?id=276647"
        },
        {
            "content": "Well well thought I'd actually do a review for once so lets talk about Owarimonogatari one of the 30 thousand seasons of the  monogatari franchise. Gonna break it down into the two big chunk chunks of the season. So first we have the Sodachi half and the Shinobu half.\r\nTHAT JUICY PLOT: Alright so lets begin with the stronger half by far. the Sodachi riddle and lost arcs were just fantastic arcs. The mystery aspect and the introduction of a new character was a nice change of pace. Ougi is newish too but Sodachi isn't a complete mystery. \r\nNow the two arcs have Araragi unravelinghis past to discover his relation to Sodachi and leaving out spoilers just know its amazing. The interactions and discoveries are just wonderful and the arc ends beautifully and conclusively which is rare in this series. \\n\\n\r\nAnyway since I'm trying to not write 4 pages of text lets talk about the shinobu mail arc. It's pretty good it connects back to the story about her minion when she first came to Japan 400 years ago. Gonna leave this pretty bare as most stuff to say would be spoiling it. Anywho the arc showed Araragi's insecurities quite well in terms of his jealousy and I'd say that was the best part of the arc, was him being a little different. \\n\\n\r\nART: Alright solid shafty animation \\n\\n\r\nSOUND: The mathemagics op my god its so good. Ed is sick too\\n\\n\r\nCHARACTERS: I don't feel the need to talk about characters because its like the 8th season you must like them by now, cause why suffer if you don't. Sodachi is the only character that is worth talking about but basically anything I say would be a spoiler so just enjoy her, shes great. \\n\\n\r\nENJOYMENT: This series is always enjoyable if you've seen this many seasons just watch it its still just as good.",
            "date": "2017-09-04T15:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 256898,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5382555.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/itsCmac",
                "username": "itsCmac"
            },
            "url": "https://myanimelist.net/reviews.php?id=256898"
        },
        {
            "content": "Tiring.\r\nI believe that the problem with writing a light novel series heavily based on witty dialogues is that, after twenty something books, you kinda run out of things to say.\r\nAs the anime series is almost a word by word adaptation of the novels, it reflects them by taking forever to just get to the point between endlessly idle chatter and the necessity of reminding the viewer what the story's about every 2 minutes or so like we have some kind of mental disability to grasp what the characters are saying the first ten times they said it, so they have to recap everything again! Evenif it isn't as bad as the necessity of the author to remind us what a goddamn vampire is each two paragraphs like in Kizumo, it's still pretty annoying.\\n\\n\r\nAt least we were told an excelent story on the Sodachi arcs, which had more relevants moments than the opposite, being, in my view, one of the best narratives of the anime until the moment (it was even weird to watch so many episodes without so much fiddle-faddle), but the second half of the anime could be around 70% shorter and we probably wouldn't miss much by it. Frankly, only the scenes of SurugaxShinobu clash and Senjougahara's call (also other by the very end, which is a bit spoiler-ish) were actually good, because the rest, meh. Not that the story in this arc was useless; it was actually necessary, but it had way too much futile moments when compared to actual narrative development. Even if this particular tale was actually handled in a kinda poor way for such an important event of the story, at least Monogatari still manages to be generally good when it focus on its plot.\\n",
            "date": "2017-08-22T04:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 256011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/rapo1",
                "username": "rapo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=256011"
        },
        {
            "content": "When it comes to this series, as I've mentioned in my other reviews, the time line is one of the only things that makes it hard for me to watch. As im enjoying the story and seeing how they all come together, i find myself thinking more about where it fits in the timeline, but that's just me.\r\nOn another note, out of all the ones in this series, i found myself enjoying this one the most. It had me thinking and wondering, and trying to piece together the mysteries on my own, along with Koyomi. \r\nFinally putting the Shinobu chapter together, by the end ofit I felt a sort of completion.  I was like \"ahh, okay now this makes sense.\" Overall, I enjoyed this one a lot.",
            "date": "2017-01-09T16:26:00+00:00",
            "helpful_count": 0,
            "mal_id": 237896,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=237896"
        }
    ]
]