[
    [
        {
            "content": "The most popular (aka common) type of animes of the past year has most definitely been school comedy anime with a female cast. And this one is no exception. Thankfully they put emphasis on what matters most character chemistry.\r\nAs you should already know it's a comedy about a high school kendo club, mainly consisting of (SPOILER AHEAD!) a group of girls. It all sounds like standard fare from here, and it is. The kids get involved in crazy hijinks, make silly jokes, and even have a decent amout of action in show such as this. After watching the first couple episodes, you'll most likely havea feeling if you are going to enjoy the show since the same style of jokes makes their rounds. Sometimes, its even as if they know they're making an uninspired anime and actually puts in gags and jokes that are very cliche` for the genre but leaves minor (and unique) twists for the viewers to laugh. Honestly, I think their jokes get off so well not only because of their 'semi' unique approach to joke telling, but the characters are just perfect for this show. \\n\\n\r\nLike all the other great comedy (and sports) shows before it, this show puts an emphasis on the character chemistry and development. This is where the show shines the most. It's just like how they intentionally make jokes about the the comedy genre its almost looks as if they intentionally mixed the character types around to create their own uniqueness. For example there's a smart looking that is really stupid, a clumsy girl that actually has good orginizational skills, and even a really loud quiet type. Good luck finding out who im talking about, but all the main characters are like that and its one main part why the comedy feels so fresh and unique. It almost feels like they all have double personalities. But the one person that really distracted me the from the others the most is quite easliy Tamaki-chan. She definitely steals the show in my eyes. Usually the show stealing characters arent the main character (Yuki, Osaka, etc) but that isn't the case here. She is the main reason why i kept watching this show. Hirohashi Ryou did a perfect job for her voice because there is no other way to do Tamaki's voice. There are other parts of greatness in this anime but I wont spoil the show any further. \\n\\n\r\nAnother good point of the show is how surprisingly good the artwork is in this show for a comedy show. There are various locations that you will see throughout the show, and each are shown with such vibrant color. The backgrounds are pretty detailed, you'll see alot of particle effects, reflections, and sunbeams throughout the show. And the characters are all drawn in the typical super cute borderline sexy style which is usual for a show in this type. Of course, the emphasis was more on the females than the males and you can tell because the all the men (with one exception) all look virtually the same. Another thing, is get used to their eyes as that is what you'll be seeing for the most part. \\n\\n\r\nSound effects are nothing to be super enthusiastic about. All thought the sound is very well done, once you've heard any high school anime you've heard them all pretty much. With the exception of the yelling and screaming from all the cute girls (extra points from me). They even have the girls singing the opening and ending theme song just like all the others in this genre. Well when you have cute voiced seiyu's use them as much as possible i guess. There is one uinque and hilarious sound but you wont hear it till around episode 20. Trust me when I tell you that it will have you on the floor laughing. \\n\\n\r\nThere are so many fun and memorable instances in this show it's hard not to give this a perfect score. They sure did do everything right in making this &quot;slice of life, high schoo, comedy, sports&quot; show different from all the others. But this does follow the same formula as all the other current releases (lots of girls + comedic situations + singing seiyus). Fortunately this is one of the better ones.",
            "date": "2008-05-12T23:25:00+00:00",
            "helpful_count": 98,
            "mal_id": 4697,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4697"
        },
        {
            "content": "Ever wonder what its like to be in a Kendo club? Well certainly most of us would answer \"no\" to that one, but after watching Bamboo Blade it just might make you more interested in this old time tradition! As this series does it very well!\r\nStory: 7/10\r\nPretty straight forward for the most part, basically it starts up with a struggling Kendo instructor and his team leader trying to get others into Kendo, as their club has little to no members at present. As the story progresses they meet/get new club members and then begin a road down to the final tournament to keep the instructorfrom losing his job after a misunderstanding with the school principle's wife. Now while the story remains very linear in this aspect, it doesn't just strictly stick to the whole &quot;Kendo&quot; idea, there are some nice scenes that have the girls struggling with daily life, whether it be confronting old rivals, watching a live action movie, meeting up with long time friends, to just trying to get that one part time job to earn up for a certain anime DVD collector's set that one of them wants. These play out more as sub plots on the side though, while the girls themselves make their way up the Kendo ladder. (sorry, but there is no actual love story in this anime, with the exception of one couple that already are an item from the get go) Which brings us to the Kendo itself, the series does a pretty fair job of explaining all the strategies and ropes of the sport, and never comes off as a gimmick with the whole &quot;Kendo&quot; tag. The first beginning episodes are good for giving decent enough back story on most of the main characters, so you never really feel like they tossed someone in the story just for the heck of it! While this is a comedy anime to be sure, it also contains quite a bit of sincere and touching moments as well between the characters, perhaps even more so than the actual comedy bits, which can also be seen as a negative depending on your perception. The biggest draw back overall, is both its linear plot twist fee storyline and slow pacing. There were times where I just wanted them to get on with it already. Despite this being an all female cast for the most part, I did find it interesting that there was no echhi factors in this title whatsoever. Which is great for viewers out there who are tired of having the usual all female cast that are strictly there for the fan service.\\n\\n\r\nThere shouldn't be anything that viewers will find offensive, aside from occasional language and mild violence. (the action is all done in a professional and respected manner, and not over the top)\\n\\n\r\nArtwork: 8/10\\n\r\nPretty good for the most part, all characters and environments are drawn with good detail and personality. While its not the best looking series out there, it does animate it well enough to catch your attention and not come off as an over kill. I personally found some of the overall color schemes to be a bit on the bland side though, but the great and versatile character design and facial expressions make up for it quite nicely!\\n\\n\r\nSoundtrack: 8/10\\n\r\nThe music itself is good! The opening and closing themes are nice and lively, that will fill you with a sense of happiness! The background music on the other hand is pretty much this one soft violin style track, that plays during most of the series. (most of the time on the touching or heavy thought parts) Its good, just not great in the variety department as its pretty much the only real track you'll hear. Now the character's voices are awesome! From the happy and playful Kirino, to the solitary feel of Tamaki. All the voices are varied and add a distinctness to them all, and not one of them you will find annoying.\\n\\n\r\nCharacters: 10/10\\n\r\nTruly the heart of the series, Bamboo Blade has some of the best character chemistry that I have seen in a long time. All of them know how to compliment eachother well, and never come off as a cliche. For example: My favorite characters were Miyako (a heart throb that has two personalities) and Dan (a short geeky guy). They are actually a couple, Miyako simply melts whenever she sees him, but acts out more aggressively when around anyone else. Its just little touches like that which make Bamboo Blade so enjoyable! While the characters do a great job to make you laugh, please keep in mind that they don't do it over the top. (well for the most part anyway) Most of the time they'll just get this wacky look to them, and simply make you laugh with their facial expressions!  They all grow very close to one another as the story progresses, and by the end you will truly feel the friendship that they all share.\\n\\n\r\nBottom Line: 9/10 \\n\r\nBamboo Blade is a great title, but unfortunately I can't recommend it to all viewers, especially if you like plot twists and a fast paced nonlinear storyline, as this title has none of those. But if your looking for a fun (and sometimes moving) anime with great character chemistry and amusing anecdotes. Then Bamboo Blade hits the mark just right!",
            "date": "2008-11-29T12:30:00+00:00",
            "helpful_count": 89,
            "mal_id": 9926,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=9926"
        },
        {
            "content": "Girls with Wooden Swords\r\nMan, what a ride. Bamboo Blade has it all; comedy, drama, romance, all rolled up into one. By making fun of itself at random places and with the help of very fabulous characters, this show rises from its shoddy animation to join the elite group of anime this season that deserves your time.\r\nI should get the not-so-good things out of the way first. The animation is pretty bad. No, not like Musashi Gundoh bad, but repeated animation, laziness supreme kind of bad. Up until the last two episodes, the same kendo swings from episode one get repeated over and over, with onlythe costumes changed. The backgrounds are nice watercolor pastels, but sometimes the characters look very funky. It`s hard to believe and oxymoronic that this show actually airs in HD.\\n\\n\r\nBut looking beyond the badness of the animation, Bamboo Blade is golden. The characters are a riot. Their voice actresses fit them perfectly. My favorite character out of the entire bunch is Kirino, with her happy-go-lucky attitude and her beautiful relationship with Saya, the hilarious redhead. Seriously, every time Saya opens her mouth, her voice cracks me up so much that I am left on the floor laughing. Kudos to her voice actress for providing her with such an amazing voice. The other characters also pad the show with relevant humor. You have acorn head/pimp Dan, his gay buddy Yuuji, the master kendo practitioner Tamaki, the klutz Azuma, the bipolar Miyako, and their failure of a teacher, Kojirou. As added bonus and hilarity, Kojirou is voiced by the ever-so-manly Kamina from Gurren Lagann, with all the same intonations and vocal gestures. It`s great.\\n\\n\r\nThe plot starts off as a standard shounen tournament fest, but midway through the anime branches off from the manga. Unlike most cases which this happens (cough cough Naruto filler hell), the director took very interesting directions in the plot. New characters that are just as cool as the original manga ones appear. Plot points are generally well paced and the comedy is well timed too.\\n\\n\r\nThe music is another strong point, with epic orchestral pieces to hot-blooded insert songs. I love the songs that play when the random Bravers appear, and I also love the clack clack sounds of the Kendo fights. I wasn`t very interested in Kendo before watching Bamboo Blade, but now I check out matches on Youtube. They`re even more intense than the anime itself.\\n\\n\r\nTamaki is sometimes too strong to the point of boredom, but Bamboo Blade always find ways to not fall too deep into that trap. Parodies and references are abundant. Facepalms, sweat marks, falling down in unison, everything`s there. You will definitely laugh at some point while watching, with the sudden bouts of unexpected humor. \\n\\n\r\nThe force of lesbian tendencies is strong with this one. Don`t miss it.",
            "date": "2008-04-05T10:55:00+00:00",
            "helpful_count": 58,
            "mal_id": 3634,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/53.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ladholyman",
                "username": "Ladholyman"
            },
            "url": "https://myanimelist.net/reviews.php?id=3634"
        },
        {
            "content": "This is my first... and last review. Which goes to show you how much I loved Bamboo Blade!\r\nStory -\r\nI thought the story was very good. I usually don't like sports-related anime, but a kendo club full of eccentric girls (and you know they are if you've seen this) and the two lone guys is something that grabbed my attention. It was nice to see how their relationships with each other progressed and what was going to happen with the club.\r\nArt -\r\nI really liked the art for this series. To compare it with other series - the art is a lot like Ichigo Mashimaro or Minami-ke(the first season, not the second season where they got lazy and didn't color in the extras); which is the type I enjoy. If you're really into that avant garde type of animation, it won't suit your tastes. \\n\\n\r\nSound -\\n\r\nI'm not really sure what falls into this category... I'm not one to listen to Opening or Endings... but the voice acting was done really well. I thought all the voices matched the characters and they did well to match their emotions.\\n\\n\r\nCharacter -\\n\r\nThe characters are the best part of this series. Every character is eclectic in some way or another. The most eclectic however is Dan-kun, which... you'll see why if you watch the series. He's special &lt;3. \\n\\n\r\nEnjoyment &amp; Overall - \\n\r\nI thoroughly enjoyed this series. It takes a lot for me to actually WANT to keep watching a series. Bamboo Blade even made me want not go to class because I didn't want to stop watching it. Overall it gets 10/10 from me!\\n\\n\r\nRecommended For: Anyone who likes comedy, a bit of slice-of-life, school settings, and sports series. There is the near loli-factor if you're into that too... boys... I have a feeling a lot of them will like Tama-chan :D.\\n\\n\\n\\n",
            "date": "2008-08-01T16:34:00+00:00",
            "helpful_count": 16,
            "mal_id": 6765,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ReverseHarem",
                "username": "ReverseHarem"
            },
            "url": "https://myanimelist.net/reviews.php?id=6765"
        },
        {
            "content": "I'm only 10 episodes into this anime right now - so I'm writing this only on the basis of what I've seen so far.  Plus, I'm not really a huge fan of the school/romantic comedy anime genre - so I was surprised when I actually decided to watch this particular anime.\r\nStory\r\nWhat can you really say about Bamboo Blade? Well, it's a story of 5 girls who are members of their high school kendo club. Their instructor (or sensei.. whatever) makes a bet with an old friend (who is also a rival kendo instructor) that his girls can beat the others at a kendo practicematch - the prize? A years worth of free sushi. Not the best sounding prize - but a prize none the less.  That aside, there are other &quot;mini stories&quot; that take place during the episodes as well. Incidentally, at the very beginning there's only 1 member in the kendo club - so, the first two episodes is taken up with the hilarious undertaking of recruiting new club members. They even end up with 2 male members (despite sensei's pleas to only have female members... the dirty old lech &gt;__&gt;)  What goes on beyond episode 10 is unknown to me... so, I suppose that this is all I can say about the story - and it's probably why it only got an 8.  Once I've seen more episodes - this will probably be reviewed also.  And also, the 5th member of the kendo team has yet to be recruited.  So, at the moment there are only 4 female members of the squad.\\n\\n\r\nCharacters\\n\r\nThis anime is pretty creative when it comes to the characters - it almost always remains refreshing. And it basically keeps the viewer watching. From the cute little Tamaki-chan who absolutely adores anime (almost reminds me of Konata from Lucky ☆ Star), but lacks some social skills - to the rather psychotic, but beautiful Miya-Miya who shows her &quot;black&quot; side.  Then there's Saya - who can be over dramatic at times, but it all adds to he charm.  Team captain Kirino appears to be the sensible one - often taking over from the instructor during training.  However, both Kirino and Saya make a rather decent comedy duo in some episodes.\\n\\n\r\nSound\\n\r\nI can't help it! Bamboo Blade has a very catchy opening theme song (which is actually performed by some members of the cast) - as well as a pretty sweet closing theme too (which is also sung by the cast). This is one of very few anime where I don't immediately click on &quot;mute&quot; when it comes to the openers and the closers... so, for me it's a win win soundtrack.  Ok, so I have the songs on my iPod... there are you happy now?! &gt;__&lt;  No, seriously - I really do like the themes.  The only other theme that I openly like are the openers for Gunslinger Girl and Higurashi no Naku Koro ni.\\n\\n\r\nConsidering that I've only watched 10 episodes so far - I can quite happily say that I am immensely enjoy watching Bamboo Blade. It's definitely one of the best that I have watched (in the comedy genre) and am quite proud to place it on my favourite anime list.",
            "date": "2008-05-11T02:51:00+00:00",
            "helpful_count": 14,
            "mal_id": 4652,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/32105.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Akaike",
                "username": "Akaike"
            },
            "url": "https://myanimelist.net/reviews.php?id=4652"
        },
        {
            "content": "Overview\r\nIt's surprising the amount of insight Bamboo Blade's silly, gag oriented characters provide on the passion for and the meaning of Kendo. Even more unthinkable is the lack of ecchi in a high school girl oriented cast clearly aimed at males. Bamboo Blade is full of wonderful surprises, but the repetitive comedy and weak action elements do nothing to fill in for its uneventful plot.\r\nSynopsis\r\nAn unambitious teacher is the supervisor for Murota school's Kendo club. Throughout the years, his club has been whittled down to one hard working and devoted girl, Kirino, who loves the sport but is miffed that her teacher is always solazy. A drunken wager with the teacher's former classmate stakes a full year of free sushi on an exhibition girl's Kendo match, and with this, he is suddenly gung ho about whipping his club into tournament shape, to the delight of Kirino. He pursues ex-members and a new child prodigy, Tamaki, to fill the ranks, and in the process, revives his old flame for Kendo.\\n\\n\r\nStory & Characters\\n\r\nThe most striking element of Bamboo Blade is how realistic and poignant, yet varied the characters' feelings towards Kendo are. Azuma, a member of the home Kendo club, adores it as a part of herself and a passion she's held since youth while Kirino enjoys the camaraderie it builds. Each of the main characters find a unique and believable relationship with Kendo, and even some of the minor characters shed words of wisdom. Most of the action elements also follow in this vein of realism. Even though many of the characters improve their skills, it's far from a \"powerup\" scenario. For instance, one of the home members has markedly wonderful aggression, but little skill and focus. Instead of taking the typical shounen route that would have transformed her into an unconventionally powerful prodigy, her lack of focus is a crippling handicap throughout, rendering her unable to win any matches. Just as in real life, the focus and skill is only be attained through painstaking practice along with multiple frustrating failures.\\n\\n\r\nIt's a little too bad that the series revolves around the tiny prodigy, Tamaki. She's a robotic character with her desire to emulate the naive heroism of her favorite Anime characters as her only displayed emotion throughout most of the series. Though she does undergo trials towards the end that expand her emotional range, her completely inhuman nature for the rest of the series had already sabotaged any possible empathy from the viewer. Unlike the other characters, Tamaki's Kendo skill goes beyond the bounds of believability; she is essentially invincible. To a lesser degree, the other characters are similarly simple caricatures for a majority of their screen time, but when Kendo gets involved, their genuine elements come through. Only when they reveal their relationship to Kendo are they not generic, run of the mill anime characters.\\n\\n\r\nMany of their gags are funny for the first time, but each character has no more than 1 or 2 that repeat, and by the end they become clockwork. Interestingly, the action is often skipped over, either with a simple still screen, or just an announcement of a winner with no visuals at all. The tantalizing bit of Kendo we see animated ranges from excessive still screen usage to beautiful and accurate animation that captures the explosive, almost spastic nature of the matches. Still, even when the matches are just glanced over, we get the primary reward we desire in the reaction of the characters. Their genuine passion for the sport makes me feel their elation when they win, and their heartbreak or frustration when they lose. Watching the characters express themselves in the context of Kendo is compelling, but I didn't care a lick for the rest of the plot. All the minutia that's supposed to give added weight to the results of the matches, which is the free sushi at first, and then eventually the teacher's job, is a boring filler of screen time\\n\\n\r\n--\\n\\n\r\nBamboo Blade is certainly far from a generic, power up sports Anime, but that novelty alone doesn't make it compelling. It's a drag to sit through at times, but the unmatched insight into Kendo, or perhaps competitive sports in general is worth wading through the other junk.",
            "date": "2009-09-18T18:44:00+00:00",
            "helpful_count": 8,
            "mal_id": 18906,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230526.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ace52387",
                "username": "ace52387"
            },
            "url": "https://myanimelist.net/reviews.php?id=18906"
        },
        {
            "content": "In many ways, this is similar to pretty much all sport related animes : A team needs to be built; there are problems; protagonist is beated but comes back fighting and everyone manages to prove themselves and of course, the standard \"club will be closed down unless something is done\"\r\nYet, there are a fair few unique things here - aside from being about Kendo, of course - the main one being is that the Kendo practitioners do lose often.  The story is quite gripping up until the end (with a little bit of a twist too), as you do feel for all the characters,especially Miya-miya.  However, there are a few irritating characters (namely Dan-kun), presumably designed to contrast with Miya-miya\\n\\n\r\nThe animation is fairly good with pretty decent 3D for such an old series, with both pretty good title and credit music.\\n\\n\r\nNo doubt you'll get more out of it if you a versed in Kendo, but even so, it is certainly exciting enough to watch to the end.\\n\\n\\n\\n",
            "date": "2018-03-04T10:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 273021,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962652.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sku_Te",
                "username": "Sku_Te"
            },
            "url": "https://myanimelist.net/reviews.php?id=273021"
        },
        {
            "content": "I believe a good sports anime should be able to make the viewer enjoy the anime even if they have little knowledge about the sport. Bamboo Blade manages to do this by making the characters the driving force instead of heavily focusing on the sport itself.\r\nThe plot is pretty simple, which is basically a school comedy revolving around the kendo club, they practice, go to tournaments and recruit new members along the way. Although the plot is simple, it also works because of the characters. The series is light hearted and has a fairly large amount of comedic moments which are actually pretty funny. Thepace is also just right for this kind of show. Other than there is nothing really spectacular about the plot but for this kind of show, it doesn't have to be.\\n\\n\r\nLike I mentioned before, the characters are what drives this series. Each character has their own very unique personality (for example Kirino is very energetic but also very responsible and very caring too) and they are each explored very well. All the main characters also develop a lot during the series (such as a Tamaki opening up more) and by the end of the anime, each of the characters have grown in different ways. The chemistry developed between the characters is also unmatched by most. Each character is likable and most of the comedic moments work because of them. Without the amazing characters and development, this anime would just be another average anime with nothing memorable about it.\\n\\n\r\nThe art does have it's fair share of good and bad moments, the backgrounds are detailed and generally drawn pretty well but colors don't really scream out. Also many of the hits look the same in the kendo matches.\\n\\n\r\nThe sound does a very good job. The opening and ending really fits the kendo theme and the voice actors do a really nice job with each character.\\n\\n\r\nLike many other series out there, not everyone is going to enjoy it. If you are looking for intensity and a complex plot then this genre as whole is probably not for you. However if you are looking for a good comedy, this more than holds up it's end of the bargain, as this series will have you laughing in a lot of places.\\n\\n\r\nBamboo Blade shows that unique and well developed characters can really push a series far. Even though the plot is very simple and isn't great, as a whole, it really delivers.",
            "date": "2012-07-23T16:49:00+00:00",
            "helpful_count": 7,
            "mal_id": 67499,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=67499"
        },
        {
            "content": "When people read the synopsis for this show, this is probably the most common reaction: \"An anime about Kendo? This must be sooo boring!\". That is what I thought at first as well, but when I really got to watching this show I'd have to use one of the biggest clichés ever to describe it.. Don't judge a book by it's cover.\r\nBamboo Blade was really special for me, because I was feeling kind of down when I started watching it, the reason being that I had just finished \"Code Geass: Hangyaku no Lelouch R2\" and I loved that show so much that I actually felt\"the void\" afterwards. For those who do not know what the void is, it is basicly a kind of feeling you can get when you've finished a really good show, and this feeling makes you kind of \"empty\" inside. You feel like you're never going to experience anything like that show ever again. While I was feeling the void I could not enjoy anime, and thus I ended up putting tons of shows on hold. I guess that most people can see where this is going, so I'll just wrap this little story up quickly: Bamboo Blade cured my void. It was that enjoyable, and after finishing it I felt like I could enjoy anime to it's fullest.\\n\\n\\n\r\n---STORY (7)---\\n\r\nThe story is very simple, but yet so gripping. It's simplicity is kind of what makes it shine, because it enables other elements to show really well. The story is about the Kendo teacher of Muroe High School, who happens to be almost completely out of cash. He can't even pay for his own food, and thus he rarely eats anything at all. But one day his old friend and senpai makes him a seemingly unreal deal: free sushi for a whole year if his kendo team can defeat his senpai's well trained warriors. He accepts and there the search for members begins.\\n\\n\r\nAs much as I love this kind of story that leaves so much open for further events, I'd still have to say that the idea itself is not all that original or in any way fantastic, it is just ok. It is rather how the story is presented that makes it truly sparkle. The already existing team captain Kirino Chiba and the teams sensei(who for the record is called Toraji Ishida) provide a whole bunch of funny moments while searching for members, but I will talk more about this duo when I get to the characters.\\n\\n\\n\r\n---ART (8)---\\n\r\nThis is what first got me interested in the show. I was showed a few scenes from the show through a certain reviewer on Youtube, and I immediately fell in love with the animation they used. The animation is not all that amazing, but it has a certain charm to it that made it hard for me to look away.\\n\\n\r\nIt is has a lot of detail, and it doesn't use many different shades of a color, but rather uses a few, much more noticeable variations of certain colors.\\n\\n\r\nThe animation, just like the story, shines thanks to it's simplicity. It just fits the show really well, and that makes it easier to concentrate on what's happening while watching.\\n\\n\\n\r\n---SOUND (7)---\\n\r\nWhile the soundtrack for this show is not amazing on it's own, it does fit the show really well, so I gave it the score 7. It was good for this certain show, but nothing more. Also the sound effects used when the swords hit and stuff like that fits really well.\\n\\n\r\nI watched Bamboo Blade dubbed, which to a lot of people might be a weird thing to do, but the dub was really good. All of the voices fit their characters personality and the voice acting itself was very well executed. I have heard some of the japanese original, and it sounds pretty good as well. I think that either would work, so if you prefer dubbed anime, go for that. If you prefer subbed anime, watch the japanese version.\\n\\n\\n\r\n---Characters (7)---\\n\r\nAll of the mains characters are really good. They each have their own personality, and when you combine them they all group so perfectly together in different ways. The only character that I ever had a problem with was Danjuuro Eiga. Not his personality, but rather the way he looked. His character was designed in a totally different way than the others, and that felt really weird and distracting.\\n\\n\r\nThe first two members of the kendo team were, as previously mentioned, the team captain Kirino and the coach Mr. Toraji Ishida. These two characters are with you from the start, and they really compliment each others personalities well. Other than those two I won't mention the names of the other team members, as they can be considered spoilers for some people.\\n\\n\\n\r\n---PERSONAL ENJOYMENT (10)---\\n\r\nAs I mentioned at the start of this review, this show was really enjoyable for me. It brought me a lot of happiness and I really can't find anything to complain about when it comes to this part. It just fulfilled it's purpose perfectly for me, and hopefully it will do the same for you if you deside to give Bamboo Blade a chance.\\n\\n\\n\r\n---OVERALL (7)---\\n\r\nBamboo Blade is a light hearted show of very good quality. It may not be for everyone, but if you like kendo, or just want a good comedy/action show to watch, then you should definitely watch this anime!\\n\\n\\n\\n\r\nThanks a bunch for taking a look at my review! Feel free to tell me what you thought of it, and please rate it with either \"Helpful\" or \"Not helpful\" depending on what you thought.",
            "date": "2013-12-31T23:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 126595,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2419091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SirAbblot",
                "username": "SirAbblot"
            },
            "url": "https://myanimelist.net/reviews.php?id=126595"
        },
        {
            "content": "Lovable and interesting characters, passionate martial art, great humor and cat cameos. Bamboo Blade has it all.\r\nKendo instructor at Muroe highschool, Ishida, has a hard time to pay his bills, when his old friend and coleague offers to pay for his sushi for one whole year. That is if his team wins at a friendly tournament. If only there were more than one loyal captain and the other that has not showed up in a while. To win, he would need a miracle. A big miracle. A miracle that, say, easily deflects dangerous stray tennis ball. And baseball... aaand a rugby ball. And principal fallingfrom the third floor back up. With a broom.\\n\\n\r\nDo you like kendo? Well this anime is for you! Do you at least know, what kendo is? You might enjoy this series. Have you got absolutely no idea what that thing even is? This show may entertain you anyway. Maybe you will even grow to love this honorable yet energetic art.\\n\\n\r\nI recently watched Bamboo Blade second time after not having seen it in a long time. And I enjoyed falling in love with both kendo and splendid characters. Enthusiastic and always cheerful captain Kirino is my most favourite, although I realized that her bestie, passionate but often distracted Saya is my spirit animal (or should I say anime - AHAHA... maybe I shouldn't... ahem). Even though you are bound to have favourite characters, others are not far behind. Ethereal beauty, with the fierce beast inside her Miya-Miya, bespectacled Asuna, who is clumsy until she grabs her bamboo sword, then she is worhty oponent. An of course, brave captain - tiny and quiet Tamaki, who beats teachers in one blow and then goes to get a bento lunch.\\n\\n\r\nTheme of this anime is not only kendo, but love for anything that you do with passion and for the good reasons. Something that you and your friends can enjoy. It also has great character development and the action scenes, man should I even start. It those moments where there is silence between crucial blow and referees resolution that makes your breath stop.\\n\r\nAnd finaly humor has all the good anime stuff, super deform, cats and some meta jokes and fourth wall breaks.\\n\\n\r\nI hope you enjoy this show as much as I did. It is one of my favourite. I even love trailer made by funimation. Watch it, have fun and never give up :D",
            "date": "2015-11-16T11:09:00+00:00",
            "helpful_count": 7,
            "mal_id": 203486,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HotaruMari",
                "username": "HotaruMari"
            },
            "url": "https://myanimelist.net/reviews.php?id=203486"
        },
        {
            "content": "Watched this back in 7+ years and rewatched last year, decent anime where you can have light laugh. I watched this dub twice 0 sub, just because I watched it dubbed when I was younger. If I rewatch it again maybe sub, but don't want to.\r\nStory at a school, with a kendo club struggling to get members, meeting the strongest member, convincing her to join eventually joins. The instructor which shortly later on has a fight with the principals wife, when they both back up. They had some fight already before hand or was it 2.\r\nThey do get enough female members which they can usefor spars and or for the championship.\\n\r\nThe op is pretty good also the ending song is good.\\n\\n\r\nThe anime also show some daily things they do and show there hobbies. Them having jobs or an interest in things. We do meet a rival who has the same interest as the best kendo girl. There is an episode where they are in a movie.  There is a good amount of comedy and there is a yandere girl also, but not to where she will kill anyone just hurt them I guess emotionally. The anime does end at a cliffhanger where there is another rival introduced where you have to read the manga. Just google for the chapter.\\n\\n\r\nStory-8\\n\r\nArt-8\\n\r\nSound-8\\n\r\nCharacter-8\\n\r\nEnjoyment-8\\n\r\nOverall-8",
            "date": "2019-01-12T21:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 298880,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4906592.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lord_Valzin",
                "username": "Lord_Valzin"
            },
            "url": "https://myanimelist.net/reviews.php?id=298880"
        },
        {
            "content": "Story: It was pretty much like every other school anime. Characters do something for a few episodes and then move to something else. Blade Braver was a great way to add some feeling of a on-going story.\r\nArt: The animation was not anything special and was pretty much like most other anime. The drawing style and colors won me over.\r\nSound: Soundtrack was good. Voices were good. Opening and ending themes were good. I'm not complaining.\r\nCharacter: I liked the characters, well most of them. Tamaki was just super cute, she was the reason I began watching this show. Kirino was an awesome character too. When she'd getsad, you knew something was seriously at miss. I seriously wanted to kill Dan-kun, but I believe that was the original purpose of this character anyway. That american chick messing with Miya-miya seriously also annoyed me.\\n\\n\r\nEnjoyment: I enjoyed this show. Full of comedy and an occasional touch of epic. Girls screaming men, do and kote was kinda awesome. They also managed to put some good drama here and there.\\n\\n\r\nOverall: Very shonen. Surely anyone into sports or school anime will get something out of this show.",
            "date": "2008-04-10T03:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 3840,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24435.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lovekuja",
                "username": "Lovekuja"
            },
            "url": "https://myanimelist.net/reviews.php?id=3840"
        },
        {
            "content": "Have you ever had an empty feeling after watching a good anime? Well that's what happened after i watched Bamboo Blade.\r\nIn my country or at least in where i live, there's no clubs in high school, so i'm always exciting to watch series about everyday life in a school club and this show surely delivered it. A very well-executed anime from the start to the very end.\r\nIn 26 eps long, Bamboo Blade has got it all what you would ever see in an sport, slice of life gerne: the school life, the hardwork, a little drama, a little romance, the will to overcome hardness, thesportmanship... of everyone in the kendo club of Muroe High School. A inspirative story along with a colorful girls cast.\\n\\n\r\nThe artstyle of the show reminds me of the midway 2000s with some moe elements that makes the show very easy to watch, great to see something old but gold. The music is rather normal, op and ed is pretty good.\\n\\n\r\nI think Bamboo Blade is a good show to kill your boredom. Why not give it a try? You can thank me later.",
            "date": "2015-07-10T06:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 192870,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489573.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/johnbradshaw",
                "username": "johnbradshaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=192870"
        },
        {
            "content": "Av: Um...what's with the wiffle bat?\r\nNK: Hm?  Oh, hey Avon.  Just practicing my kendo swing.  I just finished watching Bamboo Blade\r\nAv: Oh...right.  How was it?\r\nNK: Fantastic.  Though it was informative, kinda like Hikaru no Go, it was really enjoyable because of the characters.\r\nAv: Take it that's what you liked best, then.\r\nNK: Yeah.  The plot was pretty good, and the music was good too.  The characters really define the series, though.\r\nAv: From the looks of it, it's all female.\r\nNK: Nope.  Though the series is focused on the girls' kendo team, male characters are present and are actually prettyimportant to the series.\\n\r\nAv: How so?\\n\r\nNK: Well, the main kendo instructors are all male.  Then there're the two seniors who play as antagonists in a couple ways.  Plus, the two freshmen boys who join the club actually have a bit of character development themselves, and one of them acts as both a supporting character and a protagonist.\\n\\n\r\nAv: I take it one of the females is your favorite, though.\\n\r\nNK: Yeah.  For a while, Tama-chan was my favorite character: the hero for justice and all that.  In retrospect, though, I've chosen Kirino.  She's described in the series as being \"the pillar of the kendo club\", and she could probably be described as the pillar of the series, too.  A lot of the humor involves her, and a good amount of the suspense is placed on her shoulders as well.  It's difficult to find a character like that that still has a great supporting cast.\\n\r\nAv: Why don't you give a dissertation next time?\\n\r\nNK: Sorry, I just haven't found a character like that in a long time...\\n\\n\r\nAv: Anyway, think I should take a look at it?\\n\r\nNK: Definitely.  Granted, there are some cutesy parts...\\n\r\nAv: I'll be sure to have a bucket handy.\\n\r\nNK: It's not that bad.  Just girls being girls, like any slice-of-life anime out there.  If you're interested in kendo, Bamboo Blade is a great starting point.  I think you'd like it because you like traditional japanese swordplay.  Kendo was used as training in the feudal age, if I recall correctly.\\n\\n\r\nAv: Right.  Well, I'll let you get back to...whatever it was you were-\\n\r\n*smack* *pop*\\n\r\nNK: Aw, curses...that was the light bulb, wasn't it?\\n\r\nAv: Yup.  Good thing that bat's plastic, huh?",
            "date": "2010-03-24T09:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 24276,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/227213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NinjaKirby1322",
                "username": "NinjaKirby1322"
            },
            "url": "https://myanimelist.net/reviews.php?id=24276"
        },
        {
            "content": "I would like to preface this by saying that I've never even heard of Bamboo Blade, let alone watched it.\r\nBamboo Blade is a comedy that comes around only once every very often. Let's face it, you've seen all of this before: Broke teacher looking for a quick fix to his problem, lovable cast of female characters who just want to train in kendo and have a fun time, all wrapped up in a comedy school setting. By no means is it anything new in the anime world, but it is still a wholly charming and fun little show.\r\nStory:\r\nHonestly, the story isn't all that fantastic. It'svery predictable and cliche, and while that isn't bad, it certainly won't win any awards. I think it's best to just accept that the story is just a setup for the truly great cast of characters to interact in, rather than a driving force for the anime.\\n\\n\r\nArt:\\n\r\nCharacter design is fantastic in Bamboo Blade! Each and every character is immediately recognizable and really left a deep impression on me. I still can't look at Kirino's face without smiling, what a beautiful character. Animation is surprisingly good, you can tell that while they knew this wasn't making any major leaps in the world of anime, the animators were dedicated to their work and wanted this to look really nice, and honestly, my hat's off to them. Well done! I'd also like to point out the lack of ecchi - there were a lot of times in this anime that could have focused on cheap panty shots and questionable ecchi situations, but it did a good job at not offending me at all. \\n\\n\r\nSound:\\n\r\nThe soundtrack to the anime is kind of weak, but it makes up for it with the fantastic voice acting. Both the English and Japanese versions are very well-done, although I prefer watching in Japanese with subs. All of the voice actresses really capture the style of the anime very well, from the comedy scenes to the more serious ones, I was captivated the whole time by their voices.\\n\\n\r\nCharacter:\\n\r\nAnd here's the major selling point of this anime. Really, when it comes to writing characters, there's nothing more frustrating than a good character that has poorly-written interactions with other characters. Bamboo Blade doesn't have this problem though, as all of the characters are well-written and enjoyable, but also their chemistry is superb and all of their interactions really make sense and contribute a lot to my enjoyment of this anime.\\n\\n\r\nIt may be a pretty typical style of anime, but that didn't keep me from thoroughly enjoying it. I would recommend this to anyone who wants a nice, fun anime to sit back and enjoy. \\n\\n\r\nSo, now that I've finished this review, I've decided it'd be a good idea to actually watch Bamboo Blade and see if it matches up with my review.",
            "date": "2013-07-08T13:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 104435,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2432847.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaiiroTama",
                "username": "HaiiroTama"
            },
            "url": "https://myanimelist.net/reviews.php?id=104435"
        },
        {
            "content": "Hate to be that guy, but I think this show is absolutely overrated.  Why is the score so high? \r\n Is it funny?  No, not in particular, I can't recall actually laughing once throughout the entire 26 episodes—maybe at best a smirk? \r\nAre the characters really all the great?  No, they aren't that in depth, and many of them are naively annoying!.  \r\nIs the action superb? Far from it.  I doubt kendo in real life would even be very enjoyable to watch.  This isn't a real sword fight... It is with sticks.\r\nThe one romance in the show, they blatantlymake fun of because it is so absurd.\\n\\n\r\nBut what took the cake for me to rate this abysmal waste of time so poorly?  Episode 23.  That episode sums up the worthlessness of these characters.\\n\\n\r\nThis epsiode involves delinquents that never show up and end up potentially damaging the club.  They are bullies and terrible people, yet these fools contemplate protecting them!?!? WHY!?! I cannot understand this ignorant, naive notion.  THEY WEREN'T EVEN THERE FOR THE ENTIRE YEAR, YET STILL CONSIDERED PART OF THE TEAM?!!? HOW????? This show was not great until this episode, but this absolutely RUINED any small trace of passable this anime had left.  Naive characters are NOT cute, they are ANNOYING—and this is a PRIME example of it.\\n\\n\r\nAlso, Tamaka getting mad at him for taking the tall stance to get her practicing better against it.... And she says \"I don't appreciate the joke...\" WOW, be grateful Yuji is trying to help you with something you suck at!\\n\\n\r\nAND the way the \"sensei\" talks all low and slow IS SO GD ANNOYING!\\n\\n\r\nThis anime panders to weak emotional strings, with a naive attempt, and an annoying cast of characters.\\n\\n\r\nBottom-line: if you don't like sappy, unnecessarily long-drawn out animes—then don't watch this.",
            "date": "2016-12-01T07:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 234700,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5224341.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/blaice",
                "username": "blaice"
            },
            "url": "https://myanimelist.net/reviews.php?id=234700"
        },
        {
            "content": "An anime about a kendo club in school. When I first saw the name and read a synopsis of Bamboo Blade I wasn't too sure about it. I was no really fan of sports anime and I thought it was just another one of those which were shown here in TV. A friend of mine asked me to watch the first episode together with him and I'm quite glad that I did it. I really enjoyed this warm and heartfilling anime.\r\nStory: To be true there isn't that much story in this kind of anime. The girls go to school, practice kendo and participate in kendotournaments. So far there is nothing special about it. The way that rather stereotypical story is told is ok though. The fact that the story is negligible doesn't make this anime bad. Imho anime like Bamboo Blade don't really need a good story to be entertaining.\\n\\n\r\nArt: The animation of Bamboo Blade is good just as expected from an anime from 2007. The character design is cute and fitting, the backgrounds are drawn well , the kendo matches are fast paced and quickly over. Nothing like other sports anime where running scenes for example are way too long and you can see the earth curvature while the characters are running over the sports field. \\n\\n\r\nSound: Imho the strongest part in Bamboo Blade was the OST. With \"Bamboo Beat\" and \"Star Rise\" Bamboo Blade has  rather usual opening songs/ending songs vocaled by the female seiyuu crew which actually did a good job in voicing the characters, imho they all fit. But the best thing about the OST is the BGM. The BGM of Bamboo Blade is full of fast paced drums which fit the atmosphere of the kendo matches. On the other hand there are also slow paced songs without drums which fit the more laidback atmosphere when the girls are not doing kendo.\\n\\n\r\nCharacter: The characters in Bamboo Blade are all very likable. They are not as flat as in other sports series because they all have other unique character traits besides loving kendo and you actually get to see it even though the anime shows about 70-80% of the time the girls in kendo practice or kendo matches. \\n\\n\r\nEnjoyment: I really enjoyed Bamboo Blade because of it's atmosphere which was calm and nice in the non-fighting scenes and fast and quick in the battle scenes. The comedy part of this series is also quite good. The girls are all moe. It's a good anime to watch when you want to watch something where you don't have to think too much about what actually is happening and you want to lay back and relax.\\n\\n\r\nOverall:  Bamboo Blade was an quite refreshing anime, easy to watch and simply just nice. I highly recommend Bamboo Blade for people who like sports anime, school life anime and comedy anime ... Other people should also give it a try.\\n\\n\r\nOne last personal thing: I am sorry for my poor grammar and vocabularies but English is not my native language and so I had some troubles writing a longer text in this language.",
            "date": "2009-04-15T23:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 14198,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109438.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/An00biz",
                "username": "An00biz"
            },
            "url": "https://myanimelist.net/reviews.php?id=14198"
        },
        {
            "content": "Ok if you are reading this review please listen this is very Enjoyable (AT FIRST) when u reach ep 20-22 it gets really boring \r\nHonestly i watched lots of anime and i wasnt/arent impressed with this one \r\nNo seroius plot No Interesting fighting scenes\r\nThey just show u kendo NO ACTION \r\nThey keep repeating moves\r\nAnd i rated the sound 4 Cause they keep screaming like bitches Every freakin Minuate of the anime\r\nOverall its something u watch when u got nothing to watch while youre eating not an anime u watch For fun only!!",
            "date": "2008-10-14T09:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 8697,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91746.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lonareas",
                "username": "Lonareas"
            },
            "url": "https://myanimelist.net/reviews.php?id=8697"
        },
        {
            "content": "If you want to watch an anime that would leave you feeling warm, happy and heartfelt, look no longer!\r\nThe story line isn't as exciting, but the character and the development of the character was lovely and charming. Full of light hearted and charming sense of humour, that would leave you smiling. \r\nThe art work is decent. The setting of the dojo brings a traditional theme into the modern school setting, which is nice to watch. \r\nI strongly recommend this anime. It is one of those anime that would leave a smile when you finish it :)",
            "date": "2015-02-28T19:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 181416,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rlam86",
                "username": "rlam86"
            },
            "url": "https://myanimelist.net/reviews.php?id=181416"
        },
        {
            "content": "I'd be all personal about it and say it's DA BEST THING EVARRR!!!! and give it a 10 across the board like a typical MAL fa...uh, not-so-objective member. But then I'm simply not that type.\r\nSTORY\r\nPretty simple premise: guy in charge of the club looks to make a group of kendo chicks to compete with his ex-kendo mate's team, so that he can have a shot at his buddy's promised reward: free food for a year.\r\nNot terribly exciting, and the way the teacher just manages to put together a team of skilled kendo experts screams plot device. Plus the couple of filler episodes distract from themain storyline, and not at the best times either.\\n\r\nStill, having a simple plot means there are no big plotholes to drop your balls over, and the progression in the story is for the most part smooth.\\n\\n\r\nART\\n\r\nThe main weakness of this anime. The animation quality is at best functional, and at worst, obviously flawed and jarring. It gets readily apparent that the studio had typically thrown its budget at the first episode; the quality degradation after that is obvious, with many features out of position, and the background detail a bare minimum. Fortunately it does pick up a bit near the end (as expected).\\n\r\nThe designs aren't very eye-catching (with the notable exception of the oh-so-moe Tama-chan), but the characters have been drawn very distinctively, with no chance of mistaking a person for anyone else.\\n\\n\r\nSOUND\\n\r\nFunctional. The OP/ED is typical, and the BGM (a decent if apparently hackjob-style effort) doesn't vary much.\\n\\n\r\nCHARACTER\\n\r\nHere the anime really shines. Every character's personality is distinctive, refreshing, and surprisingly believable, the chemistry is great, and the voice acting is also excellent. The character development, while skimpy for most characters except 2 (the only markdown here) is sufficient to endear one to the characters.\\n\\n\r\nENJOYMENT\\n\r\nThe whole ride was fun. Even though the story wasn't exciting, and it looked to be going nowhere at times, I found myself looking forward to the amusing interactions of the kendo club and its happenings. The down-to-earth and (mostly) realistic tone of these interactions (with the exception of Miya-Miya and the two side characters related to her) really drew me in, and at the end of every episode I found myself in better spirits. \\n\\n\r\nOVERALL\\n\r\nThe animation was comparatively plain bad, the music was forgettable, and the story wasn't great. But these glaring errors somehow were little more than side distractions in a wonderful viewing experience with the amazing characters and chemistry. Certainly worth a watch.",
            "date": "2008-07-13T01:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 6226,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19199.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GrimaH",
                "username": "GrimaH"
            },
            "url": "https://myanimelist.net/reviews.php?id=6226"
        }
    ],
    [
        {
            "content": "The most popular (aka common) type of animes of the past year has most definitely been school comedy anime with a female cast. And this one is no exception. Thankfully they put emphasis on what matters most character chemistry.\r\nAs you should already know it's a comedy about a high school kendo club, mainly consisting of (SPOILER AHEAD!) a group of girls. It all sounds like standard fare from here, and it is. The kids get involved in crazy hijinks, make silly jokes, and even have a decent amout of action in show such as this. After watching the first couple episodes, you'll most likely havea feeling if you are going to enjoy the show since the same style of jokes makes their rounds. Sometimes, its even as if they know they're making an uninspired anime and actually puts in gags and jokes that are very cliche` for the genre but leaves minor (and unique) twists for the viewers to laugh. Honestly, I think their jokes get off so well not only because of their 'semi' unique approach to joke telling, but the characters are just perfect for this show. \\n\\n\r\nLike all the other great comedy (and sports) shows before it, this show puts an emphasis on the character chemistry and development. This is where the show shines the most. It's just like how they intentionally make jokes about the the comedy genre its almost looks as if they intentionally mixed the character types around to create their own uniqueness. For example there's a smart looking that is really stupid, a clumsy girl that actually has good orginizational skills, and even a really loud quiet type. Good luck finding out who im talking about, but all the main characters are like that and its one main part why the comedy feels so fresh and unique. It almost feels like they all have double personalities. But the one person that really distracted me the from the others the most is quite easliy Tamaki-chan. She definitely steals the show in my eyes. Usually the show stealing characters arent the main character (Yuki, Osaka, etc) but that isn't the case here. She is the main reason why i kept watching this show. Hirohashi Ryou did a perfect job for her voice because there is no other way to do Tamaki's voice. There are other parts of greatness in this anime but I wont spoil the show any further. \\n\\n\r\nAnother good point of the show is how surprisingly good the artwork is in this show for a comedy show. There are various locations that you will see throughout the show, and each are shown with such vibrant color. The backgrounds are pretty detailed, you'll see alot of particle effects, reflections, and sunbeams throughout the show. And the characters are all drawn in the typical super cute borderline sexy style which is usual for a show in this type. Of course, the emphasis was more on the females than the males and you can tell because the all the men (with one exception) all look virtually the same. Another thing, is get used to their eyes as that is what you'll be seeing for the most part. \\n\\n\r\nSound effects are nothing to be super enthusiastic about. All thought the sound is very well done, once you've heard any high school anime you've heard them all pretty much. With the exception of the yelling and screaming from all the cute girls (extra points from me). They even have the girls singing the opening and ending theme song just like all the others in this genre. Well when you have cute voiced seiyu's use them as much as possible i guess. There is one uinque and hilarious sound but you wont hear it till around episode 20. Trust me when I tell you that it will have you on the floor laughing. \\n\\n\r\nThere are so many fun and memorable instances in this show it's hard not to give this a perfect score. They sure did do everything right in making this &quot;slice of life, high schoo, comedy, sports&quot; show different from all the others. But this does follow the same formula as all the other current releases (lots of girls + comedic situations + singing seiyus). Fortunately this is one of the better ones.",
            "date": "2008-05-12T23:25:00+00:00",
            "helpful_count": 98,
            "mal_id": 4697,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4697"
        },
        {
            "content": "Ever wonder what its like to be in a Kendo club? Well certainly most of us would answer \"no\" to that one, but after watching Bamboo Blade it just might make you more interested in this old time tradition! As this series does it very well!\r\nStory: 7/10\r\nPretty straight forward for the most part, basically it starts up with a struggling Kendo instructor and his team leader trying to get others into Kendo, as their club has little to no members at present. As the story progresses they meet/get new club members and then begin a road down to the final tournament to keep the instructorfrom losing his job after a misunderstanding with the school principle's wife. Now while the story remains very linear in this aspect, it doesn't just strictly stick to the whole &quot;Kendo&quot; idea, there are some nice scenes that have the girls struggling with daily life, whether it be confronting old rivals, watching a live action movie, meeting up with long time friends, to just trying to get that one part time job to earn up for a certain anime DVD collector's set that one of them wants. These play out more as sub plots on the side though, while the girls themselves make their way up the Kendo ladder. (sorry, but there is no actual love story in this anime, with the exception of one couple that already are an item from the get go) Which brings us to the Kendo itself, the series does a pretty fair job of explaining all the strategies and ropes of the sport, and never comes off as a gimmick with the whole &quot;Kendo&quot; tag. The first beginning episodes are good for giving decent enough back story on most of the main characters, so you never really feel like they tossed someone in the story just for the heck of it! While this is a comedy anime to be sure, it also contains quite a bit of sincere and touching moments as well between the characters, perhaps even more so than the actual comedy bits, which can also be seen as a negative depending on your perception. The biggest draw back overall, is both its linear plot twist fee storyline and slow pacing. There were times where I just wanted them to get on with it already. Despite this being an all female cast for the most part, I did find it interesting that there was no echhi factors in this title whatsoever. Which is great for viewers out there who are tired of having the usual all female cast that are strictly there for the fan service.\\n\\n\r\nThere shouldn't be anything that viewers will find offensive, aside from occasional language and mild violence. (the action is all done in a professional and respected manner, and not over the top)\\n\\n\r\nArtwork: 8/10\\n\r\nPretty good for the most part, all characters and environments are drawn with good detail and personality. While its not the best looking series out there, it does animate it well enough to catch your attention and not come off as an over kill. I personally found some of the overall color schemes to be a bit on the bland side though, but the great and versatile character design and facial expressions make up for it quite nicely!\\n\\n\r\nSoundtrack: 8/10\\n\r\nThe music itself is good! The opening and closing themes are nice and lively, that will fill you with a sense of happiness! The background music on the other hand is pretty much this one soft violin style track, that plays during most of the series. (most of the time on the touching or heavy thought parts) Its good, just not great in the variety department as its pretty much the only real track you'll hear. Now the character's voices are awesome! From the happy and playful Kirino, to the solitary feel of Tamaki. All the voices are varied and add a distinctness to them all, and not one of them you will find annoying.\\n\\n\r\nCharacters: 10/10\\n\r\nTruly the heart of the series, Bamboo Blade has some of the best character chemistry that I have seen in a long time. All of them know how to compliment eachother well, and never come off as a cliche. For example: My favorite characters were Miyako (a heart throb that has two personalities) and Dan (a short geeky guy). They are actually a couple, Miyako simply melts whenever she sees him, but acts out more aggressively when around anyone else. Its just little touches like that which make Bamboo Blade so enjoyable! While the characters do a great job to make you laugh, please keep in mind that they don't do it over the top. (well for the most part anyway) Most of the time they'll just get this wacky look to them, and simply make you laugh with their facial expressions!  They all grow very close to one another as the story progresses, and by the end you will truly feel the friendship that they all share.\\n\\n\r\nBottom Line: 9/10 \\n\r\nBamboo Blade is a great title, but unfortunately I can't recommend it to all viewers, especially if you like plot twists and a fast paced nonlinear storyline, as this title has none of those. But if your looking for a fun (and sometimes moving) anime with great character chemistry and amusing anecdotes. Then Bamboo Blade hits the mark just right!",
            "date": "2008-11-29T12:30:00+00:00",
            "helpful_count": 89,
            "mal_id": 9926,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=9926"
        },
        {
            "content": "Girls with Wooden Swords\r\nMan, what a ride. Bamboo Blade has it all; comedy, drama, romance, all rolled up into one. By making fun of itself at random places and with the help of very fabulous characters, this show rises from its shoddy animation to join the elite group of anime this season that deserves your time.\r\nI should get the not-so-good things out of the way first. The animation is pretty bad. No, not like Musashi Gundoh bad, but repeated animation, laziness supreme kind of bad. Up until the last two episodes, the same kendo swings from episode one get repeated over and over, with onlythe costumes changed. The backgrounds are nice watercolor pastels, but sometimes the characters look very funky. It`s hard to believe and oxymoronic that this show actually airs in HD.\\n\\n\r\nBut looking beyond the badness of the animation, Bamboo Blade is golden. The characters are a riot. Their voice actresses fit them perfectly. My favorite character out of the entire bunch is Kirino, with her happy-go-lucky attitude and her beautiful relationship with Saya, the hilarious redhead. Seriously, every time Saya opens her mouth, her voice cracks me up so much that I am left on the floor laughing. Kudos to her voice actress for providing her with such an amazing voice. The other characters also pad the show with relevant humor. You have acorn head/pimp Dan, his gay buddy Yuuji, the master kendo practitioner Tamaki, the klutz Azuma, the bipolar Miyako, and their failure of a teacher, Kojirou. As added bonus and hilarity, Kojirou is voiced by the ever-so-manly Kamina from Gurren Lagann, with all the same intonations and vocal gestures. It`s great.\\n\\n\r\nThe plot starts off as a standard shounen tournament fest, but midway through the anime branches off from the manga. Unlike most cases which this happens (cough cough Naruto filler hell), the director took very interesting directions in the plot. New characters that are just as cool as the original manga ones appear. Plot points are generally well paced and the comedy is well timed too.\\n\\n\r\nThe music is another strong point, with epic orchestral pieces to hot-blooded insert songs. I love the songs that play when the random Bravers appear, and I also love the clack clack sounds of the Kendo fights. I wasn`t very interested in Kendo before watching Bamboo Blade, but now I check out matches on Youtube. They`re even more intense than the anime itself.\\n\\n\r\nTamaki is sometimes too strong to the point of boredom, but Bamboo Blade always find ways to not fall too deep into that trap. Parodies and references are abundant. Facepalms, sweat marks, falling down in unison, everything`s there. You will definitely laugh at some point while watching, with the sudden bouts of unexpected humor. \\n\\n\r\nThe force of lesbian tendencies is strong with this one. Don`t miss it.",
            "date": "2008-04-05T10:55:00+00:00",
            "helpful_count": 58,
            "mal_id": 3634,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/53.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ladholyman",
                "username": "Ladholyman"
            },
            "url": "https://myanimelist.net/reviews.php?id=3634"
        },
        {
            "content": "This is my first... and last review. Which goes to show you how much I loved Bamboo Blade!\r\nStory -\r\nI thought the story was very good. I usually don't like sports-related anime, but a kendo club full of eccentric girls (and you know they are if you've seen this) and the two lone guys is something that grabbed my attention. It was nice to see how their relationships with each other progressed and what was going to happen with the club.\r\nArt -\r\nI really liked the art for this series. To compare it with other series - the art is a lot like Ichigo Mashimaro or Minami-ke(the first season, not the second season where they got lazy and didn't color in the extras); which is the type I enjoy. If you're really into that avant garde type of animation, it won't suit your tastes. \\n\\n\r\nSound -\\n\r\nI'm not really sure what falls into this category... I'm not one to listen to Opening or Endings... but the voice acting was done really well. I thought all the voices matched the characters and they did well to match their emotions.\\n\\n\r\nCharacter -\\n\r\nThe characters are the best part of this series. Every character is eclectic in some way or another. The most eclectic however is Dan-kun, which... you'll see why if you watch the series. He's special &lt;3. \\n\\n\r\nEnjoyment &amp; Overall - \\n\r\nI thoroughly enjoyed this series. It takes a lot for me to actually WANT to keep watching a series. Bamboo Blade even made me want not go to class because I didn't want to stop watching it. Overall it gets 10/10 from me!\\n\\n\r\nRecommended For: Anyone who likes comedy, a bit of slice-of-life, school settings, and sports series. There is the near loli-factor if you're into that too... boys... I have a feeling a lot of them will like Tama-chan :D.\\n\\n\\n\\n",
            "date": "2008-08-01T16:34:00+00:00",
            "helpful_count": 16,
            "mal_id": 6765,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ReverseHarem",
                "username": "ReverseHarem"
            },
            "url": "https://myanimelist.net/reviews.php?id=6765"
        },
        {
            "content": "I'm only 10 episodes into this anime right now - so I'm writing this only on the basis of what I've seen so far.  Plus, I'm not really a huge fan of the school/romantic comedy anime genre - so I was surprised when I actually decided to watch this particular anime.\r\nStory\r\nWhat can you really say about Bamboo Blade? Well, it's a story of 5 girls who are members of their high school kendo club. Their instructor (or sensei.. whatever) makes a bet with an old friend (who is also a rival kendo instructor) that his girls can beat the others at a kendo practicematch - the prize? A years worth of free sushi. Not the best sounding prize - but a prize none the less.  That aside, there are other &quot;mini stories&quot; that take place during the episodes as well. Incidentally, at the very beginning there's only 1 member in the kendo club - so, the first two episodes is taken up with the hilarious undertaking of recruiting new club members. They even end up with 2 male members (despite sensei's pleas to only have female members... the dirty old lech &gt;__&gt;)  What goes on beyond episode 10 is unknown to me... so, I suppose that this is all I can say about the story - and it's probably why it only got an 8.  Once I've seen more episodes - this will probably be reviewed also.  And also, the 5th member of the kendo team has yet to be recruited.  So, at the moment there are only 4 female members of the squad.\\n\\n\r\nCharacters\\n\r\nThis anime is pretty creative when it comes to the characters - it almost always remains refreshing. And it basically keeps the viewer watching. From the cute little Tamaki-chan who absolutely adores anime (almost reminds me of Konata from Lucky ☆ Star), but lacks some social skills - to the rather psychotic, but beautiful Miya-Miya who shows her &quot;black&quot; side.  Then there's Saya - who can be over dramatic at times, but it all adds to he charm.  Team captain Kirino appears to be the sensible one - often taking over from the instructor during training.  However, both Kirino and Saya make a rather decent comedy duo in some episodes.\\n\\n\r\nSound\\n\r\nI can't help it! Bamboo Blade has a very catchy opening theme song (which is actually performed by some members of the cast) - as well as a pretty sweet closing theme too (which is also sung by the cast). This is one of very few anime where I don't immediately click on &quot;mute&quot; when it comes to the openers and the closers... so, for me it's a win win soundtrack.  Ok, so I have the songs on my iPod... there are you happy now?! &gt;__&lt;  No, seriously - I really do like the themes.  The only other theme that I openly like are the openers for Gunslinger Girl and Higurashi no Naku Koro ni.\\n\\n\r\nConsidering that I've only watched 10 episodes so far - I can quite happily say that I am immensely enjoy watching Bamboo Blade. It's definitely one of the best that I have watched (in the comedy genre) and am quite proud to place it on my favourite anime list.",
            "date": "2008-05-11T02:51:00+00:00",
            "helpful_count": 14,
            "mal_id": 4652,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/32105.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Akaike",
                "username": "Akaike"
            },
            "url": "https://myanimelist.net/reviews.php?id=4652"
        },
        {
            "content": "Overview\r\nIt's surprising the amount of insight Bamboo Blade's silly, gag oriented characters provide on the passion for and the meaning of Kendo. Even more unthinkable is the lack of ecchi in a high school girl oriented cast clearly aimed at males. Bamboo Blade is full of wonderful surprises, but the repetitive comedy and weak action elements do nothing to fill in for its uneventful plot.\r\nSynopsis\r\nAn unambitious teacher is the supervisor for Murota school's Kendo club. Throughout the years, his club has been whittled down to one hard working and devoted girl, Kirino, who loves the sport but is miffed that her teacher is always solazy. A drunken wager with the teacher's former classmate stakes a full year of free sushi on an exhibition girl's Kendo match, and with this, he is suddenly gung ho about whipping his club into tournament shape, to the delight of Kirino. He pursues ex-members and a new child prodigy, Tamaki, to fill the ranks, and in the process, revives his old flame for Kendo.\\n\\n\r\nStory & Characters\\n\r\nThe most striking element of Bamboo Blade is how realistic and poignant, yet varied the characters' feelings towards Kendo are. Azuma, a member of the home Kendo club, adores it as a part of herself and a passion she's held since youth while Kirino enjoys the camaraderie it builds. Each of the main characters find a unique and believable relationship with Kendo, and even some of the minor characters shed words of wisdom. Most of the action elements also follow in this vein of realism. Even though many of the characters improve their skills, it's far from a \"powerup\" scenario. For instance, one of the home members has markedly wonderful aggression, but little skill and focus. Instead of taking the typical shounen route that would have transformed her into an unconventionally powerful prodigy, her lack of focus is a crippling handicap throughout, rendering her unable to win any matches. Just as in real life, the focus and skill is only be attained through painstaking practice along with multiple frustrating failures.\\n\\n\r\nIt's a little too bad that the series revolves around the tiny prodigy, Tamaki. She's a robotic character with her desire to emulate the naive heroism of her favorite Anime characters as her only displayed emotion throughout most of the series. Though she does undergo trials towards the end that expand her emotional range, her completely inhuman nature for the rest of the series had already sabotaged any possible empathy from the viewer. Unlike the other characters, Tamaki's Kendo skill goes beyond the bounds of believability; she is essentially invincible. To a lesser degree, the other characters are similarly simple caricatures for a majority of their screen time, but when Kendo gets involved, their genuine elements come through. Only when they reveal their relationship to Kendo are they not generic, run of the mill anime characters.\\n\\n\r\nMany of their gags are funny for the first time, but each character has no more than 1 or 2 that repeat, and by the end they become clockwork. Interestingly, the action is often skipped over, either with a simple still screen, or just an announcement of a winner with no visuals at all. The tantalizing bit of Kendo we see animated ranges from excessive still screen usage to beautiful and accurate animation that captures the explosive, almost spastic nature of the matches. Still, even when the matches are just glanced over, we get the primary reward we desire in the reaction of the characters. Their genuine passion for the sport makes me feel their elation when they win, and their heartbreak or frustration when they lose. Watching the characters express themselves in the context of Kendo is compelling, but I didn't care a lick for the rest of the plot. All the minutia that's supposed to give added weight to the results of the matches, which is the free sushi at first, and then eventually the teacher's job, is a boring filler of screen time\\n\\n\r\n--\\n\\n\r\nBamboo Blade is certainly far from a generic, power up sports Anime, but that novelty alone doesn't make it compelling. It's a drag to sit through at times, but the unmatched insight into Kendo, or perhaps competitive sports in general is worth wading through the other junk.",
            "date": "2009-09-18T18:44:00+00:00",
            "helpful_count": 8,
            "mal_id": 18906,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230526.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ace52387",
                "username": "ace52387"
            },
            "url": "https://myanimelist.net/reviews.php?id=18906"
        },
        {
            "content": "In many ways, this is similar to pretty much all sport related animes : A team needs to be built; there are problems; protagonist is beated but comes back fighting and everyone manages to prove themselves and of course, the standard \"club will be closed down unless something is done\"\r\nYet, there are a fair few unique things here - aside from being about Kendo, of course - the main one being is that the Kendo practitioners do lose often.  The story is quite gripping up until the end (with a little bit of a twist too), as you do feel for all the characters,especially Miya-miya.  However, there are a few irritating characters (namely Dan-kun), presumably designed to contrast with Miya-miya\\n\\n\r\nThe animation is fairly good with pretty decent 3D for such an old series, with both pretty good title and credit music.\\n\\n\r\nNo doubt you'll get more out of it if you a versed in Kendo, but even so, it is certainly exciting enough to watch to the end.\\n\\n\\n\\n",
            "date": "2018-03-04T10:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 273021,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962652.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sku_Te",
                "username": "Sku_Te"
            },
            "url": "https://myanimelist.net/reviews.php?id=273021"
        },
        {
            "content": "I believe a good sports anime should be able to make the viewer enjoy the anime even if they have little knowledge about the sport. Bamboo Blade manages to do this by making the characters the driving force instead of heavily focusing on the sport itself.\r\nThe plot is pretty simple, which is basically a school comedy revolving around the kendo club, they practice, go to tournaments and recruit new members along the way. Although the plot is simple, it also works because of the characters. The series is light hearted and has a fairly large amount of comedic moments which are actually pretty funny. Thepace is also just right for this kind of show. Other than there is nothing really spectacular about the plot but for this kind of show, it doesn't have to be.\\n\\n\r\nLike I mentioned before, the characters are what drives this series. Each character has their own very unique personality (for example Kirino is very energetic but also very responsible and very caring too) and they are each explored very well. All the main characters also develop a lot during the series (such as a Tamaki opening up more) and by the end of the anime, each of the characters have grown in different ways. The chemistry developed between the characters is also unmatched by most. Each character is likable and most of the comedic moments work because of them. Without the amazing characters and development, this anime would just be another average anime with nothing memorable about it.\\n\\n\r\nThe art does have it's fair share of good and bad moments, the backgrounds are detailed and generally drawn pretty well but colors don't really scream out. Also many of the hits look the same in the kendo matches.\\n\\n\r\nThe sound does a very good job. The opening and ending really fits the kendo theme and the voice actors do a really nice job with each character.\\n\\n\r\nLike many other series out there, not everyone is going to enjoy it. If you are looking for intensity and a complex plot then this genre as whole is probably not for you. However if you are looking for a good comedy, this more than holds up it's end of the bargain, as this series will have you laughing in a lot of places.\\n\\n\r\nBamboo Blade shows that unique and well developed characters can really push a series far. Even though the plot is very simple and isn't great, as a whole, it really delivers.",
            "date": "2012-07-23T16:49:00+00:00",
            "helpful_count": 7,
            "mal_id": 67499,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=67499"
        },
        {
            "content": "When people read the synopsis for this show, this is probably the most common reaction: \"An anime about Kendo? This must be sooo boring!\". That is what I thought at first as well, but when I really got to watching this show I'd have to use one of the biggest clichés ever to describe it.. Don't judge a book by it's cover.\r\nBamboo Blade was really special for me, because I was feeling kind of down when I started watching it, the reason being that I had just finished \"Code Geass: Hangyaku no Lelouch R2\" and I loved that show so much that I actually felt\"the void\" afterwards. For those who do not know what the void is, it is basicly a kind of feeling you can get when you've finished a really good show, and this feeling makes you kind of \"empty\" inside. You feel like you're never going to experience anything like that show ever again. While I was feeling the void I could not enjoy anime, and thus I ended up putting tons of shows on hold. I guess that most people can see where this is going, so I'll just wrap this little story up quickly: Bamboo Blade cured my void. It was that enjoyable, and after finishing it I felt like I could enjoy anime to it's fullest.\\n\\n\\n\r\n---STORY (7)---\\n\r\nThe story is very simple, but yet so gripping. It's simplicity is kind of what makes it shine, because it enables other elements to show really well. The story is about the Kendo teacher of Muroe High School, who happens to be almost completely out of cash. He can't even pay for his own food, and thus he rarely eats anything at all. But one day his old friend and senpai makes him a seemingly unreal deal: free sushi for a whole year if his kendo team can defeat his senpai's well trained warriors. He accepts and there the search for members begins.\\n\\n\r\nAs much as I love this kind of story that leaves so much open for further events, I'd still have to say that the idea itself is not all that original or in any way fantastic, it is just ok. It is rather how the story is presented that makes it truly sparkle. The already existing team captain Kirino Chiba and the teams sensei(who for the record is called Toraji Ishida) provide a whole bunch of funny moments while searching for members, but I will talk more about this duo when I get to the characters.\\n\\n\\n\r\n---ART (8)---\\n\r\nThis is what first got me interested in the show. I was showed a few scenes from the show through a certain reviewer on Youtube, and I immediately fell in love with the animation they used. The animation is not all that amazing, but it has a certain charm to it that made it hard for me to look away.\\n\\n\r\nIt is has a lot of detail, and it doesn't use many different shades of a color, but rather uses a few, much more noticeable variations of certain colors.\\n\\n\r\nThe animation, just like the story, shines thanks to it's simplicity. It just fits the show really well, and that makes it easier to concentrate on what's happening while watching.\\n\\n\\n\r\n---SOUND (7)---\\n\r\nWhile the soundtrack for this show is not amazing on it's own, it does fit the show really well, so I gave it the score 7. It was good for this certain show, but nothing more. Also the sound effects used when the swords hit and stuff like that fits really well.\\n\\n\r\nI watched Bamboo Blade dubbed, which to a lot of people might be a weird thing to do, but the dub was really good. All of the voices fit their characters personality and the voice acting itself was very well executed. I have heard some of the japanese original, and it sounds pretty good as well. I think that either would work, so if you prefer dubbed anime, go for that. If you prefer subbed anime, watch the japanese version.\\n\\n\\n\r\n---Characters (7)---\\n\r\nAll of the mains characters are really good. They each have their own personality, and when you combine them they all group so perfectly together in different ways. The only character that I ever had a problem with was Danjuuro Eiga. Not his personality, but rather the way he looked. His character was designed in a totally different way than the others, and that felt really weird and distracting.\\n\\n\r\nThe first two members of the kendo team were, as previously mentioned, the team captain Kirino and the coach Mr. Toraji Ishida. These two characters are with you from the start, and they really compliment each others personalities well. Other than those two I won't mention the names of the other team members, as they can be considered spoilers for some people.\\n\\n\\n\r\n---PERSONAL ENJOYMENT (10)---\\n\r\nAs I mentioned at the start of this review, this show was really enjoyable for me. It brought me a lot of happiness and I really can't find anything to complain about when it comes to this part. It just fulfilled it's purpose perfectly for me, and hopefully it will do the same for you if you deside to give Bamboo Blade a chance.\\n\\n\\n\r\n---OVERALL (7)---\\n\r\nBamboo Blade is a light hearted show of very good quality. It may not be for everyone, but if you like kendo, or just want a good comedy/action show to watch, then you should definitely watch this anime!\\n\\n\\n\\n\r\nThanks a bunch for taking a look at my review! Feel free to tell me what you thought of it, and please rate it with either \"Helpful\" or \"Not helpful\" depending on what you thought.",
            "date": "2013-12-31T23:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 126595,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2419091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SirAbblot",
                "username": "SirAbblot"
            },
            "url": "https://myanimelist.net/reviews.php?id=126595"
        },
        {
            "content": "Lovable and interesting characters, passionate martial art, great humor and cat cameos. Bamboo Blade has it all.\r\nKendo instructor at Muroe highschool, Ishida, has a hard time to pay his bills, when his old friend and coleague offers to pay for his sushi for one whole year. That is if his team wins at a friendly tournament. If only there were more than one loyal captain and the other that has not showed up in a while. To win, he would need a miracle. A big miracle. A miracle that, say, easily deflects dangerous stray tennis ball. And baseball... aaand a rugby ball. And principal fallingfrom the third floor back up. With a broom.\\n\\n\r\nDo you like kendo? Well this anime is for you! Do you at least know, what kendo is? You might enjoy this series. Have you got absolutely no idea what that thing even is? This show may entertain you anyway. Maybe you will even grow to love this honorable yet energetic art.\\n\\n\r\nI recently watched Bamboo Blade second time after not having seen it in a long time. And I enjoyed falling in love with both kendo and splendid characters. Enthusiastic and always cheerful captain Kirino is my most favourite, although I realized that her bestie, passionate but often distracted Saya is my spirit animal (or should I say anime - AHAHA... maybe I shouldn't... ahem). Even though you are bound to have favourite characters, others are not far behind. Ethereal beauty, with the fierce beast inside her Miya-Miya, bespectacled Asuna, who is clumsy until she grabs her bamboo sword, then she is worhty oponent. An of course, brave captain - tiny and quiet Tamaki, who beats teachers in one blow and then goes to get a bento lunch.\\n\\n\r\nTheme of this anime is not only kendo, but love for anything that you do with passion and for the good reasons. Something that you and your friends can enjoy. It also has great character development and the action scenes, man should I even start. It those moments where there is silence between crucial blow and referees resolution that makes your breath stop.\\n\r\nAnd finaly humor has all the good anime stuff, super deform, cats and some meta jokes and fourth wall breaks.\\n\\n\r\nI hope you enjoy this show as much as I did. It is one of my favourite. I even love trailer made by funimation. Watch it, have fun and never give up :D",
            "date": "2015-11-16T11:09:00+00:00",
            "helpful_count": 7,
            "mal_id": 203486,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HotaruMari",
                "username": "HotaruMari"
            },
            "url": "https://myanimelist.net/reviews.php?id=203486"
        },
        {
            "content": "Watched this back in 7+ years and rewatched last year, decent anime where you can have light laugh. I watched this dub twice 0 sub, just because I watched it dubbed when I was younger. If I rewatch it again maybe sub, but don't want to.\r\nStory at a school, with a kendo club struggling to get members, meeting the strongest member, convincing her to join eventually joins. The instructor which shortly later on has a fight with the principals wife, when they both back up. They had some fight already before hand or was it 2.\r\nThey do get enough female members which they can usefor spars and or for the championship.\\n\r\nThe op is pretty good also the ending song is good.\\n\\n\r\nThe anime also show some daily things they do and show there hobbies. Them having jobs or an interest in things. We do meet a rival who has the same interest as the best kendo girl. There is an episode where they are in a movie.  There is a good amount of comedy and there is a yandere girl also, but not to where she will kill anyone just hurt them I guess emotionally. The anime does end at a cliffhanger where there is another rival introduced where you have to read the manga. Just google for the chapter.\\n\\n\r\nStory-8\\n\r\nArt-8\\n\r\nSound-8\\n\r\nCharacter-8\\n\r\nEnjoyment-8\\n\r\nOverall-8",
            "date": "2019-01-12T21:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 298880,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4906592.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lord_Valzin",
                "username": "Lord_Valzin"
            },
            "url": "https://myanimelist.net/reviews.php?id=298880"
        },
        {
            "content": "Story: It was pretty much like every other school anime. Characters do something for a few episodes and then move to something else. Blade Braver was a great way to add some feeling of a on-going story.\r\nArt: The animation was not anything special and was pretty much like most other anime. The drawing style and colors won me over.\r\nSound: Soundtrack was good. Voices were good. Opening and ending themes were good. I'm not complaining.\r\nCharacter: I liked the characters, well most of them. Tamaki was just super cute, she was the reason I began watching this show. Kirino was an awesome character too. When she'd getsad, you knew something was seriously at miss. I seriously wanted to kill Dan-kun, but I believe that was the original purpose of this character anyway. That american chick messing with Miya-miya seriously also annoyed me.\\n\\n\r\nEnjoyment: I enjoyed this show. Full of comedy and an occasional touch of epic. Girls screaming men, do and kote was kinda awesome. They also managed to put some good drama here and there.\\n\\n\r\nOverall: Very shonen. Surely anyone into sports or school anime will get something out of this show.",
            "date": "2008-04-10T03:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 3840,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24435.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lovekuja",
                "username": "Lovekuja"
            },
            "url": "https://myanimelist.net/reviews.php?id=3840"
        },
        {
            "content": "Have you ever had an empty feeling after watching a good anime? Well that's what happened after i watched Bamboo Blade.\r\nIn my country or at least in where i live, there's no clubs in high school, so i'm always exciting to watch series about everyday life in a school club and this show surely delivered it. A very well-executed anime from the start to the very end.\r\nIn 26 eps long, Bamboo Blade has got it all what you would ever see in an sport, slice of life gerne: the school life, the hardwork, a little drama, a little romance, the will to overcome hardness, thesportmanship... of everyone in the kendo club of Muroe High School. A inspirative story along with a colorful girls cast.\\n\\n\r\nThe artstyle of the show reminds me of the midway 2000s with some moe elements that makes the show very easy to watch, great to see something old but gold. The music is rather normal, op and ed is pretty good.\\n\\n\r\nI think Bamboo Blade is a good show to kill your boredom. Why not give it a try? You can thank me later.",
            "date": "2015-07-10T06:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 192870,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489573.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/johnbradshaw",
                "username": "johnbradshaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=192870"
        },
        {
            "content": "Av: Um...what's with the wiffle bat?\r\nNK: Hm?  Oh, hey Avon.  Just practicing my kendo swing.  I just finished watching Bamboo Blade\r\nAv: Oh...right.  How was it?\r\nNK: Fantastic.  Though it was informative, kinda like Hikaru no Go, it was really enjoyable because of the characters.\r\nAv: Take it that's what you liked best, then.\r\nNK: Yeah.  The plot was pretty good, and the music was good too.  The characters really define the series, though.\r\nAv: From the looks of it, it's all female.\r\nNK: Nope.  Though the series is focused on the girls' kendo team, male characters are present and are actually prettyimportant to the series.\\n\r\nAv: How so?\\n\r\nNK: Well, the main kendo instructors are all male.  Then there're the two seniors who play as antagonists in a couple ways.  Plus, the two freshmen boys who join the club actually have a bit of character development themselves, and one of them acts as both a supporting character and a protagonist.\\n\\n\r\nAv: I take it one of the females is your favorite, though.\\n\r\nNK: Yeah.  For a while, Tama-chan was my favorite character: the hero for justice and all that.  In retrospect, though, I've chosen Kirino.  She's described in the series as being \"the pillar of the kendo club\", and she could probably be described as the pillar of the series, too.  A lot of the humor involves her, and a good amount of the suspense is placed on her shoulders as well.  It's difficult to find a character like that that still has a great supporting cast.\\n\r\nAv: Why don't you give a dissertation next time?\\n\r\nNK: Sorry, I just haven't found a character like that in a long time...\\n\\n\r\nAv: Anyway, think I should take a look at it?\\n\r\nNK: Definitely.  Granted, there are some cutesy parts...\\n\r\nAv: I'll be sure to have a bucket handy.\\n\r\nNK: It's not that bad.  Just girls being girls, like any slice-of-life anime out there.  If you're interested in kendo, Bamboo Blade is a great starting point.  I think you'd like it because you like traditional japanese swordplay.  Kendo was used as training in the feudal age, if I recall correctly.\\n\\n\r\nAv: Right.  Well, I'll let you get back to...whatever it was you were-\\n\r\n*smack* *pop*\\n\r\nNK: Aw, curses...that was the light bulb, wasn't it?\\n\r\nAv: Yup.  Good thing that bat's plastic, huh?",
            "date": "2010-03-24T09:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 24276,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/227213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NinjaKirby1322",
                "username": "NinjaKirby1322"
            },
            "url": "https://myanimelist.net/reviews.php?id=24276"
        },
        {
            "content": "I would like to preface this by saying that I've never even heard of Bamboo Blade, let alone watched it.\r\nBamboo Blade is a comedy that comes around only once every very often. Let's face it, you've seen all of this before: Broke teacher looking for a quick fix to his problem, lovable cast of female characters who just want to train in kendo and have a fun time, all wrapped up in a comedy school setting. By no means is it anything new in the anime world, but it is still a wholly charming and fun little show.\r\nStory:\r\nHonestly, the story isn't all that fantastic. It'svery predictable and cliche, and while that isn't bad, it certainly won't win any awards. I think it's best to just accept that the story is just a setup for the truly great cast of characters to interact in, rather than a driving force for the anime.\\n\\n\r\nArt:\\n\r\nCharacter design is fantastic in Bamboo Blade! Each and every character is immediately recognizable and really left a deep impression on me. I still can't look at Kirino's face without smiling, what a beautiful character. Animation is surprisingly good, you can tell that while they knew this wasn't making any major leaps in the world of anime, the animators were dedicated to their work and wanted this to look really nice, and honestly, my hat's off to them. Well done! I'd also like to point out the lack of ecchi - there were a lot of times in this anime that could have focused on cheap panty shots and questionable ecchi situations, but it did a good job at not offending me at all. \\n\\n\r\nSound:\\n\r\nThe soundtrack to the anime is kind of weak, but it makes up for it with the fantastic voice acting. Both the English and Japanese versions are very well-done, although I prefer watching in Japanese with subs. All of the voice actresses really capture the style of the anime very well, from the comedy scenes to the more serious ones, I was captivated the whole time by their voices.\\n\\n\r\nCharacter:\\n\r\nAnd here's the major selling point of this anime. Really, when it comes to writing characters, there's nothing more frustrating than a good character that has poorly-written interactions with other characters. Bamboo Blade doesn't have this problem though, as all of the characters are well-written and enjoyable, but also their chemistry is superb and all of their interactions really make sense and contribute a lot to my enjoyment of this anime.\\n\\n\r\nIt may be a pretty typical style of anime, but that didn't keep me from thoroughly enjoying it. I would recommend this to anyone who wants a nice, fun anime to sit back and enjoy. \\n\\n\r\nSo, now that I've finished this review, I've decided it'd be a good idea to actually watch Bamboo Blade and see if it matches up with my review.",
            "date": "2013-07-08T13:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 104435,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2432847.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaiiroTama",
                "username": "HaiiroTama"
            },
            "url": "https://myanimelist.net/reviews.php?id=104435"
        },
        {
            "content": "Hate to be that guy, but I think this show is absolutely overrated.  Why is the score so high? \r\n Is it funny?  No, not in particular, I can't recall actually laughing once throughout the entire 26 episodes—maybe at best a smirk? \r\nAre the characters really all the great?  No, they aren't that in depth, and many of them are naively annoying!.  \r\nIs the action superb? Far from it.  I doubt kendo in real life would even be very enjoyable to watch.  This isn't a real sword fight... It is with sticks.\r\nThe one romance in the show, they blatantlymake fun of because it is so absurd.\\n\\n\r\nBut what took the cake for me to rate this abysmal waste of time so poorly?  Episode 23.  That episode sums up the worthlessness of these characters.\\n\\n\r\nThis epsiode involves delinquents that never show up and end up potentially damaging the club.  They are bullies and terrible people, yet these fools contemplate protecting them!?!? WHY!?! I cannot understand this ignorant, naive notion.  THEY WEREN'T EVEN THERE FOR THE ENTIRE YEAR, YET STILL CONSIDERED PART OF THE TEAM?!!? HOW????? This show was not great until this episode, but this absolutely RUINED any small trace of passable this anime had left.  Naive characters are NOT cute, they are ANNOYING—and this is a PRIME example of it.\\n\\n\r\nAlso, Tamaka getting mad at him for taking the tall stance to get her practicing better against it.... And she says \"I don't appreciate the joke...\" WOW, be grateful Yuji is trying to help you with something you suck at!\\n\\n\r\nAND the way the \"sensei\" talks all low and slow IS SO GD ANNOYING!\\n\\n\r\nThis anime panders to weak emotional strings, with a naive attempt, and an annoying cast of characters.\\n\\n\r\nBottom-line: if you don't like sappy, unnecessarily long-drawn out animes—then don't watch this.",
            "date": "2016-12-01T07:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 234700,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5224341.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/blaice",
                "username": "blaice"
            },
            "url": "https://myanimelist.net/reviews.php?id=234700"
        },
        {
            "content": "An anime about a kendo club in school. When I first saw the name and read a synopsis of Bamboo Blade I wasn't too sure about it. I was no really fan of sports anime and I thought it was just another one of those which were shown here in TV. A friend of mine asked me to watch the first episode together with him and I'm quite glad that I did it. I really enjoyed this warm and heartfilling anime.\r\nStory: To be true there isn't that much story in this kind of anime. The girls go to school, practice kendo and participate in kendotournaments. So far there is nothing special about it. The way that rather stereotypical story is told is ok though. The fact that the story is negligible doesn't make this anime bad. Imho anime like Bamboo Blade don't really need a good story to be entertaining.\\n\\n\r\nArt: The animation of Bamboo Blade is good just as expected from an anime from 2007. The character design is cute and fitting, the backgrounds are drawn well , the kendo matches are fast paced and quickly over. Nothing like other sports anime where running scenes for example are way too long and you can see the earth curvature while the characters are running over the sports field. \\n\\n\r\nSound: Imho the strongest part in Bamboo Blade was the OST. With \"Bamboo Beat\" and \"Star Rise\" Bamboo Blade has  rather usual opening songs/ending songs vocaled by the female seiyuu crew which actually did a good job in voicing the characters, imho they all fit. But the best thing about the OST is the BGM. The BGM of Bamboo Blade is full of fast paced drums which fit the atmosphere of the kendo matches. On the other hand there are also slow paced songs without drums which fit the more laidback atmosphere when the girls are not doing kendo.\\n\\n\r\nCharacter: The characters in Bamboo Blade are all very likable. They are not as flat as in other sports series because they all have other unique character traits besides loving kendo and you actually get to see it even though the anime shows about 70-80% of the time the girls in kendo practice or kendo matches. \\n\\n\r\nEnjoyment: I really enjoyed Bamboo Blade because of it's atmosphere which was calm and nice in the non-fighting scenes and fast and quick in the battle scenes. The comedy part of this series is also quite good. The girls are all moe. It's a good anime to watch when you want to watch something where you don't have to think too much about what actually is happening and you want to lay back and relax.\\n\\n\r\nOverall:  Bamboo Blade was an quite refreshing anime, easy to watch and simply just nice. I highly recommend Bamboo Blade for people who like sports anime, school life anime and comedy anime ... Other people should also give it a try.\\n\\n\r\nOne last personal thing: I am sorry for my poor grammar and vocabularies but English is not my native language and so I had some troubles writing a longer text in this language.",
            "date": "2009-04-15T23:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 14198,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109438.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/An00biz",
                "username": "An00biz"
            },
            "url": "https://myanimelist.net/reviews.php?id=14198"
        },
        {
            "content": "Ok if you are reading this review please listen this is very Enjoyable (AT FIRST) when u reach ep 20-22 it gets really boring \r\nHonestly i watched lots of anime and i wasnt/arent impressed with this one \r\nNo seroius plot No Interesting fighting scenes\r\nThey just show u kendo NO ACTION \r\nThey keep repeating moves\r\nAnd i rated the sound 4 Cause they keep screaming like bitches Every freakin Minuate of the anime\r\nOverall its something u watch when u got nothing to watch while youre eating not an anime u watch For fun only!!",
            "date": "2008-10-14T09:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 8697,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91746.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lonareas",
                "username": "Lonareas"
            },
            "url": "https://myanimelist.net/reviews.php?id=8697"
        },
        {
            "content": "If you want to watch an anime that would leave you feeling warm, happy and heartfelt, look no longer!\r\nThe story line isn't as exciting, but the character and the development of the character was lovely and charming. Full of light hearted and charming sense of humour, that would leave you smiling. \r\nThe art work is decent. The setting of the dojo brings a traditional theme into the modern school setting, which is nice to watch. \r\nI strongly recommend this anime. It is one of those anime that would leave a smile when you finish it :)",
            "date": "2015-02-28T19:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 181416,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rlam86",
                "username": "rlam86"
            },
            "url": "https://myanimelist.net/reviews.php?id=181416"
        },
        {
            "content": "I'd be all personal about it and say it's DA BEST THING EVARRR!!!! and give it a 10 across the board like a typical MAL fa...uh, not-so-objective member. But then I'm simply not that type.\r\nSTORY\r\nPretty simple premise: guy in charge of the club looks to make a group of kendo chicks to compete with his ex-kendo mate's team, so that he can have a shot at his buddy's promised reward: free food for a year.\r\nNot terribly exciting, and the way the teacher just manages to put together a team of skilled kendo experts screams plot device. Plus the couple of filler episodes distract from themain storyline, and not at the best times either.\\n\r\nStill, having a simple plot means there are no big plotholes to drop your balls over, and the progression in the story is for the most part smooth.\\n\\n\r\nART\\n\r\nThe main weakness of this anime. The animation quality is at best functional, and at worst, obviously flawed and jarring. It gets readily apparent that the studio had typically thrown its budget at the first episode; the quality degradation after that is obvious, with many features out of position, and the background detail a bare minimum. Fortunately it does pick up a bit near the end (as expected).\\n\r\nThe designs aren't very eye-catching (with the notable exception of the oh-so-moe Tama-chan), but the characters have been drawn very distinctively, with no chance of mistaking a person for anyone else.\\n\\n\r\nSOUND\\n\r\nFunctional. The OP/ED is typical, and the BGM (a decent if apparently hackjob-style effort) doesn't vary much.\\n\\n\r\nCHARACTER\\n\r\nHere the anime really shines. Every character's personality is distinctive, refreshing, and surprisingly believable, the chemistry is great, and the voice acting is also excellent. The character development, while skimpy for most characters except 2 (the only markdown here) is sufficient to endear one to the characters.\\n\\n\r\nENJOYMENT\\n\r\nThe whole ride was fun. Even though the story wasn't exciting, and it looked to be going nowhere at times, I found myself looking forward to the amusing interactions of the kendo club and its happenings. The down-to-earth and (mostly) realistic tone of these interactions (with the exception of Miya-Miya and the two side characters related to her) really drew me in, and at the end of every episode I found myself in better spirits. \\n\\n\r\nOVERALL\\n\r\nThe animation was comparatively plain bad, the music was forgettable, and the story wasn't great. But these glaring errors somehow were little more than side distractions in a wonderful viewing experience with the amazing characters and chemistry. Certainly worth a watch.",
            "date": "2008-07-13T01:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 6226,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19199.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GrimaH",
                "username": "GrimaH"
            },
            "url": "https://myanimelist.net/reviews.php?id=6226"
        }
    ],
    [
        {
            "content": "I don't always watch sports anime but when I do, usually the first few episodes are deciding factor on whether keep watching or not. Bamboo Blade is one of the anime's that has hooked me in and didn't and kept me going until the very end, but that was just my experience.\r\nStory/Character:\r\nThe story about a high school kendo club that is mostly comprised of girls, I won't get to much into details but despite have a few male members in the club the story mostly centers around the girls but there really isn't a main character as the focus of the show tends to shiftfrom one character to the other.\\n\r\nNow being a sports anime the plot isn't the most complicated thing in the world and is pretty straight forward and the characters are probably the main meat of the story aside from the kendo (sword fighting) matches. For the most part the characterization and character development are pretty good but aren't perfect. \\n\r\nI feel like they could have went into more detail about some things, especially the kendo matches which really help move the characters along, the characters really change but a lot of the girl's matches are summed up in a quick 2 second transition on whether they won or lost which was a big deal for them, and I would have liked to actually see the all fights in more real time and it also would have been cool if they had actually broken down some of the strategy and the techniques they used during the matches and they could have also emphasized some of the work and training they characters had to go through and make the stakes for each fight feel as high as they actually were.\\n\r\nHowever that is really the only complaint that I have about this show and even after having that said about the kendo matches and such fights are still entertaining and there really isn't to much wrong with this show.\\n\r\nThis anime isn't a 110% super serious show and it does have is laid back moment of comedic relief and slice of life but over all it's relatively well balanced.\\n\\n\r\nArt/Sound:\\n\r\nI don't have much to say in this category other than the art wasn't bad but I have seen better and to be honest the sound track was kind of forgettable, though there were moments where I wanted to replace some of the soundtracks with that of Hajime no Ippo; another sports anime about boxing but that's just me.\\n\\n\r\nSub/Dub:\\n\r\nYes there is an english dub and compared to it's subbed counter part, I could care less about which one you watch, granted I have my personal taste but to be critical here, I can't really say that one is better than the other at this point, however I will say that the dub pretty solid with no awkward moments within dialog that I tend to find in other dubs and the voice acting was passable and I didn't have any problem with it. As for the japanese voice acting, well I don't have much to say other than it sounds like a the vast majority of anime in japanese and I wasn't particularly moved by it, but for this anime I could care less which version you watch.\\n\\n\r\nFinal verdict:\\n\r\nOverall I would rate this as an 8/10 and I think it's worth a try.",
            "date": "2014-12-22T10:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 173645,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3868083.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mothmonsterman",
                "username": "Mothmonsterman"
            },
            "url": "https://myanimelist.net/reviews.php?id=173645"
        },
        {
            "content": "The show is enjoyable, but his overall takes its time [in other words, a little slow]. That's not meant as criticism as I often like slower paced shows, just be aware that, despite being about kendo, this isn't a driving action series. It's more about the 5 girls, their teacher, and the 2 guys that are part of the high school kendo club. I especially like the fact that the characters, particularly the boys, are NOT the usual Anime stereotypes, and obvious \"potential romantic connections\" don't occur, which is good. I think there could've been a lot more character development, but it's still a goodseries and has several very memorable characters; which is more than I can say about a lot of shows. The show also is appealing because it avoids silly panty shot [fan service] type scenes and other irritating clichés, which keeps the story on track and free of irritating nonsense. .... The show definitely grows on you, and I found myself disappointed when I reached the final disc because I was looking forward to more, which means its pretty good. The animation is good. They obviously had a budget, but I'd say the animation doesn't suffer. .... Overall an interesting story and I recommend it. I also recommend another series [a personal favorite] \"Princess Nine\" which is also a particularly well done high school sports Anime series. If I had not seen Princess Nine I probably would not have watched Bamboo Blade; and I can see that the genre of sports Anime can produce very good shows, which is surprising, because the general idea sounds awfully boring to me. But I'm now looking forward to renting more sports Anime series.",
            "date": "2014-06-10T12:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 146561,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3425797.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/jyagan0",
                "username": "jyagan0"
            },
            "url": "https://myanimelist.net/reviews.php?id=146561"
        },
        {
            "content": "Kendo: meaning “Way of The Sword”.\r\nDefinition #1: A Japanese form of fencing with two-handed bamboo swords, originally developed as a safe form of sword training for samurai.\r\nDefinition #2: Kendo is a modern Japanese martial art of sword-fighting based on traditional swordsmanship (kenjutsu) which originated with the samurai class of feudal Japan.\r\nDefination #3: Kendo is a physically and mentally challenging activity that combines martial arts practices and values with sport-like strenuous physical activity.\r\nWith that being said, have you ever wondered what it was like to be in a Kendo club? Well, if you didn’t know what kendo was until now, the thought has probably never crossedyour mind. But after watching Bamboo Blade you might be more interested in this old time tradition.\\n\\n\r\nBamboo Blade is pretty much one straight forward anime. In the beginning Toraji Ishida (a politics and economics teacher, also known as the Kendo Club instructor of Muroe High School) and Kirino Chiba (a second year high school student in Muroe High School and captain of the Kendo club) begin their search for new members for their club. As the story progresses they get/met new club members and soon their journey down the road to becoming and elite Kendo team begins. There are small twists and turns along the way but its not just about kendo. It’s also about the characters lives and the problems or challenges each character has to get past so they can form an elite team. This anime will make you laugh and maybe even cry, its very cute. But sadly, It’s an anime that not everyone could get into especially if you like plot twists and a fasted paced story line. But if your looking for a fun slow anime with amazing/lovable characters, then Bamboo Blade just right for you.\\n\\n\r\nAs far as the art work goes, all the characters and scenery were drawn with a good amount of detail and the color scheme for the outfits and stuff wasn’t bad either. Mind you its not the best looking series out there, but hey if you get caught up in the story like I did you wont even notice. Plus, the cute characters and their facial expressions make up for it!\\n\\n\r\nMusic wise Bamboo Blade has a very catchy opening theme song and a sweet closing theme as well. The opening theme is definitely a song you will sing along to.  As for the background music (which is a soft violin during most of the series if memory serves) is a good mood setter. The character voices are awesome in Japanese and English! Best part is their voices aren't annoying (in my opinion).\\n\\n\r\nLastly the characters, they are truly the heart of the series. They have the best chemistry and amazing personality. The characters always make you laugh whether it be by a silly comment or just there facial expressions. They all grow very close to each other as the story progresses and by the end of the series you’ll truly see/ feel the beauty of the friendship they all share.",
            "date": "2012-11-22T02:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 78131,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1798013.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DeadmanAnarchy",
                "username": "DeadmanAnarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=78131"
        },
        {
            "content": "Let me start by saying that I was really looking forward to watching Bamboo Blade, having a passing interest in kendo(not exactly practicing it, but rather being curious about it), and I wish I could give Bamboo Blade a higher score than I have. Bamboo Blade has an amazing cast, great voice acting(seriously, the shouts are quite believable and they don't sound forced - and there's a lot of shouting in kendo) and engaging action sequences - with a memorably soundtrack to top it all off. However, it falls flat when it comes to character development and story. Half of the cast doesn't really changemuch in terms of personality - I'd go as far as to say that on occassion, some of the characters are completely ignored, appearing for a scene or two, which doesn't seem right if they are considered part of the main cast. What's worse is that this time is instead spent on possibly one of the duller characters - Tama, who sadly evolves into the protagonist of the show. Don't get me wrong, she isn't a bad character, but I feel Bamboo Blade had a perfect set up for a \"decentralized\" show, where each character was important, but midway they arbitrarily decided that Tama is to take 3/4 of the spotlight. All in all, as far as story is concerned, I feel like the team behind Bamboo Blade was figuring it out as they went - some plot decisions seemed odd to me, as if made in haste. I think this is generally a fine anime that had quite some potential, but made the wrong turns.",
            "date": "2017-08-12T09:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 255264,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AccDelete",
                "username": "AccDelete"
            },
            "url": "https://myanimelist.net/reviews.php?id=255264"
        },
        {
            "content": "Sorry for any mistakes. English is not my native language. The reason I'm writing this review is its genres. I don't think it's seinen or if it's seinen it's not like other seinens I watched.\r\nThe story begins with a kendo teacher who takes a bet and searches for some girls for a little tournament. It's too average in every aspect, it's not good or not bad until the last 10 episodes. The first part was really boring for me because the story is all about kendo and it doesn't give you much information about the characters. But I enjoyed the last 10 episodes if itlasted longer it might be a kendo version of Slam Dunk.",
            "date": "2018-12-26T05:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 296906,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2186711.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/erdem07",
                "username": "erdem07"
            },
            "url": "https://myanimelist.net/reviews.php?id=296906"
        },
        {
            "content": "I rate this quite high, not because it had a bunch of girls, but because it attracted me as a swordsman, and for my love of everything swords but also my love for the art and sport of Kendo.\r\nTo be honest though I was sceptical when I began watching this, because like most Japanese anime that included sports, normally liked to over exaggerate the characters abilities with sure kill techniques that cause explosions and lightening to appear.\r\nSo I was pleasently suprised when it turned out to be quite normal. \r\nThe story starts like most kendo anime, with someone practicing swings. the story basically centres around5 girls, who join the kendo club which had only one active member, the advisor which is a substitute or deputy teacher, is poor and always hungry (No money to buy food), he makes a bet with his old friend who is a kendo instructor at another school. that his team of girls can beat his team. The Prize a night of free Sushi.\\n\\n\r\nSo the story begins with the active kendo loving member running around with the teacher to search for potential applicants. and stumbles upon a Kendo master Shoujou. The story therefore begins...\\n\\n\r\nThe anime starts of slowly, but at a good pace, introducing the characters, and focusing on character development for them all. the action is precise and well executed, I find myself mesmorised by Tama's battle cry and TSUKI attacks.\\n\\n\r\nOverall it is funny, some scenes of romantic development, and growth into maturity. I hope you all enjoy it as much as I did.",
            "date": "2009-08-13T02:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 17719,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shintai88",
                "username": "shintai88"
            },
            "url": "https://myanimelist.net/reviews.php?id=17719"
        },
        {
            "content": "So first off, before I go into the review, I will mention that I actually do kendo; so while I will have a better understanding of kendo, it also means that I will be incredibly biased :D  Anyways....\r\nStory:\r\nI had to admit, the beginning premise is pretty lame.  Producing a championship caliber team of 5 girls just for sushi (yes, even sushi) is a pretty stupid plot.  Luckily, the story never really gets into that, and the story quickly progresses to how the girls form a team and overcome diversity.  I could have done with a little less of the blade braverscenes, which I didn't think really add much to the overall story (they could have introduced Rin some other way).  I also would have liked to see a little more from the dudes, who looked like an afterthought; especially since they seem to have hinted at Yuuji and Tamaki getting together.  From a kendo aspect, I would have to give Bamboo Blade a 9/10 since almost everything mentioned is correct: Nitto-ryu (the two sword style that Carrie uses) is a real style developed by the famous Miyamoto Musashi and is not allowed in most high schools.  Jodan no kamae (which Rin uses), is also actual technique that is very rarely used (as indicated in the anime), and finally tsuki (which Tamaki uses a couple of times), is also real, incredibly hard and illegal move in most high schools (since if you miss you end up skewering your opponent in the neck).  The one issue I had was in the ordering of the team, I'm not sure if it was a fansub error (Huzzah-Doremi) or the actual anime, but the actual ordering goes Senpo-Jisho-Chuken-Fukusho-Taisho, which wasn't how it was portrayed.  \\n\\n\r\nArt:\\n\r\nOverall, very good.  The characters all look different and are drawn with lots of detail, except for Eiga, though that might be for comedic effect.  Backgrounds are decent enough, tho I have to say I can't think of an anime with truly horrible backgrounds for a very long time.  The kendo scenes are drawn very well, equipment looks realistic and the characters move with a realistic feel.  \\n\\n\r\nSound:\\n\r\nOP and ED were catchy, but at least in my opinion not ipod worthy.  I did think, however, the seiyuus did a very good job, especially Tamaki and Kirino; while Tamaki's voice fell into the quiet-moe mold, Hirohashi Ryou actually put some feeling into it and created a character that truly stood out.  Kirino's voice on the other hand was just funny, which is good enough for me.  \\n\\n\r\nCharacter:\\n\r\nNothing really new about the characters, we have the beautiful evil girl (Miya-Miya), the leader (Kirino), the crazy good quiet moe (Tamaki), the super-talented klutz (Saotori) and the insane one (Saya).  But the characters do mesh very well together and it makes up for the deficiencies of the characters to create good chemistry between the characters.  For instance watching Kirino and Saya plot and scheme was like watching a manzai duo and the awkwardness of Tamaki and Yuuji together was a nice touch hinting at some romance.  \\n\\n\r\nEnjoyment:\\n\r\nNaturally, a kendoist watching an anime about kendo is going to give high marks.  I'm not sure how much this series would appeal to people not informed about kendo, but to those few who are crazy enough to actually do kendo, this was pure bliss.  Honestly, even if you liked the series, you probably are only getting 50% out of this anime, because there are subtleties that you have to be a kendoist to understand.  That isn't to say that people who don't do kendo can't enjoy this anime; but to those who do, join kendo and watch it again! \\n\\n\r\nOverall:\\n\r\nA very, very good anime.  I would definitely recommend this anime firstly to all kendoist, but secondly to everyone who enjoys a light-hearted high school anime which can be both hilarious and heart-warming when it wants.  Now let's just wait for the sequel!   \\n",
            "date": "2008-09-11T14:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 7862,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68072.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/diaho",
                "username": "diaho"
            },
            "url": "https://myanimelist.net/reviews.php?id=7862"
        },
        {
            "content": "I enjoyed &ldquo;Bamboo Blade&rdquo;, to me personally it was a good, solid anime series. While I do not think it really excels in any particular way, it's a nice series that is easy to watch and provides enjoyable entertainment.\r\nSet in a high school kendo club, it is mostly a school sports comedy that contains well known plot elements such as personal growth, changing yourself, achieving set goals, finding a purpose and keeping your spirit strong to overcome challenges.\r\nThe characters are not incredibly original but most are presented well enough. Throughout the main cast you have more typical characters such as Ishida the sloppy kendo teacherthat lacks goals and motivation, Tamaki the quiet and reserved girl that is a kendo prodigy, Yuuji the considerate and nice childhood friend, Saya the wild and outgoing girl, Azuma the shy bespectacled bookworm, etc...  \\n\r\nBut some characters do offer some surprise since their true nature is a juxtaposition of their overall image, Miyako, who first seems to be the polite beauty turns out to have a dark and aggressive streak, Azuma, who despite her bookworm looks and ways isn't a good student at all, Kirino, the seemingly air-headed and fun loving team captain is in fact always dependable, she is the very glue that holds the kendo club together.  I'm not sure if that's true as well of Tamaki, she's portrayed as also being a bit of an otaku, she is a huge fan of  &ldquo;Blade Braver&rdquo; (a fictional series that appears in this fictional series...) and even manages to have a small role in a &ldquo;Blade Braver&rdquo; movie, at which time she also meets Rin, who turns out to be a nemesis and a friend at the same time.\\n\\n\r\nSo despite characters that are not really original, none come off poorly, and throughout the series, the way they interact with each other in their kendo club, how they grow and change actually works out quite nicely and makes for one of the series' strongest points.\\n\r\nAs the main character, Tamaki's story is played out most, supported by the rest of the cast and her interaction with the others, she ends up carrying the series well. Despite her past, one doesn't really feel sorry for her or overly admires her tremendous kendo skills, but you still inevitably start rooting for her. Her plot evolution and character growth was also paced well, from the few revelations, challenges, setbacks, victories and people she meets and befriends. The other kendo club members also each go through changes and evolution, some more than others.\\n\\n\r\nThe bonds of friendship between the different kendo club members was nice to see. Especially Kirino and Saya's bond seemed quite strong, with some vague hints that there may be a bit more than meets the eye, especially on Saya's part. Or so it seems from one scene near the end, but that may just be wishful thinking.\\n\\n\r\nI was let down by the final episodes though. Several plot arcs are built up towards the final episodes, involving most major characters so one would expect quite a climactic ending, but most plots are concluded rather rapidly in barely a few scenes in the second to last episode, leaving the last episode to be one long epilogue of which the final scenes seem to hint at or provide the opportunity for another season to follow.\\n\\n\r\nAnimation throughout the series is good but not exceptional, the main female cast are all drawn very cutesy, plus they are well recognizable and different, from their physique, facial expressions, to hair style and colour. Which is a great plus as quite often you'll see them in full kendo gear, so it could have gotten quite tricky to recognize them. The style used for the character's eyes isn't one seen all too often too.\\n\\n\r\nThe overall soundtrack is not exceptional, it is just all right. I wasn't too fond of the opening or ending tracks though, not that they were bad, they felt like standard fare and the opening didn't especially make me feel excited about the coming episode.\\n\\n\r\nIn conclusion, while this series doesn't contain any extraordinary element, the overall sum somehow proves to be more than its individual parts and will no doubt be an enjoying series to watch for all.\\n",
            "date": "2008-07-15T11:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 6299,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Smithy",
                "username": "Smithy"
            },
            "url": "https://myanimelist.net/reviews.php?id=6299"
        },
        {
            "content": "I had completely ignored the sports genre because I watch live action sports and felt watching animated fiction was a waste of my time. Then I watched Crunchyroll’s anime academy of sports anime and was intrigued by the ideal of learning more about a given sport by watching an anime about it. Also, many years ago, I read a review of Bamboo Blade that made me want to watch it. So I finally did and wasn’t disappointed.\r\n    The first thing I want to point out is there’s no “supernatural” or fantastic fantasy elements to this series. They’re allnormal people with normal human abilities. And no one is innately good at a sport they’ve never tried or applies skills and abilities from some other sport, game etc. to the sport of kendo. \\n\r\n    The characters are diverse without being clichéd. They’re relatable and real, with a sense of real human emotions. Another shining point is the humor. It has it’s funny moments that are reserved for the appropriate time and place, without devolving into slapstick characteristic of a dedicated comedy. It was just an fun happy go luck show. \\n\r\n    As much as I enjoyed this series I do have my complaints. My first is the fact that Asuma doesn’t appear for half the series. She’s on the opening credits (which doesn’t change) but not in the first half of the series. This is a problem because she provides cohesion to the cast. There’s something missing without her, like a band with no bass player. Her contribution is minimum but when she arrives you realise what was missing. \\n\r\n    Also, it wasn’t as educational as I’d hoped. I wanted to learn more about the sport and did learn a little. Just not as much I’d hoped to learn. But it was fun, dramatic and funny and worth the time to watch. I also think it works as a gateway anime for people looking to get into anime.\\n",
            "date": "2016-12-21T13:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 236024,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=236024"
        },
        {
            "content": "As it is very obvious from the title, this anime tells a story about girls (and some boys) doing kendo. A sport anime, without a doubt, with a shounen feels embedded strongly in it. What does this anime tell us beyond “cute girls doing kendo”? The answer is....a journey.\r\nKendo is a journey to better our ownselves. Im not practicing kendo, but that sentece is just something that i re-wrote from what i saw in this anime. People may start kendo with small or even ridiculous reason, but after they get deep into kendo, they’ll be set off to an internal journey. Yes, a journey indeed,and journey means character development.\\n\\n\r\nCharacter development is, in my opinion, the strongest point that this anime has. I am not telling that the other aspects of this anime are bad. Nope. But if we watch from the start till the end, what we will feel first is about character development - like Tamaki’s development to find her reason swinging her shinai, as well as Miya Miya’s. And how Ishida sensei developed from uncool, egoistic teacher to a teacher that sacrificed himself for his students (in a way, that’s quite cool). Even the plainest character like Yuuji (this is not my opinion, this is the characters opinion in anime) had a subtle yet strong development in this anime. \\n\\n\r\nBy all means, these character developments aren’t the best case in anime world. But they are still something worth to note down in our mind and heart. These developments feel like embodiments of the soul of kendo itself, then manifested in many ways depending on who is doing the kendo. What i mean is one person way of sword differs from others. Each person has their own development in their own track, that what makes this anime so beautiful.\\n\\n\r\nSpeaking about other technical aspects, i think it’s good except for the sound part, specifically the choice of the seiyuus. Many characters have seiyuu that don’t fit with their roles. This case is pretty similar to Shokugeki no Souma’s and it can lessen the characterization of those involved. And also, this anime needs more chibi form :3\\n\\n\r\nFor the ending part of the review, i strongly suggest to try anime version and manga version of this title. Yes, they are different -  anime version and manga version differ quite great after the second half of the anime (and the second half of the manga). To put it simply, the anime version focuses on more shounen-ic vibe while the manga version focuses on what beyond kendo as a sport. \\n\r\nThe story writer, Masahiro Totsuka sensei, stated in the afterword of the manga that he hoped Ishida’s development would have an effect to the reader. I think his statement worth something to try, or at least, that’s what i did and i found it very amazing. So try to read/see both versions and compare which one have more effect in you ~\\n",
            "date": "2018-05-18T05:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 280847,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6744806.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tirta_Firdaus",
                "username": "Tirta_Firdaus"
            },
            "url": "https://myanimelist.net/reviews.php?id=280847"
        },
        {
            "content": "\"Bamboo Blade\" is based off of a Japanese comic of the same name.  While there are notable differences between the two - especially in Miya-Miya's case; she's a little more rough in the manga - the idea is the same: five girls are recruited into a desperate kendo instructor's dojo.\r\nTamaki is the strong, silent type (and an otaku), Kirino is lovable and carefree, Miyako has a dark side, Sayako becomes distracted with other hobbies, and Satori is a klutz.  There's Toraji the instructor, but he's a rather shallow character solely meant for comic relief, and the other two prominent male characters in thedojo only have supporting roles.  Needless to say, everything takes a back seat to the girls.\\n\\n\r\nThe only exception to that last statement is kendo, which is pretty broadly covered.  Not that you'll become an expert by the time you're done watching, but you'll understand the basics of the sport - from techniques to tournaments.\\n\\n\r\nThis cartoon seems more or less directed towards adolescent girls, but anybody who's easygoing or has an interest in kendo can enjoy it.  It's not exactly something spectacular and teaches not much more than the basics of kendo and friendship, but it's a fun and light-hearted show that will appeal to anyone - even those who are experiencing anime for the first time.",
            "date": "2011-10-18T13:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 45799,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/431296.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/7jaws7",
                "username": "7jaws7"
            },
            "url": "https://myanimelist.net/reviews.php?id=45799"
        },
        {
            "content": "Well, I had been passing off this show for a while and felt it was finally time to get it off my list and watch it.\r\nBefore watching: I had an idea that it would be your typical, sports oriented anime, mixed in with the usual highschool life. Learning about kendo, the characters, battles of accomplishments and so on.\r\nAfter watching: As I began to watch the show it grew more and more interesting. The show kinda slowly takes off with the introduction of all the characters and what not, but once all the characters are joined as a team, then the real story takes off. Ourmain character is Tamaki (aka Tama-chan), she is great at kendo, yet wasn't appart of the team. After trying to get her to join the team, and once she finally does, the show pretty much begins, but not until the other members came. Waiting for Saya, Miya-miya, and Satorin to join was stretched out for a long time. It kinda annoyed me, since you see at the beginning of the show that Satorin is hanging around the kendo dojo, you know she'll eventually join, and just have to watch and wait till she does. \\n\\n\r\nBut once everyone is gathered, I found the story to finally take off. Now the kendo team practices, enters tournaments, and does training camps, all the usual stuff. Tama-chan is the best on the team, never lost a match, and is the most skillful member. We follow along, watch her finally meet defeat, go through depression, and finally learn to love kendo for her own reasons. Sure I can talk about their Sensei's side-story and why he had to form a group of girl kendo practitioners, but you can watch and enjoy it for yourself.\\n\\n\r\nSo combining all the kendo, tournaments, enjoyments, disappointments, tough times, fun times, painful times, etc. This show was a good watch. \\n\\n\r\nTypical Highschool life mixed in with it, although it doesn't seem to stick around alot, it's usually more Kendo/Winning focused. Seems like the normal \"sports\" anime, and still enjoyable.\\n\\n\r\nI give this show a 7/10, was a good watch, funny, and full of good moments.",
            "date": "2012-02-27T04:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 54877,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1096637.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zetsubou_Matt",
                "username": "Zetsubou_Matt"
            },
            "url": "https://myanimelist.net/reviews.php?id=54877"
        },
        {
            "content": "Anime that really manages to show what kind of thing Kendo is? Is it possible?\r\nYes, it is. Bamboo blade manages to do that, and with flag flapping out high. Fights really are short, as in kendo, and not something like a episode-per-battle things that you see in many different animes (or, in DBZ format, battles take 10 episodes...) Main caharcters are also human-like, they all have even the bad sides and can feel negative emotions about things. None of the characters are really weak for the show, and everyone's thoughts and life is shown somehow. None of the characters are left out. With this manycharacters (6), it's quite an achievement.\\n\\n\r\nSeries also shows the hard part of the kendo: training, training and more training. Basic training can sometimes feel really like hell (for me, it felt useless at start), but then you start to get the hang of it and it becomes something you enjoy. This is also greatly shown up in the series. Also, there are some who kinda bend the rules (even one of the main characters), but mostly series show the idea of Kendokan.\\n\\n\r\nThe series still leaves some small things a bit open-out answered, but that can be passed as the fact that main characters have no way of finding them out. Also, comedy works well, as mentionet early. Mostly character's faces do the jokes, and it really works. Series also sometimes make it seem like they want to joke about how the characters think about something and somebody knows what they think. In Bamboo blade, characters often answer into questions other people say to themselves in their head. It's kind of refreshing since usually I get irritaded for the fact that everybody knows what others are thinking in the anime without telling it.\\n\\n\r\nFor overall, I have just one thing to say: Kendo is way of caring, not way of hurting. And Bamboo blade shows it.",
            "date": "2009-04-18T01:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 14266,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/172063.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Eltharrion",
                "username": "Eltharrion"
            },
            "url": "https://myanimelist.net/reviews.php?id=14266"
        },
        {
            "content": "I enjoyed watching this anime.\r\nAnime based on the manga, where as girls make up the majority of a school's kendo team. A school kendo teacher starts up a team in his efforts to win a bet against his rival's school team in a kendo match competition. His reward, free meals for a year. As far as the story goes, I have to say it is pretty straight forward, but much obliged as it is still fun watch. As far as character development goes from you expect from a sports anime, the characters progressively improve. You got your typical shy but BADASS girl, Tamaki, voiced byHirohashi, Ryou [Alice - Aria, Kyou - Clannad] . Kirino, voiced by Toyoguchi, Megumi [Revy - Black Lagoon, Nishino - Ichigo 100%] the lovely ditzy, blonde bishoujo Kendo Captain. And other characters such as your tsundere and megane characters. I hope you enjoy this school sports comedy as much I did. I give it, 8 shinai (kendo swords) out of 10! XD",
            "date": "2011-04-03T21:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 35652,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Siberian_Shu",
                "username": "Siberian_Shu"
            },
            "url": "https://myanimelist.net/reviews.php?id=35652"
        },
        {
            "content": "I started with the (ongoing) Bamboo Blade manga, so my review of the anime comes from that perspective.\r\nAll of the enjoyment of the show comes from the characters and the fights. Although that might make it sound like a shonen series, it certainly is not, but it dances on that line between shonen and seinen very well. Ostensibly about a kendo instructor and his struggles with a high school club, it's really about a young kendo prodigy named Tamaki who matures into a young woman through the course of the series.\r\nThe series is short on plot, and since this was my first real sports animeI'm not really used to that . They basically go from one tournament to another, with lots of training in between and little drama. It didn't have much to draw from, since the manga is also weak in this respect.\\n\\n\r\nThe art and sound are passable, the fight scenes are well done, but some reuse of material towards the end becomes conspicuous. I'm not crazy about the opening or ending, and I really don't like Tama's voice, which sounds way too young even for that character.\\n\\n\r\nThe characters obviously make the show, and all the girls are distinct and likable. It does a very good job of developing each personality, and is very patient introducing them.There's even a happy couple in the mix, which seems rather rare in anime these days.\\n\\n\r\nOverall, a light anime with cute characters, it should leave you feeling happy after each viewing.\\n\\n\r\nFavorite Character: Dan the Man\\n\r\nCrushing on: Saya\\n\r\nFavorite Episode: 22\\n\r\nFavorite Song: Track #19 Yugure",
            "date": "2010-03-21T21:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 24181,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/306834.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Vespers",
                "username": "Vespers"
            },
            "url": "https://myanimelist.net/reviews.php?id=24181"
        },
        {
            "content": "Bamboo blade is supposed to be the story of kendo club and it's development. In Muroe high school Kendo club there are only a few (4 ) members out of which 2 are delinquant boys who do not let new members join and one eccentric saya chan who comes whenever she likes and leaves in a moment. Only the captain kirino stays. Now the main character, which i liked the most and sympathized with was the coach of the kendo club koujiro ( toraji). He is totally poor so he craves for delicious food to be feed by someone else as he lacked the moneyto buy them. Even if he gets money, due to his extreme bad luck, that to will be taken away by the money lender. He makes a bet with his senpai who at one time feeds him free lunch makes a bet that if his (koujiro) team wins he will be fed sushi at his father's shop free of cost for a whole year. Excited coach now searches for new members and accidentally they find Tamaki\" who wins over adults at her family kendo dojo. She is national level player who never attended any tournament. Later on Miyazaki(miya-miya), dan-kun, yuji-kun, azuma satori etc will be added to the team.\\n\\n\r\nCharacter development: Dan's , Miya-miya's characters develop clearly. But i felt sympathetic towards their coach. Yuji's character is just for name sake.\\n\\n\r\nEven the tournaments are not so good. \\n\\n\r\nEnjoyment: Overall you can enjoy it as a slice-of life comedy. Nothing so much about kendo. Unnecessary entrance of teams in the tournaments is seen clearly in the plot. Wast of time.  Initial interest that was created in the first few episodes gets vanished at the end of the series. \\n\\n",
            "date": "2016-12-15T01:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 235478,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3838527.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/deep3anime",
                "username": "deep3anime"
            },
            "url": "https://myanimelist.net/reviews.php?id=235478"
        },
        {
            "content": "Bamboo Blade is easily in my top 3 animes. It is a truly refreshing slice of life show. Muroe High's Kendo team is run by a struggling kendo teacher who lost himself years ago. His students don't take him seriously, and they look to the youngest member, a Kendo prodigy, for their training. While the story mostly takes our crew through tournaments and practice meets, the sports aspect really takes a backseat to the bigger picture. The show focuses mostly on the true meaning of Kendo; the name of the sport literally means \"the way of the sword.” The true focus is the growth ofthe characters outside of their sport. That is what I like best about the show. As a martial artist myself, I know that life is more about the journey than the destination. Every character has their unique quirk that makes them seem real, and even the incredible Tamaki finds her shortcomings in life. \\n\\n\r\nWhen it comes to the story, Bamboo Blade is a very lighthearted show. Every episode is full of humor, and the serious moments are well broken up to keep the mood light. It feels good to watch the characters progress, with a pace that is just right for the series. The art is very well drawn, especially in portraying a realistic Kendo match. Of course, the silly cartoonish style comes out in the humor, with Tama's blank O_O face and Kirino's signature =3 smile. Musically, there is deceptively little in the background. The lack of sound is never noticeable, as I had to dig through episodes and listen to notice it for the review. Dialogue and sound effects make up the bulk, and any music is basically battle-style drums and trumpet. \\n\\n\r\nI like the series so much that I actually bought the manga. The two go hand in hand, but there is one thing I wish the anime had incorporated. Miya Miya is sweet on the outside to her friends and boyfriends, but in reality she is bad to the bone. This aspect is shown much deeper in the manga than in the anime, and one small detail I feel important is Miya Miya’s secret habit of smoking. It's a small thing to pick at, but it gave the character a chance to reflect upon her darker thoughts as the Miya Miya we don’t normally get to see.\\n\\n\r\nThis show is a must watch.\\n",
            "date": "2011-05-04T15:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 36751,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/XP-Muzzy",
                "username": "XP-Muzzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=36751"
        },
        {
            "content": "One thing I must point out is that when I watched this anime it was on megavideo.  So if you do plan on watching be sure to have time on your hands, because you most likely will get cut off mid ep.\r\n... anyway\r\nBefore I started watching I knew nothing about kendo, and wondered if this would even be worth watching.  At first the story seems a bit dumb.  I mean it's about a guy that makes a bet with his friend for food because he is poor?!  How can something like that be interesting?  It does change, but that isn'ttill later.\\n\r\nMost of the main story is based around the teacher at first then switches over to the students.  A good thing that I liked about this anime was that is wasn't about just one person.  They tried to make the story a little bit about everyone.  It really brought the feeling a team together.  While at the same time the way they go about there daily lives is pretty funny.  \\n\\n\r\nNice thing is that it is appealing to the eye.  I must admit that just because I didn't like the way an anime looked I did not watch it.\\n\\n\r\nAs for the songs, both the opening and the ending are quite catchy.  Other than that nothing special about the sound, but nothing awful either.\\n\\n\r\nDecently balanced characters.  You have a skilled kendo/anime lover (very unique, not something you normally expect), the childhood friend,  the klutz, a weird person, a team cap that is always energetic, the 30% BF 70% GF combo (in the anime the BF is very small and dorky looking, and the GF is just ....... wow out of his league.  You will understand what I mean about 30% 70% when you watch it), and of course a teacher that gets bad luck just when he thinks things can't get any worse.\\n\r\nThe side characters are funny too, but I don't want to give everything away.\\n\\n\r\nAs I have noticed it seems that any anime about school has to have at least one of the following\\n\r\nHot spring, vacation/field trip/outing/training camp/festival school or local.  (Or something along those lines.  It must be an unwritten rule or something)\\n\r\nFunniest thing about this anime are the little side story's.  The side story's don't really tie together with kendo, but it is funny none the less.  Overall it is a decent anime.  Nothing super good about it, but nothing horrible either.\\n\r\nIn my opinion if you like anime that takes place in school this is one worth watching.",
            "date": "2010-06-03T17:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 26760,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/298167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/imprezagc8",
                "username": "imprezagc8"
            },
            "url": "https://myanimelist.net/reviews.php?id=26760"
        },
        {
            "content": "I'm writing this review right after finishing the last episode of the series, and, generally speaking, I act like this just when I really enjoyed a show.\r\nSo I'll state right from the beginning that I really loved Bamboo Blade, for more than one reason.\r\nFirst of all, it's actually funny. The charatcers are nice shaped and mixed. You can find one for all flavours. Given the case that we are speaking of a group of friends, you have all the anime classical girls, from the shy kuudere Tama-chan, to the violent and loving yandere Miya-Miya. For most of the time I've been watching it, I hada smile on my face, and that's surely something important.\\n\\n\r\nSecond thing worth mentioning: this show has a nice pace. Apart from some brief slice of life episodes, the focus is pretty much always mantained. You will enjoy the developing every single member of the club, and their progress in the way of the sword. And this brings us to the most important thing:\\n\\n\r\nKendo.\\n\\n\r\nThis anime is about kendo. It truly is. I'll speak as a kendoka about this: letting alone the fact that the technical features of kendo are nicely (though not too thoroughly) described, I think Bamboo Blade can give someone who's never tried this beautiful martial art an idea of what it's like. It's something that makes you grow, and gives you the opportunity of meeting and getting to know incredible people. And it's damn funny (and during summer it makes you stink :3 But Kirino-senpai will explain you why this is also a funny part). It's not about swinging bamboo sticks.\\n\\n\r\nSo if you're curious about kendo, and you want to learn something while enjoying a nice show, give this a try!",
            "date": "2014-06-05T13:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 145993,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3308177.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bernakun",
                "username": "Bernakun"
            },
            "url": "https://myanimelist.net/reviews.php?id=145993"
        },
        {
            "content": "Bamboo Blade is an adaptation from a splendid Manga of the same title. The story is good; it encompasses varied contents: comedy comes first, followed by a bit of drama, handful of Kendo actions and a little sip of romance. There's nothing wrong with the artworks, female characters are really cute and their emotions are well expressed, visually. The only exception is some dull feeling I had during the Kendo scenes. This is hard to mention by words, it was like... lacking sharpness? or so. Anyway, voice-acting was of great standard. An example can be seen in the action scene, which was brought up tolife (regardless of the 'feeling' I mentioned) with voicing. Everything else is okay as far as I'm concerned. Be warned though, if you've already read the manga, you may get feeling similar to mine that something IS missing. (Set aside the fact that no further season is aired first! It's quite off topic)\\n\\n\r\nThat comes to a mediocre scores for animation and enjoyment. I had to admit that I'm quite biased since I liked the manga better. Anyway, this series is okay and worth spending time with.",
            "date": "2010-07-06T07:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 28045,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/351394.jpg",
                "scores": {
                    "animation": 4,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/akachan",
                "username": "akachan"
            },
            "url": "https://myanimelist.net/reviews.php?id=28045"
        }
    ],
    [
        {
            "content": "While Bamboo Blade may not be an earth shattering or ground breaking series, it is an uplifting and fun series that doesn't stoop to many of the normal anime conventions.  The kendo matches are well paced and interesting while not being the major focus of the show.  \r\nThis show is really carried by its characters, as all the girls are adorable and interesting.  The coach is less of a likable character, but even he has his moments.   The Blade Braver thing is hilarious.\r\nIn conclusion, if you are looking for something that will lift your spirit up and make you feelgood then check out this show.  I really hope they make a second season.",
            "date": "2008-07-31T07:16:00+00:00",
            "helpful_count": 0,
            "mal_id": 6718,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81208.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GrooveArmada",
                "username": "GrooveArmada"
            },
            "url": "https://myanimelist.net/reviews.php?id=6718"
        },
        {
            "content": "The first, obvious thing about this anime is the visual style. It reminded me heavily of Jinki:Extend and School Days, which I guess isn’t a very flattering-sounding comparison, but still. The characters are drawn with a bright, cute style, and the backgrounds are impressively detailed. The big thing here is the subtlety of the animation, which is extremely important considering the personality of one of the characters. There are many moments throughout the show where there will be just a tiny movement of a person’s head or mouth or hand, but will convey a lot of meaning and make the show that much more immersive.There was no lazy animation that I could see, and it felt a lot like the animators really put a lot of care into making this show. It may not look like Redline or Shakugan no Shana Final, but you can tell that the animators really wanted this anime to look good. Then on top of the great drawing and animation, there are the colors – OH MY GOD THE COLORS. The coloring is so incredibly bright and happy and bubbly, it’s almost like an assault on the retinae. Maybe some people don’t go for bright colors, but since I’m color blind, I love them and I think it made the show that much better looking.\\n\\n\r\nThe one thing I would fault Bamboo Blade’s visual department on is how they avoided animating the actual kendo scenes. Although the anime is about kendo, they usually make the matches very short, and with as little actual animation as they can. In some cases, they actually skipped the matches altogether, preferring, I suppose, to not waste time animating them. Near the end of the show this trend starts to cease, as more matches are properly animated (and damn did they look good), but for most of the show, it’s a rather annoying problem.\\n\\n\r\nAs weird as it may sound, I actually found a surprisingly strong similarity to K-On! for the first three-fourths of the anime. The main, obvious comparison is the moe, which both shows have in SPADES. However, whereas K-On! has girls who are extremely moe for the sake of moe, Bamboo Blade does a slightly different thing by actually designing properly interesting characters which also somehow have tons of moe as well. It’s weird, saying that the girls are both moe and strong literary characters, but it’s true. All five of the main girls are very deep, layered people with backstories, diverse character traits, and recognizable habits that make them feel pretty real. It’s extremely impressive when considering how lovable they are on top of that.\\n\\n\r\nThe other comparison I found was the storytelling style, which, for the majority of the show, is reminiscent of K-On!. Both shows have some kind of common factor that the story centers on – kendo in Bamboo Blade, music in K-On! – but the story doesn’t focus on that. Rather, it’s treated as a sort of medium through which stories about the characters are told instead. In both cases, it’s relaxing and fun to watch, with very little stress, which is something that I really enjoy. Around episode 23 or 24 is when Bamboo Blade turns away from that relaxed storytelling and introduces some actual drama. In those last few episodes, there was plenty angst and tension to be had, and then a very good ending that I really enjoyed. I won’t go into details, but just know that it won’t stay as laidback as the first 20+ episodes would have you believe.\\n\\n\r\nIn summary, Bamboo Blade was a really good anime that was lots of fun to watch. If you’re watching the show for moe, you’ll definitely like it. If you’re watching it for the sports focus, I wouldn’t be so sure. It may be “about” kendo, but in the end, it’s characters first; kendo second.",
            "date": "2012-02-16T08:45:00+00:00",
            "helpful_count": 0,
            "mal_id": 54003,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/531499.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cuckundu",
                "username": "cuckundu"
            },
            "url": "https://myanimelist.net/reviews.php?id=54003"
        },
        {
            "content": "Story 6/10\r\nThe story of Bamboo Blade is probably it's one major weakness. Entirely predictable and clichéd it's nothing you haven't seen before. This is ok though as the story is mostly there to put the characters in various (often hilarious) situations. The humour may not be for everyone, but I certainly enjoyed it rather a lot. Ultimately the story does it's job of getting you from point a to b, and even though you've seen it all before it's still a fun ride. On a side note as someone who has absolutely no interest in kendo the show did a good job of not emphasisingor leaning to heavily on dreary technical aspects of the sport, instead focusing mostly on the great character interaction.\\n\\n\r\nArt 7/10\\n\\n\r\nNot much to say really it looks good for a comedy show. Nothing jaw dropping but nothing hideous either\\n\\n\r\nSound 7/10\\n\\n\r\nThe show has a solid dub but with Great voice actors such as Briana Palencia and Luci Christian it really wasn't all that surprising. Having only seen it dubbed I have no opinion on which is better just watch which-ever you prefer. \\n\\n\r\nMusic wise the opening was in my humble opinion annoying as F*CK. However the music in the episodes works much better, using  more traditional instruments. It's hardly a masterpiece by any stretch but it still gets the job done.\\n\\n\r\nCharacter 9/10\\n\\n\r\nThis is the real heart and soul of bamboo blade, every character is unique and  brings something different to the team and they all have their own motivations for competing and being part of the club. Whether it's to be a champion of justice or unleashing your inner demon or to simply not get fired. It's the sort of show were you can just sit back and enjoy the commotion of having a bunch of eccentric characters on screen at the same time. The dialogue is fun and light hearted and often veers off topic. Even the characters themselves at times seem totally aware that their in a comedy anime, pointing out weird and overly dramatic scenes to the audience, breaking the fourth wall in hilarious fashion. \\n\\n\r\nOverall Enjoyment 8/10\\n\\n\r\nI really liked this show, it was good fun and easy to follow. Although that being said I can see some people being turned off by the humour, as what's cool and quirky for one person is just downright weird for someone else. Watch it if you just want a fun little show to pass the time, or a fresh break from a more serious anime.\\n",
            "date": "2013-01-29T16:12:00+00:00",
            "helpful_count": 0,
            "mal_id": 85297,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1474643.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/crispifier",
                "username": "crispifier"
            },
            "url": "https://myanimelist.net/reviews.php?id=85297"
        }
    ]
]