[
    [
        {
            "content": "Before watching this anime, I had my doubts. But in the first ten minutes, I was hooked. Why? Because of the humor. \r\nIxion Saga DT doesn't really have much of a plot going (yet) but from what I've seen, it seems like an episodic anime to me.\r\nFor those of you who do not like episodic animes, then don't watch, but for those of you who like Sket Dance and Gintama, then I recommend. This show is funny, likable, and overall you'll be very pleased with it. \r\nI feel a plot brewing, so don't worry- this anime has a direction! \r\nI can't give a completely accuratereview of this anime since only the first several episodes have been released, but I can tell that I'll enjoy this anime in the long run. \\n\\n\r\nThe art is good, and all the characters look unique and none of them are an eyesore to look at. There isn't a huge character cast yet, but most of them are likable, so no worries there.\\n\r\nI very much enjoy the characters voices, and those of you who are fans of Gintama, look out for two familiar voice actors! \\n\r\nThe OP and ED are both great, and this just seems like this show has a lot of potential if it gets far. \\n\\n\r\nI enjoy this anime and I am excited for the shows progression! I honestly don't have any negative points about the series at the moment, and I hope it stays that way. \\n\r\nMy overall enjoyment of the show is an 8.",
            "date": "2012-11-02T19:52:00+00:00",
            "helpful_count": 113,
            "mal_id": 76517,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SavageSmickey",
                "username": "SavageSmickey"
            },
            "url": "https://myanimelist.net/reviews.php?id=76517"
        },
        {
            "content": "If you come into this hoping for the standard sword & sorcery, historical/fantasy shounen adventure fare, you're probably going to be disappointed.\r\nI rather despise that genre, because they're all the same. Once you've seen one, you might as well have seen them all. They re-use the same tropes and devices, and don't much original fare to offer.\r\nThis series takes those tropes, and irreverently plays with them, providing parody and lots of unexpected content.  And trolling.  So bad it hurts.  I haven't had so many laughs over an anime since \"Daily Lives of High School Boys\" (which, incidentally, has the same director; who'salso the guy who did Gintama).\\n\\n\r\nThe princess isn't a sexy teen girl (she's not even cute enough to be a loli) and the sexy teen girl isn't actually even….\\n\r\nThe cute animal mascot (which EVERY hero group must have), is at war with the hero.\\n\r\nAnd, erm, \"crotch problems\" take center stage.  It's all about balls here, folks.\\n\\n\r\nBasically, you can watch it without knowing quite knowing what's going to happen next. Except that it's not going to quite turn out the way it's \"supposed to\", or at least, not the way we've been conditioned to expect.\\n\\n\r\nThis is a comedy that's given me lots of healthy laughs so far; I've watched through half the episodes, and look forward to seeing what curve'balls' are thrown at me next.\\n\\n\r\n[slightly edited from the review I posted on Crunchyroll]",
            "date": "2012-11-04T16:30:00+00:00",
            "helpful_count": 67,
            "mal_id": 76687,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/323383.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IceAndCream",
                "username": "IceAndCream"
            },
            "url": "https://myanimelist.net/reviews.php?id=76687"
        },
        {
            "content": "This has been on my list of show to watch for a while now. Having completed it, I would say it was a lot of fun. It's nothing deep nor is it anything overwhelming original. It's just fun. Fun can go a long way though.\r\nThe art and animation are unremarkable, though far from bad. The story is quite thin and simplistic. It rids on humor, some of which can be hit and miss. There's a lot here that isn't at all great. Regardless, I'd still give it an 8 just because the characters and the humor when it does work make it a silly, funride.\\n\\n\r\nThe characters here are quite likable. The main character is rather annoying at first, but he does seem to grow through it all and become increasingly likable. His traveling companions are more immediate. Princess Escarlate is wonderfully deadpan and amusing. Her knight Sanglain is serious and likable, while still crazy enough to provide good laughs. Mariandale is probably the best character the series has, having a great design, fun personality and being at times a surprisingly grounded and positive example of a transgendered character in a purposefully dumb shounen comedy anime. Rival Erecpyle and his subordinate team Incognito meanwhile offer big on comic mischief and are always fun to watch. All the while the party comes across minor characters who are sometimes equally crazy and fun. It's an appealing cast.\\n\\n\r\nThe humor is focus here, and as humor is a subjective thing, it's what could potentially curtail enjoyment of the show. Ixion Saga's humor is very stupid, irreverent and often immature. As audacious as it sometimes gets, it can be worth quite a few good laughs if you're willing to laugh at that kind of humor. Don't go in expecting particularly smart comedy though. If you have no use for silliness and willful stupidity, you will not find anything of value here. For those of us who do enjoy watching something just kind of silly and dumb at times though, Ixion Saga is a solid and rewarding pick.",
            "date": "2013-05-25T19:56:00+00:00",
            "helpful_count": 57,
            "mal_id": 98429,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=98429"
        },
        {
            "content": "Just finished watching Ixion Saga .Mixed Feelings about that one :\r\nIxion Saga can me summarized as an attempt to replicate the relaxed/wtf/lol?/laid-back style Gintama made popular in Anime .\r\nIn this style a lack of a greater overarching plot , comedy and dirty jokes , excellent sound-soundtrack choices and strange character are the standard .The style is great , Gintama that introduced it in the Anime industry a masterpiece .Let's see how Ixion Saga DT fared though :\r\nStory-3\r\nAs i said before the specific sub-genre/style Ixion belongs to lacks plot lines as it's main points .Even though i take that as a given , still Ixion Sagacould have fared much better: it tries to use the story both as a background and as a hook/point of interest , with the result being a failure in both attempts .The story is not absent - it is there , but it is ignored , resulting in some disbelief and boredom that could have been (easily ?Dont know .) avoided .The lack of progress endangers the whole series as the viewer can become tired of what seems as meaningless events , spawning at each episode like NPCs in a RPG game that is just too full of grind .And i know that the fans might defend the series reminding me that Ixion , like Gintama dont require a master story - yet still having seen and loved Gintama and even Sket , i have to commend that Ixion Saga's story can be compared with boring Pokemon episodes but not with the tense and emotional charged story arcs the two aforementioned shows field .\\n\r\n(Let it be known that the last episode has a much better written story than the rest of the show- a wonderful surprise rewarding us for making it to the end !)\\n\\n\r\nArt-6\\n\r\nNothing great , nothing good , nothing bad .\\n\r\nLately Art seems to have been standardized .I kind of miss the variety the 90s and the 2000s had : each show had it's own style for good or for bad .And there were always glitches to be found .The much cheaper/improved technology of today has eliminated visual errors and unusual/unique art styles from most series today.\\n\\n\r\nSound-8\\n\r\nIxion Saga has great sounds and soundtracks :the level was on par with Gintama !\\n\r\nDifferent music genres , familiar chords and styles , variation - the soundtracks were great and played a nice part in drawing you into the series . There was Rhythm and good taste in orchestration and song choices .And the most surprising fact is that i am not talking about the OP/ED - no , i actually didnt liked those two - i am talking about background themes .Very good on sound .\\n\\n\r\nCharacters-6\\n\r\nIxion Saga's Chars are interesting and funny : each has his own fetish plus some perks - and each gets a decent amount of attention in the show .And here is where trouble ensues :\\n\r\nthe characters while are interesting seem to have been made with some kind of character generator you can find for RPGs .They are too much replicas from the Gintama series- something that becomes even more obvious when you actually hear half the cast of Gintama playing as the main chars in Ixion Saga .There was a lack of originality - i find myself imagining the people that designed the character watching Gintama and saying to each other \"Ok that was good , what can we use instead of that ?\" .In short if you ve seen Gintama you ll see no new character concepts in Ixion Saga .They have somewhat recycled the chars from it .\\n\\n\r\nEnjoyment 6 - Overall 5\\n\r\nIxion Saga is a fun Anime and it sure is enjoying watching one .With all the the lack of originality it still has some entertaining value .However -and with that i sum it up - this show has copied Gintama at so many major points , so obviously that one can clearly feel the lack of dedication and investment from the creators  .And since those two things are what make an Anime interesting and enjoying to watch i can say that this show is worth watching without lying .\\n\\n\r\nIxion Saga is for Gintama what the many industrial Harem anime are for their originals .",
            "date": "2013-05-15T08:24:00+00:00",
            "helpful_count": 27,
            "mal_id": 97259,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1395013.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/allos",
                "username": "allos"
            },
            "url": "https://myanimelist.net/reviews.php?id=97259"
        },
        {
            "content": "Recommended if you're in the mood to \"LAUGH YOUR BALLS OFF\" (A pun you'll all understand if you watch this show!)\r\nAs I am beginning to write this review for any person interested in watching this FANTASTIC anime, I finished the last episode ten minutes prior.\r\nBeing truthful, I am a big Sword Art Online fan, but the amount of people who are comparing anime that involve a virtual reality or some sort of relation to gaming to Sword Art Online is ridiculous, which is why I'm making this review completely unrelated to Sword Art Online, including Accel World which is also made by the same personwho made Sword Art Online.\\n\\n\r\nStory\\n\r\nThe story of Ixion Saga DT is about a teenage boy who was transferred to another world, like a game. Before he was transferred, he was the strongest player on an MMORPG game he was in a boss fight on, then suddenly being caught off guard and losing to the boss, he met a beautiful woman who asked for his help, what he didn't expect was she was a strange being who transported him to an alternate world called Mira, then his journey began with a few others he met by coincidence, where he became a servant to a princess, in order to save the world, they have to fight. (The second girl he travels with that has green hair is a strange one, believe in me! You'll be in for a treat with this one!)\\n\\n\r\nArt\\n\r\nThe art style of this show is great, the reason why I say this is because it's not incredibly defined like most anime are today, the animators didn't spend too much time worrying about how impressive the art was, thus some parts were sloppy, but what FASCINATES me is that the colors and effort they put in to every little detail was MIND BLOWING! This is another reason why I loved every episode to this anime!\\n\\n\r\nSound\\n\r\nAlthough I say everything is truly remarkable with this anime, the only issue I found with the anime was some parts of certain episodes were a bit off, I would give an instance but I couldn't really bring myself to spoil such a masterpiece, the sound was still enjoyable, that's what matters!\\n\\n\r\nCharacter\\n\r\nOH. MY. GOD. The character development that the team that worked on this show seriously put amazing effort in!!! The different types of personalities that each character's have is crazy! I could even say that this anime may possess one of the best character development I've ever seen! Not just the personalities are strongly different to each other, but the characteristics and actions each character has and presents in certain situations is great, I loved every single character, no matter how evil or heroic they were, or even idiotic! (trust me, there's a lot of idiots in this show, the main one being the male protagonist!)\\n\\n\r\nEnjoyment ?\\n\r\nIf only there was a better word to describe how enjoyable something was other than the word \"enjoyment\" itself!\\n\r\nI've been on a long spree of anime recently, I didn't think I could find much better anime than things I've previously watched (which is a lot of anime!) but sweet mama.. Was I wrong.\\n\\n\r\nOverall ?\\n\r\nI want to solely declare that this anime is perhaps one of the best anime ever created.. Seriously. More so, I want to thank the people who put their time and effort in creating this masterpiece, personally. The amount of LAUGHTER I had in every episode of this show was crazy! I had trouble breathing (for real, I have asthma!) -- So yes, thank you so much for this anime. This anime, personally I'd say is the..\\n\r\nFUNNIEST ANIME OF ALL TIME WINNER -- Awarded by iAkali.\\n\\n\r\n(I'm doing \"Awards\" for anime that I find are worthy of such, also opening a YouTube channel for reviews so I can give a much better review with visual aspects. I will be talking to someone in hopes of YouTube Partnership and the such. I definitely recommend this anime to anyone who loves to laugh!)",
            "date": "2013-05-31T10:11:00+00:00",
            "helpful_count": 22,
            "mal_id": 99119,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2486375.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iAkali",
                "username": "iAkali"
            },
            "url": "https://myanimelist.net/reviews.php?id=99119"
        },
        {
            "content": "DT,DT,DT,DT,DT,DT,DT, DT Sutero, 'nuf said, as I've finished watching the last episode of this no good 25 episode thingy, normally if something is not good I drop it, but this one was different, it was no good alright, but it does have it's silver lining, since there were episode that are enjoyable and there were those you'll just skip. Co'z this was not the kind of anime that one must categorize it as a whole but it was something that has to be categorize on a per episode basis, and frankly, that's what director Shinji Takamatsu was aiming, he probably wants us audience to forgeteverything what was this anime about and just focus on each episode, in other words this anime as a whole was more of a gag type than anything else, since there was no plot to begin with just a scenario on a per episode basis. \\n\\n\r\nSo, here are my ratings for each of this anime's category:\\n\\n\\n\r\nPOOR 3.\\n\\n\r\nStory- like I said, there is no plot just situation that on every episode and each episode has a plot on it's own.\\n\\n\r\nCharacter- regardless of the characters info.........something that one must just forget, co'z on every episode that characters take a new form, which one would be irritated with, at one point in any given episode and appreciated on the other.But I'm sure everybody will agree with me that Kon is one big loud mouth a***** that everyone wants to take a swing at, and Erec and his Incognitos are a bunch of retards, as for Mariandale, I'm also sure that everyone will agree with me that she should've have been cast as a girl and not some cross-dressing man.\\n\\n\\n\r\nGOOD 7.\\n\\n\r\nArt- I like the design and the way the character's where illustrated and I'm referring to  Mariandale, Almaflora , Ecarlate and  Sainglain. I also like the way how them Incognitos were drawn.\\n\\n\r\nSound- though, Kon maybe the kind of character whose butt  I wanna kick, I still like the guy who did his voice, the same with Erec and his Incognitos. I also like this anime's opening theme, but not the closing.\\n\\n\r\nFAIR 6.\\n\\n\r\nEnjoyment- I gave it a 6 because, there are episode that I find it funny and there are those episodes that where downright corny.\\n\\n\r\nOverall- this is something which it would depend on oneself if which episode that's worth watching and which are worth skipping. Frankly, studio Brain's Base should have just leave it as an on-line game than make an anime out of it.\\n\\n\\n",
            "date": "2013-04-04T11:55:00+00:00",
            "helpful_count": 13,
            "mal_id": 92397,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=92397"
        },
        {
            "content": "Despite people saying this is unoriginal. With so few episodes that even now is a wrong thing to say. The commonly said anime this is \"similar\" to is probably SAO because it is all people know. This anime is not trendy. It just has the bad luck of existing at the same time as the most over rated anime in history. Which is... yes... SAO. Thus far, the only tie this anime may have to SAO is extremely minimal. The MC may be in a video game. It starts off with him meeting a character in a video game and he ends up in aanother world somehow. Given the name of the anime {Dimensional Transfer\" (DT) i wouldn't say it is a video game he is trapped in. Seeing as the characters in the supposed \"game\" have unique personalities and 0 NPCs are in it, i doubt this is about a kid in a game. SAO kids just wanna cry cause this isn't SAO. Their beloved over rated anime that they have to trash other animes because of. Don't listen to SAO fan kids. This anime is nothing like SAO. If anything it is similar to Gintama in many ways and that is a great thing. You know it has potential if Zoro's voice actor is in it. (OP, Ao No Excersist, D. Grey-man, Bleach, samarui champloo... etc..) The list of great animes Nakai has voice acted in are mostly good to great. Don't knock this anime because of mad SAO kids. Give it a shot because it is funny and has a unique story behind it. Nothing seems to suggest he is in a video game so far. If he is which he might. I'm not ruling that out completely. It doesn't seem to be a normal MMO at all if he is in fact in a video game. Some kind of virtual reality could be the case. He gets hungry, he sleeps, and yet there is no technology like \"nerve gear\" attached to him to create such affects in his brain. Thus to me he is actually experiencing all that you see. The lack of NPCs is proof enough. Even in HxHs Greed Island there were NPCs. Yet as of now i have seen none. Only complex characters that seemingly could not be NPCs. So ya SAO kids have no idea what they are talking about at all. They see what they want to see and they see something to hate because they think it is a cliche SAO anime. Yet they have never given any proof as to how it is like SAO in any way. I have given plenty of proof to how it is nothing like SAO. Don't listen to them. Watch this and enjoy.",
            "date": "2013-01-17T00:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 83925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1719881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Theliel",
                "username": "Theliel"
            },
            "url": "https://myanimelist.net/reviews.php?id=83925"
        },
        {
            "content": "Ixion Saga DT starts off in a similar trend to a lot of the recent MMO animes. In other words: the protagonist is an MMO player (A somewhat good one or great one at that) and somehow gets intertwined within the game itself. \r\nThe thing is, Ixion Saga DT doesn't really shine in any category. In terms of action, there isn't much incredible fighting nor abilities if that's what you're looking for. In terms of humor, it's generally lame slapstick and puns. Story-wise, there isn't much depth to it and the development is incredibly slow (4 episodes in and they spent an entire one onslapstick humor with a flying squirrel-like creature) and rather mediocre. \\n\\n\r\nThe characters aren't very interesting either. You have one gamer that's almost perfectly normal with no standout qualities, one tranny that drawn moe style (Which isn't really that funny), one blockhead fighter and a princess which is a child.\\n\\n\r\nIn other words, you're in for a rather bland anime with some lame slapstick humor and a mediocre storyline. It's like a cross between pokemon, in that they travel to different places fighting bad guys, and a try-hard version of gintama (Except gintama is actually funny in innumerable ways this series is not).\\n",
            "date": "2012-11-03T23:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 76639,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1715781.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Jose-sama",
                "username": "Jose-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=76639"
        },
        {
            "content": "The only word I can think of for this series is average. The graphics aren't beautiful, the characters don't have much depth, and the plot isn't praiseworthy. \r\nOne of the specialities of this anime is the comedy, which I found okay, but not hilarious (unlike Gintama). Although I've seen other reviewers compare this to Gintama in terms of the episodic and comedic moments (the inapropro jokes about balls), the jokes are less natural and more forced and tend to be more repetitive.\r\nAs I've only seen 3 episodes, it's not a bad series; however it's a worthwhile watch only if you're bored and want a fewquick laughs. And hopefully, the episodes will improve as the season continues.",
            "date": "2012-11-04T09:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 76667,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1714123.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/caxxke",
                "username": "caxxke"
            },
            "url": "https://myanimelist.net/reviews.php?id=76667"
        },
        {
            "content": "What can I say about Ixion Saga DT. There is enough here to want to watch it at least once. So far the series has been a bit disappointing except for the humor category.\r\nStory (5) - The story is about a kid who gets transferred into what seems like a game. I'm not really sure what the story is fully about yet and I've seen 15 episodes. Development is really lack and slow in this category but, you do find out some interesting facts about the main cast as well as the enemies. The enemies don't even feel like enemies at this point. So youpractically don't know who you are fighting until episode 15.\\n\\n\r\nArt (6) - the arts not bad at all. I'd say pretty fair, nothing extravagant or crazy. Not super appealing to my tastes.\\n\\n\r\nSound (7) - I gave this a bit of a buff because I kind of liked the rock feel that was coming from the opening and ending. Definitely one of the better parts of the series.\\n\\n\r\nCharacter (7) - The development of the characters is actually decent. Some episodes are a little cheekish and stupid at best. Seems like a bit of a waste listening to a story about someones past for a WHOLE episode and finding out it's fake seconds later. \\n\\n\r\nEnjoyment (6) - The humor is the best part of the show. If you want to laugh at some points its worth it. There hasn't been much action or anything else at all.\\n\\n\r\nOverall (6) - If you want to sit down, enjoy a series, and get emotionally attached, I suggest something else. This series has been a total comedic relief so far. I hope some interesting factors start taking place eventually.",
            "date": "2013-01-22T18:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 84559,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1989300.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BentoLegend",
                "username": "BentoLegend"
            },
            "url": "https://myanimelist.net/reviews.php?id=84559"
        },
        {
            "content": "Japan seems to be pumping out some trashy anime lately (e.g. Blood-c & Blood-c the Last Dark) and Ixion Saga DT just happens to be one of them. So if you're done with intelligent anime productions and would like to feed your eyes and mind with complete garbage, then look no further cause surely you've come to the right anime. \r\nISDT follows Kon Hokaze's arrival in this new world he's arrived in. Through many odd circumstances he ends up being paired with a lolicon princess, a male turned female transvestite and a generic looking strong soldier. He also gets tagged by his new foes withthe nickname \"DT\" which is the shortened form for \"male virgin\" in Japan. I mean who laughs at virgin jokes anymore? Well even I would if it was sold properly but the joke fails every time its used here, why? Many reasons. For one the writers arent all that proficient in comedy writing and another reason could be the voice actor for Kon but I'd still blame the character he's written as and the lines he's given. The horror of this becomes apparent when you realize this is going to be a recurring joke throughout the anime. ISDT does succeed in some funny jokes though, but they aren't nearly enough to have you put up with 25 episodes worth of garbage and its other bad/fail/force-fed jokes.\\n\\n\r\nThe viewer is taken to generic locations prominent in anime like the beach/a hot springs bath (onsen) and shown all the stereotypical things you'd expect if you've seen enough anime. Whats worse is whole episodes are wasted in such places doing nothing, the story dosent progress and if you didnt know any better you'd think they were filler episodes put right at the beginning of an anime. It wouldnt be so bad if these \"fillers\" were any good but sadly they arent.\\n\\n\r\nThe art scores highest amongst everything else this anime offers but its not perfect either. You still got a couple of scenes switched with crappy animation. The sound is just sad. The show starts off with this intro where it feels like the words \"DT\" are being shoved down your throat. Then you get this voice acting that seems at odds with the characters they are cast as. Its almost like you can tell they are trying hard to make you laugh. Its not so bad when you actually laugh but you'll probably feel sorry for them when you dont since they seem to be trying so hard or you might just drop the show for realizing the crap that it is.\\n\\n\r\nCharacters are rubbish. Kon the main character is filth of a character. If ever he had a strategy for his enemy and it failed, he'd resort to any underhanded cheap shot available to him even if its something like kicking another dude in the nuts. The lolicon princess is smart and haughty while retaining some child like qualities. The strong/brute swordsman likes cute things but I guess that was tacked on to make him less one dimensional? He still is one dimensional imo. Then theres the beautiful trans girl who cooks, gives advice and sometimes talks with a deep manly voice while also supposedly perfect/role model like? Psh, rubbish. All the characters generally remain the same only tweaked sometimes to make another good/bad joke. The only character I liked was Erecpyle, a major foe who is honorable and fights clean but this is probably due his stark contrast with Kon who fights dirty if need be. I did sometimes find Kon interesting and entertaining but other than that he was just as annoying as every other character in the series.\\n\\n\r\nAs you might be able to tell I didnt enjoy this show but I sat through it just so I could review it in its entirety. Cant really say it was worth it but at least I can let others know there's no light at the end of the tunnel here. To those thinking it might get better in later episodes or have some secret plot twist like Blood-c, well heres me telling you no, it doesnt. You do get some explanation of things somewhere around episode 21 but its not anything serious.\\n\\n\r\nIn my opinion I think some people who are proficient in anime production sat down after seeing Gintama and thought they could do something along the same lines and make some bucks. This anime is the result of their failure. Despite how Gintama comes off as unserious an half-assed, alot of intelligence and work is put into it as well as comedic talent. There are comedic geniuses at work in Gintama so its sad that this sub-par anime even gets to be compared to it.",
            "date": "2013-04-01T10:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 91935,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1180579.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/yemsols",
                "username": "yemsols"
            },
            "url": "https://myanimelist.net/reviews.php?id=91935"
        },
        {
            "content": "Ixion Saga DT is an anime based off of an online game, because those are known for their compelling narratives and not the high amount of repetitive grind at all. Although, to be fair to the concept, I've looked at an anime based off of a Pachinko machine that was quite good. The anime was written by Yamatoya Akatsuki and developed by our old friends at Brain's Base. Which is a bit of a mixed sign since they've done some good stuff, some kind of mediocre stuff and some stuff that's utter shite. Let's see where this one falls.\r\nStory:\r\nYoung Hokaze Kon is a gamer. Whileplaying Monster Hunter, or a game with very similar encounters with massive monsters, he meets a young lady player. They talk and she manages to get him to agree to help her. Which results in him being transferred to another world, chair and all. He accidentally falls on top of a man, saving a small group that was being cornered by him and his goons. Kon agrees to travel with the people he inadvertently rescued in order to find a way back to his own world. Together, they head on their journey to get an eight year old princess married for political reasons while also finding a way for Kon to return so he stops bothering everyone with his existence. Various shenanigans ensue.\\n\\n\r\nThe most pervasive problem with this series is the humour. It's built around subverting tropes and doing the unexpected. However, half the time it just draws attention to the fact that what it's doing is clichéd and it's jokes that are actually subverting regular tropes are mostly really obvious, making the punch lines predictable before the set-ups are even done. The consequence, in either case, is that the comedy falls pathetically short. The story itself is very shallow, relying heavily on those comedic elements both to provide entertainment and to distract from the obvious element that's incredibly not okay. Another issue with the comedy is that the series likes to repeat itself. There are multiple cases where they'll have a jape and then quickly repeat the jape twice more in a very short amount of time. I guess they just really wanted to run those jokes into the ground or maybe they thought if it didn't make you laugh the first time, it would the third time.\\n\\n\r\nTo its credit, there are a few funny scenes and the stuff that doesn't work is more stupid than it is annoying or painful. I also do appreciate the way they subvert the usual unfunny trans-gender jokes you get in anime.\\n\\n\r\nCharacters:\\n\\n\r\nMost of the characters in this are just boring and pretty one-note. Then you have Kon himself. He's the worst part of this series. Definitely among the more annoying protagonists I've seen. Yeah, he's better than Shinji Ikari, but that's not saying much. On the plus side, the moments where he's in pain are cathartic.\\n\\n\\n\r\nArt:\\n\\n\r\nThe artwork is pretty good. The background details are nicely fleshed out. The biggest issue with it is just that the comedic exaggeration scenes can be excessive and, like the comedy in general, they don't really work well.\\n\\n\r\nSound:\\n\\n\r\nAs a whole, the acting is perfectly passable, but not anything great. Fukuyama Jun does really well making him one of the few male voice actors I've heard play a female character well. Eguchi Takuya, in contrast, is really bad in this. To be fair to him, he was good in OreGairu. In this case, he wasn't given much to work with. I don't think anyone could have made Kon's dialogue sound good.\\n\\n\r\nHo-yay:\\n\\n\r\nThere's a little. It's established early on that Mariandale attracts both men and other women.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nIxion Saga DT is not a good series. The comedic elements largely fall flat. The main character is a constant annoyance and there's just not much to recommend it. That being said, I wouldn't call it terrible since most of its faults aren't particularly egregious. My final rating is a 3/10. Next week is the notorious Byston Well Monogatari: Garzey no Tsubasa. It's supposedly really atrocious. The week after that it'll be the 300th anime review. Until then, may you experience kindness, laughs and tranquillity.",
            "date": "2016-08-03T13:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 225852,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=225852"
        },
        {
            "content": "(Updated April 1, 2013 -- after seeing the final episode.)\r\nAfter watching “The Daily Lives of High School Boys” and almost dying from laughter, I made a little research and found this show. I have been meaning to find the funniest anime out there and this is perhaps the funniest one I have ever come across with. \r\nDespite this near death causing anime, this is not for everyone. If you are innocent or do not enjoy dark or perverted humor, which this anime has a lot of, then this is not the show for you. \r\nStory (8/10)\r\nThe story is good but not mind-blowing. It has asimple story – people going on a journey with a twist of typical war elements that you usually see in mecha anime, a few pinches of gaming fantasy elements and other illogical and unfitting genres. What makes the story kick, though, is the comedy that this show possesses. The ending, especially, would make you die of laughter. Despite that, unexpectedly, it would also make you sad at the same time once you finished this series.\\n\\n\r\nSo why did I give it an 8, you may ask? I know the story is stupid but sadly it works. Its stupidity actually works. As a parody or a comedy series, it is good. As an original work of literature or as a masterpiece, forget about it. \\n\\n\r\nArt (7/10)\\n\\n\r\nThe art is nicely laid out and fun to watch. The characters are drawn differently from one another and stand out on their own. The only thing is that the main characters roughly represent a lot of look-alikes in other popular shows such as how DT looks a lot like Mashiro from Bakuman, ED looks a lot like Kakashi from Naruto, Marian looks a lot like C.C. from Code Geass and so on. Though, still, this show is still a pure-bred comedy that contains a lot of parodies and these look-alikes may be taken negatively or positively depending how you look at it.\\n\\n\r\nSound (9/10)\\n\\n\r\nWhat can I say? Even the music that they provide is funny as hell. The ending songs are funny and perhaps a bit perverted. Aside from being funny, it is also catchy. Since it was coming from the same director as Gintama and DLOHSB, expect a similar feel in their sounds. It was nicely done and did a great job bringing the funnies.\\n\\n\r\nCharacter (10/10)\\n\\n\r\nAll of the main characters and even the supporting characters have strong and funny personalities and not to mention a lot of strange fetishes. They have also provided the audiences to soothe their own fetishes that range from a typical Lolita and otaku, cross-dressers and a bit of shonen ai, to sexy SM men. \\n\\n\r\nOverall, despite having a simple, and somewhat, even stupid mixed up story, for someone who enjoys this type of comedy and gamers, especially those who loves RPG, since they've thrown in a few dash of gaming otaku jokes which is also somewhat a reference to The World God Only Knows, would most definitely enjoy this show as well. \\n",
            "date": "2013-03-31T00:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 91727,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1897606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RedvelvetDaisuki",
                "username": "RedvelvetDaisuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=91727"
        },
        {
            "content": "This show commits the worse crime a series can commit. It is boring. This is really nothing more than ball joke after ball joke, not even well told. Its disgusting, perverted, and really, really uninteresting.\r\nThe only interesting part for me was the villain ED (a not so subtle reference to erectile dysfunction), who loses both of his testicles thanks to the actions of the main character. In episode 4 we see just how this affects his personal life, him struggling with this issue and wondering how he can tell people, especially his fiancee. My heart just broke for this guy, it was honestly painful towatch.\\n\\n\r\nWhen the best part of your comedy series is a tragedy, you know you're doing something wrong. Just stay away from this anime.",
            "date": "2013-02-12T12:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 86627,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1148563.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/nobody25864",
                "username": "nobody25864"
            },
            "url": "https://myanimelist.net/reviews.php?id=86627"
        },
        {
            "content": "Shortly: \r\nIf you like episodic anime with kind of strange, black and pervert humour, don`t be mistaken with other reviews: Ixion Saga DT does not fit you.\r\nAnd some more letters:\r\nOk,  it has some balls and sudden jokes, but no more than 20% of screen time, so the rest of time you will enjoy standard  noisy hero, not-cute loli (she is quite interesting character, but annoying at the same time), trap with boobs (middle-century fantasy knows plastic operation or it is a fat in push-up?) and a big guy with big sword (I wonder why my lovely Nakai Kazuya acts so bad as him:( ). It may sounds interesting, but it`s not.\\n\\n\r\nI will not complain about incongruities, cause it`s just a comedy in fantasy world, but still they don`t use that opportunity as that did creators of One Peace or Gintama. I mean, in these series illogical stuff is really illogical and makes bad feeling.\\n\\n\r\nWhy you can enjoy it: because of seyus. On the other hand a lot of great VA don`t sound great here, so if you watch this very average anime just for hearing favorite voices, you will get nothing but voice. Maybe after third ep they will act better... Anyway there is nothing outstanding in Ixion Saga. \\n\\n\r\nSorry for my bad english. I hope it was helpful for you.\\n\r\nFeel free to write your opinions to me.",
            "date": "2013-03-11T09:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 89399,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238568.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Banu02",
                "username": "Banu02"
            },
            "url": "https://myanimelist.net/reviews.php?id=89399"
        },
        {
            "content": "This is probably one of the most not-so-serious anime I've seen with those genres, of course meant in a good way. \r\nThe first episode made me want to drop the anime but I didn't, I continued and realized that the humor was the humor I enjoyed. The male protagonist Hozake Kon is hilarious and a character you can't hate.\r\nThe art is good, it's in my opinion very average that it starts to become very good in some way? As for the story, it's not that special but it's definitely there so it's not just some raw random anime with humor in it. \r\nThe character ofthis anime are all eye catching and they do all play a part of the anime, they have different personalities and positions in the anime surrounding the main protagonist Kon. They are all weird so they make a good first impression in your head so you will not forget the characters here.\\n\\n\r\nWell you will either hate the anime or like it, it depends on your humor and how you look at it. For me, it has just been raw enjoyment so far. The battle scenes aren't that bad, they are \"unique\" in many ways. \\n\\n",
            "date": "2013-02-17T04:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 87035,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2186905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Vertios",
                "username": "Vertios"
            },
            "url": "https://myanimelist.net/reviews.php?id=87035"
        },
        {
            "content": "I have to start this review out by stating that I have never posted a review before. I normally leave that to others. I am only doing so because I loved the show that much.\r\n I have seen a decent amount of anime and have to agree with savage and iakali. This is a very humorous anime I have never laughed  this much over one anime show and the humor is not all one liners. There is a plethora of continuing humor through out and only two episodes I remember skipping. \r\n     The story line is supposed to be predictablethat's where a lot of the humor comes from. I rated the story line with that idea in mind. \\n\r\n    The art as well did its job wonderfully , its not to detailed so as to create excessive seriousness. Neither does it appear careless and the facial expression highlighted the humor very well.\\n\\n\r\n  I personally will only give one of any category a 10, because I feel 10 should be reserved for the best. I am inclined to give this show my 10 for humor. However I feel the need to get a few more shows under my belt before I'm confident in finalizing that score. so I will add that while I gave this show an overall 9 for me it has the rating 10 humor potential.",
            "date": "2016-10-05T18:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 231166,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/crazypitts8",
                "username": "crazypitts8"
            },
            "url": "https://myanimelist.net/reviews.php?id=231166"
        },
        {
            "content": "Okay i have to admit it was hard for me to enjoy it at first .. but it gets alot better to the end ^^ \r\niwould say if you like sort of premature humor, very interessting slightly confuseing characters and an interessting world i would say this is for you. It's a parody towards alot of anime and basically the main plot is about balles and loseing your DT (virginity iwould assume) its kinda flashy crazy and totaly unexpected^^. \r\nIwould say if you have enjoyed something like gintama or simular stuff DT is something nice an fresh. \r\nI do admit i am not the greatesfan of anime that mainly gets its jokes out of makeing the main char fail in alot of ways (thats why i can'T really get it with gintama) but in Dt after 12- 15 episodes i kinda got along withthe slight disadventages they gave the main chars ^^.\\n\\n\r\nanyway if oyu would like to watch an anie with fantasy setting and a lot of \"gay\" humor(youll get it if you watch it) feel free to give it a try.\\n\\n\r\nif you expect a simular anime to SAO or Log Horizon (like i did and that s why i started it) damn stay away from it. ....it may have a simular setting (parlty makeing joke towards SAO) but it is defintly not an SAO. .... well maybe the addition towards this series is ^^ cause i kinda couldn't stop watching even if i wanted to ^^  hehe ....",
            "date": "2015-09-12T17:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 198430,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ManiX207",
                "username": "ManiX207"
            },
            "url": "https://myanimelist.net/reviews.php?id=198430"
        },
        {
            "content": "Ixion Saga DT may well be one of the below average anime I've seen. The art is could be a lot better as I've seen better art even in hentai. The fight seems are short so there isn't much to it and the plot is a typical main character who magically winds up in a new world and has mysterious powers that are uncommon in the new world but he soon finds out others have the same power. Now after two minutes of bashing on this anime the only good thing that's worth mentioning is the humor of this anime. Yes this anime is goodon the spectrum of blowing air out of the nose instead if laughing.",
            "date": "2012-12-29T21:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 81902,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1965734.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DatLilPaNda",
                "username": "DatLilPaNda"
            },
            "url": "https://myanimelist.net/reviews.php?id=81902"
        },
        {
            "content": "Ixion Saga DT is a satirical comedy with just the right amount of slapstick to please and not annoy. It has a great cast of characters, and plenty of mini story lines to please the casual anime viewer. It even has an appropriate ending for the series which seems to really be lacking these days.\r\nThis satirical comedy is fantasy based. It's a simple plot, but it works well enough. Basically Kon gets transported from sitting at his computer playing video games to a different world. In this new world he's supposed to save it somehow by using his hyperion powers. He is in no waya warrior, and the group he accompanies is filled with strong weirdos. This series is bizarre, yet I found it highly enjoyable.\\n\\n\r\nFrom the very beginning you are immersed in a ridiculous world that is different yet the same as ours. There's a princess, a muscle bound warrior, a dress wearing gunslinger, and then Kon. They are being chased by another group, and the larger story unfolds slowly throughout. Each week is a different themed episode, and it's all comedy. It has great cast, good animation, catchy theme music, and overall it's done well. If you're looking for a new comedy then this could be it.\\n\\n\r\nI highly recommend this series. It's a great time filler and it is full of laughs.",
            "date": "2013-04-01T00:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 91881,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/568293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/explicit707",
                "username": "explicit707"
            },
            "url": "https://myanimelist.net/reviews.php?id=91881"
        }
    ],
    [
        {
            "content": "Before watching this anime, I had my doubts. But in the first ten minutes, I was hooked. Why? Because of the humor. \r\nIxion Saga DT doesn't really have much of a plot going (yet) but from what I've seen, it seems like an episodic anime to me.\r\nFor those of you who do not like episodic animes, then don't watch, but for those of you who like Sket Dance and Gintama, then I recommend. This show is funny, likable, and overall you'll be very pleased with it. \r\nI feel a plot brewing, so don't worry- this anime has a direction! \r\nI can't give a completely accuratereview of this anime since only the first several episodes have been released, but I can tell that I'll enjoy this anime in the long run. \\n\\n\r\nThe art is good, and all the characters look unique and none of them are an eyesore to look at. There isn't a huge character cast yet, but most of them are likable, so no worries there.\\n\r\nI very much enjoy the characters voices, and those of you who are fans of Gintama, look out for two familiar voice actors! \\n\r\nThe OP and ED are both great, and this just seems like this show has a lot of potential if it gets far. \\n\\n\r\nI enjoy this anime and I am excited for the shows progression! I honestly don't have any negative points about the series at the moment, and I hope it stays that way. \\n\r\nMy overall enjoyment of the show is an 8.",
            "date": "2012-11-02T19:52:00+00:00",
            "helpful_count": 113,
            "mal_id": 76517,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SavageSmickey",
                "username": "SavageSmickey"
            },
            "url": "https://myanimelist.net/reviews.php?id=76517"
        },
        {
            "content": "If you come into this hoping for the standard sword & sorcery, historical/fantasy shounen adventure fare, you're probably going to be disappointed.\r\nI rather despise that genre, because they're all the same. Once you've seen one, you might as well have seen them all. They re-use the same tropes and devices, and don't much original fare to offer.\r\nThis series takes those tropes, and irreverently plays with them, providing parody and lots of unexpected content.  And trolling.  So bad it hurts.  I haven't had so many laughs over an anime since \"Daily Lives of High School Boys\" (which, incidentally, has the same director; who'salso the guy who did Gintama).\\n\\n\r\nThe princess isn't a sexy teen girl (she's not even cute enough to be a loli) and the sexy teen girl isn't actually even….\\n\r\nThe cute animal mascot (which EVERY hero group must have), is at war with the hero.\\n\r\nAnd, erm, \"crotch problems\" take center stage.  It's all about balls here, folks.\\n\\n\r\nBasically, you can watch it without knowing quite knowing what's going to happen next. Except that it's not going to quite turn out the way it's \"supposed to\", or at least, not the way we've been conditioned to expect.\\n\\n\r\nThis is a comedy that's given me lots of healthy laughs so far; I've watched through half the episodes, and look forward to seeing what curve'balls' are thrown at me next.\\n\\n\r\n[slightly edited from the review I posted on Crunchyroll]",
            "date": "2012-11-04T16:30:00+00:00",
            "helpful_count": 67,
            "mal_id": 76687,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/323383.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IceAndCream",
                "username": "IceAndCream"
            },
            "url": "https://myanimelist.net/reviews.php?id=76687"
        },
        {
            "content": "This has been on my list of show to watch for a while now. Having completed it, I would say it was a lot of fun. It's nothing deep nor is it anything overwhelming original. It's just fun. Fun can go a long way though.\r\nThe art and animation are unremarkable, though far from bad. The story is quite thin and simplistic. It rids on humor, some of which can be hit and miss. There's a lot here that isn't at all great. Regardless, I'd still give it an 8 just because the characters and the humor when it does work make it a silly, funride.\\n\\n\r\nThe characters here are quite likable. The main character is rather annoying at first, but he does seem to grow through it all and become increasingly likable. His traveling companions are more immediate. Princess Escarlate is wonderfully deadpan and amusing. Her knight Sanglain is serious and likable, while still crazy enough to provide good laughs. Mariandale is probably the best character the series has, having a great design, fun personality and being at times a surprisingly grounded and positive example of a transgendered character in a purposefully dumb shounen comedy anime. Rival Erecpyle and his subordinate team Incognito meanwhile offer big on comic mischief and are always fun to watch. All the while the party comes across minor characters who are sometimes equally crazy and fun. It's an appealing cast.\\n\\n\r\nThe humor is focus here, and as humor is a subjective thing, it's what could potentially curtail enjoyment of the show. Ixion Saga's humor is very stupid, irreverent and often immature. As audacious as it sometimes gets, it can be worth quite a few good laughs if you're willing to laugh at that kind of humor. Don't go in expecting particularly smart comedy though. If you have no use for silliness and willful stupidity, you will not find anything of value here. For those of us who do enjoy watching something just kind of silly and dumb at times though, Ixion Saga is a solid and rewarding pick.",
            "date": "2013-05-25T19:56:00+00:00",
            "helpful_count": 57,
            "mal_id": 98429,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=98429"
        },
        {
            "content": "Just finished watching Ixion Saga .Mixed Feelings about that one :\r\nIxion Saga can me summarized as an attempt to replicate the relaxed/wtf/lol?/laid-back style Gintama made popular in Anime .\r\nIn this style a lack of a greater overarching plot , comedy and dirty jokes , excellent sound-soundtrack choices and strange character are the standard .The style is great , Gintama that introduced it in the Anime industry a masterpiece .Let's see how Ixion Saga DT fared though :\r\nStory-3\r\nAs i said before the specific sub-genre/style Ixion belongs to lacks plot lines as it's main points .Even though i take that as a given , still Ixion Sagacould have fared much better: it tries to use the story both as a background and as a hook/point of interest , with the result being a failure in both attempts .The story is not absent - it is there , but it is ignored , resulting in some disbelief and boredom that could have been (easily ?Dont know .) avoided .The lack of progress endangers the whole series as the viewer can become tired of what seems as meaningless events , spawning at each episode like NPCs in a RPG game that is just too full of grind .And i know that the fans might defend the series reminding me that Ixion , like Gintama dont require a master story - yet still having seen and loved Gintama and even Sket , i have to commend that Ixion Saga's story can be compared with boring Pokemon episodes but not with the tense and emotional charged story arcs the two aforementioned shows field .\\n\r\n(Let it be known that the last episode has a much better written story than the rest of the show- a wonderful surprise rewarding us for making it to the end !)\\n\\n\r\nArt-6\\n\r\nNothing great , nothing good , nothing bad .\\n\r\nLately Art seems to have been standardized .I kind of miss the variety the 90s and the 2000s had : each show had it's own style for good or for bad .And there were always glitches to be found .The much cheaper/improved technology of today has eliminated visual errors and unusual/unique art styles from most series today.\\n\\n\r\nSound-8\\n\r\nIxion Saga has great sounds and soundtracks :the level was on par with Gintama !\\n\r\nDifferent music genres , familiar chords and styles , variation - the soundtracks were great and played a nice part in drawing you into the series . There was Rhythm and good taste in orchestration and song choices .And the most surprising fact is that i am not talking about the OP/ED - no , i actually didnt liked those two - i am talking about background themes .Very good on sound .\\n\\n\r\nCharacters-6\\n\r\nIxion Saga's Chars are interesting and funny : each has his own fetish plus some perks - and each gets a decent amount of attention in the show .And here is where trouble ensues :\\n\r\nthe characters while are interesting seem to have been made with some kind of character generator you can find for RPGs .They are too much replicas from the Gintama series- something that becomes even more obvious when you actually hear half the cast of Gintama playing as the main chars in Ixion Saga .There was a lack of originality - i find myself imagining the people that designed the character watching Gintama and saying to each other \"Ok that was good , what can we use instead of that ?\" .In short if you ve seen Gintama you ll see no new character concepts in Ixion Saga .They have somewhat recycled the chars from it .\\n\\n\r\nEnjoyment 6 - Overall 5\\n\r\nIxion Saga is a fun Anime and it sure is enjoying watching one .With all the the lack of originality it still has some entertaining value .However -and with that i sum it up - this show has copied Gintama at so many major points , so obviously that one can clearly feel the lack of dedication and investment from the creators  .And since those two things are what make an Anime interesting and enjoying to watch i can say that this show is worth watching without lying .\\n\\n\r\nIxion Saga is for Gintama what the many industrial Harem anime are for their originals .",
            "date": "2013-05-15T08:24:00+00:00",
            "helpful_count": 27,
            "mal_id": 97259,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1395013.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/allos",
                "username": "allos"
            },
            "url": "https://myanimelist.net/reviews.php?id=97259"
        },
        {
            "content": "Recommended if you're in the mood to \"LAUGH YOUR BALLS OFF\" (A pun you'll all understand if you watch this show!)\r\nAs I am beginning to write this review for any person interested in watching this FANTASTIC anime, I finished the last episode ten minutes prior.\r\nBeing truthful, I am a big Sword Art Online fan, but the amount of people who are comparing anime that involve a virtual reality or some sort of relation to gaming to Sword Art Online is ridiculous, which is why I'm making this review completely unrelated to Sword Art Online, including Accel World which is also made by the same personwho made Sword Art Online.\\n\\n\r\nStory\\n\r\nThe story of Ixion Saga DT is about a teenage boy who was transferred to another world, like a game. Before he was transferred, he was the strongest player on an MMORPG game he was in a boss fight on, then suddenly being caught off guard and losing to the boss, he met a beautiful woman who asked for his help, what he didn't expect was she was a strange being who transported him to an alternate world called Mira, then his journey began with a few others he met by coincidence, where he became a servant to a princess, in order to save the world, they have to fight. (The second girl he travels with that has green hair is a strange one, believe in me! You'll be in for a treat with this one!)\\n\\n\r\nArt\\n\r\nThe art style of this show is great, the reason why I say this is because it's not incredibly defined like most anime are today, the animators didn't spend too much time worrying about how impressive the art was, thus some parts were sloppy, but what FASCINATES me is that the colors and effort they put in to every little detail was MIND BLOWING! This is another reason why I loved every episode to this anime!\\n\\n\r\nSound\\n\r\nAlthough I say everything is truly remarkable with this anime, the only issue I found with the anime was some parts of certain episodes were a bit off, I would give an instance but I couldn't really bring myself to spoil such a masterpiece, the sound was still enjoyable, that's what matters!\\n\\n\r\nCharacter\\n\r\nOH. MY. GOD. The character development that the team that worked on this show seriously put amazing effort in!!! The different types of personalities that each character's have is crazy! I could even say that this anime may possess one of the best character development I've ever seen! Not just the personalities are strongly different to each other, but the characteristics and actions each character has and presents in certain situations is great, I loved every single character, no matter how evil or heroic they were, or even idiotic! (trust me, there's a lot of idiots in this show, the main one being the male protagonist!)\\n\\n\r\nEnjoyment ?\\n\r\nIf only there was a better word to describe how enjoyable something was other than the word \"enjoyment\" itself!\\n\r\nI've been on a long spree of anime recently, I didn't think I could find much better anime than things I've previously watched (which is a lot of anime!) but sweet mama.. Was I wrong.\\n\\n\r\nOverall ?\\n\r\nI want to solely declare that this anime is perhaps one of the best anime ever created.. Seriously. More so, I want to thank the people who put their time and effort in creating this masterpiece, personally. The amount of LAUGHTER I had in every episode of this show was crazy! I had trouble breathing (for real, I have asthma!) -- So yes, thank you so much for this anime. This anime, personally I'd say is the..\\n\r\nFUNNIEST ANIME OF ALL TIME WINNER -- Awarded by iAkali.\\n\\n\r\n(I'm doing \"Awards\" for anime that I find are worthy of such, also opening a YouTube channel for reviews so I can give a much better review with visual aspects. I will be talking to someone in hopes of YouTube Partnership and the such. I definitely recommend this anime to anyone who loves to laugh!)",
            "date": "2013-05-31T10:11:00+00:00",
            "helpful_count": 22,
            "mal_id": 99119,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2486375.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iAkali",
                "username": "iAkali"
            },
            "url": "https://myanimelist.net/reviews.php?id=99119"
        },
        {
            "content": "DT,DT,DT,DT,DT,DT,DT, DT Sutero, 'nuf said, as I've finished watching the last episode of this no good 25 episode thingy, normally if something is not good I drop it, but this one was different, it was no good alright, but it does have it's silver lining, since there were episode that are enjoyable and there were those you'll just skip. Co'z this was not the kind of anime that one must categorize it as a whole but it was something that has to be categorize on a per episode basis, and frankly, that's what director Shinji Takamatsu was aiming, he probably wants us audience to forgeteverything what was this anime about and just focus on each episode, in other words this anime as a whole was more of a gag type than anything else, since there was no plot to begin with just a scenario on a per episode basis. \\n\\n\r\nSo, here are my ratings for each of this anime's category:\\n\\n\\n\r\nPOOR 3.\\n\\n\r\nStory- like I said, there is no plot just situation that on every episode and each episode has a plot on it's own.\\n\\n\r\nCharacter- regardless of the characters info.........something that one must just forget, co'z on every episode that characters take a new form, which one would be irritated with, at one point in any given episode and appreciated on the other.But I'm sure everybody will agree with me that Kon is one big loud mouth a***** that everyone wants to take a swing at, and Erec and his Incognitos are a bunch of retards, as for Mariandale, I'm also sure that everyone will agree with me that she should've have been cast as a girl and not some cross-dressing man.\\n\\n\\n\r\nGOOD 7.\\n\\n\r\nArt- I like the design and the way the character's where illustrated and I'm referring to  Mariandale, Almaflora , Ecarlate and  Sainglain. I also like the way how them Incognitos were drawn.\\n\\n\r\nSound- though, Kon maybe the kind of character whose butt  I wanna kick, I still like the guy who did his voice, the same with Erec and his Incognitos. I also like this anime's opening theme, but not the closing.\\n\\n\r\nFAIR 6.\\n\\n\r\nEnjoyment- I gave it a 6 because, there are episode that I find it funny and there are those episodes that where downright corny.\\n\\n\r\nOverall- this is something which it would depend on oneself if which episode that's worth watching and which are worth skipping. Frankly, studio Brain's Base should have just leave it as an on-line game than make an anime out of it.\\n\\n\\n",
            "date": "2013-04-04T11:55:00+00:00",
            "helpful_count": 13,
            "mal_id": 92397,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=92397"
        },
        {
            "content": "Despite people saying this is unoriginal. With so few episodes that even now is a wrong thing to say. The commonly said anime this is \"similar\" to is probably SAO because it is all people know. This anime is not trendy. It just has the bad luck of existing at the same time as the most over rated anime in history. Which is... yes... SAO. Thus far, the only tie this anime may have to SAO is extremely minimal. The MC may be in a video game. It starts off with him meeting a character in a video game and he ends up in aanother world somehow. Given the name of the anime {Dimensional Transfer\" (DT) i wouldn't say it is a video game he is trapped in. Seeing as the characters in the supposed \"game\" have unique personalities and 0 NPCs are in it, i doubt this is about a kid in a game. SAO kids just wanna cry cause this isn't SAO. Their beloved over rated anime that they have to trash other animes because of. Don't listen to SAO fan kids. This anime is nothing like SAO. If anything it is similar to Gintama in many ways and that is a great thing. You know it has potential if Zoro's voice actor is in it. (OP, Ao No Excersist, D. Grey-man, Bleach, samarui champloo... etc..) The list of great animes Nakai has voice acted in are mostly good to great. Don't knock this anime because of mad SAO kids. Give it a shot because it is funny and has a unique story behind it. Nothing seems to suggest he is in a video game so far. If he is which he might. I'm not ruling that out completely. It doesn't seem to be a normal MMO at all if he is in fact in a video game. Some kind of virtual reality could be the case. He gets hungry, he sleeps, and yet there is no technology like \"nerve gear\" attached to him to create such affects in his brain. Thus to me he is actually experiencing all that you see. The lack of NPCs is proof enough. Even in HxHs Greed Island there were NPCs. Yet as of now i have seen none. Only complex characters that seemingly could not be NPCs. So ya SAO kids have no idea what they are talking about at all. They see what they want to see and they see something to hate because they think it is a cliche SAO anime. Yet they have never given any proof as to how it is like SAO in any way. I have given plenty of proof to how it is nothing like SAO. Don't listen to them. Watch this and enjoy.",
            "date": "2013-01-17T00:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 83925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1719881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Theliel",
                "username": "Theliel"
            },
            "url": "https://myanimelist.net/reviews.php?id=83925"
        },
        {
            "content": "Ixion Saga DT starts off in a similar trend to a lot of the recent MMO animes. In other words: the protagonist is an MMO player (A somewhat good one or great one at that) and somehow gets intertwined within the game itself. \r\nThe thing is, Ixion Saga DT doesn't really shine in any category. In terms of action, there isn't much incredible fighting nor abilities if that's what you're looking for. In terms of humor, it's generally lame slapstick and puns. Story-wise, there isn't much depth to it and the development is incredibly slow (4 episodes in and they spent an entire one onslapstick humor with a flying squirrel-like creature) and rather mediocre. \\n\\n\r\nThe characters aren't very interesting either. You have one gamer that's almost perfectly normal with no standout qualities, one tranny that drawn moe style (Which isn't really that funny), one blockhead fighter and a princess which is a child.\\n\\n\r\nIn other words, you're in for a rather bland anime with some lame slapstick humor and a mediocre storyline. It's like a cross between pokemon, in that they travel to different places fighting bad guys, and a try-hard version of gintama (Except gintama is actually funny in innumerable ways this series is not).\\n",
            "date": "2012-11-03T23:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 76639,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1715781.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Jose-sama",
                "username": "Jose-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=76639"
        },
        {
            "content": "The only word I can think of for this series is average. The graphics aren't beautiful, the characters don't have much depth, and the plot isn't praiseworthy. \r\nOne of the specialities of this anime is the comedy, which I found okay, but not hilarious (unlike Gintama). Although I've seen other reviewers compare this to Gintama in terms of the episodic and comedic moments (the inapropro jokes about balls), the jokes are less natural and more forced and tend to be more repetitive.\r\nAs I've only seen 3 episodes, it's not a bad series; however it's a worthwhile watch only if you're bored and want a fewquick laughs. And hopefully, the episodes will improve as the season continues.",
            "date": "2012-11-04T09:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 76667,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1714123.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/caxxke",
                "username": "caxxke"
            },
            "url": "https://myanimelist.net/reviews.php?id=76667"
        },
        {
            "content": "What can I say about Ixion Saga DT. There is enough here to want to watch it at least once. So far the series has been a bit disappointing except for the humor category.\r\nStory (5) - The story is about a kid who gets transferred into what seems like a game. I'm not really sure what the story is fully about yet and I've seen 15 episodes. Development is really lack and slow in this category but, you do find out some interesting facts about the main cast as well as the enemies. The enemies don't even feel like enemies at this point. So youpractically don't know who you are fighting until episode 15.\\n\\n\r\nArt (6) - the arts not bad at all. I'd say pretty fair, nothing extravagant or crazy. Not super appealing to my tastes.\\n\\n\r\nSound (7) - I gave this a bit of a buff because I kind of liked the rock feel that was coming from the opening and ending. Definitely one of the better parts of the series.\\n\\n\r\nCharacter (7) - The development of the characters is actually decent. Some episodes are a little cheekish and stupid at best. Seems like a bit of a waste listening to a story about someones past for a WHOLE episode and finding out it's fake seconds later. \\n\\n\r\nEnjoyment (6) - The humor is the best part of the show. If you want to laugh at some points its worth it. There hasn't been much action or anything else at all.\\n\\n\r\nOverall (6) - If you want to sit down, enjoy a series, and get emotionally attached, I suggest something else. This series has been a total comedic relief so far. I hope some interesting factors start taking place eventually.",
            "date": "2013-01-22T18:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 84559,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1989300.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BentoLegend",
                "username": "BentoLegend"
            },
            "url": "https://myanimelist.net/reviews.php?id=84559"
        },
        {
            "content": "Japan seems to be pumping out some trashy anime lately (e.g. Blood-c & Blood-c the Last Dark) and Ixion Saga DT just happens to be one of them. So if you're done with intelligent anime productions and would like to feed your eyes and mind with complete garbage, then look no further cause surely you've come to the right anime. \r\nISDT follows Kon Hokaze's arrival in this new world he's arrived in. Through many odd circumstances he ends up being paired with a lolicon princess, a male turned female transvestite and a generic looking strong soldier. He also gets tagged by his new foes withthe nickname \"DT\" which is the shortened form for \"male virgin\" in Japan. I mean who laughs at virgin jokes anymore? Well even I would if it was sold properly but the joke fails every time its used here, why? Many reasons. For one the writers arent all that proficient in comedy writing and another reason could be the voice actor for Kon but I'd still blame the character he's written as and the lines he's given. The horror of this becomes apparent when you realize this is going to be a recurring joke throughout the anime. ISDT does succeed in some funny jokes though, but they aren't nearly enough to have you put up with 25 episodes worth of garbage and its other bad/fail/force-fed jokes.\\n\\n\r\nThe viewer is taken to generic locations prominent in anime like the beach/a hot springs bath (onsen) and shown all the stereotypical things you'd expect if you've seen enough anime. Whats worse is whole episodes are wasted in such places doing nothing, the story dosent progress and if you didnt know any better you'd think they were filler episodes put right at the beginning of an anime. It wouldnt be so bad if these \"fillers\" were any good but sadly they arent.\\n\\n\r\nThe art scores highest amongst everything else this anime offers but its not perfect either. You still got a couple of scenes switched with crappy animation. The sound is just sad. The show starts off with this intro where it feels like the words \"DT\" are being shoved down your throat. Then you get this voice acting that seems at odds with the characters they are cast as. Its almost like you can tell they are trying hard to make you laugh. Its not so bad when you actually laugh but you'll probably feel sorry for them when you dont since they seem to be trying so hard or you might just drop the show for realizing the crap that it is.\\n\\n\r\nCharacters are rubbish. Kon the main character is filth of a character. If ever he had a strategy for his enemy and it failed, he'd resort to any underhanded cheap shot available to him even if its something like kicking another dude in the nuts. The lolicon princess is smart and haughty while retaining some child like qualities. The strong/brute swordsman likes cute things but I guess that was tacked on to make him less one dimensional? He still is one dimensional imo. Then theres the beautiful trans girl who cooks, gives advice and sometimes talks with a deep manly voice while also supposedly perfect/role model like? Psh, rubbish. All the characters generally remain the same only tweaked sometimes to make another good/bad joke. The only character I liked was Erecpyle, a major foe who is honorable and fights clean but this is probably due his stark contrast with Kon who fights dirty if need be. I did sometimes find Kon interesting and entertaining but other than that he was just as annoying as every other character in the series.\\n\\n\r\nAs you might be able to tell I didnt enjoy this show but I sat through it just so I could review it in its entirety. Cant really say it was worth it but at least I can let others know there's no light at the end of the tunnel here. To those thinking it might get better in later episodes or have some secret plot twist like Blood-c, well heres me telling you no, it doesnt. You do get some explanation of things somewhere around episode 21 but its not anything serious.\\n\\n\r\nIn my opinion I think some people who are proficient in anime production sat down after seeing Gintama and thought they could do something along the same lines and make some bucks. This anime is the result of their failure. Despite how Gintama comes off as unserious an half-assed, alot of intelligence and work is put into it as well as comedic talent. There are comedic geniuses at work in Gintama so its sad that this sub-par anime even gets to be compared to it.",
            "date": "2013-04-01T10:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 91935,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1180579.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/yemsols",
                "username": "yemsols"
            },
            "url": "https://myanimelist.net/reviews.php?id=91935"
        },
        {
            "content": "Ixion Saga DT is an anime based off of an online game, because those are known for their compelling narratives and not the high amount of repetitive grind at all. Although, to be fair to the concept, I've looked at an anime based off of a Pachinko machine that was quite good. The anime was written by Yamatoya Akatsuki and developed by our old friends at Brain's Base. Which is a bit of a mixed sign since they've done some good stuff, some kind of mediocre stuff and some stuff that's utter shite. Let's see where this one falls.\r\nStory:\r\nYoung Hokaze Kon is a gamer. Whileplaying Monster Hunter, or a game with very similar encounters with massive monsters, he meets a young lady player. They talk and she manages to get him to agree to help her. Which results in him being transferred to another world, chair and all. He accidentally falls on top of a man, saving a small group that was being cornered by him and his goons. Kon agrees to travel with the people he inadvertently rescued in order to find a way back to his own world. Together, they head on their journey to get an eight year old princess married for political reasons while also finding a way for Kon to return so he stops bothering everyone with his existence. Various shenanigans ensue.\\n\\n\r\nThe most pervasive problem with this series is the humour. It's built around subverting tropes and doing the unexpected. However, half the time it just draws attention to the fact that what it's doing is clichéd and it's jokes that are actually subverting regular tropes are mostly really obvious, making the punch lines predictable before the set-ups are even done. The consequence, in either case, is that the comedy falls pathetically short. The story itself is very shallow, relying heavily on those comedic elements both to provide entertainment and to distract from the obvious element that's incredibly not okay. Another issue with the comedy is that the series likes to repeat itself. There are multiple cases where they'll have a jape and then quickly repeat the jape twice more in a very short amount of time. I guess they just really wanted to run those jokes into the ground or maybe they thought if it didn't make you laugh the first time, it would the third time.\\n\\n\r\nTo its credit, there are a few funny scenes and the stuff that doesn't work is more stupid than it is annoying or painful. I also do appreciate the way they subvert the usual unfunny trans-gender jokes you get in anime.\\n\\n\r\nCharacters:\\n\\n\r\nMost of the characters in this are just boring and pretty one-note. Then you have Kon himself. He's the worst part of this series. Definitely among the more annoying protagonists I've seen. Yeah, he's better than Shinji Ikari, but that's not saying much. On the plus side, the moments where he's in pain are cathartic.\\n\\n\\n\r\nArt:\\n\\n\r\nThe artwork is pretty good. The background details are nicely fleshed out. The biggest issue with it is just that the comedic exaggeration scenes can be excessive and, like the comedy in general, they don't really work well.\\n\\n\r\nSound:\\n\\n\r\nAs a whole, the acting is perfectly passable, but not anything great. Fukuyama Jun does really well making him one of the few male voice actors I've heard play a female character well. Eguchi Takuya, in contrast, is really bad in this. To be fair to him, he was good in OreGairu. In this case, he wasn't given much to work with. I don't think anyone could have made Kon's dialogue sound good.\\n\\n\r\nHo-yay:\\n\\n\r\nThere's a little. It's established early on that Mariandale attracts both men and other women.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nIxion Saga DT is not a good series. The comedic elements largely fall flat. The main character is a constant annoyance and there's just not much to recommend it. That being said, I wouldn't call it terrible since most of its faults aren't particularly egregious. My final rating is a 3/10. Next week is the notorious Byston Well Monogatari: Garzey no Tsubasa. It's supposedly really atrocious. The week after that it'll be the 300th anime review. Until then, may you experience kindness, laughs and tranquillity.",
            "date": "2016-08-03T13:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 225852,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=225852"
        },
        {
            "content": "(Updated April 1, 2013 -- after seeing the final episode.)\r\nAfter watching “The Daily Lives of High School Boys” and almost dying from laughter, I made a little research and found this show. I have been meaning to find the funniest anime out there and this is perhaps the funniest one I have ever come across with. \r\nDespite this near death causing anime, this is not for everyone. If you are innocent or do not enjoy dark or perverted humor, which this anime has a lot of, then this is not the show for you. \r\nStory (8/10)\r\nThe story is good but not mind-blowing. It has asimple story – people going on a journey with a twist of typical war elements that you usually see in mecha anime, a few pinches of gaming fantasy elements and other illogical and unfitting genres. What makes the story kick, though, is the comedy that this show possesses. The ending, especially, would make you die of laughter. Despite that, unexpectedly, it would also make you sad at the same time once you finished this series.\\n\\n\r\nSo why did I give it an 8, you may ask? I know the story is stupid but sadly it works. Its stupidity actually works. As a parody or a comedy series, it is good. As an original work of literature or as a masterpiece, forget about it. \\n\\n\r\nArt (7/10)\\n\\n\r\nThe art is nicely laid out and fun to watch. The characters are drawn differently from one another and stand out on their own. The only thing is that the main characters roughly represent a lot of look-alikes in other popular shows such as how DT looks a lot like Mashiro from Bakuman, ED looks a lot like Kakashi from Naruto, Marian looks a lot like C.C. from Code Geass and so on. Though, still, this show is still a pure-bred comedy that contains a lot of parodies and these look-alikes may be taken negatively or positively depending how you look at it.\\n\\n\r\nSound (9/10)\\n\\n\r\nWhat can I say? Even the music that they provide is funny as hell. The ending songs are funny and perhaps a bit perverted. Aside from being funny, it is also catchy. Since it was coming from the same director as Gintama and DLOHSB, expect a similar feel in their sounds. It was nicely done and did a great job bringing the funnies.\\n\\n\r\nCharacter (10/10)\\n\\n\r\nAll of the main characters and even the supporting characters have strong and funny personalities and not to mention a lot of strange fetishes. They have also provided the audiences to soothe their own fetishes that range from a typical Lolita and otaku, cross-dressers and a bit of shonen ai, to sexy SM men. \\n\\n\r\nOverall, despite having a simple, and somewhat, even stupid mixed up story, for someone who enjoys this type of comedy and gamers, especially those who loves RPG, since they've thrown in a few dash of gaming otaku jokes which is also somewhat a reference to The World God Only Knows, would most definitely enjoy this show as well. \\n",
            "date": "2013-03-31T00:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 91727,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1897606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RedvelvetDaisuki",
                "username": "RedvelvetDaisuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=91727"
        },
        {
            "content": "This show commits the worse crime a series can commit. It is boring. This is really nothing more than ball joke after ball joke, not even well told. Its disgusting, perverted, and really, really uninteresting.\r\nThe only interesting part for me was the villain ED (a not so subtle reference to erectile dysfunction), who loses both of his testicles thanks to the actions of the main character. In episode 4 we see just how this affects his personal life, him struggling with this issue and wondering how he can tell people, especially his fiancee. My heart just broke for this guy, it was honestly painful towatch.\\n\\n\r\nWhen the best part of your comedy series is a tragedy, you know you're doing something wrong. Just stay away from this anime.",
            "date": "2013-02-12T12:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 86627,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1148563.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/nobody25864",
                "username": "nobody25864"
            },
            "url": "https://myanimelist.net/reviews.php?id=86627"
        },
        {
            "content": "Shortly: \r\nIf you like episodic anime with kind of strange, black and pervert humour, don`t be mistaken with other reviews: Ixion Saga DT does not fit you.\r\nAnd some more letters:\r\nOk,  it has some balls and sudden jokes, but no more than 20% of screen time, so the rest of time you will enjoy standard  noisy hero, not-cute loli (she is quite interesting character, but annoying at the same time), trap with boobs (middle-century fantasy knows plastic operation or it is a fat in push-up?) and a big guy with big sword (I wonder why my lovely Nakai Kazuya acts so bad as him:( ). It may sounds interesting, but it`s not.\\n\\n\r\nI will not complain about incongruities, cause it`s just a comedy in fantasy world, but still they don`t use that opportunity as that did creators of One Peace or Gintama. I mean, in these series illogical stuff is really illogical and makes bad feeling.\\n\\n\r\nWhy you can enjoy it: because of seyus. On the other hand a lot of great VA don`t sound great here, so if you watch this very average anime just for hearing favorite voices, you will get nothing but voice. Maybe after third ep they will act better... Anyway there is nothing outstanding in Ixion Saga. \\n\\n\r\nSorry for my bad english. I hope it was helpful for you.\\n\r\nFeel free to write your opinions to me.",
            "date": "2013-03-11T09:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 89399,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238568.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Banu02",
                "username": "Banu02"
            },
            "url": "https://myanimelist.net/reviews.php?id=89399"
        },
        {
            "content": "This is probably one of the most not-so-serious anime I've seen with those genres, of course meant in a good way. \r\nThe first episode made me want to drop the anime but I didn't, I continued and realized that the humor was the humor I enjoyed. The male protagonist Hozake Kon is hilarious and a character you can't hate.\r\nThe art is good, it's in my opinion very average that it starts to become very good in some way? As for the story, it's not that special but it's definitely there so it's not just some raw random anime with humor in it. \r\nThe character ofthis anime are all eye catching and they do all play a part of the anime, they have different personalities and positions in the anime surrounding the main protagonist Kon. They are all weird so they make a good first impression in your head so you will not forget the characters here.\\n\\n\r\nWell you will either hate the anime or like it, it depends on your humor and how you look at it. For me, it has just been raw enjoyment so far. The battle scenes aren't that bad, they are \"unique\" in many ways. \\n\\n",
            "date": "2013-02-17T04:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 87035,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2186905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Vertios",
                "username": "Vertios"
            },
            "url": "https://myanimelist.net/reviews.php?id=87035"
        },
        {
            "content": "I have to start this review out by stating that I have never posted a review before. I normally leave that to others. I am only doing so because I loved the show that much.\r\n I have seen a decent amount of anime and have to agree with savage and iakali. This is a very humorous anime I have never laughed  this much over one anime show and the humor is not all one liners. There is a plethora of continuing humor through out and only two episodes I remember skipping. \r\n     The story line is supposed to be predictablethat's where a lot of the humor comes from. I rated the story line with that idea in mind. \\n\r\n    The art as well did its job wonderfully , its not to detailed so as to create excessive seriousness. Neither does it appear careless and the facial expression highlighted the humor very well.\\n\\n\r\n  I personally will only give one of any category a 10, because I feel 10 should be reserved for the best. I am inclined to give this show my 10 for humor. However I feel the need to get a few more shows under my belt before I'm confident in finalizing that score. so I will add that while I gave this show an overall 9 for me it has the rating 10 humor potential.",
            "date": "2016-10-05T18:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 231166,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/crazypitts8",
                "username": "crazypitts8"
            },
            "url": "https://myanimelist.net/reviews.php?id=231166"
        },
        {
            "content": "Okay i have to admit it was hard for me to enjoy it at first .. but it gets alot better to the end ^^ \r\niwould say if you like sort of premature humor, very interessting slightly confuseing characters and an interessting world i would say this is for you. It's a parody towards alot of anime and basically the main plot is about balles and loseing your DT (virginity iwould assume) its kinda flashy crazy and totaly unexpected^^. \r\nIwould say if you have enjoyed something like gintama or simular stuff DT is something nice an fresh. \r\nI do admit i am not the greatesfan of anime that mainly gets its jokes out of makeing the main char fail in alot of ways (thats why i can'T really get it with gintama) but in Dt after 12- 15 episodes i kinda got along withthe slight disadventages they gave the main chars ^^.\\n\\n\r\nanyway if oyu would like to watch an anie with fantasy setting and a lot of \"gay\" humor(youll get it if you watch it) feel free to give it a try.\\n\\n\r\nif you expect a simular anime to SAO or Log Horizon (like i did and that s why i started it) damn stay away from it. ....it may have a simular setting (parlty makeing joke towards SAO) but it is defintly not an SAO. .... well maybe the addition towards this series is ^^ cause i kinda couldn't stop watching even if i wanted to ^^  hehe ....",
            "date": "2015-09-12T17:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 198430,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ManiX207",
                "username": "ManiX207"
            },
            "url": "https://myanimelist.net/reviews.php?id=198430"
        },
        {
            "content": "Ixion Saga DT may well be one of the below average anime I've seen. The art is could be a lot better as I've seen better art even in hentai. The fight seems are short so there isn't much to it and the plot is a typical main character who magically winds up in a new world and has mysterious powers that are uncommon in the new world but he soon finds out others have the same power. Now after two minutes of bashing on this anime the only good thing that's worth mentioning is the humor of this anime. Yes this anime is goodon the spectrum of blowing air out of the nose instead if laughing.",
            "date": "2012-12-29T21:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 81902,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1965734.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DatLilPaNda",
                "username": "DatLilPaNda"
            },
            "url": "https://myanimelist.net/reviews.php?id=81902"
        },
        {
            "content": "Ixion Saga DT is a satirical comedy with just the right amount of slapstick to please and not annoy. It has a great cast of characters, and plenty of mini story lines to please the casual anime viewer. It even has an appropriate ending for the series which seems to really be lacking these days.\r\nThis satirical comedy is fantasy based. It's a simple plot, but it works well enough. Basically Kon gets transported from sitting at his computer playing video games to a different world. In this new world he's supposed to save it somehow by using his hyperion powers. He is in no waya warrior, and the group he accompanies is filled with strong weirdos. This series is bizarre, yet I found it highly enjoyable.\\n\\n\r\nFrom the very beginning you are immersed in a ridiculous world that is different yet the same as ours. There's a princess, a muscle bound warrior, a dress wearing gunslinger, and then Kon. They are being chased by another group, and the larger story unfolds slowly throughout. Each week is a different themed episode, and it's all comedy. It has great cast, good animation, catchy theme music, and overall it's done well. If you're looking for a new comedy then this could be it.\\n\\n\r\nI highly recommend this series. It's a great time filler and it is full of laughs.",
            "date": "2013-04-01T00:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 91881,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/568293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/explicit707",
                "username": "explicit707"
            },
            "url": "https://myanimelist.net/reviews.php?id=91881"
        }
    ],
    [
        {
            "content": "Reading the summary of this anime I thought to myself; This sounds like it might be something fun and funny. After watching the whole thing through I would like to adjust that conception.\r\nFunny yes, Fun not so much. The whole show is carried by its humor. I'm not saying that that is bad. The humor is very well placed and set throughout the episode, however It lacks pretty much everything else.\r\nThe story is plainly just there to keep the jokes themselves coming, the characters themselves have no real depth, the plot is followed but again there it only seems to be existent to hold itall together for the humor.  If you are all into watching something to just laugh hard then sure this is a good one for you. However if you are looking for something that isn't just only humor and is well balanced, then I suggest you turn away and look someplace else right now.",
            "date": "2016-04-14T19:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 216392,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5002173.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/EternalAnimeGuru",
                "username": "EternalAnimeGuru"
            },
            "url": "https://myanimelist.net/reviews.php?id=216392"
        },
        {
            "content": "If you're looking for a comedy anime with good characters, look no further. I actually found this anime quite enjoyable. Unlike the mainstream funny anime these days, the characters in it aren't totally plain and don't just sit around doing nothing while cracking up jokes. It also actually has a plot. To me, this made the anime much more funny and enjoyable. In fact, I think the only thing I hate about this anime is one episode where it turns into something completely different. \r\nPlot: Yes, it has a plot, too (unlike the mainstream comedy anime). A lot of people complain about how \"unoriginal\" theplot is in this but honestly, I never saw a plot like this in any anime I watched. They are probably referring to SAO when they say that, but the ONLY similarity they have between the two is a fantasy/video game aspect. Which, a lot of animes have these days. Just because they share a genre does not mean they are similar; and yes, they aren't similar at all. \\n\\n\r\nCharacters: The characters have to be the highlight of this show. They take your ideas of \"knight\" and \"princess\" and do the complete opposite, in a way that actually works well! Of course most of the characters are the way they are for comedic affect, but they are all different and I would even say original. Good characters you can relate to makes animes like these even more funny. Even the main character isn't the mainstream male protagonist, who is usually a guy with brown/black hair who is quite boring and plain personality wise. No, the main character here is a complete idiot with green hair and an ego that can reach a skyscraper. Pretty much all he does is kick balls (literally) and complain about his virginity, but I wouldn't want it any other way.\\n\\n\r\nAnimation: To be honest, when I first saw this anime I thought it must be old because of the drawing style. And then I looked it up and saw how new it was! The animation itself is great and flawless, while the drawing style is a bit outdated. But that doesn't make the anime any less enjoyable!\\n\\n\r\nSound: I can't remember any of the theme songs for this anime. That is both a good thing, and a bad thing; good being that they weren't horrible, and bad being that they aren't great. On the other hand, the opening song, even though I did not like it at first, is catchy, memorable, and fitting. Same goes for the second ending song, which as soon as it even  popped up, I fell in love with. \\n\\n\r\nEnjoyment: This anime made me laugh so much and made me happy when I felt sad one day. It's comedy never fails to surprise you. And all of it actually makes sense (in their own special weird way); well, besides a few things that make you go \"wtf.\" I personally loved this anime to death and will remember it for years. It's not the mainstream comedy of just watching it, laughing a few times and then forgetting it in the future. This anime is quite original despite what everyone says. I'd have to say the only bad thing about this anime is that, while it has one, it's plot is quite boring and forgettable. But if you don't mind that, it's a great anime with memorable characters and op/ed songs. Like I said at the beginning, the only thing I absolutely hate is one episode where it throws it's originality and it's own special charm down the toilet. Either way, I hope you enjoy this anime as much as I did :D\\n\\n",
            "date": "2013-05-26T07:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 98473,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1113599.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BananaBee",
                "username": "BananaBee"
            },
            "url": "https://myanimelist.net/reviews.php?id=98473"
        }
    ]
]