[
    [
        {
            "content": "Edited this review by the way :)\r\nGrammar Nazis? GTFO lol. This review is not for you. Why not create your own then? :P\r\nGlad that my friend let me watch this great stuff.\r\nOkay now let’s start. \r\nWhat will you do if you will become a powerful commander?\r\nStory: 9/10\r\n\tThe story revolves around Nura Clan. A Clan of “youkai” that controls 10,000 demons. Amongst them is what they called “supreme commander” a very powerful “youkai”. \r\n\tNow for the protagonist story so far. Nurarhiyon no Mago didn’t lack story backgrounds at all. They explained what happened in the past with the right execution. Except for the flashbacks that hisseason lacked. The jabs also were at the right timing and in the right scene.\\n\r\n\tThe first antagonist didn’t lack also the background which is a factor plus because you know why he did that and those. Over all pacing are great. There is no filler. None at all. Some scenes from manga are cut here and placed at the second season instead.\\n\\n\r\nArt: 8/10\\n\r\n\tIMO the sword/katana fighting are the main stream of this, the animation was great. Also the opening credits were great it’s well drawn. The ending credits weren’t that good compare to the opening.  The chibi or the miniture forms of the characters didn’t fit. The genre of this was supposed to be \"Monster\" not a \"Cute\" or \"Moe\" one.\\n\r\n\tThe youkai are well drawn, Animations are really great.\\n\\n\r\nSound: 8/10\\n\r\n\tOpening song was great. Fast Forward by Money Majik. Every time I’m listening to the full version I also sang.The BGM when Nurarhiyon attacks a youkai has a good execution. The back ground tracks fit every scene Nurarhiyon no Mago has to offer.  What destroyed the good sounds is the ending song. It didn’t fit what genre nurarhiyon has. The 2nd one didn't make it for me either.\\n\\n\r\nCharacters: 8/10\\n\r\n\tThe characters fit what personalities they have.  Adding characters while the story progress with their background is also a plus factor, at the same time Rukio is “growing” every episode. They also didn’t lack time executing who is going to “grow” with the explanation.\\n\r\n\tThe character development is great. Overall the adaption from the manga onto an anime didn't lacked anything except less than 10 chapters form the start but not that huge character back story. Try to read the manga first rather knowing it here (at the review)\\n\\n\r\nEnjoyment: 9/10\\n\r\n\tI really did enjoy this.  Various scenes will be enjoyable while watching this.  You will be caught in suspense, laugh at the jabs and get excited on the katana fights. And this anime already leave a huge impression to me and still continued for the 2nd season!\\n\\n\r\nFinal Score: 9/10\\n\r\n\tIt’s up to you to decide whether you gonna watch this or ditch it, but imo this anime is great. The jokes are in the right time. Great Music and the BGM is really mixed on the scenes. Great Art and Character development.\\n",
            "date": "2010-09-06T06:48:00+00:00",
            "helpful_count": 136,
            "mal_id": 30278,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/180094.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Xynz01",
                "username": "Xynz01"
            },
            "url": "https://myanimelist.net/reviews.php?id=30278"
        },
        {
            "content": "If there's one word I could describe Nurarihyon no Mago, it would have to be BORING. \r\nHaving read the adaptation I really had high hopes for this series as the formula to which Mago is about, is seldom used in shonén anime and if done right, would have definitely been one of the better series for 2010.\r\n...but like I said, BORING. Here's why:\r\nStory - 8\r\nNurarihyon no Mago is a tale of the supernatural. It's a tale of demons and spirits and the co-existence between their kind and ours. It's also a tale of Rikuo Nura and how he takes over his grandfathers clan known asthe Hyakki Yakō, a clan made up of yōkai(demons) and other familiar spirits of Japanese folklore. Nurarihyon no Mago is about the trials and tribulations Rikuo goes through to achieve being the head of that clan(to which at first he has no interest in) while knowing that he is only a quarter yōkai himself. \\n\\n\r\nWhat makes the story even more interesting is how the Nura yōkai clan portray chivalry, similar to those you'd find in yakuza(Japanese gangster) movies, and how this series uses fear to gauge their strength. \\n\\n\r\nNurarihyon no Mago is Rikuo's story, as he struggles to find his place between both worlds, and it's a tale of superiority between other yōkai clans as you'll find in the second half of the series.\\n\\n\r\nSo far so good right? So what went wrong?\\n\\n\r\nArt & Animation - 6\\n\r\nThis is where it was a miss for me. While I was happy the art stayed true to Hiroshi Shiibashi's manga, giving you a richly detailed account to Japan's yōkai like you'd find in an old Japanese tapestry, I was really disappointed in its animation. For a shonén title, the series really lacked 'fluidity' for a better word making each scene seem like your watching still-frame art from the 90's. The execution and pacing was lacking and for a series made late 2010, the choreography was non-existent.\\n\\n\r\nWhile there are times when you think animation might improve(like watching the intricacies of a Sakura tree blossom at night), you are let down the next moment when characters clash....very...slowly. Even anime such as Hikaru no Go, which is a series about an Asian 'bored' game provided better excitement. I usually have a benchmark when it comes to shonén anime(specially ones released in the last few years) and Mago simply did not cut it for me.\\n\\n\r\nIf I had to make a comparison to Mago's animation, it would probably come close to Samurai Deeper Kyo(which aired back in 2002), another anime that had all the right premises but didn't deliver.\\n\\n\r\nYes, Nurarihyon no Mago may have picked up after 20 episodes into the series, but that's 20+ episodes too late! For some people, an anime is good if it entices you through the first few episodes. NOT at the very end where people have already dropped it or have put it on hold waiting for someone to tell them to pick it up again. It's not fine wine which you to mature(unless you're one who don't drop anime regardless)\\n\\n\r\nSound - 5\\n\r\nWhile I have no complaints about the voice actors chosen for Mago(besides the obvious of some being miscasted), where I really felt the series was also lacking was a 'strong' musical score. Shonén anime can be gripping when a running score is played in the background. The series I mentioned earlier, Hikaru no Go is a very good example to this in that it has such a moving soundtrack, that regardless how boring the game is played in Hikaru it still keeps you riveted, and at times even on edge. Whilst Nurarihyon no Mago does have BGM running(softly), none felt suited to the tempo of each scene making it seem like I was watching an 80's series due to just hearing dialogue.\\n\\n\r\nI will commend that the OP's for both arcs in the series were consistent( with both titles performed by Monkey Majik) giving you that feeling for what the show is going to be, but I'll be honest and admit that the ED's(performed by Katate☆Size) just did not feel appropriate for each ending episode. Instead of thinking I was watching a series about demons and the supernatural, the upbeat tempo at the end of each episode made it sound like it was done by a backyard DJ adding music to his favorite home video.\\n\\n\r\nCharacters - 6\\n\r\nThe series as a whole only really shines through its characters. For one, you have Rikuo who is a quarter yōkai which means like any shonén anime, there is a part of the main character that would make any fan who's into transformations go: \"Wow! Sick! I want to see more of this!\" And I admit, when I had first read the adaptation, I was pretty much all over it the moment Rikuo turned into the 'Master of the Night'.\\n\\n\r\nJust seeing his transformation made me feel like a little boy again watching Goku turn into Super-Saiyijinn 3.\\n\\n\r\nNurarihyon no Mago also features a huge cast of characters which at most 'can' be likable, but I wouldn't start saying that they'd be memorable like other well known shonén supporting characters and the only one I'd take real note of is Kiyotsugu(of the Kiyo Paranormal Squad) who happens to probably be the most annoying side character in all of anime history.\\n\\n\r\nEnjoyment and Overall - 5\\n\r\nIn all honesty, I have mixed feelings for this series as a part of me wants to grow to like it thanks to having known how the manga continues, while the other half is screaming \"Bloody Murder!\" at the anime director.\\n\\n\r\nOverall I am clearly disappointed with Mago as an anime due to the segments I had mentioned earlier and I'm surprised that it's even getting a second season when there are clearly far better anime out there who hasn't seen the light of day since they first aired(Berserk & Kenichi to name a few). I can only hope that they find a better director(or another studio take it up) for season 2 as there is no way I'd be buying the first once its licensed.\\n\\n\r\nNurarihyon no Mago is more 'superficial' then it is supernatural and at best may pass time for people with nothing to do, but it definitely isn't praiseworthy let alone top-shelf when it comes to action anime.",
            "date": "2010-12-27T23:01:00+00:00",
            "helpful_count": 125,
            "mal_id": 33137,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99263.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scrypt",
                "username": "Scrypt"
            },
            "url": "https://myanimelist.net/reviews.php?id=33137"
        },
        {
            "content": "Ah...Nurarihyon no Mago. An interesting anime indeed.\r\nBefore I start reviewing, I have to admit, I'm a big sucker for Jun Fukuyama voicing characters with alter egos (e.g. Lelouch/Zero in Code Geass, Ryner/Ryner with Alpha Stigma activated in Densetsu no Yuusha no Densetsu and of course, Rikuo Day/Rikuo Night in Nurarihyon no Mago), so excuse me if I sound a bit biased here.\r\nNow, on to the actual review:\r\nStory (7/10): You have your classic reluctant hero, Nura Rikuo, heir to the Nura Clan. 3/4 human and 1/4 youkai, he lives a normal school life by day and controls an army of youkai by night. The story detailsthe challenges Rikuo face as a part human in a youkai household and as a part youkai in human society. Sounds cliched, right? I agree. Even so, the story isn't all that bad. Although the development of the plot is painfully slow, it also allows the viewer to gain a greater insight into the characters.\\n\\n\r\nArt (8/10): Studio Deen has never really done a bad job with their animations, so there's nothing much I can critique here. I really liked the colour contrast between the human and youkai societies. You can see that anything relating to humans generally has warmer colours, whereas anything relating to youkai generally has cooler colours.\\n\\n\r\nSound (7/10): The OSTs in this anime are brilliant. Then again, I shouldn't say OSTs, because it's more like just one OST with many variations, but it still sounds good nonetheless. Seiyuus were well casted for the most part, though I really don't think Akira Ishida sounds good in any part except Arthrun Zala from Gundam Seed, no offense. Again, I'm a sucker for Jun Fukuyama voicing characters with \"double\" lives, so I have no complaints there. Openings were...decent. Endings were...not so decent. Not the best OPs or ENDs I've seen recently.\\n\\n\r\nCharacter (9/10): Like I mentioned earlier, I think the characters were well developed because of the slow movement of the plot. There were some crucial flashblacks that I really enjoyed because they cleared up character motivations brilliantly (e.g. Gyuki's flashback regarding his relationship with the Nurarihyon and Kana's flashback regarding her relationship with Night Rikuo). However, because of the large cast of youkai, not many of them are examined in detail, so many of the characters are just kind of there...you don't really know much about them other than little insignificant hints dropped here and there.\\n\\n\r\nEnjoyment (7/10): I must say, I enjoyed this anime, mostly because of  its subtle comedy. The names of the youkai are hilarious first of all. Kubinashi (literally meaning \"no neck\") has no neck. I found that funny. Kana's misunderstanding about Rikuo. I totally saw it coming, but I laughed anyways. Everytime Rikuo transformed, I also laughed, mostly because it reminded me of the cliched: weak character becomes strong through wicked transformation. The worst thing about the anime by far is the slow plot development. And when I say slow, I mean slow. The Shikoku arc was like 12 episodes, when it really should've been something like 6 because half of it was about Rikuo hesitating.\\n\\n\r\nOverall (7/10): It was good, but hey, if you have as much time on your hands as I do, go do something productive instead. Cheers!",
            "date": "2011-05-01T17:37:00+00:00",
            "helpful_count": 66,
            "mal_id": 36658,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/422812.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fadinglotus",
                "username": "fadinglotus"
            },
            "url": "https://myanimelist.net/reviews.php?id=36658"
        },
        {
            "content": "I was very excited to watch this show and had been looking forward to the first episode, and it was quite a letdown. That was my opinion of the first episode. And I would say after watching the first episode, I would have given this show a 6.\r\nI felt the same after watching the second episode.\r\nI was feeling quite disapointed with this show, but as the episodes progressed, I came to enjoy the episodes more and now at five episodes I know that it's a show I plan on watching all the way through.\r\nThat isn't meant to say that the show magically became interesting andthe plot twisted to something really epic. It isn't like that at all. If you're looking for an intense and suspensful anime, I don't think this is the right choice for you. \\n\\n\r\nBasically, the show is about a boy named Rikuo, who is a weak kid and happens to have a separate form of a demon that takes over sometimes and kicks ass. After just that one sentence, you can see that this story is not completely original and for the most part follows the same path as hundreds of other shows. Which is why I only give this show an 8. There is nothing that stands out from other anime shows from what I have watched.\\n\r\nI'm not trying to put this show down! Don't get me wrong. It's just not as awesome as other shows I've watched.\\n\\n\r\n8 / 10 in my opinion. It's not incredible, but it's not horrible.",
            "date": "2010-08-09T22:09:00+00:00",
            "helpful_count": 33,
            "mal_id": 29478,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/76339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GothicShadow22",
                "username": "GothicShadow22"
            },
            "url": "https://myanimelist.net/reviews.php?id=29478"
        },
        {
            "content": "I was looking forwad to this show, as i had heard a lot of good things about its source. After the first episode i felt euphoric; a shounen that would provide bad ass fights, but has a dark background, and looks like it will avoid the pitfalls of the others. A plot based on the complexity of a nation of youkai but the simplicity of a shounen. A mix of the happy day rikou and the dark mysterious commander at night.\r\nExpectation: 8-9\r\nEpisode Scores: -,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-, 5, 5, 3, 2, 6, 7, 6, 5\r\nActual: 4 (Bad)\r\nHowever while everything could have been promising every episode i cried aboutthe pace. There was not really anything horribly wrong with the story, and it was really good to tell the truth. Yet, the story crawls at a snails pace that it just ruins the whole experience. Through the start i was just thinking of how the build up was great, but then it hit me. The climax could never reach those expecations it builds up for a whole season. I had my hopes up since it was only 26 episodes, but it felt like i was watching reborn, naruto, bleach. It felt like i was watching filler! \\n\\n\r\n The fights were not impressive. They were good in that Nura kicks ass with nothing more than his brain and a sword, but the animation is poor and honesty the expectation issue comes back again. They did not make up for the wait either. Another complaint is how there was also no real challenge for Nura throughout the season either.\\n\\n\r\n The youkai characters did not get a lot of air time or development at all but they seemed interesting. The majority of the characters are intelligent, respectable, and most of all extremely useful by nature. They follow Nura because his is an indeed admirable character; he is not our typical useless lead, but smart and knows how to put on a good show for us. I was cheering at him at multiple points in the show for his impressive displays. That said his school friends play little part. In fact they are total weights on the story; they don't do anything yet get just as much air time as the youkai. Another issue is how they can all stay in the headquarters for youkai over a weekend and not even meet one. Essentially if i said that the girls go help his mom cook dinner you can infer the level of depth and intelligence given to them.\\n\\n\r\nAs soon as i wrote down these initial thoughts i went and started the manga. Decide ending on such a depressing note i read the large quantity of chapters to the most recent one in a few days. I will leave it on a note, seeing the anime first, that the manga is many times superior. If you don't want to read it, then you will be watching a pretty bad adaption.",
            "date": "2011-01-04T13:17:00+00:00",
            "helpful_count": 29,
            "mal_id": 33435,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 9,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 0,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=33435"
        },
        {
            "content": "I happened to stumble on this anime by accident. I wasn't looking to watch a new anime, but I saw a picture and was immediately drawn to the image of Rikuo in his demon form and thought I'd give it a shot. Boy, am I glad I did!\r\nThe story line is great, though the first few episodes are quite slow and repetitive, but it's enough to keep you interested. It's only on episode 11 as of this week, but I'm already hooked and can't wait to see how it pans out.\r\nThe art is spot on. I love the character designs, especially Rikuo's demon form. Forsome reason I'm really loving the hair, it's so unique and fits the character to a tee. Very easy on the eyes. ;o)\\n\\n\r\nThe opening theme is catchy! I have it stuck in my head all the time. The ending theme....not so much. \\n\\n\r\nThere's some romantic vibes starting up which has me quite interested to see what comes of it. I thoroughly enjoy a good love story!\\n\\n\r\nOverall, this anime has been fantastic and it's only getting  better. I hope a second season is in store!!",
            "date": "2010-09-14T18:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 30492,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/219337.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/abennett17",
                "username": "abennett17"
            },
            "url": "https://myanimelist.net/reviews.php?id=30492"
        },
        {
            "content": "This would be my first ever review so please bear with me haha:D \r\n          Nurarihyon is a manga adapted by Studio DEEN. It’s like a combination of Katekyo Hitman Reborn with an Inuyasha infused yokai theme and more. The story is great, even though it’s quite normal being an heir (involuntarily) and fighting of others that want to get your position, too much proving (with regards to your worth as an heir) and those entire allegiances thing with the other characters (value of friendship and trust) and a pretty obvious love interest since the girl theprotagonist likes looks like her mom with an addition of slightly harem effect with regards to girls liking the protagonist Rikuo, despite all of that I still dig the story. I can’t seem to think of a wow twist in the story YET but like I said it’s still a great animé.  It’s refreshing and a sort of stress relief everyday animé, the kind of animé you would love to watch after a heavy day that would make you feel normal again, also when you don’t like those awesome yet problematic and complicate animés that will give you another headache. Another thing is that even if sometimes you know that there’s nothing that much exciting on the next episode you would still want to watch more of it.\\n\\n\r\n          The opening themes by monkey majik are AWESOME and the fight scenes too are great. The ending songs are cute because of the chibi version of the three main female lead, Yuki Onna, Kana and Yura singing and dancing to the ending songs. The character designs have those HUGE eyes; I know most animés do have big eyes but theirs are way too big at first you would be like whoa! But after a while you’ll get used to it and some characters still look pretty and some boys (yokai boys since there aren’t much “normal” boys to begin with) are HOT like the male lead,  night rikuo himself the yokais (which aren’t on human form) ranges from ugly weird to cute weird but not too scary at all. It’s a must animé that I hope will go main stream.\\n",
            "date": "2010-11-30T22:02:00+00:00",
            "helpful_count": 13,
            "mal_id": 32420,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/86058.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dindinsome",
                "username": "dindinsome"
            },
            "url": "https://myanimelist.net/reviews.php?id=32420"
        },
        {
            "content": "Nurarihyon is a unique take on the yokai genre, and a very enjoyable one at that. I have to admit, when I first started watching the show I immediately thought: \"Oh great, it's a yokai version of Katekyou Hitman Reborn.\"\r\nBut Nurarihyon no Mago isn't as naive, and it keeps surprising you in little ways.\r\n The story starts with a 12 year old boy, Nura Rikuo, who lives in a house full of yokai, and is a quarter yokai himself, and thus his true demon form can only be released for a quarter of a day, under cover of darkness. He is the grandson of Nurarihyon,the Supreme Commander of Yokai, and is next in line for succession. But he doesn't want to be a Supreme Commander of all the Yokai, he wants to live as a human. However circumstances do not allow him to remain detached, and the manner in which he embraces his inheritance, with fully formed resolve and responsibility is a treat in comparison to other shonen heroes.\\n\r\n The art throughout the show is amazing, and if nothing else I'd watch the show just for the quality of animation. \\n\r\n However, I feel the characters are rather half-baked, especially the demon-form of Rikuo, which leaves a lot of questions unanswered and didn't have much depth for me. He strikes me as just a generic 'Hero' character, which is sort of off-putting.\\n\r\nOtherwise the show is awesome. Definitely a reccomendable show :D",
            "date": "2010-12-11T06:22:00+00:00",
            "helpful_count": 12,
            "mal_id": 32656,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/15642.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/teenoli",
                "username": "teenoli"
            },
            "url": "https://myanimelist.net/reviews.php?id=32656"
        },
        {
            "content": "Nurarihyon no Mago is neither inspired nor terrible.  It's rather mediocre actually, which comes as a disappointment especially since it has a decent MAL score.  I like the premise and I tried to be as open-minded as I could.  It pleasantly surprised me in some areas; for example, the plot elements suggest some strategic thinking on the part of protagonists and antagonists alike.  However, the outrageously bad action in the fight scenes is unforgivable in a shonen anime.  Neither the character development nor the dialogue are sufficient to redeem this glaring weakness for this sub-genre.\r\nSo let's get that out ofthe way first.  I have come to expect bad action in shonen anime, especially older anime, but this anime tries to push the lower bounds of that expectation.  Characters stand around spouting long monologues, just begging opponents to skewer them with a surprise attack (if only to shut them up).  Martial arts are flashy, unrealistic, and lack any sort of kinetic weight.  Expressions are grossly exaggerated, moves are telegraphed, and characters cover distances at inconsistent rates.  Damage has varying effects on characters, inversely proportionate to their importance to the story I suppose.  Nothing resembles highly skilled fighting which is ugly, abrupt, and brutally efficient.  Only small children would be entertained, but given the other subject matter small children are not the target audience.\\n\\n\r\nThe worst are the sword duels.  Obviously, I don't expect anything approaching realism in an anime.  I would, however, appreciate things that LOOK cool, as is the case in some more modern anime.  But here, sword fights are mostly blade locks that give the combatants a chance to whisper sweet nothings to each other for long stretches while we yawn.  It gets old quickly and makes us wonder if perhaps their animators were on a strict budget or simply lacked imagination.\\n\\n\r\nOther visual elements are also lacking.  I suppose the anime was made during that awkward time when CG started gaining traction in anime, and it is mixed in poorly enough with hand-drawn elements to stick out.  The art itself hails back to an earlier anime art style that I rather dislike.  Monsters look silly and cartoonish rather than terrifying and intimidating.  Facial features are mushy and indistinct, and nobody in the cast really stand out as having superior character design.\\n\\n\r\nWhy did I score it so highly given these obvious flaws?  Well, I was expecting absolutely terrible storytelling to go along with the poor visuals, but some of it seemed well-constructed.  At one point an opposing faction invades Nura family territory and instead of a direct assault (which probably would have failed), they do strategically sound things like attacking scouts, making feints, and eroding power base through indirect attacks.  \\n\\n\r\nI cannot say ALL the story elements were sound, however.  Rikuo, the main character, has the most annoying classmates and they get a huge amount of screen time.  They do improbable things that human beings of sound mind would never do.  Despite almost dying several times due to youkai activity, they repeatedly put themselves into compromising and dangerous situations.  They visit abandoned, remote areas without adult supervision.  Somehow they gain permission from their parents to sleep away from home despite the obvious spate of violence and property damage that recurs in town (and very publicly on the news).  \\n\\n\r\nThere seems to be a cliched love triangle brewing between Rikuo, the childhood friend, and the snow woman bodyguard.  There is a tiny amount of character development, mostly in Rikuo who goes from being an annoying, whiny kid to being a slightly less annoying, whiny kid.  Beyond that, don't watch this for the character interactions.\\n\\n\r\nOverall, I enjoyed this more than it deserved given the quality of its individual elements.  I just happened to like this kind of anime and its sense of style.  But it's executed quite poorly and you'll find better examples of the genre elsewhere.  Oh, and regarding the music, although most OP and ED are bad in this anime, the worse is the terrible OP during the second half of the season.  Is that some kind of country-western R&B hybrid?  I don't know, but feels like they went out of their way to offend my ears.",
            "date": "2018-11-27T15:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 294832,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Qichar",
                "username": "Qichar"
            },
            "url": "https://myanimelist.net/reviews.php?id=294832"
        },
        {
            "content": "\"My grandson,when will u gonna to succeeding me?\" \"But i told u i wanna live as a human!\" \r\n\"How many youkai I must change sake cups with? I'll take the seat of Third Heir and protect the weak youkai\" \"Darn! If the dawn breaks,his forms will change again and he'll forget for what he just said.What a pity,master..\"\r\nCute in day, handsome in night....!! Very rare youkai in new adventures! \r\nIt's very great anime! Tell the truth, I didn't like the art of its manga so much. Kinda make me creepy. But its anime now, have change it! I must said, the design characters drawn mefirst, and then the story! The youkai themselves is drawn very beautiful. Really can inivite both male and female fans to crazy about this anime. Hope the story will also reach the greatest battle of Nuragumi with most strongest youkai, like its manga version\\n\\n\r\nPlus the theme songs! I prefer the opening ^^ Kinda familiar with the music theme,remind me of Harry Potter's music >.< but perhaps it's only my imagine hehhe.",
            "date": "2010-07-14T09:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 28395,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331217.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ryuichi_crosszer",
                "username": "ryuichi_crosszer"
            },
            "url": "https://myanimelist.net/reviews.php?id=28395"
        },
        {
            "content": "This is my first review, so please leave comments.\r\nStory:\r\nThe story is really good, sometimes it just goes a little to fast. There are also a few errors in the story. Because they say in one episode that the enemy is a coward, because the fight with one against two. But two episodes later they do exact the same thing as the enemy, fighting two against one. \r\nArt:\r\nThe art was amazing, that is all I can say about it.\r\nSound:\r\nThe voice acting is well done for the most character. And the openings are really good and they stick in your head.\r\nCharacters:\r\nThere are good characters, but I didn'tlike most of the characters.\\n\\n\r\nEnjoyment:\\n\\n\r\nYou will enjoy yourself with this anime. Only sometimes you may think why did they put this episode in it, or why did this fight happen. You sometimes just feel like you are watching a useless and not important episodes.",
            "date": "2013-01-22T22:53:00+00:00",
            "helpful_count": 9,
            "mal_id": 84569,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2025143.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dest-roy96",
                "username": "dest-roy96"
            },
            "url": "https://myanimelist.net/reviews.php?id=84569"
        },
        {
            "content": "Another review for this show mentioned that it took a few episodes for them to get into it and I have to say that I agree completely. A good while back I watched the first episode, and I was kind of \"meh\"\r\nSome time later I was a bit bored, so I started reading the manga, and it was kind of the same way.  But, after getting through the first few chapters, I found myself really getting into it.  Really, this anime is quite a lot of fun, and I would say it is worth it once you get into the meat of thestory.  Anyone who liked InuYasha back in the day should be able to enjoy Nurarihyon.\\n\\n\r\nNow I just have to hope that the anime won't catch up to the manga, so I don't have to deal with fillers....\\n\\n",
            "date": "2010-12-17T22:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 32828,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/420985.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rava",
                "username": "rava"
            },
            "url": "https://myanimelist.net/reviews.php?id=32828"
        },
        {
            "content": "I feel so much potential was wasted on this one, it is kind of frustrating.\r\nThe anime has nearly all ingredients to make a great shounen: first a good plot concept, then there's youkai and humans and their various relations, yakuza styled youkai syndicate, great art style, nice VAs and BGM, enough space to develop the plot and characters and a great deal of Shinto concepts and ideas....\r\nAnd then...enter THE characters...\r\nFor me personally, the characters ruined a fair bit of what otherwise could've easily been an 8/10 shounen. While I can ignore unrealistic age and pretend they are older than what they're supposed to be inthe anime, what I can not ignore is their intellectual level. I reckon stupid characters exist in nearly every anime, however, in the case of Nurarihyon no mago, at least 70% of them had about the same intellectual level as my 2 year old nephew. You know, when you tell a child \"don't touch the hot iron\" and the next thing you know is that is exactly what they're doing. \\n\\n\r\nMore than a few characters were simply unnecessary to the story, many conversations were repetitive and shallow, the pace was slow and painful, and the climax didn't really feel like one, whether the conclusion was satisfying is questionable. \\n\\n\r\nThese 24 episodes could have been compressed in a 13-15 episode series easily.",
            "date": "2017-12-20T23:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 265797,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Enjyu",
                "username": "Enjyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=265797"
        },
        {
            "content": "Nurarihyon No Mago. \r\nAn anime i first noticed when i saw the title, and really liked the pronounciaton of the name Nurarihyon. (Don't judge me)\r\nAnd to be honest, it's really good. It's far from something groundbreaking, but if you're in the mood for a battle shounen, this is actually one of the better ones out there.\r\nOur main character is a person who is 3/4 human and 1/4 yokai/demon.\r\nThis results in the situation that he can only take on his demon form, for 1/4 of the day, specifically, right after midnight. But you can be damn sure, that when he appears, something epic is gonna happen.\r\nThehuman version of rikuo is very stereotypical at times, but in my opinion, it doesn't take that much away from the show.\\n\\n\r\nIf you're looking for an intricate plot, then go on to the next review. This anime is not insanely deep. It's a classic battle shounen, with some of the known clichés every now and then, but that didn't keep me from enjoying it.\\n\\n",
            "date": "2019-01-17T13:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 299307,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7208768.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BlackNeonStar",
                "username": "BlackNeonStar"
            },
            "url": "https://myanimelist.net/reviews.php?id=299307"
        },
        {
            "content": "Story (6): Don't get me wrong, the story has good potential, but for some reason I kept feeling sometimes it moved too slow and other times it skiped important development and moved too fast.\r\nArt (9): The art is very enjoyable, specially the design of the yokai, each character is very singular and deteiled in it's own way.\r\nSound (6): The ending quite grows on you, but I think the sound, plus Rikuo's classmates took a lot of the seriousness this story could have had.\r\nCharacters (10): Again, the youkai are very varied and well developed, having so many different characters, one would have not thought they wouldtake the time to give each one (at least the main ones) a chance to show their abilities and personalities.\\n\\n\r\nEnjoyment (6): I must admit it kept me pretty interested till the end, the fights are quite nicely done.\\n\\n\r\nOverall: If you like youkai, specially the ones that not necesarilly interact with humans as evil creatures, you'll probably enjoy it, don't expect to watch a very serious anime though, prepare for some lighthearted laughs and nice fights.",
            "date": "2011-01-03T17:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 33406,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/397194.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yakarin",
                "username": "Yakarin"
            },
            "url": "https://myanimelist.net/reviews.php?id=33406"
        },
        {
            "content": "Story: 8/10 This is a Anime about, young Nura Rikuo the grandson of the supreme commander of the Nura yokai clan.  As heir to the most powerful clan of yokai, he has to live up to a great expectation set by his grandfather the Nurarihyon. This season of the show goes through the internal struggles of the Nura clan to the fight against the evil Shikoku yokai. The story is really interesting and really pulled me in. I have not read the manga so I wouldn’t know if it was slow or not. The pace of the show was good, tho at the beginningit felt a little slow but it was manageable. The second half of the Anime has got to be the best part of the Anime. The pacing was good and the story pulled me in and I could not put it down. \\n\\n\r\nArt 9/10. The art was amazing for the show and was very colorful. The character design's were great too. From Yuki Onna's gold rinnegan eyes to Rikuo's epic night form.\\n\\n\r\nSound 10/10: this is where Nurarihyon no Mago excels greatly, the two openings Fast Forward and Sunshine we're perfect for the series. They are extremely catchy and sometime the band that sung them felt like a English alternative band. I personally enjoy the first more than the second but all in all they both were amazing. The two endings are good but they cannot beat the amazing opening themes. I suggest checking them out. \\n\\n\r\nCharacter 8/10: The characters we're really interesting and made the series really fun at times. Rikuo was gotta be the best character of the series. His dark form is really awesome, and Jun Fukuyama does a freaking amazing job as the seiyuu for him. Other cool characters were Yuki Onna (Tsurara), Zen, and Yura Keikain. I think that the series would of done a little better if there were more character development and some more romance scenes. I personally think that Rikuo should of told his friends who he was especially to Kana, or I wish they saw him change his forms or something. It would of made the series a lot more interesting and would of bumped up my rating. I hope this happens in season 2 sometime or later on in the series. Also, after a while it got ridiculous that all those demons in his house would always hide and they would never be found even when it was completely obvious that they were there.  Though, I always felt sorry for Kiyotsugu... he always wanted to see the yokai but never did even though everyone else around him saw them it was pretty funny tho. \\n\\n\r\nEnjoyment/Overall 8/10: I think this series was great. It had a lot of high points and some low points but overall I'm glad I watched it. Though from what I heard, those who read or have read the manga won't like it because it is “slow”. Other than that, this series is really good and down the road I might want to rewatch it again. I cannot wait for season 2, I hope it will be bigger and better than this season!",
            "date": "2011-01-23T19:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 33995,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/350969.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ariamachi",
                "username": "ariamachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=33995"
        },
        {
            "content": "how come you say its only 24 episodes...i watched it and its 26 episodes, i can't even change it.\r\nthe story wasn't like so catchy but i liked it and I'm watching it to the end.",
            "date": "2013-03-04T02:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 88639,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2253119.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nolladazzle",
                "username": "nolladazzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=88639"
        },
        {
            "content": "This is a pretty well established anime. A young kid who is half human,half demon takes control of the strongest demon clan(the clan he belongs to) and proves to be much more different than the previous rulers. Thanks to his human side. And so not to give anything away, the story develops from there and deals with the tasks of uniting humans and demons. The anime is well animated, has a easy simple plot to follow and entertaining as hell. Pretty good character development as well if you like that kind of stuff from your anime. It is well worth a watch and i recommendit to anyone.",
            "date": "2013-05-02T20:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 95759,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=95759"
        },
        {
            "content": "Let me start off by saying that Nurarihyon is one sexy Yokai!\r\n*ehem*err* Alright, now I have gotten that out of the way...\r\nStory: 7 - For me it's just the typical Human/Yokai story... it has an 'Inuyasha' feel to it... the plot is not boring, it's actually fast paced, but maybe I was looking for something more... the characters were developed quite nicely and the fight scenes aren't bad either... since Nurarihyon was strong, i wanted the antagonist to be a bada**... Also, the human by day and yokai by night is okay... not that Rikuo is not cute, but i wanted more Nurarihyon... waiting forthe transformation kinda gets old...\\n\\n\r\nOverall/Enjoyment: 8 - Nura and his clan are so fun to watch... Nurarihyon is the leader of a bunch of Yokai - most of them appear harmless and they'll be the mischievous spirits at best... his most loyal subjects are Yuki Onna, Aotabo, Kurotabo and Kubinashi (Headless)... they provide comic relief to a seemigly serious story... We also have a \"love angle\" but being 12 yr olds, they are a little bit too young to be excited about... and i like Yura better than Kana, btw...\\n\r\n             Ending had a nice feel to it and was not too mushy... though it did make me go 'Aaawww - that's cute...' - \\n\r\n             What I also liked best here is the Sakura tree... it was mesmerizing... i am still waiting if it has some kind of significance in the story or maybe i missed it... :P \\n\\n\r\nNow watching the 2nd season and by the looks of it, the 2nd part is much more promising... can't wait... :)\\n\\n",
            "date": "2012-06-12T18:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 63301,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BBHood22",
                "username": "BBHood22"
            },
            "url": "https://myanimelist.net/reviews.php?id=63301"
        },
        {
            "content": "I watched nurarihyon when it aired on animax around 2010-11 and I was completely in love with the show. It’s been quite a few year since manga ended and I couldn’t recall much of the storyline so I decided to rewatch it from the start. I didn’t know if I would enjoy it as much as I did but.....I fell in love again with this show.\r\nAs someone who’s into mythology and historical genre I enjoy this show to the core. The animation is great. And night Rikuo’s seiyuu did an amazing job. The voice just suits him so well. The action scenes are really nicetoo and so are the soundtracks. The animation of the Sakura tree is simply mesmerising. I wish I had one in my backyard too xD\\n\r\nThe pacing of the story was fine by me. I’ve heard a lot of ppl say that the pacing is slow but I didn’t mind.\\n\r\nThe openings of this season are awesome. I still listen to the two songs till date and the endings are good as well.\\n\r\nSo If you’re into such genres revolving around youkai and ayakashi with modern and traditional blend then definitely give it a try!",
            "date": "2019-03-20T23:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 303955,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4929129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mishi20",
                "username": "Mishi20"
            },
            "url": "https://myanimelist.net/reviews.php?id=303955"
        }
    ],
    [
        {
            "content": "Edited this review by the way :)\r\nGrammar Nazis? GTFO lol. This review is not for you. Why not create your own then? :P\r\nGlad that my friend let me watch this great stuff.\r\nOkay now let’s start. \r\nWhat will you do if you will become a powerful commander?\r\nStory: 9/10\r\n\tThe story revolves around Nura Clan. A Clan of “youkai” that controls 10,000 demons. Amongst them is what they called “supreme commander” a very powerful “youkai”. \r\n\tNow for the protagonist story so far. Nurarhiyon no Mago didn’t lack story backgrounds at all. They explained what happened in the past with the right execution. Except for the flashbacks that hisseason lacked. The jabs also were at the right timing and in the right scene.\\n\r\n\tThe first antagonist didn’t lack also the background which is a factor plus because you know why he did that and those. Over all pacing are great. There is no filler. None at all. Some scenes from manga are cut here and placed at the second season instead.\\n\\n\r\nArt: 8/10\\n\r\n\tIMO the sword/katana fighting are the main stream of this, the animation was great. Also the opening credits were great it’s well drawn. The ending credits weren’t that good compare to the opening.  The chibi or the miniture forms of the characters didn’t fit. The genre of this was supposed to be \"Monster\" not a \"Cute\" or \"Moe\" one.\\n\r\n\tThe youkai are well drawn, Animations are really great.\\n\\n\r\nSound: 8/10\\n\r\n\tOpening song was great. Fast Forward by Money Majik. Every time I’m listening to the full version I also sang.The BGM when Nurarhiyon attacks a youkai has a good execution. The back ground tracks fit every scene Nurarhiyon no Mago has to offer.  What destroyed the good sounds is the ending song. It didn’t fit what genre nurarhiyon has. The 2nd one didn't make it for me either.\\n\\n\r\nCharacters: 8/10\\n\r\n\tThe characters fit what personalities they have.  Adding characters while the story progress with their background is also a plus factor, at the same time Rukio is “growing” every episode. They also didn’t lack time executing who is going to “grow” with the explanation.\\n\r\n\tThe character development is great. Overall the adaption from the manga onto an anime didn't lacked anything except less than 10 chapters form the start but not that huge character back story. Try to read the manga first rather knowing it here (at the review)\\n\\n\r\nEnjoyment: 9/10\\n\r\n\tI really did enjoy this.  Various scenes will be enjoyable while watching this.  You will be caught in suspense, laugh at the jabs and get excited on the katana fights. And this anime already leave a huge impression to me and still continued for the 2nd season!\\n\\n\r\nFinal Score: 9/10\\n\r\n\tIt’s up to you to decide whether you gonna watch this or ditch it, but imo this anime is great. The jokes are in the right time. Great Music and the BGM is really mixed on the scenes. Great Art and Character development.\\n",
            "date": "2010-09-06T06:48:00+00:00",
            "helpful_count": 136,
            "mal_id": 30278,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/180094.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Xynz01",
                "username": "Xynz01"
            },
            "url": "https://myanimelist.net/reviews.php?id=30278"
        },
        {
            "content": "If there's one word I could describe Nurarihyon no Mago, it would have to be BORING. \r\nHaving read the adaptation I really had high hopes for this series as the formula to which Mago is about, is seldom used in shonén anime and if done right, would have definitely been one of the better series for 2010.\r\n...but like I said, BORING. Here's why:\r\nStory - 8\r\nNurarihyon no Mago is a tale of the supernatural. It's a tale of demons and spirits and the co-existence between their kind and ours. It's also a tale of Rikuo Nura and how he takes over his grandfathers clan known asthe Hyakki Yakō, a clan made up of yōkai(demons) and other familiar spirits of Japanese folklore. Nurarihyon no Mago is about the trials and tribulations Rikuo goes through to achieve being the head of that clan(to which at first he has no interest in) while knowing that he is only a quarter yōkai himself. \\n\\n\r\nWhat makes the story even more interesting is how the Nura yōkai clan portray chivalry, similar to those you'd find in yakuza(Japanese gangster) movies, and how this series uses fear to gauge their strength. \\n\\n\r\nNurarihyon no Mago is Rikuo's story, as he struggles to find his place between both worlds, and it's a tale of superiority between other yōkai clans as you'll find in the second half of the series.\\n\\n\r\nSo far so good right? So what went wrong?\\n\\n\r\nArt & Animation - 6\\n\r\nThis is where it was a miss for me. While I was happy the art stayed true to Hiroshi Shiibashi's manga, giving you a richly detailed account to Japan's yōkai like you'd find in an old Japanese tapestry, I was really disappointed in its animation. For a shonén title, the series really lacked 'fluidity' for a better word making each scene seem like your watching still-frame art from the 90's. The execution and pacing was lacking and for a series made late 2010, the choreography was non-existent.\\n\\n\r\nWhile there are times when you think animation might improve(like watching the intricacies of a Sakura tree blossom at night), you are let down the next moment when characters clash....very...slowly. Even anime such as Hikaru no Go, which is a series about an Asian 'bored' game provided better excitement. I usually have a benchmark when it comes to shonén anime(specially ones released in the last few years) and Mago simply did not cut it for me.\\n\\n\r\nIf I had to make a comparison to Mago's animation, it would probably come close to Samurai Deeper Kyo(which aired back in 2002), another anime that had all the right premises but didn't deliver.\\n\\n\r\nYes, Nurarihyon no Mago may have picked up after 20 episodes into the series, but that's 20+ episodes too late! For some people, an anime is good if it entices you through the first few episodes. NOT at the very end where people have already dropped it or have put it on hold waiting for someone to tell them to pick it up again. It's not fine wine which you to mature(unless you're one who don't drop anime regardless)\\n\\n\r\nSound - 5\\n\r\nWhile I have no complaints about the voice actors chosen for Mago(besides the obvious of some being miscasted), where I really felt the series was also lacking was a 'strong' musical score. Shonén anime can be gripping when a running score is played in the background. The series I mentioned earlier, Hikaru no Go is a very good example to this in that it has such a moving soundtrack, that regardless how boring the game is played in Hikaru it still keeps you riveted, and at times even on edge. Whilst Nurarihyon no Mago does have BGM running(softly), none felt suited to the tempo of each scene making it seem like I was watching an 80's series due to just hearing dialogue.\\n\\n\r\nI will commend that the OP's for both arcs in the series were consistent( with both titles performed by Monkey Majik) giving you that feeling for what the show is going to be, but I'll be honest and admit that the ED's(performed by Katate☆Size) just did not feel appropriate for each ending episode. Instead of thinking I was watching a series about demons and the supernatural, the upbeat tempo at the end of each episode made it sound like it was done by a backyard DJ adding music to his favorite home video.\\n\\n\r\nCharacters - 6\\n\r\nThe series as a whole only really shines through its characters. For one, you have Rikuo who is a quarter yōkai which means like any shonén anime, there is a part of the main character that would make any fan who's into transformations go: \"Wow! Sick! I want to see more of this!\" And I admit, when I had first read the adaptation, I was pretty much all over it the moment Rikuo turned into the 'Master of the Night'.\\n\\n\r\nJust seeing his transformation made me feel like a little boy again watching Goku turn into Super-Saiyijinn 3.\\n\\n\r\nNurarihyon no Mago also features a huge cast of characters which at most 'can' be likable, but I wouldn't start saying that they'd be memorable like other well known shonén supporting characters and the only one I'd take real note of is Kiyotsugu(of the Kiyo Paranormal Squad) who happens to probably be the most annoying side character in all of anime history.\\n\\n\r\nEnjoyment and Overall - 5\\n\r\nIn all honesty, I have mixed feelings for this series as a part of me wants to grow to like it thanks to having known how the manga continues, while the other half is screaming \"Bloody Murder!\" at the anime director.\\n\\n\r\nOverall I am clearly disappointed with Mago as an anime due to the segments I had mentioned earlier and I'm surprised that it's even getting a second season when there are clearly far better anime out there who hasn't seen the light of day since they first aired(Berserk & Kenichi to name a few). I can only hope that they find a better director(or another studio take it up) for season 2 as there is no way I'd be buying the first once its licensed.\\n\\n\r\nNurarihyon no Mago is more 'superficial' then it is supernatural and at best may pass time for people with nothing to do, but it definitely isn't praiseworthy let alone top-shelf when it comes to action anime.",
            "date": "2010-12-27T23:01:00+00:00",
            "helpful_count": 125,
            "mal_id": 33137,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99263.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scrypt",
                "username": "Scrypt"
            },
            "url": "https://myanimelist.net/reviews.php?id=33137"
        },
        {
            "content": "Ah...Nurarihyon no Mago. An interesting anime indeed.\r\nBefore I start reviewing, I have to admit, I'm a big sucker for Jun Fukuyama voicing characters with alter egos (e.g. Lelouch/Zero in Code Geass, Ryner/Ryner with Alpha Stigma activated in Densetsu no Yuusha no Densetsu and of course, Rikuo Day/Rikuo Night in Nurarihyon no Mago), so excuse me if I sound a bit biased here.\r\nNow, on to the actual review:\r\nStory (7/10): You have your classic reluctant hero, Nura Rikuo, heir to the Nura Clan. 3/4 human and 1/4 youkai, he lives a normal school life by day and controls an army of youkai by night. The story detailsthe challenges Rikuo face as a part human in a youkai household and as a part youkai in human society. Sounds cliched, right? I agree. Even so, the story isn't all that bad. Although the development of the plot is painfully slow, it also allows the viewer to gain a greater insight into the characters.\\n\\n\r\nArt (8/10): Studio Deen has never really done a bad job with their animations, so there's nothing much I can critique here. I really liked the colour contrast between the human and youkai societies. You can see that anything relating to humans generally has warmer colours, whereas anything relating to youkai generally has cooler colours.\\n\\n\r\nSound (7/10): The OSTs in this anime are brilliant. Then again, I shouldn't say OSTs, because it's more like just one OST with many variations, but it still sounds good nonetheless. Seiyuus were well casted for the most part, though I really don't think Akira Ishida sounds good in any part except Arthrun Zala from Gundam Seed, no offense. Again, I'm a sucker for Jun Fukuyama voicing characters with \"double\" lives, so I have no complaints there. Openings were...decent. Endings were...not so decent. Not the best OPs or ENDs I've seen recently.\\n\\n\r\nCharacter (9/10): Like I mentioned earlier, I think the characters were well developed because of the slow movement of the plot. There were some crucial flashblacks that I really enjoyed because they cleared up character motivations brilliantly (e.g. Gyuki's flashback regarding his relationship with the Nurarihyon and Kana's flashback regarding her relationship with Night Rikuo). However, because of the large cast of youkai, not many of them are examined in detail, so many of the characters are just kind of there...you don't really know much about them other than little insignificant hints dropped here and there.\\n\\n\r\nEnjoyment (7/10): I must say, I enjoyed this anime, mostly because of  its subtle comedy. The names of the youkai are hilarious first of all. Kubinashi (literally meaning \"no neck\") has no neck. I found that funny. Kana's misunderstanding about Rikuo. I totally saw it coming, but I laughed anyways. Everytime Rikuo transformed, I also laughed, mostly because it reminded me of the cliched: weak character becomes strong through wicked transformation. The worst thing about the anime by far is the slow plot development. And when I say slow, I mean slow. The Shikoku arc was like 12 episodes, when it really should've been something like 6 because half of it was about Rikuo hesitating.\\n\\n\r\nOverall (7/10): It was good, but hey, if you have as much time on your hands as I do, go do something productive instead. Cheers!",
            "date": "2011-05-01T17:37:00+00:00",
            "helpful_count": 66,
            "mal_id": 36658,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/422812.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fadinglotus",
                "username": "fadinglotus"
            },
            "url": "https://myanimelist.net/reviews.php?id=36658"
        },
        {
            "content": "I was very excited to watch this show and had been looking forward to the first episode, and it was quite a letdown. That was my opinion of the first episode. And I would say after watching the first episode, I would have given this show a 6.\r\nI felt the same after watching the second episode.\r\nI was feeling quite disapointed with this show, but as the episodes progressed, I came to enjoy the episodes more and now at five episodes I know that it's a show I plan on watching all the way through.\r\nThat isn't meant to say that the show magically became interesting andthe plot twisted to something really epic. It isn't like that at all. If you're looking for an intense and suspensful anime, I don't think this is the right choice for you. \\n\\n\r\nBasically, the show is about a boy named Rikuo, who is a weak kid and happens to have a separate form of a demon that takes over sometimes and kicks ass. After just that one sentence, you can see that this story is not completely original and for the most part follows the same path as hundreds of other shows. Which is why I only give this show an 8. There is nothing that stands out from other anime shows from what I have watched.\\n\r\nI'm not trying to put this show down! Don't get me wrong. It's just not as awesome as other shows I've watched.\\n\\n\r\n8 / 10 in my opinion. It's not incredible, but it's not horrible.",
            "date": "2010-08-09T22:09:00+00:00",
            "helpful_count": 33,
            "mal_id": 29478,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/76339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GothicShadow22",
                "username": "GothicShadow22"
            },
            "url": "https://myanimelist.net/reviews.php?id=29478"
        },
        {
            "content": "I was looking forwad to this show, as i had heard a lot of good things about its source. After the first episode i felt euphoric; a shounen that would provide bad ass fights, but has a dark background, and looks like it will avoid the pitfalls of the others. A plot based on the complexity of a nation of youkai but the simplicity of a shounen. A mix of the happy day rikou and the dark mysterious commander at night.\r\nExpectation: 8-9\r\nEpisode Scores: -,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-, 5, 5, 3, 2, 6, 7, 6, 5\r\nActual: 4 (Bad)\r\nHowever while everything could have been promising every episode i cried aboutthe pace. There was not really anything horribly wrong with the story, and it was really good to tell the truth. Yet, the story crawls at a snails pace that it just ruins the whole experience. Through the start i was just thinking of how the build up was great, but then it hit me. The climax could never reach those expecations it builds up for a whole season. I had my hopes up since it was only 26 episodes, but it felt like i was watching reborn, naruto, bleach. It felt like i was watching filler! \\n\\n\r\n The fights were not impressive. They were good in that Nura kicks ass with nothing more than his brain and a sword, but the animation is poor and honesty the expectation issue comes back again. They did not make up for the wait either. Another complaint is how there was also no real challenge for Nura throughout the season either.\\n\\n\r\n The youkai characters did not get a lot of air time or development at all but they seemed interesting. The majority of the characters are intelligent, respectable, and most of all extremely useful by nature. They follow Nura because his is an indeed admirable character; he is not our typical useless lead, but smart and knows how to put on a good show for us. I was cheering at him at multiple points in the show for his impressive displays. That said his school friends play little part. In fact they are total weights on the story; they don't do anything yet get just as much air time as the youkai. Another issue is how they can all stay in the headquarters for youkai over a weekend and not even meet one. Essentially if i said that the girls go help his mom cook dinner you can infer the level of depth and intelligence given to them.\\n\\n\r\nAs soon as i wrote down these initial thoughts i went and started the manga. Decide ending on such a depressing note i read the large quantity of chapters to the most recent one in a few days. I will leave it on a note, seeing the anime first, that the manga is many times superior. If you don't want to read it, then you will be watching a pretty bad adaption.",
            "date": "2011-01-04T13:17:00+00:00",
            "helpful_count": 29,
            "mal_id": 33435,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 9,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 0,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=33435"
        },
        {
            "content": "I happened to stumble on this anime by accident. I wasn't looking to watch a new anime, but I saw a picture and was immediately drawn to the image of Rikuo in his demon form and thought I'd give it a shot. Boy, am I glad I did!\r\nThe story line is great, though the first few episodes are quite slow and repetitive, but it's enough to keep you interested. It's only on episode 11 as of this week, but I'm already hooked and can't wait to see how it pans out.\r\nThe art is spot on. I love the character designs, especially Rikuo's demon form. Forsome reason I'm really loving the hair, it's so unique and fits the character to a tee. Very easy on the eyes. ;o)\\n\\n\r\nThe opening theme is catchy! I have it stuck in my head all the time. The ending theme....not so much. \\n\\n\r\nThere's some romantic vibes starting up which has me quite interested to see what comes of it. I thoroughly enjoy a good love story!\\n\\n\r\nOverall, this anime has been fantastic and it's only getting  better. I hope a second season is in store!!",
            "date": "2010-09-14T18:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 30492,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/219337.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/abennett17",
                "username": "abennett17"
            },
            "url": "https://myanimelist.net/reviews.php?id=30492"
        },
        {
            "content": "This would be my first ever review so please bear with me haha:D \r\n          Nurarihyon is a manga adapted by Studio DEEN. It’s like a combination of Katekyo Hitman Reborn with an Inuyasha infused yokai theme and more. The story is great, even though it’s quite normal being an heir (involuntarily) and fighting of others that want to get your position, too much proving (with regards to your worth as an heir) and those entire allegiances thing with the other characters (value of friendship and trust) and a pretty obvious love interest since the girl theprotagonist likes looks like her mom with an addition of slightly harem effect with regards to girls liking the protagonist Rikuo, despite all of that I still dig the story. I can’t seem to think of a wow twist in the story YET but like I said it’s still a great animé.  It’s refreshing and a sort of stress relief everyday animé, the kind of animé you would love to watch after a heavy day that would make you feel normal again, also when you don’t like those awesome yet problematic and complicate animés that will give you another headache. Another thing is that even if sometimes you know that there’s nothing that much exciting on the next episode you would still want to watch more of it.\\n\\n\r\n          The opening themes by monkey majik are AWESOME and the fight scenes too are great. The ending songs are cute because of the chibi version of the three main female lead, Yuki Onna, Kana and Yura singing and dancing to the ending songs. The character designs have those HUGE eyes; I know most animés do have big eyes but theirs are way too big at first you would be like whoa! But after a while you’ll get used to it and some characters still look pretty and some boys (yokai boys since there aren’t much “normal” boys to begin with) are HOT like the male lead,  night rikuo himself the yokais (which aren’t on human form) ranges from ugly weird to cute weird but not too scary at all. It’s a must animé that I hope will go main stream.\\n",
            "date": "2010-11-30T22:02:00+00:00",
            "helpful_count": 13,
            "mal_id": 32420,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/86058.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dindinsome",
                "username": "dindinsome"
            },
            "url": "https://myanimelist.net/reviews.php?id=32420"
        },
        {
            "content": "Nurarihyon is a unique take on the yokai genre, and a very enjoyable one at that. I have to admit, when I first started watching the show I immediately thought: \"Oh great, it's a yokai version of Katekyou Hitman Reborn.\"\r\nBut Nurarihyon no Mago isn't as naive, and it keeps surprising you in little ways.\r\n The story starts with a 12 year old boy, Nura Rikuo, who lives in a house full of yokai, and is a quarter yokai himself, and thus his true demon form can only be released for a quarter of a day, under cover of darkness. He is the grandson of Nurarihyon,the Supreme Commander of Yokai, and is next in line for succession. But he doesn't want to be a Supreme Commander of all the Yokai, he wants to live as a human. However circumstances do not allow him to remain detached, and the manner in which he embraces his inheritance, with fully formed resolve and responsibility is a treat in comparison to other shonen heroes.\\n\r\n The art throughout the show is amazing, and if nothing else I'd watch the show just for the quality of animation. \\n\r\n However, I feel the characters are rather half-baked, especially the demon-form of Rikuo, which leaves a lot of questions unanswered and didn't have much depth for me. He strikes me as just a generic 'Hero' character, which is sort of off-putting.\\n\r\nOtherwise the show is awesome. Definitely a reccomendable show :D",
            "date": "2010-12-11T06:22:00+00:00",
            "helpful_count": 12,
            "mal_id": 32656,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/15642.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/teenoli",
                "username": "teenoli"
            },
            "url": "https://myanimelist.net/reviews.php?id=32656"
        },
        {
            "content": "Nurarihyon no Mago is neither inspired nor terrible.  It's rather mediocre actually, which comes as a disappointment especially since it has a decent MAL score.  I like the premise and I tried to be as open-minded as I could.  It pleasantly surprised me in some areas; for example, the plot elements suggest some strategic thinking on the part of protagonists and antagonists alike.  However, the outrageously bad action in the fight scenes is unforgivable in a shonen anime.  Neither the character development nor the dialogue are sufficient to redeem this glaring weakness for this sub-genre.\r\nSo let's get that out ofthe way first.  I have come to expect bad action in shonen anime, especially older anime, but this anime tries to push the lower bounds of that expectation.  Characters stand around spouting long monologues, just begging opponents to skewer them with a surprise attack (if only to shut them up).  Martial arts are flashy, unrealistic, and lack any sort of kinetic weight.  Expressions are grossly exaggerated, moves are telegraphed, and characters cover distances at inconsistent rates.  Damage has varying effects on characters, inversely proportionate to their importance to the story I suppose.  Nothing resembles highly skilled fighting which is ugly, abrupt, and brutally efficient.  Only small children would be entertained, but given the other subject matter small children are not the target audience.\\n\\n\r\nThe worst are the sword duels.  Obviously, I don't expect anything approaching realism in an anime.  I would, however, appreciate things that LOOK cool, as is the case in some more modern anime.  But here, sword fights are mostly blade locks that give the combatants a chance to whisper sweet nothings to each other for long stretches while we yawn.  It gets old quickly and makes us wonder if perhaps their animators were on a strict budget or simply lacked imagination.\\n\\n\r\nOther visual elements are also lacking.  I suppose the anime was made during that awkward time when CG started gaining traction in anime, and it is mixed in poorly enough with hand-drawn elements to stick out.  The art itself hails back to an earlier anime art style that I rather dislike.  Monsters look silly and cartoonish rather than terrifying and intimidating.  Facial features are mushy and indistinct, and nobody in the cast really stand out as having superior character design.\\n\\n\r\nWhy did I score it so highly given these obvious flaws?  Well, I was expecting absolutely terrible storytelling to go along with the poor visuals, but some of it seemed well-constructed.  At one point an opposing faction invades Nura family territory and instead of a direct assault (which probably would have failed), they do strategically sound things like attacking scouts, making feints, and eroding power base through indirect attacks.  \\n\\n\r\nI cannot say ALL the story elements were sound, however.  Rikuo, the main character, has the most annoying classmates and they get a huge amount of screen time.  They do improbable things that human beings of sound mind would never do.  Despite almost dying several times due to youkai activity, they repeatedly put themselves into compromising and dangerous situations.  They visit abandoned, remote areas without adult supervision.  Somehow they gain permission from their parents to sleep away from home despite the obvious spate of violence and property damage that recurs in town (and very publicly on the news).  \\n\\n\r\nThere seems to be a cliched love triangle brewing between Rikuo, the childhood friend, and the snow woman bodyguard.  There is a tiny amount of character development, mostly in Rikuo who goes from being an annoying, whiny kid to being a slightly less annoying, whiny kid.  Beyond that, don't watch this for the character interactions.\\n\\n\r\nOverall, I enjoyed this more than it deserved given the quality of its individual elements.  I just happened to like this kind of anime and its sense of style.  But it's executed quite poorly and you'll find better examples of the genre elsewhere.  Oh, and regarding the music, although most OP and ED are bad in this anime, the worse is the terrible OP during the second half of the season.  Is that some kind of country-western R&B hybrid?  I don't know, but feels like they went out of their way to offend my ears.",
            "date": "2018-11-27T15:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 294832,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Qichar",
                "username": "Qichar"
            },
            "url": "https://myanimelist.net/reviews.php?id=294832"
        },
        {
            "content": "\"My grandson,when will u gonna to succeeding me?\" \"But i told u i wanna live as a human!\" \r\n\"How many youkai I must change sake cups with? I'll take the seat of Third Heir and protect the weak youkai\" \"Darn! If the dawn breaks,his forms will change again and he'll forget for what he just said.What a pity,master..\"\r\nCute in day, handsome in night....!! Very rare youkai in new adventures! \r\nIt's very great anime! Tell the truth, I didn't like the art of its manga so much. Kinda make me creepy. But its anime now, have change it! I must said, the design characters drawn mefirst, and then the story! The youkai themselves is drawn very beautiful. Really can inivite both male and female fans to crazy about this anime. Hope the story will also reach the greatest battle of Nuragumi with most strongest youkai, like its manga version\\n\\n\r\nPlus the theme songs! I prefer the opening ^^ Kinda familiar with the music theme,remind me of Harry Potter's music >.< but perhaps it's only my imagine hehhe.",
            "date": "2010-07-14T09:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 28395,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331217.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ryuichi_crosszer",
                "username": "ryuichi_crosszer"
            },
            "url": "https://myanimelist.net/reviews.php?id=28395"
        },
        {
            "content": "This is my first review, so please leave comments.\r\nStory:\r\nThe story is really good, sometimes it just goes a little to fast. There are also a few errors in the story. Because they say in one episode that the enemy is a coward, because the fight with one against two. But two episodes later they do exact the same thing as the enemy, fighting two against one. \r\nArt:\r\nThe art was amazing, that is all I can say about it.\r\nSound:\r\nThe voice acting is well done for the most character. And the openings are really good and they stick in your head.\r\nCharacters:\r\nThere are good characters, but I didn'tlike most of the characters.\\n\\n\r\nEnjoyment:\\n\\n\r\nYou will enjoy yourself with this anime. Only sometimes you may think why did they put this episode in it, or why did this fight happen. You sometimes just feel like you are watching a useless and not important episodes.",
            "date": "2013-01-22T22:53:00+00:00",
            "helpful_count": 9,
            "mal_id": 84569,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2025143.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dest-roy96",
                "username": "dest-roy96"
            },
            "url": "https://myanimelist.net/reviews.php?id=84569"
        },
        {
            "content": "Another review for this show mentioned that it took a few episodes for them to get into it and I have to say that I agree completely. A good while back I watched the first episode, and I was kind of \"meh\"\r\nSome time later I was a bit bored, so I started reading the manga, and it was kind of the same way.  But, after getting through the first few chapters, I found myself really getting into it.  Really, this anime is quite a lot of fun, and I would say it is worth it once you get into the meat of thestory.  Anyone who liked InuYasha back in the day should be able to enjoy Nurarihyon.\\n\\n\r\nNow I just have to hope that the anime won't catch up to the manga, so I don't have to deal with fillers....\\n\\n",
            "date": "2010-12-17T22:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 32828,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/420985.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rava",
                "username": "rava"
            },
            "url": "https://myanimelist.net/reviews.php?id=32828"
        },
        {
            "content": "I feel so much potential was wasted on this one, it is kind of frustrating.\r\nThe anime has nearly all ingredients to make a great shounen: first a good plot concept, then there's youkai and humans and their various relations, yakuza styled youkai syndicate, great art style, nice VAs and BGM, enough space to develop the plot and characters and a great deal of Shinto concepts and ideas....\r\nAnd then...enter THE characters...\r\nFor me personally, the characters ruined a fair bit of what otherwise could've easily been an 8/10 shounen. While I can ignore unrealistic age and pretend they are older than what they're supposed to be inthe anime, what I can not ignore is their intellectual level. I reckon stupid characters exist in nearly every anime, however, in the case of Nurarihyon no mago, at least 70% of them had about the same intellectual level as my 2 year old nephew. You know, when you tell a child \"don't touch the hot iron\" and the next thing you know is that is exactly what they're doing. \\n\\n\r\nMore than a few characters were simply unnecessary to the story, many conversations were repetitive and shallow, the pace was slow and painful, and the climax didn't really feel like one, whether the conclusion was satisfying is questionable. \\n\\n\r\nThese 24 episodes could have been compressed in a 13-15 episode series easily.",
            "date": "2017-12-20T23:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 265797,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Enjyu",
                "username": "Enjyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=265797"
        },
        {
            "content": "Nurarihyon No Mago. \r\nAn anime i first noticed when i saw the title, and really liked the pronounciaton of the name Nurarihyon. (Don't judge me)\r\nAnd to be honest, it's really good. It's far from something groundbreaking, but if you're in the mood for a battle shounen, this is actually one of the better ones out there.\r\nOur main character is a person who is 3/4 human and 1/4 yokai/demon.\r\nThis results in the situation that he can only take on his demon form, for 1/4 of the day, specifically, right after midnight. But you can be damn sure, that when he appears, something epic is gonna happen.\r\nThehuman version of rikuo is very stereotypical at times, but in my opinion, it doesn't take that much away from the show.\\n\\n\r\nIf you're looking for an intricate plot, then go on to the next review. This anime is not insanely deep. It's a classic battle shounen, with some of the known clichés every now and then, but that didn't keep me from enjoying it.\\n\\n",
            "date": "2019-01-17T13:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 299307,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7208768.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BlackNeonStar",
                "username": "BlackNeonStar"
            },
            "url": "https://myanimelist.net/reviews.php?id=299307"
        },
        {
            "content": "Story (6): Don't get me wrong, the story has good potential, but for some reason I kept feeling sometimes it moved too slow and other times it skiped important development and moved too fast.\r\nArt (9): The art is very enjoyable, specially the design of the yokai, each character is very singular and deteiled in it's own way.\r\nSound (6): The ending quite grows on you, but I think the sound, plus Rikuo's classmates took a lot of the seriousness this story could have had.\r\nCharacters (10): Again, the youkai are very varied and well developed, having so many different characters, one would have not thought they wouldtake the time to give each one (at least the main ones) a chance to show their abilities and personalities.\\n\\n\r\nEnjoyment (6): I must admit it kept me pretty interested till the end, the fights are quite nicely done.\\n\\n\r\nOverall: If you like youkai, specially the ones that not necesarilly interact with humans as evil creatures, you'll probably enjoy it, don't expect to watch a very serious anime though, prepare for some lighthearted laughs and nice fights.",
            "date": "2011-01-03T17:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 33406,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/397194.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yakarin",
                "username": "Yakarin"
            },
            "url": "https://myanimelist.net/reviews.php?id=33406"
        },
        {
            "content": "Story: 8/10 This is a Anime about, young Nura Rikuo the grandson of the supreme commander of the Nura yokai clan.  As heir to the most powerful clan of yokai, he has to live up to a great expectation set by his grandfather the Nurarihyon. This season of the show goes through the internal struggles of the Nura clan to the fight against the evil Shikoku yokai. The story is really interesting and really pulled me in. I have not read the manga so I wouldn’t know if it was slow or not. The pace of the show was good, tho at the beginningit felt a little slow but it was manageable. The second half of the Anime has got to be the best part of the Anime. The pacing was good and the story pulled me in and I could not put it down. \\n\\n\r\nArt 9/10. The art was amazing for the show and was very colorful. The character design's were great too. From Yuki Onna's gold rinnegan eyes to Rikuo's epic night form.\\n\\n\r\nSound 10/10: this is where Nurarihyon no Mago excels greatly, the two openings Fast Forward and Sunshine we're perfect for the series. They are extremely catchy and sometime the band that sung them felt like a English alternative band. I personally enjoy the first more than the second but all in all they both were amazing. The two endings are good but they cannot beat the amazing opening themes. I suggest checking them out. \\n\\n\r\nCharacter 8/10: The characters we're really interesting and made the series really fun at times. Rikuo was gotta be the best character of the series. His dark form is really awesome, and Jun Fukuyama does a freaking amazing job as the seiyuu for him. Other cool characters were Yuki Onna (Tsurara), Zen, and Yura Keikain. I think that the series would of done a little better if there were more character development and some more romance scenes. I personally think that Rikuo should of told his friends who he was especially to Kana, or I wish they saw him change his forms or something. It would of made the series a lot more interesting and would of bumped up my rating. I hope this happens in season 2 sometime or later on in the series. Also, after a while it got ridiculous that all those demons in his house would always hide and they would never be found even when it was completely obvious that they were there.  Though, I always felt sorry for Kiyotsugu... he always wanted to see the yokai but never did even though everyone else around him saw them it was pretty funny tho. \\n\\n\r\nEnjoyment/Overall 8/10: I think this series was great. It had a lot of high points and some low points but overall I'm glad I watched it. Though from what I heard, those who read or have read the manga won't like it because it is “slow”. Other than that, this series is really good and down the road I might want to rewatch it again. I cannot wait for season 2, I hope it will be bigger and better than this season!",
            "date": "2011-01-23T19:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 33995,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/350969.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ariamachi",
                "username": "ariamachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=33995"
        },
        {
            "content": "how come you say its only 24 episodes...i watched it and its 26 episodes, i can't even change it.\r\nthe story wasn't like so catchy but i liked it and I'm watching it to the end.",
            "date": "2013-03-04T02:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 88639,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2253119.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nolladazzle",
                "username": "nolladazzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=88639"
        },
        {
            "content": "This is a pretty well established anime. A young kid who is half human,half demon takes control of the strongest demon clan(the clan he belongs to) and proves to be much more different than the previous rulers. Thanks to his human side. And so not to give anything away, the story develops from there and deals with the tasks of uniting humans and demons. The anime is well animated, has a easy simple plot to follow and entertaining as hell. Pretty good character development as well if you like that kind of stuff from your anime. It is well worth a watch and i recommendit to anyone.",
            "date": "2013-05-02T20:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 95759,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=95759"
        },
        {
            "content": "Let me start off by saying that Nurarihyon is one sexy Yokai!\r\n*ehem*err* Alright, now I have gotten that out of the way...\r\nStory: 7 - For me it's just the typical Human/Yokai story... it has an 'Inuyasha' feel to it... the plot is not boring, it's actually fast paced, but maybe I was looking for something more... the characters were developed quite nicely and the fight scenes aren't bad either... since Nurarihyon was strong, i wanted the antagonist to be a bada**... Also, the human by day and yokai by night is okay... not that Rikuo is not cute, but i wanted more Nurarihyon... waiting forthe transformation kinda gets old...\\n\\n\r\nOverall/Enjoyment: 8 - Nura and his clan are so fun to watch... Nurarihyon is the leader of a bunch of Yokai - most of them appear harmless and they'll be the mischievous spirits at best... his most loyal subjects are Yuki Onna, Aotabo, Kurotabo and Kubinashi (Headless)... they provide comic relief to a seemigly serious story... We also have a \"love angle\" but being 12 yr olds, they are a little bit too young to be excited about... and i like Yura better than Kana, btw...\\n\r\n             Ending had a nice feel to it and was not too mushy... though it did make me go 'Aaawww - that's cute...' - \\n\r\n             What I also liked best here is the Sakura tree... it was mesmerizing... i am still waiting if it has some kind of significance in the story or maybe i missed it... :P \\n\\n\r\nNow watching the 2nd season and by the looks of it, the 2nd part is much more promising... can't wait... :)\\n\\n",
            "date": "2012-06-12T18:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 63301,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BBHood22",
                "username": "BBHood22"
            },
            "url": "https://myanimelist.net/reviews.php?id=63301"
        },
        {
            "content": "I watched nurarihyon when it aired on animax around 2010-11 and I was completely in love with the show. It’s been quite a few year since manga ended and I couldn’t recall much of the storyline so I decided to rewatch it from the start. I didn’t know if I would enjoy it as much as I did but.....I fell in love again with this show.\r\nAs someone who’s into mythology and historical genre I enjoy this show to the core. The animation is great. And night Rikuo’s seiyuu did an amazing job. The voice just suits him so well. The action scenes are really nicetoo and so are the soundtracks. The animation of the Sakura tree is simply mesmerising. I wish I had one in my backyard too xD\\n\r\nThe pacing of the story was fine by me. I’ve heard a lot of ppl say that the pacing is slow but I didn’t mind.\\n\r\nThe openings of this season are awesome. I still listen to the two songs till date and the endings are good as well.\\n\r\nSo If you’re into such genres revolving around youkai and ayakashi with modern and traditional blend then definitely give it a try!",
            "date": "2019-03-20T23:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 303955,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4929129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mishi20",
                "username": "Mishi20"
            },
            "url": "https://myanimelist.net/reviews.php?id=303955"
        }
    ]
]