[
    [
        {
            "content": "I'm sorry Chaos Dragon, but you just didn't manage to attract me.\r\nFirst off, the animation. It would be really good, if it weren't for the CG. It's overdone, and useless. The Bollock lord of Sheet mountain.\r\n(On the other hand I'd be a really nice person, if it weren't for my personality)\r\nStory: CD has a lot of focuses, which some people might think of as it is diverse and combines \"good\" elements of each genre, but how i see it is that it doesn't have a bloody focus, and without a focus, it gets really boring really fast! Doesn't have consistent comedy, story, characters or actually,just about anything.\\n\r\nGets boring quickly, I don't know how i went through 12 episodes of something that equals chinese water torture. \\n\\n\r\nCharacters are boring and inconsistent. Generic as well, trying to picture a wimp as an occasional badass. Doesn't work like that anymore.\\n\\n\\n\r\nSound is alright, it doesn't stand out in either way. There could be some improvements, but that's just personal opinion. I'm trying to have a general opinion on this.\\n\\n\r\nEnjoyment and overall should be read from the above. Didn't enjoy it. It's bad.\\n\r\nExplosively apocalyptically bad. There's anime that you should watch just because they're bad, and the animes you avoid like the plague. This one is the latter.",
            "date": "2015-09-21T14:05:00+00:00",
            "helpful_count": 99,
            "mal_id": 199157,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ThunderClap448",
                "username": "ThunderClap448"
            },
            "url": "https://myanimelist.net/reviews.php?id=199157"
        },
        {
            "content": "If there can be one thing said about Chaos Dragon as a whole, I think that would be \"I'm glad it didn't get delayed\"- because thank God, it's finally over.\r\nChaos Dragon... what an interesting idea- taking a DnD-based game called \"Red Dragon\", played by four industry persons and some dude named Simadoriru: Gen Urobuchi of Madoka, Fate Zero and Psycho Pass fame, Kinoko Nasu, creator of the Fate series, Ryougo Narita, who wrote Baccano and Durarara, and Izuki Kogyoku, another author \r\n... and turning the story into an anime. While not an original idea, (\"Record of Lodoss War\" was the first) it's still one thatcould turn into an interesting fantasy style story, replete with dragons, loot, the undead, and fascinating characters who are extensions of the personalities of their creators, right? \\n\\n\r\nWell... Chaos Dragon has these things, but they don't always work out.\\n\\n\\n\r\nThe Good: \\n\\n\r\nArtwork and Animation: 7\\n\\n\r\nA collaborative effort between Silver Link and another studio, Connect- the art stylings are reminiscent of ufotable- large eyes (and everyone has this intensely long cateye that shows through hair) and skinny bodies. The character designs, though, particularly the clothing- are really stupid looking. \\n\\n\r\nAllow me to describe Ibuki, the main character, to the reader. \\n\r\nImagine, if you will- a young boy, no older than 12. He's got white hair and red eyes, because apparently the entire Nil Kamuian royal family is albino. He's clad in a white tunic, with a belt- and attached to this belt are what appear to be two red trash bags, cut on the sides to appear like pantaloons. He's also wearing flip flops and socks like a real gangsta, and he has a turban on. \\n\\n\r\nThis is the most egregious example, but never fear, the rest of the characters from Ibuki's country are clothed similarly idiotically. It is nice, however, to see some character designs that don't involve school uniforms or sailor outfits. \\n\\n\r\nAnimation wise, everything is solid. Fairly consistent detail, fairly fluid animation, and a lot of nice looking fantasy backgrounds- castles, valleys, cities, etc. \\n\\n\\n\r\nSound and Voice Acting: 5\\n\\n\r\nMarina Inoue cast as Ibuki was probably the single best thing they could have done for the show... if they wanted to have a ninnyboy, weenie protagonist. Also the voice of Armin in Attack on Titan, Ms. Inoue delivers another dish of crybaby protagonist in Chaos Dragon, only moreso. \\n\\n\r\nThe rest of the cast ranges from pretty boring to fairly chilling, ending with Lou Chen Wah. One Maaya Uchida voices Lou (in a role that would have been perfectly suited for Yukari Tamura) excellently though- bringing the cold hearted evil witch to life. \\n\\n\\n\r\nThe Bad: \\n\\n\r\nCharacters: 2\\n\\n\r\nThe problem with the characters lies mostly within the writing abilities and types of characters that writers like Urobuchi and Nasu typically write. It was plainly obvious from about the 4th episode on who wrote which character. Not that this is a bad thing, but given that I knew these two were involved, I was on the lookout for their character, and it was immediately apparent- Lou belongs to the Urobutcher, and Sweallow/Meryl were the Nasu characters. \\n\\n\r\nLou's character is probably the best in the show, and all credit due her writer- Urobuchi. She's exactly what you'd expect from one of Gen's characters though- ulterior motives, backstabbing bitch, and very cunning. I guess it doesn't hurt that she's also a religious fanatic who's possessed by Soul Edge- an evil sentient sword passed down through the ages that drives the wielders insane and turns them into a slave to gather more souls for the evil sword to increase its power. \\n\\n\r\nAt this point, we can safely say that Nasu has no clue how to write (or while playing DnD, act as?) effective female characters, and his male characters ALWAYS follow the same progression. \\n\r\n1. Protagonist has some curse or affliction\\n\r\n2. Protagonist has a heart of gold and some family members or friends to protect\\n\r\n3. Protagonist is lawful good TO A FAULT, and extremely foolhardy upholding their sense of justice/right/must protect/! \\n\\n\r\nSweallow by far is not the worst character though. No, that award goes to Ibuki, who is probably now on most every top ten list of \"Worst/Most Annoying Shonen Protagonists\". Not since Suzaku Kururugi have I wanted a character to die so hard as I did Ibuki. \\n\\n\r\nThe absolute embodiment of the most stupid shonen tropes, I think Ibuki was created just to anger the audience. It was just tolerable in Fate Stay Night with Shiro, it was acceptable in Neon Genesis Evangelion with Shinji... but Ibuki takes the wiener cake. He's most cowardly, contemptible character I think I've ever seen. His absolute refusal to harm anyone, despite it potentially costing him his life, and his country being at war, ravaged from inside by their own patron dragon is mind boggling. He literally has people throw themselves on his sword to escape his presence, that's how bad it is. \\n\\n\r\nOh, and Ka Grava is just a sane Big Daddy from Bioshock who wears a top hat and is super rich. \\n\\n\\n\r\nThe Ugly: \\n\\n\r\nStory: 4\\n\\n\r\nA lot of major things that happen in the show are most likely as a result of dice rolls- characters take damage or die? The player probably rolled low. \\n\r\nLou's arm loss was probably a result of a bad roll. Lou getting a new stupidly overpowered arm was probably the result of rolling a 20 for loot. \\n\\n\r\nWhile the story (if one had no knowledge of how a DnD game typically plays out) seems really nonsensical and disconnected, it's really not too bad, other than how excessively tedious it is. DnD games involve a LOT of talking and not a ton of action all the time. This doesn't translate well to a short anime series where you spend the first 3 episodes explaining the world, introducing the characters, and the complex relationships in the world that the Dungeon Master lays out before an adventure. \\n\\n\r\nI do understand that it's necessary to have this exposition, however there are ways to make it interesting, such as short animated scenes in the form of flashbacks, but the beginning montage that repeats the same lines over and over just gets tiresome. Yes, we know the island nation of Nil Kamui is beset upon by Kouran and D'natia, thanks. I don't need to be told 12 times. The story is pushed along by the ever growing (and shrinking) cast. New characters are introduced with nearly every episode, and then a majority of them are killed off throughout the show... I only wish that Ibuki himself was the one that died. His idiotic \"curse\" really isn't a curse at all. At any point throughout the show, all of the conflict would have been settled and nobody would have had to die if he'd just offed himself, but of course, our little ninny shonen protagonist must survive at all costs! \\n\\n\r\nThe story itself is fairly typical of a DnD adventure- a party goes through towns and dungeons and lands in search of a mystical item that will stop the rampaging dragon that's ravaging the land. Some characters have ulterior motives due to their allegiances, and some decide that their friendships are worth more to them than the wills of their government. While this sounds pretty exciting, in actuality, it's rather boring to watch. Each episode is semi formulaic- Ibuki and pals run into a conflict that can only be solved by Ibuki killing one of his friends, and then Lou and Sweallow, and their respective nations scheme other plans for what's going to happen when they find Red Dragon, whether it's to kill or enslave it. The evil is defeated with Red Dragon's power, and they move on to the next place. \\n\\n\\n\r\nNEEEEEEXT!\\n\\n\r\nEnjoyment and Overall: 4\\n\\n\r\nChaos Dragon does improve somewhat at the end, but the introduction of yet another Deus Ex Machina character kind of spoils it. The ending is a bit of a head scratcher as to why Ibuki can't just do the deed, but it ends on a nice note at least. (A better note would have been Ibuki's head on a pike, on fire.)\\n\r\nOverall, it's a pretty boring fantasy series. Not a whole lot of redeeming qualities about it, maybe except the artwork. (The 3D CGI doesn't suck!).\\n\\n\\n\r\nRecommend? \\n\\n\r\nChaos Dragon is a Chaotic Neutral show. It follows its own whims, and like most neutral characters, it's neither good enough to like, or bad enough to despise. It just rides the middle of vanilla territory. \\n\\n",
            "date": "2015-09-18T13:19:00+00:00",
            "helpful_count": 70,
            "mal_id": 198830,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=198830"
        },
        {
            "content": "Legends speak of a show that is considered to be one of, if not the absolute worst show of 2015. A show with such incompetent direction and CGI that frame rates slow down in the very first scene. A show with such uninteresting characters that their deaths are a loss to no one in the audience. A show so edgy and poorly written that it can only cause \"darkness-induced apathy\".\r\nYou know what they say about legends. There's always some truth to them.\r\n*Spoilers for Chaos Dragon*\r\nWhen you hear about an adaptation of a gaming session involving the likes of Gen Urobuchi of Fate/Zero and Psycho-Pass, KinokoNasu of the Nasuverse (Fate/Stay Night franchise, Shiki + Melty Blood, Kara no Kyoukai), and others, you can't help but wonder how the hell it'll turn out. It's based on a game session but it's a session from rather popular figures in the realm of anime, even if they're not Hideaki Anno. Unfortunately, the writer and the studio ducked up beyond belief and managed to ruin most of the fun that could've come out of something like that, even if there was nothing necessarily indicating that this anime would be good. Its status is almost legendary as one of the worst of 2015 and even the decade, with more people having seen it and calling it shit than Mars of Destruction, even if it's not as popular in its awful reputation as say, Big Order. So, what happened here? Well, let's find out, shall we?\\n\\n\r\nIn some island, Nii Kamui is overtaken by D'Natia and Kouran, and the king's son is in an orphanage, but then after people die, he ends up finding this relic that somehow gives him the ability to subconsciously communicate with Red Dragon (because fuck creativity in dragon names). He also gains a really stupid curse: every time he wants to use dragon power, he must kill someone he has a deep connection with and use that soul to eradicate someone else. I needn't mention why such a power is stupid and only there for needless drama, especially since it makes it so that the MC (Ibuki) is always whining about \"I love my friends and I won't kill any of them\". Seriously, when Fairy Tail is more subtle about friendship, we have a problem here, and Fairy Tail is synonymous with \"friendship trumps all\". In fact, people have random curses as they're born, like Sweallow's which make him break any tool he touches, except that by the anime's logic, walls and ships are also tools (because while the power wasn't stupid enough, they're basically calling literally every single object a tool, except somehow for his clothes because fuck consistency). I'll touch in what pisses me off the most about the powers later. Also, there are apparently 7 dragons (one for each kingdom I suppose) but we only see two of them: Red Dragon and Black Dragon, which are for Nii Kamui and D'Natia. We don't even see the one for Kouran, or any of the other dragons. \\n\\n\r\nSo, an ever-expanding group of flat, poorly-written, and unlikeable assholes (sans a few that only fit the first two categories) join up on an expedition and while the MC wants to find and reason with the now maddened Red Dragon, everyone else (sans two members) wants to kill Red Dragon, which could've created conflict on its own between some of the members of this anime knew how to manage them. They also throw magic into the mix but the only time weever see magic that has a magic circle to clue us into the fact that it's supposed to be magic (since nothing is ever directly classified as such) is when one imperial from Kouran creates a poorly edited blockade. Before you try to classify those soul-sucking weapons (like the one Koukaku has in episodes 1 and 2 if you remember her, or the sentient one that Lou has) as magic weapons, it's never directly stated or even hinted at. Then zombies, or rather \"returned ones\" show up,and where we get another issue that compounds itself the longer the anime runs. The start off as literal zombies minus the brain eating, but then one of the people Ibuki killed is conscious and able to speak (somewhat), and by the end, the final antagonist is also a returned one but with full consciousness and personality as well as a complete ability to speak as well as she did before, and we never know why.\\n\\n\r\nCharacters often make really stupid decisions, like one character actually stabbing himself, gouging his eyes out (or stabbing them with his fingers), and pretending to be a returned one just to get Ibuki to sacrifice him for the dragon since only loved ones and close friends can be sacrificed. Now, this is stupid enough but the part that makes this especially stupid is the fact that he and the main character hardly know each other or have any semblance of a bond, which is mandatory. As you could guess, that plan obviously backfired (since it honestly would've been beyond stupid, even by Chaod Dragon standards to let the sacrifice work). When one f the characters is clearly dying and having a hard time escaping rubble while the final antagonist is causing havoc, Ibuki doesn't let her sacrifice herself, and while ultimately it wouldn't have worked since Red Dragon is under the villain's control, he didn't know that at the time and it just seemed like a lazy way to have justified his idiotic behavior her can't even count as properly sentimental. If he was told earlier that this power wouldn't work for a while or if he tried it and failed which should make his friend live a while longer, then it would've been acceptable. Also, when he tried to say that that same friend shouldn't just be a sword for him as she's asking him if she is his to use (since she really wanted that), he frames it ina way that shits her down horribly rather than what he intended (that she shouldn't think herself of just a sword but more of a closed friend), and unlike say, Lelouch, who often words things poorly on purpose to either take blame or turn people against him, here, Ibuki just fucked up, which is emphasized by the fact that he manages to actually say it right in the finale episode.\\n\\n\r\nAfter a quick journey that could've been used to flesh it the characters, see then develop a bond of camaraderie with each other (but you know, that's what a good anime would do), it turns out that Ibuki's sister was alive the whole time. Yeah, remember the part where his family died and Nii Kamui was taken over and Red Dragon went insane, all before this expedition started? No? They only went through it every single episode after one scene in the beginning! Give other anime like Bakugan and Fairy Tail some credit; they do it at the very beginning before any OP or scene has a chance to occur rather than shoving a scene beforehand. But yeah, she survived and neither she nor Ibuki were reunited in 3 years since nobody had the bright idea to look, but that might be the leader, Agito's fault, seeing as he wanted someone to kill her after she made Red Dragon go crazy. Then again, seeing as how that required someone to have a contract with Red Dragon and assemble a team to stop her, why wasn't it done earlier? Oh yeah, because they died since instead of assembling a team to stop her, he wastes their time by making them go the  volcano where Red Dragon was. He makes the current group do the same thing too, and D'Natia sends their weakest imperial warrior first and only two more powerful soldiers way later since while they went to kill Red Dragon, I guess they're a bit lazy or something. Also, yeah, that sister is the main villain and she revived the first person Ibuki sacrificed; his love interest, and she dies a lot until she dies for good.\\n\\n\r\nBefore we get onto the topic of the paragraph's discussion, the reason Ibuki's sister, Inori, can revive her is because she has another artifact of Red Dragon, by this one revives people. Now, remember those curses? Well, apparently, the one Swaellow has is supposed to be part of this bullshit Aesop meant to say that it's human nature to shatter things like object or connections but that new ones are often formed in its place and that he should stay with this power. My response: \"Oh, FUCK YOU, ANIME!! You and your bullshit and inconsistently written curse BS that basically ruined a major character's life since childhood was to teach him an Aesop of human nature?! Fuck you, fuck whatever gave him the curse, fuck Black Dragon for not lifting it, fuck Swaellow for being a fucking moron and sticking with it, and fuck the writer for doing this bullshit!\" Oh, I still stick by that. It's beyond retarded. Also, after more nonsense and generic trash stuff and one of the characters betraying some of her allies, Ibuki kills his sister and she's revived and Ibuki becomes king. Also, Lou, the one who killed some of the other expedition members, gains that other artifact and then she walks off. The end. Of course I can't really hit every oddity in the series' writing, like Lou's badly done and borderline blatantly telegraphed heel turn, or like god when Swaellow's attendant blocks an object she shot out, it manages to hit him anyway despite the fact that he is literally behind his attendant who blocked the shot. Ether way, this is mkre than enough to really show how awful the writing of this show is. Now, for those bad characters I mentioned earlier.\\n\\n\r\nTo return to the cesspool of blithering idiots known as the characters, let's start with Ibuki. This brat is one of the most infuriatingly whiny protagonists I've ever talked about so far. He always whines about losing and not wanting to lose people he cares about due to his new power, but he never thinks to use his sword regularly and train so that he can actually defend people with his regular skills so that he doesn't have to get to the point of needing to sacrifice them to kill an enemy. It's not excusable by the fact that he is a child because even then, children would've often tried to get stronger so that this never would've happened, or he just would've ran, and he doesn't do either. He just whines the whole time but never actually tries to do anything to improve his situation so that what he fears may never happen again.\\n\\n\r\nEiha is beyond insistent on dying for this loser, and for no good reason. Her bodyguard devotion to him is her only real trait aside from being discriminated against for being a \"bounded one\" or one attached to a beast. Lou is easily the least terrible and one that could've been potentially amazing, but her personality is basically \"attractively creepy and badass\" while having a truly terribly done heel turn. It's probably a coincidence that the best character was made up by Gen Urobuchi. Sweallow (who looks strikingly similar to Gunvolt from the Azure Striker Gunvolt games) is a complete idiot who happens to have that awful curse and still be a badass, but that's his whole character. His attendant (Meryl) is an infuriating character who basically derides him at every turn and hits him, almost like a trash tsundere. Everyone else is either just one-note and barely there so they're not worth mentioning (like Koukaku and Ulrica), or are just idiots who deserve to die (like Kai and Hien), so the only one left to really mention aside from the shitbag 1D dragons is the final antagonist, Inori. God, what a butch. I get that kids can be terrible to each other and to authority sometimes, but they wrote her character to be so unrealistically deplorable and incestuous that it's quite frankly pathetic and downright edgy. All she does is do things for her brother or just be a total monster, and not even the entertainingly evil kind either. I don't feel like anyone else is even worth a paltry sentence of mentioning, so I'll just leave it here. What a shit show of a cast.\\n\\n\r\nLet's start with the character art. It looks like a weird, failed attempt to capture the art-style found in Studio Ufotable's adaptation of Fate/Zero and Unlimited Blade Works. Given that this isn't Ufotable, I'm right; it was done by Studio Connect and Studio Silver Link, the latter of which is mainly known for a few popular, if somewhat divisive titles like Chivalry of a Failed Knight, and WataMote. Then, we have the animation, which often looks like an animatic rather than animation given the number of frames that tend to be missing from many movements more advanced than walking. The choreography is awful too, especially in the early episodes. It sometimes becomes painfully obvious as to which scene was done by a different studio like in episodes 7 and 10 looking different in lighting and feel (as well as the wildly inconsistent sizes of Meryl's freckles). The characters often don't feel like they're connecting with the ground properly, especially when they end up rolling around via knockback, and it's rare when an anime gives off this vibe. Overall, actual animation is pretty poor at worst and mediocre at best, especially with the occasional reused footage which I thought died out this day and age, at least until two years later with a certain title that shall not be named\\n\\n\r\nThe CGI here is some of the absolute worst that I've seen in anime. Let's start with the goddamn Red Dragon. He looks like an animated version of some kid's over-designed action figure, and at times, they give him the ability to static out of existence. Every bit of movement has different frame rates as well, and it looks beyond ugly. You can apply a lot of this to Black Dragon as well. It's all hideous to look at, and the tentacle monsters summoned at episode 10 not only look terrible but when they die, they disappear into weird purple hoop CGI that fails miserably at being blood. Some backgrounds are literal live stock footage too, though that's surprisingly hard to notice. Still, it's unacceptable in any circumstances in today's time, or even two years ago when it came out. The CGI beetle-ship in the finale isn't any better. Hell, scene one of episodes 1 and 12 (since it's a repeat of the very first scene in episode 1) has a fugly ass CGI castle with abominable frame rate, and brings up memories I'd rather forget.\\n\\n\r\nThe OP, \"ISOtone\" by Natsumi Kon, is literally the only remotely noteworthy piece of music in this entire damn OST, and it's an alright OP. The ED isn't worth mentioning. Neither is the rest of this goddamn OST with how generic and forgettable it is. Worse yet, some of them can be repeated at nauseam, like the piano piece in episode 8 being repeated 4 times in that same episode. As for the dub, it's rather mediocre as well, and I cannot believe that they wasted Lanipator on this piece of crap show. Even Tia Ballard can't save this with how little her character appears, though it's not like these guys were doing that bad. It's just lame overall and the character models don't even feel like they work with the dub all that much. Also, some of these sound effects are goddamn awful, like with blood splatter sounding like when you get crushed and splattered in Happy Wheels.\\n\\n\r\nThis is easily one of the worst anime I've seen to date. It's not even memorably bad either; it's one of the most forgettable anime I've ever given such a negative rating to. It's terribly animated, the script is a mess, the characters are bland and/or idiotic, the CGI is fugly as hell, and nothing about this show is actually good; maybe a few things that are decent at best, but certainly not good. People were right in calling this dreck one of the worst anime of 2015. Well, with that said, I bid you adieu.",
            "date": "2017-05-10T13:59:00+00:00",
            "helpful_count": 24,
            "mal_id": 247388,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=247388"
        },
        {
            "content": "Now that Chaos Dragon is over I'll be sure to tell the truth about this series.\r\nChaos Dragon is a very interesting series not because it's good or unique but because it's hard to predict how it could get worse and worse each episode.\r\nBut since you could go on for hours about how terrible it was I'll just make a pro's and con's list.\r\nPro's : The concept itself was interesting       and\r\n            Some of the less important main characters were fairly good characters.\r\nCon's:  Horrible writing, terrible lead character, barelyany effort put into the series, poor execution, nothing memorable from it's soundtrack, crying 12 year old protagonist, terrible animation most of the time, terrible character development, terrible pacing, terrible dragon designs, and plenty of other things.\\n\\n\\n\\n\r\nBut long story short Chaos Dragon isn't the worse anime ever but it's definitely close. I'm trying to think of a reason to recommend people to watch it but it's only something I recommend to people who want something to watch to learn how not to make a pathetic series.",
            "date": "2015-09-17T15:58:00+00:00",
            "helpful_count": 37,
            "mal_id": 198773,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1419829.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Jakerams",
                "username": "Jakerams"
            },
            "url": "https://myanimelist.net/reviews.php?id=198773"
        },
        {
            "content": "On every season I pick up over 44 series the summer season. LITTERALLY. I picked 44 in total. For the most part for me summer was alright, with a few bad shows. Few good, at little great, but also Silver Link delivering shows like their works this season like Fate/Kaleid and their winter work Yuri Kuma which was an anime original series. The phrase of \"In Silver Link we trust\" is a very common word for them because they barely make any terrible series. Their weak points are making anime original series to be honest. One of the only series I remember that was horriblewas C3 Cube. Trust me that show was terrible... and then we got this. This show. Alright? we had Gen Urobuchi behind this, but do you know what happens when Gen is behind some shit? Yep trolled behind our backs to get our heads spitted with saliva. This would go for the same way as his previous troll series this year. But lets just go on ahead and say, this series is by far the worst of the kind. If you think that Ranpo is one of the worst of the season... trust me, this is litterally the worst series I've seen after winter spitting me words of BS. Well lets begin with the review before I lose my sanity.\\n\\n\r\nStory: One of the few, most pitiful parts of the series categories. Yes it has some of the interesting concepts, I will admit I was curious for the series because for #1 it had a lot of people behind which are famous, and second the concept or the plot seemed interesting from the trailers and as well with the synopsis. But then when you watch it... thats when the things get atrocious. The first thing of this anime is that the episodes are very very inconsistents. I mean they're terrible overall. Yeah, we had a first bad episode, and I personally give all a chance, but then later on it became worse and worse for me. It felt like forced stuff going around you here and there. The second thing is the execution being completely poorly done. It feels so jarring and very predictable as well because you would know by the glance it will happen. There was also moments where I felt like the series was being shifted fastly, in other words rushed pacing. There was a very lack of build up as well and not to mention that the ending for me felt like its telling a season 2 in a bad way. So overall the story is by far the weakest component of the series.\\n\\n\r\nCharacters: This would be rather short, because this would be considered another part of the anime where it actually fails to bring a good cast of characters. Other words they're by far the 2nd worst component. They're all or most of them are one dimensional with no good development whatsoever. They felt for me just thrown there. Especially when you have someone interesting you don't get good insight. I only remember one good character and thats it.\\n\\n\r\nArt/Animation: Now a bit to say here, the artstyle isnt the best but its not terrible either. It looks a bit more creative style for their character designs because technically the authors had to make their own characters, and they look okay. However also the background feels lacking and jarring. NOT TO MENTION. The biggest issue here in this anime are two different things: The animation is completely utter bad, I mean choppy a lot of the times and it just feels and looks horrible. It looks very inconsistent and also very cracky. But most of all the second issue. The awful Dragon CGI.  WHAT THE FLIP IS THIS? IT LOOKS LIKE FUCKING CLAY. It looks horrible and usually I can say the Overlord's CGI are better. Or Rokka's. Overall, a bad art/animation.\\n\\n\r\nMusic: Lets get into the OP and ED. To be honest these two are the best things from the anime. They fit with the series rather well and it gives a dancing groove. However the music soundtrack its very generic and unmemorable. Sound it makes me go and get my ear drums pump badly. It feels like screeches as well.\\n\\n\r\nEnjoyment: I only liked bits of the anime fights and some parts of the series. Overall... it was a terrible factor. Many series even at the stances of bad like for example Fairy Tail and Mirai Nikki they are usually fun at times. This for me personally has none.\\n\\n\r\nOverall this series was a true disappointment to my waste of time and potential thrown aside towards anime original content too. Of course this is the director's first try, but damn please learn after this. This is also Silver Link's second worst work so far. They barely makes bad shows of course... thats just me.",
            "date": "2015-09-18T20:27:00+00:00",
            "helpful_count": 27,
            "mal_id": 198848,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=198848"
        },
        {
            "content": "I don’t think anybody really thought for even a second that Chaos Dragon was actually going to be good when they saw the team attached to the project. Interesting, maybe. Fun to joke about. But definitely not good. I mean anime in general has always been worse in regards to the kitchen sink approach than Hollywood films and AAA video games, and considering that the only thing these supposed “talented” people like Ryogho Narita and Gen Urobuchi contributed to this project was making up the characters whilst leaving the story writing to a guy who’s written nothing but black holes since the 80s - andbefore you say anything, yes I’m aware Sho Aikawa adapted the original FMA series and Un-Go as well - you’re pretty much getting the series equivalent of a movie starring all your favorite actors under the direction of Seth McFarlane. And whilst I haven’t seen any of his post-Ted films, I’m pretty sure that jackass never screwed up this badly.\\n\\n\r\nMy point is, are fans of Nasu, Buchi, and Narita so blindly devoted to them that they’ll watch fucking anything that has their names attached even when it’s clear they’re not involved in any major way? Especially since even before this show aired, all three of them had their reputations tank only slightly less harder than Bill Cosby’s due to 2015 being an atrocious year for big anime names. No I’m not exaggerating here. Look at all the more well-known train wrecks that have come out so far and hang yourself on a rope with “you betrayed me” written on it when you realize that the same person who gave you the lovely Kyousogiga anime ended up churning out a shallow, badly written mess. Or that the dude who gave you that visual novel anime you all creamed your pants over has made a Jun Maeda anime that’s worse than anything Jun Maeda has ever written. And the less said about Jun Maeda himself, the better.\\n\\n\r\nYet none of them suffered as much as the names attached to Chaos Dragon - except for Naotaka Hayashi obviously - what with their shitty, badly overhyped Durarara!!x2/Unlimited Blade Works/Aldnoah Zero bullshit that didn’t so much fail to live up to the promises set by their concepts and initial episodes, so much as drove off a cliff and into an active volcano owned by a Commander Keen villain. And regardless of how little they were involved in the final result that is Chaos Dragon: The Anime, their influence sure isn’t going to increase with its existence. How bad is it? Well I’ve been trying to hold off talking about the show itself for three paragraphs and am continuing to do so now, because I’m honestly not sure what to say about other than it’s #$@%^*%&#%!&$-fucking bad. You know, the kind of bad that’s so incomprehensibly idiotic that any attempt to engage with it will just cause you to be dragged down to its level and beaten by its superior experience.\\n\\n\r\nThe plot is pretty simple to explain, but that’s actually its biggest problem. It’s so simple that Chaos Dragon tries to distract us from that fact by overcomplicating everything to the point that we have nothing to focus on, and when you do, you’re too embarrassed to spell it out for the audience. There’s this red dragon guarding this generic fantasy land who has gone mad, and the only one who can stop him is this royal boy who can used the dragon’s power at the cost of a beloved one’s life. He gathers a crew of RPG rejects and goes on a journey to hunt the dragon whilst trying hard not to use his power. And...that’s it. That’s literally all there is to the story with no attempt to spice it up whatsoever, unless you count the boy’s obsession with certain females that are so creepily handled I’d rather not dwell on them. Well, that’s not entirely true. Fucking up even the most basic things is kind of a spice in that it takes a specific kind of talent to do that.\\n\\n\r\nI know Silver Link animation is never good, but even by those standards, Chaos Dragon looks like ass. The character designs look like something you’d find in the trash bin of a fetish shop, the action is incoherent and poorly choreographed, and...well...the visuals look like ass. When your all-powerful red dragon is basically a CG monstrosity that would fit right in with a Passione anime or the miniseries adaptation of The Langoliers, you know something has gone wrong. When you have every other visual disaster share the same screen, I speak no hyperbole when I say that watching RWBY would be less taxing on the eyes. And it’s not like the writing helps, considering it’s as fucking standard a fantasy quest as you can get, except with most of the dialogue consisting of boring exposition dump after exposition dump to the point that I would have been better off listening to a drama CD just so that only my ears would suffer pain in the process.\\n\\n\r\nAnd take my advice, don’t even bother listening to the people who point out this show’s “good points” or even watch it out of curiosity sakes because I watched it for the latter and I can tell you that the former is a big fat lie. Chaos Dragon is not, and I can’t stress this enough, NOT the least bit memorable in its badness at all. Very little actually happens in the show proper, and whatever does happen is buried under what I can only describe as the anime version of a dull repetitive cover-based shooter. I know some people got enjoyment out of pretending that Urobuchi’s character likes to grab people’s boobs, but I wouldn’t even know which character he’d written if I didn’t look it up on Wikipedia. And any anime that requires outside knowledge you couldn’t possibly get from the show proper to understand seriously needs to go into the corner and think about what it’s done. Besides, I don’t watch Risky Business to see Tom Cruise trying to play a high school student (well, not just because of that anyways).\\n\\n\r\nSo in case you didn't understand all that, no I don't recommend Chaos Dragon at all. In fact, it's one of the few anime where I'd go so far as to say you're wrong for liking it, which is no mean feat given how little I care for what the fanbase thinks. It’d at least be better than that shitty Arslan adaptation if it wasn’t for its utter disinterest in trying to entertain people, which makes me wonder, why was anyone even interested in making a public spectacle out of the D&D games that certain industry people do in their spare time anyways? How exactly is that sort of thing appealing to anyone not within the circle? Might as well introduce the Yu-Gi-Oh card game to the homeless whilst you're at it. Chances are one of them has an interest in foreign card games that he can use to win big and get out of his sorry state.",
            "date": "2015-11-04T14:28:00+00:00",
            "helpful_count": 15,
            "mal_id": 202668,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1147547.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Flawfinder",
                "username": "Flawfinder"
            },
            "url": "https://myanimelist.net/reviews.php?id=202668"
        },
        {
            "content": "Despite all the big-name people working on this show, Chaos Dragon was laughably bad and quite possibly the worst show this season.\r\nStory: 4/10\r\nThe country of Nil Kamui was a country, until they got invaded and their allies didn't help. Additionally, their guardian, Red Dragon, didn't help. This is the backstory that gets repeated at the start of every episode, and man, what a lame setup it is. It's very basic stuff for a high fantasy anime, and there's very little worldbuilding. It also doesn't help that the opening potentially spoils who's gonna be dead by the end of the show.\r\nArt: 4/10\r\nGeneric at best, atrocious atworst. The characters don't look terrible, just not unique in any way. One of the lady knights is literally Saber. The titular Chaos Dragon (and all the other large monsters) is rendered entirely in low-frame jarringly awful 3DCG that suggests that the budget for this show maaaaay have been set a bit too low.\\n\\n\r\nSound: 6/10\\n\r\nThe OP and ED are as edgy as a middle schooler who just discovered nu metal, but they don't sound that bad. There are very few background music tracks, and they keep getting played over and over. Despite that, they're still incredibly forgettable.\\n\\n\r\nCharacter: 2/10\\n\r\nWith guys like Gen Urobuchi and Ryohgo Narita designing your characters, what the hell happened, Chaos Dragon? All of the characters display this ridiculous amount of heroism, with characters literally throwing themselves at our main character to be sacrificed. Speaking of our main character, Ibuki has no personality. Most of his lines are just repeating names spoken to him with ellipsis and a question mark at the end. Speaking of edgy, Gen Urobuchi's character may as well have been named Linkin Park.\\n\r\nI guess this is what happens when you get a whole bunch of high-profile directors and designers to create characters, but you don't make any effort to tie the characters together. Despite being on a combined expedition, they're all lone wolves with differing, confusing motives.\\n\\n\r\nEnjoyment: 6/10\\n\r\nThis is a stupid show. I can say that without any regrets. In that sense, sometimes it's funny to watch just how dumb it can get, with the self-destructive heroism and how hard the show tries to be serious. The Funimation translation is pretty odd and doesn't read very easily. Sadly, there's few other options. You can either stick with the pretty bad simulcast translation, use the DameDesuYo translation which actually reads coherently but at this rate will be finished in 2018, or try your luck with the group I detailed in my Vampire Holmes review.\\n\\n\r\nOverall: 4/10\\n\r\nWhat more is there to say? With such famous people designing the characters, you'd think this show would have higher overall quality. Sadly, that's not the case, and nearly every aspect of Chaos Dragon is shoddy and poor quality.",
            "date": "2015-09-20T10:21:00+00:00",
            "helpful_count": 10,
            "mal_id": 199046,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2976321.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/somaisbatman",
                "username": "somaisbatman"
            },
            "url": "https://myanimelist.net/reviews.php?id=199046"
        },
        {
            "content": "Chaos Dragon redefines the word \"underrated\". If you don't know what I'm talking about, try pondering on it. \r\nDEEN makes a bad adaptation of Fate/Stay Night and no one bats an eye... Silver Link. and Connect make one of the best mobile game adaptation and everyone loses their minds.\r\nWhat sets me off about people is that they constantly complain about this show only because they compare it to some other anime and blame it for not exceeding their expectations only because \" ITZ GEN UROBUCHEE AND KINOKO NASU LULZ LULZ\".\r\nIs this a Fate/Stay Night anime? Does it have any similarities to be likened to it?Just because it has the same authors and the animations looks very close to Ufotable, doesn't just mean this show must be always rated so lowly because of it.\\n\\n\r\nBut let's go on with my opinion:\\n\\n\r\nStory: 7\\n\r\nFirst off, I must say the plot is very simple, it doesn't require a high IQ, and it isn't meaningless unlike some people pointed out, it has plenty of unexpected plot twists, at times meaningless deaths, but nothing special, this indeed isn't the strongest point, but don't be discouraged.\\n\\n\r\nCharacter: 10 \\n\r\nI've witnessed many complaints about how people seem to dislike the characters, particularly the main character. The main character isn't your typical cliched hero, he's just a regular child, and he has to deal with sacrificing his friends and family, his reactions are very natural, what would you do if your most precious people died by your own hands? Ibuki is very emotional, and through his losses he grows up, along with the other characters. Though some characters aren't developed enough since the show ended too soon, the cast is counts many very unique characters because multiple authors worked on it, particularly Kinoko Nasu (the author of Fate/Stay Night, Tsukihime and other Type-Moon works), Gen Urobuchi (Fate/Zero, Madoka Magica), and the director of Durarara and Baccano.\\n\\n\r\nArt: 10 \\n\r\nThe animation is literally flawless, the opening is perfect, and I might even say it's the best animation I have ever seen, next to Ufotable, it is safe to assume they did put their utmost efforts in the animation.\\n\\n\r\nSound: 8\\n\r\nI don't recall any soundtrack that caught my attention, however I love the opening song which I just couldn't skip, as I enjoyed the ending too, I thought those were more than enough to pump me up.\\n\\n\r\nEnjoyment: 9\\n\r\nDue to the very unique cast of characters, this show kept me entertained from the beginning to the end, unlike other reviewers say, I didn't find it boring, but with the ending, which left some space, I was rather starving for a second season, I believe this show truly deserves it.\\n\\n\r\nOverall: 9\\n\r\nWhen you watch this show, remember that it was adapted from a mobile game, I hope you know how hard that can be, most of the video games adaptions are often hideous and unwatchable. However Chaos Dragon is the best game adaptation I have ever watched. The fanservice isn't annoying or noticeable at all, there's action, beautiful animation and character development, what more are you asking for? This show is a rare gem that needs more attention, I definitely wish it lasted longer, or it had a second season, in that case I wouldn't hesitate to call it a masterpiece. \\n\\n\r\nPut it simply, if you like action and want to try something different with an actual character development and amazing animation work, you'll love this show.﻿",
            "date": "2016-04-14T13:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 216381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5209496.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Quadrillion",
                "username": "Quadrillion"
            },
            "url": "https://myanimelist.net/reviews.php?id=216381"
        },
        {
            "content": "\"The name of our country is Nil Kamui.  One day, a sudden invasion by the country Kouran invaded the small island country and plundered a third of the land.  Our allies, the country of D'natia defended their settlements where they kept their bases and kept silent.  The two great countries eventually carved away the land like meat of a sacrificial swine.  The guardian of the country, the Red Dragon, attacked its people.  Imperial Era 3015, September, our country was no longer ours...\"  No joke, this is said at the start of EVERY episode for Chaos Dragon.  (Now thatthe tedious monologue is over, onto our main program.)\\n\\n\r\nStory: Chaos Dragon, as I will be calling this series in this review, follows the story of a boy named Ibuki in the land of Nil Kamui.  As explained by the tedious introduction, the country he lives in is a small island country where the place is not only under control of other countries, but also under threat of the country's own guardian.  As the last remaining noble of Nil Kamui's royal line, he is thrown into a situation that forces him to rise out of his hiding and take back the country that has been oppressed by various sources for so long.  There, he gains the power of the country's guardian, granting him the ability to take life in exchange for that of another, a curse that he must try and get rid of by the help of a combined expedition from all three countries to find the country's rampant guardian.  \\n\\n\r\nNow, what is clear about Chaos Dragon from the first two passages of this review alone is the fact that this series is very lengthy in its setup.  The story of Chaos Dragon, in simple terms, follows Ibuki's story as he tries to find the Red Dragon with a host of other characters.  The reason why I note specifically in simple terms is because Chaos Dragon is a series that harbors a serious case of trying to cram in so much content in so little time.  With each episode that passes by more and more characters get involved in the series through various means.  Sometimes they're enemies, sometimes they're allies, others are completely irrelevant, so on and so forth.  Not only are characters an issue for this show, but the plot follows more of a random weave than a straight line, as it gets pulled in all directions from backstories, to what's happening now, dreamworld stuff, etc.  As a result, the entire story is an utter mess because it doesn't do much but confuse the audience sometimes because the overall plot just simply jumps from one thing to another without properly explaining what exactly is going on.  \\n\\n\r\nThe lack of explanation comes from a duality of sources: the show's concepts, and the motivations of each character.  \\n\\n\r\nChaos Dragon harbors a number of basic concepts within the world of its fantasy.  Like all fantasy stories, the concepts (such as how their magic works and stuff like that) have to be properly explained in order for the audience to fully immerse themselves in the story and understand what precisely is happening.  Chaos Dragon doesn't do that.  Instead, it half-asses everything by at most, mentioning what exactly a thing is.  (For example, the female protagonist of this series is known as a \"Bounded One\", they don't explain what a bounded one is at all beyond maybe three sentences of information.)  And because this show utilizes so many different concepts, the entire show falls flat because nothing is ever properly explained and you sort of have to guess what each new thing is or does.  (I mean, seriously.  Holy Spirits, Dragon Contract, Bounded ones, Returned ones, Cursed sword, Mixed One, whatever the hell Ka Grava is.  I don't want to have to google everything to get some semblance of an explanation.)\\n\\n\r\nAs for character motivations, Chaos Dragon has a lot of varied characters each with a different goal in mind.  Now, normally this would be a good thing as every character would be varied and there could always be a good twist here or there, but this show doesn't really pull it off well.  Because there are a lot of characters, there is a new motivation for every character that enters the show, leading to a lot of rather generic or incomplete reasons for really doing what they're doing.  Some of them bounce back and forth with their current motive to the extent that I could care less what they did with themselves.  It's to the point that a lot of them feel very stupid because we don't know the character well and the idea of even caring about whether a character dies or not is something that requires at the very least knowing who is dying.  \\n\\n\r\nAll in all, Chaos Dragon is a complete and utter mess with its plot.  At first I had high hopes for the show because it involved sacrifice and a somewhat intriguing plotline, but it tangled itself even further the more it progressed in the series.  The ending itself is also rather average as there's nothing that I really felt was satisfactory at the end.  It just sort of winded itself down to a stop.  It wasn't a bad ending per say, but it didn't really make all that much of an impact for an ending.  Especially since there were actually some questions that had yet to be answered.  \\n\\n\r\nOverview:\\n\r\n+ Half-Decent story idea.  (I admit though, it was intriguing enough for me to look into this series.)\\n\r\n+/-  Average ending\\n\r\n-  Horrible Pacing\\n\r\n-  Far to many story concepts and unexplained ideas\\n\r\n-  Character motivations were all over the place and never really concise. \\n\\n\r\nCharacters: As mentioned before, Chaos Dragon has an absurdly large cast for a 12 episode anime.  As a result, all but maybe two or three characters actually get any sort of half-decent motivation that adds to their characters.  (It's Angel Beats Syndrome!)\\n\\n\r\nLet's start with the main character of this series, Ibuki.  As the last royal of Nil Kamui's line, Ibuki is a boy that has decided to stay away from the ongoing conflict and not become the king of Nil Kamui because he wishes not to see the people he knows perish around him since his parents died in a fire.  Later though, he is cursed with the Red Dragon's power and is given the ability to kill one person in exchange for someone precious to him.  Because he has to kill his friends in order to kill his enemies, he shuns himself for using this power and agrees to go on a combined expedition with several other members of the cast in order to get rid of his curse.  (Once again, very lengthy.  My god.)  Ibuki as a character is similar to a story of growing up, as he has to learn about loss and sacrifices seeing as that is what he has to deal with now that he has this cursed power.  He treasures his friends and the people he knows very much and wishes not to put anyone in danger because he is afraid of their loss.  The issue with this is the fact that the series doesn't solely focus or really develop this.  Even as the main struggle of the series, the show in addition, focuses on other character issues to the point of even putting Ibuki's own character to shame.  As time goes on, he sort of fades into the background amidst the other characters, and that's rather poor design.  \\n\\n\r\nThen we have Eiha, a bounded one that looks like a little girl that resembles a fox.  (For the record, bounded ones are children that are attached to a creature from a very young age, and stay attached to that creature through some means.  They apparently have very short lifespans too.)  As Ibuki's closest companion in the expedition, Eiha is a very faithful character, willing to give up her own life for Ibuki and treats herself as a tool or his sword.  While she is my personal favorite among the entire cast of the series, her character doesn't really develop past those thoughts of hers.   As a result, her entire character doesn't really change all that much and she, like Ibuki sort of starts to lose importance in the series as time goes on, which is a shame too, because they are pretty much the only native people of Nil Kamui that we are really shown in this series.  \\n\\n\r\nBehind these two is an expansive cast of characters from the expedition members Sweallow, Lou, a robot...thing named Ka Grava, and Sweallow's maid Meryl, to members of Kouran's army, members of D'natia's army, the Dragon guardians, the rebel army, Ka Grava's servants, etc.  The thing that really makes this show so poor in quality is the fact that at least 90% of them is a character in this series that the show forces you to try and know and or care about.  They try to put enough detail for you to care about why they're there to the point that you really don't care why they're there.  As a result, any character that dies within this series really has no impact of the show as a whole because they're so obsolete sometimes that it's like stabbing a cardboard cutout.  No one cares if you stab a cardboard cutout.  While some like Sweallow and Lou have motivation and development that sort of makes sense, pretty much no one else does, and the show focuses on those two specifically for a time, for some reason.\\n\\n\r\nOverview:\\n\r\n+ Some character development\\n\r\n-  Highly underdeveloped characters\\n\r\n-  Too large of a side cast\\n\r\n-  Unsuccessful attempt at putting importance on the entire side cast\\n\r\n-  Main characters fell into the background  (That is not what a main character should do.)\\n\r\n-  Unmeaningful deaths.  \\n\\n\r\nArt: The art for Chaos Dragon is a rather bright style of animation.  It's bold in the sense that every character is distinguished in their perspective color palettes, but the color scheme itself really isn't all that much to look at.  Character designs on the other hand I admit were rather nice.  Some character had some pretty nice designs and I appreciated the different, distinct look for every character in the series.  (One of the few good reasons for the large cast.)\\n\\n\r\nBut, there is still one thing about the art that irks me.  While is was sub par at best, the air truly \"shined\" whenever it showcased any of the dragon guardians in the series.  The dragons themselves are a hideous conglomerate of CGI and the everything looks so out of place in any given scene they're in.  They're extremely glaring and they leave a bad taste in my mouth due to the inconsistency and just how awful they look.  \\n\\n\r\nOverview:\\n\r\n+ Original and Distinct character designs\\n\r\n-  Horrifying CGI Dragons.  (Not the CGI dragons!  I thought we were done with those!)\\n\\n\r\nSound:  As for the soundtrack, Chaos Dragon oddly enough has an opening that I personally like as a song.  Reflecting on the show's marketed themes of loss and flaws in one's life, the OP gives off a melancholic and somewhat thrilling battle opening that resonates a lot with what the show was trying to do.  I was honestly quite happy with the song, and it's a track that I find memorable oddly enough and one that I would listen to over and over again.\\n\\n\r\nThe ED on the other hand focuses sort of on Eiha with a similarly melancholic sound, but with a much mellower tone.  Personally, I didn't find this ED as memorable if not slightly generic.  It wasn't bad enough for me to discredit it completely, but it isn't a song that I would find memorable.  \\n\\n\r\nOverview:\\n\r\n+ IMO, a good and memorable OP\\n\r\n-  Somewhat generic ED\\n\\n\r\nPersonal Enjoyment: What really caught my attention about Chaos Dragon was the fact that not only did it feature a sort of old-style war plot that I personally have grown fond of as of late, but it was also a little fiction game made by Gen Urobuchi and several other members of the Stripe Pattern Doujin Circle.  So I thought, hey, since the guy who made the ever popular fate series is part of this, why not give it a shot?  (Whether or not he was part of the anime's development, I don't really know.)  So, what are my thoughts?\\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nNot particularly.  The biggest thing I hate about any anime is when they don't explain everything.  Leaving so many plot holes in the series to the point it's like swiss cheese is one of my biggest pet peeves.  In my opinion, it leads to a lot problems down the road for a series and really doesn't create a quality story.  Chaos Dragon delivered my cartload of swiss cheese by creating too many things without giving enough attention to each of them.  As a result, the story and the characters suffered greatly, which led to a whole host of confusion and created a lot of resentment I have towards the series.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nApart from the massive plot holes, I didn't particularly enjoy any of the deaths in the series.  Not because my favorite characters died, but because the deaths really don't matter in the series.  They exist because they attempted to pull off these themes of loss within the show, but failed because the lack of attention for any given character created a meaningless death.  I could hardly care whether that girl died, or when that guy died, or what have you.  They don't really do much because there's no emotional backing from the audience for the character that died.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nPersonally, I wouldn't recommend it.  The show is a complete mess many aspects of itself to the extent that it was, to me, frustrating to watch.  Because it went all over the place, there wasn't really many threads to connect from one scene to another and everything felt very poorly planned.  It really was a disappointment, cause I did look forward to it at the start of the season.  I guess that's what you get when you have a Gen Urobuchi work that isn't part of the Nasuverse.",
            "date": "2015-09-18T16:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 198840,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=198840"
        },
        {
            "content": "Okay, okay...\r\nI'll just start by saying that this one is for 8-10 years old kids. Or around that age. or people that is early or new to movies/stories.\r\nNow that that's said, It would be justifiable to state that this is going to be the most annoying, frustrating series i would have to endure if I was forced to finish the series.\r\nIt may bring justice if the viewers that is targeted, clearly, by the anime is doing the review, but sadly, am not one of those.\r\nThe story starts in a world so different from earth, where flying beasts breath fire, rocks, air(?), water, or any elementyou could think of. and swords sprouts shits(not a pretty picture, but it is meant figuratively, so ease up)\\n\r\nSo this is a world with a lot of power, and magic and stuff going on.\\n\r\nAnd it is on the first episode, no subtlety to it.\\n\r\nDragons are introduced by the way.\\n\r\nSo you should get the picture by now.\\n\r\nThis kind is that kind.\\n\r\nAnd it's kind can only get away with there is something new, or interesting in the mix to be an entertaining one, but I found out they have nothing to serve.\\n\r\nNot only was the world overrated, the stories, and characters are overrated.\\n\r\nLet me say again, I assumed this is for the kids that is new or have never seen or little have they known any kind of stories\\n\r\nCause this is so overrated\\n\r\nThe main character, the hero if you will, is a 5 year old toddler.\\n\r\nYeah, I may be exaggerating a bit but from what I gather, his appearance is really that of a baby.\\n\r\nAnd yes, he is destined to something, to save or lead perhaps, you decide what destiny he has.\\n\r\nDoes he have any unique quality that would make him likeable.\\n\r\nNope not at all.\\n\r\nHe goes with the flow, he's passive, and is content, and is being forced to do something he does not want to.\\n\r\nPut with a very bad tragedy in there,\\n\r\nthen he really is a weak kid (sigh, still can't get over that the 5year old toddler is responsible to millions/billions of lives in this story)\\n\r\nOne of the rule I learned in making an interesting story is that the mc must not be reacting, but acting. It means that he must not go with the flow forced by villains or other characters but instead, do what he wanted, his motivation, from the start, and not be a sissy that would say yes to any strangers that pass by.\\n\\n\r\nThere will be betrayal from trusted allies, death and screams of hardships. this would be well and done if its not thrown at us on the first chance they got. No time for liking the characters, no chance for adapting the scenarios well, instead, this dude, and girl thrown at this awful scene.\\n\\n\r\nAlright to be clear of what I meant in this, take the avatar, the legend of aang. the characters in that one is well developed, well defined, and if one of them die during the course, It'd get me, but if they'd encounter a horrible scene, and one of them do die, how would you differentiate the impact? lesser right?\\n\\n\r\nThat is my case in this series, one of it any way. so many wrong and little right,\\n\\n\r\nBtw, the sounds are great, boom and bam, (hehe, highly intelligible words) but there is nothing new to that\\n\\n\r\nAnyway, if you are new to stories, fantasy, or perhaps a kid between 1-3 (heh) years old then this is for you. \\n",
            "date": "2015-10-21T17:01:00+00:00",
            "helpful_count": 9,
            "mal_id": 201707,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743422.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/animeBee1ver",
                "username": "animeBee1ver"
            },
            "url": "https://myanimelist.net/reviews.php?id=201707"
        },
        {
            "content": "I usually don't write reviews on anime but seeing how low the rating for this anime was, I had to write a review. When I watch an anime I tend to watch animes with a rating of 7 or higher, but looking at Chaos Dragon with a rating of 6, it had me put it off for a while until now(finished it in 2 days). \r\nAlso, I'm not a picky watcher so I tend to like most animes even if the anime got a low score.\r\n**I might have a little/small spoilers, hopefully I won't**\r\nThe anime in my perspective was a decent anime. The story wasn'tthat bad as many people say it is and I found it pretty enjoyable. \\n\\n\r\nStory 6/10\\n\r\nThe story is pretty straight forward and it keeps on. There are some plot holes but its nothing like WTF? All the eps follows the plot pretty well, but maybe a few small fillers in the eps here and there. \\n\\n\r\nArt 6/10\\n\r\nMany people complain about how the art is terrible, but it seems fine. Just like a regular anime. Nothing terrible that will turn you away from watching this series. However, there are parts that will look a bit bad/terrible but they only last for 5-10 seconds at most. The rest of the anime is pretty decent. \\n\\n\r\nSound 6/10\\n\r\nThe sound is pretty good here. Nothing outstanding in my opinion.\\n\\n\r\nCharacter 5/10\\n\r\nCharacter wise... It was ok/decent. MC is a bit of a wimp til the end and there are some annoying characters here and there as the story progressives. \\n\\n\r\nEnjoyment 7/10\\n\r\nIn the end, I did find this series pretty enjoyable. The story wasn't bad and it was fun to watch\\n\\n\r\nOverall 7/10\\n\\n\r\nNot a bad anime as most people would say it is. However, this is coming from someone who isn't picky about their anime and doesn't get mad about the story/character and all the minor stuff.... \\n\\n\\n",
            "date": "2015-09-22T21:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 199282,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2071947.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/loveyuri",
                "username": "loveyuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=199282"
        },
        {
            "content": "At first, I was incredibly excited for this anime because the plot sounded so amazing and had a lot of potential. However, my enthusiasm died rather quickly as I ventured deeper into the anime. \r\nFirst of all, the main character is mainly useless, other than being granted the power of the Red Dragon and whining every now and then, and he can't do anything except sacrifice others at the extent of his own sanity to unleash his powers. Other than this, he is completely useless. I don't even know why he became the main character when even the side characters held more power and potentialcompared to him.\\n\\n\r\nThe first few episodes were bearable, but as they fought more battles, I began to see the incompetence within him. The others all wield power and are powerful as they should be, but the protagonist was disappointing. Sure, the power of the Red Dragon is impressive and all, but that's literally all he can do. This brought a distasteful feeling towards the anime even though the battles seemed full of hype and excitement.\\n\\n\r\nI was really disappointed with this anime and could not even bring myself to finish it. I stopped at episode 10 and didn't bother to continue it. I'm surprised I even made it this far, actually. In addition to the main character being incompetent, he also made rather foolish decisions that anyone would cringe over. I really could not believe he had such thoughts and delusions and decided to drop the anime. I doubt I will be continuing it anytime soon.\\n\\n\r\nThe openings and closings for this anime are very good. That was the only thing I looked forward to,",
            "date": "2015-10-09T07:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 200824,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4924886.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/yumekix",
                "username": "yumekix"
            },
            "url": "https://myanimelist.net/reviews.php?id=200824"
        },
        {
            "content": "Story: the story was generally confusing. Like who was doing what, where was everyone. The story seemed to be a victim of overthinking-syndrome.\r\nThe art would have been alright if it weren't for the CGI dragons. It was jarring and took from the enjoyment. This contracts to Madoka Magica, where the differences in the styles actually complimented each other.\r\nThe sound - well, the OP was the most redeeming part of the anime. That and the art for it.\r\nCharacter - I actually preferred Lou and some of the other background characters because most of the other mains had flat personalities.\r\nI ended up watching the entire thing purelyout of curiosity. It wasn't the worst, honestly.",
            "date": "2015-10-28T10:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 202156,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2406947.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/CrimsonBlazee",
                "username": "CrimsonBlazee"
            },
            "url": "https://myanimelist.net/reviews.php?id=202156"
        },
        {
            "content": "I honestly can't see why this anime garnered so much hate.  It's actually pretty engaging and I found the characters to be pretty interesting I like how it feels like a wuxia novel with the story centering on One big journey. Ibuki has a power that really not common at all : he's been cursed by a powerful red dragon and must kill his friends in order to gain great power.  It would of been best if he only had to use it once or twice since it can get depressing to see deaths that could of been avoided\\n\r\n   The music is a fun listen and compliments the action scenes quite well. My biggest complain with this anime is how one of the members of the group is a serial killer and they never find out about it. It annoying to see her continuously kill people and get away with it. Also, this show really could of used a season 2 . It had so much potential but bombed due to immense hate.",
            "date": "2017-02-09T13:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 240240,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4374209.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lazyking88",
                "username": "lazyking88"
            },
            "url": "https://myanimelist.net/reviews.php?id=240240"
        },
        {
            "content": "Guessing from reading other people's reviews and opinions on this anime, some must be thinking. 'Really? A seven? It was so bad.' Well, this is an unpopular opinion review. I think that this anime is okay. Then again, as long as the quality, not consisting of 200+ episodes and the plot are okay, I'll take it.\r\nStory (7/10):\r\nThe story is pretty basic, a young king receives a power from a dragon, blah blah blah. To me just because it is a basic idea doesn't mean it isn't a good story, it's just not as unique as most stories. \r\nNo one pooped on Kaichou we Maid-sama foralmost having the exact story as Special A, actually Kaichou wa Maid-sama has a higher rating than Special A. I got a little off topic. Anyways, if you're saying that this story is really basic and 'not interesting'. You better have given Kaichou wa Maid-sama a bad rating too. I'm just kidding, both SA and Maid-sama were good and Choas Dragon is okay too. That is the point I'm trying to explain.\\n\\n\r\nArt (9/10) \\n\r\nArt 2015: (7/10):\\n\r\nI gave the art 2 scores. The first one is the rating for my opinion on art and the other is my opinion because it came out on 2015, the quality of the art and style should be really good by now.\\n\r\nMy own personal rating is high because I have been re watching Prince Of Tennis, CardFight! Vanguard season 1 and Hunter x Hunter. They don't have as good style or art quality as Chaos Dragon.\\n\r\nThe 2015 is a 7 because the art is a little framey. Framey isn't a word, but the meaning is that you can see the different frames and the difference between frames. It isn't as smooth as I expected from a 2015 anime. Some parts run smoothly, but some don't, the quality is inconsistent.\\n\\n\r\nSound (7/10):\\n\r\nThey used the same song for the opening and ending... Why? Opening and ending should be different, I thought that the episode just started when it was ending. They aren't helping someone with terrible memory and terrible sense of time. I cried ever single time I was trolled my the opening and endings.\\n\r\nThe rest of the music is decent, nothing that really stood out to me. Don't starts saying that since the music wasn't memorable means that sound is bad. It isn't good or bad, it is decent, like 70% in your report card.\\n\\n\r\nCharacters (7/10):\\n\r\nThe only thing that bothered me about the characters is that Ibuki looks like a girl. I skim through the subtitles since I don't read fast and blurt out he, she and the.  I missed that Ibuki is actually a boy. I know Ibuki was a boy name, but he looks so much like a girl even his eyes are the style of an anime girl's eye. Also the fact that he kind of dresses like a girl.\\n\r\nThe characters that brought the score up are Swallow and Eiha. Swallow and Eiha are the cool characters of this anime and the ending made me so mad. (I'm trying not to add spoilers).\\n\\n\r\nFinal Comment: Chaos Dragon wasn't that bad and not really good. It got a 70% out of me and I usually give anime a fair score ignoring all the expectations, popularity and the bad comments that everyone makes. This anime has potential to have a second season because there was a cliff hanger in the end of it. I wouldn't mind watching a second season, if all the main characters and plot aren't thrown out the window.",
            "date": "2015-09-20T11:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 199060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4477882.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/StigmaStarzzs",
                "username": "StigmaStarzzs"
            },
            "url": "https://myanimelist.net/reviews.php?id=199060"
        },
        {
            "content": "Chaos Dragon was SOOOO Frikin' bad that I just had to drop it half-way through. The plot is incredibly bad and generic, the artsytle is way too linear and every episode was just a little more of the exact same thing over and over again. I swear I almost fell asleep in the second episode. The characters suck ass, they don't even make sense and the animation, oh my god the animation is super basic with some shitty 3D models arround. I swear when I saw this thing's trailer i just couldn't help but save it in my \"to watch\" list but GEEZ when itcame out it was SO disappointing! But well... I guess that this shit right here is all you can expect from an anime based on a deck game... If you're reading this, don't even waste your time trying it out. It has a pretty cool opening tho",
            "date": "2015-12-17T11:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 205798,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205798"
        },
        {
            "content": "High expectations and a huge disappointment...\r\nStory: 3\r\nBy the end of the series I think I finally got the story, which is in fact not a good one. This Red Dragon destroyed Nil Kamui, a small country which is now invaded by Kouran and D'natia, the neighbour countries. Ibuki, the MC, holds Red Dragon's power: every time he kills one of his friends, he gains great power. Now, you see, this idea is pretty shitty because:\r\n1. It creates pointless drama\r\n2. It predicts the death of the other characters\r\n3. At some point, it becomes annoying because you see the same thing happening over and over again.\r\nBack tothe story. Ibuki then gathers a bunch of random people, whom he later calls \"friends\" to help him become king and win the independence of the country. Not original at all. As this is a spoiler-free review, I'll tell you only this. Things get really complicated.\\n\\n\r\nArt & Sound: 6\\n\r\nSpeaking more about the art, the fight scenes are bad. It's like, you don't get a lot of continuous movement, just short scenes one after another. Also, the background and the characters are common. Nothing special, no distinctive features.\\n\\n\r\nCharacter: 2\\n\r\nI don't even know where to begin. It's like all the characters are bricks in the wall. They are all ready and willing to sacrifice their lives for Ibuki. BUT they don't even know, if he is going to succeed in becoming the king. They all say \"Ibuki, kill me\" like what the hell, I'll give you this life, I can have another one right away. I get it. This anime is also a drama, but it's stupid to see this \"Take my life, please!\" \"No, you're my friend\" every god damned episode.\\n\\n\r\nNow I'll focus more on Ibuki. He's a 10 years old kid who still sees the world coloured in pink. Naive. Easily deceived. He says he wants to protect everyone, but ends up killing his friends. Again, I get it. He's plays the role of the victim. He bears a curse, he lost his family etc. BUT the fact that there was no character development is just stupid. He had the potential to become a good character but failed. \\n\\n\r\nHowever, the only character that I like is Swallow. He's different. I think there's an episode or half an episode about his past which is really good. He had a tough childhood which gave him the strenght to move on and try to live his life the best way possible. Bonus points for this one.\\n\\n\r\nEnjoyment: 5\\n\r\nNow I've seen that many people compare this to Akame ga kill. No. It's true that almost all the characters die by the end of the anime, but at least the characters from Akame ga kill had meaningfull deaths. Those deathes gave me a sad feeling. They died fighting for a major cause, they didn't offer their lives to a 10 years old boy they had just met. This \"kill your friends to save th e world\" concept is just stupid. Moreover, the ending is so open, so.... should we expect season 2? Please, no.\\n\\n\r\nAnother thing: the action is pretty rushed, characters show up and die so this anime gives no feelings to the audience.\\n\\n\r\nOverall: 5\\n\r\nI know I said only bad things, but this anime is mediocre. Some of you might enjoy it more than I did and give it a 6. It's not horrible, it's just there are far better anime so don't waste your time on this one.",
            "date": "2015-09-20T10:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 199045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3512445.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rawrzz03",
                "username": "Rawrzz03"
            },
            "url": "https://myanimelist.net/reviews.php?id=199045"
        },
        {
            "content": "I don’t think anybody really thought for even a second that Chaos Dragon was actually going to be good when they saw the team attached to the project. The plot is pretty simple to explain, but that’s actually its biggest problem. It’s so simple that Chaos Dragon tries to distract us from that fact by over complicating everything to the point that we have nothing to focus on, and when you do, you’re too embarrassed to spell it out for the audience. There’s this red dragon guarding this generic fantasy land who has gone mad, and the only one who can stop him is thisroyal boy who can use the dragon’s power at the cost of a beloved one’s life. He gathers a crew of RPG rejects and goes on a journey to hunt the dragon whilst trying not to use his power. And…that’s it. That’s literally all there is to the story with no attempt to spice it up whatsoever, unless you count the boy’s obsession with certain females that are so creepily handled I’d rather not dwell on them. Well, that’s not entirely true. Fucking up even the most basic things is kind of a spice in that it takes a specific kind of talent to do that. I know Silver Link animation is never good, but even by those standards, Chaos Dragon looks like ass. The character designs look like something you’d find in the trash bin of a fetish shop, the action is incoherent and poorly choreographed, and…well…the visuals look like ass. When your all-powerful red dragon is basically a CG monstrosity that would fit right in with a Passione anime or the miniseries adaptation of The Langoliers, you know something has gone wrong. When you have every other visual disaster share the same screen, I speak no hyperbole when I say that watching RWBY would be less taxing on the eyes. And it’s not like the writing helps, considering it’s as fucking standard a fantasy quest as you can get, except with most of the dialogue consisting of boring exposition dump after exposition dump. Chaos Dragon is not, and I can’t stress this enough, NOT the least bit memorable in its badness at all. Very little actually happens in the show, and whatever does happen is buried under so much bullshit. I know some people got enjoyment out of pretending that Urobuchi’s character likes to grab people’s boobs, but I wouldn’t even know which character he’d written if I didn’t look it up on Wikipedia. And any anime that requires outside knowledge you couldn’t possibly get from the show proper to understand seriously needs to go into the corner and think about what it’s done. So in case you didn’t understand all that, no I don’t recommend Chaos Dragon at all. In fact, it’s one of the few anime where I’d go so far as to say you’re wrong for liking it, which is no mean feat given how little I care for what the fanbase thinks. It’d at least be better than that shitty Arslan adaptation if it wasn’t for its utter disinterest in trying to entertain people, which makes me wonder, why was anyone even interested in making a public spectacle out of the D&D games that certain industry people do in their spare time anyways? How exactly is that sort of thing appealing to anyone not within the circle? Might as well introduce the Yu-Gi-Oh card game to the homeless while you’re at it. Chances are one of them has an interest in foreign card games that he can use to win big and get out of his sorry state.",
            "date": "2017-05-02T14:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 246843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6113787.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TheFlashmaster",
                "username": "TheFlashmaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=246843"
        },
        {
            "content": "So I got really pumped looking at who was involved in making this piece.... and then got disappointment.\r\nAt the beginning, I thought, \"oh wow this is a new idea\" and I was in for a trip that would make my heart break apart at the seems. I was wrong since the story that followed it was nothing like the opening episodes of the anime. The story was bland and rushed, there was all the character development happened in the last episode of the series... the only good thing about it was the art.\r\nThe anime itself would have been a bit more enjoyable if there hadbeen more episodes? To spread out the story a bit and give the characters some time to make themselves less minor. They introduced a lot of characters but didn't really expand on them, even the more major characters. Some of the major characters, like Lou, they ignored completely and made them into a sort of flat character even though her original personality is somewhat appealing.\\n\\n\r\nIf you want something pretty to look at, then this anime is definitely up there with character designing and choice of colors. As for a story, it doesn't amount to much.",
            "date": "2015-12-10T00:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 205162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1887552.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Minster122",
                "username": "Minster122"
            },
            "url": "https://myanimelist.net/reviews.php?id=205162"
        },
        {
            "content": "okay, SO. Not the best anime's ive ever watched.\r\nWe start out completely thrown into a battle, and the main dude \"Ibuki\" the one who is supposed to be crowned king after his family's death must kill the ones close to him to protect the rest. LOL WHAT?? that is a terrible pretense, what a life of sadness and loneliness.\r\nNext, we begin to meet all these new characters that are in search for the red dragon, who went \"mad\" and I dont even feel like it was that long of a time they were all together (perfect strangers at first) and yet they talk about allthese \"bonds\" and stuff. LOL WHAT??? \\n\\n\r\nIbuki, in the very beginning to save the ones he cared about had to kill Mashiro, who was apparently the closest person to him.. and then the next thign you know, these \"new\" Friends are suddenly also equivalent for sacrifice. LOL WHAT???? \\n\\n\r\nLiterally, all i can say is LOL WHAT??? simply because I was lost, the story line had no structure, there were dragons, magic, seals, idk what else, ZOMBIES, WEIRD MONSTERS. yeah. idk. I just dont.",
            "date": "2017-08-24T16:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 256191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=256191"
        }
    ],
    [
        {
            "content": "I'm sorry Chaos Dragon, but you just didn't manage to attract me.\r\nFirst off, the animation. It would be really good, if it weren't for the CG. It's overdone, and useless. The Bollock lord of Sheet mountain.\r\n(On the other hand I'd be a really nice person, if it weren't for my personality)\r\nStory: CD has a lot of focuses, which some people might think of as it is diverse and combines \"good\" elements of each genre, but how i see it is that it doesn't have a bloody focus, and without a focus, it gets really boring really fast! Doesn't have consistent comedy, story, characters or actually,just about anything.\\n\r\nGets boring quickly, I don't know how i went through 12 episodes of something that equals chinese water torture. \\n\\n\r\nCharacters are boring and inconsistent. Generic as well, trying to picture a wimp as an occasional badass. Doesn't work like that anymore.\\n\\n\\n\r\nSound is alright, it doesn't stand out in either way. There could be some improvements, but that's just personal opinion. I'm trying to have a general opinion on this.\\n\\n\r\nEnjoyment and overall should be read from the above. Didn't enjoy it. It's bad.\\n\r\nExplosively apocalyptically bad. There's anime that you should watch just because they're bad, and the animes you avoid like the plague. This one is the latter.",
            "date": "2015-09-21T14:05:00+00:00",
            "helpful_count": 99,
            "mal_id": 199157,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ThunderClap448",
                "username": "ThunderClap448"
            },
            "url": "https://myanimelist.net/reviews.php?id=199157"
        },
        {
            "content": "If there can be one thing said about Chaos Dragon as a whole, I think that would be \"I'm glad it didn't get delayed\"- because thank God, it's finally over.\r\nChaos Dragon... what an interesting idea- taking a DnD-based game called \"Red Dragon\", played by four industry persons and some dude named Simadoriru: Gen Urobuchi of Madoka, Fate Zero and Psycho Pass fame, Kinoko Nasu, creator of the Fate series, Ryougo Narita, who wrote Baccano and Durarara, and Izuki Kogyoku, another author \r\n... and turning the story into an anime. While not an original idea, (\"Record of Lodoss War\" was the first) it's still one thatcould turn into an interesting fantasy style story, replete with dragons, loot, the undead, and fascinating characters who are extensions of the personalities of their creators, right? \\n\\n\r\nWell... Chaos Dragon has these things, but they don't always work out.\\n\\n\\n\r\nThe Good: \\n\\n\r\nArtwork and Animation: 7\\n\\n\r\nA collaborative effort between Silver Link and another studio, Connect- the art stylings are reminiscent of ufotable- large eyes (and everyone has this intensely long cateye that shows through hair) and skinny bodies. The character designs, though, particularly the clothing- are really stupid looking. \\n\\n\r\nAllow me to describe Ibuki, the main character, to the reader. \\n\r\nImagine, if you will- a young boy, no older than 12. He's got white hair and red eyes, because apparently the entire Nil Kamuian royal family is albino. He's clad in a white tunic, with a belt- and attached to this belt are what appear to be two red trash bags, cut on the sides to appear like pantaloons. He's also wearing flip flops and socks like a real gangsta, and he has a turban on. \\n\\n\r\nThis is the most egregious example, but never fear, the rest of the characters from Ibuki's country are clothed similarly idiotically. It is nice, however, to see some character designs that don't involve school uniforms or sailor outfits. \\n\\n\r\nAnimation wise, everything is solid. Fairly consistent detail, fairly fluid animation, and a lot of nice looking fantasy backgrounds- castles, valleys, cities, etc. \\n\\n\\n\r\nSound and Voice Acting: 5\\n\\n\r\nMarina Inoue cast as Ibuki was probably the single best thing they could have done for the show... if they wanted to have a ninnyboy, weenie protagonist. Also the voice of Armin in Attack on Titan, Ms. Inoue delivers another dish of crybaby protagonist in Chaos Dragon, only moreso. \\n\\n\r\nThe rest of the cast ranges from pretty boring to fairly chilling, ending with Lou Chen Wah. One Maaya Uchida voices Lou (in a role that would have been perfectly suited for Yukari Tamura) excellently though- bringing the cold hearted evil witch to life. \\n\\n\\n\r\nThe Bad: \\n\\n\r\nCharacters: 2\\n\\n\r\nThe problem with the characters lies mostly within the writing abilities and types of characters that writers like Urobuchi and Nasu typically write. It was plainly obvious from about the 4th episode on who wrote which character. Not that this is a bad thing, but given that I knew these two were involved, I was on the lookout for their character, and it was immediately apparent- Lou belongs to the Urobutcher, and Sweallow/Meryl were the Nasu characters. \\n\\n\r\nLou's character is probably the best in the show, and all credit due her writer- Urobuchi. She's exactly what you'd expect from one of Gen's characters though- ulterior motives, backstabbing bitch, and very cunning. I guess it doesn't hurt that she's also a religious fanatic who's possessed by Soul Edge- an evil sentient sword passed down through the ages that drives the wielders insane and turns them into a slave to gather more souls for the evil sword to increase its power. \\n\\n\r\nAt this point, we can safely say that Nasu has no clue how to write (or while playing DnD, act as?) effective female characters, and his male characters ALWAYS follow the same progression. \\n\r\n1. Protagonist has some curse or affliction\\n\r\n2. Protagonist has a heart of gold and some family members or friends to protect\\n\r\n3. Protagonist is lawful good TO A FAULT, and extremely foolhardy upholding their sense of justice/right/must protect/! \\n\\n\r\nSweallow by far is not the worst character though. No, that award goes to Ibuki, who is probably now on most every top ten list of \"Worst/Most Annoying Shonen Protagonists\". Not since Suzaku Kururugi have I wanted a character to die so hard as I did Ibuki. \\n\\n\r\nThe absolute embodiment of the most stupid shonen tropes, I think Ibuki was created just to anger the audience. It was just tolerable in Fate Stay Night with Shiro, it was acceptable in Neon Genesis Evangelion with Shinji... but Ibuki takes the wiener cake. He's most cowardly, contemptible character I think I've ever seen. His absolute refusal to harm anyone, despite it potentially costing him his life, and his country being at war, ravaged from inside by their own patron dragon is mind boggling. He literally has people throw themselves on his sword to escape his presence, that's how bad it is. \\n\\n\r\nOh, and Ka Grava is just a sane Big Daddy from Bioshock who wears a top hat and is super rich. \\n\\n\\n\r\nThe Ugly: \\n\\n\r\nStory: 4\\n\\n\r\nA lot of major things that happen in the show are most likely as a result of dice rolls- characters take damage or die? The player probably rolled low. \\n\r\nLou's arm loss was probably a result of a bad roll. Lou getting a new stupidly overpowered arm was probably the result of rolling a 20 for loot. \\n\\n\r\nWhile the story (if one had no knowledge of how a DnD game typically plays out) seems really nonsensical and disconnected, it's really not too bad, other than how excessively tedious it is. DnD games involve a LOT of talking and not a ton of action all the time. This doesn't translate well to a short anime series where you spend the first 3 episodes explaining the world, introducing the characters, and the complex relationships in the world that the Dungeon Master lays out before an adventure. \\n\\n\r\nI do understand that it's necessary to have this exposition, however there are ways to make it interesting, such as short animated scenes in the form of flashbacks, but the beginning montage that repeats the same lines over and over just gets tiresome. Yes, we know the island nation of Nil Kamui is beset upon by Kouran and D'natia, thanks. I don't need to be told 12 times. The story is pushed along by the ever growing (and shrinking) cast. New characters are introduced with nearly every episode, and then a majority of them are killed off throughout the show... I only wish that Ibuki himself was the one that died. His idiotic \"curse\" really isn't a curse at all. At any point throughout the show, all of the conflict would have been settled and nobody would have had to die if he'd just offed himself, but of course, our little ninny shonen protagonist must survive at all costs! \\n\\n\r\nThe story itself is fairly typical of a DnD adventure- a party goes through towns and dungeons and lands in search of a mystical item that will stop the rampaging dragon that's ravaging the land. Some characters have ulterior motives due to their allegiances, and some decide that their friendships are worth more to them than the wills of their government. While this sounds pretty exciting, in actuality, it's rather boring to watch. Each episode is semi formulaic- Ibuki and pals run into a conflict that can only be solved by Ibuki killing one of his friends, and then Lou and Sweallow, and their respective nations scheme other plans for what's going to happen when they find Red Dragon, whether it's to kill or enslave it. The evil is defeated with Red Dragon's power, and they move on to the next place. \\n\\n\\n\r\nNEEEEEEXT!\\n\\n\r\nEnjoyment and Overall: 4\\n\\n\r\nChaos Dragon does improve somewhat at the end, but the introduction of yet another Deus Ex Machina character kind of spoils it. The ending is a bit of a head scratcher as to why Ibuki can't just do the deed, but it ends on a nice note at least. (A better note would have been Ibuki's head on a pike, on fire.)\\n\r\nOverall, it's a pretty boring fantasy series. Not a whole lot of redeeming qualities about it, maybe except the artwork. (The 3D CGI doesn't suck!).\\n\\n\\n\r\nRecommend? \\n\\n\r\nChaos Dragon is a Chaotic Neutral show. It follows its own whims, and like most neutral characters, it's neither good enough to like, or bad enough to despise. It just rides the middle of vanilla territory. \\n\\n",
            "date": "2015-09-18T13:19:00+00:00",
            "helpful_count": 70,
            "mal_id": 198830,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=198830"
        },
        {
            "content": "Legends speak of a show that is considered to be one of, if not the absolute worst show of 2015. A show with such incompetent direction and CGI that frame rates slow down in the very first scene. A show with such uninteresting characters that their deaths are a loss to no one in the audience. A show so edgy and poorly written that it can only cause \"darkness-induced apathy\".\r\nYou know what they say about legends. There's always some truth to them.\r\n*Spoilers for Chaos Dragon*\r\nWhen you hear about an adaptation of a gaming session involving the likes of Gen Urobuchi of Fate/Zero and Psycho-Pass, KinokoNasu of the Nasuverse (Fate/Stay Night franchise, Shiki + Melty Blood, Kara no Kyoukai), and others, you can't help but wonder how the hell it'll turn out. It's based on a game session but it's a session from rather popular figures in the realm of anime, even if they're not Hideaki Anno. Unfortunately, the writer and the studio ducked up beyond belief and managed to ruin most of the fun that could've come out of something like that, even if there was nothing necessarily indicating that this anime would be good. Its status is almost legendary as one of the worst of 2015 and even the decade, with more people having seen it and calling it shit than Mars of Destruction, even if it's not as popular in its awful reputation as say, Big Order. So, what happened here? Well, let's find out, shall we?\\n\\n\r\nIn some island, Nii Kamui is overtaken by D'Natia and Kouran, and the king's son is in an orphanage, but then after people die, he ends up finding this relic that somehow gives him the ability to subconsciously communicate with Red Dragon (because fuck creativity in dragon names). He also gains a really stupid curse: every time he wants to use dragon power, he must kill someone he has a deep connection with and use that soul to eradicate someone else. I needn't mention why such a power is stupid and only there for needless drama, especially since it makes it so that the MC (Ibuki) is always whining about \"I love my friends and I won't kill any of them\". Seriously, when Fairy Tail is more subtle about friendship, we have a problem here, and Fairy Tail is synonymous with \"friendship trumps all\". In fact, people have random curses as they're born, like Sweallow's which make him break any tool he touches, except that by the anime's logic, walls and ships are also tools (because while the power wasn't stupid enough, they're basically calling literally every single object a tool, except somehow for his clothes because fuck consistency). I'll touch in what pisses me off the most about the powers later. Also, there are apparently 7 dragons (one for each kingdom I suppose) but we only see two of them: Red Dragon and Black Dragon, which are for Nii Kamui and D'Natia. We don't even see the one for Kouran, or any of the other dragons. \\n\\n\r\nSo, an ever-expanding group of flat, poorly-written, and unlikeable assholes (sans a few that only fit the first two categories) join up on an expedition and while the MC wants to find and reason with the now maddened Red Dragon, everyone else (sans two members) wants to kill Red Dragon, which could've created conflict on its own between some of the members of this anime knew how to manage them. They also throw magic into the mix but the only time weever see magic that has a magic circle to clue us into the fact that it's supposed to be magic (since nothing is ever directly classified as such) is when one imperial from Kouran creates a poorly edited blockade. Before you try to classify those soul-sucking weapons (like the one Koukaku has in episodes 1 and 2 if you remember her, or the sentient one that Lou has) as magic weapons, it's never directly stated or even hinted at. Then zombies, or rather \"returned ones\" show up,and where we get another issue that compounds itself the longer the anime runs. The start off as literal zombies minus the brain eating, but then one of the people Ibuki killed is conscious and able to speak (somewhat), and by the end, the final antagonist is also a returned one but with full consciousness and personality as well as a complete ability to speak as well as she did before, and we never know why.\\n\\n\r\nCharacters often make really stupid decisions, like one character actually stabbing himself, gouging his eyes out (or stabbing them with his fingers), and pretending to be a returned one just to get Ibuki to sacrifice him for the dragon since only loved ones and close friends can be sacrificed. Now, this is stupid enough but the part that makes this especially stupid is the fact that he and the main character hardly know each other or have any semblance of a bond, which is mandatory. As you could guess, that plan obviously backfired (since it honestly would've been beyond stupid, even by Chaod Dragon standards to let the sacrifice work). When one f the characters is clearly dying and having a hard time escaping rubble while the final antagonist is causing havoc, Ibuki doesn't let her sacrifice herself, and while ultimately it wouldn't have worked since Red Dragon is under the villain's control, he didn't know that at the time and it just seemed like a lazy way to have justified his idiotic behavior her can't even count as properly sentimental. If he was told earlier that this power wouldn't work for a while or if he tried it and failed which should make his friend live a while longer, then it would've been acceptable. Also, when he tried to say that that same friend shouldn't just be a sword for him as she's asking him if she is his to use (since she really wanted that), he frames it ina way that shits her down horribly rather than what he intended (that she shouldn't think herself of just a sword but more of a closed friend), and unlike say, Lelouch, who often words things poorly on purpose to either take blame or turn people against him, here, Ibuki just fucked up, which is emphasized by the fact that he manages to actually say it right in the finale episode.\\n\\n\r\nAfter a quick journey that could've been used to flesh it the characters, see then develop a bond of camaraderie with each other (but you know, that's what a good anime would do), it turns out that Ibuki's sister was alive the whole time. Yeah, remember the part where his family died and Nii Kamui was taken over and Red Dragon went insane, all before this expedition started? No? They only went through it every single episode after one scene in the beginning! Give other anime like Bakugan and Fairy Tail some credit; they do it at the very beginning before any OP or scene has a chance to occur rather than shoving a scene beforehand. But yeah, she survived and neither she nor Ibuki were reunited in 3 years since nobody had the bright idea to look, but that might be the leader, Agito's fault, seeing as he wanted someone to kill her after she made Red Dragon go crazy. Then again, seeing as how that required someone to have a contract with Red Dragon and assemble a team to stop her, why wasn't it done earlier? Oh yeah, because they died since instead of assembling a team to stop her, he wastes their time by making them go the  volcano where Red Dragon was. He makes the current group do the same thing too, and D'Natia sends their weakest imperial warrior first and only two more powerful soldiers way later since while they went to kill Red Dragon, I guess they're a bit lazy or something. Also, yeah, that sister is the main villain and she revived the first person Ibuki sacrificed; his love interest, and she dies a lot until she dies for good.\\n\\n\r\nBefore we get onto the topic of the paragraph's discussion, the reason Ibuki's sister, Inori, can revive her is because she has another artifact of Red Dragon, by this one revives people. Now, remember those curses? Well, apparently, the one Swaellow has is supposed to be part of this bullshit Aesop meant to say that it's human nature to shatter things like object or connections but that new ones are often formed in its place and that he should stay with this power. My response: \"Oh, FUCK YOU, ANIME!! You and your bullshit and inconsistently written curse BS that basically ruined a major character's life since childhood was to teach him an Aesop of human nature?! Fuck you, fuck whatever gave him the curse, fuck Black Dragon for not lifting it, fuck Swaellow for being a fucking moron and sticking with it, and fuck the writer for doing this bullshit!\" Oh, I still stick by that. It's beyond retarded. Also, after more nonsense and generic trash stuff and one of the characters betraying some of her allies, Ibuki kills his sister and she's revived and Ibuki becomes king. Also, Lou, the one who killed some of the other expedition members, gains that other artifact and then she walks off. The end. Of course I can't really hit every oddity in the series' writing, like Lou's badly done and borderline blatantly telegraphed heel turn, or like god when Swaellow's attendant blocks an object she shot out, it manages to hit him anyway despite the fact that he is literally behind his attendant who blocked the shot. Ether way, this is mkre than enough to really show how awful the writing of this show is. Now, for those bad characters I mentioned earlier.\\n\\n\r\nTo return to the cesspool of blithering idiots known as the characters, let's start with Ibuki. This brat is one of the most infuriatingly whiny protagonists I've ever talked about so far. He always whines about losing and not wanting to lose people he cares about due to his new power, but he never thinks to use his sword regularly and train so that he can actually defend people with his regular skills so that he doesn't have to get to the point of needing to sacrifice them to kill an enemy. It's not excusable by the fact that he is a child because even then, children would've often tried to get stronger so that this never would've happened, or he just would've ran, and he doesn't do either. He just whines the whole time but never actually tries to do anything to improve his situation so that what he fears may never happen again.\\n\\n\r\nEiha is beyond insistent on dying for this loser, and for no good reason. Her bodyguard devotion to him is her only real trait aside from being discriminated against for being a \"bounded one\" or one attached to a beast. Lou is easily the least terrible and one that could've been potentially amazing, but her personality is basically \"attractively creepy and badass\" while having a truly terribly done heel turn. It's probably a coincidence that the best character was made up by Gen Urobuchi. Sweallow (who looks strikingly similar to Gunvolt from the Azure Striker Gunvolt games) is a complete idiot who happens to have that awful curse and still be a badass, but that's his whole character. His attendant (Meryl) is an infuriating character who basically derides him at every turn and hits him, almost like a trash tsundere. Everyone else is either just one-note and barely there so they're not worth mentioning (like Koukaku and Ulrica), or are just idiots who deserve to die (like Kai and Hien), so the only one left to really mention aside from the shitbag 1D dragons is the final antagonist, Inori. God, what a butch. I get that kids can be terrible to each other and to authority sometimes, but they wrote her character to be so unrealistically deplorable and incestuous that it's quite frankly pathetic and downright edgy. All she does is do things for her brother or just be a total monster, and not even the entertainingly evil kind either. I don't feel like anyone else is even worth a paltry sentence of mentioning, so I'll just leave it here. What a shit show of a cast.\\n\\n\r\nLet's start with the character art. It looks like a weird, failed attempt to capture the art-style found in Studio Ufotable's adaptation of Fate/Zero and Unlimited Blade Works. Given that this isn't Ufotable, I'm right; it was done by Studio Connect and Studio Silver Link, the latter of which is mainly known for a few popular, if somewhat divisive titles like Chivalry of a Failed Knight, and WataMote. Then, we have the animation, which often looks like an animatic rather than animation given the number of frames that tend to be missing from many movements more advanced than walking. The choreography is awful too, especially in the early episodes. It sometimes becomes painfully obvious as to which scene was done by a different studio like in episodes 7 and 10 looking different in lighting and feel (as well as the wildly inconsistent sizes of Meryl's freckles). The characters often don't feel like they're connecting with the ground properly, especially when they end up rolling around via knockback, and it's rare when an anime gives off this vibe. Overall, actual animation is pretty poor at worst and mediocre at best, especially with the occasional reused footage which I thought died out this day and age, at least until two years later with a certain title that shall not be named\\n\\n\r\nThe CGI here is some of the absolute worst that I've seen in anime. Let's start with the goddamn Red Dragon. He looks like an animated version of some kid's over-designed action figure, and at times, they give him the ability to static out of existence. Every bit of movement has different frame rates as well, and it looks beyond ugly. You can apply a lot of this to Black Dragon as well. It's all hideous to look at, and the tentacle monsters summoned at episode 10 not only look terrible but when they die, they disappear into weird purple hoop CGI that fails miserably at being blood. Some backgrounds are literal live stock footage too, though that's surprisingly hard to notice. Still, it's unacceptable in any circumstances in today's time, or even two years ago when it came out. The CGI beetle-ship in the finale isn't any better. Hell, scene one of episodes 1 and 12 (since it's a repeat of the very first scene in episode 1) has a fugly ass CGI castle with abominable frame rate, and brings up memories I'd rather forget.\\n\\n\r\nThe OP, \"ISOtone\" by Natsumi Kon, is literally the only remotely noteworthy piece of music in this entire damn OST, and it's an alright OP. The ED isn't worth mentioning. Neither is the rest of this goddamn OST with how generic and forgettable it is. Worse yet, some of them can be repeated at nauseam, like the piano piece in episode 8 being repeated 4 times in that same episode. As for the dub, it's rather mediocre as well, and I cannot believe that they wasted Lanipator on this piece of crap show. Even Tia Ballard can't save this with how little her character appears, though it's not like these guys were doing that bad. It's just lame overall and the character models don't even feel like they work with the dub all that much. Also, some of these sound effects are goddamn awful, like with blood splatter sounding like when you get crushed and splattered in Happy Wheels.\\n\\n\r\nThis is easily one of the worst anime I've seen to date. It's not even memorably bad either; it's one of the most forgettable anime I've ever given such a negative rating to. It's terribly animated, the script is a mess, the characters are bland and/or idiotic, the CGI is fugly as hell, and nothing about this show is actually good; maybe a few things that are decent at best, but certainly not good. People were right in calling this dreck one of the worst anime of 2015. Well, with that said, I bid you adieu.",
            "date": "2017-05-10T13:59:00+00:00",
            "helpful_count": 24,
            "mal_id": 247388,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=247388"
        },
        {
            "content": "Now that Chaos Dragon is over I'll be sure to tell the truth about this series.\r\nChaos Dragon is a very interesting series not because it's good or unique but because it's hard to predict how it could get worse and worse each episode.\r\nBut since you could go on for hours about how terrible it was I'll just make a pro's and con's list.\r\nPro's : The concept itself was interesting       and\r\n            Some of the less important main characters were fairly good characters.\r\nCon's:  Horrible writing, terrible lead character, barelyany effort put into the series, poor execution, nothing memorable from it's soundtrack, crying 12 year old protagonist, terrible animation most of the time, terrible character development, terrible pacing, terrible dragon designs, and plenty of other things.\\n\\n\\n\\n\r\nBut long story short Chaos Dragon isn't the worse anime ever but it's definitely close. I'm trying to think of a reason to recommend people to watch it but it's only something I recommend to people who want something to watch to learn how not to make a pathetic series.",
            "date": "2015-09-17T15:58:00+00:00",
            "helpful_count": 37,
            "mal_id": 198773,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1419829.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Jakerams",
                "username": "Jakerams"
            },
            "url": "https://myanimelist.net/reviews.php?id=198773"
        },
        {
            "content": "On every season I pick up over 44 series the summer season. LITTERALLY. I picked 44 in total. For the most part for me summer was alright, with a few bad shows. Few good, at little great, but also Silver Link delivering shows like their works this season like Fate/Kaleid and their winter work Yuri Kuma which was an anime original series. The phrase of \"In Silver Link we trust\" is a very common word for them because they barely make any terrible series. Their weak points are making anime original series to be honest. One of the only series I remember that was horriblewas C3 Cube. Trust me that show was terrible... and then we got this. This show. Alright? we had Gen Urobuchi behind this, but do you know what happens when Gen is behind some shit? Yep trolled behind our backs to get our heads spitted with saliva. This would go for the same way as his previous troll series this year. But lets just go on ahead and say, this series is by far the worst of the kind. If you think that Ranpo is one of the worst of the season... trust me, this is litterally the worst series I've seen after winter spitting me words of BS. Well lets begin with the review before I lose my sanity.\\n\\n\r\nStory: One of the few, most pitiful parts of the series categories. Yes it has some of the interesting concepts, I will admit I was curious for the series because for #1 it had a lot of people behind which are famous, and second the concept or the plot seemed interesting from the trailers and as well with the synopsis. But then when you watch it... thats when the things get atrocious. The first thing of this anime is that the episodes are very very inconsistents. I mean they're terrible overall. Yeah, we had a first bad episode, and I personally give all a chance, but then later on it became worse and worse for me. It felt like forced stuff going around you here and there. The second thing is the execution being completely poorly done. It feels so jarring and very predictable as well because you would know by the glance it will happen. There was also moments where I felt like the series was being shifted fastly, in other words rushed pacing. There was a very lack of build up as well and not to mention that the ending for me felt like its telling a season 2 in a bad way. So overall the story is by far the weakest component of the series.\\n\\n\r\nCharacters: This would be rather short, because this would be considered another part of the anime where it actually fails to bring a good cast of characters. Other words they're by far the 2nd worst component. They're all or most of them are one dimensional with no good development whatsoever. They felt for me just thrown there. Especially when you have someone interesting you don't get good insight. I only remember one good character and thats it.\\n\\n\r\nArt/Animation: Now a bit to say here, the artstyle isnt the best but its not terrible either. It looks a bit more creative style for their character designs because technically the authors had to make their own characters, and they look okay. However also the background feels lacking and jarring. NOT TO MENTION. The biggest issue here in this anime are two different things: The animation is completely utter bad, I mean choppy a lot of the times and it just feels and looks horrible. It looks very inconsistent and also very cracky. But most of all the second issue. The awful Dragon CGI.  WHAT THE FLIP IS THIS? IT LOOKS LIKE FUCKING CLAY. It looks horrible and usually I can say the Overlord's CGI are better. Or Rokka's. Overall, a bad art/animation.\\n\\n\r\nMusic: Lets get into the OP and ED. To be honest these two are the best things from the anime. They fit with the series rather well and it gives a dancing groove. However the music soundtrack its very generic and unmemorable. Sound it makes me go and get my ear drums pump badly. It feels like screeches as well.\\n\\n\r\nEnjoyment: I only liked bits of the anime fights and some parts of the series. Overall... it was a terrible factor. Many series even at the stances of bad like for example Fairy Tail and Mirai Nikki they are usually fun at times. This for me personally has none.\\n\\n\r\nOverall this series was a true disappointment to my waste of time and potential thrown aside towards anime original content too. Of course this is the director's first try, but damn please learn after this. This is also Silver Link's second worst work so far. They barely makes bad shows of course... thats just me.",
            "date": "2015-09-18T20:27:00+00:00",
            "helpful_count": 27,
            "mal_id": 198848,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=198848"
        },
        {
            "content": "I don’t think anybody really thought for even a second that Chaos Dragon was actually going to be good when they saw the team attached to the project. Interesting, maybe. Fun to joke about. But definitely not good. I mean anime in general has always been worse in regards to the kitchen sink approach than Hollywood films and AAA video games, and considering that the only thing these supposed “talented” people like Ryogho Narita and Gen Urobuchi contributed to this project was making up the characters whilst leaving the story writing to a guy who’s written nothing but black holes since the 80s - andbefore you say anything, yes I’m aware Sho Aikawa adapted the original FMA series and Un-Go as well - you’re pretty much getting the series equivalent of a movie starring all your favorite actors under the direction of Seth McFarlane. And whilst I haven’t seen any of his post-Ted films, I’m pretty sure that jackass never screwed up this badly.\\n\\n\r\nMy point is, are fans of Nasu, Buchi, and Narita so blindly devoted to them that they’ll watch fucking anything that has their names attached even when it’s clear they’re not involved in any major way? Especially since even before this show aired, all three of them had their reputations tank only slightly less harder than Bill Cosby’s due to 2015 being an atrocious year for big anime names. No I’m not exaggerating here. Look at all the more well-known train wrecks that have come out so far and hang yourself on a rope with “you betrayed me” written on it when you realize that the same person who gave you the lovely Kyousogiga anime ended up churning out a shallow, badly written mess. Or that the dude who gave you that visual novel anime you all creamed your pants over has made a Jun Maeda anime that’s worse than anything Jun Maeda has ever written. And the less said about Jun Maeda himself, the better.\\n\\n\r\nYet none of them suffered as much as the names attached to Chaos Dragon - except for Naotaka Hayashi obviously - what with their shitty, badly overhyped Durarara!!x2/Unlimited Blade Works/Aldnoah Zero bullshit that didn’t so much fail to live up to the promises set by their concepts and initial episodes, so much as drove off a cliff and into an active volcano owned by a Commander Keen villain. And regardless of how little they were involved in the final result that is Chaos Dragon: The Anime, their influence sure isn’t going to increase with its existence. How bad is it? Well I’ve been trying to hold off talking about the show itself for three paragraphs and am continuing to do so now, because I’m honestly not sure what to say about other than it’s #$@%^*%&#%!&$-fucking bad. You know, the kind of bad that’s so incomprehensibly idiotic that any attempt to engage with it will just cause you to be dragged down to its level and beaten by its superior experience.\\n\\n\r\nThe plot is pretty simple to explain, but that’s actually its biggest problem. It’s so simple that Chaos Dragon tries to distract us from that fact by overcomplicating everything to the point that we have nothing to focus on, and when you do, you’re too embarrassed to spell it out for the audience. There’s this red dragon guarding this generic fantasy land who has gone mad, and the only one who can stop him is this royal boy who can used the dragon’s power at the cost of a beloved one’s life. He gathers a crew of RPG rejects and goes on a journey to hunt the dragon whilst trying hard not to use his power. And...that’s it. That’s literally all there is to the story with no attempt to spice it up whatsoever, unless you count the boy’s obsession with certain females that are so creepily handled I’d rather not dwell on them. Well, that’s not entirely true. Fucking up even the most basic things is kind of a spice in that it takes a specific kind of talent to do that.\\n\\n\r\nI know Silver Link animation is never good, but even by those standards, Chaos Dragon looks like ass. The character designs look like something you’d find in the trash bin of a fetish shop, the action is incoherent and poorly choreographed, and...well...the visuals look like ass. When your all-powerful red dragon is basically a CG monstrosity that would fit right in with a Passione anime or the miniseries adaptation of The Langoliers, you know something has gone wrong. When you have every other visual disaster share the same screen, I speak no hyperbole when I say that watching RWBY would be less taxing on the eyes. And it’s not like the writing helps, considering it’s as fucking standard a fantasy quest as you can get, except with most of the dialogue consisting of boring exposition dump after exposition dump to the point that I would have been better off listening to a drama CD just so that only my ears would suffer pain in the process.\\n\\n\r\nAnd take my advice, don’t even bother listening to the people who point out this show’s “good points” or even watch it out of curiosity sakes because I watched it for the latter and I can tell you that the former is a big fat lie. Chaos Dragon is not, and I can’t stress this enough, NOT the least bit memorable in its badness at all. Very little actually happens in the show proper, and whatever does happen is buried under what I can only describe as the anime version of a dull repetitive cover-based shooter. I know some people got enjoyment out of pretending that Urobuchi’s character likes to grab people’s boobs, but I wouldn’t even know which character he’d written if I didn’t look it up on Wikipedia. And any anime that requires outside knowledge you couldn’t possibly get from the show proper to understand seriously needs to go into the corner and think about what it’s done. Besides, I don’t watch Risky Business to see Tom Cruise trying to play a high school student (well, not just because of that anyways).\\n\\n\r\nSo in case you didn't understand all that, no I don't recommend Chaos Dragon at all. In fact, it's one of the few anime where I'd go so far as to say you're wrong for liking it, which is no mean feat given how little I care for what the fanbase thinks. It’d at least be better than that shitty Arslan adaptation if it wasn’t for its utter disinterest in trying to entertain people, which makes me wonder, why was anyone even interested in making a public spectacle out of the D&D games that certain industry people do in their spare time anyways? How exactly is that sort of thing appealing to anyone not within the circle? Might as well introduce the Yu-Gi-Oh card game to the homeless whilst you're at it. Chances are one of them has an interest in foreign card games that he can use to win big and get out of his sorry state.",
            "date": "2015-11-04T14:28:00+00:00",
            "helpful_count": 15,
            "mal_id": 202668,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1147547.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Flawfinder",
                "username": "Flawfinder"
            },
            "url": "https://myanimelist.net/reviews.php?id=202668"
        },
        {
            "content": "Despite all the big-name people working on this show, Chaos Dragon was laughably bad and quite possibly the worst show this season.\r\nStory: 4/10\r\nThe country of Nil Kamui was a country, until they got invaded and their allies didn't help. Additionally, their guardian, Red Dragon, didn't help. This is the backstory that gets repeated at the start of every episode, and man, what a lame setup it is. It's very basic stuff for a high fantasy anime, and there's very little worldbuilding. It also doesn't help that the opening potentially spoils who's gonna be dead by the end of the show.\r\nArt: 4/10\r\nGeneric at best, atrocious atworst. The characters don't look terrible, just not unique in any way. One of the lady knights is literally Saber. The titular Chaos Dragon (and all the other large monsters) is rendered entirely in low-frame jarringly awful 3DCG that suggests that the budget for this show maaaaay have been set a bit too low.\\n\\n\r\nSound: 6/10\\n\r\nThe OP and ED are as edgy as a middle schooler who just discovered nu metal, but they don't sound that bad. There are very few background music tracks, and they keep getting played over and over. Despite that, they're still incredibly forgettable.\\n\\n\r\nCharacter: 2/10\\n\r\nWith guys like Gen Urobuchi and Ryohgo Narita designing your characters, what the hell happened, Chaos Dragon? All of the characters display this ridiculous amount of heroism, with characters literally throwing themselves at our main character to be sacrificed. Speaking of our main character, Ibuki has no personality. Most of his lines are just repeating names spoken to him with ellipsis and a question mark at the end. Speaking of edgy, Gen Urobuchi's character may as well have been named Linkin Park.\\n\r\nI guess this is what happens when you get a whole bunch of high-profile directors and designers to create characters, but you don't make any effort to tie the characters together. Despite being on a combined expedition, they're all lone wolves with differing, confusing motives.\\n\\n\r\nEnjoyment: 6/10\\n\r\nThis is a stupid show. I can say that without any regrets. In that sense, sometimes it's funny to watch just how dumb it can get, with the self-destructive heroism and how hard the show tries to be serious. The Funimation translation is pretty odd and doesn't read very easily. Sadly, there's few other options. You can either stick with the pretty bad simulcast translation, use the DameDesuYo translation which actually reads coherently but at this rate will be finished in 2018, or try your luck with the group I detailed in my Vampire Holmes review.\\n\\n\r\nOverall: 4/10\\n\r\nWhat more is there to say? With such famous people designing the characters, you'd think this show would have higher overall quality. Sadly, that's not the case, and nearly every aspect of Chaos Dragon is shoddy and poor quality.",
            "date": "2015-09-20T10:21:00+00:00",
            "helpful_count": 10,
            "mal_id": 199046,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2976321.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/somaisbatman",
                "username": "somaisbatman"
            },
            "url": "https://myanimelist.net/reviews.php?id=199046"
        },
        {
            "content": "Chaos Dragon redefines the word \"underrated\". If you don't know what I'm talking about, try pondering on it. \r\nDEEN makes a bad adaptation of Fate/Stay Night and no one bats an eye... Silver Link. and Connect make one of the best mobile game adaptation and everyone loses their minds.\r\nWhat sets me off about people is that they constantly complain about this show only because they compare it to some other anime and blame it for not exceeding their expectations only because \" ITZ GEN UROBUCHEE AND KINOKO NASU LULZ LULZ\".\r\nIs this a Fate/Stay Night anime? Does it have any similarities to be likened to it?Just because it has the same authors and the animations looks very close to Ufotable, doesn't just mean this show must be always rated so lowly because of it.\\n\\n\r\nBut let's go on with my opinion:\\n\\n\r\nStory: 7\\n\r\nFirst off, I must say the plot is very simple, it doesn't require a high IQ, and it isn't meaningless unlike some people pointed out, it has plenty of unexpected plot twists, at times meaningless deaths, but nothing special, this indeed isn't the strongest point, but don't be discouraged.\\n\\n\r\nCharacter: 10 \\n\r\nI've witnessed many complaints about how people seem to dislike the characters, particularly the main character. The main character isn't your typical cliched hero, he's just a regular child, and he has to deal with sacrificing his friends and family, his reactions are very natural, what would you do if your most precious people died by your own hands? Ibuki is very emotional, and through his losses he grows up, along with the other characters. Though some characters aren't developed enough since the show ended too soon, the cast is counts many very unique characters because multiple authors worked on it, particularly Kinoko Nasu (the author of Fate/Stay Night, Tsukihime and other Type-Moon works), Gen Urobuchi (Fate/Zero, Madoka Magica), and the director of Durarara and Baccano.\\n\\n\r\nArt: 10 \\n\r\nThe animation is literally flawless, the opening is perfect, and I might even say it's the best animation I have ever seen, next to Ufotable, it is safe to assume they did put their utmost efforts in the animation.\\n\\n\r\nSound: 8\\n\r\nI don't recall any soundtrack that caught my attention, however I love the opening song which I just couldn't skip, as I enjoyed the ending too, I thought those were more than enough to pump me up.\\n\\n\r\nEnjoyment: 9\\n\r\nDue to the very unique cast of characters, this show kept me entertained from the beginning to the end, unlike other reviewers say, I didn't find it boring, but with the ending, which left some space, I was rather starving for a second season, I believe this show truly deserves it.\\n\\n\r\nOverall: 9\\n\r\nWhen you watch this show, remember that it was adapted from a mobile game, I hope you know how hard that can be, most of the video games adaptions are often hideous and unwatchable. However Chaos Dragon is the best game adaptation I have ever watched. The fanservice isn't annoying or noticeable at all, there's action, beautiful animation and character development, what more are you asking for? This show is a rare gem that needs more attention, I definitely wish it lasted longer, or it had a second season, in that case I wouldn't hesitate to call it a masterpiece. \\n\\n\r\nPut it simply, if you like action and want to try something different with an actual character development and amazing animation work, you'll love this show.﻿",
            "date": "2016-04-14T13:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 216381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5209496.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Quadrillion",
                "username": "Quadrillion"
            },
            "url": "https://myanimelist.net/reviews.php?id=216381"
        },
        {
            "content": "\"The name of our country is Nil Kamui.  One day, a sudden invasion by the country Kouran invaded the small island country and plundered a third of the land.  Our allies, the country of D'natia defended their settlements where they kept their bases and kept silent.  The two great countries eventually carved away the land like meat of a sacrificial swine.  The guardian of the country, the Red Dragon, attacked its people.  Imperial Era 3015, September, our country was no longer ours...\"  No joke, this is said at the start of EVERY episode for Chaos Dragon.  (Now thatthe tedious monologue is over, onto our main program.)\\n\\n\r\nStory: Chaos Dragon, as I will be calling this series in this review, follows the story of a boy named Ibuki in the land of Nil Kamui.  As explained by the tedious introduction, the country he lives in is a small island country where the place is not only under control of other countries, but also under threat of the country's own guardian.  As the last remaining noble of Nil Kamui's royal line, he is thrown into a situation that forces him to rise out of his hiding and take back the country that has been oppressed by various sources for so long.  There, he gains the power of the country's guardian, granting him the ability to take life in exchange for that of another, a curse that he must try and get rid of by the help of a combined expedition from all three countries to find the country's rampant guardian.  \\n\\n\r\nNow, what is clear about Chaos Dragon from the first two passages of this review alone is the fact that this series is very lengthy in its setup.  The story of Chaos Dragon, in simple terms, follows Ibuki's story as he tries to find the Red Dragon with a host of other characters.  The reason why I note specifically in simple terms is because Chaos Dragon is a series that harbors a serious case of trying to cram in so much content in so little time.  With each episode that passes by more and more characters get involved in the series through various means.  Sometimes they're enemies, sometimes they're allies, others are completely irrelevant, so on and so forth.  Not only are characters an issue for this show, but the plot follows more of a random weave than a straight line, as it gets pulled in all directions from backstories, to what's happening now, dreamworld stuff, etc.  As a result, the entire story is an utter mess because it doesn't do much but confuse the audience sometimes because the overall plot just simply jumps from one thing to another without properly explaining what exactly is going on.  \\n\\n\r\nThe lack of explanation comes from a duality of sources: the show's concepts, and the motivations of each character.  \\n\\n\r\nChaos Dragon harbors a number of basic concepts within the world of its fantasy.  Like all fantasy stories, the concepts (such as how their magic works and stuff like that) have to be properly explained in order for the audience to fully immerse themselves in the story and understand what precisely is happening.  Chaos Dragon doesn't do that.  Instead, it half-asses everything by at most, mentioning what exactly a thing is.  (For example, the female protagonist of this series is known as a \"Bounded One\", they don't explain what a bounded one is at all beyond maybe three sentences of information.)  And because this show utilizes so many different concepts, the entire show falls flat because nothing is ever properly explained and you sort of have to guess what each new thing is or does.  (I mean, seriously.  Holy Spirits, Dragon Contract, Bounded ones, Returned ones, Cursed sword, Mixed One, whatever the hell Ka Grava is.  I don't want to have to google everything to get some semblance of an explanation.)\\n\\n\r\nAs for character motivations, Chaos Dragon has a lot of varied characters each with a different goal in mind.  Now, normally this would be a good thing as every character would be varied and there could always be a good twist here or there, but this show doesn't really pull it off well.  Because there are a lot of characters, there is a new motivation for every character that enters the show, leading to a lot of rather generic or incomplete reasons for really doing what they're doing.  Some of them bounce back and forth with their current motive to the extent that I could care less what they did with themselves.  It's to the point that a lot of them feel very stupid because we don't know the character well and the idea of even caring about whether a character dies or not is something that requires at the very least knowing who is dying.  \\n\\n\r\nAll in all, Chaos Dragon is a complete and utter mess with its plot.  At first I had high hopes for the show because it involved sacrifice and a somewhat intriguing plotline, but it tangled itself even further the more it progressed in the series.  The ending itself is also rather average as there's nothing that I really felt was satisfactory at the end.  It just sort of winded itself down to a stop.  It wasn't a bad ending per say, but it didn't really make all that much of an impact for an ending.  Especially since there were actually some questions that had yet to be answered.  \\n\\n\r\nOverview:\\n\r\n+ Half-Decent story idea.  (I admit though, it was intriguing enough for me to look into this series.)\\n\r\n+/-  Average ending\\n\r\n-  Horrible Pacing\\n\r\n-  Far to many story concepts and unexplained ideas\\n\r\n-  Character motivations were all over the place and never really concise. \\n\\n\r\nCharacters: As mentioned before, Chaos Dragon has an absurdly large cast for a 12 episode anime.  As a result, all but maybe two or three characters actually get any sort of half-decent motivation that adds to their characters.  (It's Angel Beats Syndrome!)\\n\\n\r\nLet's start with the main character of this series, Ibuki.  As the last royal of Nil Kamui's line, Ibuki is a boy that has decided to stay away from the ongoing conflict and not become the king of Nil Kamui because he wishes not to see the people he knows perish around him since his parents died in a fire.  Later though, he is cursed with the Red Dragon's power and is given the ability to kill one person in exchange for someone precious to him.  Because he has to kill his friends in order to kill his enemies, he shuns himself for using this power and agrees to go on a combined expedition with several other members of the cast in order to get rid of his curse.  (Once again, very lengthy.  My god.)  Ibuki as a character is similar to a story of growing up, as he has to learn about loss and sacrifices seeing as that is what he has to deal with now that he has this cursed power.  He treasures his friends and the people he knows very much and wishes not to put anyone in danger because he is afraid of their loss.  The issue with this is the fact that the series doesn't solely focus or really develop this.  Even as the main struggle of the series, the show in addition, focuses on other character issues to the point of even putting Ibuki's own character to shame.  As time goes on, he sort of fades into the background amidst the other characters, and that's rather poor design.  \\n\\n\r\nThen we have Eiha, a bounded one that looks like a little girl that resembles a fox.  (For the record, bounded ones are children that are attached to a creature from a very young age, and stay attached to that creature through some means.  They apparently have very short lifespans too.)  As Ibuki's closest companion in the expedition, Eiha is a very faithful character, willing to give up her own life for Ibuki and treats herself as a tool or his sword.  While she is my personal favorite among the entire cast of the series, her character doesn't really develop past those thoughts of hers.   As a result, her entire character doesn't really change all that much and she, like Ibuki sort of starts to lose importance in the series as time goes on, which is a shame too, because they are pretty much the only native people of Nil Kamui that we are really shown in this series.  \\n\\n\r\nBehind these two is an expansive cast of characters from the expedition members Sweallow, Lou, a robot...thing named Ka Grava, and Sweallow's maid Meryl, to members of Kouran's army, members of D'natia's army, the Dragon guardians, the rebel army, Ka Grava's servants, etc.  The thing that really makes this show so poor in quality is the fact that at least 90% of them is a character in this series that the show forces you to try and know and or care about.  They try to put enough detail for you to care about why they're there to the point that you really don't care why they're there.  As a result, any character that dies within this series really has no impact of the show as a whole because they're so obsolete sometimes that it's like stabbing a cardboard cutout.  No one cares if you stab a cardboard cutout.  While some like Sweallow and Lou have motivation and development that sort of makes sense, pretty much no one else does, and the show focuses on those two specifically for a time, for some reason.\\n\\n\r\nOverview:\\n\r\n+ Some character development\\n\r\n-  Highly underdeveloped characters\\n\r\n-  Too large of a side cast\\n\r\n-  Unsuccessful attempt at putting importance on the entire side cast\\n\r\n-  Main characters fell into the background  (That is not what a main character should do.)\\n\r\n-  Unmeaningful deaths.  \\n\\n\r\nArt: The art for Chaos Dragon is a rather bright style of animation.  It's bold in the sense that every character is distinguished in their perspective color palettes, but the color scheme itself really isn't all that much to look at.  Character designs on the other hand I admit were rather nice.  Some character had some pretty nice designs and I appreciated the different, distinct look for every character in the series.  (One of the few good reasons for the large cast.)\\n\\n\r\nBut, there is still one thing about the art that irks me.  While is was sub par at best, the air truly \"shined\" whenever it showcased any of the dragon guardians in the series.  The dragons themselves are a hideous conglomerate of CGI and the everything looks so out of place in any given scene they're in.  They're extremely glaring and they leave a bad taste in my mouth due to the inconsistency and just how awful they look.  \\n\\n\r\nOverview:\\n\r\n+ Original and Distinct character designs\\n\r\n-  Horrifying CGI Dragons.  (Not the CGI dragons!  I thought we were done with those!)\\n\\n\r\nSound:  As for the soundtrack, Chaos Dragon oddly enough has an opening that I personally like as a song.  Reflecting on the show's marketed themes of loss and flaws in one's life, the OP gives off a melancholic and somewhat thrilling battle opening that resonates a lot with what the show was trying to do.  I was honestly quite happy with the song, and it's a track that I find memorable oddly enough and one that I would listen to over and over again.\\n\\n\r\nThe ED on the other hand focuses sort of on Eiha with a similarly melancholic sound, but with a much mellower tone.  Personally, I didn't find this ED as memorable if not slightly generic.  It wasn't bad enough for me to discredit it completely, but it isn't a song that I would find memorable.  \\n\\n\r\nOverview:\\n\r\n+ IMO, a good and memorable OP\\n\r\n-  Somewhat generic ED\\n\\n\r\nPersonal Enjoyment: What really caught my attention about Chaos Dragon was the fact that not only did it feature a sort of old-style war plot that I personally have grown fond of as of late, but it was also a little fiction game made by Gen Urobuchi and several other members of the Stripe Pattern Doujin Circle.  So I thought, hey, since the guy who made the ever popular fate series is part of this, why not give it a shot?  (Whether or not he was part of the anime's development, I don't really know.)  So, what are my thoughts?\\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nNot particularly.  The biggest thing I hate about any anime is when they don't explain everything.  Leaving so many plot holes in the series to the point it's like swiss cheese is one of my biggest pet peeves.  In my opinion, it leads to a lot problems down the road for a series and really doesn't create a quality story.  Chaos Dragon delivered my cartload of swiss cheese by creating too many things without giving enough attention to each of them.  As a result, the story and the characters suffered greatly, which led to a whole host of confusion and created a lot of resentment I have towards the series.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nApart from the massive plot holes, I didn't particularly enjoy any of the deaths in the series.  Not because my favorite characters died, but because the deaths really don't matter in the series.  They exist because they attempted to pull off these themes of loss within the show, but failed because the lack of attention for any given character created a meaningless death.  I could hardly care whether that girl died, or when that guy died, or what have you.  They don't really do much because there's no emotional backing from the audience for the character that died.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nPersonally, I wouldn't recommend it.  The show is a complete mess many aspects of itself to the extent that it was, to me, frustrating to watch.  Because it went all over the place, there wasn't really many threads to connect from one scene to another and everything felt very poorly planned.  It really was a disappointment, cause I did look forward to it at the start of the season.  I guess that's what you get when you have a Gen Urobuchi work that isn't part of the Nasuverse.",
            "date": "2015-09-18T16:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 198840,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=198840"
        },
        {
            "content": "Okay, okay...\r\nI'll just start by saying that this one is for 8-10 years old kids. Or around that age. or people that is early or new to movies/stories.\r\nNow that that's said, It would be justifiable to state that this is going to be the most annoying, frustrating series i would have to endure if I was forced to finish the series.\r\nIt may bring justice if the viewers that is targeted, clearly, by the anime is doing the review, but sadly, am not one of those.\r\nThe story starts in a world so different from earth, where flying beasts breath fire, rocks, air(?), water, or any elementyou could think of. and swords sprouts shits(not a pretty picture, but it is meant figuratively, so ease up)\\n\r\nSo this is a world with a lot of power, and magic and stuff going on.\\n\r\nAnd it is on the first episode, no subtlety to it.\\n\r\nDragons are introduced by the way.\\n\r\nSo you should get the picture by now.\\n\r\nThis kind is that kind.\\n\r\nAnd it's kind can only get away with there is something new, or interesting in the mix to be an entertaining one, but I found out they have nothing to serve.\\n\r\nNot only was the world overrated, the stories, and characters are overrated.\\n\r\nLet me say again, I assumed this is for the kids that is new or have never seen or little have they known any kind of stories\\n\r\nCause this is so overrated\\n\r\nThe main character, the hero if you will, is a 5 year old toddler.\\n\r\nYeah, I may be exaggerating a bit but from what I gather, his appearance is really that of a baby.\\n\r\nAnd yes, he is destined to something, to save or lead perhaps, you decide what destiny he has.\\n\r\nDoes he have any unique quality that would make him likeable.\\n\r\nNope not at all.\\n\r\nHe goes with the flow, he's passive, and is content, and is being forced to do something he does not want to.\\n\r\nPut with a very bad tragedy in there,\\n\r\nthen he really is a weak kid (sigh, still can't get over that the 5year old toddler is responsible to millions/billions of lives in this story)\\n\r\nOne of the rule I learned in making an interesting story is that the mc must not be reacting, but acting. It means that he must not go with the flow forced by villains or other characters but instead, do what he wanted, his motivation, from the start, and not be a sissy that would say yes to any strangers that pass by.\\n\\n\r\nThere will be betrayal from trusted allies, death and screams of hardships. this would be well and done if its not thrown at us on the first chance they got. No time for liking the characters, no chance for adapting the scenarios well, instead, this dude, and girl thrown at this awful scene.\\n\\n\r\nAlright to be clear of what I meant in this, take the avatar, the legend of aang. the characters in that one is well developed, well defined, and if one of them die during the course, It'd get me, but if they'd encounter a horrible scene, and one of them do die, how would you differentiate the impact? lesser right?\\n\\n\r\nThat is my case in this series, one of it any way. so many wrong and little right,\\n\\n\r\nBtw, the sounds are great, boom and bam, (hehe, highly intelligible words) but there is nothing new to that\\n\\n\r\nAnyway, if you are new to stories, fantasy, or perhaps a kid between 1-3 (heh) years old then this is for you. \\n",
            "date": "2015-10-21T17:01:00+00:00",
            "helpful_count": 9,
            "mal_id": 201707,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743422.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/animeBee1ver",
                "username": "animeBee1ver"
            },
            "url": "https://myanimelist.net/reviews.php?id=201707"
        },
        {
            "content": "I usually don't write reviews on anime but seeing how low the rating for this anime was, I had to write a review. When I watch an anime I tend to watch animes with a rating of 7 or higher, but looking at Chaos Dragon with a rating of 6, it had me put it off for a while until now(finished it in 2 days). \r\nAlso, I'm not a picky watcher so I tend to like most animes even if the anime got a low score.\r\n**I might have a little/small spoilers, hopefully I won't**\r\nThe anime in my perspective was a decent anime. The story wasn'tthat bad as many people say it is and I found it pretty enjoyable. \\n\\n\r\nStory 6/10\\n\r\nThe story is pretty straight forward and it keeps on. There are some plot holes but its nothing like WTF? All the eps follows the plot pretty well, but maybe a few small fillers in the eps here and there. \\n\\n\r\nArt 6/10\\n\r\nMany people complain about how the art is terrible, but it seems fine. Just like a regular anime. Nothing terrible that will turn you away from watching this series. However, there are parts that will look a bit bad/terrible but they only last for 5-10 seconds at most. The rest of the anime is pretty decent. \\n\\n\r\nSound 6/10\\n\r\nThe sound is pretty good here. Nothing outstanding in my opinion.\\n\\n\r\nCharacter 5/10\\n\r\nCharacter wise... It was ok/decent. MC is a bit of a wimp til the end and there are some annoying characters here and there as the story progressives. \\n\\n\r\nEnjoyment 7/10\\n\r\nIn the end, I did find this series pretty enjoyable. The story wasn't bad and it was fun to watch\\n\\n\r\nOverall 7/10\\n\\n\r\nNot a bad anime as most people would say it is. However, this is coming from someone who isn't picky about their anime and doesn't get mad about the story/character and all the minor stuff.... \\n\\n\\n",
            "date": "2015-09-22T21:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 199282,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2071947.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/loveyuri",
                "username": "loveyuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=199282"
        },
        {
            "content": "At first, I was incredibly excited for this anime because the plot sounded so amazing and had a lot of potential. However, my enthusiasm died rather quickly as I ventured deeper into the anime. \r\nFirst of all, the main character is mainly useless, other than being granted the power of the Red Dragon and whining every now and then, and he can't do anything except sacrifice others at the extent of his own sanity to unleash his powers. Other than this, he is completely useless. I don't even know why he became the main character when even the side characters held more power and potentialcompared to him.\\n\\n\r\nThe first few episodes were bearable, but as they fought more battles, I began to see the incompetence within him. The others all wield power and are powerful as they should be, but the protagonist was disappointing. Sure, the power of the Red Dragon is impressive and all, but that's literally all he can do. This brought a distasteful feeling towards the anime even though the battles seemed full of hype and excitement.\\n\\n\r\nI was really disappointed with this anime and could not even bring myself to finish it. I stopped at episode 10 and didn't bother to continue it. I'm surprised I even made it this far, actually. In addition to the main character being incompetent, he also made rather foolish decisions that anyone would cringe over. I really could not believe he had such thoughts and delusions and decided to drop the anime. I doubt I will be continuing it anytime soon.\\n\\n\r\nThe openings and closings for this anime are very good. That was the only thing I looked forward to,",
            "date": "2015-10-09T07:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 200824,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4924886.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/yumekix",
                "username": "yumekix"
            },
            "url": "https://myanimelist.net/reviews.php?id=200824"
        },
        {
            "content": "Story: the story was generally confusing. Like who was doing what, where was everyone. The story seemed to be a victim of overthinking-syndrome.\r\nThe art would have been alright if it weren't for the CGI dragons. It was jarring and took from the enjoyment. This contracts to Madoka Magica, where the differences in the styles actually complimented each other.\r\nThe sound - well, the OP was the most redeeming part of the anime. That and the art for it.\r\nCharacter - I actually preferred Lou and some of the other background characters because most of the other mains had flat personalities.\r\nI ended up watching the entire thing purelyout of curiosity. It wasn't the worst, honestly.",
            "date": "2015-10-28T10:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 202156,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2406947.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/CrimsonBlazee",
                "username": "CrimsonBlazee"
            },
            "url": "https://myanimelist.net/reviews.php?id=202156"
        },
        {
            "content": "I honestly can't see why this anime garnered so much hate.  It's actually pretty engaging and I found the characters to be pretty interesting I like how it feels like a wuxia novel with the story centering on One big journey. Ibuki has a power that really not common at all : he's been cursed by a powerful red dragon and must kill his friends in order to gain great power.  It would of been best if he only had to use it once or twice since it can get depressing to see deaths that could of been avoided\\n\r\n   The music is a fun listen and compliments the action scenes quite well. My biggest complain with this anime is how one of the members of the group is a serial killer and they never find out about it. It annoying to see her continuously kill people and get away with it. Also, this show really could of used a season 2 . It had so much potential but bombed due to immense hate.",
            "date": "2017-02-09T13:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 240240,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4374209.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lazyking88",
                "username": "lazyking88"
            },
            "url": "https://myanimelist.net/reviews.php?id=240240"
        },
        {
            "content": "Guessing from reading other people's reviews and opinions on this anime, some must be thinking. 'Really? A seven? It was so bad.' Well, this is an unpopular opinion review. I think that this anime is okay. Then again, as long as the quality, not consisting of 200+ episodes and the plot are okay, I'll take it.\r\nStory (7/10):\r\nThe story is pretty basic, a young king receives a power from a dragon, blah blah blah. To me just because it is a basic idea doesn't mean it isn't a good story, it's just not as unique as most stories. \r\nNo one pooped on Kaichou we Maid-sama foralmost having the exact story as Special A, actually Kaichou wa Maid-sama has a higher rating than Special A. I got a little off topic. Anyways, if you're saying that this story is really basic and 'not interesting'. You better have given Kaichou wa Maid-sama a bad rating too. I'm just kidding, both SA and Maid-sama were good and Choas Dragon is okay too. That is the point I'm trying to explain.\\n\\n\r\nArt (9/10) \\n\r\nArt 2015: (7/10):\\n\r\nI gave the art 2 scores. The first one is the rating for my opinion on art and the other is my opinion because it came out on 2015, the quality of the art and style should be really good by now.\\n\r\nMy own personal rating is high because I have been re watching Prince Of Tennis, CardFight! Vanguard season 1 and Hunter x Hunter. They don't have as good style or art quality as Chaos Dragon.\\n\r\nThe 2015 is a 7 because the art is a little framey. Framey isn't a word, but the meaning is that you can see the different frames and the difference between frames. It isn't as smooth as I expected from a 2015 anime. Some parts run smoothly, but some don't, the quality is inconsistent.\\n\\n\r\nSound (7/10):\\n\r\nThey used the same song for the opening and ending... Why? Opening and ending should be different, I thought that the episode just started when it was ending. They aren't helping someone with terrible memory and terrible sense of time. I cried ever single time I was trolled my the opening and endings.\\n\r\nThe rest of the music is decent, nothing that really stood out to me. Don't starts saying that since the music wasn't memorable means that sound is bad. It isn't good or bad, it is decent, like 70% in your report card.\\n\\n\r\nCharacters (7/10):\\n\r\nThe only thing that bothered me about the characters is that Ibuki looks like a girl. I skim through the subtitles since I don't read fast and blurt out he, she and the.  I missed that Ibuki is actually a boy. I know Ibuki was a boy name, but he looks so much like a girl even his eyes are the style of an anime girl's eye. Also the fact that he kind of dresses like a girl.\\n\r\nThe characters that brought the score up are Swallow and Eiha. Swallow and Eiha are the cool characters of this anime and the ending made me so mad. (I'm trying not to add spoilers).\\n\\n\r\nFinal Comment: Chaos Dragon wasn't that bad and not really good. It got a 70% out of me and I usually give anime a fair score ignoring all the expectations, popularity and the bad comments that everyone makes. This anime has potential to have a second season because there was a cliff hanger in the end of it. I wouldn't mind watching a second season, if all the main characters and plot aren't thrown out the window.",
            "date": "2015-09-20T11:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 199060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4477882.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/StigmaStarzzs",
                "username": "StigmaStarzzs"
            },
            "url": "https://myanimelist.net/reviews.php?id=199060"
        },
        {
            "content": "Chaos Dragon was SOOOO Frikin' bad that I just had to drop it half-way through. The plot is incredibly bad and generic, the artsytle is way too linear and every episode was just a little more of the exact same thing over and over again. I swear I almost fell asleep in the second episode. The characters suck ass, they don't even make sense and the animation, oh my god the animation is super basic with some shitty 3D models arround. I swear when I saw this thing's trailer i just couldn't help but save it in my \"to watch\" list but GEEZ when itcame out it was SO disappointing! But well... I guess that this shit right here is all you can expect from an anime based on a deck game... If you're reading this, don't even waste your time trying it out. It has a pretty cool opening tho",
            "date": "2015-12-17T11:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 205798,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205798"
        },
        {
            "content": "High expectations and a huge disappointment...\r\nStory: 3\r\nBy the end of the series I think I finally got the story, which is in fact not a good one. This Red Dragon destroyed Nil Kamui, a small country which is now invaded by Kouran and D'natia, the neighbour countries. Ibuki, the MC, holds Red Dragon's power: every time he kills one of his friends, he gains great power. Now, you see, this idea is pretty shitty because:\r\n1. It creates pointless drama\r\n2. It predicts the death of the other characters\r\n3. At some point, it becomes annoying because you see the same thing happening over and over again.\r\nBack tothe story. Ibuki then gathers a bunch of random people, whom he later calls \"friends\" to help him become king and win the independence of the country. Not original at all. As this is a spoiler-free review, I'll tell you only this. Things get really complicated.\\n\\n\r\nArt & Sound: 6\\n\r\nSpeaking more about the art, the fight scenes are bad. It's like, you don't get a lot of continuous movement, just short scenes one after another. Also, the background and the characters are common. Nothing special, no distinctive features.\\n\\n\r\nCharacter: 2\\n\r\nI don't even know where to begin. It's like all the characters are bricks in the wall. They are all ready and willing to sacrifice their lives for Ibuki. BUT they don't even know, if he is going to succeed in becoming the king. They all say \"Ibuki, kill me\" like what the hell, I'll give you this life, I can have another one right away. I get it. This anime is also a drama, but it's stupid to see this \"Take my life, please!\" \"No, you're my friend\" every god damned episode.\\n\\n\r\nNow I'll focus more on Ibuki. He's a 10 years old kid who still sees the world coloured in pink. Naive. Easily deceived. He says he wants to protect everyone, but ends up killing his friends. Again, I get it. He's plays the role of the victim. He bears a curse, he lost his family etc. BUT the fact that there was no character development is just stupid. He had the potential to become a good character but failed. \\n\\n\r\nHowever, the only character that I like is Swallow. He's different. I think there's an episode or half an episode about his past which is really good. He had a tough childhood which gave him the strenght to move on and try to live his life the best way possible. Bonus points for this one.\\n\\n\r\nEnjoyment: 5\\n\r\nNow I've seen that many people compare this to Akame ga kill. No. It's true that almost all the characters die by the end of the anime, but at least the characters from Akame ga kill had meaningfull deaths. Those deathes gave me a sad feeling. They died fighting for a major cause, they didn't offer their lives to a 10 years old boy they had just met. This \"kill your friends to save th e world\" concept is just stupid. Moreover, the ending is so open, so.... should we expect season 2? Please, no.\\n\\n\r\nAnother thing: the action is pretty rushed, characters show up and die so this anime gives no feelings to the audience.\\n\\n\r\nOverall: 5\\n\r\nI know I said only bad things, but this anime is mediocre. Some of you might enjoy it more than I did and give it a 6. It's not horrible, it's just there are far better anime so don't waste your time on this one.",
            "date": "2015-09-20T10:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 199045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3512445.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rawrzz03",
                "username": "Rawrzz03"
            },
            "url": "https://myanimelist.net/reviews.php?id=199045"
        },
        {
            "content": "I don’t think anybody really thought for even a second that Chaos Dragon was actually going to be good when they saw the team attached to the project. The plot is pretty simple to explain, but that’s actually its biggest problem. It’s so simple that Chaos Dragon tries to distract us from that fact by over complicating everything to the point that we have nothing to focus on, and when you do, you’re too embarrassed to spell it out for the audience. There’s this red dragon guarding this generic fantasy land who has gone mad, and the only one who can stop him is thisroyal boy who can use the dragon’s power at the cost of a beloved one’s life. He gathers a crew of RPG rejects and goes on a journey to hunt the dragon whilst trying not to use his power. And…that’s it. That’s literally all there is to the story with no attempt to spice it up whatsoever, unless you count the boy’s obsession with certain females that are so creepily handled I’d rather not dwell on them. Well, that’s not entirely true. Fucking up even the most basic things is kind of a spice in that it takes a specific kind of talent to do that. I know Silver Link animation is never good, but even by those standards, Chaos Dragon looks like ass. The character designs look like something you’d find in the trash bin of a fetish shop, the action is incoherent and poorly choreographed, and…well…the visuals look like ass. When your all-powerful red dragon is basically a CG monstrosity that would fit right in with a Passione anime or the miniseries adaptation of The Langoliers, you know something has gone wrong. When you have every other visual disaster share the same screen, I speak no hyperbole when I say that watching RWBY would be less taxing on the eyes. And it’s not like the writing helps, considering it’s as fucking standard a fantasy quest as you can get, except with most of the dialogue consisting of boring exposition dump after exposition dump. Chaos Dragon is not, and I can’t stress this enough, NOT the least bit memorable in its badness at all. Very little actually happens in the show, and whatever does happen is buried under so much bullshit. I know some people got enjoyment out of pretending that Urobuchi’s character likes to grab people’s boobs, but I wouldn’t even know which character he’d written if I didn’t look it up on Wikipedia. And any anime that requires outside knowledge you couldn’t possibly get from the show proper to understand seriously needs to go into the corner and think about what it’s done. So in case you didn’t understand all that, no I don’t recommend Chaos Dragon at all. In fact, it’s one of the few anime where I’d go so far as to say you’re wrong for liking it, which is no mean feat given how little I care for what the fanbase thinks. It’d at least be better than that shitty Arslan adaptation if it wasn’t for its utter disinterest in trying to entertain people, which makes me wonder, why was anyone even interested in making a public spectacle out of the D&D games that certain industry people do in their spare time anyways? How exactly is that sort of thing appealing to anyone not within the circle? Might as well introduce the Yu-Gi-Oh card game to the homeless while you’re at it. Chances are one of them has an interest in foreign card games that he can use to win big and get out of his sorry state.",
            "date": "2017-05-02T14:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 246843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6113787.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TheFlashmaster",
                "username": "TheFlashmaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=246843"
        },
        {
            "content": "So I got really pumped looking at who was involved in making this piece.... and then got disappointment.\r\nAt the beginning, I thought, \"oh wow this is a new idea\" and I was in for a trip that would make my heart break apart at the seems. I was wrong since the story that followed it was nothing like the opening episodes of the anime. The story was bland and rushed, there was all the character development happened in the last episode of the series... the only good thing about it was the art.\r\nThe anime itself would have been a bit more enjoyable if there hadbeen more episodes? To spread out the story a bit and give the characters some time to make themselves less minor. They introduced a lot of characters but didn't really expand on them, even the more major characters. Some of the major characters, like Lou, they ignored completely and made them into a sort of flat character even though her original personality is somewhat appealing.\\n\\n\r\nIf you want something pretty to look at, then this anime is definitely up there with character designing and choice of colors. As for a story, it doesn't amount to much.",
            "date": "2015-12-10T00:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 205162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1887552.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Minster122",
                "username": "Minster122"
            },
            "url": "https://myanimelist.net/reviews.php?id=205162"
        },
        {
            "content": "okay, SO. Not the best anime's ive ever watched.\r\nWe start out completely thrown into a battle, and the main dude \"Ibuki\" the one who is supposed to be crowned king after his family's death must kill the ones close to him to protect the rest. LOL WHAT?? that is a terrible pretense, what a life of sadness and loneliness.\r\nNext, we begin to meet all these new characters that are in search for the red dragon, who went \"mad\" and I dont even feel like it was that long of a time they were all together (perfect strangers at first) and yet they talk about allthese \"bonds\" and stuff. LOL WHAT??? \\n\\n\r\nIbuki, in the very beginning to save the ones he cared about had to kill Mashiro, who was apparently the closest person to him.. and then the next thign you know, these \"new\" Friends are suddenly also equivalent for sacrifice. LOL WHAT???? \\n\\n\r\nLiterally, all i can say is LOL WHAT??? simply because I was lost, the story line had no structure, there were dragons, magic, seals, idk what else, ZOMBIES, WEIRD MONSTERS. yeah. idk. I just dont.",
            "date": "2017-08-24T16:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 256191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=256191"
        }
    ],
    [
        {
            "content": "STORY: 3\r\nThe story is about Red Dragon, the guardian diety of Nil Kamui had gone mad and destroyed Nil Kamui, leaving it to be extremely weak as other nations slowly gain more and more power.  Nil Kamui lost its independence and is struggling against the big countries D'natia and Koran to maintain a balance of power. \r\nAfter a certain event, a group of characters from Nil Kamui, D'natia, and Koran band together to find Red Dragon but each individual has a different desire in their quest. The main character, Ibuki, is given the power of the Red Dragon where he can kill anyone ifhe offers the life of someone close to him. As the story progresses, more things become unveiled about each nation and the true mission of the characters.\\n\\n\r\nAt first, the story seems interesting with an emphasis on politics and a quickly received idea that anyone can die at anytime. However as it continues, it becomes a mess. There is no build up to events that should be climactic and the initial plot completely changes from side events. Things just happen without explanation and there are numerous things to question about the world, the nations, and the characters themselves.\\n\\n\r\nCHARACTERS: 5\\n\\n\r\nIbuki has an interesting start being a young boy, an heir to the throne while possessing the power of Red Dragon. He goes through a lot in the first episode as he has to sacrifice the ones closest to him to reach a certain goal. Although he had a lot of potential, it was utterly wasted. He continues to whine through the entire anime and never gets developed except in the last few minutes of the last episode.\\n\\n\r\nEiha is Ibuki's guardian who is infused with a demon and is constantly looked down upon from everyone. She serves to be Ibuki's guardian after she made a promise with one of Ibuki's closest friends but she doesn't really have personality or appealing qualities. Although she had an interesting premise like Ibuki, she does not get any build-up nor events that make her shine. She stays linear but the writers try to make her have a bigger role as the story progresses even though it is poorly executed.\\n\\n\r\nSwallow is Black Dragon Knight from D'natia who is a part of Ibuki's group but shows to have a secret as the story goes on. He has been cursed as a child with everything breaking as soon as he touches it. He was abandoned by his parents and lived in isolation until he befriends a girl named Meryl. He is definitely the most intriguing character with his curse and his views on people and life. Again, there is not enough development for him, everything gets rushed.\\n\\n\r\nLou is an assassin from Koran who is a part of Ibuki's group but instead of finding Red Dragon, she wants to kill it. She has a special blade which was passed down and constantly speaks to her with Lou referring it to it as her \"lord\". She is a vicious fighter and has a seductive personality while fooling everyone. She is one of the most mysterious characters in the show but nothing really gets answered regarding her role.\\n\\n\r\nThere are wide array of other characters in Chaos Dragon but none receive any development that they should be getting. This is problem when characters die because the audience didn't feel enough attachment to the characters to make the deaths have an impact. There's a big issue with the introduction of characters in the middle of series that just make things more confusing and uninteresting.\\n\\n\r\nART: 7\\n\r\nThe lighting and the scenery are absolutely gorgeous. The character designs are also very well done and unique. The opening and ending are both great. The only reason I did not give this a higher score is because of the CGI. The CGI is absolutely horrible. Red Dragon and other things in the series look so strange with the CGI and it really takes away from everything else. Overall, the art is good.\\n\\n\r\nSOUND: 8\\n\r\nI would personally say Chaos Dragon has the best opening in all of the summer anime and probably the best ending as well. Both are REALLY good. I also enjoyed some OSTs through the series and even the classical music in the later half. The last scene in the series has another great song sung by Natsumi Kon, singer of ISOtone - the first opening. The voice acting is also good, nothing to really elaborate on.\\n\\n\r\nEnjoyment: 6\\n\r\nThe episodes were inconsistent for me. Some were good, some were boring, and some were annoying. I felt frustrated at times with the story and the characters, each revealing things that completely go off track and leave viewers confused. I wish there were more action scenes because the fighting animation presents them really well.\\n\\n\r\nOverall: 6\\n\r\nIs it worth checking out? Yes. \\n\r\nIt does require patience at times because of the quick-pacing and questionable plot points but the music is great, the animation is good, but the story does get convoluted.  I really wanted to like this series more but unfortunately, it did not live up to my expectations.\\n",
            "date": "2015-09-19T12:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 198921,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3578123.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OcularAMVs",
                "username": "OcularAMVs"
            },
            "url": "https://myanimelist.net/reviews.php?id=198921"
        },
        {
            "content": "Why not asking the dragon you have inside where it is, but instead going into a risky journey to find it having no idea? Well, that Chaos Dragon! A series that broke all my expectations since first episode. \r\nSo here I am writing a review of it for those who haven't watched it yet and, in some way, want to do it. It will be quick and painless.\r\nStory: 3/10\r\nIs it me, or everything that happened did it freakingly fast? Also, the story wasn't quite interesting to me. It's terribly simple and repetitive (you'll see), and in a super fast pace and nonsense. Good for avideogame (from which this anime comes), but not for a series.\\n\\n\r\nArt: 2/10\\n\r\nHorrible 2D animation and terrible 3D. The dragons were ugly as hell and poorly animated. Models were poor detailed, as it were drawn by a child. Battle animation is quite poor. Do you want me to tell more?\\n\\n\r\nSound: 4/10\\n\r\nNothing to highlight. That's the problem.\\n\\n\r\nCharacter: 4/10\\n\r\nMost of the characters have no development, and those who do it turns to be quite pathetic though. The main protagonist is the most developed one, but his past is quite simple. Also, as I said, terrible models. \\n\\n\r\nEnjoyment: 2/10\\n\r\nI only finished this anime to getting it out of my \"watching\" list. I wasn't really interested on it (well, I actually was before watching it).\\n\\n\r\nOverall: 4/10\\n\r\nDo watch it... when you don't have anything else to watch (in that case try to find something else). It's not an anime that will blow your mind. It could, but not in the right way.",
            "date": "2015-09-22T05:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 199206,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3790693.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DenkiManiac",
                "username": "DenkiManiac"
            },
            "url": "https://myanimelist.net/reviews.php?id=199206"
        },
        {
            "content": "So Chaos Dragon....... Hmph let me paint a quick picture. Me sitting on my comfy chair reading a list about the upcoming animes of the season. An anime by the name Chaos Dragon catches my sight. Why someone may ask?  Well the name has gravity. Then the description. I country fighting for independence with dragons, magic and stuff. All good s**t, right? Well it's a pretty hard left turn from here onwards. From the few other reviews I read you could say it was borderline atrocious... and it was bad thats not to argue about, but how much?Story 3/10\\n\r\n\tAs a said the premise was quite good. Promising some political friction, dragons (I like dragons) and many awesome possible themes. What happened! What was presented: a really shallow plot with next to none world building. There was an invasion, but do not expect explanation about it. And what about the countries participating..... nothing, again. Well the dragons then? Hahaha.\\n\r\n\tPersonally the pacing did not bother me. Yet it lacked urgency and could have been better. Next is complexity - none and plausibility - oh where to begin. Everybody is throwing themselves to be killed like some damn messiahs. The relations between the opposing countries make less sense than an epileptic auctioneer. Without spoiling it was like the Warsaw Pact and Nato cooperation in Afghanistan or Vietnam. \\n\r\n\tThe conclusion of this charade is fitting for it. There was this tiny small moment that was bad itself, but at least it gave the impression that they were trying before they fraked up that too. Yep the plot was immensely disappointing.\\n\\n\r\n                                                  Characters 4/10\\n\r\n\tLet's stars with Swallow Cratsvalley. Or one of the few good things in the show. Good backstory, nice attitude he should have been in a better anime.\\n\r\n\tIbuki. If there was one thing that hurt the anime for me it was this little cancer. He is one of those retarded protagonists who would sent a whole nation to hell, because he is \"good\". No personality whatsoever and it's, it's...... just bad.\\n\r\n\tEverybody else are there just so some of them could be killed and make the anime deep and thought provoking. Yet another miserable fail,  because I did not care about any of them.  Here is also the point to talk about the character of the different dragons. Hahahahaha (what did you expect)!\\n\r\n\tExcept for Swallow Overall they characters lack presence, suffered heavily on personality, had little to nine backdrop and development.\\n\\n\r\n                                                      Art 5/10\\n\r\n\tThe art is unsatisfactory generic with some bad and a few good moments. Believed it or not I liked some of the fighting scenes.\\n\\n\r\n                                                     Sound 4/10\\n\r\nForgettable themes with dragons that sound worse than a five year old making dragon sounds.\\n\\n\r\n                                       Enjoyment and Conclusion 5/10\\n\r\n\tOverall It was uninspired, yet  it's not like you can't get any enjoyment out of it, but I wouldn't really recommend it.\\n\\n\r\n                                    Mine Overall Score 5/10, but it's more like ->\\n\r\n                                     ->Thought out Overall Score 4,125/10\\n\\n\r\n \tI may be a bit harsh here, but it's just the way I review(but I don't mean bad). Experiences may vary on viewer so don't let my semi- I hope logical rant discourage you from giving it a try! :)",
            "date": "2015-09-19T12:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 198927,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4058989.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/EvilPenguin95",
                "username": "EvilPenguin95"
            },
            "url": "https://myanimelist.net/reviews.php?id=198927"
        },
        {
            "content": "Chaos Dragon: Sekiryuu Seneki, cool title huh? Meh too long. The first two words would have fit the the anime already in my opinion. CD was nice, but not interesting enough for me to keep my eyes on the screen. I have been holding my phone while using Disqus and other sites the whole time I have been watching the series because even if I don't focus on what I was watching I knew that I won't be able to miss anything important. Okay so let's move onto the review.\r\nStory 6/10\r\nThe story was pretty much easy to predict, like what's gonna happen and who's gonnadie. There was really nothing that made me gasp on a scene or not blink for like 5 seconds or so. \\n\\n\r\nCharacter 5/10\\n\r\nThe MC was so-so. Like he has the normal reactions a human would have, cry whenever his friends die. Refusing to hurt those who are precious to him and gets scared. It wasn't really interesting its like the same old anime shows wherein the MC gets to go on an adventure with friends and they get hurt and then they get to be successful and viola! Ends. \\n\\n\r\nLou, however was the one who is kind of intriguing. It would be better if the series focused on her more. Like why she became like the person she is now, (even though it was shown on the mid part of the anime but it wasn't enough).\\n\\n\r\nOverall 7/10\\n\r\nIf you have time to spare and just looking for a random anime to watch then Chaos Dragon is okay, but its not good if you'd like to binge watch it because it gets boring somewhere so you gotta give it a rest before finishing the whole series. It isn't that much of a disappointment as what other have said (for me).",
            "date": "2015-12-26T11:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 206860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/508645.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CrawlingDolphin",
                "username": "CrawlingDolphin"
            },
            "url": "https://myanimelist.net/reviews.php?id=206860"
        },
        {
            "content": "The story of a boy that lost your parents, home, friends, kingdom and enters in an adventure trying to recover the kingdom from the his enemys. This is a tipical and common introduction to historys, and can lead in a good adventure show, but in Chaos Dragon this doesn´t happen because everything is a failure.\r\nThe characters and mainly de protagonist are boring and bad, and the worst is that the anime try to make you feel sad for them. The anime has some death that try to disturb you, making you feel sad about the character that died, but you can´t because you can notlike anyone. People just appear or appear very little and the anime tries to make in those few time you get attached to them and it just does not work. Because of this the deaths are idiots, superficial and nonsense.\\n\\n\r\nAlong the plot much is thrown at you without explanation as if it were your duty to understand, and the animation is terrible, it doesn´t work well in fight scenes and make the show static, the CG are the worst i´ve ever seen. Oterwhise the soundtrack are good, but it´s the only thing whit quality in this show.\\n\\n",
            "date": "2017-01-26T13:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 239172,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3748117.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Soupa-San",
                "username": "Soupa-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=239172"
        },
        {
            "content": "Wait....What?\r\nIs that how this anime is going to be?\r\nYou producers are evil....EVIL I say!\r\nSo to summarize the story:\r\nThere are two countries fighting for supremacy; Donatia and Kouran.\r\nIn the middle of all this fighting is an island country Nil Kamui which has lost its independence. In each country there are guardians; including Nil Kamui where the Red Dragon has gone berserk.\r\nSo far so interesting? Yes?\r\nWhat gets confusing is after this is explained in the first episode.\r\nSo we find out that there is a constant war due to the conflict between Donatia and Kouran and the little island Nil Kamui is trapped with their guardian dragon gonecrazy\\n\\n\r\nHow can it get confusing? Unfortunately it can...\\n\\n\r\nAs you can see the storyline is simple:\\n\r\n->war between countries\\n\r\n->the third country is in between the two\\n\r\n->usually the third is powerless compared to the other two\\n\r\n->the main character appears and somehow gets caught up in the conflict\\n\r\n->the main character goes on a journey to solve the conflict\\n\r\n->the conflict is solved \\n\\n\r\nIs what YOU MAY think MIGHT happen; I mean its war between countries with a country IN BETWEEN the two! You would expect some hero to rise.\\n\\n\r\nHOWEVER, this anime goes to a whole new level. A more personal level.\\n\\n\r\nI say this because of the characters in the anime; which I will refrain from explaining as it will spoil the series.\\n\r\nThe main message from this anime (In my opinion) is of how human nature works. This can be clearly seen in the last episode and throughout the series. How and why? You can find out by watching\\n\\n\r\nI'm trying not to spoil the story as much as possible but if you're interested in the series give it a try. Some may get bored halfway through (Trust me, I went through that phase too) But I guess it was worth the wait?\\n\\n\r\nHowever I was NOT fully happy with the ending. It was pretty forced from my opinion. Maybe the anime would have been a little better if the producers didn't have a limit of 12 episodes. \\n\\n\r\nBut none the less I will somewhat miss this series. It had a pretty decent story but halfway through the series it kind of lost the whole meaning of the story and the ending seemed kind of forced.",
            "date": "2015-09-19T06:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 198887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=198887"
        },
        {
            "content": "You know what... this series gets a pretty bad wrap for what I consider nonsense reasons. I am REALLY glad the trailer had a badass metal thing going on so I gave it a chance because it was actually pretty refreshing. Don't let the haters dissuade you, this is definitely worth a watch.\r\nStory: 8/10\r\nThe story is actually quite interesting. You have Ibuki who is given the power of the Red Dragon (to kill someone precious to him in order to kill someone else). You would think this would be fairly common in anime but this is the first and only time I've ever seen thisconcept explored. I know metaphorically it is explored through hard choices that get you to the same place but never has it literally been a life for a life. I think this is pretty cool. Also, the story may have a few issues (killing Red dragon gets completely sidetracked in the middle) but it all flows logically. The characters follow a logical path, the 3 sides are all represented clearly and their goals make sense and on top of that the story builds to a final battle and there is a concrete conclusion (if not a lil sappy and a bit open ended). I don't want to spoil it so I can't go into much more but trust me there are lots of twists and turns and the story develops well.\\n\\n\r\nArt: 8/10\\n\r\nIt looks pretty good. Unique character models, the SG isn't done excessively and isn't too jarring and the art does a good job of setting the mood.\\n\\n\r\nSound: 8/10 \\n\r\nIn episode 1 when the intro theme kicks in (during a badass scene near the end) I knew this anime was going to be awesome. The fighting sounds are fine, the music is solid and the voice acting is done well.\\n\\n\r\nCharacter: 6/10\\n\r\nThis is the weakness of this show. There isn't enough character development (this is one where there is a lot of false character development in the form of tragedy instead of true evolution). Another thing that bugs me is that characters seem to gain powers over time in convenient ways (this is hardly something unique to this series). I will admit there are a lot of tropes going on with the characters but the angles they take are unique (a character that breaks anything he touches is pretty interesting) and most of the characters are done in such a way that you will like or hate them. Also. people will die and I appreciate that.\\n\\n\r\nEnjoyment: 7/10\\n\r\nI liked it. It felt a bit short (is that a good thing?) but before I knew it there were only a few episodes left. I liked the unique angles and the direction they took the show. The characters were appealing and it wasn't afraid to confront death (I mean hell the outro of the show basically had a \"kill counter\" that crossed out in red an of Ibuki's comrades that died with a special X for those dying that episode). Little things like that really enhanced the enjoyment.\\n\\n\r\nOverall: 7/10\\n\r\nIt was good. I have no idea why people disliked it so much (and I'm not going to waste my time finding out). This one is good. You will like it if you don't think too deeply and just accept that it is fairly unique and tells a complete (if not a bit short) story. Enjoy!",
            "date": "2016-08-08T23:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 226289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=226289"
        },
        {
            "content": "Well, this is one of those anime that one begins to see so excited, it sounded great, but eventually ended up staying in something simple and repetitive.\r\n[b]Story (3)[/b]:\r\nThe story in general is rare mix so much that in the end can make you lose track of everything, if there is one really.He started from a good base, but extended to secondary and alternative things that made no sense whatsoever. I do not think it has been a good story, the beginning was good, and the end as well, but the rest of the plot is boring.\r\n[b]Art (6)[/b]:\r\nThe art takes an approved because it is good,it is also not the best I've seen in my life, but has a more than pleasant colors and some designs that I think is very good. Perhaps the mistake I see, is not taking advantage of this resource of everything to make a better anime Chaos Dragon.\\n\\n\r\n[b]Sound (7)[/b]:\\n\r\nThe soundtrack of the anime is the highlight from my point of view, has several issues that are very good and can get to thrill, I especially like the opening and ending themes and some others. I notice that in certain scenes have failed to settle the score correctly, because they did not fit with what was happening, or did not reach thrill.\\n\\n\r\n[b]Character (2)[/b]:\\n\r\nThis is one of the things that's bothered me about this picture is that, having characters who could work perfectly and give much to talk, they were simple flat characters, which do not show you anything beyond what is name. What I liked even less, is the attitude that leads the protagonist chapter by chapter, has made me nervous throughout the anime, and sometimes I gave up wanting to die, he could become a little obnoxious.\\n\\n\r\n[b]Enjoyment (1)[/b]:\\n\r\nI can not say it's an anime you liked me, nor indeed has managed to entertain me during its chapters. The only more or less interested me were the first and last chapter, the rest were bland, boring and with a plot that revolved random nonsense, to the point of not even knowing what was happening. The only word to define my enjoyment encounter with this anime is: Boring.\\n\\n\r\n[b]Overall (4)[/b]:\\n\r\nIt was not a good anime for my taste, I wanted to give a chance to the end and good, if they take a second season I will give it another try just to see if they improve on something. I especially do not recommend for those spectacular and action-packed anime wait, because practically there is not.",
            "date": "2015-09-19T12:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 198922,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3620541.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OnegaiAnime",
                "username": "OnegaiAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=198922"
        },
        {
            "content": "some spoilers\r\nThis show is alright. The one thing that really bothered me however is how nearly every character literally wants to die....for terrible reasons as well. This show pretty much would have been great if every character wasn't attempting to beg the mc to kill them.\r\nstory: 6\r\nlike i said before, the storyline is basically someone begging the mc to kill them so the mc can kill someone else. The story could have felt alot more like a tragedy if the characters had acted differently. MC ofc does not want to kill them, but their absolute willingness to give up their life just kind of becomesirritating rather than sad.\\n\\n\r\nart/sound: 8\\n\r\ndecent art/sound, no complaints here\\n\\n\r\ncharacters: 6\\n\r\n90% of the characters want mc to kill them or are the target. Only good character is Lou pretty much, she is the only one who thinks things through and really attempts to do something for herself. Hien is mentally ill and should have been killed in episode 0.\\n\\n\r\nEnjoyment: 7\\n\r\nBesides the faults I've listed the show is still watchable, so my enjoyment would probably have been good.\\n",
            "date": "2015-10-13T17:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 201189,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695065.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nekotan7",
                "username": "nekotan7"
            },
            "url": "https://myanimelist.net/reviews.php?id=201189"
        }
    ]
]