[
    [
        {
            "content": "First of all, I'll try not to swear too much. So, is'nt it always a sign of quality if an anime makes you have strong feelings about it? I think good animes are the ones that make you relate and be truly interested in the characters, loving some of them, hating some others, and Ichigo 100% certainly succeeds in these things.\r\nOkay, I have seen many echhi/harem animes and they all have their similarities, but never has the protagonist been even nearly as retarded as in Ichigo 100%. Usually ecchi boys have these problems like not being able to decide between girls, or thinking about sexand female parts for 99% of their time only to freak out if a girl gets close to them. They also tend to posess only one argument in a conversation, which is to repeat the girls name over and over: \"Ni-ni-nishino-san?\". Junpei-kun from Ichigo takes these problems to a whole different level.\\n\\n\r\nThe main thing that annoys me in the setting is that all the three girls are shown as truly equal, and you really can't tell which one Junpei likes the most, as his opinions seem to change in split-second mode. In most of the other harem animes I've seen, you can tell the favourite girl of the protagonist even though he can't decide between her and a few others, but in Ichigo 100%, there really is'nt a main girl. Everybody can tell that in Rosario+Vampire, Moka-san is the one Tsukune likes, and the other ones are not nearly as important. But in Ichigo 100%, Junpei's favourite girl seems to always be the one he is not with at the moment.\\n\\n\r\nThis leads to a situation where Junpei spends time with all the girls equally and hurts all of their feelings. For example, he first spends some great fan service -time with Kitaouji thinking only about Toujou. Then, leaving Kitaouji behind he meets Toujou only to begin thinking about Nishino, and of course hurting Toujou in the process. And all the time the viewer is wondering: \"What the **** is wrong with this guy?\".\\n\\n\r\nWhen Junpei finally ends up saying: \"I love you, but I love others too!\" and when he cried to his friend saying \"I'm so unpopular\", I was already carrying my laptop to the nearest industrial shredder. There was about a million situations where I was just staring at the screen of my laptop shouting \"Answer her, you f****** retard!\", shaking my whole computer in despair or watching with my eyes closed not being able to understand what he does to these girls.\\n\\n\r\nOkay, I've focused way too much on Junpei and his problems, but that's really the main thing I got from this anime. It's like the script writers have intentionally created a character, who you'd only want to beat up if you'd see him. Keitaro from Love Hina is a really good guy, Yukinari from Girls Bravo is okay, but Junpei really is someone I only wanted to hate.\\n\\n\r\nBut well, this really is a decent anime. Really. The animation is quite good, most of the characters are cute, especially Toujou, and I like the school club setting, although it's pretty used nowadays. The ending theme is also quite nice. Eurodance and strawberries, what more can you ask?\\n\\n\r\nOverall, if you like to watch harem-anime thinking \"I'd be way better a boyfriend for her, her and her\", this one's definately for you! If you hate watching popular retards making girls cry, stay far far away from Ichigo 100% ^^\\n\\n\r\nWhoa, maybe this genre is not for me :D",
            "date": "2009-05-08T03:57:00+00:00",
            "helpful_count": 208,
            "mal_id": 14871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/106462.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Atharil",
                "username": "Atharil"
            },
            "url": "https://myanimelist.net/reviews.php?id=14871"
        },
        {
            "content": "Never thought I'd be writing a review for the Ecchi genre. I'm not really the Ecchi type, although there are times I might watch them. I'm more of an action/supernatural/horror type, so let me say this first before continuing:\r\nIf you're a real Ecchi fan, and all you're looking for is Ecchi, you may not find exactly what you're looking for with this series. Don't get me wrong, there is plenty of it (probably much more than it sounds), but even for the occassional watcher like myself; it didn't feel like it was the real foundation for this series. It does seem to cater to bothguys and gals as its mostly based on relationship. Either gender may actually find appreciation for it. If you're looking for some huge story to open up later like the typical shounen series where there is normally some much bigger plot, you probably will not enjoy this as much, if at all. I think I happened to watch this one at JUST THE RIGHT TIME, as I felt very satisfied with how it went and how it was written.\\n\\n\r\nStory/Plot: 7\\n\r\nWhere's the story? You're looking at it. It's pretty much as the Synopsis says and what the genres indicate; your typical harem (although there's so much more to it). Why a 7, though? This series wasn't created for pure story conception, but is based more on character development and the character and story development compliment each other nicely. As far as I'm concerned, it couldn't have been handled any better, and it was handled rather nicely. It does navigate through the end of Middle School on into High School years, so there is some of that story progression taking place, although a lot of the story advancement is through plot devices; not the kind that leave plotholes, however.\\n\\n\r\nArt/Animation: 6\\n\r\nIt's not a secret. This series isn't as visually tantalizing as a lot of the others out there, especially with the ones from the same year. A very visually pleasing anime is always a big plus, but the quality here doesn't hurt it, either. It didn't seem like this production was given that big of a budget, and its a real shame because it could have looked a lot nicer. The art and animation that was used does suffice given the fact it's not really ABOUT how good the art, or animation was. Sufficient enough for me.\\n\\n\r\nSound/Music: 8\\n\r\nI found the music to be very.. \"fun\". This is strange for me, seeing as how I'm not the typical kind of guy to really \"like\" anime music, although I'm coming around to it. The OP for this is simply awesome. It provides a lot of good memories and tends to help me remember a lot of those great times I had in my school days. The voice actors on this (japanese) were awesome, as well. I didn't once feel that a voice was out of place, and they pulled everything off quite nicely.\\n\\n\r\nCharacters/Character Development: 7\\n\r\nThis is where the main basis for this series lies: in it's characters. All of the characters are the types you might be able to find in just about any series, but not necessarily in one as fluent in relationships as this series is. The characters fit with this genre-type, most definitely and not one character is the exact same as the other, so there is plenty of diversity and differing interests and personalities. It's very interesting to see how relationships strengthen, or crumble a bit with certain actions throughout this series, as well.\\n\\n\r\nEnjoyment: 8\\n\r\nI enjoyed this series a lot. It was worth my time. If anyone has ever found themselves in similar 'situations' that take place in this series, you'll probably appreciate it just as much as I have, if not more. There were many times that I laughed until I drooled (I know it sounds gross, just emphasizing how funny it was). A lot of the comedy was based off embarressing types of occurences, but it certainly wasn't limited to just that. It didn't need some long drawn out story to please me, either. I was grateful for that, but I truly wish there was much, much more to it, or a sequel. That would make my day.\\n\\n\r\nOverall: 7\\n\r\nIt's a fair rating and it does represent how I enjoyed it, while still being a critic at the same time, however there really isn't anything rather negative to say about it. I think I'll go as far to claim that this series is truly underrated in probably a lot of circles, and this rating certainly doesn't overrate it, either. By the time you get to the end, you'll probably feel a sense of satisfaction coupled with regret for not catching it sooner, and perhaps the urge for more. If you came across this review and decided to give it a try, awesome. I hope you enjoy it as much as I did, and if not; sorry.\\n\\n\r\nSuggestion\\n\r\nI'd suggest watching this series, but also the other OVAs and such that are paired with this series. Jump Festa 2004 seems to mark the \"end\" in most respects, although it was produced before the series, itself.\\n\\n\r\nWatch Order 1\\n\r\nEpisodes 1-9, Ichigo 100% TV Special 2, Episodes 10-12, Jump Festa 2004, DVD Animation OVAs.\\n\r\nOR\\n\r\nWatch Order 2\\n\r\nEpisodes 1-9, Ichigo 100% TV Special 2, Episodes 10-12, DVD Animation OVAs, Jump Festa 2004.\\n\\n\r\n________________________________\\n\r\nAddendum (03/09/12):\\n\r\nI no longer use the scoring format this site offers and have not for some time. I do not consider a \"10\" to be in existence and have long since downgraded many of what I've scored to reflect this way of thinking. I have chosen to keep this review slated at an \"8\", although my list may begin to reflect this change regarding this title specifically in the future. If I ever find some time to heavily edit, or entirely rewrite this review after rewatching this title in its entirety I will do so in order to bring its scoring up to date. It may change based on how I feel about it after seeing it again, or I may feel strongly about it in the same way and keep the score as-is.\\n\\n\r\nI believe I can write something much better, but I still agree with the way this review was written as it presents a direct opinion and straight-forward evaluation while being completely devoid of unnecessary plot outlines, or spoilers. And that was my goal and sole purpose for penning it. Around the time period of 11/12/07 there were very few reviews on this site compared to today and many of them offered a little too much information and had become summaries instead of perspective so I stand by that decision. If something can pull your attention and force you to share how you felt about it, I believe it's our duty to do so.\\n\\n\r\n________________________________\\n\r\nScoring updated: 7/5/2012",
            "date": "2007-11-12T13:05:00+00:00",
            "helpful_count": 56,
            "mal_id": 1287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2136.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Despised",
                "username": "Despised"
            },
            "url": "https://myanimelist.net/reviews.php?id=1287"
        },
        {
            "content": "When my friend and I were talking about animes, he brought up this one, Ichigo 100%, and said he really enjoyed it and said i should watch it. i took his request and watched this 12 episode show, and boy do i disagree with him. \nStory: The story's the same story you'd find in your average-day harem. \nArt: The art is mediocre at best. This was made in 2005, but even so, other shows, like Naruto was out then, and had great art style. The art is Ichigo 100% is plain and not amusing. Everyone looks bland and the same. The only difference that ifind in the characters is the haircolors. \\n\\n\nSound: Now the opening and ending themes are really good. The opening theme is a great song that makes you move your head around and can always put a smile on your face. The ending theme is also a fun one that makes you want to dance around. But even so, the voice actors were not strong. The only voice actor I found good was Satsuki's because she is very spunky and her voice actor does a good job of having a spunky voice. And the score wasn't strong. It has the same sexual music in the parts when characters \"accidently\" get their panties shown, and all the rest in just little piano music that you would find in every other harem.\\n\\n\nCharacters: None of the characters were memorable at all. Tsukasa was boirng to me, even though she does have fanbase. Satsuki's annoying, Aya's an OK character, but she needs some more story to her, Manaka's a retard just like every other main boy in harems, and Yui's just weird. None of them stood out.\\n\\n\nOVerall, Ichigo 100% was a waste of my time. If you're into ecchi or harems, I highly recommend it for you. I'm not into harems that much, and that's probably why I didn't like it. And when you're watching Ichigo 100%, there will also be a few mindfucks in it to mess with you. I hated that as well. Ichigo 100% to me was crap. 4/10",
            "date": "2009-01-03T10:30:00+00:00",
            "helpful_count": 18,
            "mal_id": 11058,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101965.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/wesley96",
                "username": "wesley96"
            },
            "url": "https://myanimelist.net/reviews.php?id=11058"
        },
        {
            "content": "I may sound perverted. but i am actually a echi-Romance anime fan :) I've watched Ichigo 100% over 3 times now :) and i've enjoyed almost every moment of it :), i love the story, characters and the art.\r\nThe story is very normal, in real life as Junpei is in his last year of middle school, he confesses to a girl, oh then he goes to high school, he's habit is movies... etc etc... seemingly normal to me... its just the way ALL THOSE GIRLS KEEPS ON FALLING IN LOVE WITH JUNPEI!!! HE IS A PERVERTED-MINDED GUY!!! oh sry for that :) i jsut wantedto say it ^.^\\n\\n\r\nThe art is mostly echi and strawberry panted. and errm more echiness :) lol its somehow funny and fun to watch this anime :) the sound just helps :) \\n\\n\r\nI love the characters in Ichigo 100%, we'll i'm a Nishino fan AND i am satisfied with the ending girl he goes with in the manga. BUT... the ending is wearid and i didn't want it to end. :( Satsuki's another wonderful character with a great body and personality. I am not a Aya-fan like most people are. but i think Aya is best suited to Junpei... There are also many other characters that comes now and then to get involved with things. it somehow makes us boys think. ''i wish this could happen to me in real life'' ^.^ lol \\n\\n\r\nI love this anime overall, and its a geart anime that i enjoyed very much :) especially the echiness -.^ hehehehehehhehe \\n\\n\r\nThanks for reading :) :) \\n\\n\\n\r\nKeyira",
            "date": "2008-07-06T13:56:00+00:00",
            "helpful_count": 18,
            "mal_id": 6056,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72819.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Keyira",
                "username": "Keyira"
            },
            "url": "https://myanimelist.net/reviews.php?id=6056"
        },
        {
            "content": "Ichigo 100% would seem at first glance to be an anime with potential. Long before I started watching anime, it was one of the animes whose name was being circulated in my circles. So now, years later, I thought I'd give it a chance, however, I'm sorely disappointed.\r\nIchigo 100% is a cookie cutter anime with flat characters and virtually no storyline. While, granted, it is difficult to write a compelling story in twelve episodes, this anime does not measure up in other ways to be allowed that kind of leniency. \r\nThe storyline for Ichigo 100% develops in one whole episode. And then, once that episodeis passed, there is no more story. When I think back on the series, I find it lacks rising action. After the story is set up and everything is set in motion, nothing else happens. The main character has no hurdles to cross, nothing to lead to a climax of any sort. (And when I think about it, that's kind of a feat in itself, not putting in any rising action or a climax). The main character is simply pushed through the motions, but instead of making anything happen, he just pulls back and everything restarts as if nothing had happened. \\n\\n\r\nInstead of seeming real or sympathetic, the main protagonists come off as caricatures or stereotypes that are often seen in other anime. The main male character is flat and hesitant and stumbles and cannot make his own decisions. Instead of truly seeming interested in any of the female characters who are fawning over him, he repeatedly say \"I don't feel for you that way\" to at least one of the female cast but is ignored or simply ignores his own thoughts; not because of logic or because he is simply being bashful, mind you, but for the continuation of the storyline. He is a backdrop character and in my opinion, is used to facilitate the watcher's ability to place himself in the character's feet. \\n\r\nThe main female cast, while colourful, don't fair much better. In the effort to make them all unique, I think the writer made them too characterized and again, the ability to sympathize with the characters or relate is lost on me. They are all either too forceful, or too dainty, or simply unrealistic and of course, they are fawned over, in their turn, by all sorts of other men so as to make them all the more desirable to our protagonist.\\n\\n\r\nThe art is mediocre at best. I found the characters disproportionate and unnatractive, but I can easily ignore that. It's not the worst art, but again, it's not the best. \\n\\n\r\nThis anime feels lacking to me. If you're into harem, you'll hate that nothing ever happens to progress the story in the way that is expected of harems, if you're into anime generally, you'll hate that there is nothing to really grip onto to make you keep watching. There are good moments, there are bits that can make you laugh, especially when you begin watching and everything is fresh, but otherwise, this anime is pretty mediocre. Nothing I will be watching again.\\n\\n\r\nI give it a 4/10. Maybe a 4.5/10 because the opening and closing sings are cute and catchy.",
            "date": "2011-05-15T01:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 37002,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zabbichu",
                "username": "Zabbichu"
            },
            "url": "https://myanimelist.net/reviews.php?id=37002"
        },
        {
            "content": "So here we have Ichigo 100%, the first in a long series of ecchi and hentai dive on which I'll be making reviews and comments upon. I'd like to note first that I had watched this series some years ago when it came out, but dropped it. After my second time though--- I think I should have left it where it was. However as I am on this wonderful little adventure with my girl-friend; Zabbichu. I thought; \"well, why not?\" \r\n[ STORY: 4 ]  \"Pretty much your run of the mill harem.\"\r\nSo, as you would suspect from these genres, we have one guy anda group of lovely young ladies who, for some unknown reason--- fall in love with him, and in this case; pretty much unconditionally. The main character is perhaps a vicarious writer tool to live out his own wishes and desires, however if this was the case I would say that the writer is a bit of a masochist. The story itself really kinda spins its wheels without really going anywhere, or deciding on how it wants to be. It starts out well enough, but after the middle a lot of things just keep repeating and dulls the rest of the series. What I found interesting though, towards the end it appears that in a few conversations the non-essential characters had with the main cast seemed to reflect kinda how things were going in the series itself. It was like it was arguing with its self for some sort of validity. Other than a few elements about the girls, it's pretty much your run of the mill harem, which I have nothing against. I actually quite enjoy the genre; however this series was very lackluster. Even more boring is that it's themes don't even really bring much new to the table. \\n\\n\\n\r\n[ CHARACTERS: 7 ] \"Would have been higher if not for the main character.\"\\n\\n\r\nSo I'll get one thing out really quick. The main character? Forgettable, boring and pretty much useless. Most times I felt him using lines I would see if I were playing a dating sim; bland and pretty much all-fit scenario comments. He does well by encouraging the girls in their various talents, or chasing them when they run. But other than that, he felt generic and could have been anyone else. His buddies had more flavor to him. However the reason I've given this section such a high score, which would have been higher if not for the main character; is the love interests. I found them more entertaining to watch grow and act as the series went on. Even though they really don't develop too much, I wasn't expecting much in the short 12 eps. I find it really amusing when the main character doesn't act and they then react like a normal girl would, instead of one of the paper dolls in other anime I've seen.\\n\\n\\n\r\n[ ART: 6 ] \"If you're like me, who's a big fan of girls with lip gloss then this series might just have a little something for you to enjoy. \"\\n\\n\r\nIchigo 100% came out in `05; so with that in mind I would have to say that the art was good. It wasn't anything too great. However I was disappointed in the wide gap between the key animation ( the parts where the better animators do the important scenes ), and the other frames. I understand they might have not had quite a big enough budget to have everything look really great, but some more effort in a few scenes would have been better. The background was professional, but they were bland settings. It did shine in whenever it came to an ecchi scene though, with good detailing on the panties, plenty of not just the same old white school girl ones. It also did well whenever the camera focused on the cleavage, which seemed to gleam with every close-up. But most of all I really liked the close-ups on the lips. If you're like me, who's a big fan of girls with lip gloss then this series might just have a little something for you to enjoy. The character art was again, good for the time. But just that--- good. The girls were quite enjoyable to look at and the supporting cast didn't just fall into the background, so it did well enough.\\n\\n\\n\r\n[ SOUND: 6 ] \"The ending was great.\"\\n\\n\r\nThe opening was alright. However the ending was great, it was fun to hear them use the \"Vengaboys - We like to Party!\" (The Six-flags theme these days) sample for the ED theme, they did a good job of using it for their song without making it feel like it was a copy of the same song. The background music throughout the anime was again, good enough. It didn't really catch my attention, and I probably won't recognize any of the tracks ever. But sometimes that's good in an anime like this, since you wouldn't want to take away from the dialog. But I felt that the music changed at the right parts to add to what was happening on screen. The SFX blended well, but didn't really fill out the rest of the atmosphere around the cast, pretty much just simple focus on what was happening. The voice cast did okay, but there were a few points when characters were off screen and they were talking to the protagonist that I didn't know one from the other. These are key points in a anime like this, where you fall in-love with a character so much that you can point them out without even seeing their faces. However all the girls pretty much fell into two characters; soft spoken sweethearts. Or precocious loudmouths. Which disappointed me quite a bit.\\n\\n\\n\r\n[ ENJOYMENT: 3 ] \"if you got your hopes high for something really hot and fun... turn away now.\"\\n\\n\r\nI was at first really excited to see where it was going to take us, hoping that the fan-service would escalate as it went on and the relationships grew. However I will spoil something right here and now, it doesn't. So if you got your hopes high for something really hot and fun... turn away now. I really was hoping as the first series on my little perverted adventure with my girlfriend would be a lot more entertaining. However I found myself waiting for something to happen, but was left waiting even after the series ended. Which now, I'm glad it's over.\\n\\n\\n\r\n[ OVERALL: 5 ] \"There's much better out there.\"\\n\\n\r\nAt this point I cannot recommend this series, unless you're really hardcore and looking for a rerun of something you already seen. My views might change after I am finished watching through the various OVAs, but as of right now I can't really say that anyone should go out of their way to watch it; there's much better out there which share the same themes. So in closing I would like to thank you for reading this first review of mine and I'd like to encourage you to read my girl-friend's review as well; Zabbichu, and look forward to the rest of our stuff as we continue our adventures together! \\n",
            "date": "2011-05-15T00:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 37001,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/486458.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/5tar",
                "username": "5tar"
            },
            "url": "https://myanimelist.net/reviews.php?id=37001"
        },
        {
            "content": "It might be un-ethical to review a anime after only viewing the first two episodes but after watching the second episode i just had to post this.\r\nStory (5): The synopsis above is a bit off. The beginning of the story basically has a girl who drops a notebook falls down to catch it and exposes her strawberry panties to our protagonist. after a whole 25 seconds of seeing her face the protagonist and the viewers can already tell who she is before the end of episode 1 and on top of that he becomes another girls boyfriend leading the story to be shallow in itsoriginal concept. if the main guy is supposed to get the main girl why did the creators choose the main guy to ask a \"side\" girl out? \\n\r\nalas all was fine until the male lead finds out which person was wearing the strawberry panties and says the most shallow thing a protagonist would say. It's as if, in the extra 5 minutes of screen time the female lead gets, it gives the male protagonist the ability to fall in love with her over the girl he is already in a relationship with. it put me off this anime almost completely. \\n\r\nJust because the male lead saw the female leads panties twice, share synergizing hobbies/goals, spends sometime together studying, and the female lead happens to look more beautiful than the girl the male lead is currently dating doesn't mean that the male lead should automatically fall in love with her. what happened to all the time he spent with his girlfriend? its as if all consideration of a current relationship was cast aside like a kid with toys.\\n\r\nso far the story recieves a 5 for having a first good hand concept for a romance/comedy/harem anime but a 5 because of how the story is being played out and lack of a good focus through the first episode.\\n\\n\r\nArt (6): The art isn't bad, its not great either. its similar to the older animes styles like gundam or dragon ball z, without totally touching them. the coloring is very bright and almost but somehow feels very original too.\\n\r\ncharacters hair, eyes, mouths, and faces are in between the orignal styles of anime and the newer concepts sometimes the art would feel very cheap and sometimes the would feel very much like the current ongoing anime. overrall rating art is based on consistency of shapes and sizes and this anime feels like a montage of papers put together. the art is somewhat inconsistent feeling making viewers feel a pull between the show wanting to be comedy based,harem based, or romance based. \\n\r\nso far the art recieves a 6 for being above average and could have been a 7 had it been more consistent but a 6 because it felt inconsistent in drawing styles.\\n\\n\r\nSound (6): The sound is good. However the problem lies in when and where the sound is placed and how often the sound is brought up. this also includes character voices and the overall tone the sound produces in order to create the scene in anime. i'd like to say that even with a weak story or weak characters good sounds or tones put through may actually make it to be much better than it really is and thus sounds/music/tones are very much important. this anime has all the right sounds but sometimes it over uses them and it ends up feeling more like a video game that keeps playing the track from the beginning everytime a person were to change menus or screens. it becomes annoying, repetitive, and overdone. some character voices are a bit annoying especially the male leads friend with orange hair or when a character has fully completed his or her sentence and the corresponding character seemingly acts like s/he hasn't heard it at all or only part of it. newer animes would have one character cut off another characters sentences similar to a real life conversation but this anime perhaps wasn't in the year where that concept was put out or picked up yet. \\n\r\nhad the art been as consistantly semi annoying as the sound this anime may turn out for the better so far it recieves a 6 for having good sounds effects but only a 6 for its repetitive usage.\\n\\n\r\nCharacter (4): \\n\r\nMale lead: is a shallow pervert who suddenly forgets his relationship with his girlfriend to persue a girl he fell in love at first sight because of her strawberry panties, synergizing goals and study time.\\n\r\nFemale lead: is a girl who wears glasses and has pig tails but is very \"beautiful\" when her glasses are off and hair is put down. wears strawberry panties, is very smart, and pretty magically makes the male lead fall in love with her. has brown then redish hair.\\n\r\nMale leads friend 1: has orange hair, very very annoying. and over exagerrates everything. (the comic relief character)\\n\r\nMale leads friend 2: the cool guy. nuff said this guy should be the lead instead.\\n\r\nMale leads girlfriend: a short haired blonde girl who the male lead ask out and they become a couple. (why is it that in every harem the blonde girl isnt the female lead...its always the pink or red haired one.)\\n\r\nOverall they're all normal except the male lead. hell even the slapstick comic relief character has a better chance of being the lead at least he's faithful unless this anime is trying to go for another \"school days\" O_O;;;\\n\\n\r\nEnjoyment: not enough funny, not enough anything, and hopefully after im done this will be edited if not then beware this anime just might waste away my life as well as yours.\\n\\n\r\noverall: so far this anime is bull compared to everything else i've seen hell im starting to think i like school days better. yeah its that bad right now.",
            "date": "2010-05-23T23:43:00+00:00",
            "helpful_count": 12,
            "mal_id": 26322,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sousen",
                "username": "Sousen"
            },
            "url": "https://myanimelist.net/reviews.php?id=26322"
        },
        {
            "content": "Junpei goes to the school roof to catch a nice glimpse of the nice scenery, and is indeed greeted by the nice scene of a cute girl falling with her strawberry panties in full view. Who is this mystery girl? Apparently she dropped something, but it couldn't be... it belongs to the plain-looking bookworm Aya Toujou. This introduction pretty much describes the majority of Ichigo 100%. It is 100% about judging people and actually not having to act; why would you when girls land in Junpei's lap left and right?\r\nIchigo was an extremely ecchi show for its time, though by now it comes across asonly \"standard\" ecchi. Honestly after watching many works in this genre, this is not one of the stronger ones, it is most memorable for its unique BGM and songs more so than any plot or character.\\n\\n\r\nAnimation:\\n\r\nThe animation is fair for its time but quite blurry and antiquated by modern standards. Colors and are still nice but don't expect the level of detail you'd see in a current work. The characters are drawn fairly nicely, and Toujou shows that you shouldn't judge a book by its cover. Really, all f the girls are way too nice looking for a douche like our protagonist.\\n\\n\r\nThere isn't much action here, though there is a fair amount of ecchi fan service; the protagonist does have a panty fetish.\\n\\n\r\nSound:\\n\r\nAs mentioned above, the show has a very unique vocal BGM and and a nice OP and technoish(?) ED. I didn't really think that the ED fit the series very well but it sure is catchyl. Some people may recognize the high pitched whine of the male lead as Shin Asuka from Gundam Seed Destiny. Yep... same noise... The VA cast in general is very strong and does a good job.\\n\\n\r\nStory:\\n\r\nThere was definitely room for improvement here. Girls seem to just pop into the male lead's life continuously through the series and essentially \"court\" him in their own ways to no avail. There are some nice developments here but they failed to capitalize on these (mostly held back by the lead male). The series just feels like it isn't making any progress. And the whole movie/theater club thing has been way over-used.\\n\\n\r\nDon't expect much of a conclusion to this harem as the guy is indefinitely indecisive. And the only thing worse than having a harem show where the guy chooses someone I didn't want is a show where the guy chickens out. I hoped the OVA would fix this but see that review for more details there.\\n\\n\r\nCharacter:\\n\r\nThe main male is pathetic, he epitomizes the hopelessly nice harem lead that all girls should avoid like the plague.The girls here didn't get the message and are somehow attracted to his  thick-headed, not-that-good-looking persona. For a while, I thought we were going to have a Nice Boats ending.\\n\\n\r\nThe girls on the other hand are well developed and well played. They are all unique and all express themselves to Junpei, but he doesn't do them justice. What a pity... I won't go into details on the gals as they're perhaps among the few things that are worth discovering here.\\n\\n\r\nValue:\\n\r\nThere are moments of humor in this but not enough to put a serious comedy tag on it. There is likewise occasional tension but nothing terribly excitable. Despite my like of strawberries, I'd have to say this is a show to pass on due to a lackluster story and a lame lead.",
            "date": "2015-12-07T23:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 205008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=205008"
        },
        {
            "content": "A thrilling ride from beginning to end. The love story leaves you on the edge all the time. For those out there, there is plenty of fan service. the songs are catchy especially the ending theme.",
            "date": "2009-01-12T05:19:00+00:00",
            "helpful_count": 9,
            "mal_id": 11385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104340.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zetsuei99",
                "username": "zetsuei99"
            },
            "url": "https://myanimelist.net/reviews.php?id=11385"
        },
        {
            "content": "Let me start this off by saying I am not a fan of harem genre animes in general. They're often cliche, boring, and lack interesting romance. But there's plenty of harem animes I enjoy, and even some I love. Ichigo 100 was not one of them.\r\nStory: 3/10\r\nThis is the MOST SORRY EXCUSE OF A STORY I HAVE EVER SEEN!!!! Sao did it better. No joke. At least it had a story. Idk what Ichigo 100 did. Romance?\r\n Think again kind sir, cuz it most certainly was not.\r\nSo we get our typical harem protagonist and the typical girls that are crazy for him. Blah blah blah,the usual. But the story never GOES anywhere. Just when he thinks he finally picked a girl he likes he suddenly sees one of the other girls and his feelings waver. Oh joy, my least favorite trait of the protagonist. And spoiler, it goes unresolved. And he gets none of the girls. Big whoop.\\n\r\nBasically here is the story:\\n\r\nFilm enthusiast is really good at getting in compromised situations  involving the panties of the female characters.\\n\r\nIf you like that, you'll enjoy. Romance? Hmm gotta look elsewhere bud.\\n\r\nThe most romance this anime has to offer is the relationship between Manaka (protagonist)  and Toujou. It is very cute, well-developed, and has a strong building history. However she is nothing more than a girl in his harem. The reason the anime even interested me enough to give it a 6, is because I thought their relationship would progress. I wanted to give that potential a chance. \\n\\n\\n\r\nArt: 8/10\\n\r\nfor a 2005 anime especially, the art is relatively attractive. It's pretty cute and overall I have no issue with it.\\n\\n\\n\r\nSound: 8/10\\n\r\nThe ops and ends are catchy and I enjoyed them a lot. The soundtrack is also pretty nice. Nothing too much standout, but it was good nontheless. \\n\\n\\n\r\nCharacters: 6/10\\n\r\nThe characters were are all pretty interesting. The problem was just that they lacked development and story progression.\\n\\n\r\nManaka: He has a strong passion for film and filming that sticks with him throughout the anime. But his dumbness ruined his character. He spent the entire anime trying to choose a girl and talking to himself about who he liked. Then it seemed he was finally waking up and making a decision, only to go back to square one the next episode. This dumb pattern filled the whole anime and wasn't even resolved in the end. He's all worried about hurting people's feelings, which is nice and all, but he'll never get anywhere in life.\\n\\n\r\nToujou: she's the mysterious, shy, and timid girl who has a passion for writing and wants to make movies with Manaka. She's the blushy, runs away when stuff gets serious type and has been in love with Manaka since very early in the series.\\n\\n\r\nNishino: she is the studious, popular idol girl who falls for Manaka after a misinterpretation in middle school. She goes to a different high school and pops in on occasion. Her relationship status with Manaka  is very confusing. She is a likable character, and isn't pushed around easily by Manakas annoying ways, even though she has feelings for him.\\n\\n\r\nSatsuki: she's the tsundere of the series. She's energetic, playful, and athletic. She is first cold and mean towards Manaka, but eventually falls for him too in the typical tsundere way. She becomes very aggressive with trying to get her love across. For the tsundere, she isn't terrible, I just don't like them in general. \\n\\n\\n\r\nYui: Manakas childhood friend who basically will randomly get random ecchi moments with him. She is mostly used to fill a character space and isn't very likable or plot progressive.\\n\\n\r\nThe other two supporting males are typical supporting male characters. They aren't awful but none of them progress the plot any which is really stupid and sucky. With the addition of more girls in his harem, the characters are technically the same beginning to end. Satsuki isn't as tsundery and Toujou is not as shy, but romantically there's no even a moresal.\\n\\n\\n\r\nEnjoyment: 5/10\\n\r\n I obviously did not enjoy this anime. Simply because the romance sucked and the protagonist was an idiot. It was a pain to watch and made me bang my head into the wall so many times I probably have a concussion.\\n\r\nIf you wanna see a stupid guy look at cute girls' panties, boi I found your anime!\\n\\n\r\nOverall: 6/10\\n\r\nLike I said. It's the perfect example of what I hate about harem anime:\\n\r\n-cliche\\n\r\n-LOW story progression\\n\r\n-dumb main character \\n\r\n-indecision that eats up the whole anime \\n\r\n-LACK of romance \\n\r\n-end of episode teases that get erased each new episode \\n\r\n-ecchi overload\\n\\n\r\nIts terribly formulated and progressed, and mechanics-wise deserves a 3 or 4, but it DID succeed in keeping me interested so thus the higher rating. I rate based on how much an anime interests me, so even crap can get a higher score than it deserves.\\n\\n\r\nEcchi and harem fans will love this I'm sure, but as a romance fan, this one belongs in the trash.\\n",
            "date": "2019-03-04T17:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 302910,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5037383.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Raichibi",
                "username": "Raichibi"
            },
            "url": "https://myanimelist.net/reviews.php?id=302910"
        },
        {
            "content": "Ichigo 100 was a really nice manga with nice illustrations and soothing plot, so it was quite evident that the anime adaptation  would be highly anticipated, when the good news came that \"Madhouse\" would be the one doing the adaptation, it was natural that it would pique my interest...\r\nBut my my wat a dissapointment it was.\r\nSEE the thing was that madhouse decided to make it a low budget show putting up an amount of 5$ per frame and a very less amount of frame per second , overall leading to really poor quality,there were a lot of still frames and i mean extremely highno...the art seemed like 1980\"s though it was supposed to be a modern setting.\\n\\n\r\nMoreover, they skipped out a lot of important plot from the manga in order to fit into the 12 episode length it leads to a rather pathetic plot with zero character development...moreover sound track was indeed pathetic, it stayed the same for almost the whole anime....voice acting was below par and it just lead to harsh unpleasant voices to the ears\\n\\n\r\nFinally, i would conclude as read the manga, itvis worth your time but definitely not the anime (3/10) overall",
            "date": "2016-08-19T06:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 227113,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5302456.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/akash_kise",
                "username": "akash_kise"
            },
            "url": "https://myanimelist.net/reviews.php?id=227113"
        },
        {
            "content": "I'm not all for giving a lengthy review about this anime, so I'm just writing my thoughts shortly.\r\nI read the manga, and I mostly enjoyed it because I love Mizuki Kawashita's drawings. The artwork in the anime is decent, but lacks the subtleties of the manga art. I did not really like it, but figured it was just because it's harder to get that kind of art in anime.\r\nThe story is not exactly top notch in the manga, but I feel even less affected by the anime... There are too many moments where you'll think every girl should just drop Junpei and go lesbian, causeall the male roles are somewhat dull.\\n\\n\r\nJunpei is a crappy main character to boot, but it gets worse as the serie continues. He is the sole reason I am rating the characters as low. The female roles are standard archetypes, that may be an issue but they are given figure good in my opinion.\\n\\n\r\nOverall, I had a hard time finishing this, mostly because I already read the (better quality) manga and I couldn't really enjoy the different artstyle either.\\n\\n\r\nIf I'd tell anyone about this series, I'd recommend the manga rather than the anime tbh.",
            "date": "2012-01-03T14:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 50851,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/832371.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Marcusthemad",
                "username": "Marcusthemad"
            },
            "url": "https://myanimelist.net/reviews.php?id=50851"
        },
        {
            "content": "Where can I start from?\r\nWhen I heard about this anime I thought it would be good to give it a chance, but… why did I do it?\r\nJunpei Manaka is a high school boy whose dream is to make movies. One day Junpei goes to the rooftop and a girl falls over him and the first thing he sees it’s her underwear of strawberries, he has a glimpse of her face and he can’t say a word, he stares at her. She leaves and Junpei realizes she left a notebook and decides to know who she is to give the notebook back to her. Frustrated bynot getting any clue of which that girl can be he’s challenged by his friends to ask out a girl called Tuskasa Nishino. He asks Tsukasa to go out doing exercises, she finds it funny and accepts. Everything goes right in the relationship for some time until one day, they tell him the owner of the notebook is a girl called Aya Toujou, the best student of the high school. Attracted by his skills in writing and in the need of help in some subjects he asks Aya to help him. During a study session, Junpei realizes he likes her because she’s a bit shy, kind, intelligent and because of her skills to write. From that moment he won’t know which girl is better for him. Impressive, right?\\n\\n\r\nIn his new school he makes a movie club with some of friends including Aya. During this new period he’ll meet a girl called Satsuki Kitaouji, she’s pretty and brave, something he likes and falls in love with her. Later he realizes he’s really in love with Aya too, and he’s still in love with Nishino and he can’t decide who he likes. That’s all the anime. Yes, it’s sounds non-sense because it is.\\n\\n\r\nFrom the first time you realize this anime is not a big budget one just by seeing the opening, it’s was easy to make and the song is one of those you won’t remember. The same happens with the ending except the song it’s better. The animation of this anime is dull, not complicated, is like made by anime students.\\n\\n\r\nYou have to skip this anime because nothing happens, the characters aren’t developed enough and at the end you finish empty as the main character.\\n",
            "date": "2015-06-08T11:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 189860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4273715.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/bardanime",
                "username": "bardanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=189860"
        },
        {
            "content": "All romance-oriented shows have a goal that a character - or characters - is/are striving to achieve. In the romance genre the case is always thus: to develop the relationship between two characters significantly enough that it becomes more than a friendship. In the case of Ichigo 100%, and, sadly, most romantic harems out there, the aforementioned statement of the underlying goal of romance-genre animes is missing. \r\nIt’s a fault that's hard to overlook. It would be equivocated to a blanket that only covers your torso and legs, but not feet; you remain uncomfortable, constantly twisting and pulling to right the position but… you cannotchange the length of the fabric. Do not be misled by the seemingly quick start the show gets off to (as to be expected from a 12-episode-long series). Although it starts like something shot out of a cannon, expect the same mundane situations predictably repeating itself until you find yourself thinking what will happen next, looking at the screen, and shrugging to yourself – “That’s another correct for me. Ichigo Originality: 0, Me: 12.”\\n\\n\r\nAnother thing that can be deceptively enticing is the way that all girls are fairly represented in terms of Junpei’s (our hero) feelings towards them. Each girl, so to speak, is “kept in the running” for longer than you might expect, hell, I think they might still be running. This “everyone is even” approach will most likely leave you rather intrigued during more “ecchi” and jealousy scenes (the latter mostly involving Satsuki), but during the later episodes wondering and waiting: when and who? Don’t get me wrong, I think in harems that a lot of competition is good at the beginning, but as the show progresses, a thinning of the “crowd” is a must. If it cannot be achieved the viewer (like me) will just get flustered, confused, and annoyed with the hero. \\n\\n\r\nThat leads me into my next major gripe about the series: Junpei might be the most annoying protagonist I’ve encountered in my short – but thorough – adventure into romance anime. The dialog for his character makes me feel like the writer for said lines was “out to get us” for some unknown action. You want to shake him (Junpei) and say, “No. Say this: ___.” This may seem trivial because frustration/awkward situations come with all romantic animes, but when compounded with the indecision already taking place, it’s exasperating.\\n\\n\r\nLooking back though, upon hearing the voice actress for Tojou (one of the female love interests) first speak, I should’ve known this would be THAT kind of anime. The voice actress of Tojou is played by the same actress that voiced Haruka for the “Nogizaka Haruka no Himitsu” series. She has a great voice for the kind of role that’s being portrayed, but in the back of mind I was thinking, “It can’t turn out like the first and second seasons of ‘Himitsu’, can it? *After the final episode* Ugh.” (I do know that 100% came before Himitsu.)\\n\\n\r\nThe animation could be considered a tad bit dated, but the overall affect is present and it doesn’t detract from the show at all. There are a few scenes, especially in the more “zoomed out” ones where the art is a bit sketchy. The art does seem to improve greatly in the OVAs. though.\\n\\n\r\nI have to admit that I got sucked into this anime’s ploy by buying into the rocket-like start and loved the show immensely. Then as it went on I grew more and more wary of the string by which the show was pulling me along (rather effectively, I might add). I wanted a drastic change and remained blissfully ignorant to the fact that the show wouldn’t answer in kind. So learn from my blunder: if you’re like me and want a definitive resolution: he ends up with her, caution, I pray you. But if you don’t care about that, but like the genre and premise of the show, give it a try.  \\n\r\nOverall: 6\\n\\n\r\nStory: 7\\n\r\nThe way the characters are introduced through the story is a familiar, but it still leaves a nice affect.\\n\\n\r\nArt: 7\\n\r\nIt is a little dated by our standards, but it doesn't hamper the anime whatsoever.\\n\\n\r\nSound: 8\\n\r\nThe voice acting and tracks were solid. The voice actress of Tojou was cast perfectly.\\n\\n\r\nCharacter: 7\\n\r\nEach had a distinct personality and you could really see why Junpei would have such a hard time deciding who to \"choose.\" However, the score is lessened because of the hero, Junpei. \\n\\n\r\nEnjoyment: 6\\n\r\nAt first it was a 12. But as the anime progressed I wanted to see a progression in the relationships between Junpei and one of the girls that was significant enough to have a clear \"winner.\"\\n\\n\r\nFeedback is appreciated!",
            "date": "2010-02-16T15:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 23271,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=23271"
        },
        {
            "content": "For an ecchi genre anime this one is pretty well done and surprisingly I enjoyed it. The moments and the longing for each other gets repetitive but with nice variations, such as adding an additional character, event, etc. made the series very fun to watch.",
            "date": "2009-01-31T20:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 12006,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/144999.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/critic",
                "username": "critic"
            },
            "url": "https://myanimelist.net/reviews.php?id=12006"
        },
        {
            "content": "Very good story, had me wondering which one he was going to pick, then bam! the end of the story left me hanging. Good anime, but no sense of completion.",
            "date": "2009-03-29T21:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 13595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/95203.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rinoko",
                "username": "rinoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=13595"
        },
        {
            "content": "****There are spoilers in this but I don't think it matters much because it kind of serves as a warning for what you will be getting into (not that this is a bad anime in anyway).****\r\nNow, if you are going to watch this anime there are a couple requirements: 1. You must have plenty of time to spare and 2. Be watching it for the girls in it, it is a harem afterall.\r\nI can not emphasize this enough. If you are watching this for some reason other than the artwork, ecchi scenes, or romance in it then you are probably in the wrong place.\r\nStory (5/10):\r\nThestory revolves around a perverted kid (big shocker, I know) in his last year of middle school (the story covers between this time and up to, I think, his second year in HS).\\n\\n\r\nYou see the story begin when the Manaka discovers this girl's (Toujou's) notebook which has an apparently fantastic novel written in it by her. The protagonist Man (Manaka from now on) reads it by accident and when he goes to return the notebook emphasizes how good it was and tells her she should be a novelist. He also opens up to her a bit, explaining how he aspires to become a film director. She is so touched by the fact that he complimented her novel so much that she decides to follow him to the highschool he wants to go to (she picks his highschool over her highschool that would be better suited for a smart girl like her). At this point he suddenly confesses, get this, to some other girl (Tsukasa) he barely knows over Toujou who he so clearly has common interests with. He confesses to Tsukasa in an extremely exaggerated, ridiculous manner which somehow convinces her to go out with him. So that is the force stopping Toujou from getting closer to Man, however soon after this it becomes obvious to Tsukasa that Man likes Toujou so she pretty much says to Man, \"You seem to have your eyes on Toujou so instead of going to the same highschool with you I am going to a different all-girls school, even though we are not going to the same school I am not giving up on you. . .\". Personally in that situation I think that the more logical approach would be to just let him get it on with the girl he actually likes, but this is a harem we are talking about so... \\n\\n\r\nMoving on.\\n\\n\r\nThe day before Man's first day of HS, we are introduced to Satsuki and in the most ecchi way possible (well, that s an exaggeration). Man is testing out his new camera he got from his parents, he spots this girl by the lake, begins filming and then... Oh no! A gust of wind comes rushing by! This was probably the wrong day to wear that skirt dress, Satsuki you foolish girl. She then proceeds to tackle Man in an attempt to erase his footage, and he ends up grabbing her tits. Yup, this is what I am watching. And I do not feel ashamed one bit.\\n\\n\r\nSomehow our protagonist, Man, turns into a huge gentleman and Satsuki can't help but fall in love with him.. Not sure how that happened... AGAIN. Only difference this time is that the girl is getting all lovey-dovey in public. \\n\\n\r\nSatsuki and Toujou are easily likeable characters, if not the most likable in this anime, but that is just my subjective opinion. Thats all I am gonna cover story wise\\n\\n\r\nArt (9/10):\\n\\n\r\nI personally loved the art in it, particularly the female characters looked really appealing visually. This is emphasized in the OP \"SHINE OF VOICE\". \\n\\n\r\nSound (9/10):\\n\\n\r\nThe OP is really good (easily one of my favorites of all time) and I especially loved the soundtrack that would play whenever there was some sort of ecchi scene occuring. For some reason I found that particular soundtrack hilarious and enjoyable. Not sure why it would make me laugh inside, may have something to deal with the fact that it was just someone melodically singing \"Chuchuwa fufu Chuchaa\" in a very late 90's tune (maybe idk, i don't remember the 90's too well, I was 4 in 2000). It's just hilarious. DO NOT ask me why.\\n\\n\r\nCharacter (8/10):\\n\\n\r\nThe development between the characters was OKAY. I felt all of the girls had enjoyable \"personalities\" especially Satsuki and Toujou. Everyone else was okay, in my opinion.\\n\\n\r\nThen again if you are just watching for some semi-highschool romantic situations (like I was) not even slight issues will really bother you. All the characters are pretty cute.\\n\\n\r\nEnjoyment (9/10):\\n\\n\r\nI really found myself enjoying this series, it had good characters, great art, and some great ecchi scenes mixed in. There is also the sexual frustration (not sure if this is the right word) between the protagonist and the girls. I was able to keep myself fully awake past midnight watching this.. ON A SCHOOL NIGHT. It's not really a big deal i know, but I have to be really fixed on something to be able to not fall asleep.\\n\\n\r\nOverall (8/10):\\n\\n\r\nAssuming you are or plan on watching this for sexual situations, decently good characters and ecchi stuff then you will most certainly not be disappointed. The art is great, characters are exceptional and plenty of ecchi to go around. This is not meant for everybody so if you are feeling iffy about then just. . . Don't.\\n\\n\r\nWhether you agree or not with my review then please leave some feedback, as I am rather inexperienced with writing reviews :). Thank you very much.",
            "date": "2013-12-15T14:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 123967,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2629033.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Jaycalli50",
                "username": "Jaycalli50"
            },
            "url": "https://myanimelist.net/reviews.php?id=123967"
        },
        {
            "content": "A good ecchi with some great humor. Almost like a harem, the anime stays fresh with a little rejection of the main character. Instead of everybody going head over heels for him, there's one girl who switches up the story, and keeps the story moving.\r\nOnly problem for me was that there was no definite solutions to the love problems and many feelings are lost in translation.\r\nOver all i give this anime a 8/10, nothing special, but it's a well rounded story.",
            "date": "2009-03-31T23:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 13695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13695"
        },
        {
            "content": "Well, it wasn't awful, but it most definitely was not the best in the world. Normally, I'm a big fan of fillers since they can be quite hilarious. This 12 episode anime, however, didn't really have much of a plot. There was one, obviously, but it was mainly a \"Let's see how many times we can make it perverted.\" \r\nInstead of the perversion, the makers of this show could have expanded on the plot more and the conclusion may have been better. To end it the way they did just was not right. \r\nThe only way I would truly recommend this show is if youcan't think of anything else to watch and just want something to pass the time.",
            "date": "2010-06-19T17:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 27360,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/343477.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SoftCoyote",
                "username": "SoftCoyote"
            },
            "url": "https://myanimelist.net/reviews.php?id=27360"
        },
        {
            "content": "I don't know where to start off, but its a total dissapointment to me since theres so many things its not complete on the anime. The manga is just a better way to go along with the series, at least it went all the way unlike it cuts off on a ceartin point like the anime.\r\nIt starts out alright for a few episodes then its just becomes repetitive on alot of scenes. My conclusion: Fails as anime series, Good as Manga series.",
            "date": "2009-06-17T00:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 15823,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194998.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/xDoN904",
                "username": "xDoN904"
            },
            "url": "https://myanimelist.net/reviews.php?id=15823"
        }
    ],
    [
        {
            "content": "First of all, I'll try not to swear too much. So, is'nt it always a sign of quality if an anime makes you have strong feelings about it? I think good animes are the ones that make you relate and be truly interested in the characters, loving some of them, hating some others, and Ichigo 100% certainly succeeds in these things.\r\nOkay, I have seen many echhi/harem animes and they all have their similarities, but never has the protagonist been even nearly as retarded as in Ichigo 100%. Usually ecchi boys have these problems like not being able to decide between girls, or thinking about sexand female parts for 99% of their time only to freak out if a girl gets close to them. They also tend to posess only one argument in a conversation, which is to repeat the girls name over and over: \"Ni-ni-nishino-san?\". Junpei-kun from Ichigo takes these problems to a whole different level.\\n\\n\r\nThe main thing that annoys me in the setting is that all the three girls are shown as truly equal, and you really can't tell which one Junpei likes the most, as his opinions seem to change in split-second mode. In most of the other harem animes I've seen, you can tell the favourite girl of the protagonist even though he can't decide between her and a few others, but in Ichigo 100%, there really is'nt a main girl. Everybody can tell that in Rosario+Vampire, Moka-san is the one Tsukune likes, and the other ones are not nearly as important. But in Ichigo 100%, Junpei's favourite girl seems to always be the one he is not with at the moment.\\n\\n\r\nThis leads to a situation where Junpei spends time with all the girls equally and hurts all of their feelings. For example, he first spends some great fan service -time with Kitaouji thinking only about Toujou. Then, leaving Kitaouji behind he meets Toujou only to begin thinking about Nishino, and of course hurting Toujou in the process. And all the time the viewer is wondering: \"What the **** is wrong with this guy?\".\\n\\n\r\nWhen Junpei finally ends up saying: \"I love you, but I love others too!\" and when he cried to his friend saying \"I'm so unpopular\", I was already carrying my laptop to the nearest industrial shredder. There was about a million situations where I was just staring at the screen of my laptop shouting \"Answer her, you f****** retard!\", shaking my whole computer in despair or watching with my eyes closed not being able to understand what he does to these girls.\\n\\n\r\nOkay, I've focused way too much on Junpei and his problems, but that's really the main thing I got from this anime. It's like the script writers have intentionally created a character, who you'd only want to beat up if you'd see him. Keitaro from Love Hina is a really good guy, Yukinari from Girls Bravo is okay, but Junpei really is someone I only wanted to hate.\\n\\n\r\nBut well, this really is a decent anime. Really. The animation is quite good, most of the characters are cute, especially Toujou, and I like the school club setting, although it's pretty used nowadays. The ending theme is also quite nice. Eurodance and strawberries, what more can you ask?\\n\\n\r\nOverall, if you like to watch harem-anime thinking \"I'd be way better a boyfriend for her, her and her\", this one's definately for you! If you hate watching popular retards making girls cry, stay far far away from Ichigo 100% ^^\\n\\n\r\nWhoa, maybe this genre is not for me :D",
            "date": "2009-05-08T03:57:00+00:00",
            "helpful_count": 208,
            "mal_id": 14871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/106462.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Atharil",
                "username": "Atharil"
            },
            "url": "https://myanimelist.net/reviews.php?id=14871"
        },
        {
            "content": "Never thought I'd be writing a review for the Ecchi genre. I'm not really the Ecchi type, although there are times I might watch them. I'm more of an action/supernatural/horror type, so let me say this first before continuing:\r\nIf you're a real Ecchi fan, and all you're looking for is Ecchi, you may not find exactly what you're looking for with this series. Don't get me wrong, there is plenty of it (probably much more than it sounds), but even for the occassional watcher like myself; it didn't feel like it was the real foundation for this series. It does seem to cater to bothguys and gals as its mostly based on relationship. Either gender may actually find appreciation for it. If you're looking for some huge story to open up later like the typical shounen series where there is normally some much bigger plot, you probably will not enjoy this as much, if at all. I think I happened to watch this one at JUST THE RIGHT TIME, as I felt very satisfied with how it went and how it was written.\\n\\n\r\nStory/Plot: 7\\n\r\nWhere's the story? You're looking at it. It's pretty much as the Synopsis says and what the genres indicate; your typical harem (although there's so much more to it). Why a 7, though? This series wasn't created for pure story conception, but is based more on character development and the character and story development compliment each other nicely. As far as I'm concerned, it couldn't have been handled any better, and it was handled rather nicely. It does navigate through the end of Middle School on into High School years, so there is some of that story progression taking place, although a lot of the story advancement is through plot devices; not the kind that leave plotholes, however.\\n\\n\r\nArt/Animation: 6\\n\r\nIt's not a secret. This series isn't as visually tantalizing as a lot of the others out there, especially with the ones from the same year. A very visually pleasing anime is always a big plus, but the quality here doesn't hurt it, either. It didn't seem like this production was given that big of a budget, and its a real shame because it could have looked a lot nicer. The art and animation that was used does suffice given the fact it's not really ABOUT how good the art, or animation was. Sufficient enough for me.\\n\\n\r\nSound/Music: 8\\n\r\nI found the music to be very.. \"fun\". This is strange for me, seeing as how I'm not the typical kind of guy to really \"like\" anime music, although I'm coming around to it. The OP for this is simply awesome. It provides a lot of good memories and tends to help me remember a lot of those great times I had in my school days. The voice actors on this (japanese) were awesome, as well. I didn't once feel that a voice was out of place, and they pulled everything off quite nicely.\\n\\n\r\nCharacters/Character Development: 7\\n\r\nThis is where the main basis for this series lies: in it's characters. All of the characters are the types you might be able to find in just about any series, but not necessarily in one as fluent in relationships as this series is. The characters fit with this genre-type, most definitely and not one character is the exact same as the other, so there is plenty of diversity and differing interests and personalities. It's very interesting to see how relationships strengthen, or crumble a bit with certain actions throughout this series, as well.\\n\\n\r\nEnjoyment: 8\\n\r\nI enjoyed this series a lot. It was worth my time. If anyone has ever found themselves in similar 'situations' that take place in this series, you'll probably appreciate it just as much as I have, if not more. There were many times that I laughed until I drooled (I know it sounds gross, just emphasizing how funny it was). A lot of the comedy was based off embarressing types of occurences, but it certainly wasn't limited to just that. It didn't need some long drawn out story to please me, either. I was grateful for that, but I truly wish there was much, much more to it, or a sequel. That would make my day.\\n\\n\r\nOverall: 7\\n\r\nIt's a fair rating and it does represent how I enjoyed it, while still being a critic at the same time, however there really isn't anything rather negative to say about it. I think I'll go as far to claim that this series is truly underrated in probably a lot of circles, and this rating certainly doesn't overrate it, either. By the time you get to the end, you'll probably feel a sense of satisfaction coupled with regret for not catching it sooner, and perhaps the urge for more. If you came across this review and decided to give it a try, awesome. I hope you enjoy it as much as I did, and if not; sorry.\\n\\n\r\nSuggestion\\n\r\nI'd suggest watching this series, but also the other OVAs and such that are paired with this series. Jump Festa 2004 seems to mark the \"end\" in most respects, although it was produced before the series, itself.\\n\\n\r\nWatch Order 1\\n\r\nEpisodes 1-9, Ichigo 100% TV Special 2, Episodes 10-12, Jump Festa 2004, DVD Animation OVAs.\\n\r\nOR\\n\r\nWatch Order 2\\n\r\nEpisodes 1-9, Ichigo 100% TV Special 2, Episodes 10-12, DVD Animation OVAs, Jump Festa 2004.\\n\\n\r\n________________________________\\n\r\nAddendum (03/09/12):\\n\r\nI no longer use the scoring format this site offers and have not for some time. I do not consider a \"10\" to be in existence and have long since downgraded many of what I've scored to reflect this way of thinking. I have chosen to keep this review slated at an \"8\", although my list may begin to reflect this change regarding this title specifically in the future. If I ever find some time to heavily edit, or entirely rewrite this review after rewatching this title in its entirety I will do so in order to bring its scoring up to date. It may change based on how I feel about it after seeing it again, or I may feel strongly about it in the same way and keep the score as-is.\\n\\n\r\nI believe I can write something much better, but I still agree with the way this review was written as it presents a direct opinion and straight-forward evaluation while being completely devoid of unnecessary plot outlines, or spoilers. And that was my goal and sole purpose for penning it. Around the time period of 11/12/07 there were very few reviews on this site compared to today and many of them offered a little too much information and had become summaries instead of perspective so I stand by that decision. If something can pull your attention and force you to share how you felt about it, I believe it's our duty to do so.\\n\\n\r\n________________________________\\n\r\nScoring updated: 7/5/2012",
            "date": "2007-11-12T13:05:00+00:00",
            "helpful_count": 56,
            "mal_id": 1287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2136.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Despised",
                "username": "Despised"
            },
            "url": "https://myanimelist.net/reviews.php?id=1287"
        },
        {
            "content": "When my friend and I were talking about animes, he brought up this one, Ichigo 100%, and said he really enjoyed it and said i should watch it. i took his request and watched this 12 episode show, and boy do i disagree with him. \nStory: The story's the same story you'd find in your average-day harem. \nArt: The art is mediocre at best. This was made in 2005, but even so, other shows, like Naruto was out then, and had great art style. The art is Ichigo 100% is plain and not amusing. Everyone looks bland and the same. The only difference that ifind in the characters is the haircolors. \\n\\n\nSound: Now the opening and ending themes are really good. The opening theme is a great song that makes you move your head around and can always put a smile on your face. The ending theme is also a fun one that makes you want to dance around. But even so, the voice actors were not strong. The only voice actor I found good was Satsuki's because she is very spunky and her voice actor does a good job of having a spunky voice. And the score wasn't strong. It has the same sexual music in the parts when characters \"accidently\" get their panties shown, and all the rest in just little piano music that you would find in every other harem.\\n\\n\nCharacters: None of the characters were memorable at all. Tsukasa was boirng to me, even though she does have fanbase. Satsuki's annoying, Aya's an OK character, but she needs some more story to her, Manaka's a retard just like every other main boy in harems, and Yui's just weird. None of them stood out.\\n\\n\nOVerall, Ichigo 100% was a waste of my time. If you're into ecchi or harems, I highly recommend it for you. I'm not into harems that much, and that's probably why I didn't like it. And when you're watching Ichigo 100%, there will also be a few mindfucks in it to mess with you. I hated that as well. Ichigo 100% to me was crap. 4/10",
            "date": "2009-01-03T10:30:00+00:00",
            "helpful_count": 18,
            "mal_id": 11058,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101965.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/wesley96",
                "username": "wesley96"
            },
            "url": "https://myanimelist.net/reviews.php?id=11058"
        },
        {
            "content": "I may sound perverted. but i am actually a echi-Romance anime fan :) I've watched Ichigo 100% over 3 times now :) and i've enjoyed almost every moment of it :), i love the story, characters and the art.\r\nThe story is very normal, in real life as Junpei is in his last year of middle school, he confesses to a girl, oh then he goes to high school, he's habit is movies... etc etc... seemingly normal to me... its just the way ALL THOSE GIRLS KEEPS ON FALLING IN LOVE WITH JUNPEI!!! HE IS A PERVERTED-MINDED GUY!!! oh sry for that :) i jsut wantedto say it ^.^\\n\\n\r\nThe art is mostly echi and strawberry panted. and errm more echiness :) lol its somehow funny and fun to watch this anime :) the sound just helps :) \\n\\n\r\nI love the characters in Ichigo 100%, we'll i'm a Nishino fan AND i am satisfied with the ending girl he goes with in the manga. BUT... the ending is wearid and i didn't want it to end. :( Satsuki's another wonderful character with a great body and personality. I am not a Aya-fan like most people are. but i think Aya is best suited to Junpei... There are also many other characters that comes now and then to get involved with things. it somehow makes us boys think. ''i wish this could happen to me in real life'' ^.^ lol \\n\\n\r\nI love this anime overall, and its a geart anime that i enjoyed very much :) especially the echiness -.^ hehehehehehhehe \\n\\n\r\nThanks for reading :) :) \\n\\n\\n\r\nKeyira",
            "date": "2008-07-06T13:56:00+00:00",
            "helpful_count": 18,
            "mal_id": 6056,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72819.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Keyira",
                "username": "Keyira"
            },
            "url": "https://myanimelist.net/reviews.php?id=6056"
        },
        {
            "content": "Ichigo 100% would seem at first glance to be an anime with potential. Long before I started watching anime, it was one of the animes whose name was being circulated in my circles. So now, years later, I thought I'd give it a chance, however, I'm sorely disappointed.\r\nIchigo 100% is a cookie cutter anime with flat characters and virtually no storyline. While, granted, it is difficult to write a compelling story in twelve episodes, this anime does not measure up in other ways to be allowed that kind of leniency. \r\nThe storyline for Ichigo 100% develops in one whole episode. And then, once that episodeis passed, there is no more story. When I think back on the series, I find it lacks rising action. After the story is set up and everything is set in motion, nothing else happens. The main character has no hurdles to cross, nothing to lead to a climax of any sort. (And when I think about it, that's kind of a feat in itself, not putting in any rising action or a climax). The main character is simply pushed through the motions, but instead of making anything happen, he just pulls back and everything restarts as if nothing had happened. \\n\\n\r\nInstead of seeming real or sympathetic, the main protagonists come off as caricatures or stereotypes that are often seen in other anime. The main male character is flat and hesitant and stumbles and cannot make his own decisions. Instead of truly seeming interested in any of the female characters who are fawning over him, he repeatedly say \"I don't feel for you that way\" to at least one of the female cast but is ignored or simply ignores his own thoughts; not because of logic or because he is simply being bashful, mind you, but for the continuation of the storyline. He is a backdrop character and in my opinion, is used to facilitate the watcher's ability to place himself in the character's feet. \\n\r\nThe main female cast, while colourful, don't fair much better. In the effort to make them all unique, I think the writer made them too characterized and again, the ability to sympathize with the characters or relate is lost on me. They are all either too forceful, or too dainty, or simply unrealistic and of course, they are fawned over, in their turn, by all sorts of other men so as to make them all the more desirable to our protagonist.\\n\\n\r\nThe art is mediocre at best. I found the characters disproportionate and unnatractive, but I can easily ignore that. It's not the worst art, but again, it's not the best. \\n\\n\r\nThis anime feels lacking to me. If you're into harem, you'll hate that nothing ever happens to progress the story in the way that is expected of harems, if you're into anime generally, you'll hate that there is nothing to really grip onto to make you keep watching. There are good moments, there are bits that can make you laugh, especially when you begin watching and everything is fresh, but otherwise, this anime is pretty mediocre. Nothing I will be watching again.\\n\\n\r\nI give it a 4/10. Maybe a 4.5/10 because the opening and closing sings are cute and catchy.",
            "date": "2011-05-15T01:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 37002,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zabbichu",
                "username": "Zabbichu"
            },
            "url": "https://myanimelist.net/reviews.php?id=37002"
        },
        {
            "content": "So here we have Ichigo 100%, the first in a long series of ecchi and hentai dive on which I'll be making reviews and comments upon. I'd like to note first that I had watched this series some years ago when it came out, but dropped it. After my second time though--- I think I should have left it where it was. However as I am on this wonderful little adventure with my girl-friend; Zabbichu. I thought; \"well, why not?\" \r\n[ STORY: 4 ]  \"Pretty much your run of the mill harem.\"\r\nSo, as you would suspect from these genres, we have one guy anda group of lovely young ladies who, for some unknown reason--- fall in love with him, and in this case; pretty much unconditionally. The main character is perhaps a vicarious writer tool to live out his own wishes and desires, however if this was the case I would say that the writer is a bit of a masochist. The story itself really kinda spins its wheels without really going anywhere, or deciding on how it wants to be. It starts out well enough, but after the middle a lot of things just keep repeating and dulls the rest of the series. What I found interesting though, towards the end it appears that in a few conversations the non-essential characters had with the main cast seemed to reflect kinda how things were going in the series itself. It was like it was arguing with its self for some sort of validity. Other than a few elements about the girls, it's pretty much your run of the mill harem, which I have nothing against. I actually quite enjoy the genre; however this series was very lackluster. Even more boring is that it's themes don't even really bring much new to the table. \\n\\n\\n\r\n[ CHARACTERS: 7 ] \"Would have been higher if not for the main character.\"\\n\\n\r\nSo I'll get one thing out really quick. The main character? Forgettable, boring and pretty much useless. Most times I felt him using lines I would see if I were playing a dating sim; bland and pretty much all-fit scenario comments. He does well by encouraging the girls in their various talents, or chasing them when they run. But other than that, he felt generic and could have been anyone else. His buddies had more flavor to him. However the reason I've given this section such a high score, which would have been higher if not for the main character; is the love interests. I found them more entertaining to watch grow and act as the series went on. Even though they really don't develop too much, I wasn't expecting much in the short 12 eps. I find it really amusing when the main character doesn't act and they then react like a normal girl would, instead of one of the paper dolls in other anime I've seen.\\n\\n\\n\r\n[ ART: 6 ] \"If you're like me, who's a big fan of girls with lip gloss then this series might just have a little something for you to enjoy. \"\\n\\n\r\nIchigo 100% came out in `05; so with that in mind I would have to say that the art was good. It wasn't anything too great. However I was disappointed in the wide gap between the key animation ( the parts where the better animators do the important scenes ), and the other frames. I understand they might have not had quite a big enough budget to have everything look really great, but some more effort in a few scenes would have been better. The background was professional, but they were bland settings. It did shine in whenever it came to an ecchi scene though, with good detailing on the panties, plenty of not just the same old white school girl ones. It also did well whenever the camera focused on the cleavage, which seemed to gleam with every close-up. But most of all I really liked the close-ups on the lips. If you're like me, who's a big fan of girls with lip gloss then this series might just have a little something for you to enjoy. The character art was again, good for the time. But just that--- good. The girls were quite enjoyable to look at and the supporting cast didn't just fall into the background, so it did well enough.\\n\\n\\n\r\n[ SOUND: 6 ] \"The ending was great.\"\\n\\n\r\nThe opening was alright. However the ending was great, it was fun to hear them use the \"Vengaboys - We like to Party!\" (The Six-flags theme these days) sample for the ED theme, they did a good job of using it for their song without making it feel like it was a copy of the same song. The background music throughout the anime was again, good enough. It didn't really catch my attention, and I probably won't recognize any of the tracks ever. But sometimes that's good in an anime like this, since you wouldn't want to take away from the dialog. But I felt that the music changed at the right parts to add to what was happening on screen. The SFX blended well, but didn't really fill out the rest of the atmosphere around the cast, pretty much just simple focus on what was happening. The voice cast did okay, but there were a few points when characters were off screen and they were talking to the protagonist that I didn't know one from the other. These are key points in a anime like this, where you fall in-love with a character so much that you can point them out without even seeing their faces. However all the girls pretty much fell into two characters; soft spoken sweethearts. Or precocious loudmouths. Which disappointed me quite a bit.\\n\\n\\n\r\n[ ENJOYMENT: 3 ] \"if you got your hopes high for something really hot and fun... turn away now.\"\\n\\n\r\nI was at first really excited to see where it was going to take us, hoping that the fan-service would escalate as it went on and the relationships grew. However I will spoil something right here and now, it doesn't. So if you got your hopes high for something really hot and fun... turn away now. I really was hoping as the first series on my little perverted adventure with my girlfriend would be a lot more entertaining. However I found myself waiting for something to happen, but was left waiting even after the series ended. Which now, I'm glad it's over.\\n\\n\\n\r\n[ OVERALL: 5 ] \"There's much better out there.\"\\n\\n\r\nAt this point I cannot recommend this series, unless you're really hardcore and looking for a rerun of something you already seen. My views might change after I am finished watching through the various OVAs, but as of right now I can't really say that anyone should go out of their way to watch it; there's much better out there which share the same themes. So in closing I would like to thank you for reading this first review of mine and I'd like to encourage you to read my girl-friend's review as well; Zabbichu, and look forward to the rest of our stuff as we continue our adventures together! \\n",
            "date": "2011-05-15T00:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 37001,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/486458.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/5tar",
                "username": "5tar"
            },
            "url": "https://myanimelist.net/reviews.php?id=37001"
        },
        {
            "content": "It might be un-ethical to review a anime after only viewing the first two episodes but after watching the second episode i just had to post this.\r\nStory (5): The synopsis above is a bit off. The beginning of the story basically has a girl who drops a notebook falls down to catch it and exposes her strawberry panties to our protagonist. after a whole 25 seconds of seeing her face the protagonist and the viewers can already tell who she is before the end of episode 1 and on top of that he becomes another girls boyfriend leading the story to be shallow in itsoriginal concept. if the main guy is supposed to get the main girl why did the creators choose the main guy to ask a \"side\" girl out? \\n\r\nalas all was fine until the male lead finds out which person was wearing the strawberry panties and says the most shallow thing a protagonist would say. It's as if, in the extra 5 minutes of screen time the female lead gets, it gives the male protagonist the ability to fall in love with her over the girl he is already in a relationship with. it put me off this anime almost completely. \\n\r\nJust because the male lead saw the female leads panties twice, share synergizing hobbies/goals, spends sometime together studying, and the female lead happens to look more beautiful than the girl the male lead is currently dating doesn't mean that the male lead should automatically fall in love with her. what happened to all the time he spent with his girlfriend? its as if all consideration of a current relationship was cast aside like a kid with toys.\\n\r\nso far the story recieves a 5 for having a first good hand concept for a romance/comedy/harem anime but a 5 because of how the story is being played out and lack of a good focus through the first episode.\\n\\n\r\nArt (6): The art isn't bad, its not great either. its similar to the older animes styles like gundam or dragon ball z, without totally touching them. the coloring is very bright and almost but somehow feels very original too.\\n\r\ncharacters hair, eyes, mouths, and faces are in between the orignal styles of anime and the newer concepts sometimes the art would feel very cheap and sometimes the would feel very much like the current ongoing anime. overrall rating art is based on consistency of shapes and sizes and this anime feels like a montage of papers put together. the art is somewhat inconsistent feeling making viewers feel a pull between the show wanting to be comedy based,harem based, or romance based. \\n\r\nso far the art recieves a 6 for being above average and could have been a 7 had it been more consistent but a 6 because it felt inconsistent in drawing styles.\\n\\n\r\nSound (6): The sound is good. However the problem lies in when and where the sound is placed and how often the sound is brought up. this also includes character voices and the overall tone the sound produces in order to create the scene in anime. i'd like to say that even with a weak story or weak characters good sounds or tones put through may actually make it to be much better than it really is and thus sounds/music/tones are very much important. this anime has all the right sounds but sometimes it over uses them and it ends up feeling more like a video game that keeps playing the track from the beginning everytime a person were to change menus or screens. it becomes annoying, repetitive, and overdone. some character voices are a bit annoying especially the male leads friend with orange hair or when a character has fully completed his or her sentence and the corresponding character seemingly acts like s/he hasn't heard it at all or only part of it. newer animes would have one character cut off another characters sentences similar to a real life conversation but this anime perhaps wasn't in the year where that concept was put out or picked up yet. \\n\r\nhad the art been as consistantly semi annoying as the sound this anime may turn out for the better so far it recieves a 6 for having good sounds effects but only a 6 for its repetitive usage.\\n\\n\r\nCharacter (4): \\n\r\nMale lead: is a shallow pervert who suddenly forgets his relationship with his girlfriend to persue a girl he fell in love at first sight because of her strawberry panties, synergizing goals and study time.\\n\r\nFemale lead: is a girl who wears glasses and has pig tails but is very \"beautiful\" when her glasses are off and hair is put down. wears strawberry panties, is very smart, and pretty magically makes the male lead fall in love with her. has brown then redish hair.\\n\r\nMale leads friend 1: has orange hair, very very annoying. and over exagerrates everything. (the comic relief character)\\n\r\nMale leads friend 2: the cool guy. nuff said this guy should be the lead instead.\\n\r\nMale leads girlfriend: a short haired blonde girl who the male lead ask out and they become a couple. (why is it that in every harem the blonde girl isnt the female lead...its always the pink or red haired one.)\\n\r\nOverall they're all normal except the male lead. hell even the slapstick comic relief character has a better chance of being the lead at least he's faithful unless this anime is trying to go for another \"school days\" O_O;;;\\n\\n\r\nEnjoyment: not enough funny, not enough anything, and hopefully after im done this will be edited if not then beware this anime just might waste away my life as well as yours.\\n\\n\r\noverall: so far this anime is bull compared to everything else i've seen hell im starting to think i like school days better. yeah its that bad right now.",
            "date": "2010-05-23T23:43:00+00:00",
            "helpful_count": 12,
            "mal_id": 26322,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sousen",
                "username": "Sousen"
            },
            "url": "https://myanimelist.net/reviews.php?id=26322"
        },
        {
            "content": "Junpei goes to the school roof to catch a nice glimpse of the nice scenery, and is indeed greeted by the nice scene of a cute girl falling with her strawberry panties in full view. Who is this mystery girl? Apparently she dropped something, but it couldn't be... it belongs to the plain-looking bookworm Aya Toujou. This introduction pretty much describes the majority of Ichigo 100%. It is 100% about judging people and actually not having to act; why would you when girls land in Junpei's lap left and right?\r\nIchigo was an extremely ecchi show for its time, though by now it comes across asonly \"standard\" ecchi. Honestly after watching many works in this genre, this is not one of the stronger ones, it is most memorable for its unique BGM and songs more so than any plot or character.\\n\\n\r\nAnimation:\\n\r\nThe animation is fair for its time but quite blurry and antiquated by modern standards. Colors and are still nice but don't expect the level of detail you'd see in a current work. The characters are drawn fairly nicely, and Toujou shows that you shouldn't judge a book by its cover. Really, all f the girls are way too nice looking for a douche like our protagonist.\\n\\n\r\nThere isn't much action here, though there is a fair amount of ecchi fan service; the protagonist does have a panty fetish.\\n\\n\r\nSound:\\n\r\nAs mentioned above, the show has a very unique vocal BGM and and a nice OP and technoish(?) ED. I didn't really think that the ED fit the series very well but it sure is catchyl. Some people may recognize the high pitched whine of the male lead as Shin Asuka from Gundam Seed Destiny. Yep... same noise... The VA cast in general is very strong and does a good job.\\n\\n\r\nStory:\\n\r\nThere was definitely room for improvement here. Girls seem to just pop into the male lead's life continuously through the series and essentially \"court\" him in their own ways to no avail. There are some nice developments here but they failed to capitalize on these (mostly held back by the lead male). The series just feels like it isn't making any progress. And the whole movie/theater club thing has been way over-used.\\n\\n\r\nDon't expect much of a conclusion to this harem as the guy is indefinitely indecisive. And the only thing worse than having a harem show where the guy chooses someone I didn't want is a show where the guy chickens out. I hoped the OVA would fix this but see that review for more details there.\\n\\n\r\nCharacter:\\n\r\nThe main male is pathetic, he epitomizes the hopelessly nice harem lead that all girls should avoid like the plague.The girls here didn't get the message and are somehow attracted to his  thick-headed, not-that-good-looking persona. For a while, I thought we were going to have a Nice Boats ending.\\n\\n\r\nThe girls on the other hand are well developed and well played. They are all unique and all express themselves to Junpei, but he doesn't do them justice. What a pity... I won't go into details on the gals as they're perhaps among the few things that are worth discovering here.\\n\\n\r\nValue:\\n\r\nThere are moments of humor in this but not enough to put a serious comedy tag on it. There is likewise occasional tension but nothing terribly excitable. Despite my like of strawberries, I'd have to say this is a show to pass on due to a lackluster story and a lame lead.",
            "date": "2015-12-07T23:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 205008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=205008"
        },
        {
            "content": "A thrilling ride from beginning to end. The love story leaves you on the edge all the time. For those out there, there is plenty of fan service. the songs are catchy especially the ending theme.",
            "date": "2009-01-12T05:19:00+00:00",
            "helpful_count": 9,
            "mal_id": 11385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104340.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zetsuei99",
                "username": "zetsuei99"
            },
            "url": "https://myanimelist.net/reviews.php?id=11385"
        },
        {
            "content": "Let me start this off by saying I am not a fan of harem genre animes in general. They're often cliche, boring, and lack interesting romance. But there's plenty of harem animes I enjoy, and even some I love. Ichigo 100 was not one of them.\r\nStory: 3/10\r\nThis is the MOST SORRY EXCUSE OF A STORY I HAVE EVER SEEN!!!! Sao did it better. No joke. At least it had a story. Idk what Ichigo 100 did. Romance?\r\n Think again kind sir, cuz it most certainly was not.\r\nSo we get our typical harem protagonist and the typical girls that are crazy for him. Blah blah blah,the usual. But the story never GOES anywhere. Just when he thinks he finally picked a girl he likes he suddenly sees one of the other girls and his feelings waver. Oh joy, my least favorite trait of the protagonist. And spoiler, it goes unresolved. And he gets none of the girls. Big whoop.\\n\r\nBasically here is the story:\\n\r\nFilm enthusiast is really good at getting in compromised situations  involving the panties of the female characters.\\n\r\nIf you like that, you'll enjoy. Romance? Hmm gotta look elsewhere bud.\\n\r\nThe most romance this anime has to offer is the relationship between Manaka (protagonist)  and Toujou. It is very cute, well-developed, and has a strong building history. However she is nothing more than a girl in his harem. The reason the anime even interested me enough to give it a 6, is because I thought their relationship would progress. I wanted to give that potential a chance. \\n\\n\\n\r\nArt: 8/10\\n\r\nfor a 2005 anime especially, the art is relatively attractive. It's pretty cute and overall I have no issue with it.\\n\\n\\n\r\nSound: 8/10\\n\r\nThe ops and ends are catchy and I enjoyed them a lot. The soundtrack is also pretty nice. Nothing too much standout, but it was good nontheless. \\n\\n\\n\r\nCharacters: 6/10\\n\r\nThe characters were are all pretty interesting. The problem was just that they lacked development and story progression.\\n\\n\r\nManaka: He has a strong passion for film and filming that sticks with him throughout the anime. But his dumbness ruined his character. He spent the entire anime trying to choose a girl and talking to himself about who he liked. Then it seemed he was finally waking up and making a decision, only to go back to square one the next episode. This dumb pattern filled the whole anime and wasn't even resolved in the end. He's all worried about hurting people's feelings, which is nice and all, but he'll never get anywhere in life.\\n\\n\r\nToujou: she's the mysterious, shy, and timid girl who has a passion for writing and wants to make movies with Manaka. She's the blushy, runs away when stuff gets serious type and has been in love with Manaka since very early in the series.\\n\\n\r\nNishino: she is the studious, popular idol girl who falls for Manaka after a misinterpretation in middle school. She goes to a different high school and pops in on occasion. Her relationship status with Manaka  is very confusing. She is a likable character, and isn't pushed around easily by Manakas annoying ways, even though she has feelings for him.\\n\\n\r\nSatsuki: she's the tsundere of the series. She's energetic, playful, and athletic. She is first cold and mean towards Manaka, but eventually falls for him too in the typical tsundere way. She becomes very aggressive with trying to get her love across. For the tsundere, she isn't terrible, I just don't like them in general. \\n\\n\\n\r\nYui: Manakas childhood friend who basically will randomly get random ecchi moments with him. She is mostly used to fill a character space and isn't very likable or plot progressive.\\n\\n\r\nThe other two supporting males are typical supporting male characters. They aren't awful but none of them progress the plot any which is really stupid and sucky. With the addition of more girls in his harem, the characters are technically the same beginning to end. Satsuki isn't as tsundery and Toujou is not as shy, but romantically there's no even a moresal.\\n\\n\\n\r\nEnjoyment: 5/10\\n\r\n I obviously did not enjoy this anime. Simply because the romance sucked and the protagonist was an idiot. It was a pain to watch and made me bang my head into the wall so many times I probably have a concussion.\\n\r\nIf you wanna see a stupid guy look at cute girls' panties, boi I found your anime!\\n\\n\r\nOverall: 6/10\\n\r\nLike I said. It's the perfect example of what I hate about harem anime:\\n\r\n-cliche\\n\r\n-LOW story progression\\n\r\n-dumb main character \\n\r\n-indecision that eats up the whole anime \\n\r\n-LACK of romance \\n\r\n-end of episode teases that get erased each new episode \\n\r\n-ecchi overload\\n\\n\r\nIts terribly formulated and progressed, and mechanics-wise deserves a 3 or 4, but it DID succeed in keeping me interested so thus the higher rating. I rate based on how much an anime interests me, so even crap can get a higher score than it deserves.\\n\\n\r\nEcchi and harem fans will love this I'm sure, but as a romance fan, this one belongs in the trash.\\n",
            "date": "2019-03-04T17:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 302910,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5037383.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Raichibi",
                "username": "Raichibi"
            },
            "url": "https://myanimelist.net/reviews.php?id=302910"
        },
        {
            "content": "Ichigo 100 was a really nice manga with nice illustrations and soothing plot, so it was quite evident that the anime adaptation  would be highly anticipated, when the good news came that \"Madhouse\" would be the one doing the adaptation, it was natural that it would pique my interest...\r\nBut my my wat a dissapointment it was.\r\nSEE the thing was that madhouse decided to make it a low budget show putting up an amount of 5$ per frame and a very less amount of frame per second , overall leading to really poor quality,there were a lot of still frames and i mean extremely highno...the art seemed like 1980\"s though it was supposed to be a modern setting.\\n\\n\r\nMoreover, they skipped out a lot of important plot from the manga in order to fit into the 12 episode length it leads to a rather pathetic plot with zero character development...moreover sound track was indeed pathetic, it stayed the same for almost the whole anime....voice acting was below par and it just lead to harsh unpleasant voices to the ears\\n\\n\r\nFinally, i would conclude as read the manga, itvis worth your time but definitely not the anime (3/10) overall",
            "date": "2016-08-19T06:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 227113,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5302456.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/akash_kise",
                "username": "akash_kise"
            },
            "url": "https://myanimelist.net/reviews.php?id=227113"
        },
        {
            "content": "I'm not all for giving a lengthy review about this anime, so I'm just writing my thoughts shortly.\r\nI read the manga, and I mostly enjoyed it because I love Mizuki Kawashita's drawings. The artwork in the anime is decent, but lacks the subtleties of the manga art. I did not really like it, but figured it was just because it's harder to get that kind of art in anime.\r\nThe story is not exactly top notch in the manga, but I feel even less affected by the anime... There are too many moments where you'll think every girl should just drop Junpei and go lesbian, causeall the male roles are somewhat dull.\\n\\n\r\nJunpei is a crappy main character to boot, but it gets worse as the serie continues. He is the sole reason I am rating the characters as low. The female roles are standard archetypes, that may be an issue but they are given figure good in my opinion.\\n\\n\r\nOverall, I had a hard time finishing this, mostly because I already read the (better quality) manga and I couldn't really enjoy the different artstyle either.\\n\\n\r\nIf I'd tell anyone about this series, I'd recommend the manga rather than the anime tbh.",
            "date": "2012-01-03T14:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 50851,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/832371.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Marcusthemad",
                "username": "Marcusthemad"
            },
            "url": "https://myanimelist.net/reviews.php?id=50851"
        },
        {
            "content": "Where can I start from?\r\nWhen I heard about this anime I thought it would be good to give it a chance, but… why did I do it?\r\nJunpei Manaka is a high school boy whose dream is to make movies. One day Junpei goes to the rooftop and a girl falls over him and the first thing he sees it’s her underwear of strawberries, he has a glimpse of her face and he can’t say a word, he stares at her. She leaves and Junpei realizes she left a notebook and decides to know who she is to give the notebook back to her. Frustrated bynot getting any clue of which that girl can be he’s challenged by his friends to ask out a girl called Tuskasa Nishino. He asks Tsukasa to go out doing exercises, she finds it funny and accepts. Everything goes right in the relationship for some time until one day, they tell him the owner of the notebook is a girl called Aya Toujou, the best student of the high school. Attracted by his skills in writing and in the need of help in some subjects he asks Aya to help him. During a study session, Junpei realizes he likes her because she’s a bit shy, kind, intelligent and because of her skills to write. From that moment he won’t know which girl is better for him. Impressive, right?\\n\\n\r\nIn his new school he makes a movie club with some of friends including Aya. During this new period he’ll meet a girl called Satsuki Kitaouji, she’s pretty and brave, something he likes and falls in love with her. Later he realizes he’s really in love with Aya too, and he’s still in love with Nishino and he can’t decide who he likes. That’s all the anime. Yes, it’s sounds non-sense because it is.\\n\\n\r\nFrom the first time you realize this anime is not a big budget one just by seeing the opening, it’s was easy to make and the song is one of those you won’t remember. The same happens with the ending except the song it’s better. The animation of this anime is dull, not complicated, is like made by anime students.\\n\\n\r\nYou have to skip this anime because nothing happens, the characters aren’t developed enough and at the end you finish empty as the main character.\\n",
            "date": "2015-06-08T11:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 189860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4273715.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/bardanime",
                "username": "bardanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=189860"
        },
        {
            "content": "All romance-oriented shows have a goal that a character - or characters - is/are striving to achieve. In the romance genre the case is always thus: to develop the relationship between two characters significantly enough that it becomes more than a friendship. In the case of Ichigo 100%, and, sadly, most romantic harems out there, the aforementioned statement of the underlying goal of romance-genre animes is missing. \r\nIt’s a fault that's hard to overlook. It would be equivocated to a blanket that only covers your torso and legs, but not feet; you remain uncomfortable, constantly twisting and pulling to right the position but… you cannotchange the length of the fabric. Do not be misled by the seemingly quick start the show gets off to (as to be expected from a 12-episode-long series). Although it starts like something shot out of a cannon, expect the same mundane situations predictably repeating itself until you find yourself thinking what will happen next, looking at the screen, and shrugging to yourself – “That’s another correct for me. Ichigo Originality: 0, Me: 12.”\\n\\n\r\nAnother thing that can be deceptively enticing is the way that all girls are fairly represented in terms of Junpei’s (our hero) feelings towards them. Each girl, so to speak, is “kept in the running” for longer than you might expect, hell, I think they might still be running. This “everyone is even” approach will most likely leave you rather intrigued during more “ecchi” and jealousy scenes (the latter mostly involving Satsuki), but during the later episodes wondering and waiting: when and who? Don’t get me wrong, I think in harems that a lot of competition is good at the beginning, but as the show progresses, a thinning of the “crowd” is a must. If it cannot be achieved the viewer (like me) will just get flustered, confused, and annoyed with the hero. \\n\\n\r\nThat leads me into my next major gripe about the series: Junpei might be the most annoying protagonist I’ve encountered in my short – but thorough – adventure into romance anime. The dialog for his character makes me feel like the writer for said lines was “out to get us” for some unknown action. You want to shake him (Junpei) and say, “No. Say this: ___.” This may seem trivial because frustration/awkward situations come with all romantic animes, but when compounded with the indecision already taking place, it’s exasperating.\\n\\n\r\nLooking back though, upon hearing the voice actress for Tojou (one of the female love interests) first speak, I should’ve known this would be THAT kind of anime. The voice actress of Tojou is played by the same actress that voiced Haruka for the “Nogizaka Haruka no Himitsu” series. She has a great voice for the kind of role that’s being portrayed, but in the back of mind I was thinking, “It can’t turn out like the first and second seasons of ‘Himitsu’, can it? *After the final episode* Ugh.” (I do know that 100% came before Himitsu.)\\n\\n\r\nThe animation could be considered a tad bit dated, but the overall affect is present and it doesn’t detract from the show at all. There are a few scenes, especially in the more “zoomed out” ones where the art is a bit sketchy. The art does seem to improve greatly in the OVAs. though.\\n\\n\r\nI have to admit that I got sucked into this anime’s ploy by buying into the rocket-like start and loved the show immensely. Then as it went on I grew more and more wary of the string by which the show was pulling me along (rather effectively, I might add). I wanted a drastic change and remained blissfully ignorant to the fact that the show wouldn’t answer in kind. So learn from my blunder: if you’re like me and want a definitive resolution: he ends up with her, caution, I pray you. But if you don’t care about that, but like the genre and premise of the show, give it a try.  \\n\r\nOverall: 6\\n\\n\r\nStory: 7\\n\r\nThe way the characters are introduced through the story is a familiar, but it still leaves a nice affect.\\n\\n\r\nArt: 7\\n\r\nIt is a little dated by our standards, but it doesn't hamper the anime whatsoever.\\n\\n\r\nSound: 8\\n\r\nThe voice acting and tracks were solid. The voice actress of Tojou was cast perfectly.\\n\\n\r\nCharacter: 7\\n\r\nEach had a distinct personality and you could really see why Junpei would have such a hard time deciding who to \"choose.\" However, the score is lessened because of the hero, Junpei. \\n\\n\r\nEnjoyment: 6\\n\r\nAt first it was a 12. But as the anime progressed I wanted to see a progression in the relationships between Junpei and one of the girls that was significant enough to have a clear \"winner.\"\\n\\n\r\nFeedback is appreciated!",
            "date": "2010-02-16T15:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 23271,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=23271"
        },
        {
            "content": "For an ecchi genre anime this one is pretty well done and surprisingly I enjoyed it. The moments and the longing for each other gets repetitive but with nice variations, such as adding an additional character, event, etc. made the series very fun to watch.",
            "date": "2009-01-31T20:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 12006,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/144999.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/critic",
                "username": "critic"
            },
            "url": "https://myanimelist.net/reviews.php?id=12006"
        },
        {
            "content": "Very good story, had me wondering which one he was going to pick, then bam! the end of the story left me hanging. Good anime, but no sense of completion.",
            "date": "2009-03-29T21:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 13595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/95203.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rinoko",
                "username": "rinoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=13595"
        },
        {
            "content": "****There are spoilers in this but I don't think it matters much because it kind of serves as a warning for what you will be getting into (not that this is a bad anime in anyway).****\r\nNow, if you are going to watch this anime there are a couple requirements: 1. You must have plenty of time to spare and 2. Be watching it for the girls in it, it is a harem afterall.\r\nI can not emphasize this enough. If you are watching this for some reason other than the artwork, ecchi scenes, or romance in it then you are probably in the wrong place.\r\nStory (5/10):\r\nThestory revolves around a perverted kid (big shocker, I know) in his last year of middle school (the story covers between this time and up to, I think, his second year in HS).\\n\\n\r\nYou see the story begin when the Manaka discovers this girl's (Toujou's) notebook which has an apparently fantastic novel written in it by her. The protagonist Man (Manaka from now on) reads it by accident and when he goes to return the notebook emphasizes how good it was and tells her she should be a novelist. He also opens up to her a bit, explaining how he aspires to become a film director. She is so touched by the fact that he complimented her novel so much that she decides to follow him to the highschool he wants to go to (she picks his highschool over her highschool that would be better suited for a smart girl like her). At this point he suddenly confesses, get this, to some other girl (Tsukasa) he barely knows over Toujou who he so clearly has common interests with. He confesses to Tsukasa in an extremely exaggerated, ridiculous manner which somehow convinces her to go out with him. So that is the force stopping Toujou from getting closer to Man, however soon after this it becomes obvious to Tsukasa that Man likes Toujou so she pretty much says to Man, \"You seem to have your eyes on Toujou so instead of going to the same highschool with you I am going to a different all-girls school, even though we are not going to the same school I am not giving up on you. . .\". Personally in that situation I think that the more logical approach would be to just let him get it on with the girl he actually likes, but this is a harem we are talking about so... \\n\\n\r\nMoving on.\\n\\n\r\nThe day before Man's first day of HS, we are introduced to Satsuki and in the most ecchi way possible (well, that s an exaggeration). Man is testing out his new camera he got from his parents, he spots this girl by the lake, begins filming and then... Oh no! A gust of wind comes rushing by! This was probably the wrong day to wear that skirt dress, Satsuki you foolish girl. She then proceeds to tackle Man in an attempt to erase his footage, and he ends up grabbing her tits. Yup, this is what I am watching. And I do not feel ashamed one bit.\\n\\n\r\nSomehow our protagonist, Man, turns into a huge gentleman and Satsuki can't help but fall in love with him.. Not sure how that happened... AGAIN. Only difference this time is that the girl is getting all lovey-dovey in public. \\n\\n\r\nSatsuki and Toujou are easily likeable characters, if not the most likable in this anime, but that is just my subjective opinion. Thats all I am gonna cover story wise\\n\\n\r\nArt (9/10):\\n\\n\r\nI personally loved the art in it, particularly the female characters looked really appealing visually. This is emphasized in the OP \"SHINE OF VOICE\". \\n\\n\r\nSound (9/10):\\n\\n\r\nThe OP is really good (easily one of my favorites of all time) and I especially loved the soundtrack that would play whenever there was some sort of ecchi scene occuring. For some reason I found that particular soundtrack hilarious and enjoyable. Not sure why it would make me laugh inside, may have something to deal with the fact that it was just someone melodically singing \"Chuchuwa fufu Chuchaa\" in a very late 90's tune (maybe idk, i don't remember the 90's too well, I was 4 in 2000). It's just hilarious. DO NOT ask me why.\\n\\n\r\nCharacter (8/10):\\n\\n\r\nThe development between the characters was OKAY. I felt all of the girls had enjoyable \"personalities\" especially Satsuki and Toujou. Everyone else was okay, in my opinion.\\n\\n\r\nThen again if you are just watching for some semi-highschool romantic situations (like I was) not even slight issues will really bother you. All the characters are pretty cute.\\n\\n\r\nEnjoyment (9/10):\\n\\n\r\nI really found myself enjoying this series, it had good characters, great art, and some great ecchi scenes mixed in. There is also the sexual frustration (not sure if this is the right word) between the protagonist and the girls. I was able to keep myself fully awake past midnight watching this.. ON A SCHOOL NIGHT. It's not really a big deal i know, but I have to be really fixed on something to be able to not fall asleep.\\n\\n\r\nOverall (8/10):\\n\\n\r\nAssuming you are or plan on watching this for sexual situations, decently good characters and ecchi stuff then you will most certainly not be disappointed. The art is great, characters are exceptional and plenty of ecchi to go around. This is not meant for everybody so if you are feeling iffy about then just. . . Don't.\\n\\n\r\nWhether you agree or not with my review then please leave some feedback, as I am rather inexperienced with writing reviews :). Thank you very much.",
            "date": "2013-12-15T14:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 123967,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2629033.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Jaycalli50",
                "username": "Jaycalli50"
            },
            "url": "https://myanimelist.net/reviews.php?id=123967"
        },
        {
            "content": "A good ecchi with some great humor. Almost like a harem, the anime stays fresh with a little rejection of the main character. Instead of everybody going head over heels for him, there's one girl who switches up the story, and keeps the story moving.\r\nOnly problem for me was that there was no definite solutions to the love problems and many feelings are lost in translation.\r\nOver all i give this anime a 8/10, nothing special, but it's a well rounded story.",
            "date": "2009-03-31T23:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 13695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13695"
        },
        {
            "content": "Well, it wasn't awful, but it most definitely was not the best in the world. Normally, I'm a big fan of fillers since they can be quite hilarious. This 12 episode anime, however, didn't really have much of a plot. There was one, obviously, but it was mainly a \"Let's see how many times we can make it perverted.\" \r\nInstead of the perversion, the makers of this show could have expanded on the plot more and the conclusion may have been better. To end it the way they did just was not right. \r\nThe only way I would truly recommend this show is if youcan't think of anything else to watch and just want something to pass the time.",
            "date": "2010-06-19T17:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 27360,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/343477.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SoftCoyote",
                "username": "SoftCoyote"
            },
            "url": "https://myanimelist.net/reviews.php?id=27360"
        },
        {
            "content": "I don't know where to start off, but its a total dissapointment to me since theres so many things its not complete on the anime. The manga is just a better way to go along with the series, at least it went all the way unlike it cuts off on a ceartin point like the anime.\r\nIt starts out alright for a few episodes then its just becomes repetitive on alot of scenes. My conclusion: Fails as anime series, Good as Manga series.",
            "date": "2009-06-17T00:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 15823,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194998.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/xDoN904",
                "username": "xDoN904"
            },
            "url": "https://myanimelist.net/reviews.php?id=15823"
        }
    ],
    [
        {
            "content": "I really like this show, that's saying a lot since I strongly dislike the Harem Genre. This show is just good, unlike most of the others of the same genre, although it isn't that unique as it still has the same things that you would find in your average harem show. What makes this show unique are the 4 female main characters. They were the reason why I kept on watching this show, otherwise I would've just dropped it, since the MC is such an Idiot, well it is to be expected since all harem MCs are Idiots lol. I particularly liked Satsuki as sheis the most unique female archetype out of the 4 female leads in my opinion, the rest of the female leads we've seen before. \\n\\n\r\nI've gotta give kudos to the character designers. The character's design is just amazing, especially for the 4 female main characters. It's a mix of early 90's and a bit of late 2000's type of character design. Animation is kind of meh though, well it's to be expected for a show aired in 2005.\\n\\n\r\nThe opening song, 'Shine of Voice' is just amazing. I get the 90's kind of vibe from the song, and it just makes me want to dance, same goes for the ED.\\n\\n\r\nOh and #fucknishino",
            "date": "2017-04-02T06:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 244328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4501090.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lawrencekun",
                "username": "Lawrencekun"
            },
            "url": "https://myanimelist.net/reviews.php?id=244328"
        },
        {
            "content": "Well...I can't say that I fully enjoyed this anime...Like a dude sayed in his review about this anime...The main protagonist of this anime seems way to retarded...He allways hurts other's girls feelings and when he is witha girl he like's he sudenly think's of another just to make the girl she is cry...If It were by me...I would shot Jumpei with a shootgun...All girls were way too good fro him...Apart from the retaded protagonist I really liked this anime...The girls were beautifully created and had some unique traits...Not to say that the situations I saw in this anime hapened to me alot [the situations whenyou are totally hopeless and don't know what to talk with a lover on a date T_T -] ...The character wich I loved the most had only 1 episode If I can say that Jumpei thinks of her more of a childhood friend[Yep...is Yuy-chan",
            "date": "2010-07-28T02:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 29023,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313513.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shiro-",
                "username": "Shiro-"
            },
            "url": "https://myanimelist.net/reviews.php?id=29023"
        },
        {
            "content": "This anime, in all honesty, it the strongest waste of my time I've ever had regarding anime. The characters, story, art, and everything are just horrible. There is less development and character depth in the entire twelve episodes then I've seen in many single-episode OVAs. Pitiful, truly pitiful.\r\nStory: 2/10 | Art: 5/10 | Sound 5/10 | Character: 2/10 | Enjoyment 3/10 | Overall: 3/10",
            "date": "2015-07-10T19:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 192922,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4668707.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/gwennie-chan",
                "username": "gwennie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=192922"
        },
        {
            "content": "I think this is typical comedy anime, but still it's so awesome and funny! Story is funny and good, it's not dull and well I enjoyed it very much. I got many laughs in this anime.\r\nArtwork is good, this anime has been done well. It's clear and wonderful^^\r\nSounds are very good, sound effects are great and voice acting (Japanese) is so awesome! I don't like english voice acting because on my mind Japan's have more feeling on that or something like that^^.\r\nCharacters are great, so many different things on them, I mean everybody isn't like same, they all have different things to do and waysto act, I don't know how to explain that but still characters are great.\\n\\n\r\nEnjoyment is very good, I enjoyed this anime because it's story and funny parts made it so good, and that's how I like it^^\\n\\n\r\nOverall I think this anime is very good for those who like harem and comedy anime series, this is really worth watching and I prefer this very much! ^_^",
            "date": "2009-06-09T12:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 15608,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/180835.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Heketeus",
                "username": "Heketeus"
            },
            "url": "https://myanimelist.net/reviews.php?id=15608"
        },
        {
            "content": "Don't exactly know where to start with this one. I suppose because it was one of those series of anime where I actually read the entire manga series first so probably understood the story and characters prior to me clicking the play button. I was wondering on how it was going to stand against the art on page and see how they play the story out. Remarkably for an ecchi anime based off manga they did pretty well.\r\nWell story wise this is one of those anime that start off with the standard ecchi plot single guy in high school has about as much experience withgirls as half of the intended target audience. There is a couple of jokes thrown in here and there but not always sexual. Maybe someone actually got their heads around that otakus aren't (all ) just after an anime where cleavage bounce around like posessed melons and panty shots actually increase art and storyline.\\n\\n\r\n The main character Junpei slowly develops a harem and has to figure out which girl he likes the most, just like every harem anime ever invented. And like all harem protagonists Junpei lacks any ability to decide who or what he is after, as he is deciding to look for the one girl he saw on the school roof who happened to have strawberries on her panties which of course like any Japanese man in anime (or reality?) has some sort of immediate visual recognition software installed in his brain which lock on to said fabric on the girl and the anime decided this is time to start the story. \\n\\n\r\nKudos to him for having an aim, but the fact that panties were involved as a plot device in the story of the manga and anime makes me laugh as though someone catapulted a squirrel cruelly over a garden fence when they realised I was watching. I found it funny but I feel bad for laughing.\\n\\n\r\n Unlike most harem anime. The characters progress with their story lines and it doenst always go well for any of them all of the time. There are Breakups and fallouts which is good to see. Anime like your To love ru and Rosario vampire to list a couple. Are bland in the idea of relationships. No permanent relationship scars or any progression. With most harem you could just lock them all in a house and there would be no difference from one episode to the next. Constant pantie shots and girl fights that get stopped as soon as protagonist dude gets throttled to death in cleavage like a James bond assassin was present.\\n\\n\r\nThe art was as good as any and had a decent look. Sound was ok. I didn't want to cover my ears over screeching voice actors or sound effects. Opening song was ok as the closing. If I heard it I could place it.\\n\\n\r\nAs for ichigo. I'd recommend watching the anime first. Read if you enjoyed it. The anime is cut down and the manga is improved in ways that only a book could.",
            "date": "2017-01-08T17:28:00+00:00",
            "helpful_count": 0,
            "mal_id": 237822,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4880841.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tony91uk",
                "username": "Tony91uk"
            },
            "url": "https://myanimelist.net/reviews.php?id=237822"
        },
        {
            "content": "Most of us have seen a harem show at some point in our lives and while each harem does appear to have a unique story and setting they are all linked by similar patterns that one can begin to discern having watched a dozen or so different harem shows. \r\nFor instance, harem shows are known for containing heroines whose personalities starkly contrast with each other. A tsundere, an intelligent and polite girl, a klutz, a whimsical seductress etc... and for a certain reason - a handicapped male lead. Now this handicap may be physical or psychological or even cultural, or all of those, but itis there to make the male lead appear inferior to the females and thus create this Freudian image of motherly figures who eventually pamper and smother the male lead with affection; except they're not his mothers - they're his romantic interests. There are plenty of examples for this, Girls Bravo, To Love-Ru, Da Capo, Happy Lesson etc. \\n\\n\r\nNow why did I just make you read a paragraph that looks like an excerpt from a BS Psychology seminar? Very simple - that paragraph is Ichigo 100% and the entire harem genre summarised. \\n\\n\r\nThe characters, the setting and the story here are all textbook harem templates modified to fit the title of the series. There is however one unique quality that sets this series apart from any other harem I've watched so far - the male lead, Manaka Junpei. The handicap on this fellow is astronomical to say the least.\\n\\n\r\nThe female cast appears to be fairly regular. We have the genius bookworm Aya Toujou, the whimsical seductress Satsuki Kitaouji, intelligent and polite Tsukasa Nishino and the childhood klutz Yui Minamito. The interactions and progression between the characters is fairly regular and the synopsis covers the gist of the story well so instead I'll delve right into what I liked and what I didn't like about this anime and where you - the reader stand in all of this.\\n\\n\r\nI liked the female cast. They were actually fairly realistic portrayals of teenage girls. I liked the way they were presented and the fact that they were all given a background story that related to the male lead. Some harems omit this step and instead go straight for the fan-service and plot progression. I liked the fact that they never acted out of character and the writers did a superb job at giving all of them more or less equal screen time. \\n\\n\r\nNow, I didn't like the male lead. This character is the most retarded creation in the world of fiction that I've had the displeasure of stumbling upon. This guy would not survive a single day in real life. This is is the type of person who wouldn't know seduction even if you shoved a sex starved porn actress right in his face. Junpei Manaka is one fucking mess of a man. This character will maniacally go from \"That girl certainly likes me\" to \"I'm the least popular guy in school\" in a matter of seconds before jumping back to the first conclusion given positive female stimuli. He goes around arousing girls all day and then pushes them away when they jump on him because what they're doing is all inappropriate only to nonchalantly arouse them again later and repeat the whole process every.single.episode. Are you fucking kidding me!? Is this meant to be a joke or were the writers being a sadistic bunch of villains with childhood issues?\\n\\n\r\nI do not know the answer to those questions. What I do know is that I did not enjoy that aspect of this anime. You always want to see closure to a romantic situation and this anime just did not do that a single time. \\n\\n\r\nApart from the cast and the plot the art and sound departments were nothing special. They weren't bad but did not merit a high score either. I found the quality of this piece to be fairly average. \\n\\n\r\nEnjoyment wise, Ichigo 100% is a bit of an oddball. I did enjoy it but absolutely despised the male lead with a passion. I think it's probably the female cast in this show that really saves it makes it actually enjoyable. Of course, if one likes retarded maniacal male leads, the enjoyment of this anime may rise substantially but that's to each individual to decide. \\n\\n\r\nThank you for reading.\\n\\n\r\n6/10\\n\\n",
            "date": "2014-10-02T13:08:00+00:00",
            "helpful_count": 0,
            "mal_id": 163305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=163305"
        },
        {
            "content": "The whole anime is passable(judging from a general view). Actually, the storyline is deviant from the original manga. There isn't a transparent ending in the anime.\r\n The anime apparently treats Toujo as the No.1 heroine and Nishino in the second place, which in the manga is the other way around I think. In the original story, Junpei and Nishino has the sex relationship at Nishino's home and eventually Junpei chooses Nishino as his girl when Nishino comes back from France, but not Toujo, who is then a novelist. Anyway, it's a competition merely bewtween East(Toujo) and West(Nishino), other girls are not in this virtually fiercewar and convoluted relationships(including Satsuki).\\n\r\nFortunately, I like Nishino better than others so the ending satisfies me properly. Toujo is too weak in character to be recognized.",
            "date": "2010-09-05T08:14:00+00:00",
            "helpful_count": 0,
            "mal_id": 30251,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/210789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xsd121",
                "username": "xsd121"
            },
            "url": "https://myanimelist.net/reviews.php?id=30251"
        }
    ]
]