[
    [
        {
            "content": "Owarimonogatari season 2 is the conclusion, final chapter, to the main storyline presented since Bakemonogatari in 2009. And to say that it was a long time coming would be an understatement. It has been nearly a decade since I fell in love with this anime. While it has had its ups and downs it never became intolerable. For anyone who kept watching this series for this long or joined the train, enjoy the finale. \r\nMayoi Hell and Hitagi Rendevous are arcs with essential information that is needed to be build up before reaching the final boss. The final boss known as Ougi has been foreshadowedfor some time now. Who is she? Where did she come from? We will have the answers to all our questions in this arc. All the pieces that have been lingering will finally connect. \\n\\n\r\nMayoi Hell consists of Ararargi going to hell after being intentionally killed by Gaen. If you haven't watched Koyominonogatari by now you should go back because it is very necessary. As well as obviously watching the rest of the series that has aired beforehand. Visually it is an extremely fun episode and seeing Ararargi and Mayoi banter after all these years is great. We saw them send each other off in the Second Season in a touching moment and in the Final Season, we see the wonderful reunion. The music that accompanies the touching moment towards the end pulls at your heartstrings. Can you call it manipulative? Sure but it sure has hell worked well. The comedic timing can be abrasive and I say this in a positive way. It's an onslaught of comedy smacking in your face with animation shifting from cartoony back to on model. With sprinkles of deep dialogue, we get a traditional Monogatari script. The most important element of the arc is Ararargi showing his attitude towards life changing but his heart remains the same. He will always want to save people even if he went back and did things again. However, he still shows some regret in the approach he took and how he could have improved on it. Anyone who has been interested in Ararararararagi's character development will be satisfied seeing him converse with Mayoi. In the second half of the arc, we are met with a character that was first introduced in Tsukimonogatari. To not get spoilers they converse about why Ararargi had to die and come back to life. This arc truly benefitted from the TV Special format because they were a ton of different settings being presented as Mayoi and Ararargi take a journey to meet the man who will bring him back to life. The animation quality was astonishing far better than what we saw in Owarimonogatari season 1. \\n\\n\r\nHitagi Rendevouz isn't just a filler date between our main cast and heroine. While Hitagi takes a large chunk of her self-proclaimed arc, Ougi Oshino interrupts to speak about the important implications that were presented in Mayoi Hell. Ougi's near threatening dialogue and the sound design gives me chills down my spine when hearing her speak to Ararargi. Without having any knowledge of the next arc, Ougi Dark, you feel anxiety throughout. But wait wait wait let's get back to the date between our main girl and main boy. Hitagi probably looks the most beautiful here than in any other series. While this is obviously a personal feeling I had to put it in the ethersphere. But being beautiful isn't just about the character design, shaft really kept up with the animation and kept her on model almost throughout. With the obvious exception of comedic animation shifts. The backgrounds are rich and full of life as Hitagi, with her new driving license, takes out Ararargi on a date. The date itself was very charming. The most befitting to a 6 months relationship. To the viewers, it has been 8 years. \\n\\n\r\nOugi Oshino is Ougi Oshino \\n\\n\r\nWhat makes this arc very different than most arcs is that it is a bit mature, not as mature as Hanamonogatari was but close. We don't see much fan service and we see a lot of reflection of the past. Its a somber ending. I am glad we are at the conclusion. But do not fret there are more novels to be adapted which will be. While they might not hit as hard as these arcs in this season it will still be a joy to watch. \\n\\n\r\nThank you for the best 8 years of my life Nisio and SHAFT.",
            "date": "2017-08-12T13:54:00+00:00",
            "helpful_count": 517,
            "mal_id": 255276,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3705359.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/moodie",
                "username": "moodie"
            },
            "url": "https://myanimelist.net/reviews.php?id=255276"
        },
        {
            "content": "\"Everyone sees what you appear to be, few experience what you really are.'\r\nThis review does not contain spoilers. This review is not made by a blind fanatic or a hater who has nothing better to do, this review is made by a person who saw this series for more than 8 years of his life.\r\nI'll be honest and I'll go straight to the point. I will not speak with fanaticism in my words, I will write just the truth about these episodes, my truth, nothing more and nothing less. I have no sweet words to these episodes, so if you can't digest a different opinionthan yours I ask you to not continue reading my review.\\n\\n\r\nI want to clarify this before I start, I'm a fan of this series since the day it was released in 2009 and the second season is in my top ten favorite anime of all the time, so you wonder why I did not like this part? and the answer is very simple, I do not like this part because it concentrates everything that is wrong with the last works of the Monogatari series by the acclaimed Japanese animation studio shaft and directed by Akiyuki Shinbou, oh wait a moment is not even him who directed these episodes, that makes so much sense and at the same time so little, Shinbou why do you disappear when the fans of the old times need you more than ever? oh, I see you're a captain who does not sink with the ship, intelligent move on your part, traidor. \\n\\n\r\nOne of the clearest problems is the speed with which the story advances, being so fast does not create a sense of importance in the events that occur in the story, at one point we are with a scene that pretends to be emotional and full of stress and the next moment the protagonist is making jokes about the underwear of a minor and you can tell me that that always happened with the Monogatari series but this time it is in a more clumsy, notorious and completely out of place way. \\n\\n\r\nIt is really depressing and insulting for a lifelong fan to see that the mistakes of the past have not been corrected and not only that, but that the problem has been aggravated in such a stupid way that you can not do anything more than pretend that you did not see anything. I was the best accomplice of this series and I did not give importance in the past but I got bored of the same grotesque joke again and again, which leads us to the following problem with these episodes, which is the repetition of the same old material, these episodes only repeats the same jokes and ideas that in previous seasons, these episodes did not innovate at all and you know what is worse than that? is that the people behind this work does not even try or care about the fact that they are just recycling the old stuff over and over again, they are hitting your head over and over again with the same old ideas and jokes until you say enough and I'm a fan who got tired of this deal, it is no longer funny, it is not innovative anymore, it is not even artistically pleasing as it was before. It's just an endless number of memes that died a long time ago. They pretend to be funny when it's just a lot of trash that they're recycling to not create anything new. Why strive to create something new if the old is accepted as something with some value. \\n\\n\r\nThese episodes suffer from not giving much explanation to some important events that occur in the life of the characters, how convenient is to not explain anything and just move forward as if this were a race but the production team can take the time to do the same joke again and again, so it is not a problem of time, they simply do not care in the desire of the fans, \"give us your money and go away\". Also includes many characters that are only present for a brief and insignificant moment, this is an insult to the characters themselves and fans of these characters, an absolute disgrace. In other occasions the characters act as if they were a stereotype of some very obvious program and they make clear what are their intentions although the series wants to generate an atmosphere of mystery, but is not a mystery if you are telling me everything directly or at least is not a good mystery.\\n\\n\r\nThese episodes are the clear sign that studio shaft loves to play safe and just want the easy money of the fans who are hungry for more material, for more empty dialogues and characters pretending to be talking about something deep when it's just about the panties of a little girl. The fans are many, they will eat whatever it is, they must create something that many will like, easy to eat and bring it to their tables as fast as possible and the result is a hamburger. this is a hamburger that instead of having interesting dialogues full of new ideas is full of the greed of the people who are in the production studio, instead of having witty and provocative comedy has jokes about the tits of a little girl and instead of taking the time to develop the characters and be careful with their emotions has recycled material fresh from the trash. \\n\\n\r\nI firmly refuse to accept this insult to my loyalty for this franchise, I refuse with all my love to accept this mistreatment of my patience and I refuse with all my passion to remain silent, these episodes were the worst I saw in the whole series and it's sad that everything has ended in this mediocre way. Each movement of the characters was predictable, each word was said in the past and every joke was repeated so many times that it is no longer funny. \\n\\n\r\nSweet dreams my beautiful monogatari series, you are no longer what you once knew to be. I have admired you for over 8 years, I laughed with your first jokes and I identify with some of your characters but after more than 68 episodes, 3 movies, 2 ovas, you're not longer what you used to be.\\n\\n\r\nI do not need buzzword like say \"masterpiece\" every 4 words to describe my feelings, I just let the heart speak and this review was made with heart and passion so I hope you understand that I do not hate this series at all, I just wish everything was better... Every moment, every word, every plot change in the story did not live up to expectation and the name of these series.\\n\\n\r\nRest in peace. \\n\\n\r\nFrom a real fan who was waiting for this moment for more than 8 years.",
            "date": "2017-08-15T20:34:00+00:00",
            "helpful_count": 247,
            "mal_id": 255561,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987930.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Akzhu7",
                "username": "Akzhu7"
            },
            "url": "https://myanimelist.net/reviews.php?id=255561"
        },
        {
            "content": "Before the review this is my personal opinion: I am so glad that this series didn’t disappoint me at all and I had such a great time watching it . Monogatari will always be one of the best anime I saw and I genuinely love it with all  my heart starting with the great characters and ending with the lessons told from each series. \r\nThis is the final puzzle piece from the Monogatari series. In this series every little detail from the other series that were left unexplained was revealed to its audience. Another worth praising writing style from the author who knows damnwell how to leave intentionally plot holes who are gonna be filled later in his future works. This is why the flaws are what makes Monogatari a great piece from the storytelling medium.\\n\\n\r\nOnce again Shaft managed to use the visuals in perfect harmony with the current action of the characters and dialogue lines to emphasis the message for its audience. As an example I will mention  the fantastic and beautiful association of each character from monogatari with a star constellation during Ougi’s explications .The dialogue is well used for the characterization and plot helping with the progression of the story.\\n\\n\r\nAs we all know the minor characters from Monogatari are so well used for the plot and characterization of the main characters and in this series doesn’t disappoint us at all . Who taught that Tadatsuru a minor character from Tsukimonogatari would had such a impact across the story in Owari 2. Let’s not forget Oshino Meme disappearance after Bake which had a purpose after all and finally Gaen who is the shining star from Owari 2 using again her brilliant mind to solve a problem. Fantastic!\\n\\n\r\nOwari 2 also manages to give screen time to the two main characters from Bake Senjougahara and Araragi. It’s always a pleasure to see Senjougahara verbal abusing Araragi but caring for him deep down in her heart proving once again why her actions are unpredictable and her personality unique. What I am trying to say is that in this series we finally see the choices that those decided to take as a couple for their future after their long fight with their own problems.\\n\\n\r\nOne of the main themes that needs to be mentioned is about change,  portrayed through the actions and choices Araragi goes through . As for each part from Owari 2 they each have a different plot and message  but they are all connected to the main story from Owari 2.Mayoi Hell is the preparation stage for Ougi Dark and Hitagi Rendevouz is the bridge that connects them . In Ougi Dark  everything comes together giving a conclusion to the Monogatari series and presenting how the actions and choices the characters made influenced their lives .\\n\\n\r\nTrust me you will not regret any moment by watching Owari 2 , you will experience  a lot of emotions through each arc and the conclusion will leave you in tears of joy and sadness.\\n\r\nThis series managed to give a conclusion to all of the other series from Monogatari and answer all the left questions. \\n",
            "date": "2017-08-13T06:17:00+00:00",
            "helpful_count": 216,
            "mal_id": 255340,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=255340"
        },
        {
            "content": "[9.0/10]\r\n_____________________________________________________________________________________________________\r\nOwarimonogatari was ultimately the end of the first, and most likely the main story of the series. These last three arcs provided a good conclusion and I wouldn't be upset if that's the final Monogatari-related product adapted by SHAFT. Although I doubt it, since there are tens of side-stories, epilogues, prologues and everything in-between left to adapt. This, however, felt like a proper conclusion. Even if it wasn't what I wanted, I can't help but feel happy about the ending regardless. \r\nMonogatari, ever since I began watching it, always left me with an air of ambivalence. If you go venture forth to the past anddig through to find one of my earliest reviews on this website, one of Bakemonogatari, you'd see exactly that. Me struggling endlessly with coming to terms with my feelings about the series. It left me feeling sleazy and gross, but compelled and intrigued. I initially described it as the guiltiest possible pleasure and while my opinions may have changed with my tastes, I think that outlines the overall complexity of emotions I felt towards the product. On one hand the presentation is outstanding and unique, hearkening back and taking from the French New Wave, but what its presenting is often perverse and over-indulgent. The main narrative is fractured and presented in a spectacularly interesting fashion with the unreliable narrator quirk, but is often sidelined for pandering sexuality. The characters are multi-faceted and endlessly dynamic, but aren't often presented as such. It is an enigma, truly. \\n\\n\r\nWhile my opinions have changed and my appreciation for this series continuously grows, due to the amount of inspiration it has given me as a creative, this idea of conflicting feelings still remains the same. Even throughout this end-story. I get a conclusion, and the conclusion is quite good with just about every story wrapping up in a feel-good bundle of catharsis. It is still something that I wasn't expecting nor really wanting from this show. I was expecting something darker, something more somber, something with pain and eventual sacrifice and I was expecting the specialists to play significantly bigger role in the story after their buildup through Owarimonogatari's first season as well as the awe-inspiring conclusion to Koyomimonogatari. \\n\\n\r\nMaybe my expectations weren't deserved and built completely upon my own desires for the series, but that feels redundant to say as that's pretty much defining expectations for anything. Owarimonogatari's second season and conclusion does have problems, however, it is packaged and delivered so well that they don't feel like problems as much as they feel like additions that I may disagree with. Maybe that's why i'm so happy to accept this conclusion even if it harshly isn't what I wanted or expected, that's my mea culpa. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\\n\r\n[Presentation] \\n\\n\r\nBefore we delve deep into the semi-spoiler conversation, I think it is safe to say that this series is the best presented television anime. While it may not be as beautifully animated as something from Kyoto Animation or as viciously energetic as a Trigger production, it is a SHAFT product through and through. Harsh yet understated, with pronounced colors and a focus on bringing the most from dialogue heavy scenes. \\n\\n\r\nThe coloring in these episodes is as good as ever, with beautiful shot-composition mixed in with spectacular changes in art-style in the first arc of this series. The other two were equally beautiful, with harsh changes of color and space, presenting even the goofiest character moments as if it is high-art strung up in a gallery. \\n\\n\r\nThe violent, stinging violins in the climactic soundtrack continuously impress. While most people may point to the admittedly catchy opening themes of this series as examples of its musical prowess, I can't help but point to what I find more impressive. The memorable backing tracks to the shows most climactic moments. From the badass theme at the end of Nisemonogatari, where specialist Kagenui flexes her muscles in a scene so brutally cathartic that it is one of my all-time favorite anime moments. To the plucking strings and winding synths of the shows most surprising scenes, when Gaen reveals her vampire-slaying sword and chops our protagonist into a thousand pieces. The music here is as wonderful as ever. \\n\\n\r\nMonogatari has never been the most animated series, and for good reason. Much like most TV-anime it is a rushed product on a deadline. However, SHAFT make even the most still scenes feel alive and vibrant with the setting and shot composition, and as always the direction here is astounding. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\\n\r\n[Story and Resolution] \\n\\n\\n\r\nPresented in three arcs, the final moments with these characters and their eventual graduation feel spur-of-the-moment. The show, for the first time ever, feels as though it has a distinct narrative purpose. Since it has one goal, to end its main story, it never decides to linger on moments that are otherwise unimportant to the series narrative. Even the second episode, the extended date between Senjougahara and Araragi feels as though it plays a direct part in the climax, Araragi's waning adolescence, Ougi's mysterious plot, and the growth between these two from a relationship standpoint. \\n\\n\r\nHowever, before we delve into that, we have the first story. Between Araragi, Hachikuji, and the involved Tadatsuru, which delivers something visually astounding and narratively intriguing, yet creates a few worries that may find themselves wriggling into the shows core climax.  \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\\n\r\n[Mayoi Hell] \\n\\n\r\nObvious spoilers. Hachikuji is back and she's in hell. Some pretty funny reasoning is provided for that. More importantly, SHAFT gets to flex its visual style to the fullest here, providing one of the most visually impressive arcs since the gorgeous Tsukimonogatari. As Araragi ventures through hell, and to a certain extent, his past, he discovers how to return and what the reasoning behind his murder was. An elaborate plan by Gaen to return his humanity. \\n\\n\r\nGood stuff. Even if Hachikuji's return wasn't all that interesting to me. Especially since we have already said our goodbyes to that character and coming back after a pretty good send-off feels as though i'm holding in a sneeze. Unrewarding and kind of painful. I like Hachikuji, she's quirky and engaging with a pretty great catchphrase that gets probably the best payoff of any joke in the series. However, I couldn't help but feel disappointed in her return as an establishment of norms and the lack of consequences. It robbed the series of some weight. More on her later. \\n\\n\r\nThey meet with Tadatsuru and in beloved Monogatari fashion we get a gloriously long exposition sequence full of fascinating insights by this really intriguing character, as well as a quick look at the network of specialists that Gaen has established as being the backbone for oddity-hunting. Tadatsuru's powers are great and paint a understandable picture of Ononoki's creation, even if we lack the insight of her \"big sister\", Kagenui, more on her later. \\n\\n\r\nAraragi is sent off with Hachikuji captured in his legs and brings her into the real world. Initially I had even more of an objection to this, as it totally undermined her exit even further. If it is so easy to leave hell, what is even the point of it? However, that gets amended further on in the series. The introductory arc here really set the tone for the show. It was lean-mean, and without filler, which was great. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\r\n[Hitagi Rendezvous] \\n\\n\r\nBefore I even talk about the date, I want to express how deeply upsetting it was to see Kagenui's character and her potentially incredible importance to the series being brushed off. It undermined the entirety of her disappearance in Koyomimonogatari as well as never quite explaining how Ougi got anyone to leave. It felt like an underhanded and obnoxiously pandering way to just keep Ononoki around the harem, which honestly doesn't fucking matter to me. Ononoki is pretty much useless right now, she is literally a doll and since Kagenui isn't around, has virtually no power. She is there to provide a few sparring dialogue driven moments and her inclusion in this arc felt completely unnecessary as she virtually did nothing. \\n\\n\r\nIf they kept Kagenui relevant to the story and didn't chuck her to the side for literally no convincing reason, Ononoki and Kagenui could've been back to actually matter and provide some interesting insight to spar with Gaen's own bias arguments against Ougi. Yet nothing like that happened. She's gone, and the reasoning given was that she was practicing \"Martial arts\" at what was later revealed to be the North Pole. Why? Why would she be doing that? Isn't she an immortal oddity specialist? Isn't her goal and job to exterminate immortal oddities? Isn't Shinobu back in her full-form? Isn't that Ougi? Kagenui expressed no fear in fighting Shinobu with her powers back in Nise, so it makes no sense for her to leave now. Way to completely under-utilize a dynamic and potentially interesting character. What a farce. This was probably the most upsetting moment about this three-parter and probably the only reason I had to take a point off. \\n\\n\r\nEspecially since the date between Araragi and Senjougahara was wonderful. I always felt as though their relationship was a bit tepid. They said they damn-near love each other yet Araragi runs around fucking with plenty of other girls. It really doesn't make any sense and makes the entire relationship feel phony, especially since Senjougahara got almost no screen-time recently. Her return is welcome. She is the most dynamic and fascinating of the harem-girls and definitely proved that here. Her character growth since the first arc in Bakemonogatari is palpable and honestly very endearing. Her various little idiosyncrasies really paint an engaging portrait of her character. \\n\\n\r\nThe resolution to their date is endlessly lovable and actually helps create a more believable relationship between the two, even if I still object to Araragi's lascivious and scummy behavior otherwise. I really enjoyed this, and I didn't find that it meandered or lacked any meaning. It was well-placed in the middle of these other two, more serious arcs. \\n\\n\r\nWhat i'd be remiss not to discuss is the dream sequence with Ougi, which is not only a spectacular insight on her character but also plays as a wonderful hint at who she really is. Everything from her saying being a riff on Gaen and Hanekawa to her knowledge of the star-systems being Araragi's own knowledge, the pieces of the puzzle were finally falling into place and this fractured narrative was finally become clear. At this point, in my eyes, it was clear with who Ougi was, even if I wasn't sure what role she exactly played. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\r\n[Ougi Dark]\\n\\n\r\nTo refer back to my initial thesis, this arc's progress and climax wasn't something I was expecting or wanting, but a great part about growing up is being able to look at something as a whole and really determining whether that is a bad thing. I think the more I look back on this arc the more I'll come to enjoy and appreciate that it did something that I wasn't expecting nor wanting, but still managed to be entertaining and pretty damn impressive, narratively. \\n\\n\r\nMy fear that the specialists would ultimately play a small role in the climax was unfortunately confirmed, as Gaen dumped some exposition and moved on. This and Shinobu's ultimate uselessness in her hyper-powerful form needs to be accepted as a narrative loop rather than a flaw, in my opinion. Because of course Araragi will ultimately have to face this issue on his own. It is, after all, always been his issue and no one else's. The narrative here had me hurdling through various flaming hoops of acceptance while also trying to follow along to the somewhat complicated explanations for everything. Needless to say, it was a gripping experience none-the-less.\\n\\n\r\nWhat particularly impressed me apart from Ougi's true reveal was the use for Hachikuji who's inclusion I have previously expressed my distaste with. Gaen's proposed solution was actually quite clever and made sense within the grand scheme of the story and provided the best use of Hachikuji's signature 'I stuttered\" catchphrase. It was great. I went from disliking her inclusion to totally buying it, which speaks volumes to how well this entire aspect of the narrative was delivered. \\n\\n\r\nOnward to Ougi's true reveal. I say \"true\" because her being Araragi's oddity didn't come as much of a surprise, of course she was. Especially the opening to this final arc solidifying that. What was more interesting a reveal was her role as Araragi's oddity, manifesting as adolescence. This actually paints a unique picture of Araragi's character and growth throughout the series. \\n\\n\r\nI'm no stranger to criticizing our boy Koyomi here, since I think he's kind of a scumbag, however, the portrait of his adolescence was poignant none-the-less. This somewhat esoteric conclusion helped me understand the rest of this series' motivations as well as his character progression overall. What could've been myopic ended up being quite engaging, even Araragi's rejection of his own change to saving Ougi, which I was initially against but over the course of the past few hours warmed up to. Because of course he'd save her, he's Araragi. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\r\n[The Moral of the Story]\\n\\n\\n\r\nAnd now for the epilogue, or rather, the punchline. What Monogatari does so well is provide an experience unlike anything else in anime. An industry and medium that indulges in pulpy entertainment has this series which indulges in the idea of indulging. Consuming everything that is inherently right or wrong with the industry and presenting it as if it is high-art. Taking ideas from the most influential, yet also the most cherry-picked movement in cinema, the French New Wave, and crafting a narrative that not only doesn't treat its audience like children, but goes out of its way to be esoteric and challenging. Very much in line with the New Wave, Monogatari has a kind of style and essence to it that separates it from anything else in the medium. Especially since at its core it has these sleazy elements to it. \\n\\n\r\nRelating back to the initial point of contention, my dissonance with this series manifesting as a love and appreciation for it. These last three arcs, ones which lack the fanservice that some of the other parts of the series indulge in, are some of the most solid parts of the series, up there with the flawless masterpiece which is Hitagi End, my favorite thing I've ever seen from this televised medium. It proves to me that this show could've been better without its over-indulgent obsession with childish sexuality and pandering which often took up big parts of other episodes in other arcs, however, is that really true? I undoubtedly didn't, and don't, enjoy those elements, yet they are inherent in Monogatari being Monogatari. Without them this wouldn't be Monogatari, and the lack of them in these final arcs proves to me how big of contrast there is, which helped elevate the stakes and create tension which otherwise wouldn't have been escalated if the entire series was devoid of these elements.\\n\\n\r\nI feel like I always wanted Monogatari to be more mature than it was, however, once again, maybe that was wishful thinking. Much like Araragi says as the final line in these arcs, he is himself, and this series is itself. And expecting it to be something different when it so well-established exactly what it is makes no sense, logistically. Because much like Araragi, Monogatari experienced an odd kind of growth as well, where the maturity may not have increased but a realization did happen. The self-awareness here is palpable and as with any product that has displayed a knack for multi-faceted storytelling, I don't think it is out-of-line to analyze this series so extensively. \\n\\n\r\nDuring Ougi Dark, there is a scene where the characters dissect Ougi's formation as a cake. Each character representing a slice. Which honestly feels like this show being self-aware about its own indulgence, both having the cake and eating it to, which is an element I've been bringing up in reviews since their conception. The cake here being Araragi's division and eventual realization of purpose, while also doubling as context for this shows harem elements. Which I wouldn't say is as much of an excuse as it is a justification, and a good one at that. \\n\\n\r\nIts harem elements were never the strongest parts of the series, and being myself I'd go so far as to say they were the weakest parts. However, they, in the end, felt necessary to this show having the conclusion it did. For me, the strongest parts were always the main narrative and the specialists, who were characters that were infinitely more fascinating than the main group and harbored more interesting traits and purposes, but as I've already said, it wasn't their story and I shouldn't have been expecting them to play a huge role here. My own, negative idiosyncrasy. \\n\\n\r\nIn the end, this series which still confuses me emotionally provided an exceptional conclusion to its first and most likely main story, as it wrapped up its final arcs in an acceptable and thoroughly understandable way. At its most basic, the story of adolescence and accepting that adolescence permeates through the entirety of this series. Because if we were to fully strip it down, the punchline is that there is no need to let go of that. Much like Araragi isn't willing to let go of his own, even while saying that his adolescence has left him he acknowledges that he isn't fully an adult to Hanekawa. And I don't think that is really the point of this experience. It isn't much of a coming of age story. At the climax, he doesn't let go of the oddity manifesting as his own adolescence and that's the final realization. But I don't know.\\n\\n\r\nBut who knows, really? A series like this is so esoteric that even its most well-defined moments can be read into as something else and that's exactly what I appreciate about it. It proves itself worthy of being analyzed, as any great piece of art should. As I said in my very first venture into Monogatari, I only know what I know.",
            "date": "2017-08-13T16:15:00+00:00",
            "helpful_count": 164,
            "mal_id": 255380,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5554102.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Artrill",
                "username": "Artrill"
            },
            "url": "https://myanimelist.net/reviews.php?id=255380"
        },
        {
            "content": "**THIS REVIEW CONTAINS MAJOR SPOILERS**\r\nJust a friendly reminder. Owarimonogatari Series 2nd Season is the 'Direct Sequel' of the Last Part of 'Koyomimonogatari'. \r\nMy, my, my. Shaft did it again. What's better than adapting one part of the Monogatari Series? Adapting flippin' all of them. I was hesitant about watching the Series at first, then, I binged watch Bakemonogatari and loved it. Now, I'm here at the 2nd Season of Owarimonogatari. As usual, I loved what Shaft did, I love Kamiya Hiroshi (Araragi's VA) and I loved the Series itself. \r\nThis has once again blown my mind. Ougi being the Final Boss still gets me dumbfounded.Meme is going back too. Ougi just destroyed one of my theories about her. I love the Monologues that never failed to tamper my mind and potentially change how it works. The lines of each characters never failed to conceptually change my principles and beliefs (Or maybe I'm just someone that's easy to influence?). The pacing is perfect for me and if you have watched all of the other parts before this, you should have a good grasp of the current situation. With my level of intelligence (which is low), I think I understood everything, so you'll be fine. \\n\\n\r\nWhat mattered the most for me (slightly) more than witnessing this amazing story and watching these memorable characters, is the enjoyment. If we're talking about generalities, the whole series gave it to me. But comparing the amount of enjoyment I got from the rest of the Series, Owarimonogatari 2nd Season is among the top. The first season made me doze of after a few minutes but this had me awake all night. I really enjoyed everything especially the chill atmosphere that the Hitagi Rendezvous gave. \\n\\n\r\nI'm really excited about how the story will unfold and I'm hypin' up inside. I don't read the Light Novel so I don't know how this is gonna end... Well except the fact that Araragi would be alive at the very end knowing that Hanamonogatari is a thing... But hey, he died once, then lived again. You never know... \\n\\n\r\nOverall: 9/10. \\n\\n\r\nThis score would likely change (increase) after I finish the series... I have high expectations for this but Shaft never failed to meet- no, exceed them.",
            "date": "2017-08-12T17:43:00+00:00",
            "helpful_count": 48,
            "mal_id": 255289,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6411078.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Izaya-Hasegawa",
                "username": "Izaya-Hasegawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=255289"
        },
        {
            "content": "Look. It's just another harem. \r\nBy \"it,\" I mean this franchise as a whole, and I've seen a lot of it, starting with Bakemonogatari almost a decade ago. Really, it hasn't varied much; it's always been just another harem.\r\nIf you somehow didn't realize that it's just another harem, I can tell you it has the same tropes as every other harem:\r\n- Naturally, every or almost every female in the harem is in love with Him for no apparent reason.\r\n- He has the unremarkable appearance of a typical Japanese male young adult, such that He may easily serve as a self-insert for the target audience.\r\n- Endlessfanservice.\\n\\n\r\nThere's nothing inherently wrong with these things. If the stories and premises are engaging, such a thing can be enjoyable. But I'm afraid that isn't the case with this entry in the series, the second season of Owarimonogatari, in particular.\\n\\n\r\nI've reflected on my problems with the narrative style of Monogatari before. It is simply not engaging, unless fanservice and art alone are enough to keep your attention. The same pattern continues here. For example, the first episode begins with Araragi Koyomi laying on the ground reflecting on... something having to with do with the ghost kindergartner, Hachikuji. Meanwhile there's a flashy abstract animation of her floating about. \\n\\n\r\nThen the OP begins. This is not engaging. It does not grab my attention. I'm not interested in watching a little girl float around to be honest. \\n\\n\r\nAnd that's the problem with the narrative style. The dialog is too long and drawn out, and it takes too long to get to the point. So I have to sit and wait for Araragi and Hachikuji to finish dicking around for several minutes to finally get to the reason why they are even where they are. This is tedious.\\n\\n\r\nFor me, the studio's (Shaft's) flashy, colorful art style doesn't disguise this. Shaft's animation style seems to me to be the only thing that would put this above any other harem, but that alone does not make the show good. So I can can only conclude that it's just another harem because the only other thing that one might find engaging, in my mind, is the fanservice. Otherwise, I feel like watching this tedious narrative style is akin to watching a pretty oil painting dry.\\n\\n\r\nLet me contrast another entry in the franchise, which I found to slightly better as a whole than this one: \\n\\n\r\nIn the first Kizumonogatari episode or movie or whatever you wanna call it, it begins with Araragi stumbling around, seemingly searching or escaping from something before going outside and bursting into flames. Here you have just plain action, as strange and unexplained as it is. This evokes immediate curiosity, as opposed to beginning with some tedious dialog that immediately disengages me and immediately sets the tone for boredom. It's so simple, so easy. Seems like whoever directs these doesn't understand that consistently. \\n\\n\r\nStart immediately with a direction for the plot. Start with the reason for why I want to watch the rest of the show. For example, in Kizumonogatari, I want to watch the rest of the show because I want to know why that happened to Araragikun. In Owarimonogatri S2, I want to watch the rest of the show because... Hachikukuji is a cute loli? Uh, no. \\n\\n\r\nThen you continue with a goal, a reason for me to stay engaged. In Kizumonogari the goal appears to be to retrieve something from certain people, resulting in a somewhat engaging conflict. In Owarimonogatari season 2, the goal is to... I don't even know what exactly the goal is until about the last episode. This is a recurring problem in the Monogatari series. I seem to recall many a Monogatari episode beginning with just endless tiresome dialog that takes forever to get to the point. At least this particular OVA, or whatever it is, is relatively short.\\n\\n\r\nMy final thoughts have to do with the fact that I'm not a fan of episodic or slice of life shows. I need something plot-driven and goal-oriented in order to have a reason to keep watching. That is unless something episodic is also so novel or over-the-top that I can't stop watching, which is rare these days. The narrative style makes Monogatari like an episodic show because it's always difficult to tell what the goal is. I've consumed enough fiction such that I see nothing new enough to make up for this. So if you're like me, you'll probably agree that this is just another harem.\\n\\n\\n\\n\\n\\n",
            "date": "2017-08-15T22:56:00+00:00",
            "helpful_count": 24,
            "mal_id": 255569,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/220276.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AngerAndHate",
                "username": "AngerAndHate"
            },
            "url": "https://myanimelist.net/reviews.php?id=255569"
        },
        {
            "content": "***This is a spoiler free review***\r\nWhile I am filled with the most absolute joy towards this series than any other long-running series that I am currently aware of, there is also a feeling of melancholy as I watch this beautifully crafted mini-series end what has been such an amazing journey. The highs and the lows of the Monogatari series are coming to a conclusion (for now?)...and it is glorious. \r\nStory: 9/10\r\nWhile it might not be fair to hold what I am about to say against Owarimonogatari second season, it is an absolute fact; the mini-series just needs to bring lose ends to an end. Yesregardless of how Owarimonogatari second season ends it is not the final piece of Monogatari content (see the  Hanamonogatari anime adaptation and any other possible volumes that haven't been adapted) but it is the end of this story line with Araragi as the main focus (I think?).\\n\\n\r\nWith that out of the way, Owarimonogatari absolutely concludes the series gracefully and beautifully. The first part is masterfully paced and does an amazing job at hinting at what is to come later on in the mini-series. The pacing is aided heavily by the soundtrack (more about that in the sound section) but it's also the dialogue and visual direction (more about that in the art/animation section). Without going into spoilers, it just needs to be said that this season is an absolutely amazing conclusion to the main story line of Monogatari. \\n\\n\r\nArt/Animation: 10/10\\n\\n\r\nEvery time you watch something from SHAFT you think that “well this is SHAFT” not knowing that the next piece of media from them changes/evolves their “style”. While the Monogatari films have their own look, the tv series has been evolving this super clean animation and art style since the first season. It is safe to say that this is Monogatari at its best tv season wise. There are also a lot of very stylized frames of animation within this season. The first part has a lot of moments where the show looks completely different than the rest of the series yet it fits in and feels like Monogatari. The colors used scream visual keys as well as just plain appealing design. Characters look great, and the detailed scenes have very good architecture. \\n\\n\r\nThis is simply the best I've seen SHAFT do in a tv series.\\n\\n\r\nSound: 10/10\\n\\n\r\nAll of the Monogatari parts (including the films) have amazing soundtracks. Some of them are good because they stay out of the way and aid in the conversations only a tiny bit (a lot of Bakemonogatari and some of Nisemonogatari) while the soundtracks can completely take control and dictate pacing (Tsukimonogatari). Owarimonogatari takes the Tsuki route and just takes you for a ride with its beautiful music. It dictates not only the pacing but also the mood very well. The music used towards the end of Araragi's first journey in the first part of the season is so masterfully done. \\n\\n\r\nThe idea that music should not drive the movie/show (yes this is an idea circulating Hollywood currently) just doesn't make sense to me. Ever since Monogatari Second Season, the series as a whole has allowed the music to completely drive the show. I recently saw the film Dunkirk and the music was the main reason why the film felt so complete. You don't want the soundtrack/score to beat your head in with emotion but if you can nail that fine line of direction without being overbearing, you will enhance all emotions tenfold. Owarimonogatari second season absolutely nails this.\\n\\n\r\nThe last part of this is of course the voice acting. Just...perfect is all I can really say. The second part that showcased Araragi and Senjougahara literally gave me goosebumps.\\n\\n\r\nCharacters: 10/10\\n\\n\r\nYup. This is it. This is the characters at their absolute best. The characters that make an appearance in this season do so with absolute style and class. Aided by on-point dialogue, visual direction, and a perfectly fitting soundtrack, they shine, fall, and exist with perfection. Since this season is the finale of this main story line, the characters have a spotlight pointed directly at them. Luckily, none of them choked. The performances were on-point and dramatic (when needed). Simply perfect.\\n\\n\r\nOverall: 9.8/10\\n\\n\r\nI'm really trying to not fanboy here but it's just impossible to not see the perfection in front of my eyes. The season did it's job AND SOME. It not only concluded what needed to be concluded but also somehow added in more character development where I thought wasn't possible. Thank you SHAFT for gracing us with this marvelous series. I can now safely say that the Monogatari series my most favorite long-running series. Say what you want about the fanservice whether it is needed or not, the series is a fine example of great storytelling.\\n\\n\r\nEnjoyment: ∞/10\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-08-13T15:26:00+00:00",
            "helpful_count": 20,
            "mal_id": 255376,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=255376"
        },
        {
            "content": "As I've seen every part of this series in this year, I can say this story gives the tip of the iceberg. It concludes the main arc it had, not only flawlessy, but add something on top of it. I rarely purchase the source material for an anime, but clearly, I will purchase the entire series. I am suggesting anyone, who is just astound how this 2nd season has an high ranking, just to watch the entire series in release order.\r\nBecause there isn't really an flaw, I give the story an 10.\r\nThe art was masterpiece itself. 10.\r\nI like the OST very much and it wasalways on-point. 10.\\n\r\nCharacters weren't flawed at all. 10.\\n\r\nEnjoyment was an 11.\\n\r\nOverall: 10/10 would watch again, but please delete my memories.",
            "date": "2017-08-15T15:12:00+00:00",
            "helpful_count": 11,
            "mal_id": 255541,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5635162.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SumaseKyoraru",
                "username": "SumaseKyoraru"
            },
            "url": "https://myanimelist.net/reviews.php?id=255541"
        },
        {
            "content": "Like everyone who has watched Monogatari to this point, I'm obviously a huge fan of the show, which is why it pains me to say this, but: Owarimonogatari 2nd Season is overrated.  Honestly, several parts of the Monogatarai series are better than this, including the first season.  And while it was an enjoyable entry, I kind of expected more, considering this is the highest ranked of all the Monogatari series.  But, in truth, this turned into one massive cop out after another.  \r\nMAJOR SPOILERS AHEAD: \r\nIf there is one thing that I hate in any medium of entertainment, it's when creatorsor directors are too scared to make permanent changes to the formula that made them popular.  This hatred is exacerbated when they appear to make those changes and then reverse them for a happy ending.  Owarimonogatari S2 was too scared to pull the trigger on three major occasions, instead opting to undo or swerve out of it.  \\n\\n\r\n1. They reversed the death of Mayoi, with Araragi dragging her out of hell.  \\n\r\n2. Shinobu was completely restored, something that was foreshadowed and everyone was worried about throughout the whole show, but she decides to go right back to being a little girl again.  \\n\r\n3. Ougi looks like she'll die, but then they do a last second Dues Ex Machina to save her.  \\n\\n\r\nNow, I love Hachikuji, I love Shinobu and I love Ougi, I'm happy that Hachikuji is back, I'm happy that Shinobu didn't leave Araragi (not that she would) and I'm happy that Ougi survived.  But, going for the safe happy ending on every front, even undoing previous bold creative choices, makes for a low-stakes anime and removes any sense of long-term consequences for their actions.  This, in turn, drives down the suspense of the show.  It feels like nothing truly matters because no one will die and everything can be undone with living strings dropping into hell and acting as dragonballs. \\n\\n\r\nNow, that's not to say that this wasn't a good anime, but it could have been so much better if they had've had the courage to stick with at least one of those changes.  At the very least Ougi should have died. Ougi is my third favorite character in the anime behind Araragi and Mayoi, but she should have died.  Let there be a sense of loss.  Deus Ex Machinas are the tools of unadventurous artists.  And in this case, undid what could've been a true classic, rather than just a great anime.  \\n\\n\r\nAlso, another thing I didn't care for is how useless they've made Hitagi.  She finally gets some significant screen time and she's mainly just a regular girlfriend.  Why have they made one of the most important and intriguing characters in the show a side-thought?  I miss the sadistic and some what frightening Senjougahara.  Ever since things wrapped up with Kaiki Deshu, she's like a defanged tiger with little screen time.  But, in getting more screen time this season, it was even more apparent that what made Hitagi great has been greatly diminished.  I was actually trying to stay awake during their date.  \\n\\n\r\nIt may sound like I hated this season, but I didn't.  It was entertaining, the dialogue was as sharp as always the mystery and intrigue was there as usual.  (Although, the identity of Ougi was something pretty obvious, especially after classroom episode in the first season.).  It was still good.  Really, I just felt like they missed an opportunity to really shake things up in a memorable way with all the creative cop outs.  \"By the way, this is me pleading for my life.\" should have been a legendary moment.  It was cheapened by the plea working.  \\n\\n\r\nStory: 9\\n\r\nArt: 10\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 8\\n\r\nOverall: 7\\n\\n\r\nAgain, it gets high scores from me, but it's still overrated.  Cop outs just leave a bad taste in my mouth.",
            "date": "2018-12-29T02:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 297294,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=297294"
        },
        {
            "content": "-------------------- Owarimonogatari Second Season --------------------\r\nWell, it has beeen 2 years since the last monogatari series, and boy! let me tell you  that the wait was worth it! absolutely worth it. First I have to say that the Monogatari Series is my favorite anime of all time, and this season proved why. \r\n[ART & ANIMATION]\r\nShaft did a pretty good job with the art style and animation, it doesnt have a lot of details but it fits great with the anime. It is also consistent with the other series and it has an interesting way of desing, that has been seen since the first season aired.The desing of the background that is simple and also using no background characters was a thing I only saw with shaft and their works. Something that I really like is the way that by giving background to the viewer with the cards that appeare now and then in each episode (and the whole series as well). We also get to se the art work of Gekidan INU Curry for a part in Mayoi Hell and the ending as well, which is pretty nice art style and uncommon to see in anime (the other anime that, I know of, of having that art style is madoka with their witches). Personally I prefer the art style of the anime more than the movies. Also the animation is smooth to the eye and isn't that heavy to the eye so is easy to watch. The only thing is that if you want to read the cards, you need to be pretty fast to actually post the video so you can read it. 10/10\\n\\n\r\n[SOUND]\\n\\n\r\nThe sound had good quality and I personally enjoy it. I love the music of the openings and ending of the series, sang by the voice actor of Mayoi Hachikuji (Emiri Katou) and Ougi Oshino (Kaori Mizuhashi). The soundtrack its pretty well done and gives the ambient of the story the feeling of being alive. The voice actors did a pretty good job with their characters, they portrayed it well and they are consistent with their works on this series. I enjoy every work of the voice actos and the way they said the lines fit perfect for me with those compared to the book. The diaologue its fast and serious with sometimes hitting the comical absurd. 10/10\\n\\n\r\n[STORY]\\n\\n\r\nI dont want to spoil anyone, so this part is going to be pretty quick. This story takes place after the events that happened in Koyomimonogatari. Its the parts of Mayoi Hell, Hitagi Rendezvous and Ougi Dark. The characters have the same personality and the dialogu exchange is quick and stupidly confussing. They do a lot of word play with the kanji of different things, like the word play with Senjougahara's driving license. It also gives background of the story with the different cards that appeared throught the episodes. The story is pretty good and get your tissues ready, because you are going to need a lot and I dont mean it because of the fan service (honestly now that I think about it, it doesn't have any fan service at all compared to the other seasons). Even though the season was sort of 2 hours long, Shaft did a good job on narriating the parts with great detail on them. The story is pretty easy to understand and to catch all the things from the beggining, that lead to the ending of the story. Story 10/10 \\n\\n\r\n[CONCLUSION]\\n\\n\r\nThe Owarimonogatari s2 brought to me a lot of nostalgia and feelings, because of a huge fan I am. Honestly, if the world ends tomorrow, I would die happily knowing that I could watch this season. Owarimonogatari s2 was the best part of monogatari so far, and I highly recommend to watch it (only if you have seen the other series). If you love monogatari as same as me, then I will assure you thhat you are going to like this one as well. My Overall rating 10/10",
            "date": "2017-08-23T18:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 256133,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4977190.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/thetsundereguy",
                "username": "thetsundereguy"
            },
            "url": "https://myanimelist.net/reviews.php?id=256133"
        },
        {
            "content": "(Before reading the review, or planning on watching this anime. Please do realize that this arc marked the end of the journey of Araragi's confrontations of the supernatural, amidst his occupation as a high schooler, before being graduated from being a high schooler to a college student. That being said, it's unwise and rather illogical to not watch this at the very end of the timeline, which can be discerned here (http://imgur.com/UjlhSyS). But that being said, you must watch all aired series of monogatari, excluding hanamonogatari ofc, since it's entirely irrelevant to the main story or the main attention of the plot of Koyomi, theMC. Though, be sure to watch koyomimonogatari ep 12 last before heading toward the second season of Owarimonogatari)\\n\\n\\n\r\nAs the monogatari series had made itself known to me, in the beginning of time, my first impression of this series wasn't bright, I had to, almost as if, coerced myself to continue watching it given the exudes of its sense of pretense and sophistry; which I had decided to assume about the series first that I have no great first impression off, since it's only natural to doubt a philosophically deep dialogue from an anime right? That being said, that's only when my mind and thinking process are struck in the subjective sense, due to sentimentality and all of the other factor that made up subjective view. After I've mature abit more, I started to look at things more objectively, whilst discarding the subjective ground of thinking like appealing more to sentimentality or enforcing few parts of the show I hate about to irrationally hate the show itself , listening to others to build my own ideas, trying to pander myself to the social constructed common thinking, and such. This is when I became a hardcore monogatari fan, rewatching the show like 9 times already for the past years. \\n\\n\r\nThen it had become my no.1 anime of all time. \\n\\n\r\nDigression aside, mayoi hell, hitagi renvendous and such, marked the end of the tale of Koyomi, the main lead of the story, in this great adventure of learning about the oblivion, entering into the realm of the supernatural, and adapting himself, using his own irrationality and resignation of not knowing obscured truth, to saves all the presented girls in the story. But this simply marked an end to Araragi's adolescence life, as he did in fact graduated and became, quasi, a new person entirely with the enlightened knowledge bestow by other characters, whom to which held great and unique wisdom given their differences in characters and perspectives that builds Araragi's character. Araragi started off as a pain the ass character, it changes though, and this is the quintessential growth, to that of a strong and greatly developed character through a person's adolescence, though from the perspective of an especial or an exceptional one. \\n\\n\r\nThis arc could be named the \"Magnum Opus\" of all the monogatari series combined, I would even go as far as to say that it's prolly one of the finest, and incredibly well executed, wrapped up of all arc of the life of Koyomi before his graduation and the foreboding tales, entailing the yet to come experiences, that had yet to be known to the anime watchers (that's a different story if you are a light novel reader of the monogatari series). Incidentally, the life of those that held a great relevance to Araragi's adolescence, all of them have grown as well. The rather monotonous speech pattern, and the ever so repetitious, static personality had been abolish almost credulously; this signifies the their growth, namely, Nadeko, Senjougahara,  Hanekawa and some of the character in the show (aka, Ougi). \\n\\n\r\nWhilst some people maybe confused about the scene that had been replayed in Kizumonogatari in a much different setting from the movie; this second season remained true to its primal source material. Meanwhile, the movie version of kizumonogatari greatly differs from the light novel given the extensive hyperbolic visuals, differing setting, metaphors and of the lack of a more deep and plenty dialogues; though that doesn't dwindled the credibility of how Araragi and kiss shot was built, honed, or came to be.\\n\\n\r\nAnother confusion in the this anime as well, would be the fact that in the monogatari universe, all supernatural entities that are straying from its own role, pretending to be a human/other deity or oddity, or if the observer see them doing so or realizes it (this can effect the darkness if you've seen ep 3 of Owari second season, and back in time with kiss shot and her first minion) or acknowledge them, they get swallowed up by the darkness as its existence lives solely to rectifies abnormality. \\n\\n\\n\r\nAs I've fleetingly digress, let's talk about this arc of the monogatari in particular shall we? Or let me just change that to I instead if we were to think about it logically. But, we finally got to learn about Ougi's actual identity in this second season of Owari. It had been hinted directly and even indirectly like the exuding air of her ominous aura or appearances , but it literally flew past by our heads given that we had already, instinctively even, enclosed the possibility of that to be true. The very great thing about this though, the show manages to creates this brim of articulate connections, from the facts that are not known, or left to be obscured to us but is slightly told throughout the series (like Kiss-shot's past from 400 years ago when she became a new god there), and the very obvious ones consisting of Araragi's interactions with all characters, basically, his entire adolescence as a whole. \\n\\n\r\nSince spoiling here is imminent and almost inevitable if I were to lay out bare the great level of  intricacy structure of the display of the connections, I'll just left some part of the show's revelation left untouched, lest you're already spoiled by some reviewers here, in which I will not be doing. \\n\\n\r\nAll in all, the greatness of the music production and its great segue for each scene never made me questioned the inappropriateness of the director's selections, the extraneous scenes and playful background movement amidst the dialogue always makes it alot more bearable, but in this case, very entertaining to both appreciating the dialogue, the voice acting, and the visuals. Never had I got bored watching the intensive hour of the first episode, Mayoi Hell, the second episode, Hitagi rendezvous, the third episode, Ougi Dark; all thanks to the great production of music and such, that the director and the staffs gave in each episodes. The revelation, or the main plot that builds itself since and of the entire monogatari series, had ended with a very good and meaningful plot twist (a plot twist for you if you're not Gaen Izuko lmao) that left me with a feeling of awe, an elated one. It's very rare for an anime, or even a story, that had solely rely its dialogue, to move the plot forward to be this fun to watch. The simplicity of a fighting show, harem show or any other story hold no chance against this piece of work that we called, the monogatari series. That maybe an exaggeration, but I have yet to see any show that wrapped the entirety of its show as good as this.  \\n\\n\r\nThe disturbing scenes that encroached the norms of our century, the pedophilia like interactions or thoughts, the incest, the first ever scene of someone getting aroused from having their teeth being brushed by another person, the perversion, all of it are not a complete representation of what the show has to offers.  As far as it stands, it don't negates the intellectualism that the dialogues has which includes many of the fundamental core message or purpose of a life lessons, the wisdom, the perspective, idealism or convictions crashing with another person's, and so forth. And ofc, not all dialogue from this show are that serious all the time, most of the time though, they are relevant to honing Araragi's character and of the other ones (like Kaiki for instance). \\n\r\nThat being said, this anime is prolly one of the best anime out there yet, and the most unique amongst all, and it's a must watch if you haven't finish watching the show yet. \\n",
            "date": "2017-08-21T07:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 255946,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=255946"
        },
        {
            "content": "Look, if youv'e gotten this far in the series, you're not gonna be reading reviews to check if you should finish. This review is for people who are wondering if this is a series that will be worth investing in, or for those who just finished the first one or two series and are thinking \"...is this worth it?\"\r\nThis is a review of Monogatari. The great, sleazy, sprawling empire of Monogatari. With much love and in keeping with the style of the show itself, I'll make sure it's a disorganized disaster area.\r\nIt's been a while since I wrote a review, but MONOGATARI IS OVER andthe sentimental poeticism of that fact spurred me to fill out these heinous numerical scores once more. Of course, Monogatari isn't really over. We'll no doubt soon be facing down Owariszokumudamonogatari or whatever 354,653th side story/spinoff pops up to fill the void left in many a loyal fan's heart. However, the main story is done, there's no doubting that, and that's good enough for me. I'm out. I can't take any more. I managed to make it to the end of this season pretty much just by riding the rocketship of nostalgia. Good god, how many sloppy cgi slideshows must we endure? For this loyal fan, the magic is over.\\n\\n\r\nWhich, I suppose, means the series worked.\\n\\n\r\nI mean seriously, when I first started watching this behemoth epic many moons ago I was just a dumb college freshman (or something close) and I fell in, hook line and sinker. The convoluted problems of Araragi and his friends ranged from life-changing to so cryptic that I was forced to fall back on that most shameful of actions, looking up essays written by other more experienced critics in order to understand what the f**k I had just watched. I was mesmerized by Hitagi (heh) and her callous glamor, Hanekawa and her poisonous external perfectionism, Nadeko and her disturbing emptiness, and of course Araragi and his flaky, self-deprecating, morally-questionable, creepy, dense thought process. The show was magic. Broken, messy, and inexplicably relatable, Monogatari was an emotionally-poignant series of truths I wouldv'e had trouble coming to alone. It felt like a respite from a mad world of superficiality, a beacon of integrity that actually tried to be real. Sure, it was often gross and off-topic, but that only served to make it feel more legitimate. I remember my youthful head-over-heels fanboy self writing that \"Monogatari, unlike any other work of fiction, understands the tumultuous chaos of daily living. This show's true apparition is life itself.\"\\n\\n\r\nLook, I know half of you hate this franchise. I've heard it been denounced as pandering bilge, try-hard philosophy for middle-schoolers, cash-grab pornography, and self-indulgent holier-than-though psychology more dated than Freud. And I'm not really gonna defend it: it's got all of those elements in it. The Monogatari Franchise is one massive experiment in everything, and as is charachteristic of experiments, things often go horribly awry. But, somehow, after wading through all of the literal human feces (*cough*cough* Tsukimonogatari) we've reached the conclusion to that experiment, and have found ourselves with a truly excessive coming-of-age story or something. And, it turns out, what made the franchise work or not wasn't any of its own merits: it was what the viewer brought to the table. \"I am imperfect\" is a fact I acknowledge readily. \"I want to do better\" is another. \"I can recognize some of my most detrimental flaws, but even then I have difficulty figuring out how to address them, and these are such difficult and personal concerns that I don't really know how to foist them onto someone else\" is one as well. When I started this series, I was looking for answers. Answers about my own habits and traits, answers about how other people's minds might work, answers regarding that slow-burning yet indestructible anxiety that perpetually lives in the back of my mind. Monogatari was willing to listen, to offer advice, to never try to hand anything ut on a platter: its coded images and style and writing made me work to figure out what it was trying to tell me, and through that allowed me to figure out for myself the thoughts I was missing. And that was magical.\\n\\n\r\nAnd now we've reached the end.\\n\\n\r\nNow it's just a story. It's not the embodiment of life or a tried-and-true philosophical 5-course meal. It's an often-frustrating story about a bunch of great characters with sometimes-brilliant, sometimes-infuriating presentation. That was was struck me most watching this final season: everything I fell in love with was still there, but I had grown past it. That doesn't mean it wasn't satisfying as all hell to watch all these long-struggling plot threads reach something resembling a resolutions, or that I wasn't secretly praying that they'd play the world-renowned masterpiece Kimi no Shiranai Monogatari just ONE MORE TIME (even though the whole point is that we've grown way past that song's message). By all metrics (asides from, perhaps, visual creativity) this season was just as good as any of the previous ones and more. It's just... well... Monogatari finally caught up to itself.\\n\\n\r\nIt doesn't feel confusing or convoluted anymore.\\n\\n\r\nI no longer begrudge its antagonists or condemn its flawed characters.\\n\\n\r\nI no longer feel as though its winding labyrinth is something I can get lost in.\\n\\n\r\nSo I guess...\\n\\n\r\nSHOULD YOU WATCH THIS BIG, HORRIBLE THING KNOWN AS MONOGATARI?\\n\\n\r\nHere I sit, many years after beginning the epic franchise, and I am aware, even now, that though I may not often reminisce upon the passion this winding saga once drew from me, that is merely because I have channeled that passion into other places. But, more importantly, the reason I have become the person I am today (aka a functioning, employed, yet dreaming and ambitious member of society) is in part thanks to this series. Is that enough for you? It depends on who you are, and who you want to be.\\n\\n\r\nAre you imperfect?\\n\\n\r\nDo you want to better?\\n\\n\r\nAre you humble enough to put a little bit of faith into one of those trashy anime things?\\n\\n\r\nMonogatari is a mess, but it also genuinely cares about you. If you want to condemn it, it's easy. It's got a bunch of issues. That's why I'm not even discussing all that animation/plot/sound nonsense. We're past that. As sappy as it sounds, if you open your heart to it it will open its heart to you. It will challenge you and laugh with you and care with you. It will pull out your passion and give it to you to hold. \"Do with this what you wish\" it will say, expecting no loyalty in return. And, as its final gift, it will bring you to the finale with a knowing smile on your face, knowing that you care about all these lovable idiot characters, but most of all that you care about yourself. \\n\\n\r\nOr maybe it wont. Maybe you'll just think it's dumb.\\n\\n\r\nOnly one way to find out.",
            "date": "2017-09-28T19:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 259030,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489477.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ChristopherKClaw",
                "username": "ChristopherKClaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=259030"
        },
        {
            "content": "Amazing.\r\nThey did it.\r\nNisio and Shaft managed to give a proper ending to a series in which one misstep could bring forth its doom.\r\nAs I wasn't particularly a fan of Tsuki (in this case, just some aspects of it, as I enjoyed it overall) Koyomi and the first part of Owarimonogatari, I was genuinely mindful that this could end as a screw up, even if I had all my hopes up for it.\r\nThe recurring problem with the Monogatari series, in my view, comes precisely from its \r\nstrength. The  obvious enemy of a good series that focuses on delivering its story by a lot of dialogueis the lack of something worthwhile to say. Many times, it relied way too much on repetitive overexpository dialogue of things the viewer had already understood like they were retarded or something, way too much uninteresting idle chatter (this can come off as subjective, but the casual plot unrelated chit chat of the series kinda died for me after Second Season) and, yes, stupid fan service.\\n\\n\r\nI don't think it is the case that Shaft's producers noticed that. Even though it's still a frequent complaint by (western, at least) fans of the series, the general acclaim each new season usually receives implies that they are still doing something right.\\n\\n\r\nHowever, maybe it's the fact that this season lacked virtually all of the flaws I listed before that made it so special and and ending fitting of the sprawling story of Monogatari, together with the excellent plot.\\n\\n\r\nInstead of spending overtime with meaningless froth and silly fan service, they focused on interesting conversations concerning the story, its character and the development of both, which this series conveyed in a way that, honestly, is only comparable with Season Season, and even then I couldn't say which of them had the most interesting and important character developments of the series. All episodes and all moments were importants before finally leading to the conclusion of the first Monogatari \"mega arc\" comprising all the tales told until that moment, and how Araragi's future was and would be affected by it.\\n\\n\r\nMy inspiration to write this has just extinguished right now, but I am just glad that, in the end, this series didn't disappoint me. It's way to easy to end predictively or coarsely whenever a story sprawls to the point when some of its parts may be better if forsaken from the whole, but at the same time refreshing when a series prove your worries wrong and lets you out of it with a smile on your face. \\n\\n\r\nI could not ask for a better sense of closure.\\n\\n\r\nIt was all worth it. Thank you.",
            "date": "2017-08-23T13:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 256110,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154035.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rapo1",
                "username": "rapo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=256110"
        },
        {
            "content": "The second season of Owarimonogatari was the perfect way to end the main story line of the series. Comprising of three arcs, the first two serve as mostly set up material for the last arc to have a lasting impact on the audience.\r\nThe art and animation is in the signature style you would come to expect from Studio Shaft. The use of the soundtrack is sparse or just serves as a backdrop to the show, except for a few moments where it's use in conjunction with an important scene. Out of all the seasons/movies of the Monogatari series, I enjoyed this particular one the most.Hopefully you will have a similar experience as well.",
            "date": "2017-08-15T09:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 255509,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=255509"
        },
        {
            "content": "Owarimonogatari 2nd Season is one of those animes that have everything you will like.\r\nStory: the story in this season is one of the best in all of monogatari series.\r\nArt: the art is outstanding as ever and each scene have a lot of meaning as always and every scene have a lot of detail.\r\nSound: the sound is good as always every voice actor gives the feeling of what their character are thinking and feeling.\r\nCharacter: in this season you will see a lot of character development for Araragi and Ougi and also it shows you the deep bond between Araragi and Hitagi and also his bond withShinobu.\\n\r\nEnjoyment: 10/10 for me after all this monogatari series is the best of the best in anime industry and I 100% recommend you to watch this season and to read the light novels.",
            "date": "2019-04-01T16:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 305198,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MigthyDoom",
                "username": "MigthyDoom"
            },
            "url": "https://myanimelist.net/reviews.php?id=305198"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’m not much of a driver myself.\r\nI have a license, and I know how to drive, but I much prefer using my own two legs for some nice exercise or Uber for a new-age taxi. As such, whether my destination is the grocery store or the nearby local mall, a car rarely enters the equation for me.\r\nSooner or later, self-driving cars will take over the road, and I will not have to even think about driving whatsoever (since the vehicle will do everything anyway). Owarimonogatari 2nd Season also drives itself, too. Neither towards groceries norknickknacks but rather towards storied anime success.\\n\\n\r\nSTORY\\n\\n\r\nThe first Owarimonogatari season stands as one of the best entries in the entire series, what with its higher emphasis on a spooky new character, its symmetrical leanings, and its strong themes. So, with the sequel now upon the masses, how does the continuation carry the torch?\\n\\n\r\nTo get everything aflame, the anime moves forward with its usual approach of distinct arcs within a single run. Three in total create this sprint: Mayoi Hell (two episodes), Hitagi Rendezvous (two episodes), and Ougi Dark (three episodes). Mayoi Hell finds Araragi literally dead and alongside Hachikuji once again. Hitagi Rendezvous is less formal than the wording suggests insofar as Araragi meets up with Senjougahara for a much-needed date. Ougi Dark brings Gaen and the gang together to talk about the mysterious Ougi Oshino herself.\\n\\n\r\nWhere the latest-released installment before this one (Koyomimonogatari) took a brief pitstop for an extra dosage of fun, these next few arcs get back on the plot track. Not to say that they ditch the silliness outright, though. For example, Mayoi Hell serves the narrative purpose of stripping Araragi of a key feature of his but also gives the audience one of the best Hachikuji “I fwubbed!” performances ever. Hitagi Rendezvous progresses the relationship between the crab and the pervert one more step while also providing the saucy quips from Senjougahara that have been absent for far too long. And Ougi Dark reveals the actual identity of Ougi and makes Ononoki succumb to the lighthearted-yet-unfortunate end of Tsukihi’s and Shinobu’s handling.\\n\\n\r\nIn other words, Owarimonogatari 2nd Season remains just as similar to the rest of its family in its structure and direction. The same applies for its thematic roots, too. This time, the anime discusses what it means to do the right thing versus the right thing.\\n\\n\r\nIt pops up in each arc with Araragi in some manner. He helps Hachikuji when he possibly shouldn’t. He competes with Senjougahara in a romantic rivalry. He goes above and beyond for Ougi. Moreover, the show challenges the concept of “right” itself, forcing Araragi to think about this word given who he is, what he is doing, and why he is worrying about it in the first place. While not the most profound setup imaginable, this theme still allows for that thoughtful edge that the series keeps tucked away behind the mystery and the comedy it regularly touts.\\n\\n\r\nNot everything goes right, though. Truth be told, the actual events and plot in general do not have as much weight or as much engagement when compared to the past. A particularly built-up moment involving a certain someone comes to mind when it comes and goes without a whole lot of fanfare befitting the moment.\\n\\n\r\nNevertheless, Owarimonogatari 2nd Season remains a solid “conclusion” to this series. Witty wordplay, cultural knowledge, cool ideologies, interesting twists. That is to say, it’s tough to hate on such a robust story.\\n\\n\r\nART & ANIMATION\\n\\n\r\nNot much else can be said about the visuals within Owarimonogatari 2nd Season that hasn’t been said already.\\n\\n\r\nThis far into the series, the show has its visual direction and signature flair basically down to a science. Tons of different styles, colors, shapes, perspectives, and cuts. Fun and personality-filled character designs of both an old and new nature. Quick scenes of high-quality animation. Head tilts. It’s all there once again to stare at and appreciate in all its splendor.\\n\\n\r\nSome shout-outs are still in order, though. The callbacks to the “scraggly” style of the opening and ending tracks as Araragi traverses the underworld with Hachikuji were a nice touch.\\n\\n\r\nPlus, the fact that Ougi delivers a bunch of metaphors within Araragi’s dream by using the known constellations as a replacement for the planetarium he and Senjougahara slept through made for a neat moment, too.\\n\\n\r\nAnd showcasing a game of cricket (with cake and tea time to boot) to keep stimuli high during a long-winded explanation also deserves recognition for, as always, refusing to let the conversations stagnate on a cinematic level.\\n\\n\r\nIn short, “if it ain’t broke, don’t fix it.”\\n\\n\r\nCHARACTERS\\n\\n\r\nThis series has almost always been home to a wide range of characters. Some seasons will contain a large handful to choose from, and some seasons will instead keep the focus on just one person in particular. For Owarimonogatari 2nd Season, it goes mostly with the latter, giving nearly all the attention to Araragi.\\n\\n\r\nNot to dismiss them outright, the supporting cast do have their opportunities throughout this specific season, too. Hachikuji earns herself a much more fitting, much more deified position despite her stature and her snail-driven background. Senjougahara gets “put in her place” per se as she learns to lose like a champ. And Ougi becomes humanized after his ending goes down a different route than even he could have predicted (and, in the process, revealing his official gender if the previous pronouns have not done so already).\\n\\n\r\nYet Owarimonogatari 2nd Season, much like the first season which predates it, puts Araragi in that limelight. For a show which prioritizes (for the most part) everybody else but him, this infrequent look into the main protagonist turns into a special occasion of sorts.\\n\\n\r\nAraragi has pretty much been a man of questionable morals yet an honorable guy who cares deeply for the people close to him. However, he brings up several of the significant events which have affected him over the course of this myriad set of tales, signaling how he understands that this bizarre journey of his has impacted his life in ways unforeseen. The audience thinks about his progress in turn. What has improved for him, how his failures have shaped his course.\\n\\n\r\nHe’s clearly been through a lot, and this season adds to this fact. His conversations with Hachikuji have him reflect on the choices he has made up to this point and whether he would perform the same ones again if given the chance. His date with Senjougahara has him growing closer to her with “vows” the two share together. And his final talk with Ougi has him looking inwards at himself about who he really happens to be.\\n\\n\r\nThese moments, combined with his imminent graduation from high school into college and therefore pre-adulthood, find Araragi overcoming his adolescence. He had naturally been moving towards maturity as he became studious once again in school and thought about others before himself these past several months. But, here in Owarimonogatari 2nd Season, a last solid push pushes him onto that side with nary a trouble.\\n\\n\r\nThis season has also reaffirms an idea arguably much more important and much more intriguing: that not everything about Araragi (or anyone for that matter) must be fixed or changed or redone.\\n\\n\r\nIn real life, mundane issues or traumatic happenings can drastically morph people, but this situation is not always the case. Just because someone comes upon a new perspective does not mean that his or her entire personality flips or that he or she undergoes a physical transformation. Often, they remain mostly the same yet gain a newfound idea, outlook, or lesson that will be carried with them indefinitely.\\n\\n\r\nThe same applies for characters in anime, and Araragi here in this season of the franchise represents a prime example. His maturity does not equate to him ditching his old self. Rather, he realizes that he can still be who he has always been – a vampire who cannot help but help others – while simultaneously increasing his position in life by absorbing the experiences he faces.\\n\\n\r\nSo, yes, Araragi does not “develop” writing-wise to any grand extent. But, because of his dedication to maintain both his past and his future, he finishes up this season as a strong contender for the fact that a character does not need to necessarily change to have a meaningful purpose in the story told.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\n(Note: The second OP for Owarimonogatari 2nd Season, “dreamy date drive”, did not air as part of the televised broadcast. Because this review analyzes that version and not the BD version, said song will not be included in this deliberation. However, personally speaking, I do like the dreamy vibe and the POV visuals of the track. It’s a fitting piece for the romantic bond between Senjougahara and Araragi.)\\n\\n\r\nMuch like its artistic brethren, the audio decisions within Owarimonogatari 2nd Season can speak and play for themselves. Impressive voice-acting performances which make the characters feel alive. The same strong, ambient original soundtrack. A multitude of sound-design elements for added flair. What’s tried-and-true remains so in this season without a doubt.\\n\\n\r\nThe only major differences are (perhaps obviously) the new opening tracks and the new ending track.\\n\\n\r\nThe first OP, titled “terminal terminal”, channels Hachikuji’s cuteness in song form. It blends together many instruments – piano keys, castanets, bells, trumpets, acoustic guitar, chimes – for a happy, fun foundation, and her vocals throughout (especially on the timing of the distinct triplet of notes at certain points) give it the adorable charm which follows the lovable snail around. Its tone somewhat contrasts with the story arc which it precedes, but that provides it even more staying power when watching the show.\\n\\n\r\nThe second OP, titled “dark cherry mystery”, combines hip-hop beats and string segments to get at a mellow-yet-charged track to helm the way for the finale of the season. The snapping and clapping in the background give the song a smoother feel, and the perceived repetition in the vocal delivery has a hypnotizing effect to it while listening. Both sides complement the harsher sounds of the record scratching, the drowned-out instruments, and the fluttering sound-effects. It isn’t as nuanced of a song as the other OP, and it isn’t as interesting either, but it still has a nice place within Owarimonogatari 2nd Season.\\n\\n\r\nAs for the ED, titled “SHIORI”, its piano melodies, grander sound, and multiple vocalists create an airy, heartfelt closing for this iteration of the anime. It’s a pretty song, so it has a feelgood vibe, but it doesn’t quite leave as much of an impression as its counterparts.\\n\\n\r\nAltogether, this season hardly falters in terms of its audio, and its OP-ED offerings, while not the most memorable, still stand as strong additions to the already huge number of specialized tracks available from this long-standing franchise.\\n\\n\r\nENJOYMENT\\n\\n\r\nOnce again, this project reels me in and has me liking most of what it dishes out.\\n\\n\r\nIt was extremely nice to have Senjougahara back into the fold, and so her whole arc ended up being the most fun for me. The teasing. The reactions. The silliness. The kindness. The romance. It was a pure treat to hear her and see her have some deserved focus once again.\\n\\n\r\nHachikuji, Tsukihi, and Ononoki were hilarious per usual as well, and seeing Shinobu in her adult form made for quite the spectacle. Ougi’s asides kept me captivated, too, which is often the point. And I even appreciated Hanekawa’s small appearance near the last several minutes since she is one of my favorites from the anime overall.\\n\\n\r\nCompared to the first season, key differences stir up my personal attachment. The lack of any new characters was unfortunate, but Ougi finally losing per se provided some satisfying comeuppance. Gaen still gets on my nerves, but she wasn’t as annoying this time around. And each arc did not reach the same level of critical analysis to indulge in, but they came off as consistently entertaining rather than rising and falling throughout. So, like last time, while I cannot say I adore this sequel, it has its merits for sure.\\n\\n\r\nI will have a bone to pick with the series sooner rather than later, should it choose not to conclusively end (after all, this season is translated literally as “End Story”). But that’ll be a discussion for another day. For now, the series stamps in yet another positive experience in its record books.\\n\\n\r\nOwarimonogatari 2nd Season makes for a super-swell follow-up within this famous franchise. The artistry and the music keep the same signature structure (and rightfully so), leading to refined production values. The story content also remains familiar and thematic even if the plot itself is not quite as engaging as usual. And the returned focus on Araragi, with the smattering of supporting cast members here and there, leads to a neat finish for his arc. The total package isn’t the best that the series has to offer, but it certainly drives home the fact that its juggernaut status is just as deserved as always.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, despite the passable narrative moments, themes on doing the right thing take hold as the mystery, the comedy, and the dialogue within each worthwhile arc keep a similar stance as others in the family\\n\\n\r\nArt & Animation: Great, “if it ain’t broke, don’t fix it”\\n\\n\r\nCharacters: Good, Araragi demonstrates that a character does not require “development” to be meaningful\\n\\n\r\nMusic & Sound: Good, the same impressive audio design is welcomed back, and the new OP-ED offerings, while not too memorable, have their place\\n\\n\r\nEnjoyment: Good, consistently entertaining even if not the most stellar entry in the series\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-11-13T21:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 294022,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=294022"
        },
        {
            "content": "It has been 5 years since I watched gigguk's review on bake/nisemonogatari which ultimately got me into the monogatari series. I liked this series a lot when I first watched it as a newcomer to anime. Now, after rewatching the entire series, I have come to love it. These 3 final arcs are truly the end to the end, the \"owari\" to the \"owari\" to a beautifully written \"monogatari\". \r\nI am proud to say that all mysteries are uncovered, no holes are left unfilled and they wrap up the franchise perfectly with a little bow. It gives that uplifting feeling that everything is over, allthe struggles and conflicts the watcher (myself) faced with Araragi and co in his final year of high school is all over. Yet, I feel like I will miss the feeling, the moments, and memories because not all was bad in Araragi's trek to \"ending his adolescence\". For example, he met, probably, the BEST HAREM IN ALL OF ANIME, with him sitting on top of the throne. Along with it comes highlights of memes/fanservice that is hilariously entertaining and creates moments that I will forever search back on youtube. \\n\\n\r\n**RAMBLING START**\\n\\n\r\nIn the end, from saving other people he has learned to save himself. Araragi (my boy), Oshino Meme (my dude), Hanekawa (i loved how multidimensional her character was [in more ways than one ( ͡° ͜ʖ ͡°)]), Senjougahara (Undisputed best girl), Mayoi (i need this loli in my life), Nadeko (despite the hate, her story was probably the most interesting), Kanbaru (where can i buy a kouhai like her), Karen and tsukihi (i loved every moment they were on screen), Ononoki (yeah peace peace!), Sodachi (I wish you had more screen time), and OF COURSE MY FAVOURITE CHARACTER IN ALL OF MONOGATARI:\\n\\n\r\nSHINOBU OSHINO aka Kiss-shot-acerola-orion-heart-under-blade-chan.\\n\r\nI love you so much, everything you have been through to get to where you are this point, I give the utmost respect you fucking 500 year old loli.\\n\\n\r\n**RAMBLING END**\\n\\n\r\nThank you so much Monogatari, thank you so much Nisio Isin, thank you so much ANIME.\\n\\n\r\nI may have rambled and stuttered (kamimashita!) but it wasn't on purpose because I'm literally in tears as I see the credits roll down. This was a hell of a ride and I'm truly glad I gave this series a chance!",
            "date": "2017-09-13T21:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 257470,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3345341.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/morekawaiipls",
                "username": "morekawaiipls"
            },
            "url": "https://myanimelist.net/reviews.php?id=257470"
        },
        {
            "content": "Owarimonogatari 2nd Season was perfectly created, I hardly can point out problems with this season and adaption. Nearly every scenes creates a tense atmosphere making the viewers iterate their thoughts what will the characters do, what Araragi will do. Apart from assaulting Hachijuki.\r\nStory:\r\nI personally thought the story was well made, it has mix of emotions teach parts of the story which constantly manages to keep the viewers interested. The further you go through the episodes, more the excitement grows. We all want to know who Ougi is, we all want to see what Araragi wants or does. That's why the story is perfection. \r\nArt:\r\nI can'treally say much about the art, through out the Monogatari Series all the arts and designs are interesting and well created. The scenes are hilarious and made well creating plenty of humour and awe for the viewers. \\n\\n\r\nSound:\\n\r\nOne of the best thing Monogatari Series can have pride on is their soundtracks and OST. How they blend with the story perfectly. The OST is placed perfectly without interfering the story rather enhancing it instead. You can never get enough of Mayoi's stutters. The OP created were amazing as usual as well as the ENDING by ClariS; the versatile duo. Shiroi (Ending) was a suitable choice as it's really beautiful to hear. \\n\\n\r\nCharacter:\\n\r\nI kinda do miss Ononoki's old phrases, she's funny as usual alongside Mayoi. They really were hilarious during the serious talks, but that's what makes the series interesting, where the characters do something humorous. Furthermore, we got saw different emotions especially how Ougi feels about the situation and Araragi's thought thoughts through out the show, his characteristics in important scenes really shows he is one of the best characters in the anime history. But what really made me full of joy was seeing old characters return throughout the story including mentions and arrivals. \\n\\n\r\nEnjoyment:\\n\r\nThere was plenty of enjoyment seeing old characters, hilarious sub scenes and plenty of emotional scenes. I wouldn't really call it a rollercoaster of emotions but it has the usual Monogatari Series enjoyment but the finisher to this adaption was perfect. \\n\\n\r\nOverall, I would recommend people to start watching already since this special is well developed. I am sure Arararagi-kun will be proud of you. I meant Bararagi-kun. Sorry I stuttered.",
            "date": "2017-08-14T10:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 255438,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4695884.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Samig-Senpai",
                "username": "Samig-Senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=255438"
        },
        {
            "content": "Owarimonogatar Season 2 clearly solved all the problems and questions we always had throughout the series. We could say this is the end(but not technically). I really enjoyed watching this and was totally immersed during the whole 3 episodes. Not to mention in light novel as well.\r\nThe story, as I mentioned before, it answers all the questions we had before. For example, \"why is Hachikuji here again\", \"where did Meme and Kagenui go\", \"why did Gaen kill Koyomi\", \"who and what tf is Ougi plotting.\" All these little questions are solved in this story. It was also outstanding of Nisio Ishin answering each question oneby one through the show and gratifying viewers slowly.\\n\\n\r\nThe second arc which is Hitagi Rendezvous showed a good rapport between Senjougahara and Araragi. We didn't get much opportunity to see them being together in recent stories so I believe it was a good time to show this. Lastly, the post credit scene I should say it was amazing. The gloomy theme and Ougi leaving some fishy lines were matched well. That made me eagerly want to see what's going to happen next. Bringing up this much excitement was well done.\\n\\n\r\nIn Ougi Dark episode, everything happens is big spoilers but I'll try my best to not spoil a lot. I liked when Gaen was about to disclose the truth of Ougi, the scene immediately changed. I was rather disappointed here, but then again, they used this method to keep me immersed. I also liked how all these little clues from previous stories (Araragi's sense of guilt, Shinobu eating Seishirou) made Ougi. I did not expect anything like those to be a big part of this story.\\n\\n\r\nAraragi appeared again with this 'sudden change of mind to save that person'. He did it to Hachikuji (which was great) and he did it again to Ougi. I guess that really isn't changeable for Araragi; However, I like that heroic side of him.\\n\\n\r\nHachikuji's comeback was truly amazing and loved the conversation with Arararagi. Also, I was quite surprised that a snail is superior to snakes. Didn't really make sense for me but okay. Hanekawa did a great job and not to mention Meme as well. I saw myself automatically smiling when Meme came in with his catchphrase. No wonder why he's my favourite member from Araragi Harem. He always resolves big conflicts or problems happening to most characters. I felt bad for Gaen but at the same time, it was funny because nothing really worked out for her in this story.\\n\\n\r\nI should say this is the best and also my favourite story from entire Monogatari series. It was the most enjoyable story in the entire series. I strongly recommend watching all the Monogatari series to who haven't watched yet. \\n\\n\r\nOverall, I will give this a 10/10.\\n\\n\\n\\n\\n\\n",
            "date": "2017-08-13T15:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 255377,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6364271.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JhSung",
                "username": "JhSung"
            },
            "url": "https://myanimelist.net/reviews.php?id=255377"
        },
        {
            "content": "*THE RATINGS FOR THIS ARE SPECIFIC TO THE PART, BUT THE REVIEW IS FOR THE OVERALL SERIES*\r\n[STORY: 10/10]\r\nThe Monogatiri series comes together well to create a masterpiece of a story. This show is much deeper than alot of people think. It is filled to the brim with philosophical arguments and great storytelling. The focus isn't mainly on action, though it does have some visually stunning action scenes. Alot of the time, it will just be conversations between characters, but this is the blood that keeps this series alive and flourishing. Without it, you'd have a normal show with above average production. This type of showisn't for everyone, but I personally love it.\\n\\n\r\n[ART: 10/10]\\n\r\nThe animators went all out animating this show, as detail and flamboyance embody the artistic direction of this show. Each character's design and set piece is carefully planned out, and it shows. \\n\\n\r\n[SOUND: 10/10]\\n\r\nThe voice actors become their characters when they act them out, that's how into them they get. They really care about their role, you can tell. And sound effects are well done as well, nothing seems off in that department.\\n\\n\r\n[CHARACTER: 10/10]\\n\r\nMost every character is important to the main plot of the story and if they aren't a main character, the style of the show makes it seem as if they don't even exist. Whether they be designed as set pieces or outlines, the show really puts emphasis on those we really care about. These characters are no joke either, pretty much none of them are one-dimensional wastes of time, which is very appeciated.\\n\\n\r\n[ENJOYMENT/OVERALL: 10/10]\\n\r\nThough some parts of the series are better than others, the series as a whole is truly an amazing body of work that I consider a masterpiece. This story is filled to the brim with beautifully crafted characters, artwork, sound design, and an amazing story that philosophically challenges the observer to think. A masterful work by Isin Nisio.",
            "date": "2018-04-03T04:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 276648,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6971623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/godofmankind",
                "username": "godofmankind"
            },
            "url": "https://myanimelist.net/reviews.php?id=276648"
        }
    ],
    [
        {
            "content": "Owarimonogatari season 2 is the conclusion, final chapter, to the main storyline presented since Bakemonogatari in 2009. And to say that it was a long time coming would be an understatement. It has been nearly a decade since I fell in love with this anime. While it has had its ups and downs it never became intolerable. For anyone who kept watching this series for this long or joined the train, enjoy the finale. \r\nMayoi Hell and Hitagi Rendevous are arcs with essential information that is needed to be build up before reaching the final boss. The final boss known as Ougi has been foreshadowedfor some time now. Who is she? Where did she come from? We will have the answers to all our questions in this arc. All the pieces that have been lingering will finally connect. \\n\\n\r\nMayoi Hell consists of Ararargi going to hell after being intentionally killed by Gaen. If you haven't watched Koyominonogatari by now you should go back because it is very necessary. As well as obviously watching the rest of the series that has aired beforehand. Visually it is an extremely fun episode and seeing Ararargi and Mayoi banter after all these years is great. We saw them send each other off in the Second Season in a touching moment and in the Final Season, we see the wonderful reunion. The music that accompanies the touching moment towards the end pulls at your heartstrings. Can you call it manipulative? Sure but it sure has hell worked well. The comedic timing can be abrasive and I say this in a positive way. It's an onslaught of comedy smacking in your face with animation shifting from cartoony back to on model. With sprinkles of deep dialogue, we get a traditional Monogatari script. The most important element of the arc is Ararargi showing his attitude towards life changing but his heart remains the same. He will always want to save people even if he went back and did things again. However, he still shows some regret in the approach he took and how he could have improved on it. Anyone who has been interested in Ararararararagi's character development will be satisfied seeing him converse with Mayoi. In the second half of the arc, we are met with a character that was first introduced in Tsukimonogatari. To not get spoilers they converse about why Ararargi had to die and come back to life. This arc truly benefitted from the TV Special format because they were a ton of different settings being presented as Mayoi and Ararargi take a journey to meet the man who will bring him back to life. The animation quality was astonishing far better than what we saw in Owarimonogatari season 1. \\n\\n\r\nHitagi Rendevouz isn't just a filler date between our main cast and heroine. While Hitagi takes a large chunk of her self-proclaimed arc, Ougi Oshino interrupts to speak about the important implications that were presented in Mayoi Hell. Ougi's near threatening dialogue and the sound design gives me chills down my spine when hearing her speak to Ararargi. Without having any knowledge of the next arc, Ougi Dark, you feel anxiety throughout. But wait wait wait let's get back to the date between our main girl and main boy. Hitagi probably looks the most beautiful here than in any other series. While this is obviously a personal feeling I had to put it in the ethersphere. But being beautiful isn't just about the character design, shaft really kept up with the animation and kept her on model almost throughout. With the obvious exception of comedic animation shifts. The backgrounds are rich and full of life as Hitagi, with her new driving license, takes out Ararargi on a date. The date itself was very charming. The most befitting to a 6 months relationship. To the viewers, it has been 8 years. \\n\\n\r\nOugi Oshino is Ougi Oshino \\n\\n\r\nWhat makes this arc very different than most arcs is that it is a bit mature, not as mature as Hanamonogatari was but close. We don't see much fan service and we see a lot of reflection of the past. Its a somber ending. I am glad we are at the conclusion. But do not fret there are more novels to be adapted which will be. While they might not hit as hard as these arcs in this season it will still be a joy to watch. \\n\\n\r\nThank you for the best 8 years of my life Nisio and SHAFT.",
            "date": "2017-08-12T13:54:00+00:00",
            "helpful_count": 517,
            "mal_id": 255276,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3705359.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/moodie",
                "username": "moodie"
            },
            "url": "https://myanimelist.net/reviews.php?id=255276"
        },
        {
            "content": "\"Everyone sees what you appear to be, few experience what you really are.'\r\nThis review does not contain spoilers. This review is not made by a blind fanatic or a hater who has nothing better to do, this review is made by a person who saw this series for more than 8 years of his life.\r\nI'll be honest and I'll go straight to the point. I will not speak with fanaticism in my words, I will write just the truth about these episodes, my truth, nothing more and nothing less. I have no sweet words to these episodes, so if you can't digest a different opinionthan yours I ask you to not continue reading my review.\\n\\n\r\nI want to clarify this before I start, I'm a fan of this series since the day it was released in 2009 and the second season is in my top ten favorite anime of all the time, so you wonder why I did not like this part? and the answer is very simple, I do not like this part because it concentrates everything that is wrong with the last works of the Monogatari series by the acclaimed Japanese animation studio shaft and directed by Akiyuki Shinbou, oh wait a moment is not even him who directed these episodes, that makes so much sense and at the same time so little, Shinbou why do you disappear when the fans of the old times need you more than ever? oh, I see you're a captain who does not sink with the ship, intelligent move on your part, traidor. \\n\\n\r\nOne of the clearest problems is the speed with which the story advances, being so fast does not create a sense of importance in the events that occur in the story, at one point we are with a scene that pretends to be emotional and full of stress and the next moment the protagonist is making jokes about the underwear of a minor and you can tell me that that always happened with the Monogatari series but this time it is in a more clumsy, notorious and completely out of place way. \\n\\n\r\nIt is really depressing and insulting for a lifelong fan to see that the mistakes of the past have not been corrected and not only that, but that the problem has been aggravated in such a stupid way that you can not do anything more than pretend that you did not see anything. I was the best accomplice of this series and I did not give importance in the past but I got bored of the same grotesque joke again and again, which leads us to the following problem with these episodes, which is the repetition of the same old material, these episodes only repeats the same jokes and ideas that in previous seasons, these episodes did not innovate at all and you know what is worse than that? is that the people behind this work does not even try or care about the fact that they are just recycling the old stuff over and over again, they are hitting your head over and over again with the same old ideas and jokes until you say enough and I'm a fan who got tired of this deal, it is no longer funny, it is not innovative anymore, it is not even artistically pleasing as it was before. It's just an endless number of memes that died a long time ago. They pretend to be funny when it's just a lot of trash that they're recycling to not create anything new. Why strive to create something new if the old is accepted as something with some value. \\n\\n\r\nThese episodes suffer from not giving much explanation to some important events that occur in the life of the characters, how convenient is to not explain anything and just move forward as if this were a race but the production team can take the time to do the same joke again and again, so it is not a problem of time, they simply do not care in the desire of the fans, \"give us your money and go away\". Also includes many characters that are only present for a brief and insignificant moment, this is an insult to the characters themselves and fans of these characters, an absolute disgrace. In other occasions the characters act as if they were a stereotype of some very obvious program and they make clear what are their intentions although the series wants to generate an atmosphere of mystery, but is not a mystery if you are telling me everything directly or at least is not a good mystery.\\n\\n\r\nThese episodes are the clear sign that studio shaft loves to play safe and just want the easy money of the fans who are hungry for more material, for more empty dialogues and characters pretending to be talking about something deep when it's just about the panties of a little girl. The fans are many, they will eat whatever it is, they must create something that many will like, easy to eat and bring it to their tables as fast as possible and the result is a hamburger. this is a hamburger that instead of having interesting dialogues full of new ideas is full of the greed of the people who are in the production studio, instead of having witty and provocative comedy has jokes about the tits of a little girl and instead of taking the time to develop the characters and be careful with their emotions has recycled material fresh from the trash. \\n\\n\r\nI firmly refuse to accept this insult to my loyalty for this franchise, I refuse with all my love to accept this mistreatment of my patience and I refuse with all my passion to remain silent, these episodes were the worst I saw in the whole series and it's sad that everything has ended in this mediocre way. Each movement of the characters was predictable, each word was said in the past and every joke was repeated so many times that it is no longer funny. \\n\\n\r\nSweet dreams my beautiful monogatari series, you are no longer what you once knew to be. I have admired you for over 8 years, I laughed with your first jokes and I identify with some of your characters but after more than 68 episodes, 3 movies, 2 ovas, you're not longer what you used to be.\\n\\n\r\nI do not need buzzword like say \"masterpiece\" every 4 words to describe my feelings, I just let the heart speak and this review was made with heart and passion so I hope you understand that I do not hate this series at all, I just wish everything was better... Every moment, every word, every plot change in the story did not live up to expectation and the name of these series.\\n\\n\r\nRest in peace. \\n\\n\r\nFrom a real fan who was waiting for this moment for more than 8 years.",
            "date": "2017-08-15T20:34:00+00:00",
            "helpful_count": 247,
            "mal_id": 255561,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987930.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Akzhu7",
                "username": "Akzhu7"
            },
            "url": "https://myanimelist.net/reviews.php?id=255561"
        },
        {
            "content": "Before the review this is my personal opinion: I am so glad that this series didn’t disappoint me at all and I had such a great time watching it . Monogatari will always be one of the best anime I saw and I genuinely love it with all  my heart starting with the great characters and ending with the lessons told from each series. \r\nThis is the final puzzle piece from the Monogatari series. In this series every little detail from the other series that were left unexplained was revealed to its audience. Another worth praising writing style from the author who knows damnwell how to leave intentionally plot holes who are gonna be filled later in his future works. This is why the flaws are what makes Monogatari a great piece from the storytelling medium.\\n\\n\r\nOnce again Shaft managed to use the visuals in perfect harmony with the current action of the characters and dialogue lines to emphasis the message for its audience. As an example I will mention  the fantastic and beautiful association of each character from monogatari with a star constellation during Ougi’s explications .The dialogue is well used for the characterization and plot helping with the progression of the story.\\n\\n\r\nAs we all know the minor characters from Monogatari are so well used for the plot and characterization of the main characters and in this series doesn’t disappoint us at all . Who taught that Tadatsuru a minor character from Tsukimonogatari would had such a impact across the story in Owari 2. Let’s not forget Oshino Meme disappearance after Bake which had a purpose after all and finally Gaen who is the shining star from Owari 2 using again her brilliant mind to solve a problem. Fantastic!\\n\\n\r\nOwari 2 also manages to give screen time to the two main characters from Bake Senjougahara and Araragi. It’s always a pleasure to see Senjougahara verbal abusing Araragi but caring for him deep down in her heart proving once again why her actions are unpredictable and her personality unique. What I am trying to say is that in this series we finally see the choices that those decided to take as a couple for their future after their long fight with their own problems.\\n\\n\r\nOne of the main themes that needs to be mentioned is about change,  portrayed through the actions and choices Araragi goes through . As for each part from Owari 2 they each have a different plot and message  but they are all connected to the main story from Owari 2.Mayoi Hell is the preparation stage for Ougi Dark and Hitagi Rendevouz is the bridge that connects them . In Ougi Dark  everything comes together giving a conclusion to the Monogatari series and presenting how the actions and choices the characters made influenced their lives .\\n\\n\r\nTrust me you will not regret any moment by watching Owari 2 , you will experience  a lot of emotions through each arc and the conclusion will leave you in tears of joy and sadness.\\n\r\nThis series managed to give a conclusion to all of the other series from Monogatari and answer all the left questions. \\n",
            "date": "2017-08-13T06:17:00+00:00",
            "helpful_count": 216,
            "mal_id": 255340,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=255340"
        },
        {
            "content": "[9.0/10]\r\n_____________________________________________________________________________________________________\r\nOwarimonogatari was ultimately the end of the first, and most likely the main story of the series. These last three arcs provided a good conclusion and I wouldn't be upset if that's the final Monogatari-related product adapted by SHAFT. Although I doubt it, since there are tens of side-stories, epilogues, prologues and everything in-between left to adapt. This, however, felt like a proper conclusion. Even if it wasn't what I wanted, I can't help but feel happy about the ending regardless. \r\nMonogatari, ever since I began watching it, always left me with an air of ambivalence. If you go venture forth to the past anddig through to find one of my earliest reviews on this website, one of Bakemonogatari, you'd see exactly that. Me struggling endlessly with coming to terms with my feelings about the series. It left me feeling sleazy and gross, but compelled and intrigued. I initially described it as the guiltiest possible pleasure and while my opinions may have changed with my tastes, I think that outlines the overall complexity of emotions I felt towards the product. On one hand the presentation is outstanding and unique, hearkening back and taking from the French New Wave, but what its presenting is often perverse and over-indulgent. The main narrative is fractured and presented in a spectacularly interesting fashion with the unreliable narrator quirk, but is often sidelined for pandering sexuality. The characters are multi-faceted and endlessly dynamic, but aren't often presented as such. It is an enigma, truly. \\n\\n\r\nWhile my opinions have changed and my appreciation for this series continuously grows, due to the amount of inspiration it has given me as a creative, this idea of conflicting feelings still remains the same. Even throughout this end-story. I get a conclusion, and the conclusion is quite good with just about every story wrapping up in a feel-good bundle of catharsis. It is still something that I wasn't expecting nor really wanting from this show. I was expecting something darker, something more somber, something with pain and eventual sacrifice and I was expecting the specialists to play significantly bigger role in the story after their buildup through Owarimonogatari's first season as well as the awe-inspiring conclusion to Koyomimonogatari. \\n\\n\r\nMaybe my expectations weren't deserved and built completely upon my own desires for the series, but that feels redundant to say as that's pretty much defining expectations for anything. Owarimonogatari's second season and conclusion does have problems, however, it is packaged and delivered so well that they don't feel like problems as much as they feel like additions that I may disagree with. Maybe that's why i'm so happy to accept this conclusion even if it harshly isn't what I wanted or expected, that's my mea culpa. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\\n\r\n[Presentation] \\n\\n\r\nBefore we delve deep into the semi-spoiler conversation, I think it is safe to say that this series is the best presented television anime. While it may not be as beautifully animated as something from Kyoto Animation or as viciously energetic as a Trigger production, it is a SHAFT product through and through. Harsh yet understated, with pronounced colors and a focus on bringing the most from dialogue heavy scenes. \\n\\n\r\nThe coloring in these episodes is as good as ever, with beautiful shot-composition mixed in with spectacular changes in art-style in the first arc of this series. The other two were equally beautiful, with harsh changes of color and space, presenting even the goofiest character moments as if it is high-art strung up in a gallery. \\n\\n\r\nThe violent, stinging violins in the climactic soundtrack continuously impress. While most people may point to the admittedly catchy opening themes of this series as examples of its musical prowess, I can't help but point to what I find more impressive. The memorable backing tracks to the shows most climactic moments. From the badass theme at the end of Nisemonogatari, where specialist Kagenui flexes her muscles in a scene so brutally cathartic that it is one of my all-time favorite anime moments. To the plucking strings and winding synths of the shows most surprising scenes, when Gaen reveals her vampire-slaying sword and chops our protagonist into a thousand pieces. The music here is as wonderful as ever. \\n\\n\r\nMonogatari has never been the most animated series, and for good reason. Much like most TV-anime it is a rushed product on a deadline. However, SHAFT make even the most still scenes feel alive and vibrant with the setting and shot composition, and as always the direction here is astounding. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\\n\r\n[Story and Resolution] \\n\\n\\n\r\nPresented in three arcs, the final moments with these characters and their eventual graduation feel spur-of-the-moment. The show, for the first time ever, feels as though it has a distinct narrative purpose. Since it has one goal, to end its main story, it never decides to linger on moments that are otherwise unimportant to the series narrative. Even the second episode, the extended date between Senjougahara and Araragi feels as though it plays a direct part in the climax, Araragi's waning adolescence, Ougi's mysterious plot, and the growth between these two from a relationship standpoint. \\n\\n\r\nHowever, before we delve into that, we have the first story. Between Araragi, Hachikuji, and the involved Tadatsuru, which delivers something visually astounding and narratively intriguing, yet creates a few worries that may find themselves wriggling into the shows core climax.  \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\\n\r\n[Mayoi Hell] \\n\\n\r\nObvious spoilers. Hachikuji is back and she's in hell. Some pretty funny reasoning is provided for that. More importantly, SHAFT gets to flex its visual style to the fullest here, providing one of the most visually impressive arcs since the gorgeous Tsukimonogatari. As Araragi ventures through hell, and to a certain extent, his past, he discovers how to return and what the reasoning behind his murder was. An elaborate plan by Gaen to return his humanity. \\n\\n\r\nGood stuff. Even if Hachikuji's return wasn't all that interesting to me. Especially since we have already said our goodbyes to that character and coming back after a pretty good send-off feels as though i'm holding in a sneeze. Unrewarding and kind of painful. I like Hachikuji, she's quirky and engaging with a pretty great catchphrase that gets probably the best payoff of any joke in the series. However, I couldn't help but feel disappointed in her return as an establishment of norms and the lack of consequences. It robbed the series of some weight. More on her later. \\n\\n\r\nThey meet with Tadatsuru and in beloved Monogatari fashion we get a gloriously long exposition sequence full of fascinating insights by this really intriguing character, as well as a quick look at the network of specialists that Gaen has established as being the backbone for oddity-hunting. Tadatsuru's powers are great and paint a understandable picture of Ononoki's creation, even if we lack the insight of her \"big sister\", Kagenui, more on her later. \\n\\n\r\nAraragi is sent off with Hachikuji captured in his legs and brings her into the real world. Initially I had even more of an objection to this, as it totally undermined her exit even further. If it is so easy to leave hell, what is even the point of it? However, that gets amended further on in the series. The introductory arc here really set the tone for the show. It was lean-mean, and without filler, which was great. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\r\n[Hitagi Rendezvous] \\n\\n\r\nBefore I even talk about the date, I want to express how deeply upsetting it was to see Kagenui's character and her potentially incredible importance to the series being brushed off. It undermined the entirety of her disappearance in Koyomimonogatari as well as never quite explaining how Ougi got anyone to leave. It felt like an underhanded and obnoxiously pandering way to just keep Ononoki around the harem, which honestly doesn't fucking matter to me. Ononoki is pretty much useless right now, she is literally a doll and since Kagenui isn't around, has virtually no power. She is there to provide a few sparring dialogue driven moments and her inclusion in this arc felt completely unnecessary as she virtually did nothing. \\n\\n\r\nIf they kept Kagenui relevant to the story and didn't chuck her to the side for literally no convincing reason, Ononoki and Kagenui could've been back to actually matter and provide some interesting insight to spar with Gaen's own bias arguments against Ougi. Yet nothing like that happened. She's gone, and the reasoning given was that she was practicing \"Martial arts\" at what was later revealed to be the North Pole. Why? Why would she be doing that? Isn't she an immortal oddity specialist? Isn't her goal and job to exterminate immortal oddities? Isn't Shinobu back in her full-form? Isn't that Ougi? Kagenui expressed no fear in fighting Shinobu with her powers back in Nise, so it makes no sense for her to leave now. Way to completely under-utilize a dynamic and potentially interesting character. What a farce. This was probably the most upsetting moment about this three-parter and probably the only reason I had to take a point off. \\n\\n\r\nEspecially since the date between Araragi and Senjougahara was wonderful. I always felt as though their relationship was a bit tepid. They said they damn-near love each other yet Araragi runs around fucking with plenty of other girls. It really doesn't make any sense and makes the entire relationship feel phony, especially since Senjougahara got almost no screen-time recently. Her return is welcome. She is the most dynamic and fascinating of the harem-girls and definitely proved that here. Her character growth since the first arc in Bakemonogatari is palpable and honestly very endearing. Her various little idiosyncrasies really paint an engaging portrait of her character. \\n\\n\r\nThe resolution to their date is endlessly lovable and actually helps create a more believable relationship between the two, even if I still object to Araragi's lascivious and scummy behavior otherwise. I really enjoyed this, and I didn't find that it meandered or lacked any meaning. It was well-placed in the middle of these other two, more serious arcs. \\n\\n\r\nWhat i'd be remiss not to discuss is the dream sequence with Ougi, which is not only a spectacular insight on her character but also plays as a wonderful hint at who she really is. Everything from her saying being a riff on Gaen and Hanekawa to her knowledge of the star-systems being Araragi's own knowledge, the pieces of the puzzle were finally falling into place and this fractured narrative was finally become clear. At this point, in my eyes, it was clear with who Ougi was, even if I wasn't sure what role she exactly played. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\r\n[Ougi Dark]\\n\\n\r\nTo refer back to my initial thesis, this arc's progress and climax wasn't something I was expecting or wanting, but a great part about growing up is being able to look at something as a whole and really determining whether that is a bad thing. I think the more I look back on this arc the more I'll come to enjoy and appreciate that it did something that I wasn't expecting nor wanting, but still managed to be entertaining and pretty damn impressive, narratively. \\n\\n\r\nMy fear that the specialists would ultimately play a small role in the climax was unfortunately confirmed, as Gaen dumped some exposition and moved on. This and Shinobu's ultimate uselessness in her hyper-powerful form needs to be accepted as a narrative loop rather than a flaw, in my opinion. Because of course Araragi will ultimately have to face this issue on his own. It is, after all, always been his issue and no one else's. The narrative here had me hurdling through various flaming hoops of acceptance while also trying to follow along to the somewhat complicated explanations for everything. Needless to say, it was a gripping experience none-the-less.\\n\\n\r\nWhat particularly impressed me apart from Ougi's true reveal was the use for Hachikuji who's inclusion I have previously expressed my distaste with. Gaen's proposed solution was actually quite clever and made sense within the grand scheme of the story and provided the best use of Hachikuji's signature 'I stuttered\" catchphrase. It was great. I went from disliking her inclusion to totally buying it, which speaks volumes to how well this entire aspect of the narrative was delivered. \\n\\n\r\nOnward to Ougi's true reveal. I say \"true\" because her being Araragi's oddity didn't come as much of a surprise, of course she was. Especially the opening to this final arc solidifying that. What was more interesting a reveal was her role as Araragi's oddity, manifesting as adolescence. This actually paints a unique picture of Araragi's character and growth throughout the series. \\n\\n\r\nI'm no stranger to criticizing our boy Koyomi here, since I think he's kind of a scumbag, however, the portrait of his adolescence was poignant none-the-less. This somewhat esoteric conclusion helped me understand the rest of this series' motivations as well as his character progression overall. What could've been myopic ended up being quite engaging, even Araragi's rejection of his own change to saving Ougi, which I was initially against but over the course of the past few hours warmed up to. Because of course he'd save her, he's Araragi. \\n\\n\r\n_____________________________________________________________________________________________________\\n\\n\r\n[The Moral of the Story]\\n\\n\\n\r\nAnd now for the epilogue, or rather, the punchline. What Monogatari does so well is provide an experience unlike anything else in anime. An industry and medium that indulges in pulpy entertainment has this series which indulges in the idea of indulging. Consuming everything that is inherently right or wrong with the industry and presenting it as if it is high-art. Taking ideas from the most influential, yet also the most cherry-picked movement in cinema, the French New Wave, and crafting a narrative that not only doesn't treat its audience like children, but goes out of its way to be esoteric and challenging. Very much in line with the New Wave, Monogatari has a kind of style and essence to it that separates it from anything else in the medium. Especially since at its core it has these sleazy elements to it. \\n\\n\r\nRelating back to the initial point of contention, my dissonance with this series manifesting as a love and appreciation for it. These last three arcs, ones which lack the fanservice that some of the other parts of the series indulge in, are some of the most solid parts of the series, up there with the flawless masterpiece which is Hitagi End, my favorite thing I've ever seen from this televised medium. It proves to me that this show could've been better without its over-indulgent obsession with childish sexuality and pandering which often took up big parts of other episodes in other arcs, however, is that really true? I undoubtedly didn't, and don't, enjoy those elements, yet they are inherent in Monogatari being Monogatari. Without them this wouldn't be Monogatari, and the lack of them in these final arcs proves to me how big of contrast there is, which helped elevate the stakes and create tension which otherwise wouldn't have been escalated if the entire series was devoid of these elements.\\n\\n\r\nI feel like I always wanted Monogatari to be more mature than it was, however, once again, maybe that was wishful thinking. Much like Araragi says as the final line in these arcs, he is himself, and this series is itself. And expecting it to be something different when it so well-established exactly what it is makes no sense, logistically. Because much like Araragi, Monogatari experienced an odd kind of growth as well, where the maturity may not have increased but a realization did happen. The self-awareness here is palpable and as with any product that has displayed a knack for multi-faceted storytelling, I don't think it is out-of-line to analyze this series so extensively. \\n\\n\r\nDuring Ougi Dark, there is a scene where the characters dissect Ougi's formation as a cake. Each character representing a slice. Which honestly feels like this show being self-aware about its own indulgence, both having the cake and eating it to, which is an element I've been bringing up in reviews since their conception. The cake here being Araragi's division and eventual realization of purpose, while also doubling as context for this shows harem elements. Which I wouldn't say is as much of an excuse as it is a justification, and a good one at that. \\n\\n\r\nIts harem elements were never the strongest parts of the series, and being myself I'd go so far as to say they were the weakest parts. However, they, in the end, felt necessary to this show having the conclusion it did. For me, the strongest parts were always the main narrative and the specialists, who were characters that were infinitely more fascinating than the main group and harbored more interesting traits and purposes, but as I've already said, it wasn't their story and I shouldn't have been expecting them to play a huge role here. My own, negative idiosyncrasy. \\n\\n\r\nIn the end, this series which still confuses me emotionally provided an exceptional conclusion to its first and most likely main story, as it wrapped up its final arcs in an acceptable and thoroughly understandable way. At its most basic, the story of adolescence and accepting that adolescence permeates through the entirety of this series. Because if we were to fully strip it down, the punchline is that there is no need to let go of that. Much like Araragi isn't willing to let go of his own, even while saying that his adolescence has left him he acknowledges that he isn't fully an adult to Hanekawa. And I don't think that is really the point of this experience. It isn't much of a coming of age story. At the climax, he doesn't let go of the oddity manifesting as his own adolescence and that's the final realization. But I don't know.\\n\\n\r\nBut who knows, really? A series like this is so esoteric that even its most well-defined moments can be read into as something else and that's exactly what I appreciate about it. It proves itself worthy of being analyzed, as any great piece of art should. As I said in my very first venture into Monogatari, I only know what I know.",
            "date": "2017-08-13T16:15:00+00:00",
            "helpful_count": 164,
            "mal_id": 255380,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5554102.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Artrill",
                "username": "Artrill"
            },
            "url": "https://myanimelist.net/reviews.php?id=255380"
        },
        {
            "content": "**THIS REVIEW CONTAINS MAJOR SPOILERS**\r\nJust a friendly reminder. Owarimonogatari Series 2nd Season is the 'Direct Sequel' of the Last Part of 'Koyomimonogatari'. \r\nMy, my, my. Shaft did it again. What's better than adapting one part of the Monogatari Series? Adapting flippin' all of them. I was hesitant about watching the Series at first, then, I binged watch Bakemonogatari and loved it. Now, I'm here at the 2nd Season of Owarimonogatari. As usual, I loved what Shaft did, I love Kamiya Hiroshi (Araragi's VA) and I loved the Series itself. \r\nThis has once again blown my mind. Ougi being the Final Boss still gets me dumbfounded.Meme is going back too. Ougi just destroyed one of my theories about her. I love the Monologues that never failed to tamper my mind and potentially change how it works. The lines of each characters never failed to conceptually change my principles and beliefs (Or maybe I'm just someone that's easy to influence?). The pacing is perfect for me and if you have watched all of the other parts before this, you should have a good grasp of the current situation. With my level of intelligence (which is low), I think I understood everything, so you'll be fine. \\n\\n\r\nWhat mattered the most for me (slightly) more than witnessing this amazing story and watching these memorable characters, is the enjoyment. If we're talking about generalities, the whole series gave it to me. But comparing the amount of enjoyment I got from the rest of the Series, Owarimonogatari 2nd Season is among the top. The first season made me doze of after a few minutes but this had me awake all night. I really enjoyed everything especially the chill atmosphere that the Hitagi Rendezvous gave. \\n\\n\r\nI'm really excited about how the story will unfold and I'm hypin' up inside. I don't read the Light Novel so I don't know how this is gonna end... Well except the fact that Araragi would be alive at the very end knowing that Hanamonogatari is a thing... But hey, he died once, then lived again. You never know... \\n\\n\r\nOverall: 9/10. \\n\\n\r\nThis score would likely change (increase) after I finish the series... I have high expectations for this but Shaft never failed to meet- no, exceed them.",
            "date": "2017-08-12T17:43:00+00:00",
            "helpful_count": 48,
            "mal_id": 255289,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6411078.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Izaya-Hasegawa",
                "username": "Izaya-Hasegawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=255289"
        },
        {
            "content": "Look. It's just another harem. \r\nBy \"it,\" I mean this franchise as a whole, and I've seen a lot of it, starting with Bakemonogatari almost a decade ago. Really, it hasn't varied much; it's always been just another harem.\r\nIf you somehow didn't realize that it's just another harem, I can tell you it has the same tropes as every other harem:\r\n- Naturally, every or almost every female in the harem is in love with Him for no apparent reason.\r\n- He has the unremarkable appearance of a typical Japanese male young adult, such that He may easily serve as a self-insert for the target audience.\r\n- Endlessfanservice.\\n\\n\r\nThere's nothing inherently wrong with these things. If the stories and premises are engaging, such a thing can be enjoyable. But I'm afraid that isn't the case with this entry in the series, the second season of Owarimonogatari, in particular.\\n\\n\r\nI've reflected on my problems with the narrative style of Monogatari before. It is simply not engaging, unless fanservice and art alone are enough to keep your attention. The same pattern continues here. For example, the first episode begins with Araragi Koyomi laying on the ground reflecting on... something having to with do with the ghost kindergartner, Hachikuji. Meanwhile there's a flashy abstract animation of her floating about. \\n\\n\r\nThen the OP begins. This is not engaging. It does not grab my attention. I'm not interested in watching a little girl float around to be honest. \\n\\n\r\nAnd that's the problem with the narrative style. The dialog is too long and drawn out, and it takes too long to get to the point. So I have to sit and wait for Araragi and Hachikuji to finish dicking around for several minutes to finally get to the reason why they are even where they are. This is tedious.\\n\\n\r\nFor me, the studio's (Shaft's) flashy, colorful art style doesn't disguise this. Shaft's animation style seems to me to be the only thing that would put this above any other harem, but that alone does not make the show good. So I can can only conclude that it's just another harem because the only other thing that one might find engaging, in my mind, is the fanservice. Otherwise, I feel like watching this tedious narrative style is akin to watching a pretty oil painting dry.\\n\\n\r\nLet me contrast another entry in the franchise, which I found to slightly better as a whole than this one: \\n\\n\r\nIn the first Kizumonogatari episode or movie or whatever you wanna call it, it begins with Araragi stumbling around, seemingly searching or escaping from something before going outside and bursting into flames. Here you have just plain action, as strange and unexplained as it is. This evokes immediate curiosity, as opposed to beginning with some tedious dialog that immediately disengages me and immediately sets the tone for boredom. It's so simple, so easy. Seems like whoever directs these doesn't understand that consistently. \\n\\n\r\nStart immediately with a direction for the plot. Start with the reason for why I want to watch the rest of the show. For example, in Kizumonogatari, I want to watch the rest of the show because I want to know why that happened to Araragikun. In Owarimonogatri S2, I want to watch the rest of the show because... Hachikukuji is a cute loli? Uh, no. \\n\\n\r\nThen you continue with a goal, a reason for me to stay engaged. In Kizumonogari the goal appears to be to retrieve something from certain people, resulting in a somewhat engaging conflict. In Owarimonogatari season 2, the goal is to... I don't even know what exactly the goal is until about the last episode. This is a recurring problem in the Monogatari series. I seem to recall many a Monogatari episode beginning with just endless tiresome dialog that takes forever to get to the point. At least this particular OVA, or whatever it is, is relatively short.\\n\\n\r\nMy final thoughts have to do with the fact that I'm not a fan of episodic or slice of life shows. I need something plot-driven and goal-oriented in order to have a reason to keep watching. That is unless something episodic is also so novel or over-the-top that I can't stop watching, which is rare these days. The narrative style makes Monogatari like an episodic show because it's always difficult to tell what the goal is. I've consumed enough fiction such that I see nothing new enough to make up for this. So if you're like me, you'll probably agree that this is just another harem.\\n\\n\\n\\n\\n\\n",
            "date": "2017-08-15T22:56:00+00:00",
            "helpful_count": 24,
            "mal_id": 255569,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/220276.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AngerAndHate",
                "username": "AngerAndHate"
            },
            "url": "https://myanimelist.net/reviews.php?id=255569"
        },
        {
            "content": "***This is a spoiler free review***\r\nWhile I am filled with the most absolute joy towards this series than any other long-running series that I am currently aware of, there is also a feeling of melancholy as I watch this beautifully crafted mini-series end what has been such an amazing journey. The highs and the lows of the Monogatari series are coming to a conclusion (for now?)...and it is glorious. \r\nStory: 9/10\r\nWhile it might not be fair to hold what I am about to say against Owarimonogatari second season, it is an absolute fact; the mini-series just needs to bring lose ends to an end. Yesregardless of how Owarimonogatari second season ends it is not the final piece of Monogatari content (see the  Hanamonogatari anime adaptation and any other possible volumes that haven't been adapted) but it is the end of this story line with Araragi as the main focus (I think?).\\n\\n\r\nWith that out of the way, Owarimonogatari absolutely concludes the series gracefully and beautifully. The first part is masterfully paced and does an amazing job at hinting at what is to come later on in the mini-series. The pacing is aided heavily by the soundtrack (more about that in the sound section) but it's also the dialogue and visual direction (more about that in the art/animation section). Without going into spoilers, it just needs to be said that this season is an absolutely amazing conclusion to the main story line of Monogatari. \\n\\n\r\nArt/Animation: 10/10\\n\\n\r\nEvery time you watch something from SHAFT you think that “well this is SHAFT” not knowing that the next piece of media from them changes/evolves their “style”. While the Monogatari films have their own look, the tv series has been evolving this super clean animation and art style since the first season. It is safe to say that this is Monogatari at its best tv season wise. There are also a lot of very stylized frames of animation within this season. The first part has a lot of moments where the show looks completely different than the rest of the series yet it fits in and feels like Monogatari. The colors used scream visual keys as well as just plain appealing design. Characters look great, and the detailed scenes have very good architecture. \\n\\n\r\nThis is simply the best I've seen SHAFT do in a tv series.\\n\\n\r\nSound: 10/10\\n\\n\r\nAll of the Monogatari parts (including the films) have amazing soundtracks. Some of them are good because they stay out of the way and aid in the conversations only a tiny bit (a lot of Bakemonogatari and some of Nisemonogatari) while the soundtracks can completely take control and dictate pacing (Tsukimonogatari). Owarimonogatari takes the Tsuki route and just takes you for a ride with its beautiful music. It dictates not only the pacing but also the mood very well. The music used towards the end of Araragi's first journey in the first part of the season is so masterfully done. \\n\\n\r\nThe idea that music should not drive the movie/show (yes this is an idea circulating Hollywood currently) just doesn't make sense to me. Ever since Monogatari Second Season, the series as a whole has allowed the music to completely drive the show. I recently saw the film Dunkirk and the music was the main reason why the film felt so complete. You don't want the soundtrack/score to beat your head in with emotion but if you can nail that fine line of direction without being overbearing, you will enhance all emotions tenfold. Owarimonogatari second season absolutely nails this.\\n\\n\r\nThe last part of this is of course the voice acting. Just...perfect is all I can really say. The second part that showcased Araragi and Senjougahara literally gave me goosebumps.\\n\\n\r\nCharacters: 10/10\\n\\n\r\nYup. This is it. This is the characters at their absolute best. The characters that make an appearance in this season do so with absolute style and class. Aided by on-point dialogue, visual direction, and a perfectly fitting soundtrack, they shine, fall, and exist with perfection. Since this season is the finale of this main story line, the characters have a spotlight pointed directly at them. Luckily, none of them choked. The performances were on-point and dramatic (when needed). Simply perfect.\\n\\n\r\nOverall: 9.8/10\\n\\n\r\nI'm really trying to not fanboy here but it's just impossible to not see the perfection in front of my eyes. The season did it's job AND SOME. It not only concluded what needed to be concluded but also somehow added in more character development where I thought wasn't possible. Thank you SHAFT for gracing us with this marvelous series. I can now safely say that the Monogatari series my most favorite long-running series. Say what you want about the fanservice whether it is needed or not, the series is a fine example of great storytelling.\\n\\n\r\nEnjoyment: ∞/10\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-08-13T15:26:00+00:00",
            "helpful_count": 20,
            "mal_id": 255376,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=255376"
        },
        {
            "content": "As I've seen every part of this series in this year, I can say this story gives the tip of the iceberg. It concludes the main arc it had, not only flawlessy, but add something on top of it. I rarely purchase the source material for an anime, but clearly, I will purchase the entire series. I am suggesting anyone, who is just astound how this 2nd season has an high ranking, just to watch the entire series in release order.\r\nBecause there isn't really an flaw, I give the story an 10.\r\nThe art was masterpiece itself. 10.\r\nI like the OST very much and it wasalways on-point. 10.\\n\r\nCharacters weren't flawed at all. 10.\\n\r\nEnjoyment was an 11.\\n\r\nOverall: 10/10 would watch again, but please delete my memories.",
            "date": "2017-08-15T15:12:00+00:00",
            "helpful_count": 11,
            "mal_id": 255541,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5635162.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SumaseKyoraru",
                "username": "SumaseKyoraru"
            },
            "url": "https://myanimelist.net/reviews.php?id=255541"
        },
        {
            "content": "Like everyone who has watched Monogatari to this point, I'm obviously a huge fan of the show, which is why it pains me to say this, but: Owarimonogatari 2nd Season is overrated.  Honestly, several parts of the Monogatarai series are better than this, including the first season.  And while it was an enjoyable entry, I kind of expected more, considering this is the highest ranked of all the Monogatari series.  But, in truth, this turned into one massive cop out after another.  \r\nMAJOR SPOILERS AHEAD: \r\nIf there is one thing that I hate in any medium of entertainment, it's when creatorsor directors are too scared to make permanent changes to the formula that made them popular.  This hatred is exacerbated when they appear to make those changes and then reverse them for a happy ending.  Owarimonogatari S2 was too scared to pull the trigger on three major occasions, instead opting to undo or swerve out of it.  \\n\\n\r\n1. They reversed the death of Mayoi, with Araragi dragging her out of hell.  \\n\r\n2. Shinobu was completely restored, something that was foreshadowed and everyone was worried about throughout the whole show, but she decides to go right back to being a little girl again.  \\n\r\n3. Ougi looks like she'll die, but then they do a last second Dues Ex Machina to save her.  \\n\\n\r\nNow, I love Hachikuji, I love Shinobu and I love Ougi, I'm happy that Hachikuji is back, I'm happy that Shinobu didn't leave Araragi (not that she would) and I'm happy that Ougi survived.  But, going for the safe happy ending on every front, even undoing previous bold creative choices, makes for a low-stakes anime and removes any sense of long-term consequences for their actions.  This, in turn, drives down the suspense of the show.  It feels like nothing truly matters because no one will die and everything can be undone with living strings dropping into hell and acting as dragonballs. \\n\\n\r\nNow, that's not to say that this wasn't a good anime, but it could have been so much better if they had've had the courage to stick with at least one of those changes.  At the very least Ougi should have died. Ougi is my third favorite character in the anime behind Araragi and Mayoi, but she should have died.  Let there be a sense of loss.  Deus Ex Machinas are the tools of unadventurous artists.  And in this case, undid what could've been a true classic, rather than just a great anime.  \\n\\n\r\nAlso, another thing I didn't care for is how useless they've made Hitagi.  She finally gets some significant screen time and she's mainly just a regular girlfriend.  Why have they made one of the most important and intriguing characters in the show a side-thought?  I miss the sadistic and some what frightening Senjougahara.  Ever since things wrapped up with Kaiki Deshu, she's like a defanged tiger with little screen time.  But, in getting more screen time this season, it was even more apparent that what made Hitagi great has been greatly diminished.  I was actually trying to stay awake during their date.  \\n\\n\r\nIt may sound like I hated this season, but I didn't.  It was entertaining, the dialogue was as sharp as always the mystery and intrigue was there as usual.  (Although, the identity of Ougi was something pretty obvious, especially after classroom episode in the first season.).  It was still good.  Really, I just felt like they missed an opportunity to really shake things up in a memorable way with all the creative cop outs.  \"By the way, this is me pleading for my life.\" should have been a legendary moment.  It was cheapened by the plea working.  \\n\\n\r\nStory: 9\\n\r\nArt: 10\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 8\\n\r\nOverall: 7\\n\\n\r\nAgain, it gets high scores from me, but it's still overrated.  Cop outs just leave a bad taste in my mouth.",
            "date": "2018-12-29T02:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 297294,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=297294"
        },
        {
            "content": "-------------------- Owarimonogatari Second Season --------------------\r\nWell, it has beeen 2 years since the last monogatari series, and boy! let me tell you  that the wait was worth it! absolutely worth it. First I have to say that the Monogatari Series is my favorite anime of all time, and this season proved why. \r\n[ART & ANIMATION]\r\nShaft did a pretty good job with the art style and animation, it doesnt have a lot of details but it fits great with the anime. It is also consistent with the other series and it has an interesting way of desing, that has been seen since the first season aired.The desing of the background that is simple and also using no background characters was a thing I only saw with shaft and their works. Something that I really like is the way that by giving background to the viewer with the cards that appeare now and then in each episode (and the whole series as well). We also get to se the art work of Gekidan INU Curry for a part in Mayoi Hell and the ending as well, which is pretty nice art style and uncommon to see in anime (the other anime that, I know of, of having that art style is madoka with their witches). Personally I prefer the art style of the anime more than the movies. Also the animation is smooth to the eye and isn't that heavy to the eye so is easy to watch. The only thing is that if you want to read the cards, you need to be pretty fast to actually post the video so you can read it. 10/10\\n\\n\r\n[SOUND]\\n\\n\r\nThe sound had good quality and I personally enjoy it. I love the music of the openings and ending of the series, sang by the voice actor of Mayoi Hachikuji (Emiri Katou) and Ougi Oshino (Kaori Mizuhashi). The soundtrack its pretty well done and gives the ambient of the story the feeling of being alive. The voice actors did a pretty good job with their characters, they portrayed it well and they are consistent with their works on this series. I enjoy every work of the voice actos and the way they said the lines fit perfect for me with those compared to the book. The diaologue its fast and serious with sometimes hitting the comical absurd. 10/10\\n\\n\r\n[STORY]\\n\\n\r\nI dont want to spoil anyone, so this part is going to be pretty quick. This story takes place after the events that happened in Koyomimonogatari. Its the parts of Mayoi Hell, Hitagi Rendezvous and Ougi Dark. The characters have the same personality and the dialogu exchange is quick and stupidly confussing. They do a lot of word play with the kanji of different things, like the word play with Senjougahara's driving license. It also gives background of the story with the different cards that appeared throught the episodes. The story is pretty good and get your tissues ready, because you are going to need a lot and I dont mean it because of the fan service (honestly now that I think about it, it doesn't have any fan service at all compared to the other seasons). Even though the season was sort of 2 hours long, Shaft did a good job on narriating the parts with great detail on them. The story is pretty easy to understand and to catch all the things from the beggining, that lead to the ending of the story. Story 10/10 \\n\\n\r\n[CONCLUSION]\\n\\n\r\nThe Owarimonogatari s2 brought to me a lot of nostalgia and feelings, because of a huge fan I am. Honestly, if the world ends tomorrow, I would die happily knowing that I could watch this season. Owarimonogatari s2 was the best part of monogatari so far, and I highly recommend to watch it (only if you have seen the other series). If you love monogatari as same as me, then I will assure you thhat you are going to like this one as well. My Overall rating 10/10",
            "date": "2017-08-23T18:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 256133,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4977190.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/thetsundereguy",
                "username": "thetsundereguy"
            },
            "url": "https://myanimelist.net/reviews.php?id=256133"
        },
        {
            "content": "(Before reading the review, or planning on watching this anime. Please do realize that this arc marked the end of the journey of Araragi's confrontations of the supernatural, amidst his occupation as a high schooler, before being graduated from being a high schooler to a college student. That being said, it's unwise and rather illogical to not watch this at the very end of the timeline, which can be discerned here (http://imgur.com/UjlhSyS). But that being said, you must watch all aired series of monogatari, excluding hanamonogatari ofc, since it's entirely irrelevant to the main story or the main attention of the plot of Koyomi, theMC. Though, be sure to watch koyomimonogatari ep 12 last before heading toward the second season of Owarimonogatari)\\n\\n\\n\r\nAs the monogatari series had made itself known to me, in the beginning of time, my first impression of this series wasn't bright, I had to, almost as if, coerced myself to continue watching it given the exudes of its sense of pretense and sophistry; which I had decided to assume about the series first that I have no great first impression off, since it's only natural to doubt a philosophically deep dialogue from an anime right? That being said, that's only when my mind and thinking process are struck in the subjective sense, due to sentimentality and all of the other factor that made up subjective view. After I've mature abit more, I started to look at things more objectively, whilst discarding the subjective ground of thinking like appealing more to sentimentality or enforcing few parts of the show I hate about to irrationally hate the show itself , listening to others to build my own ideas, trying to pander myself to the social constructed common thinking, and such. This is when I became a hardcore monogatari fan, rewatching the show like 9 times already for the past years. \\n\\n\r\nThen it had become my no.1 anime of all time. \\n\\n\r\nDigression aside, mayoi hell, hitagi renvendous and such, marked the end of the tale of Koyomi, the main lead of the story, in this great adventure of learning about the oblivion, entering into the realm of the supernatural, and adapting himself, using his own irrationality and resignation of not knowing obscured truth, to saves all the presented girls in the story. But this simply marked an end to Araragi's adolescence life, as he did in fact graduated and became, quasi, a new person entirely with the enlightened knowledge bestow by other characters, whom to which held great and unique wisdom given their differences in characters and perspectives that builds Araragi's character. Araragi started off as a pain the ass character, it changes though, and this is the quintessential growth, to that of a strong and greatly developed character through a person's adolescence, though from the perspective of an especial or an exceptional one. \\n\\n\r\nThis arc could be named the \"Magnum Opus\" of all the monogatari series combined, I would even go as far as to say that it's prolly one of the finest, and incredibly well executed, wrapped up of all arc of the life of Koyomi before his graduation and the foreboding tales, entailing the yet to come experiences, that had yet to be known to the anime watchers (that's a different story if you are a light novel reader of the monogatari series). Incidentally, the life of those that held a great relevance to Araragi's adolescence, all of them have grown as well. The rather monotonous speech pattern, and the ever so repetitious, static personality had been abolish almost credulously; this signifies the their growth, namely, Nadeko, Senjougahara,  Hanekawa and some of the character in the show (aka, Ougi). \\n\\n\r\nWhilst some people maybe confused about the scene that had been replayed in Kizumonogatari in a much different setting from the movie; this second season remained true to its primal source material. Meanwhile, the movie version of kizumonogatari greatly differs from the light novel given the extensive hyperbolic visuals, differing setting, metaphors and of the lack of a more deep and plenty dialogues; though that doesn't dwindled the credibility of how Araragi and kiss shot was built, honed, or came to be.\\n\\n\r\nAnother confusion in the this anime as well, would be the fact that in the monogatari universe, all supernatural entities that are straying from its own role, pretending to be a human/other deity or oddity, or if the observer see them doing so or realizes it (this can effect the darkness if you've seen ep 3 of Owari second season, and back in time with kiss shot and her first minion) or acknowledge them, they get swallowed up by the darkness as its existence lives solely to rectifies abnormality. \\n\\n\\n\r\nAs I've fleetingly digress, let's talk about this arc of the monogatari in particular shall we? Or let me just change that to I instead if we were to think about it logically. But, we finally got to learn about Ougi's actual identity in this second season of Owari. It had been hinted directly and even indirectly like the exuding air of her ominous aura or appearances , but it literally flew past by our heads given that we had already, instinctively even, enclosed the possibility of that to be true. The very great thing about this though, the show manages to creates this brim of articulate connections, from the facts that are not known, or left to be obscured to us but is slightly told throughout the series (like Kiss-shot's past from 400 years ago when she became a new god there), and the very obvious ones consisting of Araragi's interactions with all characters, basically, his entire adolescence as a whole. \\n\\n\r\nSince spoiling here is imminent and almost inevitable if I were to lay out bare the great level of  intricacy structure of the display of the connections, I'll just left some part of the show's revelation left untouched, lest you're already spoiled by some reviewers here, in which I will not be doing. \\n\\n\r\nAll in all, the greatness of the music production and its great segue for each scene never made me questioned the inappropriateness of the director's selections, the extraneous scenes and playful background movement amidst the dialogue always makes it alot more bearable, but in this case, very entertaining to both appreciating the dialogue, the voice acting, and the visuals. Never had I got bored watching the intensive hour of the first episode, Mayoi Hell, the second episode, Hitagi rendezvous, the third episode, Ougi Dark; all thanks to the great production of music and such, that the director and the staffs gave in each episodes. The revelation, or the main plot that builds itself since and of the entire monogatari series, had ended with a very good and meaningful plot twist (a plot twist for you if you're not Gaen Izuko lmao) that left me with a feeling of awe, an elated one. It's very rare for an anime, or even a story, that had solely rely its dialogue, to move the plot forward to be this fun to watch. The simplicity of a fighting show, harem show or any other story hold no chance against this piece of work that we called, the monogatari series. That maybe an exaggeration, but I have yet to see any show that wrapped the entirety of its show as good as this.  \\n\\n\r\nThe disturbing scenes that encroached the norms of our century, the pedophilia like interactions or thoughts, the incest, the first ever scene of someone getting aroused from having their teeth being brushed by another person, the perversion, all of it are not a complete representation of what the show has to offers.  As far as it stands, it don't negates the intellectualism that the dialogues has which includes many of the fundamental core message or purpose of a life lessons, the wisdom, the perspective, idealism or convictions crashing with another person's, and so forth. And ofc, not all dialogue from this show are that serious all the time, most of the time though, they are relevant to honing Araragi's character and of the other ones (like Kaiki for instance). \\n\r\nThat being said, this anime is prolly one of the best anime out there yet, and the most unique amongst all, and it's a must watch if you haven't finish watching the show yet. \\n",
            "date": "2017-08-21T07:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 255946,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=255946"
        },
        {
            "content": "Look, if youv'e gotten this far in the series, you're not gonna be reading reviews to check if you should finish. This review is for people who are wondering if this is a series that will be worth investing in, or for those who just finished the first one or two series and are thinking \"...is this worth it?\"\r\nThis is a review of Monogatari. The great, sleazy, sprawling empire of Monogatari. With much love and in keeping with the style of the show itself, I'll make sure it's a disorganized disaster area.\r\nIt's been a while since I wrote a review, but MONOGATARI IS OVER andthe sentimental poeticism of that fact spurred me to fill out these heinous numerical scores once more. Of course, Monogatari isn't really over. We'll no doubt soon be facing down Owariszokumudamonogatari or whatever 354,653th side story/spinoff pops up to fill the void left in many a loyal fan's heart. However, the main story is done, there's no doubting that, and that's good enough for me. I'm out. I can't take any more. I managed to make it to the end of this season pretty much just by riding the rocketship of nostalgia. Good god, how many sloppy cgi slideshows must we endure? For this loyal fan, the magic is over.\\n\\n\r\nWhich, I suppose, means the series worked.\\n\\n\r\nI mean seriously, when I first started watching this behemoth epic many moons ago I was just a dumb college freshman (or something close) and I fell in, hook line and sinker. The convoluted problems of Araragi and his friends ranged from life-changing to so cryptic that I was forced to fall back on that most shameful of actions, looking up essays written by other more experienced critics in order to understand what the f**k I had just watched. I was mesmerized by Hitagi (heh) and her callous glamor, Hanekawa and her poisonous external perfectionism, Nadeko and her disturbing emptiness, and of course Araragi and his flaky, self-deprecating, morally-questionable, creepy, dense thought process. The show was magic. Broken, messy, and inexplicably relatable, Monogatari was an emotionally-poignant series of truths I wouldv'e had trouble coming to alone. It felt like a respite from a mad world of superficiality, a beacon of integrity that actually tried to be real. Sure, it was often gross and off-topic, but that only served to make it feel more legitimate. I remember my youthful head-over-heels fanboy self writing that \"Monogatari, unlike any other work of fiction, understands the tumultuous chaos of daily living. This show's true apparition is life itself.\"\\n\\n\r\nLook, I know half of you hate this franchise. I've heard it been denounced as pandering bilge, try-hard philosophy for middle-schoolers, cash-grab pornography, and self-indulgent holier-than-though psychology more dated than Freud. And I'm not really gonna defend it: it's got all of those elements in it. The Monogatari Franchise is one massive experiment in everything, and as is charachteristic of experiments, things often go horribly awry. But, somehow, after wading through all of the literal human feces (*cough*cough* Tsukimonogatari) we've reached the conclusion to that experiment, and have found ourselves with a truly excessive coming-of-age story or something. And, it turns out, what made the franchise work or not wasn't any of its own merits: it was what the viewer brought to the table. \"I am imperfect\" is a fact I acknowledge readily. \"I want to do better\" is another. \"I can recognize some of my most detrimental flaws, but even then I have difficulty figuring out how to address them, and these are such difficult and personal concerns that I don't really know how to foist them onto someone else\" is one as well. When I started this series, I was looking for answers. Answers about my own habits and traits, answers about how other people's minds might work, answers regarding that slow-burning yet indestructible anxiety that perpetually lives in the back of my mind. Monogatari was willing to listen, to offer advice, to never try to hand anything ut on a platter: its coded images and style and writing made me work to figure out what it was trying to tell me, and through that allowed me to figure out for myself the thoughts I was missing. And that was magical.\\n\\n\r\nAnd now we've reached the end.\\n\\n\r\nNow it's just a story. It's not the embodiment of life or a tried-and-true philosophical 5-course meal. It's an often-frustrating story about a bunch of great characters with sometimes-brilliant, sometimes-infuriating presentation. That was was struck me most watching this final season: everything I fell in love with was still there, but I had grown past it. That doesn't mean it wasn't satisfying as all hell to watch all these long-struggling plot threads reach something resembling a resolutions, or that I wasn't secretly praying that they'd play the world-renowned masterpiece Kimi no Shiranai Monogatari just ONE MORE TIME (even though the whole point is that we've grown way past that song's message). By all metrics (asides from, perhaps, visual creativity) this season was just as good as any of the previous ones and more. It's just... well... Monogatari finally caught up to itself.\\n\\n\r\nIt doesn't feel confusing or convoluted anymore.\\n\\n\r\nI no longer begrudge its antagonists or condemn its flawed characters.\\n\\n\r\nI no longer feel as though its winding labyrinth is something I can get lost in.\\n\\n\r\nSo I guess...\\n\\n\r\nSHOULD YOU WATCH THIS BIG, HORRIBLE THING KNOWN AS MONOGATARI?\\n\\n\r\nHere I sit, many years after beginning the epic franchise, and I am aware, even now, that though I may not often reminisce upon the passion this winding saga once drew from me, that is merely because I have channeled that passion into other places. But, more importantly, the reason I have become the person I am today (aka a functioning, employed, yet dreaming and ambitious member of society) is in part thanks to this series. Is that enough for you? It depends on who you are, and who you want to be.\\n\\n\r\nAre you imperfect?\\n\\n\r\nDo you want to better?\\n\\n\r\nAre you humble enough to put a little bit of faith into one of those trashy anime things?\\n\\n\r\nMonogatari is a mess, but it also genuinely cares about you. If you want to condemn it, it's easy. It's got a bunch of issues. That's why I'm not even discussing all that animation/plot/sound nonsense. We're past that. As sappy as it sounds, if you open your heart to it it will open its heart to you. It will challenge you and laugh with you and care with you. It will pull out your passion and give it to you to hold. \"Do with this what you wish\" it will say, expecting no loyalty in return. And, as its final gift, it will bring you to the finale with a knowing smile on your face, knowing that you care about all these lovable idiot characters, but most of all that you care about yourself. \\n\\n\r\nOr maybe it wont. Maybe you'll just think it's dumb.\\n\\n\r\nOnly one way to find out.",
            "date": "2017-09-28T19:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 259030,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489477.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ChristopherKClaw",
                "username": "ChristopherKClaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=259030"
        },
        {
            "content": "Amazing.\r\nThey did it.\r\nNisio and Shaft managed to give a proper ending to a series in which one misstep could bring forth its doom.\r\nAs I wasn't particularly a fan of Tsuki (in this case, just some aspects of it, as I enjoyed it overall) Koyomi and the first part of Owarimonogatari, I was genuinely mindful that this could end as a screw up, even if I had all my hopes up for it.\r\nThe recurring problem with the Monogatari series, in my view, comes precisely from its \r\nstrength. The  obvious enemy of a good series that focuses on delivering its story by a lot of dialogueis the lack of something worthwhile to say. Many times, it relied way too much on repetitive overexpository dialogue of things the viewer had already understood like they were retarded or something, way too much uninteresting idle chatter (this can come off as subjective, but the casual plot unrelated chit chat of the series kinda died for me after Second Season) and, yes, stupid fan service.\\n\\n\r\nI don't think it is the case that Shaft's producers noticed that. Even though it's still a frequent complaint by (western, at least) fans of the series, the general acclaim each new season usually receives implies that they are still doing something right.\\n\\n\r\nHowever, maybe it's the fact that this season lacked virtually all of the flaws I listed before that made it so special and and ending fitting of the sprawling story of Monogatari, together with the excellent plot.\\n\\n\r\nInstead of spending overtime with meaningless froth and silly fan service, they focused on interesting conversations concerning the story, its character and the development of both, which this series conveyed in a way that, honestly, is only comparable with Season Season, and even then I couldn't say which of them had the most interesting and important character developments of the series. All episodes and all moments were importants before finally leading to the conclusion of the first Monogatari \"mega arc\" comprising all the tales told until that moment, and how Araragi's future was and would be affected by it.\\n\\n\r\nMy inspiration to write this has just extinguished right now, but I am just glad that, in the end, this series didn't disappoint me. It's way to easy to end predictively or coarsely whenever a story sprawls to the point when some of its parts may be better if forsaken from the whole, but at the same time refreshing when a series prove your worries wrong and lets you out of it with a smile on your face. \\n\\n\r\nI could not ask for a better sense of closure.\\n\\n\r\nIt was all worth it. Thank you.",
            "date": "2017-08-23T13:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 256110,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154035.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rapo1",
                "username": "rapo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=256110"
        },
        {
            "content": "The second season of Owarimonogatari was the perfect way to end the main story line of the series. Comprising of three arcs, the first two serve as mostly set up material for the last arc to have a lasting impact on the audience.\r\nThe art and animation is in the signature style you would come to expect from Studio Shaft. The use of the soundtrack is sparse or just serves as a backdrop to the show, except for a few moments where it's use in conjunction with an important scene. Out of all the seasons/movies of the Monogatari series, I enjoyed this particular one the most.Hopefully you will have a similar experience as well.",
            "date": "2017-08-15T09:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 255509,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=255509"
        },
        {
            "content": "Owarimonogatari 2nd Season is one of those animes that have everything you will like.\r\nStory: the story in this season is one of the best in all of monogatari series.\r\nArt: the art is outstanding as ever and each scene have a lot of meaning as always and every scene have a lot of detail.\r\nSound: the sound is good as always every voice actor gives the feeling of what their character are thinking and feeling.\r\nCharacter: in this season you will see a lot of character development for Araragi and Ougi and also it shows you the deep bond between Araragi and Hitagi and also his bond withShinobu.\\n\r\nEnjoyment: 10/10 for me after all this monogatari series is the best of the best in anime industry and I 100% recommend you to watch this season and to read the light novels.",
            "date": "2019-04-01T16:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 305198,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MigthyDoom",
                "username": "MigthyDoom"
            },
            "url": "https://myanimelist.net/reviews.php?id=305198"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’m not much of a driver myself.\r\nI have a license, and I know how to drive, but I much prefer using my own two legs for some nice exercise or Uber for a new-age taxi. As such, whether my destination is the grocery store or the nearby local mall, a car rarely enters the equation for me.\r\nSooner or later, self-driving cars will take over the road, and I will not have to even think about driving whatsoever (since the vehicle will do everything anyway). Owarimonogatari 2nd Season also drives itself, too. Neither towards groceries norknickknacks but rather towards storied anime success.\\n\\n\r\nSTORY\\n\\n\r\nThe first Owarimonogatari season stands as one of the best entries in the entire series, what with its higher emphasis on a spooky new character, its symmetrical leanings, and its strong themes. So, with the sequel now upon the masses, how does the continuation carry the torch?\\n\\n\r\nTo get everything aflame, the anime moves forward with its usual approach of distinct arcs within a single run. Three in total create this sprint: Mayoi Hell (two episodes), Hitagi Rendezvous (two episodes), and Ougi Dark (three episodes). Mayoi Hell finds Araragi literally dead and alongside Hachikuji once again. Hitagi Rendezvous is less formal than the wording suggests insofar as Araragi meets up with Senjougahara for a much-needed date. Ougi Dark brings Gaen and the gang together to talk about the mysterious Ougi Oshino herself.\\n\\n\r\nWhere the latest-released installment before this one (Koyomimonogatari) took a brief pitstop for an extra dosage of fun, these next few arcs get back on the plot track. Not to say that they ditch the silliness outright, though. For example, Mayoi Hell serves the narrative purpose of stripping Araragi of a key feature of his but also gives the audience one of the best Hachikuji “I fwubbed!” performances ever. Hitagi Rendezvous progresses the relationship between the crab and the pervert one more step while also providing the saucy quips from Senjougahara that have been absent for far too long. And Ougi Dark reveals the actual identity of Ougi and makes Ononoki succumb to the lighthearted-yet-unfortunate end of Tsukihi’s and Shinobu’s handling.\\n\\n\r\nIn other words, Owarimonogatari 2nd Season remains just as similar to the rest of its family in its structure and direction. The same applies for its thematic roots, too. This time, the anime discusses what it means to do the right thing versus the right thing.\\n\\n\r\nIt pops up in each arc with Araragi in some manner. He helps Hachikuji when he possibly shouldn’t. He competes with Senjougahara in a romantic rivalry. He goes above and beyond for Ougi. Moreover, the show challenges the concept of “right” itself, forcing Araragi to think about this word given who he is, what he is doing, and why he is worrying about it in the first place. While not the most profound setup imaginable, this theme still allows for that thoughtful edge that the series keeps tucked away behind the mystery and the comedy it regularly touts.\\n\\n\r\nNot everything goes right, though. Truth be told, the actual events and plot in general do not have as much weight or as much engagement when compared to the past. A particularly built-up moment involving a certain someone comes to mind when it comes and goes without a whole lot of fanfare befitting the moment.\\n\\n\r\nNevertheless, Owarimonogatari 2nd Season remains a solid “conclusion” to this series. Witty wordplay, cultural knowledge, cool ideologies, interesting twists. That is to say, it’s tough to hate on such a robust story.\\n\\n\r\nART & ANIMATION\\n\\n\r\nNot much else can be said about the visuals within Owarimonogatari 2nd Season that hasn’t been said already.\\n\\n\r\nThis far into the series, the show has its visual direction and signature flair basically down to a science. Tons of different styles, colors, shapes, perspectives, and cuts. Fun and personality-filled character designs of both an old and new nature. Quick scenes of high-quality animation. Head tilts. It’s all there once again to stare at and appreciate in all its splendor.\\n\\n\r\nSome shout-outs are still in order, though. The callbacks to the “scraggly” style of the opening and ending tracks as Araragi traverses the underworld with Hachikuji were a nice touch.\\n\\n\r\nPlus, the fact that Ougi delivers a bunch of metaphors within Araragi’s dream by using the known constellations as a replacement for the planetarium he and Senjougahara slept through made for a neat moment, too.\\n\\n\r\nAnd showcasing a game of cricket (with cake and tea time to boot) to keep stimuli high during a long-winded explanation also deserves recognition for, as always, refusing to let the conversations stagnate on a cinematic level.\\n\\n\r\nIn short, “if it ain’t broke, don’t fix it.”\\n\\n\r\nCHARACTERS\\n\\n\r\nThis series has almost always been home to a wide range of characters. Some seasons will contain a large handful to choose from, and some seasons will instead keep the focus on just one person in particular. For Owarimonogatari 2nd Season, it goes mostly with the latter, giving nearly all the attention to Araragi.\\n\\n\r\nNot to dismiss them outright, the supporting cast do have their opportunities throughout this specific season, too. Hachikuji earns herself a much more fitting, much more deified position despite her stature and her snail-driven background. Senjougahara gets “put in her place” per se as she learns to lose like a champ. And Ougi becomes humanized after his ending goes down a different route than even he could have predicted (and, in the process, revealing his official gender if the previous pronouns have not done so already).\\n\\n\r\nYet Owarimonogatari 2nd Season, much like the first season which predates it, puts Araragi in that limelight. For a show which prioritizes (for the most part) everybody else but him, this infrequent look into the main protagonist turns into a special occasion of sorts.\\n\\n\r\nAraragi has pretty much been a man of questionable morals yet an honorable guy who cares deeply for the people close to him. However, he brings up several of the significant events which have affected him over the course of this myriad set of tales, signaling how he understands that this bizarre journey of his has impacted his life in ways unforeseen. The audience thinks about his progress in turn. What has improved for him, how his failures have shaped his course.\\n\\n\r\nHe’s clearly been through a lot, and this season adds to this fact. His conversations with Hachikuji have him reflect on the choices he has made up to this point and whether he would perform the same ones again if given the chance. His date with Senjougahara has him growing closer to her with “vows” the two share together. And his final talk with Ougi has him looking inwards at himself about who he really happens to be.\\n\\n\r\nThese moments, combined with his imminent graduation from high school into college and therefore pre-adulthood, find Araragi overcoming his adolescence. He had naturally been moving towards maturity as he became studious once again in school and thought about others before himself these past several months. But, here in Owarimonogatari 2nd Season, a last solid push pushes him onto that side with nary a trouble.\\n\\n\r\nThis season has also reaffirms an idea arguably much more important and much more intriguing: that not everything about Araragi (or anyone for that matter) must be fixed or changed or redone.\\n\\n\r\nIn real life, mundane issues or traumatic happenings can drastically morph people, but this situation is not always the case. Just because someone comes upon a new perspective does not mean that his or her entire personality flips or that he or she undergoes a physical transformation. Often, they remain mostly the same yet gain a newfound idea, outlook, or lesson that will be carried with them indefinitely.\\n\\n\r\nThe same applies for characters in anime, and Araragi here in this season of the franchise represents a prime example. His maturity does not equate to him ditching his old self. Rather, he realizes that he can still be who he has always been – a vampire who cannot help but help others – while simultaneously increasing his position in life by absorbing the experiences he faces.\\n\\n\r\nSo, yes, Araragi does not “develop” writing-wise to any grand extent. But, because of his dedication to maintain both his past and his future, he finishes up this season as a strong contender for the fact that a character does not need to necessarily change to have a meaningful purpose in the story told.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\n(Note: The second OP for Owarimonogatari 2nd Season, “dreamy date drive”, did not air as part of the televised broadcast. Because this review analyzes that version and not the BD version, said song will not be included in this deliberation. However, personally speaking, I do like the dreamy vibe and the POV visuals of the track. It’s a fitting piece for the romantic bond between Senjougahara and Araragi.)\\n\\n\r\nMuch like its artistic brethren, the audio decisions within Owarimonogatari 2nd Season can speak and play for themselves. Impressive voice-acting performances which make the characters feel alive. The same strong, ambient original soundtrack. A multitude of sound-design elements for added flair. What’s tried-and-true remains so in this season without a doubt.\\n\\n\r\nThe only major differences are (perhaps obviously) the new opening tracks and the new ending track.\\n\\n\r\nThe first OP, titled “terminal terminal”, channels Hachikuji’s cuteness in song form. It blends together many instruments – piano keys, castanets, bells, trumpets, acoustic guitar, chimes – for a happy, fun foundation, and her vocals throughout (especially on the timing of the distinct triplet of notes at certain points) give it the adorable charm which follows the lovable snail around. Its tone somewhat contrasts with the story arc which it precedes, but that provides it even more staying power when watching the show.\\n\\n\r\nThe second OP, titled “dark cherry mystery”, combines hip-hop beats and string segments to get at a mellow-yet-charged track to helm the way for the finale of the season. The snapping and clapping in the background give the song a smoother feel, and the perceived repetition in the vocal delivery has a hypnotizing effect to it while listening. Both sides complement the harsher sounds of the record scratching, the drowned-out instruments, and the fluttering sound-effects. It isn’t as nuanced of a song as the other OP, and it isn’t as interesting either, but it still has a nice place within Owarimonogatari 2nd Season.\\n\\n\r\nAs for the ED, titled “SHIORI”, its piano melodies, grander sound, and multiple vocalists create an airy, heartfelt closing for this iteration of the anime. It’s a pretty song, so it has a feelgood vibe, but it doesn’t quite leave as much of an impression as its counterparts.\\n\\n\r\nAltogether, this season hardly falters in terms of its audio, and its OP-ED offerings, while not the most memorable, still stand as strong additions to the already huge number of specialized tracks available from this long-standing franchise.\\n\\n\r\nENJOYMENT\\n\\n\r\nOnce again, this project reels me in and has me liking most of what it dishes out.\\n\\n\r\nIt was extremely nice to have Senjougahara back into the fold, and so her whole arc ended up being the most fun for me. The teasing. The reactions. The silliness. The kindness. The romance. It was a pure treat to hear her and see her have some deserved focus once again.\\n\\n\r\nHachikuji, Tsukihi, and Ononoki were hilarious per usual as well, and seeing Shinobu in her adult form made for quite the spectacle. Ougi’s asides kept me captivated, too, which is often the point. And I even appreciated Hanekawa’s small appearance near the last several minutes since she is one of my favorites from the anime overall.\\n\\n\r\nCompared to the first season, key differences stir up my personal attachment. The lack of any new characters was unfortunate, but Ougi finally losing per se provided some satisfying comeuppance. Gaen still gets on my nerves, but she wasn’t as annoying this time around. And each arc did not reach the same level of critical analysis to indulge in, but they came off as consistently entertaining rather than rising and falling throughout. So, like last time, while I cannot say I adore this sequel, it has its merits for sure.\\n\\n\r\nI will have a bone to pick with the series sooner rather than later, should it choose not to conclusively end (after all, this season is translated literally as “End Story”). But that’ll be a discussion for another day. For now, the series stamps in yet another positive experience in its record books.\\n\\n\r\nOwarimonogatari 2nd Season makes for a super-swell follow-up within this famous franchise. The artistry and the music keep the same signature structure (and rightfully so), leading to refined production values. The story content also remains familiar and thematic even if the plot itself is not quite as engaging as usual. And the returned focus on Araragi, with the smattering of supporting cast members here and there, leads to a neat finish for his arc. The total package isn’t the best that the series has to offer, but it certainly drives home the fact that its juggernaut status is just as deserved as always.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, despite the passable narrative moments, themes on doing the right thing take hold as the mystery, the comedy, and the dialogue within each worthwhile arc keep a similar stance as others in the family\\n\\n\r\nArt & Animation: Great, “if it ain’t broke, don’t fix it”\\n\\n\r\nCharacters: Good, Araragi demonstrates that a character does not require “development” to be meaningful\\n\\n\r\nMusic & Sound: Good, the same impressive audio design is welcomed back, and the new OP-ED offerings, while not too memorable, have their place\\n\\n\r\nEnjoyment: Good, consistently entertaining even if not the most stellar entry in the series\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-11-13T21:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 294022,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=294022"
        },
        {
            "content": "It has been 5 years since I watched gigguk's review on bake/nisemonogatari which ultimately got me into the monogatari series. I liked this series a lot when I first watched it as a newcomer to anime. Now, after rewatching the entire series, I have come to love it. These 3 final arcs are truly the end to the end, the \"owari\" to the \"owari\" to a beautifully written \"monogatari\". \r\nI am proud to say that all mysteries are uncovered, no holes are left unfilled and they wrap up the franchise perfectly with a little bow. It gives that uplifting feeling that everything is over, allthe struggles and conflicts the watcher (myself) faced with Araragi and co in his final year of high school is all over. Yet, I feel like I will miss the feeling, the moments, and memories because not all was bad in Araragi's trek to \"ending his adolescence\". For example, he met, probably, the BEST HAREM IN ALL OF ANIME, with him sitting on top of the throne. Along with it comes highlights of memes/fanservice that is hilariously entertaining and creates moments that I will forever search back on youtube. \\n\\n\r\n**RAMBLING START**\\n\\n\r\nIn the end, from saving other people he has learned to save himself. Araragi (my boy), Oshino Meme (my dude), Hanekawa (i loved how multidimensional her character was [in more ways than one ( ͡° ͜ʖ ͡°)]), Senjougahara (Undisputed best girl), Mayoi (i need this loli in my life), Nadeko (despite the hate, her story was probably the most interesting), Kanbaru (where can i buy a kouhai like her), Karen and tsukihi (i loved every moment they were on screen), Ononoki (yeah peace peace!), Sodachi (I wish you had more screen time), and OF COURSE MY FAVOURITE CHARACTER IN ALL OF MONOGATARI:\\n\\n\r\nSHINOBU OSHINO aka Kiss-shot-acerola-orion-heart-under-blade-chan.\\n\r\nI love you so much, everything you have been through to get to where you are this point, I give the utmost respect you fucking 500 year old loli.\\n\\n\r\n**RAMBLING END**\\n\\n\r\nThank you so much Monogatari, thank you so much Nisio Isin, thank you so much ANIME.\\n\\n\r\nI may have rambled and stuttered (kamimashita!) but it wasn't on purpose because I'm literally in tears as I see the credits roll down. This was a hell of a ride and I'm truly glad I gave this series a chance!",
            "date": "2017-09-13T21:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 257470,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3345341.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/morekawaiipls",
                "username": "morekawaiipls"
            },
            "url": "https://myanimelist.net/reviews.php?id=257470"
        },
        {
            "content": "Owarimonogatari 2nd Season was perfectly created, I hardly can point out problems with this season and adaption. Nearly every scenes creates a tense atmosphere making the viewers iterate their thoughts what will the characters do, what Araragi will do. Apart from assaulting Hachijuki.\r\nStory:\r\nI personally thought the story was well made, it has mix of emotions teach parts of the story which constantly manages to keep the viewers interested. The further you go through the episodes, more the excitement grows. We all want to know who Ougi is, we all want to see what Araragi wants or does. That's why the story is perfection. \r\nArt:\r\nI can'treally say much about the art, through out the Monogatari Series all the arts and designs are interesting and well created. The scenes are hilarious and made well creating plenty of humour and awe for the viewers. \\n\\n\r\nSound:\\n\r\nOne of the best thing Monogatari Series can have pride on is their soundtracks and OST. How they blend with the story perfectly. The OST is placed perfectly without interfering the story rather enhancing it instead. You can never get enough of Mayoi's stutters. The OP created were amazing as usual as well as the ENDING by ClariS; the versatile duo. Shiroi (Ending) was a suitable choice as it's really beautiful to hear. \\n\\n\r\nCharacter:\\n\r\nI kinda do miss Ononoki's old phrases, she's funny as usual alongside Mayoi. They really were hilarious during the serious talks, but that's what makes the series interesting, where the characters do something humorous. Furthermore, we got saw different emotions especially how Ougi feels about the situation and Araragi's thought thoughts through out the show, his characteristics in important scenes really shows he is one of the best characters in the anime history. But what really made me full of joy was seeing old characters return throughout the story including mentions and arrivals. \\n\\n\r\nEnjoyment:\\n\r\nThere was plenty of enjoyment seeing old characters, hilarious sub scenes and plenty of emotional scenes. I wouldn't really call it a rollercoaster of emotions but it has the usual Monogatari Series enjoyment but the finisher to this adaption was perfect. \\n\\n\r\nOverall, I would recommend people to start watching already since this special is well developed. I am sure Arararagi-kun will be proud of you. I meant Bararagi-kun. Sorry I stuttered.",
            "date": "2017-08-14T10:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 255438,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4695884.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Samig-Senpai",
                "username": "Samig-Senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=255438"
        },
        {
            "content": "Owarimonogatar Season 2 clearly solved all the problems and questions we always had throughout the series. We could say this is the end(but not technically). I really enjoyed watching this and was totally immersed during the whole 3 episodes. Not to mention in light novel as well.\r\nThe story, as I mentioned before, it answers all the questions we had before. For example, \"why is Hachikuji here again\", \"where did Meme and Kagenui go\", \"why did Gaen kill Koyomi\", \"who and what tf is Ougi plotting.\" All these little questions are solved in this story. It was also outstanding of Nisio Ishin answering each question oneby one through the show and gratifying viewers slowly.\\n\\n\r\nThe second arc which is Hitagi Rendezvous showed a good rapport between Senjougahara and Araragi. We didn't get much opportunity to see them being together in recent stories so I believe it was a good time to show this. Lastly, the post credit scene I should say it was amazing. The gloomy theme and Ougi leaving some fishy lines were matched well. That made me eagerly want to see what's going to happen next. Bringing up this much excitement was well done.\\n\\n\r\nIn Ougi Dark episode, everything happens is big spoilers but I'll try my best to not spoil a lot. I liked when Gaen was about to disclose the truth of Ougi, the scene immediately changed. I was rather disappointed here, but then again, they used this method to keep me immersed. I also liked how all these little clues from previous stories (Araragi's sense of guilt, Shinobu eating Seishirou) made Ougi. I did not expect anything like those to be a big part of this story.\\n\\n\r\nAraragi appeared again with this 'sudden change of mind to save that person'. He did it to Hachikuji (which was great) and he did it again to Ougi. I guess that really isn't changeable for Araragi; However, I like that heroic side of him.\\n\\n\r\nHachikuji's comeback was truly amazing and loved the conversation with Arararagi. Also, I was quite surprised that a snail is superior to snakes. Didn't really make sense for me but okay. Hanekawa did a great job and not to mention Meme as well. I saw myself automatically smiling when Meme came in with his catchphrase. No wonder why he's my favourite member from Araragi Harem. He always resolves big conflicts or problems happening to most characters. I felt bad for Gaen but at the same time, it was funny because nothing really worked out for her in this story.\\n\\n\r\nI should say this is the best and also my favourite story from entire Monogatari series. It was the most enjoyable story in the entire series. I strongly recommend watching all the Monogatari series to who haven't watched yet. \\n\\n\r\nOverall, I will give this a 10/10.\\n\\n\\n\\n\\n\\n",
            "date": "2017-08-13T15:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 255377,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6364271.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JhSung",
                "username": "JhSung"
            },
            "url": "https://myanimelist.net/reviews.php?id=255377"
        },
        {
            "content": "*THE RATINGS FOR THIS ARE SPECIFIC TO THE PART, BUT THE REVIEW IS FOR THE OVERALL SERIES*\r\n[STORY: 10/10]\r\nThe Monogatiri series comes together well to create a masterpiece of a story. This show is much deeper than alot of people think. It is filled to the brim with philosophical arguments and great storytelling. The focus isn't mainly on action, though it does have some visually stunning action scenes. Alot of the time, it will just be conversations between characters, but this is the blood that keeps this series alive and flourishing. Without it, you'd have a normal show with above average production. This type of showisn't for everyone, but I personally love it.\\n\\n\r\n[ART: 10/10]\\n\r\nThe animators went all out animating this show, as detail and flamboyance embody the artistic direction of this show. Each character's design and set piece is carefully planned out, and it shows. \\n\\n\r\n[SOUND: 10/10]\\n\r\nThe voice actors become their characters when they act them out, that's how into them they get. They really care about their role, you can tell. And sound effects are well done as well, nothing seems off in that department.\\n\\n\r\n[CHARACTER: 10/10]\\n\r\nMost every character is important to the main plot of the story and if they aren't a main character, the style of the show makes it seem as if they don't even exist. Whether they be designed as set pieces or outlines, the show really puts emphasis on those we really care about. These characters are no joke either, pretty much none of them are one-dimensional wastes of time, which is very appeciated.\\n\\n\r\n[ENJOYMENT/OVERALL: 10/10]\\n\r\nThough some parts of the series are better than others, the series as a whole is truly an amazing body of work that I consider a masterpiece. This story is filled to the brim with beautifully crafted characters, artwork, sound design, and an amazing story that philosophically challenges the observer to think. A masterful work by Isin Nisio.",
            "date": "2018-04-03T04:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 276648,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6971623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/godofmankind",
                "username": "godofmankind"
            },
            "url": "https://myanimelist.net/reviews.php?id=276648"
        }
    ],
    [
        {
            "content": "Have it ever happened to you that everyone seems to like, I don't know, something to eat, and then you try it but it tastes horrible but you kept wondering \"why does people like it?\", and then you try it again in a different moment and context and suddenly it is exquisite? Well, this pretty much happened to my with the Monogatari series. Yes, I am going to write here more about the franchise that about this particular season. \r\nI am not going to talk about many of the virtues and the flaws that have been stated in the apparently irreconcilable fight between those thatlove this anime and those that hate it. I just wanna say, to those that want to enjoy a show and understand it's relevance in the anime community but seem kinda lost in the debate between fanboys and haters, that this show is practically for everyone but not for every moment or context. And it is an advice that can apply to any serie actually. I don't know what weird subconscious cognitive stuff is behind it, but if you watch the show (hopefully in the broadcasting order -starting with Bakemonogatari-) and don't like it at first, please don't force yourself! If you do you will end up hating it and complaining about the \"weird fan service\", the \"cheap animation\" or the \"word porn\" (to use some misleading terms I have read in many negative reviews). I mean, It may be cool to say \"this is crap\", and accuse anyone that likes te show to be a weirdo, but come on! I personally want to experience the same emotion and enjoyment that others seem to live. It's true, sometimes it is not possible because the anime is just bad (like who knows, Mars of Destruction), but this is not the case with many animes and it is definitely not the case with the Monogatari series. \\n\\n\r\nSo, if you want to enjoy this franchise, just prepare yourself for something different! I can promise you that if you approach this anime when you fill like it and being opened minded, you will discover a very interesting and intriguing story, a lot of characters with great developments and excellent interactions and in my opinion a masterpiece concerning art and music. In the end, a truly enjoyable experience...\\n\\n\r\nObjectively, I would give to Owarimonogatari a 9... but because it represents the series that made me realize that my subconscious and other things may trick me sometimes and stop me from enjoying a truly wonderful show, well, here is the 10!\\n\\n\r\nHope this was useful!\\n",
            "date": "2017-09-16T01:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 257644,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5778670.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dafrav",
                "username": "Dafrav"
            },
            "url": "https://myanimelist.net/reviews.php?id=257644"
        },
        {
            "content": "#3. Review for Owarimonogatari Second Season. It will contain spoilers which will be noted beforehand.\r\nEpisodes Seen: 7/7\r\nOwarimonogatari S2 is the pure definition of what a masterpiece should have to give us the perfect conclusion to a perfect series.\r\nOwarimonogatari S2, or by its translated name: “End Story”; is the ending of the Final Season of the Monogatari series, an adaptation of the third volume of the Owarimonogatari novel that finishes the main storyline, placed chronologically after the events of Koyomimonogatari.\r\nIf you are here, that means that you have already seen the whole series starting from Bakemonogatari, otherwise this review may ruin the experience as itwill contain (for obvious reasons) a lot of spoilers.\\n\\n\r\nRemember, Owarimonogatari Second Season is placed after Kizumonogatari and before Zoku Owarimonogatari when it comes to the aired watching order.\\n\\n\r\nStory: 10/10\\n\\n\r\n(HUGE SPOILERS HERE) \\n\\n\r\nIf you have watched any Monogatari anime, you should know that they’re mainly divided by short arcs presenting most of the times stories that aren’t placed chronologically or simply sometimes there’s no direct correlation to the arcs within the same anime adaptation. \\n\\n\r\nOwarimonogatari S2 follows the story of our good guy Araragi Koyomi, who, after his death on the events of Koyomimonogatari wakes up in a strange but lovely place: hell. Here we see our lovely and cute Hachikuji Mayoi, who disappeared (or died) a long time ago, saving our main and giving him the right steps to get away from hell.\\n\\n\r\n(END OF SPOILERS HERE)\\n\\n\r\nI’m not going to get deep into the other arcs and the meaning behind and explanation and stuff due to many reviews here already said that and you should go check some of them and check the synopsis as well. What you should know about this anime’s story is that is perfectly well-written and Ougi Dark, the last arc of this season is a completely beasty-masterpiece in all ways you want to see it, and I didn’t really find a better way to finish an amazing series rather than this.\\n\\n\r\nArt: 10/10\\n\\n\r\nWell, SHAFT is particularly known for its surreal and kind of strange animation and art style, then, Owarimonogatari S2 doesn’t really provides us with anything new we haven’t already seen on the previous series (except for Kizumonogatari of course), the animation, art style and character’s design is awesome and perfectly executed as always has been. The best I can tell you here is to pay close attention to the art on Hitagi Rendezvous planetarium scene and Ougi Dark’s conclusion.\\n\\n\r\nSound: 9/10\\n\\n\r\nSame stuff as the art, it keeps being awesome and beautiful, the openings and the ending keep being catchy and wonderful. Soundtrack is damn well-made (keep track of the Hitagi Rendezvous arc’s music) and it feels like SHAFT is always improving with each year they make a new Monogatari adaptation. Thumbs up in here.\\n\\n\r\nCharacter: 10/10\\n\\n\r\n(SPOILERS HERE)\\n\r\nIt is really delightful how the Monogatari series makes a perfect character development through each single arc of every single anime. This is time for our loved Senjougahara Hitagi to show us how extremely cute she can be and how much she is into loving Araragi, and how she manages to gives us the most heartwarming scenes in the whole series. Then we also got Koyomi’s time to shine in what regards to character development together with Oshino Ougi in the final arc, as said before, I won’t be getting specific with every arc but it is really hard not to talk about one of the best episodes I’ve ever watched on an anime and that’s Ougi Dark arc. \\n\\n\r\nAlso we are presented with Ougi’s real being, and why she appears to be so strange and complex throughout the series, many questions answered in time and surely it won’t leave you indifferent.\\n\\n\r\n(SPOILERS END HERE)\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nI’m going to give it a ten because there’s no greater rating to give, enjoyment might be sometimes subjective, and as a huge fan of the Monogatari series is hard to say this is not enjoyable, it will be as simple as giving a huge lie.\\n\\n\r\nIt is also great to see how an “extensive anime” (of about a hundred episodes or so) never get to bore us. What I’d expect since I was watching Hanamonogatari was “hey, this series is great, but surely in further adaptations it’ll be consumed by some gross fan service or rushed ideas to keep the anime alive”, thanks god I was wrong.\\n\\n\r\nOverall: 10/10\\n\\n\r\nAn overall 10/10 for one of the best animes you can watch out there and one my personal favorites.\\n\\n\r\nIt has such an amazing way to tell, develop and finish an awesome story; perfect animation and background art combined with a subtle yet wonderful soundtrack; three main arcs that are really impressive and perfectly executed, with a huge and carefully written character development.\\n\r\nOwarimonogatari for me set a before and after in regards of enjoying anime. \\n\\n\r\nMy words may or may not go through you, but after watching this one, you surely won’t have any words to say about such an amazing masterpiece.\\n",
            "date": "2018-12-31T17:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 297625,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298762.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Thrinitar",
                "username": "Thrinitar"
            },
            "url": "https://myanimelist.net/reviews.php?id=297625"
        },
        {
            "content": "This is a review for the Monogatari Series as a whole and may contain some spoilers but none that will ruin the show for you.\r\nThis series is a masterpiece from beginning to end for me. So much so that I feel obliged and compelled to write this review to encourage anyone who has not yet seen this great piece of work to go view it. \r\nI learnt about this series when I first stumbled upon the infamous \"toothbrush scene\" on YouTube. My adolescent mind found that scene rather intriguing which was when I decided to embark on completing this series. Of course, when the firstscene of Bakemonogatari was the shot of Hanekawa's black underwear, my perverted mind instantly got hooked onto the series. However, what kept me here wasn't the fanservice but rather the very unique way in which this series delivers its narrative. \\n\\n\r\nThe series adopts a \"tell, not show\" method where for the most part, episodes were filled with dialogue and sudden flashes of frames usually of one colour and have words on it. The words sometimes describes the character's feelings and thoughts or the narrative. Sometimes, the words only read \"black scene\" or \"red scene\". This may seem like a rather weird and uninteresting way to tell a story for someone that hasn't watched the series. But it is exactly what makes the series such a great watch. The plot is almost always read out to you, with little emphasis on the animations. Once a character starts to talk, they can go on and on with never ending conversations and explanations. The visuals may shows you objects and places related to the conversation topic but sometimes, it shows you scenes that have absolutely nothing to do with the ongoing conversation like the surrounding area or Shaft's signature head tilt. And yet, the show still manages to remain interesting. It took me a while for me to understand why such a format worked out for this show. After all, anime in general places quite a lot of emphasis on the visuals, be it the character art or action scenes or setting. That was when it dawned upon me that perhaps Monogatari wasn't so lacking in visuals after all. I can still vividly remember the main character's house and toilet, I am also able to recall the school environment, the classrooms and the walkways. Because of the many scenes that show the scenery around the characters while they were busy rambling away, you get very familiar with the area. Together with that, the frames of words that pop up helps to set the mood. The colours of the frames induces certain emotions. Compile that together with the sound effects and you have yourself an amazing setting.\\n\\n\r\nAnother reason why this method of animation worked out was probably because of the source content. Monogatari was a story that is based on aberations or oddities. Protagonists are usually such oddities and they take the forms of animals, though sometimes there may human protagonists too. The source material itself is already intriguing by nature and because of that, there's enough content to sustain the audiences attention in the really long dialogues.                        \\n\\n\r\nThere is little lack of character development in this series. Because of the dialogue intensity, we often learn about the characters past and character through their conversations and the way they speak. There is also a huge variety of characters. Senjougahara for example, is a character that was introduced with a scene of her falling out of the sky. Then because of certain circumstances she had to silence the main character and did so by threatening to staple his mouth. Her character only gets more bizarre as the series progresses. But how sharp she can be with her tongue and how unpredictable she can be are only some of the many traits that make her such an amazing character to watch.  \\n\\n\r\nThe main character however, in my opinion, is not really a unique character. Araragi is your typical perverted high school student that likes tits and lolis. What sets Araragi apart is that he is a person that cannot ignore people in need and would throw away his life to save even a stranger he just met. It's not much of an exaggeration to say that this series was built upon this personality trait of his. What makes Araragi interesting however, is the characters that are around him. Because he is a rather plain character, when he is surrounded by unique and weird characters, it makes him stand out. Also, with that personality trait of his, it makes for some of the most fascinating storylines, especially considering that the events that he goes though are always life or death situations.\\n\\n\r\nWith arcs like Soadachi Lost, we get to look into the past of Araragi. With Bakemonogatari, we get the teenage romance we all wished we had. With the Trilogy movies of Kizumonogatari, we get action and fight scenes. With Owarimonogatari, we got a heartfelt and emotional ending to this ride. I personally consider Monogatari to be a complete mess, A huge variety of genres that were mashed together. But what came out of that mess was a series that was, in my honest opinion, an absolute masterpiece. If I had to criticise one thing about the series, It would be that the chronological order and the airing order is all over the place. But any confusions that I had were all resolved with this second season of Owarimongatari. So whoever you are that actually read through this whole review of mine and haven't watched the series, go do it. Now. \\n\\n\r\nP.S. Senjougahara Hitagi is best girl",
            "date": "2017-08-22T03:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 256008,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6325356.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DeliShad",
                "username": "DeliShad"
            },
            "url": "https://myanimelist.net/reviews.php?id=256008"
        },
        {
            "content": "(Note: This is more for the series as a whole than solely Owari season 2, but I do touch on some points)\r\nI've been making my way through the Monogatari series for a couple of months now and I've finally reached the end. At least, the end until Zoku Owarimonogatari comes out. When Bakemonogatari unexpectedly blew me away, I strapped myself in and prepared for the wild ride that I felt I was fully prepared for. There were moments that tested my faith, like both Nekomonogataris and Tsubasa Tiger, but I held strong and kept on watching. With each moment that tested my resolve in theseries, there were so many others that blew me away, like the Kizumonogatari movies, the rest of Monogatari SS, and Ougi Oshino and her story. Maybe Monogatari won't leave me as my #1 anime of all time, but it definitely ranks in the top 3, if not concluding as my favorite series of all time.\\n\\n\r\nOwarimonogatari S2, however, contains the brilliant conclusion to a fascinating series and set of characters. In a sort of irony that only Monogatari could pull off, the series comes full circle to conclude. It's impossible to describe how perfectly the ending was pulled off without spoilers, but suffice it to say that the story of Koyomi Araragi ends, as it began, with him going above and beyond for someone incredibly dear for him, a situation that he found himself in time and time again throughout the series. It's hard to say that Owarimonogatari S2 is something of an adrenaline pumping experience but that, I think, is what makes this series so special. It shrugs off adrenaline pumping action and achieves it instead with words and interactions. Sure, it may drag at times, but usually you find yourself having an epiphany over that seemingly irrelevant conversation, gaining insight into who Koyomi Araragi, or the latest girl he's helping out, is on the inside. It's incredible how deep and developed every single character is by the end of the series, despite many of the 'side characters' not having exuberant amounts of screen time. The dialogue simply builds their personalities so well that more episodes with them aren't necessary, no matter how much we wish there was more Kanbaru.\\n\\n\r\nI would recommend the Monogatari series to anyone, but especially anyone with an interest in character-driven stories and interaction-driven exposition. It is a unique anime experience to be sure. I had no idea how much I would come to enjoy the series, but I sure am glad that I started. In fact, I'm already planning to re-watch it in the future, with a different order. So what are you waiting for? It's time to watch Bakemonogatari already!",
            "date": "2018-05-01T18:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 279531,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6274462.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/CaninnTurtle",
                "username": "CaninnTurtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=279531"
        },
        {
            "content": "In order to fulfill a promise made to expert Izuko Gaen, a woman who claims to know everything, Araragi meets up with his lovely underclassman Suruga Kanbaru to mediate a meeting between Kanbaru and his Aunt Gaen. However, Araragi's plan quickly dwindles when the couple are attacked by a suit of sensitive armor that seeks to retrieve the sword of the Kokorowatari demon who bowed to Araragi's vampire companion Shinobu 400 years ago.\r\nAfter the three fantastic and unique bows seen in Owarimonogatari Part 1, the final arc of the 6-episode Shinobu Mail returns to a more traditional Monogatari feel while maintaining the same high-quality qualitythat we expect from the franchise, although it still has some of the same small flaws .\\n\\n\r\nTo get off a bit of a tangent before getting into the late meat of Owarimonogatari, I just want to quickly touch the chronology of the Monogatari franchise and how it has become a mess. This is my second time watching Owarimonogatari, but when I hit the first episode 1 of Shinobu Mail, I was confused as hell about the time when the episode was actually taking place. None of the second season bows on are chronological and it soon becomes difficult to really know where you stand on the timeline in any episode. Although the first episode of Shinobu Mail briefly recaptures the events of Shinobu Time (also known as Onimonogatari), I still had to do a little research to get a good idea of ​​what exactly was going on. A re-watch of Onimonogatari is definitely recommended before jumping into the Shinobu Mail, unless you are feeling very confident in your knowledge of the Monogatari timeline. Confronting chronology aside, I still really enjoyed the Shinobu Mail, though perhaps not as much as some of the arches in Owarimonogatari Part 1. As I mentioned earlier, Shinobu Mail drops the mysterious nature of Ougi Formula, Sodachi Riddle and Sodachi Lost in favor of something more reminiscent of Monogatari's second season, which was highly anticipated, given the nature of this bow as a sequel and conclusion to the Second Season, Shinobu Time Bow. This bow deals with the direct consequences of Shinobu's time, and in fact makes me enjoy this bow much more now I have seen Shinobu Mail as it relieves many complaints I had about it. Much of Shinobu's time, I dedicate myself to telling the public the story of Shinobu, which only seems unnecessary, but the story here justifies everything, and finally gives this side of Shinobu's time an appropriate conclusion. I'll say that Shinobu Mail's placement may be a little questionable, and may have served better as a Season 2 bow, but since the chronology is all over the place anyway, it probably does not make much difference.\\n\\n\r\nThe only complaint I have, as before, comes in the rhythm and the Shinobu Mail suffers in this respect. The last half of Episode 3 and most of Episode 4 are devoted to an unbelievably large expose of Izuko Gaen, and as such, the pace only diminishes, while the public is bombarded with pure information for half an hour. The visuals are still fantastic and relieve the overload a bit, but I can not help but feel that it could have been reduced a bit to make a faster pace. I was also quite disappointed with the absence of the mysterious Ougi, who was quite prominent in Owarimonogatari Part 1, being reduced to a cameo appearance, but since this only fits part of the novel of Owarimonogatari, with Owarimonogatari Season 2 being transmitted in the Summer Of 2017, I can forgive you, under the assumption that it will present strongly in later arcs.\\n\r\nAs is the norm for most of the Monogatari bows at this point, the Shinobu Mail is really about their characters, and is certainly a front that this bow offers in spades. Surprisingly, the character who takes the most out of this bow is not the titular Shinobu, but Kanbaru of all people. Of the many, many girls who feature the franchise, Kanbaru is easily more underutilized, so I was incredibly happy to see her in an important role here. Not only does she provide a really excellent mood in her dealings with Araragi, whom she jumps superbly, which makes for an amazing chemistry, but she also gets a scene with Shinobu in the penultimate episode, which may actually be one of My favorites all over series. Kanbaru is widely used for comic relief, a role for which she is suitable, but her scene with Shinobu proves she can be so much more. Despite having his name, Shinobu does not have much time on the screen, but the above-mentioned scene with Kanbaru is great for her and Kanbaru. I'm sure we did not see Kanbaru and Shinobu together before, but I'd love to see more.\\n\r\nI would also be very remiss if I did not mention another very bright scene in the final episode, and between Araragi and his girlfriend Senjogahara. Senjougahara is another character who does not approach the screen time she deserves and this small but sincere moment only reinforces how much we need more Senjogahara! Honestly, Araragi and Senjo are one of my all-time favorite couples in the anime, so it's really a shame that we do not see them together that often passed through Bakemonogatari. As with Part 1 of Owarimonogatari, Part 2 has some really surprising and surreal visuals, which, as always, I absolutely love. The Axis continues with all the quality and style of the animation, and they absolutely cemented their place as my favorite studio. Another area where I can not praise enough is, once again, the voice acting. All the usual Monogatari suspects are here including Hiroshi Kamiya, Maaya Sakamoto, Miyuki Sawashiro, Chiwa Saito and Satsuki Yukino, as well as new addition to the cast Rikiya Koyama as the voice of Shinobu's first minion, Seishirou, and they are all amazing as ever , Being the driving force behind this series mainly oriented to dialogue. We are also treated with our fourth (!) Opening in Owarimonogatari Part 2, \"mein schatz\" by meg rock, and while it's a pretty beautiful opening, I'm not very keen on the style of opera music, it's just not really mine Cup of tea. In short Despite a small number of flaws that are practically standard for Monogatari at this point, the final bow of Owarimonogatari has just solidified my love for this series, and neither can be one of the best entries in the Monogatari franchise.",
            "date": "2017-09-13T13:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 257444,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6092252.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Pedrolemosouza",
                "username": "Pedrolemosouza"
            },
            "url": "https://myanimelist.net/reviews.php?id=257444"
        },
        {
            "content": "What a fantastic ending to a fantastic series! I have enjoyed Monogatari in its entirety since its humble beginnings in Bakemonogatari. Even through some of the rougher, boring parts of the series, I’ve stuck through with it, because I believed that the show was slowly building up to something grand. I am happy to say that Owarimonogatari was a fantastic closing to that build up and an exceptionally satisfying way to end the story of Koyomi Araragi.\r\n\tThe second season of Owarimonogatari consists of 3 arcs: Mayoi Hell, Hitagi Rendezvous, and Ougi Dark. Since this was a fairly short season, it’ll be difficult to avoid spoilers,but I will try to explain why I liked each of these arcs without giving too many of the surprises away.\\n\\n\r\n\tIn Mayoi Hell, Koyomi finds himself in a strange place where only Mayoi exists.  There, the two reunite in the lewd way that one would imagine a reunion between Hachikuji Mayoi and Koyomi Araragi to be. Shortly after this heartwarming reunion, Mayoi begins escorting Araragi out, giving the two a chance to softly recap the series and ponder the decisions that Araragi made.\\n\\n\r\n\tI like this part because of the way it shines a light on the many possibilities that the viewers might not have even known existed. Araragi made many decisions throughout this series and their consequences aren’t always immediately apparent. Here, he gets a chance to ponder them and state his feelings on whether he feels he did the right or the wrong thing. It is a nice and somber series of scenes that really shows off his kind-hearted nature.\\n\\n\r\n\tThe arc is closed off by Araragi’s reunion with two of the apparition hunting experts, from whom he discovers the significance of the Gods and the shrines that exist in his town. Here, the viewers also learn the identity of the shadowy figure responsible for the strange occurrences in this town and the one who ordered the attempt on Araragi’s life…\\n\\n\r\n\tHitagi Rendezvous is an arc all about Araragi and Senjougahara. Since the two had been far too busy to be together for the past 6 months of the story, Senjougahara hatched the idea of going on a date soo grand that it would be enough for 6 months’ worth of dates. \\n\\n\r\n\tKoyomi and Hitagi have a wonderfully unique chemistry and having an episode that focuses entirely on that was an absolute treat. Their interactions are cute and hilarious throughout the date, closing out with the sweetest reveal about their relationship that I could not believe I did not notice up until this point.\\n\\n\r\n\tThe episode closes out with the appearance of the mysterious Ougi, who provides some information to counter what Araragi learned from the specialists in Mayoi’s arc. These revelations put Araragi’s personality to the test in preparation for the final encounter…\\n\\n\r\n\tOugi Dark is the final arc. Araragi meets the shadowy machinator face-to-face. Here, Araragi learns the secrets behind all of the events that transpired thus far, as well as the true identity of the mysterious Oshino Ougi.  This was the arc that cemented my love in this series and made it absolutely worth sticking with.\\n\\n\r\n\tThough Araragi is an incredibly flawed protagonist, he is without a doubt a “good guy.” Because of his martyr-esque personality, Araragi has put himself through unspeakable pain in order to protect the well-being of those around him. The two previous arcs heavily examined to what extent Araragi is willing to go for the sake of someone else. It is only fitting that his final test would be a battle against his own personality. When all else is gone, does he have the capacity to, for once, save himself..?\\n\\n\r\n\tThe conclusion that follows is a bittersweet ending with SHIORI by Claris playing in the background, beautifully closing out this amazing series.\\n\\n\r\nStory: 9\\n\r\nArt: 8\\n\r\nSound : 8\\n\r\nCharacter: 9\\n\r\nEnjoyment: 10\\n",
            "date": "2017-09-01T05:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 256649,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4682676.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dr_Sephiroth",
                "username": "Dr_Sephiroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=256649"
        },
        {
            "content": "THERE ARE SPOILERS i think it was really good and ougi being koyomi was my guess personally if they  released hanamonogatari later it could've had more impact because we already know survive so if it wasn't then we would we be like is ougi really gonna go away  but overall i think it was good despite hanamonogatari spoling a bit so hopes shaft will do more   highlight of this season mayoi is back as a goddess really happy about it        wish we had more screentime with nadeko also cutting her hair definitely\\n\r\n        P.S.    i'll wait for zokuowarimonogatari and hope shaft animates off season and monster season                   BEST GIRL SHINOBU",
            "date": "2017-08-26T18:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 256323,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6471483.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Asuaagua",
                "username": "Asuaagua"
            },
            "url": "https://myanimelist.net/reviews.php?id=256323"
        },
        {
            "content": "It's starts off after the end of Koyomimonogatari Koyomi meet's Hachikuji in hell and it tells the story on finding out who is Ougi Oshino, is she a normal typical villain? an oddity? a darkness? or something new? you better be ready cause you're going to one hell of a ride in this 2nd season of Owarimonogatari \r\nfirst of all the story is amazing from start to finish they executed it perfectly from those 3 arcs the story doesn't dragged you on at all they know the perfect scene so that we watchers wouldn't get easily bored with the philosophical story for example the humor,the little bit of detail on the character, and so on. \\n\\n\r\nThe Story (10/10)\\n\\n\r\nThe Art is amazing not as amazing as Kizu (exc. Hanekawa's design don't really like it that much) but it's still great to look at you won't be disappointed.\\n\\n\r\nThe Art (9/10)\\n\\n\r\nThe sound is amazing giving you the chills all over the body and they placed it nicely during the serious moment they gave you the serious tone, when the humor is on it gives you a light tone\\n\\n\r\nThe sound (10/10)\\n\\n\r\nOnce again the character development is amazing we get to see another story how koyomi actually struggles with himself, Mayoi on what is she doing during in hell, more romance between  hitagi and koyomi that they perfectly executed, and another side of Ougi\\n\\n\r\nCharacter (10/10)\\n\\n\r\ndo you think i enjoy they story? hell yeah i do i would watch it all over again they nailed the story so hard\\n\\n\r\nEnjoyment (10/10)\\n\\n\r\nIn the end this anime is a masterpiece the story from start to finish is perfect Mayoi hell, Hitagi rendezvous, and Ougi dark is amazing. The ost with the violin is beautifully well made giving me the chills all over my body. this the perfect follow up and there's no way this story is going to disappoint you\\n\\n\r\nOverall (10/10)\\n",
            "date": "2017-08-15T08:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 255505,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5993343.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SirLancelot99",
                "username": "SirLancelot99"
            },
            "url": "https://myanimelist.net/reviews.php?id=255505"
        },
        {
            "content": "Owarimonogatari 2nd Season is Volume 3 we the fans have waited for since the end of the first season back in the year 2015. Shaft has delivered however, Since making the promise back on the year 2013, Shaft compromised with the fans of the Monogatari Franchise to animate everything and anything penned by NisiOisin regarding the Monogatari Series.  So How does this second season of Owarimonogatari fare?\r\nPLOT\r\nAraragi Koyomi High School year is drawing into a close and Owarimonogatari delivers a finale and freeing every knot conjured in the series quite masterfully. \r\nOn Mayoi Hell Araragi is forced to come to an understanding of himselfand face off to the fact that there is no point of dwelling on the past. As his graduation nears he is freeing the knots of his youth and battling his inner demons that hold him hostage for every one of his seemingly reckless actions. actions that he later learns after openly giving it some thought, would have happened with or with out him and ultimately hell is a place you go on your own accord, as to your own conscience you must feel guilt to be be punished as that is something that would resurfaced on the later arcs.\\n\\n\r\nWhile Dead, Araragi has his life played before his eyes and learns that there isn't much if any to change given the chance. Mayoi Hell does one thing well, and that is it forces our MC to learn his place. he needs to learn everything doesn't depend on him and moving alongside the plot highlights his greatest hits while in high school. \\n\\n\r\nOn  Hitagi Rendezvous Araragi learns to be dependent on others and perhaps more perceptive of those whole love him, as there are people out there that would match him in kindness or maybe stupidity to stake out their neck for Araragi Koyomi while on his date after so long with Senjougahara Hitagi. Hitagi wants intimacy and seeks to get on first name basis with her boyfriend, we are shown and reminded on our cast youth as it cn be attributed to their inexperience, we are shown how a young couple waited so long for this intimacy and it becomes accomplished by coming to terms and dealing with your issues together.\\n\\n\r\nOugi Dark dealt with inner demons given shape or should I say corporeal form, Sometimes you don't have to battle your demons but accept that they're your own self criticism and they'll leave you alone as so long as you learn that you are not perfect, as you're young you're entitled to your mistakes, but it is up to you to own up to them and accept them as part of yourself.\\n\\n\r\nAs Owariimonogatari 2nd Season was one giant metaphor for struggle, It closes a story of a youth whose life went to shit when he became familiar with the supernatural. Which he later lived through, confronted and came up on top.\\n\\n\r\nSound\\n\\n\r\nThe Choice of OST and OP/ED by Shaft was amazing, it played well with the sequences and further cemented points trying to get across.\\n\\n\r\nCharacters: \\n\\n\r\nThe monogatari cast are the incarnation of the 4th wall. they're well knit and developed throughout their lives on the series a more mature outlook in life and told you their tale for your entertainment. \\n\\n\r\nArt:\\n\\n\r\nThe art was consistent of the other adaptations and the symbolism was ever so present. as always Shaft doesn't disappoint. \\n\\n\r\nEnjoyment:\\n\\n\r\nThe monogatari series is an absolute masterpiece, well put together and the characters have a little of both relativity and absurdity, why wouldn't they on this case. It's a story of youth given the breath of teh supernatural confronting themes ever so present on everyone life and some not so much as they're metaphors to problems.\\n\\n\r\nI highly recommend and before I forget, Watch Koyomonogatari Episode 11 - 12 before watching this installation.",
            "date": "2017-08-15T02:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 255489,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316339.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChaoticThinker",
                "username": "ChaoticThinker"
            },
            "url": "https://myanimelist.net/reviews.php?id=255489"
        },
        {
            "content": "I would really like to point out that i gave it overall 10 because i have watched the whole story and know of each and every small details in the plot.. If you did not watch the previous titles of this series then i bet you will give it low rating because you did not understand the plot at all!\r\nThis was by far the most intresting/informative title in this series..\r\nI was really waiting for season 2 of this and i have to say that the wait was worth it!\r\nFinally we get to know who Ougi is.. i like how the charecter development worked out. NISIOISINis GOD when he writes stories with intresting plots. Then there is SHAFT STUDIOS who turned his stories into the best anime Adaptation possible. Every episode/title in the series made me want more! Some of the quotes in between are intresting as well.\\n\\n\r\nI would recommend anyone who is intrested in watching this anime to please go on google and check the release order of the whole series and watch all previous titles before watching owari S2. I bet you will get better understanding of the plot this way. Good luck!",
            "date": "2017-08-15T01:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 255488,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6449087.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/XaiKun",
                "username": "XaiKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=255488"
        },
        {
            "content": "Owarimonogatari (End Story) Season 2 is an anime adaptation based on the novel based on the light novel \"Owarimonogatari Volume 3\" and I just have to say finally! We have finally have made it to the conclusion of the Monogatari Series (unless Zokuowarimonogatari is going to be adapted) and this conclusion is the most satisfying and deserves to be one of the best Monogatari Series arc I have ever watched.\r\nStory: 9\r\nThe Monogatari stories are pretty much one of the best out there in the light novel area, and the story gets even better.\r\nThe story consists of three arcs in each of the three episodes. Episodeone covers up the \"Mayoi Hell\" arc, the Second episode covers \"Hitagi Rendezvous\", and the third/final episode covers the \"Ougi Dark\"arc.\\n\r\nFor \"Mayoi Hell\" this arc has memorable nostalgia. Other than nostalgia, it gives the main character questions what if he didn't do all of these things and just focus on himself or what the main character actions are doing good.\\n\r\nFor \"Hitagi Rendezvous\" we get an in-close relationship arc of both Senjougahara and the Main character Araragi. The date is not like in your average anime. Nothing crazy at all. We get to see two of our characters experiencing heartwarming and developing relationships and see what it leads to.\\n\r\nFor \"Ougi Dark\" we reached to the climax where we see characters expressing their thoughts on what they are going to do in the future and the climatic showdown between Araragi and the antagonist.\\n\\n\r\nThese 3 arcs also answers most of our questions were answered from Koyomimonogatari. Thank god the director decided to not leave important details out. The pacing is pretty good too.\\n\r\nOverall the story got me emotional, thinking, laughing, happy, and I praise Nisio Isin for his great writing. Also, keep in mind with the life lessons, too.\\n\\n\\n\r\nArt: 10 \\n\\n\r\nShaft really knows what to do when animating this light novel. They have been doing this for the past 10 adaptations in three seasons and they still got it.\\n\r\n-Polished visuals and colors\\n\r\n-Good Lighting \\n\r\n-Colors and artstyle in backgrounds, animation, and character fits specific scenes.\\n\r\nLets not forget about the filming technique that they used which is the \"French New Wave\" and it works perfectly in the Monogatari Series especially in this adaptation\\n\\n\\n\r\nSound: 9\\n\\n\r\nLike the animation, the sound can adapt to the setting and the tone. Each arc gets a different soundtrack and its very good if I must say. Of course many people would forget about the music being played in the Monogatari Series, but I suggest don't. When its a happy scene, there's happy music, when there are funny scenes: there are pleasant and relaxing music, when the scene gets serious: there are eerie and mid silent music, and when its sad: there's emotional music. The composer deserves praise for this.\\n\\n\\n\r\nCharacter: 8\\n\r\nFor those who are Monogatari fans (including me), we can admit that we wanted these characters to come back. Boy, we missed these characters. Of course, a character is developed through conversations, some which leads to life lessons and morals. Also, characters, that I thought were going to be average harem troops, instead that their own complexity and uniqueness and that still remains in Owarimonogatari 2nd Season. Araragi also receives some good character development. But I do want to point out Teori who I think the character is boring and not as interesting, but his back story raised my interest a little bit. Therefore, it deserves an 8. \\n\\n\\n\r\nEnjoyment: 9\\n\r\nIts been 8 years since Bakemonogatari first aired, and then 8 years later we would finally reach towards the conclusion to this fantastically written stories of aberrations and Asian folktale which good character development and personality, and depth of story. Of course, I watched the whole series on repeat from first to third/final and I can do the same to Owarimonogatari 2nd Season watching from first to thrid/final.",
            "date": "2017-08-14T21:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 255480,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6365540.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kyougi",
                "username": "Kyougi"
            },
            "url": "https://myanimelist.net/reviews.php?id=255480"
        },
        {
            "content": "Owarimonogatari wasn't the most heavily emotional part of the Monogatari series for me, those bases are pretty much already covered, but it was still just as self-actualizing and personally affecting, and it managed to provide an ending which tied everything together so well it’s honestly kind of mindblowing how beyond perfect it is. Seriously, Nisioisin has been playing 4D Chess this whole time. Every series staple since Bakemonogatari comes full circle, and it’s like the greatest puzzle in the world being solved as all aspects of the series up until this point get synthesized into one narrative singularity. Even the fucking recurring jokes are revealedto have been foreshadowing the final narrative roles of each character, and that’s just astounding. And with this season focusing on Araragi and the conclusion to his character, the ending also paves the way for Araragi to move on into adulthood, as he finally \"loses his adolescence,\" an event which has been hinted at a lot up until now. The results of which are reflected in his appearance in Hanamonogatari, where Araragi has evidently become a different person and is even wise enough to effectively help Kanbaru sort out her own issues. In fact, the advice Araragi gives Kanbaru and his ability to help her without directly involving himself are key here, as Araragi must not only “lose” his adolescence in this season, but also comes to terms with it. I won’t be spoiling anything too specific, but be wary as I will be talking about some key character developments essential to understanding the overall conclusion to the series.\\n\\n\r\nThe writing regarding this return focus on Araragi was as strong as ever, and the scenes throughout each episode demonstrate that. The whole season is essentially a breakdown of Araragi as a character, reflecting on who he is, what he’s done, and what the results were over the course of the series. And in addition to the phenomenal character interactions and thematic staging, the season’s visual direction and overall production quality strongly highlight this as well, with some of the most striking images (and backgrounds) of the entire series and a profoundly atmospheric and evocative original soundtrack. Perhaps most notable of these two qualities is the series’ return to dramatic shifts in art style and color palette reminiscent of the original Bakemonogatari, and the season’s use of beautiful orchestral arrangements that lend the show a truly penetrating sense of tension during it’s eerier scenes, sorrow during it’s more somber ones, and vivid joy in it’s uplifting ones. And these callbacks to the style of Bakemonogatari are quite appropriate for this season, as the events that took place during that time are what primarily affect Araragi’s change here. \\n\\n\r\nFrom the outset, Araragi’s character arc centers around his tendency to put himself in danger in an effort to relieve the distress of others, something which, in addition to his own mutilation at the hands of of those he’s trying to help, has routinely led to further issues down the road that stem from the initial problem. And as Araragi continually fails over and over again to solve these issues with the same method of self-sacrifice, we see him come to resent those past actions. But while Araragi's previous behavior may not have been able to totally fix everything and had some unintended consequences along the way, if it weren't for his involvement, none of the characters in the series would be the better selves that they are now. And likewise, as Araragi finally faces himself and learns how to become a more balanced individual this season, it can’t be denied that the actions of Hanekawa, Senjougahara, Oshino, Hachikuji, Shinobu, Kanbaru, Ononoki, and all of his other friends had aided him in doing so, the same way he had aided them before. When the time is right, he even says this in his own words: “Everyone else saved me, and if I didn’t save myself? That’s something I just couldn’t allow to happen.” \\n\\n\r\nUp until now, Araragi has spent the entire series “saving” others, but he’s never really had to do it for himself, like Oshino always says. He had the chance to in Kizumonogatari, but he doesn’t. He runs away from that idea, believing that he should be punished for his actions, and that’s why when he narrates the story, he calls it a tragedy. As the show goes on, Araragi’s always thinking this way, that all he does is make mistakes, and maybe the world and everyone he knows would be better off without him. As his self-identity is disrupted, he dejectedly falls further into the mindset that he is worthless and a burden, and that’s what makes it so moving when he finally breaks free from it. Faced with the physical manifestation of all his self-doubt and pressured from all sides to suppress it, Araragi instead chooses to forgive that self-doubt, accepting it as a part of him, and by extension, accepting himself. He refuses to give in to despair, admitting to himself that even if some of his choices didn’t turn out for the best, he was not wrong in making them, and it’s one of the most powerful moments in the entire series. Helping those in need is a part of who Araragi is, and that’s okay, but in coming to terms with his self-criticism, he also learns from it. By confronting his lurking feelings, he comes to recognize that without his mistakes he never would have found so many people who enjoy having him around, and in turn make his life more enjoyable too. After all, his loved ones have always given him their all just the same as he has for them, so how could he possibly think he wasn’t also worth saving?\\n\\n\r\nThis whole arc really resonated with me a lot, as I’m sure it did with many others, especially considering how often in the past I personally have had to deal with my own self criticism and regrets. Throughout high school I was often extremely hard on myself and always felt like I was messing everything up, which all came to a head when I lost my status as class salutatorian during my senior year. And while the loss of this superficial label was ultimately pretty trivial (retroactively speaking), at the time it culminated in thinking I was a failure who hadn’t lived up to expectations, despite knowing full-well that I had so many people who loved me for who I was and would always support me regardless of any blunders I make. But that’s the thing, those negative emotions often don’t seem to make sense. They emerge regardless, even when it seems illogical. From a purely objective standpoint, Araragi lives probably the best life there is out of all the characters in the show, especially when comparing between them. He has a stable, financially well-off family life with both parents, an enormous house with his own room, a loving girlfriend who always sticks by him, and next to no social pressures weighing on him to be a certain way. And yet, Araragi still feels inferior. \\n\\n\r\nHe has everything he could ever want, so why would he be unhappy? Because he hasn’t suffered as his friends have. Because he hasn’t seen the same kinds of hardships. Because he has always been allowed to be himself. And isn’t that wrong? Shouldn’t there be a consequence for that? And that’s just it. Araragi has watched his friends endure so much, all while he lives seemingly carefree, and he hates himself for it. That’s why he tries so hard to take all of their pain onto himself, because he doesn’t want them to feel it, and believes that comparatively, he hasn’t felt it enough. All of Araragi’s pain is self-inflicted. And like Araragi at the end of this season, by the end of my senior year, I too had realized this. And so I took those feelings of failure and self doubt head-on, realizing that they needed to be confronted no matter how painful they were for me to accept. Rather than shutting my emotions inward and continuing to deny that I deserved to be happy, I moved on and decided that I was worth it. Because despite my imperfections and the mistakes of my past, I am good enough, even if my choices make my life or the lives of others harder sometimes. That’s just how life is, and getting over those hard times is how you grow, and that’s what the Monogatari series is ultimately here to say.\\n\\n\r\nThe number one lesson that Araragi (and the viewer) learns is that while he will always be \"himself\" and should never give up his identity, true love and compassion don’t come in the form of forsaking yourself for others, but simply being there for them when they need it, and knowing to be there for yourself from time to time too. Araragi Koyomi will still always want to help people in need and do anything he can to do so, but now \"anything\" doesn't mean \"everything,\" because he values his own life too. Overall, Araragi as a character is probably the most well-done and impactful execution of picking apart the \"hero complex\" trope I have ever witnessed. Like all the other characters, the deeper layers added onto Araragi serve to deconstruct his trope-ish nature and create a truly human persona, as his sacrificial habits are shown to be motivated by a severe lack of self worth, which in itself is motivated by self-destructive levels of regret and personal criticism. In enabling others to put their pain onto him, like Kanbaru, Sengoku, and Hanekawa, Araragi gives them someone to lean on, but also causes them to again suppress certain facets of their pain rather than dealing with the root of the problem. And soon, as Araragi begins to recognize this, his feelings of inferiority are only compounded. Metaphorically, the physical beatings Araragi takes from the girls he tries to save perfectly mirror the internal struggles that develop within him as a result, and the way Nisioisin portrays this is pure genius.\\n\\n\r\nUltimately, Araragi's final acceptance of himself and the mistakes he’s made, alongside all of the emotional and narrative weight that comes with it, echoes the themes which have been displayed since the start of the series. Themes which continue to resonate deeply with me and my humanity to this day, and I don't think there could have been a better way to end off the main storyline of the show. For when Araragi’s moment of truth finally arrives and he both literally and figuratively chooses to prioritize himself rather than the interests of others, it comes off as the quintessential visual and literary manifestation of the series’ main thesis statement: “Only you can save yourself.” It’s been a long journey with this series and these characters. Since the beginning, this show has poignantly reflected the things I and many others experience in dealing with the complex emotions that arise from our frustrating human nature, and this final season is no different. It’s changed how I view myself, how I value my relationships with others, and my attitude towards life in general. So thank you, Monogatari, for all of the literal years of entertainment, artistic satisfaction, and introspection you have provided me. You truly were, and always will be in my book, “the story that grows with you.”",
            "date": "2019-01-03T22:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 297986,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5159888.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/-Jazz_",
                "username": "-Jazz_"
            },
            "url": "https://myanimelist.net/reviews.php?id=297986"
        },
        {
            "content": "This was the perfect ending to a perfect show. I am very happy about how it was handled. I was surprised but it was truly genius.\r\nSpoilers:\r\nI have some remarks about the role of Ougi from now we will also dig into spoiler territory.\r\nI didn't expected Ougi to be a product of Araragis self criticism. I expected Ougi to be the darkness that lies in everyone's heart's. The side that doubts the side that loathe the part of us almost everyone experiences.\r\nThe monogatari series is all about the representation of teenage worries represented in a physical form , they are called monsters in the show. WhenI thought about Araragies depression , it's only natural to expect shinibu. Everything about her design reeks of depression. The energy drain literally sucking the life out of you. The temptation that slefloath brings with it. When Araragie dies it means shinobh is at full power, meaning he killed him self and depression got the best of him. So I think shinobh as a stylistic choice is better fitted as the representation of dark Araragie.\\n\\n\r\nIt was clear that Ougi was the Endboss of the show. It wrapped things up nicely. Linking Ougi directly to Araragie was kind of genius, because in saving her meaning saving him self was a very important growth he needed. In the show he was willing to throw is life away every single time, having no self worth. But on the other side, he is saving the bad part of him the manifestation of his self criticism. And in the way he saved her he almost died again so growth that was intended contradicts itself...\\n\r\nLike I said , my interpretation of Ougi as the darkness that lies inside everyone makes more sense for myself, but it's only a personal opinion.\\n\\n\r\nOther parts I enjoyed about the story:\\n\r\nThere is a inner logic to explanations I very much enjoy. Like Ougi was created due to the Araragis powers as a vampire . Or Araragie is very attractive because of the immortal powers of a Vampire.\\n\\n\r\nThe world that gets built up little over the course of the series get tied up nicely later. Little details like kanbarus mother are used up seasons later. Observant viewers are rewarded.\\n\\n\r\nI see many similarities to the \"hero's journey\" . For example \"call to advanture \", when Araragie finds shinubu in the underground station.\"death\" and \"resurrection\" are obvious.\\n\\n\r\nThe characters are realistic . They experience setbacks like hanekawa that turns to the meddlecat again. It prevents character breaks and make the characters relatable.\\n\\n\r\nThere are way to many things I love about this show.\\n\\n\r\nAnyway I love the whole monogatari series it is philosophic it is interesting it is different it is one of my favourite shows of all time . 10/10",
            "date": "2018-10-18T14:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 292012,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LackyN",
                "username": "LackyN"
            },
            "url": "https://myanimelist.net/reviews.php?id=292012"
        },
        {
            "content": "I did not think that this story turned out to be a blessing from \"Koyomimonogatari\" I even forgot that Araragi was dead.\r\nbut with the meeting again araragi and mayoi (even though in hell) this makes me more excited to watch this program.\r\nfigurative words that are often used, meaningful sentences, and things that make the audience think heavily is the extraordinary attraction of this anime ..\r\nthere may have been a lot of spectators who longed for mayoi jokes \"sorry my tongue was bitten\". really the charm of extraordinary comedy for me.\r\nTerminal terminal songs (first opening) are still ringing in my head at this time.\r\nthe main starnow is ougi-chan, a very mysterious character with a sweet smile and looks so smart and knows a lot of things.\\n\\n\r\nthis story is increasingly thrilling in each episode. so excited me.\\n\\n\r\nthe best part is when Araragi saves Ougi-chan.\\n\r\nthis part makes ougi-chan look so smart by acknowledging that \"she's not a woman\". even so, I think he is not really that much because she is someone who will criticize Araragi so she certainly knows that all those who have been saved by Araragi are girls. ougi-chan who prefers not to be saved will certainly choose to lie to Araragi.\\n\\n\r\nthat's my view after seeing the nature of ougi-chan in the other monogatari series and the mindset of Ougi-chan itself.\\n\\n\r\nI thought I would be very disappointed with her confession so that I sought the intent of the words and my conclusion was that she was lying.\\n\\n\r\nbut it was something like this that made me very happy with the monogatari series. which gives me the opportunity to think like this. XD\\n\r\n \\n\r\nand lastly, I never thought I'd be so fascinated by the character of Ougi-chan. in the other series he looked normal and had no impact there. she is not a beautiful character. it's just that I just realized his specialness in her beautiful smile.\\n\\n\r\nof all the anime characters I've met, only his smile seemed so sincere. many anime producers present beautiful, large-breasted, small-bodied (loli), twin-tail, or other distinctive characters.\\n\r\nbut this character is very different. right, I really like this character. so is the mystery.\\n\\n\r\nthe closing of this series is decorated with beautiful sentences from araragi koyomi and shinobu. for me it was one of the most beautiful closing of all the monogatari-series covers.\\n\\n\r\nI am very grateful to Nisio Isin for creating the masterpiece.\\n\r\nI can only support and pray that Monogatari series can reach the top rating rating.\\n\\n\r\ni hope you understand what i mean. i just using google translate XD\\n\r\nMy english is too bad, but i wanna review this anime cause i love this anime very much.. thankyou Nisio Isin for yous story. >.<",
            "date": "2018-10-03T09:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 290795,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kiryuu18",
                "username": "Kiryuu18"
            },
            "url": "https://myanimelist.net/reviews.php?id=290795"
        },
        {
            "content": "Such a great year for Anime!\r\nUnfortunately, I am typically someone who is not in favor of giving alot of 10's. When too many start to pop up on my list, I raise the bar, and drop some off.\r\nThe release of Owarimonogatari S2 raised that bar for me.\r\nPerhaps you've tried the Monogatari series out before and it wasn't for you. Between the fan service, confusing dialogue and lack of chronologic release, this is a tough story for anyone to get in to.\r\nThe closest comparison I can make would be the Haruhi series and its' endless 8. Like Haruhi this series can drag and test your patience.However also like Haruhi, the conclusion to this series was a masterpiece.\\n\\n\r\nThere is none of the Fan Service or Comedy saturation present in previous installations. Owari Season 2 is not playing games here, its just straight action and drama.\\n\\n\r\nFrom the very first scene, just seconds in to this conclusion you can immediately tell this is a cut above the others. A degree of effort and time was put in to this work of art that is worthy of a series that has grossed nearly $2 million USD per episode in DVD sales in Japan. It is worthy of the ranking it has on this site, it is not hype and its drop in rankings will not be significant as time drags on. This top 20 installment will stick for a while, trust me. If you look on the Japanese mail order sites you will notice that the final chapter, the 1 hour long \"Ouigi Dark\" is universally sold out still. I expect this will also remain true for some time.\\n\\n\r\nStory 8: Sure it didn't explain every little detail or plot hole, it also did not have to. Its ending was perfect, satisfying and bittersweet.\\n\\n\r\nArt 9: This is a series that has always given us high quality art. The color selections were revolutionary, and every scene came to life. Animation techniques were diverse. While we may not have gotten anything we haven't seen before in terms of animation or cinematography, everything we got was done extremely well and contributed to the story and overall tone; aesthetically speaking.\\n\\n\r\nSound 10: If it would be possible to give 20/10 here I would give it. Its OP and ED's were catchy and the opening artwork was extremely symbolic and foreshadowed events to come without spoilers. More importantly however, the OST for these 7 episodes was longer and more diverse than most 100 episode anime. Fullmetal Alchemist:Brotherhood? In 7 episodes this series was more diverse. In terms of music theory, folks on,youtube are rapidly discovering that these OST tracks are technically complex and nearly impossible to arrange. They were really thinking outside the box musically. It might literally be the best OST in anime, pound for pound and I mean every word of that.\\n\\n\r\nCharacters 8: Incredible character development, formerly 2d characters show 3d natures and every single individual we care about has changed in some,way as a result of the events that took place here. This is basically the golden rule. The #1 thing we should look for in order to find a 'great' character, this series has ALOT of great characters.\\n\\n\r\nEnjoyment 10: Enough said.. You need to watch this series. Preferably watching all of the \"main\" episodes last. First watch Kizumonogataro trilogy. Mark off Second season 6-9 and 14-17 followed by Owari s1 ep 8-13, koyomimonigatari episode 12 and this entire series to be watched LAST. Watch everything in the middle in order. You wont be disappointed by the HOURS of emotion and action that hit you when you dig into the Monogatari \"main\" plotline. Its worth every second of fanservice and painful dialogue to get there.\\n",
            "date": "2018-03-22T11:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 274566,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471538.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Valeofruin",
                "username": "Valeofruin"
            },
            "url": "https://myanimelist.net/reviews.php?id=274566"
        },
        {
            "content": "The monogatari series is known for having an unusually high number of characters take important roles throughout the story. In fact, as we have seen, each character possesses their own arc (excluding gaen's group of apparition specialists), and in this second season of owarimonogatari, we got to see almost each and everyone of them. My initial expectations were that this season would focus primarily on Ougi, and while it did, it also gave some really nice closure to other characters as well. But no matter how much I may like them, after watching this season I came to have an overbearing interest for Ougi. Backin 2015 when the first season came out, she was already adored by many, being called the best girl by them. To me however, she was just another well-written character, not some candidate for the best girl of the whole series. From what I had understood back then, she was clearly behind some schemes that made Araragi's life even harder for himself, and her speech sounded really suspicious at times. At the same time however, she also seemed to help him understand of the problems that were at hand at that time. For this reason, I didn't know exactly what to think of her, and gradually became more and more curious about her real identity, without any real clues as to what it was. The reason I couldn't ask for a better ending to this arc, is because her identity turned out to be something a lot more meaningful than I could have ever imagined. She did not only become my favorite character of the whole series, but she also became the foundation to a spectacular ending to an 8 year long anime full of rich storytelling. The voice actress behind her voice sang the third OP for this season, and it also turned out to be my favorite OP of the whole series, taking tsukimono's Orange Mint's spot. If you have been a fan of Kaori Mizuhashi for one of her works before, I hope you may enjoy this amazing and conclusive performance of her for the monogatari series, and continue to support her outstanding talent in the industry.",
            "date": "2018-01-01T12:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 267112,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4508551.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Umaigenomu",
                "username": "Umaigenomu"
            },
            "url": "https://myanimelist.net/reviews.php?id=267112"
        },
        {
            "content": "Let's be honest here, it's hard not to give this show a great review. I wish I could rate it a 10 and be done. But the more I think about it, the less satisfied I am with Owari Season 2 being the \"End\" of the main story of the series. Don't get me wrong, I enjoyed the hell out of this season, but it didn't have the impact I was looking for.\r\nStory: 7\r\nOutside of the second arc of the show having no real point, the story was just as good as most of the other seasons. Most of the ongoing plots are wrapped upnicely, and it sets up for a great continuation. The fact that it sells itself as the \"final season\", however, is something that detracts from it in my opinion, as it is quite clearly not. \\n\\n\r\n*spoiler*\\n\r\nWhile it does wrap up the ongoing background plot, it does so in a very open ended manor that left me wanting more conclusion. The ending itself seems rather sudden, and a lot of the lead up to it seems wasted.\\n\\n\r\nBut overall, it was still a solid end to the first two seasons.\\n\\n\r\nArt: 9\\n\\n\r\nThe art itself was up to par with the rest of the series, however, there was some kind of touch that it was missing, probably due to having a different director. The monogatari series had been losing its uniqueness slowly over the years when it came to the visuals, but in Owari S2, they seem to be all but absent, or rather a shell of their former self. That's probably a harsh way to describe it as I still rate it a 9, but that is how I feel, nonetheless. \\n\\n\r\nSound: 10\\n\\n\r\nThey definitely didn't lose their touch here. Great ED, and dark cherry mystery was immediately one of my favorite OPs from the series.\\n\\n\r\nCharacter:  8\\n\\n\r\nFor most characters in the show, this was a nice wrap up. I would have loved to give the show a 10 here, as I think the characterization in the series as a whole is fantastic, but I can't help but feel a little injustice being done to Ougi's character at the end. I won't go into detail here, as I would have to actually discuss the shows ending, but it seems like she goes against her entire principals at the end of the show.\\n\\n\r\nAlso, many of the characters are simply in the series to make a cameo type appearance. And while it is obvious that they could not include every character, some of these cameos seem random and/or unneeded.\\n\\n\r\nEnjoyment: 8\\n\\n\r\nWhat can I say, I have yet to dislike anything to come out of this series. While this season didn't quite live up to what I wanted it to be, I still had a blast watching it, and did enjoy the ending, though not as much as I would have liked.\\n\\n\r\nAlso, one of the best jokes in the entire show is in the first few minutes of episode one.\\n\\n\r\nOverall: 8\\n\\n\r\nAs a conclusion to the series, I find Owari S2 to be rather unfitting. However, as a bridge to the later installments, I think it works out fine. As long as this season isn't treated as the end, it stands up well with it's piers. With interesting (if somewhat foreseeable) reveals and twists, a decent ending, and outstanding story telling, Owari S2 doesn't disappoint and works as a great bridge between the initial saga of the series and potential later installments.",
            "date": "2017-08-24T12:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 256184,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4537786.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Octavar",
                "username": "Octavar"
            },
            "url": "https://myanimelist.net/reviews.php?id=256184"
        }
    ]
]