[
    [
        {
            "content": "The Yozakura Quartet franchise has been an odd ball in the mix. Some classifies it as a supernatural comedy while others sees it as a fun series with shounen battles featuring a diverse cast of characters. While the series itself doesn’t venture too far or drag like long term battle shounen series, it does take some patience to get used to. Yozakura Quartet: Hana no Uta is one prominent example of where it’ll take more than patience to get through the show. It’ll take endurance to get yourself familiar with the themes. Once you do, you might find a little charm in this show. Asfar as that goes, Yozakura Quartet still is like a stinger on a bee that might not always work out right.\\n\\n\r\nYozakura Quartet: Hana no Uta is a brand new anime series based off of the manga of the same name. The series stands out on its own so it’s not completely necessary to watch the previous seasons or OVAs. Tatsunoko Production adapts the season that has its long history of animation production tracing back to the 1960s. Their more recent works such as Gatchaman Crowds also adapts supernatural themes into a modern life setting where everything seems normal at first; that is until the extraordinary strikes into the core of the story.\\n\\n\r\nBizarre may be interpreted as an overrated word for a show like this but it never escapes as the way it describes its style. \\n\\n\r\nThe story begins exactly as such in a bizarre way involving fish tanks, pigeons, and something we might be more familiar with – youkai. The way it sets it up makes viewers confused at first. This is especially true for viewers coming completely fresh into the show without expectations. What follows later makes more sense as we see other characters jumping into the problem and resolving it in their own little ways. They even get their rewards too such as enjoying the Sakura Festival. Because hey, we all need a break to enjoy ourselves after a day of hard work.\\n\\n\r\nIf you’re unfamiliar with the Yozakura franchise, one key factor to consider would be the diversity of its characters. Among the center of its cast are four main characters by the names of Akina, Hime, Ao, and Kotoha. While they seem normal at first with their teenager like outlooks, all of them have supernatural abilities. Not only that but one of them, Hime Yarizakura, stands as the protector of their city Sakurashin. Because youkai co-exists with humans, one should expect danger at all times as nothing is considered ordinary. For Hime, she plays the role of a guardian/mayor and the anti-thesis of a frail girl. She charges into the face of danger and puts others before herself. In one instance, she even tries to escape the hospital despite being injured. In her mind, it’s her duty and responsibility to protect the people she loves. \\n\\n\r\nIt’s not a surprise that most of the main female characters defies the typical fragile girl trope either. It’s bizarre since most of them are teenagers and aren’t fully matured yet, or at least at the age of the adolescence stage. Even bystanders at some cases that gets indirectly involved with the youkai displays some of their tendencies to help others. It’s bizarre to see on various levels with the fact that youkai are a threat to its citizens of the city yet people are willing to risk their lives. Normally in supernatural series, you would see people rushing away from scenes of danger. In Yozakura, it’s the opposite way around. But as much as fun as the series goes with its whole supernatural themes, it still falls under the typical story involving teenagers obtaining powers in a generic setting. Antagonists are stereotypical with their own ideologies and causing menace to the city’s people. Their physical appearances also reflects their actions that speaks louder than words. Although it sparks some interest at first, they can become dull as the story goes on with limited exploration of their character backgrounds or origins. It also opens up the fact that their lack of personalities gives them a hollow part to the main story. The resolution to most conflicts literally turns a villain into an ally that becomes repetitive to comprehend. While it stands out as a justification for their actions, there’s limited amount of characterization afterwards. On other hand, Akina Hiizumi is perhaps one character that has some depth with his own conditional way of thinking such as concepts involving destiny. Unfortunately, the majority of the characters in the show still lacks dynamics. The male characters are also portrayed as jokes on various occasions such as Kyousuke Kishi thanks to his powers.\\n\\n\r\nIf you’re into the story, the series does go into depth with some of its concepts. In between are some episodes that may feel a bit repetitive or oddly paced. The series itself is also only 13 episodes (one cour) but surprisingly adapts quite a lot of material from the manga in the form of packages/arcs. Along with adaptation, it even manages to insert various comedy scenes too to raise attention. While it doesn’t overly express fan service, the series doesn’t avoid with the pool outdoors. On the other hand, it sticks to its themes fairly well with the supernatural features. Although the story is predictable on various occasions, it can still be surprisingly entertaining thanks to its fluid action scenes and energy. On a more technical scale however, the story sometimes lacks details in terms of explanation. It also neglects a serious atmosphere on most occasions despite the dangers of the youkai. Perhaps the amount of energy the show possesses is too much for the story to stands for itself. Hime is just one prominent example but other characters also pours their ebullience to reflect its atmosphere. A mixed bag is also the comedy – some of them oddly coordinated while others works out quite well to make its point. This usually involves the character interactions, dialogues, and in general the way they play their parts in the story. While some characters don’t stand out as much as the others, comic relief is a prevalence of the franchise and is executed decently. Get ready to grab some popcorn, sit back, and enjoy the laughs.\\n\\n\r\nArtwork is not a prominent factor but does play a key theme to reflect its style. It’s important for the show to depict its supernatural themes. Surprisingly enough, it did pull it off in that fashion. Youkai are designed not only with otherworldly features but also giving their malevolent appearances. None of them looks the same and offers a diversity of characteristics. The way the antagonists are designed also conveys their efforts well. On the other hand, fan service sometimes gets in the way as female characters are characterized with more sexuality than they should be. The background textures also seems average as nothing stands out as extraordinary or noticeable. Hime on the other hand has that noticeable scarf wrapped around her neck with a more definite meaning. \\n\\n\r\nThe soundtrack is solid for most parts. The OST performs well mostly during its action scenes but fades in the background during more of the calm scenes. There are some emotional scenarios in the series as well and the soundtrack reflects its mood consistently. However, it lacks the concept of originality with portraying shounen battle sequences. Cheesy dialogues are inserted in during fight scenes while the whole stereotypical laughs from the antagonists are echoed in the air. The OP song is quite catchy with its presentation and the memorable “lalalala” that once again reflects its comedic mood. And as I mentioned before, there is a diverse cast of characters so each of them should reflect a different sense of tone in their voice mannerisms. Most of the characters has their standards met. Hime in particular stands out with her tone as a girl with responsibility. Kotoha Isone is also a character to take notice of because of her ability that relies on words itself that are spoken. On most parts, the soundtrack and voices works out right but nothing earth shattering.\\n\\n\r\nIn the end, Yozakura Quartet: Hana no Uta is one of those series that will strike out as bizarre yet appreciable. There’s that word again but it fits with the show right with its story, character, themes, and overall presentation. I won’t say this show is for everyone but shounen fans should definitely appreciate the style. The comedy can be appreciating with the drama and diversity of characters. On the other hand, some of the story itself feels blend or weak at various points. Its lack of character development sometimes makes the shows feels like it’s just another battle shounen on occasions. However, the energy will envelop and sucks you with its style in its Yozakurish way.\\n",
            "date": "2013-12-30T16:07:00+00:00",
            "helpful_count": 78,
            "mal_id": 126367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=126367"
        },
        {
            "content": "I will keep this review brief. I will not mention much of the story. I will just give my simple opinion on it.\r\n  Story : 8/10 - The story seems intesting so far. I thought it could have explained some things a little more though earlier though. Like with the Tuning stuff and characters. It kinda kept me wondering, or it would have if I didn't watch the original animation. By the way, I only watched some of the episodes for the original one.\r\n  Art/Animation : 9/10 - The art is really good. Same goes for the animation. However, it isnot the best. The fight are really great though. Which bumps it to a 9.\\n\\n\r\n  Sound : 10/10 - The opening sounds great. The lyrics are descent. Same thing with the ending, but I thought the ending is a bit soothing so it was really nice. But a lot of people don't listen to the OST and sound effects as much. For this particular anime, it's amazing. The fight music sounded really epic. Especially when it builds up to a climax and ends with a bang. Really nice. Also the sound effects such as the tuning-electricity sound is really awesome and the striking is really menacing (the blue lighting thing from the sky). If you don't watch this with earphones or headphones, you're watching it wrong.\\n\\n\r\n  Characters : 9/10 - The characters are really cool. Not much I can say. I really like the voice actors though. They portray the characters really well.\\n\\n\r\n  Enjoyment : 9/10 - The anime I like are usually Slice of Life, Action, Romance, Drama, ect. I felt like this anime is just right for my taste. Also the fight scenes are pretty minimal so don't expect it to be action packed, but it includes some other genres. But the sound effects, music, and fight scenes kept me replaying for a bit. Oh and there's a good BIT of fan service. The good thing about it is that the animator(s) didn't focus in on those small scenes. It was just there because it was there.\\n\\n\r\n  Overall : 9/10 - It's a great anime. Not the best in the world. But it's very entertaining. Had some moments when I thought out loud from some scenes, I replayed a bit, and was in awe in some fight moments. The music and sounds are what mostly kept me immersed in the anime though. Wasn't really any noticeable music when I just say, \"Whoa!\". It was just a mellow whoa. Them sound effects though. Whoa, epicness.\\n\\n\r\n  Well yeah. My crappy review. Anyone who read this. I respect to you for taking maybe 5-10 minutes of your life away to read this. And as you can probably tell I'm a guy who is practically in love with sound. Not as hardcore as an audiophile though. I just listen to music a lot. So I became sensitive to bad sound effect quality too.\\n\\n\r\n                                                                        Bye~",
            "date": "2013-12-18T02:02:00+00:00",
            "helpful_count": 58,
            "mal_id": 124409,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3362933.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NotableNick",
                "username": "NotableNick"
            },
            "url": "https://myanimelist.net/reviews.php?id=124409"
        },
        {
            "content": "I'll write a brief review on this one (Spoiler Free). Hana no Uta is a reboot of the original Yozakura Quartet, and in my honest opinion, you can't enjoy the reboot to its fullest without watching its predecessor, you'll miss important character information and maybe some bits of the story that might make you enjoy this one a lot better.\r\nI'll say the original was definitely not that good, the story was interesting but poorly managed and the characters could have been developed a lot better. And oh boy have they fixed it in Hana no Uta, besides the different takes with the art style andthe more common comical gags (and panty shots!), which were great additions, the series has become enormously better and more entertaining. \\n\\n\r\nStory 7/10:\\n\\n\r\nWhy am I giving a 7 here? Because the story just felt rushed. The story is great, it is interesting and has plenty of options and directions to go from, but in 13 episodes there was barely any time to extend it and have those last questions answered (even though it had a good ending).\\n\r\nThe characters had time for proper development this time, and this increased the story's value by tons. The past of Akina's and Hime's families were explained, and a lot of other backstories that I thought were missing in the original run of Yozakura.\\n\r\nMy only complaint would be that 13 episodes (mostly the last ones) were too rushed, I wanted the story to keep going, and the last episodes to be explained better and not feel so rushed. They leave us with questions at the end, it actually feels like Enjin has to wait on the producers to put his plan to action. I don't know if any continuation to the story is coming or not, but I really hope so.\\n\\n\r\nArt 9/10:\\n\\n\r\nThe art style is beautiful, the characters look stunning as well as the colouring. Action scenes did flow better than I expected and all the facial expressions were top notch imo, in comical moments as well as in serious ones. It might be a matter of taste, but for me it more than deserves this score.\\n\\n\r\nSounds 9/10:\\n\\n\r\nSound isn't my strong point. I found both the opening and ending songs amazing, the ED will give me nostalgia moments in the future for sure, it's just a great song. The OST felt fitting and in place, there isn't much more I can say about it.\\n\\n\r\nCharacters 8/10:\\n\\n\r\nThe characters were already great in the original, but lacked stories behind them, well it's all fixed now. Everything's likeable about them, and this time you can follow their stories throughout the episodes. The reason I'm not giving them a 9 is because some of the stories felt rushed, like I mentioned above, doesn't make them any less good though.\\n\\n\r\nOverall 8/10:\\n\\n\r\nYozakura Quartet: Hana no Uta works as a comedy, a slice of life and an action anime, when you put all of them together and it works, what's not to like? This is definitely worth the watch, I recommend it to anyone who's looking for a heart warming, funny and action filled story. If you watched the original, don't hold back, this one is a lot better and you will not regret it. If you didn't watch it before the reboot, you should, there's still important information in the original that transitions into the reboot without proper explanation in the latter.",
            "date": "2015-02-01T20:26:00+00:00",
            "helpful_count": 40,
            "mal_id": 179460,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4079963.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Milhofo",
                "username": "Milhofo"
            },
            "url": "https://myanimelist.net/reviews.php?id=179460"
        },
        {
            "content": "Yozakura Quartet. The quartet of the night cherry blossoms. What a resonating name.\r\nThis is another one of those shows that started off with a bang. Nekomimi girl with pantsu shot? Check. Randomly appearing huge goldfish? Check. All that crazy spiced up with a dash of ecchi. Yummy. I am one of strong believers that the start and the end of an anime are the two most important parts to get right. After all, if you don't get episode 1 just right, you're gonna lose viewers. If you don't get the final episode right, you leave a sour taste in everyone's mouth. So there's that. YozakuraQuartet. Great title. Epic start.\\n\\n\r\nCharacters were like-able right off the bat. You have the tsundere main girl who literally hums a tsundere song, sports a long-ass scarf for image which scores +1 in my book, don't know if it will in yours though, and kicks ass with a stick/spear/lacross racket. You have that usually-quiet, laid back main guy who actually secretly gives a shit. And a bunch of interesting side casts like nekomimi girl, oni girl, well-endowed glasses girl etc. Great eye-candy if your a guy.\\n\\n\r\nSound was awesome for me. Like it could be all-peaceful and stuff, and then WHING WHANG WONG the action just ESCALATES out of thin air. It's the kind of in your face music and sound effect that I really like.\\n\\n\r\nOverall, my only complaint it that it's too bloody short and I couldn't get enough of it. So what the hell are you doing reading this bullshit? Get off your rockers and watch it now.\\n",
            "date": "2014-06-05T22:56:00+00:00",
            "helpful_count": 25,
            "mal_id": 146053,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/98303.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kuity",
                "username": "kuity"
            },
            "url": "https://myanimelist.net/reviews.php?id=146053"
        },
        {
            "content": "Upon gazing at the ridiculously short synopsis and the total episode number, I was convinced that there is nothing too special to see here. And looking back on complaints with its first run five years ago under “Yozakura Quartet,” I was skeptical on how this reboot will deliver. How wrong I was; this anime left me with a lasting impression. You might have been put off too, but don’t back away now, because the simplistic synopsis is not all what this anime has to offer.\r\nGiven the synopsis and thirteen-episode span, I was led to believe that this anime’s storyline wouldn’t get past a good mark.That proves to be quite true when it isn’t so often that the characters do their duties of kicking butt and defending the city and rather spend time dilly-dallying with ramen and swimming pools. But when they do, it is quality over quantity in this case, and each few moments of action deliver well as it also continues from building on one event to the next within the mastermind’s hands. Coupled with the soundtrack ranging towards some snazzy rushing tunes, the action is displayed well when the characters do their duties. Animation-wise, the fluidity is crisp and well-done in the fights; that makes the very few fights in this anime to have some high quality features. The amusing methods that each character employs in battle could be as outlandish as it is enjoyable (epic too).\\n\\n\r\nThe action and animation are eye-catching, but when it comes to plot concerns, the anime comes to a slow crawl that later picks ups half-way. The characters are confined to one area (their city), and the plot only demands action when there’s a crazy hub-bub that wants to destroy the peace. By the synopsis’s implication, it is as if the anime is to be mainly packed with constant supernatural skirmishes every episode with new villains. That isn’t what it truly offers though. Now what does this anime offer that makes it entirely unique? Characters that transform this shounen into something different.\\n\\n\r\nThe scope of the anime doesn’t primarily zone in on action, fanservice, and comedy, the scope seems to zone in on the characters. These types of characters aren’t exactly impressive, but the anime does create a sweet character depth and also pokes into their relationships with the others. It tends to poke into the themes of expectation and burden, especially in regards to Akina and Hime. And it does exploration for all characters along with suiting music. For a shounen anime in a fantasy setting to have slice-of-life themes in its mix, it does so pretty well. Their backstories are explored and the viewers are now given some emotional attachment to them if not all. \\n\\n\r\nI think this is impressive for a thirteen-episode shounen anime. It was as if Yasuda Suzuhito was trying to implement slice-of-life themes here instead of typical shounen ones. Usually, viewers are already drawn to the convictions of shounen characters, but the convictions for these characters are not so hero-like in the traditional sense. They appeal to nearly real-world internal struggles that people tend to face in their days. The character arcs mainly focus on that, few episodes are dedicated to that as well. Forget about never giving up and protecting others, Yozakura Quartet is a mixed-bag of slice-of-life themes presented in a shounenesque way. \\n\\n\r\nThat is all it can ever be though, a mixed-bag. And I don’t think that is a subjective term for this anime. As convoluted as to where the focus and drive of the anime is as a whole, it seems to do it justice, and it probably was intentional. The OP song is breathes in excitement and merriment which links to the seriousness and cheeriness of the anime, while the ED song seems to remind us about how important the characters’ state of minds are to give an impact to the series. This is done in many anime I’m sure, but the songs do help with what the anime is about with the moods that the songs bring out. I think it is hard to pin down where the actual focus is, but the fact is that the characters are what run the show with every importance. Quirky, yes they are. Deep, somewhat so, and that level of depth should be tolerable and forgivable.\\n\\n\r\nWhat’s even more respectable about Yozakura Quartet: HNU is that it does not suffer from a genre identity crisis. It does not try too hard for one thing, so it shoots down expectations from any side of the genre spectrum by balancing and shifting between action and play while it maintains the charming and optimistic childish aura that it exudes in even the direst situations.  But that does not stop it from being critiqued on its ‘apparent’ potential, for I can see people wanting it to go beyond its mediocre interplay between the genres. So look away now if you are the viewer who is looking for something along the specific lines. Yozakura Quartet: HNU is not made for that. It’s made to appeal to those who are looking for something ‘different.’\\n\\n\r\nThe efforts made into this anime shine pretty well with intended mediocrity. The mixed action and character back-stories are the crux of the series, but plot-wise, viewers who start watching will finally be ‘rewarded’ for the real story behind this special town and the clouds that are beginning to storm in. \\n\\n\r\nThe storytelling is not so stellar, for the actual mystery and interesting info are only touched upon near the end of the anime, and towards the end, the whole setting and continuing devices of storytelling becomes even more predictable. There will still be the same kind of conflict, but with more detail added on regarding the secrets behind certain main characters. One should keep in mind of the true story that this anime is trying to tell. Although unfinished, from start to end, it has left me satisfied with anticipation. This makes the story tolerable somewhat, and it ought to be excused.\\n\\n\r\nWhat is a tad inexcusable is the anime’s way of evoking emotion from the viewer. Even typical shounen anime can rally a nearly absurd amount of sympathy and emotion from. The way that this anime tries to evoke some sympathy is half-baked and isn’t dramatic enough. This clash between shounen and slice-of-life doesn’t work too well in the emotional department. What it does instead is to create an understanding of the characters, not to create sympathy for them. There isn’t anything wrong with that, but expectations and standards are not appealed. I think because many viewers are already used to specific slice-of-life and shounen anime, the result that this hybrid-genre anime gives off remains unfulfilled. That makes it’s ‘mistakes and flaws’ hard to accept was the reason why I even considered dropping the anime, but the important thing is that this is what this breed of an anime is trying to do.Even though the anime tries shoot down expectations, handling that with an open-mind could take some effort into getting used to. That may put off some people from continuing to watch.\\n\\n\r\nNevertheless, this is a decent anime with my enjoyment stemming from the fights and the internal conflicts that the main characters have. It personally did not make me strongly react, but I can’t help but admire at what it does. Had it did evoke a strong reaction, this anime would have deserved some more praise, but it does what it does somewhat well, and it works. \\n\\n\r\nAt least the captivating art style helps make up for its ‘mediocrity’. The city gives off a fresh feel of security, while at night it turns mysterious and dangerously exciting. Characters are not glazed like porcelain dolls, for they are more akin to the cleanliness of Durarara. It also packs a similar atmosphere, but in a more merry way. Given the whole convoluted feel of focus and whims, the art style definitely fits with the plot’s antics. The anime is like a bowl of piping hot ramen (Hime’s favorite food), a meal that combines a variety of tasteful ingredients where taste and flavor are balanced (although the overall quality might be something to gag at depending on personal tastes).\\n\\n\r\nBut does it appeal to you? Who knows. Just hope that you get a good flavor from that mixed-bag of tea. It just might be your cup. And it is gladly mine. Give it a try and you’ll be in for a lasting experience, for better or worse.\\n\\n\r\n*NOTE: When watching this anime, the OVA Yozakura Quartet: Hoshi no Umi takes place prior to Episode 9 and after Episode 8.\\n\\n",
            "date": "2014-01-01T03:29:00+00:00",
            "helpful_count": 19,
            "mal_id": 126609,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2533161.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/reversereality",
                "username": "reversereality"
            },
            "url": "https://myanimelist.net/reviews.php?id=126609"
        },
        {
            "content": "Man, this show has everything: a vibrant art style, a sufficiently interesting premise, a diverse cast of characters, a series of pulse-pounding action scenes with fluid animation, a good mix of humor, and of course, a healthy amount of fanservice. So need I say more about this show when it seemingly has everything good going for it? For the sake of a longer review, I do.\r\nThink of it this way. In reference to the title, a “quartet” can only pull off a beautiful performance when all four musicians play in sync with each other, complementing each other’s melodies to create the perfect harmony. It isnot about one musician playing exceptionally better than the rest. Everyone has to make compromises and work together to get the perfect sound. The same idea holds true for anime as well, in that it doesn’t matter how beautiful the art is, how profound the story is, or how interesting the characters are; if these components do not mesh well together you risk getting a bland mishmash of an anime that just leaves a bad taste in your mouth. And that is exactly how I feel about Yozakura Quartet: Hana no Uta. \\n\\n\r\nYozakura Quartet: Hana no Uta struggles to figure out its identity\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nThe show struggled mightily to find the perfect balance between all the different genres it tried to be: at times it tried to be a serious fighting anime, other times a shoujo romance anime, and sometimes a lighthearted slice-of-life anime. Not to mention, Yozakura Quartet: Hana no Uta was only a 1-cour, so the director didn’t have a lot of space to work with. As a result, I was questioning the identity of the show throughout because the show just felt like an awkward mix of genres that the director was trying to force to come together.\\n\\n\r\nThe starkly different pacing between shounen and slice-of-life anime not only messed up the pacing of the plot progression, but also messed with the “rhythm” of the show, especially towards the later episodes. Even in the midst of the fast-paced action during fighting scenes, slow-paced dialogues and tension-breaking humor would completely ruin my immersion to the whole scene. For example, for every little bit of fighting that went on there would be some sort of flashback about the villain or character in question. When the fight could have been over in about five minutes or so, Yozakura Quartet: Hana no Uta managed to draw the fight out to almost a full episode or two instead, showing long flashbacks that didn’t really add anything new to the characters or the villains. Yozakura no Quartet: Hana no Uta pulled no such miracles in terms of striking the perfect balance between several genres, and the inconsistent pacing that came about as a result broke my immersion to the show.\\n\\n\r\nThere is a severe mismatch between the amount of fighting and the villain’s purpose\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nThe show also had trouble trying to match its flashy action to a meaningful purpose. Every single villain that appeared in this show, except the main villain, had laughably trivial goals. The main villain was the only typical villain that wanted to achieve some form of “world domination”; the rest of the villains pursued explicitly personal interests that were as minor as wanting to reunite with a long lost sibling. And simply because of the fact that these personal interests involved our main protagonists in some way, there would be an “epic” showdown between the protagonists and the villains. As a result, there was a severe mismatch between the excessive amount of action and the triviality of the villain’s goals. The villains rightfully seemed menacing and intimidating when they were first introduced. However, once their goals were revealed, I skipped almost the entire arc and all of its beautifully animated fighting sequences because the end result was painfully obvious.\\n\\n\r\nThere is hardly any time for character development\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nWith the story rushing right along and the fight sequences taking up the majority of the show’s screen time, there is hardly any space left for character development. With a relatively large cast of characters, I was expecting a more character-driven plot with developments primarily focused on our main protagonists. Instead, the priority of the show goes mostly into fighting and exploring the backstory of the villains more so than the protagonists. Additionally, for each arc the focus of the character developments are on the secondary characters rather than the main protagonists, so there can be a loss of immersion because most viewers want to learn about the protagonists they always see on screen more so than secondary characters that appear in just a couple of episodes. \\n\\n\r\nWhat also hurt the character developments was the rather lukewarm development of romantic relationships between certain characters. Especially in a 1-cour anime with barely enough room to fit in a bunch of fighting scenes and character developments, the romance felt pretty random and unnecessary (even if it was just staying faithful to the original work).\\n\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nNow, after having said so many harsh things about the show, would I still recommend Yozakura Quartet: Hana no Uta? Absolutely.  I was not at all being sarcastic when I said that this show had everything. The art style is modern, young, flowery, and captivating; the premise is something we have already seen before but with a slightly different and interesting take; the fighting animations were exciting to look at, despite the large amount of fight sequences throughout the season and both OVAs; and finally, the humor was spot on for most of the show and the panty shots (and other forms of fanservice) were not too “in-your-face” about it.\\n\\n\r\nHowever, my main complaint was that even with all these individually promising components, Yozakura Quartet: Hana no Uta had a difficult time combining said components in a way that works. Just like how it is difficult to mess up a dish with Grade A ingredients, the director took great components of this show and just failed to add the right amount of spices. Regardless, the show deserves some attention for being one of the better reboots to a series and deserves credit for all of its positive aspects. \\n\\n\r\n*^*^*^*^*^*^*^*^\\n\r\nStory: 7/10\\n\r\nCharacter: 7/10\\n\r\nArt: 10/10\\n\r\nSound: 7/10\\n\r\nEnjoyment: 7/10\\n\\n\r\n*^*^*^*^*^*^*^*^\\n\r\nOverall: 7.4/10",
            "date": "2015-03-27T08:54:00+00:00",
            "helpful_count": 11,
            "mal_id": 183615,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2726597.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pakoko",
                "username": "pakoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=183615"
        },
        {
            "content": "What do you get when you mix a weird and refreshing supernatural setting with cliched shounen character backgrounds and battle elements? When you mix a solid plot-line having interesting aspects with unnecessary and distracting fan service? And add pleasing art style & character designs with diverse yet quite unoriginal cast of characters? Apparently you get this show, which, as these mixtures suggests is a flawed yet quite an enjoyable experience at the end of the day.\r\nThis is not the first adaptation of the manga, there is a previous series as well as OVA's; but quite thankfully for someone new wanting to join the excitement youdon't need to watch those to understand the show as it starts the story anew. The plot setting is a town where humans and youkai leave together and the focus is on a group of teenagers with their \"Hizumi Life Counseling\" agency which tries to keep the peace in town. That sounds a somewhat weak plot, right? But the story actually gets way too deep reaching various dimensions with the detailed background of the characters as well as the city while we go through their struggles each and everyday for a peaceful environment for the inhabitants.\\n\r\nIn a very entertaining and unique way, we slowly learn about the town's past; how it is very different from the ones surrounding it; how it actually came to be; and what motivates not only the agency but even the general populace of this unique town to strive to keep their town safe. Another aspect is the general flow of the story as it moves forward in a wacky fashion, we get supernatural battles suddenly turning into some characters goofing off which then again suddenly turns into an emotional back-story revealing sequence. There are episodes in which you will get a bit bored with unnecessary fan-service galore to quite suddenly finding out some key back ground information's and character development. While this general bizarre and unorthodox approach is quite fun mostly, at times it is quite frustrating to get distracted by a sudden focus on undergarments in between an intense fight sequence or storyline revealing; and through some of this forced ecchi elements we really feel a bit sorry for the directors trying unnecessarily to give the show that appeal of commercialization which quite frankly it doesn't actually need. \\n\r\nDespite many flaws and general lack of explanation of some of the confusing plot points one feels that this is a show that might have really done well with a few more episodes at the least; so there grows a general want of more after watching the show and quite surprisingly this adds to the overall enjoyment as the writers never really gave a cliff-hanger ending at all (although not really settled ending at all).\\n\r\nThe story gets a 8 out of 10.\\n\\n\r\nWhile not totally original at all, the diverse and somewhat big cast of characters with a general lack of actually focusing on anyone is one of the strongest points of the show. Despite the synopsis stating only four main characters, this show is not limited to that at all. In fact there are quite a few number of characters which gets focused up on, to the point of the show not really having any main characters, and that is very interesting indeed. There are episodes focusing on a specific character and even total lack of otherwise important ones, but these just add to the diversity of the characters even more.\\n\r\nHime is the town mayor and might be called the main female character who is somewhat like our typical shounen heroes with her trying to save all attitude. But there is also the funny aspects with her huge appetite and the song she sings, later on during the show although her character gets a little more depth but never really is able to transcend the trope of shounen cliches. Akina can be attributed as the main male character and is overall one of the interesting ones with his somewhat tragic duties and his interesting lineage & back-story, but then again he also falls into the typical category's as despite sparks of development his character never really leaves the trope. Other characters including Ao, Kotoha. Kyousuke, Touka, Juli and even the antagonists also really suffer from general lack of originality.\\n\r\nBut despite the flaws credits is due to the writers for giving each characters almost the same amount of care and trying to give viewers the overall experience of enjoying a total story from various viewpoints as well as having various sub-plots rather than being focused on only one person.\\n\r\nThe characters gets 7 out of 10.\\n\\n\r\nDespite being visually pleasing the artwork never really draws attention to detail, it is not particularly lacking in anything but actually can't command appreciation while we are being focused on the interesting story. And the art style never really adds that much to the experience as a whole, but rather distracts and annoys with its overly endowed females and unnecessary shots of undergarments. \\n\r\nWhile it could have been better if the art somehow added to the supernatural elments of the show, the battle scenes were done nicely with fluid animation but then again never really adds anything to the intensity either (the dialogues does that job better). \\n\r\nSo this gets 6 out of 10.\\n\\n\r\nThe music/soundtrack is also an overall mixed bag, as the battle themes or music during these intense sequences were quite nice yet the overall in-show music again fails to really catch attention or even provide any factors for the enjoyment of the show. The show screams the need of having nice music but somehow the compositions never really gets there, despite a few glimpses of nice melodious piano pieces and guitar works.\\n\r\nThe OP is quite catchy and memorable which tries to focus on the wacky aspect of the show and somewhat succeeds, The ED on the other hand really lacks in aspect of its enjoyment and is rather boring with its apparent approach at the emotional aspect of the show which never really shines as a matter of fact.\\n\r\nThe voice acting was quite appropriate but special mention should be given to the seiyuu of Hime as she does a splendid job of representing the character.\\n\r\nOverall it gets 6.5 out of 10.\\n\\n\r\nAt the end of the day, while not being that original in its character department and never really shining with its animation and music the show really has an enjoyable story-line which can be said to have the characteristic of always keeping the enjoyment going. The general overuse of unnecessary fan-service is one of the main factors holding the show back from being something beyond good but despite it all the viewers are left with a wonder for what to come next (despite the writers never really trying too much with any cliff-hangers or something like that) and might really do well with a second season after the manga is completed.  \\n\\n\r\nOverall Score -\\n\r\n                         7 out of 10.",
            "date": "2014-01-02T01:20:00+00:00",
            "helpful_count": 9,
            "mal_id": 126783,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238266.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/post_human",
                "username": "post_human"
            },
            "url": "https://myanimelist.net/reviews.php?id=126783"
        },
        {
            "content": "This review is only on the Sound, as i agree with almost every other review, so read those instead :D\r\nApart from beeing very outstanding overall, what struck me most in this anime was the sound.\r\nI cannot really describe it, but the OST is getting used very fittingly everytime.\r\nThere are scenes where its completly silent (because nothing is happening) and then the sound just explodes.\r\nThe Soundworks and volume is just as extreme as other parts of this fantastic anime, when a wall gets broken near the camera, it tries to break your speakers/headset.\r\nThat felt very refreshing, because every other series i watched limits the sound tofit the picture.\\n\r\nI can only recommend this anime.\\n\\n\r\nPS: I was also very surprised about the end, but its a very good end.",
            "date": "2015-03-29T12:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 183949,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4348853.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/h3ndy",
                "username": "h3ndy"
            },
            "url": "https://myanimelist.net/reviews.php?id=183949"
        },
        {
            "content": "*NOTE BEFORE WATCHING THIS ANIME PLEASE READ THIS*\r\ni thought i should mention this cause no one told me about this before i started watching. to fully watch the anime u have to watch the yozakura no quaret OVA hoshi no umi after watching the 8th episode because though listed as a side story it is actually important to the story because it introduces a new character and builds up on a present one.( though u can get the general idea from the op of the 9th episode it feels a bit confusing) this was probably cause due to constraint on the number of episodes.\r\n*END OFNOTE*\\n\r\nREVIEW: \\n\r\n          okay so after watching this series i have to say that it was a wonderful experience. this show is a hit or miss kinda thing but for me its a hit. this show has everything comedy, badass fights with fluid animation and a very intriguing plot, some healthy fan service( no serious echi like HOTD or HDxD, its relitavly decent and if ur not into that then easy to overlook). these are the reasons i liked it for me the entire thing brought multiple elements together very well. Many may not agree with me but as said before this is a hit or miss sort of thing even if i loved it there is no guarantee that u will.\\n\r\n           Now for the bad parts if i had to say there wasn't much i didn't like...... the sound was amazing the art was amazing the characters were amazing so u might be thinking why i only gave this show a total score of 8......well the answer is simple it just didn't have that bang that u feel when u finish a masterpiece  the reason for that is because it is based on a manga and the manga has not ended, thus the series has not ended, therefore it dosnt answer most of our questions and is left incomplete . Not to say that the ending was bad the  anime ended satisfyingly enough it just doesn't have that much of an impact like kyousou gigia or kyoukai no kanta or gurren lagann because it simply isnt over . That is the only thing that is preventing me from giving it a 9 or maybe just maybe even a 10 . Needless to say when the series ends it will probably be something great this is actually just the initial portion and is your general \"our fight has just begun\" type of thing( thank god they don't use that dialogue at the end like so many other anime). HOPE THIS HELPED U AND HOPE THAT U LIKE THE ANIME :D",
            "date": "2015-04-26T16:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 186540,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3915961.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sledge260",
                "username": "Sledge260"
            },
            "url": "https://myanimelist.net/reviews.php?id=186540"
        },
        {
            "content": "Yozakura Quartet: Hana no Uta has almost everything you'd expect of a shounen anime. Cute girls that kick ass, tsundere, characters with their own extraordinary powers, devilish cool-looking antagonists, dope fight sequences, high tempo music, blasting sound effects and fanservice. Almost all the ingredients you need for the shounen anime you can get hyped and drown in awe for is prepared, then it all comes down to execution.\r\nTL;DR\r\n-----------------------------------------------------------------------------------\r\nStory(7/10) + Character(6/10): I am particularly a plot maniac when it comes to anime so it could be the very reason why I gave this show a 6. Plot-wise, Hana no Uta really has nothing much to offer.What does our MCs and friends do? Protect the town and discover more about the dark world they are against, or at least that's what I expected it to be. What this show does is some kind of Team Rocket symphony, bad guy shows up, gets gangbanged by the good guys, proceeding to retreat without leaving any real damage or threat. They do this over and over throughout the whole show, and the only achievement they got from this is actually just introducing our characters' powers and prowess. Almost nothing is exposed about how the daemon world is like, and why some daemons randomly reach the human world. And this repetition comes with the cost of making the antagonists look underwhelming as a threat, slowly murdering my expectation of how the story will turn out.\\n\r\nThe lack of plot progression nearly convinced me that the show could be in the slice-of-life genre. Half of the time characters are just interacting with each other and doing a sit-com. Speaking of comedy, this show has only two or three occasions where it managed to throw a punchline. The rest of the comedy relies heavily on our cutie girls interacting with each other and doing dumb stuffs, which is too weak to be considered comedy.\\n\r\nRegardless of the lack in direction on plot, it is still interesting to discover the special abilities of each character.\\n\r\nCharacter development is evenly distributed for everyone. We get a little touch on each character's past and learned their personal desires which drives them to be what they are. Sadly, what they are often portrayed as are just a bag of happy-go-lucky teenagers ruling their lovely town. I can pick three girls out of all the female cast(there are only three main boys), put them in a bottle, shake it up and you will have a hard time distinguishing who is who in the end. Because they act all freaking cute and cool all the time, hardly showing distinct motives or principles behind their perseverance to protect the town. Ironically, the side characters actually got themselves one or two episodes worth of backstory while the main characters only get a few minutes flashback. After watching the show, I found myself more fond of the side characters than the main ones.\\n\\n\r\nArt(8/10): Pretty much the only thing worth the praise for the show, Hana no Uta has a solid art style on drawing the characters. Although all of them has quite the same facial feature, the simple yet unique design of the characters makes it easy for audience to directly recognize them even from afar. The show also frequently switches camera positions, meaning more angles of perspective on the background. It's hard to get bored even though the plot is moving slow as the camera gives us a tour on every corner of the town. Art is consistently neat and colorful, never failing to appeal my eyes. \\n\\n\r\nSound(6/10): Hana no Uta for an action shounen anime, is surprisingly quiet and calm in the music department. The background music volume is a lot lower compared to dialogues & the sound effects, and was remained that way throughout. When the MCs shouted some cliche lines, the music tempo and volume got higher for 50% and that's it. Never you'll hear an iconic soundtrack tsunami-ing a climax scene and never a trumpet sounded for the victory of battle.\\n\r\nAll I can remember listening from the fight scenes is the endless spamming of ear-raping sonic booms(they even made a middle-aged man charging go \"bMmmMmm!!!!!\" too). Hana no Uta loves that shit! They conduct every attack blows with sonic booms and the stronger the attack the more ear-raping it gets. These sound effects disrupt the music a lot, so they lower the music volume to a point it doesn't exist. Due to that, Hana no Uta's fight scenes are all just pure strength no emotions, leaving a lot to be desired.\\n\r\nThe voice actors never succeeded in being comedic(since I never laugh at any joke attempt), yet they did their job properly on acting moe and cool.\\n\\n\r\nExecution(3/10):\\n\r\nThis is the biggest disappointment of the show. \\n\r\nAt first, they alternated chronological order of the scenes a little so things look more interesting, but instead it feels lackluster because these gimmicks are supposed to be used on mysterious or climax scenes to make audience go oooooohhh when the card is revealed. After a few episodes the show realized it doesn't work well, because they never had any intense scenes and important revelations to begin with, so they ditched the plan.\\n\r\nThen there's fanservice, this shows spits boobs and panties scenes almost every 5 minutes. It was fine, until a certain point when things starts to get tense and... KABAAAM! Here's a panties shot for ya fam! I don't even know what I am supposed to feel then. All the seriousness built up got demolished in a split second just for an unlewd panties shot. \\n\r\nSame goes for comedy, they make the characters act cute or stubborn in the most unfavorable situations possible, characters would show no fear and respect in front of an enemy which lead me to an impression that the antagonists are just small fries, there's nothing to get worried or excited about. Turns out it is, our cutesy boys and girls foiling each and every scheme the bad guy does without any consequences. \"Team Rocket blasting off again!\" \\n\r\nA lot of scenes could have been great if they just give the fanservice and moe acting a rest.\\n\r\nTimings on the action scenes are really slow, one fight can linger for more than 3 long pauses with lots of lots of pointless dialogues which loses a lot of momentum.\\n\\n\r\n------------------------------------------------------------------------------------\\n\r\nTL;DR\\n\\n\r\nEnjoyment (6/10), Overall (6/10):\\n\r\nMusic is the voice of a show. Hana no Uta despite all the pretty pretty art and decent animation, they don't have a good variety of soundtracks accompanied to amplify the emotions conveyed by the characters. And even worse, the volume of music got undermined by sound effects too often.\\n\r\nThe action scenes are stalled, having too long of pauses in between, losing the momentum and hype.\\n\r\nCharacters are shallow and have very little expression of their personalities. A lot times they act of out character just to complete the show's shounen vibe, gives me tons of cringe.\\n\\n\r\nI am so disappointed in this show I wrote my very first MAL review for it. \\n\r\nYozakura Quartet: Hana no Uta is a show filled with moe girls, with poorly-paced action sequences. If you want to get the shounen anime hype, this show will disappoint you.",
            "date": "2017-08-17T18:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 255694,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6490210.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EasyRant",
                "username": "EasyRant"
            },
            "url": "https://myanimelist.net/reviews.php?id=255694"
        },
        {
            "content": "This anime was a mixed bag for me. I haven't seen the original show, so my experience with this franchise is based entirely on the reboot. Yozakura Quartet had a good story set up going on, but that was it. I feel like this anime feel short, it didn't really go anywhere. There were all these clues leading to this big climax, but in the end it felt like nothing had really happened and nothing got accomplished. Yes, it think the story was good, I just would've liked to get more out of it. This series could probably have benefited from being slightly longer.\r\nThere characters,however, are what really make the show. There are a lot of them, most introduced within the first few episodes, and it's a diverse, fun cast of characters. Hime and Akina were handled nicely, but I would've liked to see some more of the side characters get more back story or development.\\n\\n\r\nThe animation was nice as well as the art style. The opening and the ending song were both catchy.\\n\\n\r\nDespite my problems with this show, I think it was actually very enjoyable and was fun too watch. How, I'm going to give this anime a score of 6/10. Good, but I felt like it could've been a lot better.",
            "date": "2014-02-01T23:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 131101,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1235213.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SushiUnlimited",
                "username": "SushiUnlimited"
            },
            "url": "https://myanimelist.net/reviews.php?id=131101"
        },
        {
            "content": "in my opinion yozakura quartet is one of the most underrated shows of the 2013 fall season, what makes it even worse is the fact it's not very known among many people. just by looking at the members amount down in this website you will understand what i mean -almost 16000 members, compared to a 30k or 40k one can tell it's insignificant-. so as a result after watching this series along with its OVAs i decided to write my thoughts about it.\r\nwell then, as many of you may know yozakura's adaptation is manga written by Yasuda, Suzuhito and still on going. before the seriesstarted broadcasting in 2013, it already had 3 OAD featuring one of the events that occured in the middle of the story -Yozakura Quartet: Hoshi no Umi-. i wouldn't call it a prequel nor a sequel, but as an advice watching those 3 OAD after episode 8 and then going back to the remaining 9-13 episode would be a perfect way to avoid confusion and progress in a good pace. now going back to the story, Yozakura Quartet: Hana no Uta has quite the familiar plot. humans and youkai living at a town that provide them with what other places doesn't, you probably heard about this kind of setting somewhere -touhou project as an example-. however unlike many of those shows, here human and youkai are co-existing with each other, expecting some bad people who are against this way of life to appear is meaningless. this town is protected by hime the mayor and her group who most of them are 16 years old or less, but we can always turn a blind eye to this matter..at least I could. now, here is something i couldn't let it pass: in the middle of watching the first episode i started doubting wether if it's really the first or just renamed as 01. in other words the story started in a blurry way, that initial narration description that shows what's going on in the series doesn't exist in yozakura, so as result the characters, the stats of the town, all of it is presented throughout the flow of events. and to do that, they made use of the cast by making them ask some blunt basique question they're already supposed to know its aswer represting by that the doubts and uncertainties of the viewer. to be honest i find it to be annoying, i mean sure the confusion of the viewer should be cleared however isn't ther any other way to clear it? \\n\\n\r\nalright, if i was asked what is the main aspect that i liked about yozakura story my answer would be its half-seriousness. the fact that after every huge battle things end up in a good way, the following day everything gets back as if nothing happened. the fact that every antagonist instantlly bacomes one of the supporting cast after he's defeated. or even those punch-lines inside of a battle that should  be serious, this kind of aspect makes the best out of the show, everything is joyfull, no one dies...all in all nothing of tragedic happenes. while for some other people that may look as a down side, for me i say this kind of things is not bad every once in a while...if considered as change of pace.\\n\\n\r\nas for the cast of characters, stating that they're unique or first of thier kind would be an exaggeration. at least they're various, the mayor of the town: a 16 years old high school girl and a glutton, her way of wearing a long scarf makes you mistook her as a ninja while she's actually a spear using youkai. there is two glasses bishounens, hiizumi akina the head of the hiizumi family whose hair grow up in a mysterious way when using his tuning power, and of course Ao the cat eared loli with the ability to read minds - one can not simply hate her-. one of the upsides of the characters is their cloths, especially eiji and enjin's. the style of these two is what you'd call badass looking. yozakura also brings another warm theme with it, it is the teamwork/friendship wich personally i didn't stumble upon it for a while until now, those exiting moments where the whole group decides to kick someone's ass and then they proceed to execute an unknown plan that demands time for the viewer to figure out, yet doesn't clear out until the end, - it kinda reminds me of some one piece arcs tbh-\\n\\n\r\ni stated earlier something about half seriousness, getting back to this subject i find it to focus mainly on characters. no matter how much of a bad person someone looks in the end he ends up being an ally of the protagonist casts even if it's only temporary. the same applies with enjin, at the end he decides to stop his series of troubles after helping akina to avoid death, even if it was in an indirect way. another matter that felt out of place again is the way Yuhi Shinatsuhiko is acting, trying to look cool with that pattern of talking and the cigarette in his mouth...sure he is the god of that land but that way of talking duud it's unsupportable! the background of hime, akina and juli were well explained and didn't feel like those blunt questions i mentioned earlier and guess what kyousuke's voice was the same as shizuo from durarara, actually the whole person was similar to him -lifting heavy stuff per example- coincidence? probably that's not the case.\\n\\n\r\nfrom a visual yozakura did a decent job at in the animation, it's the only aspect i cloud declare as unique. i doubt you will find another series featuring the same animation as this one. there's that one scene where enjin got beaten up by everyone, it had a great view, many effects were used to show how bad he got rekt before disappearing again. the show also had plenty of panty shots....perfectly timed panty shots! especially ao, it was enjoyable to grasp her striped panties every once in while.*cough* i shouldn't be talking about that right? well asides from that all what remains is the lightning effects from behind, they're a little bit rare however they make the scene looks more serious and decent.\\n\\n\r\nthe OP and END surprisingly were great, they got the joyful feeling in them. the voice actors were pretty much spot on form most of the characters got nothing to say about that. some of the sound effects like the lightning, or that mysterious blue atmosphere that frequently appear makes you feel a chill running down your spin, calling it an achievement wouldn't be wrong.\\n\\n\r\nhumu, in the end thinking of yozakura as a serious magic/supernatural show will only deceive your expectation. however thinking of it a comedy/superpower show where youkai and humans faces conflicts and try to solve them together, so that the following day they would pretend as if nothing happened...i guess that will work. personally i find yozakura to be one of the best shows out of it's kind there's a tiny romance subplot going on with the every day adventure of the team. there's a warm feeling of friendship going on between the characters, everything ends up in good way, no need to struggle that much to figure out some uncertainties, no tragedy no drama, it's the best way to take it easy while watching an adventure show. highly recommended for fellow slice of life lovers.\\n\\n\r\ntsun tsun dere tsun dere tsun tsun.......(you will understand what  i mean by that later)\\n",
            "date": "2015-11-14T13:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 203357,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4085373.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/reizenchuu",
                "username": "reizenchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=203357"
        },
        {
            "content": "Yozukara Quartet: Hana no Uta is one of the most underrated anime and needs to be more known to the community.\r\nThe show starts off with quite a bizarre start. Giant fish tanks and then all of a sudden a flock of pigeons. This is done to confuse the viewers. It then transitions to a highly attended Sakura Festival showing the happiness and enjoyment the people are having in the festival. The story is told in a steady episodic flow with occasional flashbacks to fill in plot holes due to the lack of explanation in some scenes. Being only 13 episodes, the pacing is bound tobe inconsistent. Sometimes there is an episode solely to describe a character’s back story and being only 13 episodes, that takes up a lot of space which leaves not enough room for other plot details. This leads to the sense of the show being rushed and leaving a lack of explanation in some scenes. The lack of consistency with the pacing of the show is one of the shows downfall. This is, however, masked by the comedic aura the show emits almost to the point where the isn’t the main focus of the quality of the anime. It is also quite a light-hearted series, so deep plot details aren’t needed and would take away the light-heartedness out of the series if it focussed more on the plot. The action/fighting scenes are really fluid and are pleasing to watch. This show prioritises the action over the plot while including aspects of comedy to make up for the lack of plot content.\\n\\n\r\nThere is nothing “jaw-dropping” about the art. The art is somewhat similar to what you would see in a hand-drawn comic book, with the noticeable black outlines of an object or a figure. The art is quite different to the norm of what the studio, Tatsunoko Production, usually makes. They’re more well known for the sci-fi futuristic technologic animations. Although the art style looks “lazy” with lack of effort put into it, it does fit with the shows story. It adds to the comical effect the show tries to achieve, Some of the female characters are depicted more secually than necessary. There are occasional panty shots, clothes that “show skin” and are quite revealing but it isn’t to the point where is provides a lot of “fan-service” and is far from being an ecchi anime. \\n\\n\r\nThe Japanese voice actors were generally good and fitted their characters they voiced. It fit the personality the character was portrayed as. The soundtrack was also quite solid. The background music played in between scenes fitted its purpose, providing scenes with a more vibrant “colour”. It especially made the action scenes more enjoyable to watch with the intensifying music playing and the added sound effects with the close-combat scenes also made the action seem more realistic and fluid. The opening to this anime was a very catchy one. UNISON SQUARE GARDEN is a band which I have been familiar with a previous anime ending they did and they did not disappoint when they performed the opening theme to this anime. The melody is quite a memorable one which will get you humming it self-consciously, especially the “all quartets will lead to the … ? lalalalalalalala” bit at the beginning. I personally like 3-piece rock bands, such as UNISON SQUARE GARDEN, as the performers usually have to play multiple instruments and roles at once due to the lack of members. Despite this, they performed a beautiful and catchy piece.\\n\\n\r\nThe one thing that stands out in this anime is the diversity of the characters. The characters were quite well-rounded. Each character didn’t seem to overpowered compared to each other. While characters’ each all their strengths; those strengths were balanced out with flaws to make sure a character wasn’t too overpowered. There was nice symbolism between Hime Yarizakura’s scarf and the friendship Yarizakura and Hiizumi share. There was a clear indication between the protagonists and antagonists of the show making the audience not need to question who are the heroes and villains of the series. There is use of amnesia which is overcome and the truth is exposed between characters and their friends. Through this, we see the contrast between Yarizakura’s supposedly strong character become emotionally weak who seems to get depressed and embarrassed when she gets scared and uses her scarf to cover up her face. The vast amount of supporting characters in the series makes the series what it is; a funny comedy jam-packed with fluid action scenes. Without these supporting characters, the show wouldn’t be as funny and the action scenes wouldn’t be as vast and enjoyable without the support the supporting characters give to the main characters while they are in the fight. Yarizakura Hime is a memorable character which I will never forget; especially that scarf (there is no way you will ever forget the beauty that long scarf provides). Yarizakura was a relatable character in my opinion as she could see both sides of the spectrum and tries to unite them as she is the only one that has knowledge of both sides and understands how both sides feel without having misunderstandings made.\\n\\n\r\nOverall, I enjoyed the action that was included in this series. I didn’t quite like the light-heartedness of the series but the show had enough comedy for me to slightly ignore the light-hearted feel. People who don’t mind watching anime with a lack of story will enjoy this anime. Non-anime fans may not enjoy this as much, as it may give them a bad impression of anime being just pure action with no real plot. I think I would consider re-watching this series as I probably missed some things the first time and when I rewatch it, there will probably be hints and hidden “easter eggs” that I did not notice the first time that alludes to upcoming scenes. I am a bit upset that this show isn’t licensed for distribution to the west so I had to deal with fan-subs, which weren’t particularly bad though. It seems this show isn’t very known to the anime community so licensing companies won’t bother licensing it as they won’t gain much revenue from it. I thought that this series was unique by itself and I liked that as it added variety to what anime can produce and achieve. The plot may not be quite memorable but the characters and backstories of them that were foretold is where the show shined and what was memorable. \\n\\n",
            "date": "2016-06-11T05:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 220481,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4441554.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fillyy",
                "username": "fillyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=220481"
        },
        {
            "content": "*SPOILER FREE REVIEW*\r\nYozakura Quartet: Hana no Uta\r\nWhat an anime this is. An anime which fell through the cracks of all the other hype anime that surrounded it during its release. Do you have a craving for a super powered over the top action? Well look no further because your knight in shining armor is here and it's name is Yozakura Quartet: Hana no Uta.\r\nStory: \r\nLet's get down to business here. If you read the synopsis then chances are, that didn't make you interested in this show whatsoever. It''s hard to describe the show without spoilers but basically follow a group of four high school friendsthat are gifted with supernatural abilities to fend off supernatural things. Really, that's all I can say. Pacing wise the story starts to move pretty quickly and is filled with action until around episode 9 where it unfortunately starts to slow down a lot but don't worry, the last episode contains a lot of action so keep on watching. The plot is there and it isn't difficult to follow but if you're looking for an engaging story line then I suggest you look elsewhere because that is not where this anime shines.\\n\r\n6/10\\n\\n\r\nArt:\\n\r\nOkay, this here, this is where Yozakura Quartet: Hana no Uta shines. I'll be blunt, outside of the action scenes colors are bright, and the characters look nice. Unfortunately it looks like they saved the budget for the action sequences. Animation is a little choppy and lacking detail here and there although at times it adds to the comedic value of the show. Now the animation during the action scenes? My goodness, absolutely incredibly. Everything is fluid, scenes are dynamic, moves are over the top, flashy, and actually look like they hurt. The animation in the action scenes is comparable to Kyoto Animations Beyond the Boundary which says A LOT.  \\n\r\n9/10\\n\\n\r\nSound: \\n\r\nNothing really notable here. Background music usually stays in the background and while not taking away from the anime, it doesn't really fly out at you either. Pretty much average stuff. Some of the sound effects are pretty cool, most notably this dubstep kind of wub which indicates **** is going down.\\n\r\n7/10 \\n\\n\r\nCharacters:\\n\r\nThe only character that really stood out to me was Akina Hiizumi. He's one of the only humans in the group and unlike everyone else in the group he wasn't gifted with insanely ridiculous power and reflexes like everyone. He has a few secrets of his own however and can really stand out compared to everyone at times. He's comparable to Touma from Toaru Majutsu no Index but I think he's way more bad@$$. When it comes to the action, no character was leagues ahead of the others which was nice. Everyone played their part in the battles and no one at any point was dragged to the sidelines and shoved in the back because other leading characters were becoming too powerful. Everyone retains their own personality which is nice. Nothing to really complain about as none of the characters are annoying and I came to like a few of them. \\n\r\n8/10\\n\\n\r\nOverall:\\n\r\nI enjoyed this anime a lot. It even became one of my personal favorites. The high point is the over the top super powered action and you see some in almost every episode so don't be scared to hop into this anime if that's all you're looking for. It's like Gurren Lagann, sit back, relax, turn your brain off and enjoy every bit of the flashy action scenes that come at you.",
            "date": "2014-09-26T16:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 162357,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4067515.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/2fastt",
                "username": "2fastt"
            },
            "url": "https://myanimelist.net/reviews.php?id=162357"
        },
        {
            "content": "Hana no Uta is a show that I like because of all the things it does differently. It consistently fails to adhere to an ordinary story pacing, and it relishes in, and often pulls off, fast tone shifts. The themes have a lot of stuff to do with demons and half-demons and whether they should be protected or banished, and yet, rather than treating this as a grave affair that propels every event, I felt more often like I was in a blended slice-of-life that sometimes has action and drama. There are story arcs, of course, but it often feels like the show and thecharacters have mutually agreed to give them lip service so that they can go do something way more interesting with the screen time. You can guess what's coming next, but you don't know what the \"good scene\" will be, because it could be anything. And the cast is large, with enough depth and variety that you can easily lose track.\\n\\n\r\nAll of this makes it less readily consumable and closed-ended than your typical TV anime, and more like a messy world you could put in the background on loop, noticing different things each time. In some ways this might feel like a deficiency of being a one-cour show, rushing through a lot more than it has any right to, but if there is any example of how to pull it off in a satisfying way, this is one of them.",
            "date": "2017-05-14T23:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 247704,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845194.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/triplefox",
                "username": "triplefox"
            },
            "url": "https://myanimelist.net/reviews.php?id=247704"
        }
    ],
    [
        {
            "content": "The Yozakura Quartet franchise has been an odd ball in the mix. Some classifies it as a supernatural comedy while others sees it as a fun series with shounen battles featuring a diverse cast of characters. While the series itself doesn’t venture too far or drag like long term battle shounen series, it does take some patience to get used to. Yozakura Quartet: Hana no Uta is one prominent example of where it’ll take more than patience to get through the show. It’ll take endurance to get yourself familiar with the themes. Once you do, you might find a little charm in this show. Asfar as that goes, Yozakura Quartet still is like a stinger on a bee that might not always work out right.\\n\\n\r\nYozakura Quartet: Hana no Uta is a brand new anime series based off of the manga of the same name. The series stands out on its own so it’s not completely necessary to watch the previous seasons or OVAs. Tatsunoko Production adapts the season that has its long history of animation production tracing back to the 1960s. Their more recent works such as Gatchaman Crowds also adapts supernatural themes into a modern life setting where everything seems normal at first; that is until the extraordinary strikes into the core of the story.\\n\\n\r\nBizarre may be interpreted as an overrated word for a show like this but it never escapes as the way it describes its style. \\n\\n\r\nThe story begins exactly as such in a bizarre way involving fish tanks, pigeons, and something we might be more familiar with – youkai. The way it sets it up makes viewers confused at first. This is especially true for viewers coming completely fresh into the show without expectations. What follows later makes more sense as we see other characters jumping into the problem and resolving it in their own little ways. They even get their rewards too such as enjoying the Sakura Festival. Because hey, we all need a break to enjoy ourselves after a day of hard work.\\n\\n\r\nIf you’re unfamiliar with the Yozakura franchise, one key factor to consider would be the diversity of its characters. Among the center of its cast are four main characters by the names of Akina, Hime, Ao, and Kotoha. While they seem normal at first with their teenager like outlooks, all of them have supernatural abilities. Not only that but one of them, Hime Yarizakura, stands as the protector of their city Sakurashin. Because youkai co-exists with humans, one should expect danger at all times as nothing is considered ordinary. For Hime, she plays the role of a guardian/mayor and the anti-thesis of a frail girl. She charges into the face of danger and puts others before herself. In one instance, she even tries to escape the hospital despite being injured. In her mind, it’s her duty and responsibility to protect the people she loves. \\n\\n\r\nIt’s not a surprise that most of the main female characters defies the typical fragile girl trope either. It’s bizarre since most of them are teenagers and aren’t fully matured yet, or at least at the age of the adolescence stage. Even bystanders at some cases that gets indirectly involved with the youkai displays some of their tendencies to help others. It’s bizarre to see on various levels with the fact that youkai are a threat to its citizens of the city yet people are willing to risk their lives. Normally in supernatural series, you would see people rushing away from scenes of danger. In Yozakura, it’s the opposite way around. But as much as fun as the series goes with its whole supernatural themes, it still falls under the typical story involving teenagers obtaining powers in a generic setting. Antagonists are stereotypical with their own ideologies and causing menace to the city’s people. Their physical appearances also reflects their actions that speaks louder than words. Although it sparks some interest at first, they can become dull as the story goes on with limited exploration of their character backgrounds or origins. It also opens up the fact that their lack of personalities gives them a hollow part to the main story. The resolution to most conflicts literally turns a villain into an ally that becomes repetitive to comprehend. While it stands out as a justification for their actions, there’s limited amount of characterization afterwards. On other hand, Akina Hiizumi is perhaps one character that has some depth with his own conditional way of thinking such as concepts involving destiny. Unfortunately, the majority of the characters in the show still lacks dynamics. The male characters are also portrayed as jokes on various occasions such as Kyousuke Kishi thanks to his powers.\\n\\n\r\nIf you’re into the story, the series does go into depth with some of its concepts. In between are some episodes that may feel a bit repetitive or oddly paced. The series itself is also only 13 episodes (one cour) but surprisingly adapts quite a lot of material from the manga in the form of packages/arcs. Along with adaptation, it even manages to insert various comedy scenes too to raise attention. While it doesn’t overly express fan service, the series doesn’t avoid with the pool outdoors. On the other hand, it sticks to its themes fairly well with the supernatural features. Although the story is predictable on various occasions, it can still be surprisingly entertaining thanks to its fluid action scenes and energy. On a more technical scale however, the story sometimes lacks details in terms of explanation. It also neglects a serious atmosphere on most occasions despite the dangers of the youkai. Perhaps the amount of energy the show possesses is too much for the story to stands for itself. Hime is just one prominent example but other characters also pours their ebullience to reflect its atmosphere. A mixed bag is also the comedy – some of them oddly coordinated while others works out quite well to make its point. This usually involves the character interactions, dialogues, and in general the way they play their parts in the story. While some characters don’t stand out as much as the others, comic relief is a prevalence of the franchise and is executed decently. Get ready to grab some popcorn, sit back, and enjoy the laughs.\\n\\n\r\nArtwork is not a prominent factor but does play a key theme to reflect its style. It’s important for the show to depict its supernatural themes. Surprisingly enough, it did pull it off in that fashion. Youkai are designed not only with otherworldly features but also giving their malevolent appearances. None of them looks the same and offers a diversity of characteristics. The way the antagonists are designed also conveys their efforts well. On the other hand, fan service sometimes gets in the way as female characters are characterized with more sexuality than they should be. The background textures also seems average as nothing stands out as extraordinary or noticeable. Hime on the other hand has that noticeable scarf wrapped around her neck with a more definite meaning. \\n\\n\r\nThe soundtrack is solid for most parts. The OST performs well mostly during its action scenes but fades in the background during more of the calm scenes. There are some emotional scenarios in the series as well and the soundtrack reflects its mood consistently. However, it lacks the concept of originality with portraying shounen battle sequences. Cheesy dialogues are inserted in during fight scenes while the whole stereotypical laughs from the antagonists are echoed in the air. The OP song is quite catchy with its presentation and the memorable “lalalala” that once again reflects its comedic mood. And as I mentioned before, there is a diverse cast of characters so each of them should reflect a different sense of tone in their voice mannerisms. Most of the characters has their standards met. Hime in particular stands out with her tone as a girl with responsibility. Kotoha Isone is also a character to take notice of because of her ability that relies on words itself that are spoken. On most parts, the soundtrack and voices works out right but nothing earth shattering.\\n\\n\r\nIn the end, Yozakura Quartet: Hana no Uta is one of those series that will strike out as bizarre yet appreciable. There’s that word again but it fits with the show right with its story, character, themes, and overall presentation. I won’t say this show is for everyone but shounen fans should definitely appreciate the style. The comedy can be appreciating with the drama and diversity of characters. On the other hand, some of the story itself feels blend or weak at various points. Its lack of character development sometimes makes the shows feels like it’s just another battle shounen on occasions. However, the energy will envelop and sucks you with its style in its Yozakurish way.\\n",
            "date": "2013-12-30T16:07:00+00:00",
            "helpful_count": 78,
            "mal_id": 126367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=126367"
        },
        {
            "content": "I will keep this review brief. I will not mention much of the story. I will just give my simple opinion on it.\r\n  Story : 8/10 - The story seems intesting so far. I thought it could have explained some things a little more though earlier though. Like with the Tuning stuff and characters. It kinda kept me wondering, or it would have if I didn't watch the original animation. By the way, I only watched some of the episodes for the original one.\r\n  Art/Animation : 9/10 - The art is really good. Same goes for the animation. However, it isnot the best. The fight are really great though. Which bumps it to a 9.\\n\\n\r\n  Sound : 10/10 - The opening sounds great. The lyrics are descent. Same thing with the ending, but I thought the ending is a bit soothing so it was really nice. But a lot of people don't listen to the OST and sound effects as much. For this particular anime, it's amazing. The fight music sounded really epic. Especially when it builds up to a climax and ends with a bang. Really nice. Also the sound effects such as the tuning-electricity sound is really awesome and the striking is really menacing (the blue lighting thing from the sky). If you don't watch this with earphones or headphones, you're watching it wrong.\\n\\n\r\n  Characters : 9/10 - The characters are really cool. Not much I can say. I really like the voice actors though. They portray the characters really well.\\n\\n\r\n  Enjoyment : 9/10 - The anime I like are usually Slice of Life, Action, Romance, Drama, ect. I felt like this anime is just right for my taste. Also the fight scenes are pretty minimal so don't expect it to be action packed, but it includes some other genres. But the sound effects, music, and fight scenes kept me replaying for a bit. Oh and there's a good BIT of fan service. The good thing about it is that the animator(s) didn't focus in on those small scenes. It was just there because it was there.\\n\\n\r\n  Overall : 9/10 - It's a great anime. Not the best in the world. But it's very entertaining. Had some moments when I thought out loud from some scenes, I replayed a bit, and was in awe in some fight moments. The music and sounds are what mostly kept me immersed in the anime though. Wasn't really any noticeable music when I just say, \"Whoa!\". It was just a mellow whoa. Them sound effects though. Whoa, epicness.\\n\\n\r\n  Well yeah. My crappy review. Anyone who read this. I respect to you for taking maybe 5-10 minutes of your life away to read this. And as you can probably tell I'm a guy who is practically in love with sound. Not as hardcore as an audiophile though. I just listen to music a lot. So I became sensitive to bad sound effect quality too.\\n\\n\r\n                                                                        Bye~",
            "date": "2013-12-18T02:02:00+00:00",
            "helpful_count": 58,
            "mal_id": 124409,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3362933.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NotableNick",
                "username": "NotableNick"
            },
            "url": "https://myanimelist.net/reviews.php?id=124409"
        },
        {
            "content": "I'll write a brief review on this one (Spoiler Free). Hana no Uta is a reboot of the original Yozakura Quartet, and in my honest opinion, you can't enjoy the reboot to its fullest without watching its predecessor, you'll miss important character information and maybe some bits of the story that might make you enjoy this one a lot better.\r\nI'll say the original was definitely not that good, the story was interesting but poorly managed and the characters could have been developed a lot better. And oh boy have they fixed it in Hana no Uta, besides the different takes with the art style andthe more common comical gags (and panty shots!), which were great additions, the series has become enormously better and more entertaining. \\n\\n\r\nStory 7/10:\\n\\n\r\nWhy am I giving a 7 here? Because the story just felt rushed. The story is great, it is interesting and has plenty of options and directions to go from, but in 13 episodes there was barely any time to extend it and have those last questions answered (even though it had a good ending).\\n\r\nThe characters had time for proper development this time, and this increased the story's value by tons. The past of Akina's and Hime's families were explained, and a lot of other backstories that I thought were missing in the original run of Yozakura.\\n\r\nMy only complaint would be that 13 episodes (mostly the last ones) were too rushed, I wanted the story to keep going, and the last episodes to be explained better and not feel so rushed. They leave us with questions at the end, it actually feels like Enjin has to wait on the producers to put his plan to action. I don't know if any continuation to the story is coming or not, but I really hope so.\\n\\n\r\nArt 9/10:\\n\\n\r\nThe art style is beautiful, the characters look stunning as well as the colouring. Action scenes did flow better than I expected and all the facial expressions were top notch imo, in comical moments as well as in serious ones. It might be a matter of taste, but for me it more than deserves this score.\\n\\n\r\nSounds 9/10:\\n\\n\r\nSound isn't my strong point. I found both the opening and ending songs amazing, the ED will give me nostalgia moments in the future for sure, it's just a great song. The OST felt fitting and in place, there isn't much more I can say about it.\\n\\n\r\nCharacters 8/10:\\n\\n\r\nThe characters were already great in the original, but lacked stories behind them, well it's all fixed now. Everything's likeable about them, and this time you can follow their stories throughout the episodes. The reason I'm not giving them a 9 is because some of the stories felt rushed, like I mentioned above, doesn't make them any less good though.\\n\\n\r\nOverall 8/10:\\n\\n\r\nYozakura Quartet: Hana no Uta works as a comedy, a slice of life and an action anime, when you put all of them together and it works, what's not to like? This is definitely worth the watch, I recommend it to anyone who's looking for a heart warming, funny and action filled story. If you watched the original, don't hold back, this one is a lot better and you will not regret it. If you didn't watch it before the reboot, you should, there's still important information in the original that transitions into the reboot without proper explanation in the latter.",
            "date": "2015-02-01T20:26:00+00:00",
            "helpful_count": 40,
            "mal_id": 179460,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4079963.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Milhofo",
                "username": "Milhofo"
            },
            "url": "https://myanimelist.net/reviews.php?id=179460"
        },
        {
            "content": "Yozakura Quartet. The quartet of the night cherry blossoms. What a resonating name.\r\nThis is another one of those shows that started off with a bang. Nekomimi girl with pantsu shot? Check. Randomly appearing huge goldfish? Check. All that crazy spiced up with a dash of ecchi. Yummy. I am one of strong believers that the start and the end of an anime are the two most important parts to get right. After all, if you don't get episode 1 just right, you're gonna lose viewers. If you don't get the final episode right, you leave a sour taste in everyone's mouth. So there's that. YozakuraQuartet. Great title. Epic start.\\n\\n\r\nCharacters were like-able right off the bat. You have the tsundere main girl who literally hums a tsundere song, sports a long-ass scarf for image which scores +1 in my book, don't know if it will in yours though, and kicks ass with a stick/spear/lacross racket. You have that usually-quiet, laid back main guy who actually secretly gives a shit. And a bunch of interesting side casts like nekomimi girl, oni girl, well-endowed glasses girl etc. Great eye-candy if your a guy.\\n\\n\r\nSound was awesome for me. Like it could be all-peaceful and stuff, and then WHING WHANG WONG the action just ESCALATES out of thin air. It's the kind of in your face music and sound effect that I really like.\\n\\n\r\nOverall, my only complaint it that it's too bloody short and I couldn't get enough of it. So what the hell are you doing reading this bullshit? Get off your rockers and watch it now.\\n",
            "date": "2014-06-05T22:56:00+00:00",
            "helpful_count": 25,
            "mal_id": 146053,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/98303.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kuity",
                "username": "kuity"
            },
            "url": "https://myanimelist.net/reviews.php?id=146053"
        },
        {
            "content": "Upon gazing at the ridiculously short synopsis and the total episode number, I was convinced that there is nothing too special to see here. And looking back on complaints with its first run five years ago under “Yozakura Quartet,” I was skeptical on how this reboot will deliver. How wrong I was; this anime left me with a lasting impression. You might have been put off too, but don’t back away now, because the simplistic synopsis is not all what this anime has to offer.\r\nGiven the synopsis and thirteen-episode span, I was led to believe that this anime’s storyline wouldn’t get past a good mark.That proves to be quite true when it isn’t so often that the characters do their duties of kicking butt and defending the city and rather spend time dilly-dallying with ramen and swimming pools. But when they do, it is quality over quantity in this case, and each few moments of action deliver well as it also continues from building on one event to the next within the mastermind’s hands. Coupled with the soundtrack ranging towards some snazzy rushing tunes, the action is displayed well when the characters do their duties. Animation-wise, the fluidity is crisp and well-done in the fights; that makes the very few fights in this anime to have some high quality features. The amusing methods that each character employs in battle could be as outlandish as it is enjoyable (epic too).\\n\\n\r\nThe action and animation are eye-catching, but when it comes to plot concerns, the anime comes to a slow crawl that later picks ups half-way. The characters are confined to one area (their city), and the plot only demands action when there’s a crazy hub-bub that wants to destroy the peace. By the synopsis’s implication, it is as if the anime is to be mainly packed with constant supernatural skirmishes every episode with new villains. That isn’t what it truly offers though. Now what does this anime offer that makes it entirely unique? Characters that transform this shounen into something different.\\n\\n\r\nThe scope of the anime doesn’t primarily zone in on action, fanservice, and comedy, the scope seems to zone in on the characters. These types of characters aren’t exactly impressive, but the anime does create a sweet character depth and also pokes into their relationships with the others. It tends to poke into the themes of expectation and burden, especially in regards to Akina and Hime. And it does exploration for all characters along with suiting music. For a shounen anime in a fantasy setting to have slice-of-life themes in its mix, it does so pretty well. Their backstories are explored and the viewers are now given some emotional attachment to them if not all. \\n\\n\r\nI think this is impressive for a thirteen-episode shounen anime. It was as if Yasuda Suzuhito was trying to implement slice-of-life themes here instead of typical shounen ones. Usually, viewers are already drawn to the convictions of shounen characters, but the convictions for these characters are not so hero-like in the traditional sense. They appeal to nearly real-world internal struggles that people tend to face in their days. The character arcs mainly focus on that, few episodes are dedicated to that as well. Forget about never giving up and protecting others, Yozakura Quartet is a mixed-bag of slice-of-life themes presented in a shounenesque way. \\n\\n\r\nThat is all it can ever be though, a mixed-bag. And I don’t think that is a subjective term for this anime. As convoluted as to where the focus and drive of the anime is as a whole, it seems to do it justice, and it probably was intentional. The OP song is breathes in excitement and merriment which links to the seriousness and cheeriness of the anime, while the ED song seems to remind us about how important the characters’ state of minds are to give an impact to the series. This is done in many anime I’m sure, but the songs do help with what the anime is about with the moods that the songs bring out. I think it is hard to pin down where the actual focus is, but the fact is that the characters are what run the show with every importance. Quirky, yes they are. Deep, somewhat so, and that level of depth should be tolerable and forgivable.\\n\\n\r\nWhat’s even more respectable about Yozakura Quartet: HNU is that it does not suffer from a genre identity crisis. It does not try too hard for one thing, so it shoots down expectations from any side of the genre spectrum by balancing and shifting between action and play while it maintains the charming and optimistic childish aura that it exudes in even the direst situations.  But that does not stop it from being critiqued on its ‘apparent’ potential, for I can see people wanting it to go beyond its mediocre interplay between the genres. So look away now if you are the viewer who is looking for something along the specific lines. Yozakura Quartet: HNU is not made for that. It’s made to appeal to those who are looking for something ‘different.’\\n\\n\r\nThe efforts made into this anime shine pretty well with intended mediocrity. The mixed action and character back-stories are the crux of the series, but plot-wise, viewers who start watching will finally be ‘rewarded’ for the real story behind this special town and the clouds that are beginning to storm in. \\n\\n\r\nThe storytelling is not so stellar, for the actual mystery and interesting info are only touched upon near the end of the anime, and towards the end, the whole setting and continuing devices of storytelling becomes even more predictable. There will still be the same kind of conflict, but with more detail added on regarding the secrets behind certain main characters. One should keep in mind of the true story that this anime is trying to tell. Although unfinished, from start to end, it has left me satisfied with anticipation. This makes the story tolerable somewhat, and it ought to be excused.\\n\\n\r\nWhat is a tad inexcusable is the anime’s way of evoking emotion from the viewer. Even typical shounen anime can rally a nearly absurd amount of sympathy and emotion from. The way that this anime tries to evoke some sympathy is half-baked and isn’t dramatic enough. This clash between shounen and slice-of-life doesn’t work too well in the emotional department. What it does instead is to create an understanding of the characters, not to create sympathy for them. There isn’t anything wrong with that, but expectations and standards are not appealed. I think because many viewers are already used to specific slice-of-life and shounen anime, the result that this hybrid-genre anime gives off remains unfulfilled. That makes it’s ‘mistakes and flaws’ hard to accept was the reason why I even considered dropping the anime, but the important thing is that this is what this breed of an anime is trying to do.Even though the anime tries shoot down expectations, handling that with an open-mind could take some effort into getting used to. That may put off some people from continuing to watch.\\n\\n\r\nNevertheless, this is a decent anime with my enjoyment stemming from the fights and the internal conflicts that the main characters have. It personally did not make me strongly react, but I can’t help but admire at what it does. Had it did evoke a strong reaction, this anime would have deserved some more praise, but it does what it does somewhat well, and it works. \\n\\n\r\nAt least the captivating art style helps make up for its ‘mediocrity’. The city gives off a fresh feel of security, while at night it turns mysterious and dangerously exciting. Characters are not glazed like porcelain dolls, for they are more akin to the cleanliness of Durarara. It also packs a similar atmosphere, but in a more merry way. Given the whole convoluted feel of focus and whims, the art style definitely fits with the plot’s antics. The anime is like a bowl of piping hot ramen (Hime’s favorite food), a meal that combines a variety of tasteful ingredients where taste and flavor are balanced (although the overall quality might be something to gag at depending on personal tastes).\\n\\n\r\nBut does it appeal to you? Who knows. Just hope that you get a good flavor from that mixed-bag of tea. It just might be your cup. And it is gladly mine. Give it a try and you’ll be in for a lasting experience, for better or worse.\\n\\n\r\n*NOTE: When watching this anime, the OVA Yozakura Quartet: Hoshi no Umi takes place prior to Episode 9 and after Episode 8.\\n\\n",
            "date": "2014-01-01T03:29:00+00:00",
            "helpful_count": 19,
            "mal_id": 126609,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2533161.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/reversereality",
                "username": "reversereality"
            },
            "url": "https://myanimelist.net/reviews.php?id=126609"
        },
        {
            "content": "Man, this show has everything: a vibrant art style, a sufficiently interesting premise, a diverse cast of characters, a series of pulse-pounding action scenes with fluid animation, a good mix of humor, and of course, a healthy amount of fanservice. So need I say more about this show when it seemingly has everything good going for it? For the sake of a longer review, I do.\r\nThink of it this way. In reference to the title, a “quartet” can only pull off a beautiful performance when all four musicians play in sync with each other, complementing each other’s melodies to create the perfect harmony. It isnot about one musician playing exceptionally better than the rest. Everyone has to make compromises and work together to get the perfect sound. The same idea holds true for anime as well, in that it doesn’t matter how beautiful the art is, how profound the story is, or how interesting the characters are; if these components do not mesh well together you risk getting a bland mishmash of an anime that just leaves a bad taste in your mouth. And that is exactly how I feel about Yozakura Quartet: Hana no Uta. \\n\\n\r\nYozakura Quartet: Hana no Uta struggles to figure out its identity\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nThe show struggled mightily to find the perfect balance between all the different genres it tried to be: at times it tried to be a serious fighting anime, other times a shoujo romance anime, and sometimes a lighthearted slice-of-life anime. Not to mention, Yozakura Quartet: Hana no Uta was only a 1-cour, so the director didn’t have a lot of space to work with. As a result, I was questioning the identity of the show throughout because the show just felt like an awkward mix of genres that the director was trying to force to come together.\\n\\n\r\nThe starkly different pacing between shounen and slice-of-life anime not only messed up the pacing of the plot progression, but also messed with the “rhythm” of the show, especially towards the later episodes. Even in the midst of the fast-paced action during fighting scenes, slow-paced dialogues and tension-breaking humor would completely ruin my immersion to the whole scene. For example, for every little bit of fighting that went on there would be some sort of flashback about the villain or character in question. When the fight could have been over in about five minutes or so, Yozakura Quartet: Hana no Uta managed to draw the fight out to almost a full episode or two instead, showing long flashbacks that didn’t really add anything new to the characters or the villains. Yozakura no Quartet: Hana no Uta pulled no such miracles in terms of striking the perfect balance between several genres, and the inconsistent pacing that came about as a result broke my immersion to the show.\\n\\n\r\nThere is a severe mismatch between the amount of fighting and the villain’s purpose\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nThe show also had trouble trying to match its flashy action to a meaningful purpose. Every single villain that appeared in this show, except the main villain, had laughably trivial goals. The main villain was the only typical villain that wanted to achieve some form of “world domination”; the rest of the villains pursued explicitly personal interests that were as minor as wanting to reunite with a long lost sibling. And simply because of the fact that these personal interests involved our main protagonists in some way, there would be an “epic” showdown between the protagonists and the villains. As a result, there was a severe mismatch between the excessive amount of action and the triviality of the villain’s goals. The villains rightfully seemed menacing and intimidating when they were first introduced. However, once their goals were revealed, I skipped almost the entire arc and all of its beautifully animated fighting sequences because the end result was painfully obvious.\\n\\n\r\nThere is hardly any time for character development\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nWith the story rushing right along and the fight sequences taking up the majority of the show’s screen time, there is hardly any space left for character development. With a relatively large cast of characters, I was expecting a more character-driven plot with developments primarily focused on our main protagonists. Instead, the priority of the show goes mostly into fighting and exploring the backstory of the villains more so than the protagonists. Additionally, for each arc the focus of the character developments are on the secondary characters rather than the main protagonists, so there can be a loss of immersion because most viewers want to learn about the protagonists they always see on screen more so than secondary characters that appear in just a couple of episodes. \\n\\n\r\nWhat also hurt the character developments was the rather lukewarm development of romantic relationships between certain characters. Especially in a 1-cour anime with barely enough room to fit in a bunch of fighting scenes and character developments, the romance felt pretty random and unnecessary (even if it was just staying faithful to the original work).\\n\\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------\\n\r\nNow, after having said so many harsh things about the show, would I still recommend Yozakura Quartet: Hana no Uta? Absolutely.  I was not at all being sarcastic when I said that this show had everything. The art style is modern, young, flowery, and captivating; the premise is something we have already seen before but with a slightly different and interesting take; the fighting animations were exciting to look at, despite the large amount of fight sequences throughout the season and both OVAs; and finally, the humor was spot on for most of the show and the panty shots (and other forms of fanservice) were not too “in-your-face” about it.\\n\\n\r\nHowever, my main complaint was that even with all these individually promising components, Yozakura Quartet: Hana no Uta had a difficult time combining said components in a way that works. Just like how it is difficult to mess up a dish with Grade A ingredients, the director took great components of this show and just failed to add the right amount of spices. Regardless, the show deserves some attention for being one of the better reboots to a series and deserves credit for all of its positive aspects. \\n\\n\r\n*^*^*^*^*^*^*^*^\\n\r\nStory: 7/10\\n\r\nCharacter: 7/10\\n\r\nArt: 10/10\\n\r\nSound: 7/10\\n\r\nEnjoyment: 7/10\\n\\n\r\n*^*^*^*^*^*^*^*^\\n\r\nOverall: 7.4/10",
            "date": "2015-03-27T08:54:00+00:00",
            "helpful_count": 11,
            "mal_id": 183615,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2726597.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pakoko",
                "username": "pakoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=183615"
        },
        {
            "content": "What do you get when you mix a weird and refreshing supernatural setting with cliched shounen character backgrounds and battle elements? When you mix a solid plot-line having interesting aspects with unnecessary and distracting fan service? And add pleasing art style & character designs with diverse yet quite unoriginal cast of characters? Apparently you get this show, which, as these mixtures suggests is a flawed yet quite an enjoyable experience at the end of the day.\r\nThis is not the first adaptation of the manga, there is a previous series as well as OVA's; but quite thankfully for someone new wanting to join the excitement youdon't need to watch those to understand the show as it starts the story anew. The plot setting is a town where humans and youkai leave together and the focus is on a group of teenagers with their \"Hizumi Life Counseling\" agency which tries to keep the peace in town. That sounds a somewhat weak plot, right? But the story actually gets way too deep reaching various dimensions with the detailed background of the characters as well as the city while we go through their struggles each and everyday for a peaceful environment for the inhabitants.\\n\r\nIn a very entertaining and unique way, we slowly learn about the town's past; how it is very different from the ones surrounding it; how it actually came to be; and what motivates not only the agency but even the general populace of this unique town to strive to keep their town safe. Another aspect is the general flow of the story as it moves forward in a wacky fashion, we get supernatural battles suddenly turning into some characters goofing off which then again suddenly turns into an emotional back-story revealing sequence. There are episodes in which you will get a bit bored with unnecessary fan-service galore to quite suddenly finding out some key back ground information's and character development. While this general bizarre and unorthodox approach is quite fun mostly, at times it is quite frustrating to get distracted by a sudden focus on undergarments in between an intense fight sequence or storyline revealing; and through some of this forced ecchi elements we really feel a bit sorry for the directors trying unnecessarily to give the show that appeal of commercialization which quite frankly it doesn't actually need. \\n\r\nDespite many flaws and general lack of explanation of some of the confusing plot points one feels that this is a show that might have really done well with a few more episodes at the least; so there grows a general want of more after watching the show and quite surprisingly this adds to the overall enjoyment as the writers never really gave a cliff-hanger ending at all (although not really settled ending at all).\\n\r\nThe story gets a 8 out of 10.\\n\\n\r\nWhile not totally original at all, the diverse and somewhat big cast of characters with a general lack of actually focusing on anyone is one of the strongest points of the show. Despite the synopsis stating only four main characters, this show is not limited to that at all. In fact there are quite a few number of characters which gets focused up on, to the point of the show not really having any main characters, and that is very interesting indeed. There are episodes focusing on a specific character and even total lack of otherwise important ones, but these just add to the diversity of the characters even more.\\n\r\nHime is the town mayor and might be called the main female character who is somewhat like our typical shounen heroes with her trying to save all attitude. But there is also the funny aspects with her huge appetite and the song she sings, later on during the show although her character gets a little more depth but never really is able to transcend the trope of shounen cliches. Akina can be attributed as the main male character and is overall one of the interesting ones with his somewhat tragic duties and his interesting lineage & back-story, but then again he also falls into the typical category's as despite sparks of development his character never really leaves the trope. Other characters including Ao, Kotoha. Kyousuke, Touka, Juli and even the antagonists also really suffer from general lack of originality.\\n\r\nBut despite the flaws credits is due to the writers for giving each characters almost the same amount of care and trying to give viewers the overall experience of enjoying a total story from various viewpoints as well as having various sub-plots rather than being focused on only one person.\\n\r\nThe characters gets 7 out of 10.\\n\\n\r\nDespite being visually pleasing the artwork never really draws attention to detail, it is not particularly lacking in anything but actually can't command appreciation while we are being focused on the interesting story. And the art style never really adds that much to the experience as a whole, but rather distracts and annoys with its overly endowed females and unnecessary shots of undergarments. \\n\r\nWhile it could have been better if the art somehow added to the supernatural elments of the show, the battle scenes were done nicely with fluid animation but then again never really adds anything to the intensity either (the dialogues does that job better). \\n\r\nSo this gets 6 out of 10.\\n\\n\r\nThe music/soundtrack is also an overall mixed bag, as the battle themes or music during these intense sequences were quite nice yet the overall in-show music again fails to really catch attention or even provide any factors for the enjoyment of the show. The show screams the need of having nice music but somehow the compositions never really gets there, despite a few glimpses of nice melodious piano pieces and guitar works.\\n\r\nThe OP is quite catchy and memorable which tries to focus on the wacky aspect of the show and somewhat succeeds, The ED on the other hand really lacks in aspect of its enjoyment and is rather boring with its apparent approach at the emotional aspect of the show which never really shines as a matter of fact.\\n\r\nThe voice acting was quite appropriate but special mention should be given to the seiyuu of Hime as she does a splendid job of representing the character.\\n\r\nOverall it gets 6.5 out of 10.\\n\\n\r\nAt the end of the day, while not being that original in its character department and never really shining with its animation and music the show really has an enjoyable story-line which can be said to have the characteristic of always keeping the enjoyment going. The general overuse of unnecessary fan-service is one of the main factors holding the show back from being something beyond good but despite it all the viewers are left with a wonder for what to come next (despite the writers never really trying too much with any cliff-hangers or something like that) and might really do well with a second season after the manga is completed.  \\n\\n\r\nOverall Score -\\n\r\n                         7 out of 10.",
            "date": "2014-01-02T01:20:00+00:00",
            "helpful_count": 9,
            "mal_id": 126783,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238266.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/post_human",
                "username": "post_human"
            },
            "url": "https://myanimelist.net/reviews.php?id=126783"
        },
        {
            "content": "This review is only on the Sound, as i agree with almost every other review, so read those instead :D\r\nApart from beeing very outstanding overall, what struck me most in this anime was the sound.\r\nI cannot really describe it, but the OST is getting used very fittingly everytime.\r\nThere are scenes where its completly silent (because nothing is happening) and then the sound just explodes.\r\nThe Soundworks and volume is just as extreme as other parts of this fantastic anime, when a wall gets broken near the camera, it tries to break your speakers/headset.\r\nThat felt very refreshing, because every other series i watched limits the sound tofit the picture.\\n\r\nI can only recommend this anime.\\n\\n\r\nPS: I was also very surprised about the end, but its a very good end.",
            "date": "2015-03-29T12:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 183949,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4348853.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/h3ndy",
                "username": "h3ndy"
            },
            "url": "https://myanimelist.net/reviews.php?id=183949"
        },
        {
            "content": "*NOTE BEFORE WATCHING THIS ANIME PLEASE READ THIS*\r\ni thought i should mention this cause no one told me about this before i started watching. to fully watch the anime u have to watch the yozakura no quaret OVA hoshi no umi after watching the 8th episode because though listed as a side story it is actually important to the story because it introduces a new character and builds up on a present one.( though u can get the general idea from the op of the 9th episode it feels a bit confusing) this was probably cause due to constraint on the number of episodes.\r\n*END OFNOTE*\\n\r\nREVIEW: \\n\r\n          okay so after watching this series i have to say that it was a wonderful experience. this show is a hit or miss kinda thing but for me its a hit. this show has everything comedy, badass fights with fluid animation and a very intriguing plot, some healthy fan service( no serious echi like HOTD or HDxD, its relitavly decent and if ur not into that then easy to overlook). these are the reasons i liked it for me the entire thing brought multiple elements together very well. Many may not agree with me but as said before this is a hit or miss sort of thing even if i loved it there is no guarantee that u will.\\n\r\n           Now for the bad parts if i had to say there wasn't much i didn't like...... the sound was amazing the art was amazing the characters were amazing so u might be thinking why i only gave this show a total score of 8......well the answer is simple it just didn't have that bang that u feel when u finish a masterpiece  the reason for that is because it is based on a manga and the manga has not ended, thus the series has not ended, therefore it dosnt answer most of our questions and is left incomplete . Not to say that the ending was bad the  anime ended satisfyingly enough it just doesn't have that much of an impact like kyousou gigia or kyoukai no kanta or gurren lagann because it simply isnt over . That is the only thing that is preventing me from giving it a 9 or maybe just maybe even a 10 . Needless to say when the series ends it will probably be something great this is actually just the initial portion and is your general \"our fight has just begun\" type of thing( thank god they don't use that dialogue at the end like so many other anime). HOPE THIS HELPED U AND HOPE THAT U LIKE THE ANIME :D",
            "date": "2015-04-26T16:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 186540,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3915961.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sledge260",
                "username": "Sledge260"
            },
            "url": "https://myanimelist.net/reviews.php?id=186540"
        },
        {
            "content": "Yozakura Quartet: Hana no Uta has almost everything you'd expect of a shounen anime. Cute girls that kick ass, tsundere, characters with their own extraordinary powers, devilish cool-looking antagonists, dope fight sequences, high tempo music, blasting sound effects and fanservice. Almost all the ingredients you need for the shounen anime you can get hyped and drown in awe for is prepared, then it all comes down to execution.\r\nTL;DR\r\n-----------------------------------------------------------------------------------\r\nStory(7/10) + Character(6/10): I am particularly a plot maniac when it comes to anime so it could be the very reason why I gave this show a 6. Plot-wise, Hana no Uta really has nothing much to offer.What does our MCs and friends do? Protect the town and discover more about the dark world they are against, or at least that's what I expected it to be. What this show does is some kind of Team Rocket symphony, bad guy shows up, gets gangbanged by the good guys, proceeding to retreat without leaving any real damage or threat. They do this over and over throughout the whole show, and the only achievement they got from this is actually just introducing our characters' powers and prowess. Almost nothing is exposed about how the daemon world is like, and why some daemons randomly reach the human world. And this repetition comes with the cost of making the antagonists look underwhelming as a threat, slowly murdering my expectation of how the story will turn out.\\n\r\nThe lack of plot progression nearly convinced me that the show could be in the slice-of-life genre. Half of the time characters are just interacting with each other and doing a sit-com. Speaking of comedy, this show has only two or three occasions where it managed to throw a punchline. The rest of the comedy relies heavily on our cutie girls interacting with each other and doing dumb stuffs, which is too weak to be considered comedy.\\n\r\nRegardless of the lack in direction on plot, it is still interesting to discover the special abilities of each character.\\n\r\nCharacter development is evenly distributed for everyone. We get a little touch on each character's past and learned their personal desires which drives them to be what they are. Sadly, what they are often portrayed as are just a bag of happy-go-lucky teenagers ruling their lovely town. I can pick three girls out of all the female cast(there are only three main boys), put them in a bottle, shake it up and you will have a hard time distinguishing who is who in the end. Because they act all freaking cute and cool all the time, hardly showing distinct motives or principles behind their perseverance to protect the town. Ironically, the side characters actually got themselves one or two episodes worth of backstory while the main characters only get a few minutes flashback. After watching the show, I found myself more fond of the side characters than the main ones.\\n\\n\r\nArt(8/10): Pretty much the only thing worth the praise for the show, Hana no Uta has a solid art style on drawing the characters. Although all of them has quite the same facial feature, the simple yet unique design of the characters makes it easy for audience to directly recognize them even from afar. The show also frequently switches camera positions, meaning more angles of perspective on the background. It's hard to get bored even though the plot is moving slow as the camera gives us a tour on every corner of the town. Art is consistently neat and colorful, never failing to appeal my eyes. \\n\\n\r\nSound(6/10): Hana no Uta for an action shounen anime, is surprisingly quiet and calm in the music department. The background music volume is a lot lower compared to dialogues & the sound effects, and was remained that way throughout. When the MCs shouted some cliche lines, the music tempo and volume got higher for 50% and that's it. Never you'll hear an iconic soundtrack tsunami-ing a climax scene and never a trumpet sounded for the victory of battle.\\n\r\nAll I can remember listening from the fight scenes is the endless spamming of ear-raping sonic booms(they even made a middle-aged man charging go \"bMmmMmm!!!!!\" too). Hana no Uta loves that shit! They conduct every attack blows with sonic booms and the stronger the attack the more ear-raping it gets. These sound effects disrupt the music a lot, so they lower the music volume to a point it doesn't exist. Due to that, Hana no Uta's fight scenes are all just pure strength no emotions, leaving a lot to be desired.\\n\r\nThe voice actors never succeeded in being comedic(since I never laugh at any joke attempt), yet they did their job properly on acting moe and cool.\\n\\n\r\nExecution(3/10):\\n\r\nThis is the biggest disappointment of the show. \\n\r\nAt first, they alternated chronological order of the scenes a little so things look more interesting, but instead it feels lackluster because these gimmicks are supposed to be used on mysterious or climax scenes to make audience go oooooohhh when the card is revealed. After a few episodes the show realized it doesn't work well, because they never had any intense scenes and important revelations to begin with, so they ditched the plan.\\n\r\nThen there's fanservice, this shows spits boobs and panties scenes almost every 5 minutes. It was fine, until a certain point when things starts to get tense and... KABAAAM! Here's a panties shot for ya fam! I don't even know what I am supposed to feel then. All the seriousness built up got demolished in a split second just for an unlewd panties shot. \\n\r\nSame goes for comedy, they make the characters act cute or stubborn in the most unfavorable situations possible, characters would show no fear and respect in front of an enemy which lead me to an impression that the antagonists are just small fries, there's nothing to get worried or excited about. Turns out it is, our cutesy boys and girls foiling each and every scheme the bad guy does without any consequences. \"Team Rocket blasting off again!\" \\n\r\nA lot of scenes could have been great if they just give the fanservice and moe acting a rest.\\n\r\nTimings on the action scenes are really slow, one fight can linger for more than 3 long pauses with lots of lots of pointless dialogues which loses a lot of momentum.\\n\\n\r\n------------------------------------------------------------------------------------\\n\r\nTL;DR\\n\\n\r\nEnjoyment (6/10), Overall (6/10):\\n\r\nMusic is the voice of a show. Hana no Uta despite all the pretty pretty art and decent animation, they don't have a good variety of soundtracks accompanied to amplify the emotions conveyed by the characters. And even worse, the volume of music got undermined by sound effects too often.\\n\r\nThe action scenes are stalled, having too long of pauses in between, losing the momentum and hype.\\n\r\nCharacters are shallow and have very little expression of their personalities. A lot times they act of out character just to complete the show's shounen vibe, gives me tons of cringe.\\n\\n\r\nI am so disappointed in this show I wrote my very first MAL review for it. \\n\r\nYozakura Quartet: Hana no Uta is a show filled with moe girls, with poorly-paced action sequences. If you want to get the shounen anime hype, this show will disappoint you.",
            "date": "2017-08-17T18:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 255694,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6490210.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EasyRant",
                "username": "EasyRant"
            },
            "url": "https://myanimelist.net/reviews.php?id=255694"
        },
        {
            "content": "This anime was a mixed bag for me. I haven't seen the original show, so my experience with this franchise is based entirely on the reboot. Yozakura Quartet had a good story set up going on, but that was it. I feel like this anime feel short, it didn't really go anywhere. There were all these clues leading to this big climax, but in the end it felt like nothing had really happened and nothing got accomplished. Yes, it think the story was good, I just would've liked to get more out of it. This series could probably have benefited from being slightly longer.\r\nThere characters,however, are what really make the show. There are a lot of them, most introduced within the first few episodes, and it's a diverse, fun cast of characters. Hime and Akina were handled nicely, but I would've liked to see some more of the side characters get more back story or development.\\n\\n\r\nThe animation was nice as well as the art style. The opening and the ending song were both catchy.\\n\\n\r\nDespite my problems with this show, I think it was actually very enjoyable and was fun too watch. How, I'm going to give this anime a score of 6/10. Good, but I felt like it could've been a lot better.",
            "date": "2014-02-01T23:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 131101,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1235213.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SushiUnlimited",
                "username": "SushiUnlimited"
            },
            "url": "https://myanimelist.net/reviews.php?id=131101"
        },
        {
            "content": "in my opinion yozakura quartet is one of the most underrated shows of the 2013 fall season, what makes it even worse is the fact it's not very known among many people. just by looking at the members amount down in this website you will understand what i mean -almost 16000 members, compared to a 30k or 40k one can tell it's insignificant-. so as a result after watching this series along with its OVAs i decided to write my thoughts about it.\r\nwell then, as many of you may know yozakura's adaptation is manga written by Yasuda, Suzuhito and still on going. before the seriesstarted broadcasting in 2013, it already had 3 OAD featuring one of the events that occured in the middle of the story -Yozakura Quartet: Hoshi no Umi-. i wouldn't call it a prequel nor a sequel, but as an advice watching those 3 OAD after episode 8 and then going back to the remaining 9-13 episode would be a perfect way to avoid confusion and progress in a good pace. now going back to the story, Yozakura Quartet: Hana no Uta has quite the familiar plot. humans and youkai living at a town that provide them with what other places doesn't, you probably heard about this kind of setting somewhere -touhou project as an example-. however unlike many of those shows, here human and youkai are co-existing with each other, expecting some bad people who are against this way of life to appear is meaningless. this town is protected by hime the mayor and her group who most of them are 16 years old or less, but we can always turn a blind eye to this matter..at least I could. now, here is something i couldn't let it pass: in the middle of watching the first episode i started doubting wether if it's really the first or just renamed as 01. in other words the story started in a blurry way, that initial narration description that shows what's going on in the series doesn't exist in yozakura, so as result the characters, the stats of the town, all of it is presented throughout the flow of events. and to do that, they made use of the cast by making them ask some blunt basique question they're already supposed to know its aswer represting by that the doubts and uncertainties of the viewer. to be honest i find it to be annoying, i mean sure the confusion of the viewer should be cleared however isn't ther any other way to clear it? \\n\\n\r\nalright, if i was asked what is the main aspect that i liked about yozakura story my answer would be its half-seriousness. the fact that after every huge battle things end up in a good way, the following day everything gets back as if nothing happened. the fact that every antagonist instantlly bacomes one of the supporting cast after he's defeated. or even those punch-lines inside of a battle that should  be serious, this kind of aspect makes the best out of the show, everything is joyfull, no one dies...all in all nothing of tragedic happenes. while for some other people that may look as a down side, for me i say this kind of things is not bad every once in a while...if considered as change of pace.\\n\\n\r\nas for the cast of characters, stating that they're unique or first of thier kind would be an exaggeration. at least they're various, the mayor of the town: a 16 years old high school girl and a glutton, her way of wearing a long scarf makes you mistook her as a ninja while she's actually a spear using youkai. there is two glasses bishounens, hiizumi akina the head of the hiizumi family whose hair grow up in a mysterious way when using his tuning power, and of course Ao the cat eared loli with the ability to read minds - one can not simply hate her-. one of the upsides of the characters is their cloths, especially eiji and enjin's. the style of these two is what you'd call badass looking. yozakura also brings another warm theme with it, it is the teamwork/friendship wich personally i didn't stumble upon it for a while until now, those exiting moments where the whole group decides to kick someone's ass and then they proceed to execute an unknown plan that demands time for the viewer to figure out, yet doesn't clear out until the end, - it kinda reminds me of some one piece arcs tbh-\\n\\n\r\ni stated earlier something about half seriousness, getting back to this subject i find it to focus mainly on characters. no matter how much of a bad person someone looks in the end he ends up being an ally of the protagonist casts even if it's only temporary. the same applies with enjin, at the end he decides to stop his series of troubles after helping akina to avoid death, even if it was in an indirect way. another matter that felt out of place again is the way Yuhi Shinatsuhiko is acting, trying to look cool with that pattern of talking and the cigarette in his mouth...sure he is the god of that land but that way of talking duud it's unsupportable! the background of hime, akina and juli were well explained and didn't feel like those blunt questions i mentioned earlier and guess what kyousuke's voice was the same as shizuo from durarara, actually the whole person was similar to him -lifting heavy stuff per example- coincidence? probably that's not the case.\\n\\n\r\nfrom a visual yozakura did a decent job at in the animation, it's the only aspect i cloud declare as unique. i doubt you will find another series featuring the same animation as this one. there's that one scene where enjin got beaten up by everyone, it had a great view, many effects were used to show how bad he got rekt before disappearing again. the show also had plenty of panty shots....perfectly timed panty shots! especially ao, it was enjoyable to grasp her striped panties every once in while.*cough* i shouldn't be talking about that right? well asides from that all what remains is the lightning effects from behind, they're a little bit rare however they make the scene looks more serious and decent.\\n\\n\r\nthe OP and END surprisingly were great, they got the joyful feeling in them. the voice actors were pretty much spot on form most of the characters got nothing to say about that. some of the sound effects like the lightning, or that mysterious blue atmosphere that frequently appear makes you feel a chill running down your spin, calling it an achievement wouldn't be wrong.\\n\\n\r\nhumu, in the end thinking of yozakura as a serious magic/supernatural show will only deceive your expectation. however thinking of it a comedy/superpower show where youkai and humans faces conflicts and try to solve them together, so that the following day they would pretend as if nothing happened...i guess that will work. personally i find yozakura to be one of the best shows out of it's kind there's a tiny romance subplot going on with the every day adventure of the team. there's a warm feeling of friendship going on between the characters, everything ends up in good way, no need to struggle that much to figure out some uncertainties, no tragedy no drama, it's the best way to take it easy while watching an adventure show. highly recommended for fellow slice of life lovers.\\n\\n\r\ntsun tsun dere tsun dere tsun tsun.......(you will understand what  i mean by that later)\\n",
            "date": "2015-11-14T13:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 203357,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4085373.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/reizenchuu",
                "username": "reizenchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=203357"
        },
        {
            "content": "Yozukara Quartet: Hana no Uta is one of the most underrated anime and needs to be more known to the community.\r\nThe show starts off with quite a bizarre start. Giant fish tanks and then all of a sudden a flock of pigeons. This is done to confuse the viewers. It then transitions to a highly attended Sakura Festival showing the happiness and enjoyment the people are having in the festival. The story is told in a steady episodic flow with occasional flashbacks to fill in plot holes due to the lack of explanation in some scenes. Being only 13 episodes, the pacing is bound tobe inconsistent. Sometimes there is an episode solely to describe a character’s back story and being only 13 episodes, that takes up a lot of space which leaves not enough room for other plot details. This leads to the sense of the show being rushed and leaving a lack of explanation in some scenes. The lack of consistency with the pacing of the show is one of the shows downfall. This is, however, masked by the comedic aura the show emits almost to the point where the isn’t the main focus of the quality of the anime. It is also quite a light-hearted series, so deep plot details aren’t needed and would take away the light-heartedness out of the series if it focussed more on the plot. The action/fighting scenes are really fluid and are pleasing to watch. This show prioritises the action over the plot while including aspects of comedy to make up for the lack of plot content.\\n\\n\r\nThere is nothing “jaw-dropping” about the art. The art is somewhat similar to what you would see in a hand-drawn comic book, with the noticeable black outlines of an object or a figure. The art is quite different to the norm of what the studio, Tatsunoko Production, usually makes. They’re more well known for the sci-fi futuristic technologic animations. Although the art style looks “lazy” with lack of effort put into it, it does fit with the shows story. It adds to the comical effect the show tries to achieve, Some of the female characters are depicted more secually than necessary. There are occasional panty shots, clothes that “show skin” and are quite revealing but it isn’t to the point where is provides a lot of “fan-service” and is far from being an ecchi anime. \\n\\n\r\nThe Japanese voice actors were generally good and fitted their characters they voiced. It fit the personality the character was portrayed as. The soundtrack was also quite solid. The background music played in between scenes fitted its purpose, providing scenes with a more vibrant “colour”. It especially made the action scenes more enjoyable to watch with the intensifying music playing and the added sound effects with the close-combat scenes also made the action seem more realistic and fluid. The opening to this anime was a very catchy one. UNISON SQUARE GARDEN is a band which I have been familiar with a previous anime ending they did and they did not disappoint when they performed the opening theme to this anime. The melody is quite a memorable one which will get you humming it self-consciously, especially the “all quartets will lead to the … ? lalalalalalalala” bit at the beginning. I personally like 3-piece rock bands, such as UNISON SQUARE GARDEN, as the performers usually have to play multiple instruments and roles at once due to the lack of members. Despite this, they performed a beautiful and catchy piece.\\n\\n\r\nThe one thing that stands out in this anime is the diversity of the characters. The characters were quite well-rounded. Each character didn’t seem to overpowered compared to each other. While characters’ each all their strengths; those strengths were balanced out with flaws to make sure a character wasn’t too overpowered. There was nice symbolism between Hime Yarizakura’s scarf and the friendship Yarizakura and Hiizumi share. There was a clear indication between the protagonists and antagonists of the show making the audience not need to question who are the heroes and villains of the series. There is use of amnesia which is overcome and the truth is exposed between characters and their friends. Through this, we see the contrast between Yarizakura’s supposedly strong character become emotionally weak who seems to get depressed and embarrassed when she gets scared and uses her scarf to cover up her face. The vast amount of supporting characters in the series makes the series what it is; a funny comedy jam-packed with fluid action scenes. Without these supporting characters, the show wouldn’t be as funny and the action scenes wouldn’t be as vast and enjoyable without the support the supporting characters give to the main characters while they are in the fight. Yarizakura Hime is a memorable character which I will never forget; especially that scarf (there is no way you will ever forget the beauty that long scarf provides). Yarizakura was a relatable character in my opinion as she could see both sides of the spectrum and tries to unite them as she is the only one that has knowledge of both sides and understands how both sides feel without having misunderstandings made.\\n\\n\r\nOverall, I enjoyed the action that was included in this series. I didn’t quite like the light-heartedness of the series but the show had enough comedy for me to slightly ignore the light-hearted feel. People who don’t mind watching anime with a lack of story will enjoy this anime. Non-anime fans may not enjoy this as much, as it may give them a bad impression of anime being just pure action with no real plot. I think I would consider re-watching this series as I probably missed some things the first time and when I rewatch it, there will probably be hints and hidden “easter eggs” that I did not notice the first time that alludes to upcoming scenes. I am a bit upset that this show isn’t licensed for distribution to the west so I had to deal with fan-subs, which weren’t particularly bad though. It seems this show isn’t very known to the anime community so licensing companies won’t bother licensing it as they won’t gain much revenue from it. I thought that this series was unique by itself and I liked that as it added variety to what anime can produce and achieve. The plot may not be quite memorable but the characters and backstories of them that were foretold is where the show shined and what was memorable. \\n\\n",
            "date": "2016-06-11T05:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 220481,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4441554.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fillyy",
                "username": "fillyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=220481"
        },
        {
            "content": "*SPOILER FREE REVIEW*\r\nYozakura Quartet: Hana no Uta\r\nWhat an anime this is. An anime which fell through the cracks of all the other hype anime that surrounded it during its release. Do you have a craving for a super powered over the top action? Well look no further because your knight in shining armor is here and it's name is Yozakura Quartet: Hana no Uta.\r\nStory: \r\nLet's get down to business here. If you read the synopsis then chances are, that didn't make you interested in this show whatsoever. It''s hard to describe the show without spoilers but basically follow a group of four high school friendsthat are gifted with supernatural abilities to fend off supernatural things. Really, that's all I can say. Pacing wise the story starts to move pretty quickly and is filled with action until around episode 9 where it unfortunately starts to slow down a lot but don't worry, the last episode contains a lot of action so keep on watching. The plot is there and it isn't difficult to follow but if you're looking for an engaging story line then I suggest you look elsewhere because that is not where this anime shines.\\n\r\n6/10\\n\\n\r\nArt:\\n\r\nOkay, this here, this is where Yozakura Quartet: Hana no Uta shines. I'll be blunt, outside of the action scenes colors are bright, and the characters look nice. Unfortunately it looks like they saved the budget for the action sequences. Animation is a little choppy and lacking detail here and there although at times it adds to the comedic value of the show. Now the animation during the action scenes? My goodness, absolutely incredibly. Everything is fluid, scenes are dynamic, moves are over the top, flashy, and actually look like they hurt. The animation in the action scenes is comparable to Kyoto Animations Beyond the Boundary which says A LOT.  \\n\r\n9/10\\n\\n\r\nSound: \\n\r\nNothing really notable here. Background music usually stays in the background and while not taking away from the anime, it doesn't really fly out at you either. Pretty much average stuff. Some of the sound effects are pretty cool, most notably this dubstep kind of wub which indicates **** is going down.\\n\r\n7/10 \\n\\n\r\nCharacters:\\n\r\nThe only character that really stood out to me was Akina Hiizumi. He's one of the only humans in the group and unlike everyone else in the group he wasn't gifted with insanely ridiculous power and reflexes like everyone. He has a few secrets of his own however and can really stand out compared to everyone at times. He's comparable to Touma from Toaru Majutsu no Index but I think he's way more bad@$$. When it comes to the action, no character was leagues ahead of the others which was nice. Everyone played their part in the battles and no one at any point was dragged to the sidelines and shoved in the back because other leading characters were becoming too powerful. Everyone retains their own personality which is nice. Nothing to really complain about as none of the characters are annoying and I came to like a few of them. \\n\r\n8/10\\n\\n\r\nOverall:\\n\r\nI enjoyed this anime a lot. It even became one of my personal favorites. The high point is the over the top super powered action and you see some in almost every episode so don't be scared to hop into this anime if that's all you're looking for. It's like Gurren Lagann, sit back, relax, turn your brain off and enjoy every bit of the flashy action scenes that come at you.",
            "date": "2014-09-26T16:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 162357,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4067515.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/2fastt",
                "username": "2fastt"
            },
            "url": "https://myanimelist.net/reviews.php?id=162357"
        },
        {
            "content": "Hana no Uta is a show that I like because of all the things it does differently. It consistently fails to adhere to an ordinary story pacing, and it relishes in, and often pulls off, fast tone shifts. The themes have a lot of stuff to do with demons and half-demons and whether they should be protected or banished, and yet, rather than treating this as a grave affair that propels every event, I felt more often like I was in a blended slice-of-life that sometimes has action and drama. There are story arcs, of course, but it often feels like the show and thecharacters have mutually agreed to give them lip service so that they can go do something way more interesting with the screen time. You can guess what's coming next, but you don't know what the \"good scene\" will be, because it could be anything. And the cast is large, with enough depth and variety that you can easily lose track.\\n\\n\r\nAll of this makes it less readily consumable and closed-ended than your typical TV anime, and more like a messy world you could put in the background on loop, noticing different things each time. In some ways this might feel like a deficiency of being a one-cour show, rushing through a lot more than it has any right to, but if there is any example of how to pull it off in a satisfying way, this is one of them.",
            "date": "2017-05-14T23:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 247704,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845194.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/triplefox",
                "username": "triplefox"
            },
            "url": "https://myanimelist.net/reviews.php?id=247704"
        }
    ]
]