[
    [
        {
            "content": "Representing a sports anime that have over two decades of history, Hajime no Ippo Rising returns in this third installation of its previous predecessors. It only takes one ring to bring together a collective cast of colorful characters, superstars of all shapes and sizes under one goal: to make a name of themselves and earn the respect of the world. Hajime no Ippo Rising accords for a perfect example of an anime based on the foundation of its theme not only in boxing but also in exploring the dynamics of its characters. It’s their time to rise and shine.\r\nBased off the manga of the samename, George Morikawa is famously known for his work known as Hajime no Ippo. The franchise has gained international attention for its exquisite presentation of the sports genre. Focusing on Ippo Makunouchi, the series has set itself as a leading paradigm to the development of his character. Not only does he get the spotlight but the show itself also explores its other cast members under one unity – the conception of boxing and its wonders.\\n\\n\r\nBeing the holder of the Japanese Featherweight Champion holds a variety of meaning for Ippo. Responsibility comes as an archetypical word because top contenders will come after him. It’s his goal to defend his title, night after night, week after week, and possibly years after years. Ippo has already earned the respect of his peers but always strives to continuously aim for bigger heights. To do that, he faces off against powerful adversaries that truly tests his limits in the ring. Hajime no Ippo is known to explore characters both in and outside the ring for that matters. Well-developed stories also connects the characters together and formulates their development. For Ippo, it focuses both internally and externally on his character. This is extended by the clever usage of flashbacks involving his childhood. It’s a childhood that started out as pleasant but later turned cataclysmic after one faithful event relating to his father. We can feel Ippo’s emotions and what he’s been through that has left a painful scar in his mind. Whether in or outside the ring, Ippo identifies himself as a man of integrity – someone that stands out as a great example of a hardworking individual. The third season personifies his character in a way that is relatable and inspiring.\\n\\n\r\nIppo isn’t the only character of this series though. Born from Tokyo, Japan, Takamura Mamoru returns to make his dream come true – to become the WBC champion of the world and eventually conquer all the other weight classes It’s no easy task with the opponents that he faces off such as David Eagle from America. In contrast with the brash boxer that Brian Hawk showed to the world, David stands out more as a motivator with an easygoing personality. There’s a sharp turn in this presentation as Takamura faces off an opponent that is respected for his mannerisms. At the same time, we witness first hand at how much Takamura improved since his most prominent matches from the previous season. No doubt too does Ippo improve with his abilities when he takes on opponents. It’s riveting to see how characters in this show make names for themselves by going through obstacles, battling their internal obstructions, and showing the world that anything can be achieved with purpose.\\n\\n\r\nEven Aoki Masuru gets his highlights in the series for his efforts. While largely downplayed as a mediocre competitor in the boxing world, Aoki’s development is almost instrumental thanks to his unorthodox skills. Despite being still presented as a comic relief on most occasions, Aoki learns the strenuous effort to make a name in the boxing world. He takes on opponents that puts him at the edge of struggling. However, it’s creative in this way to see Aoki in the ring from a different light. We tend to doubt Aoki’s skills but there’s no doubt the man has the guts to perform in front of an audience at his best. At the end of the day, Aoki is one of those guys that puts on a show you won’t forget whether it’s a win, loss, or draw. Even if he’s not the greatest sports entertainer in the world, Aoki represents a character of dignity for his efforts.\\n\\n\r\nAction returns as a classic style that Hajime no Ippo fans should be familiar with. From the moment the bell rings all the way until the last drop of sweat hits the ring stands for an intensely pushed match of integrity. Camera angles are aimed strategically in motions that focuses on every move the characters make. At the same time, the boxers show on their face the feelings of guts, boldness, audacity, courage, power, and experience. It defines these characters as visions of the future for their skill. After all, boxing is a difficult sport to master and perfect. It may take months, years, or a lifetime of training. Some of the characters may make the sport seem like easy but their guts shows more than just punching each other in the faces. It takes skill with various moves such as Ippo’s Dempsey Roll and risks too. Does anyone think becoming a champion is possible without taking a risk? Of course not.\\n\\n\r\nCharacter relationships still stands out as dynamic despite the intense focus on its competitions. In particular, we witness several cases of Ippo’s progression with his love interest, Mashiba Kumi. Unfortunately, the both of them doesn’t hit home base and their relationship doesn’t move forward much. Despite this, it’s clear that they share a mutual connection that can be bittersweet in a tough world of boxing. The Kamogawa Crew’s relationship also stands out as a promising connection between its members. At times, they can be interpreted as rivals. Other times, its members are like a brotherhood or even a family. Being without a father after coming out of childhood years, Ippo’s relationship with the crew becomes a prominent motivation for his character. The bromance and platonic closeness with its crew members stand out as team that unites each other despite some of their clashing ideologies.\\n\\n\r\nOn most parts, Hajime no Ippo’s story classifies itself as development but some parts can also feel slow with its fillerish progression. A few episodes seems like a snooze in the breeze with little more than a typical slice-of-life value. While this isn’t entirely a drawback, it can be staggering and tests the patience of fans who are eagerly wants to watch what’s ahead. Romance doesn’t also hit anywhere in this third season so fans can give up the dreams of their ships. Some comedy bits also becomes stale or even a banality. Yet, there is also a different side to the third season featured prominently in the latter half of the show with its flashback dynamics. In essence, Hajime no Ippo Rising shines itself at best when it focuses on its characters and story. The other parts aren’t entirely back-stab but sometimes just doesn’t work out in this installation. \\n\\n\r\nThe artwork stands out for its original design of the characters with improved artistic values. Most of the boxers classifies and distinguishing themselves with their styles. The battle scars and wounds serves as a proof of their journey as professional boxers. At the same time, there are characters that identity themselves as icons in the industry. Female characters aren’t a prominent feature but does offer credibility with their innocence, compassionate nature, and sometimes obsessiveness with certain factors.\\n\\n\r\nSoundtrack offers virtue that are defined by the characters with their abilities. Each of the characters’ voice mannerisms gives an impression of who they are. The OST matches well for every move, every match, and every episode with its instrumental score. Sound effects of connecting punches are vigorous and is dynamic with the results. The OP and ED song are coordinated with a parallelism with most of the characters’ journeys as a boxer. It gives a feeling of synergy between each match. The characters embraces their beliefs while trying to climbing to that ladder of world championship. \\n\\n\r\nHajime no Ippo Rising isn’t this a show about throwing a punch into someone’s face. While you will witness a lot of that, the show explores characters in paths with compelling depth in a variety of ways. It’s amazing that in just a small ring that so much can be shown. Thanks to Hajime no Ippo, fans will not just see but learn about its concepts with its innovations. It’s not just experimental but inspiring to see how characters come so far with their dreams. That’s because boxing isn’t just a sport but also an art piece. The paintbrushes are the characters and the product represents its beauty for these rising superstars.\\n",
            "date": "2014-05-06T17:09:00+00:00",
            "helpful_count": 78,
            "mal_id": 142521,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=142521"
        },
        {
            "content": "Taking place where New Challenger leaves off, the series starts from Ippo vs Shimabukuro Iwao to the conclusion of the story of Kamogawa in his youth in Post World War II Japan. Naturally, a new anime installment of Hajime no Ippo did excite me. I mean, with New Challenger ending, the animators have nearly 60 volumes to catch up on as opposed to being 60 volumes ahead unlike a certain Studio Pierrot series which you can easily conclude is. \r\nFor now, I would mostly like to focus my personal issues with this season as someone who actively reads the manga and is up to datewith the current chapters. Even though previous installments have skipped over parts from the  manga (such as Aoki’s black face in season 1; omitting Hayami vs Kobashi before Ippo vs Sanada in Championship Road; taking out Okita’s under card fight before Date vs Martinez in New Challenger, etc), but this takes it a whole lot more and so much important information I thought was necessary to the story and the character development were entirely taken out. For example, there is no build up to the Shimabukuro fight and it takes away why is he such a distinct opponent. Plus, in the manga, when Shimabukuro and Ippo meet at the ocean near Ippo’s home, Ippo’s mother actually seems romantically interested in Shimabukuro until he reveals he is actually 22, a year older than Ippo which brought some comedy to their relationship and adds more to how they connect as \"men of the sea\" with their backgrounds. \\n\\n\r\nTwo other major issues I have was taking out how Aoki developed the look away and VERY IMPORTANT elements of Sawamura’s back story. There was a story behind how Aoki developed his look away and I thought that was funny and how it was presented in the manga and the cut-scenes from the PS2 games. As for Sawamura, I felt the anime left out two of the more important aspects of his story; how he meets Sendo for the first time along with how deep the relationship between Sawamura and Kawabe goes. When Sendo meets Sawamura in the hospital in the manga, he actually reveals to Sawamura why Kawabe cares about him so much. I was upset that part was taken out because it was the very reason why Kawabe cares so much about Sawamura. For an anime so far behind in the manga, I just find it inexcusable to take all this important material out and rush it.  \\n\\n\r\nBut I am satisfied the series got around to animating the young Kamogawa and Nekota story arc, but I felt the placement made no sense to me not because it takes place much sooner in the manga, but that Anderson is not an appropriate character to compare with to Eagle as opposed to Hawk. Nishimura came back to direct the last four episodes and he did that those episode justice. Nothing was taken out and it really captured the emotion. \\n\\n\r\nBut I feel this series deserves to be much longer as well. There are other great fights coming up and some shitty ones lol.\\n\\n\r\nWell, the quality and resolution is more in tune with New Challenger under Shishido Jun's direction and the fights are still awesome. What impressed me most was Takamura vs Eagle. I didn’t think the fight was that special in the manga but animated, it got me really interested and immersed and changed my mind about it. I felt Eagle’s fear and respect for Takamura and Takamura’s tenacity at the same time while watching it. I think Eagle’s white trunks from the games worked enough for me but the golden color does add the naturally appropriate compliments to his nickname, \"Golden.\" I also loved how they colored his suit in the press conferences making him look like an American GTO in a way. \\n\\n\r\nIf there is any reason to watch this season, it is most certainly for Ippo vs Sawamura, one of my top 3 favorite fights from the manga. Sawamura’s bullet was handled more realistically than I anticipated to how it is pulled off in the PS2 games despite the red effect. It is well paced and positioned as opposed to awkwardly angled in the games. This is just one of the few fights that I felt that scared me because of Sawamura’s mix of brain and brawn and this is one of the few times that Ippo came close to wanting to kill someone. Hawk may have been a maniac, but Sawamura is a whole different class of beast that crosses a line that Hawk didn’t. \\n\\n\r\nThe only fight cut significant short is just the Shimabukuro one and I felt an important aspect in respect to the fight that pays some homage to the second Ippo/Miyata spar was taken out. I felt that quality was what would have made the Kazuo story arc, which wasn’t in the manga until after the Sawamura fight, would have been an effective first episode in context to the Shimabukuro fight. Also, the build up and the training was a very good story arc and Ippo builds up his muscles and cardio. I can understand cutting out the weigh-in (which was funny) but the training I thought could have been touched upon as well. \\n\\n\r\nMiyata’s fight with Medgoen Dachboy was excellently paced and is faithful to the manga. The fights are just simply still the same quality with the exception of Ippo vs Shimabukuro. \\n\\n\r\nAnd the animation of the Kamogawa arc is just amazing and brings back a certain distinction that Nishimura gave that you can only see in the first season. He brings a distinct sense of crisp and detail to his design and movement and I am glad he was selected to do this and it just brought me back to season 1 in a lot of ways. \\n\\n\r\nWell, I would like to open this review by saying that I do miss the performance of Utsumi Kenji as Kamogawa. God or whoever he may be with rest his soul. He was a great voice actor for Kamogawa along with his other iconic roles, most especially as Raoh from Hokuto no Ken. As Kamogawa, he had this great presence and authority in his voice. His new seiyuu, Iizuka Shozo, previously the voice of Miguel in New Challenger and most famous as Ryu Jose in the first Gundam series really captures his gruffness but has a different kind of tone, but works in terms of the character, but Utsumi will always be Kamogawa to me regardless. It is also sad that another seiyuu legend, Nagai Ichiro, who plays Nekota also has passed on but managed to record some lines prior to his passing and I always love how he ends his sentences in “da ni.” And he was also most famous as the voice of Happousai from Ranma 1/2. \\n\\n\r\nBut my favorite performance this season was that of Miki Shinichiro as Sawamura, who you may know as the voice of Takumi from Initial D. I am used to Miki Shinichiro as a good guy, but as a bad guy he is excellent. Prior to this series, Hiyama Nobuyuki, the voice of Hiei from Yuu Yuu Hakusho was always my personal choice for Sawamura but Miki’s performance truly captures the character. What really made the character with his performance was this dry throat kind of tone he brings. It really represents more a “thirst” for his  meat obsession as opposed to a “hunger,” and I think the “thirst” tone as opposed to a “hunger” tone really represents the sadistic tendencies of Sawamura. Because when he wants meat, he really wants blood and the portrayal really made me love the character more.  \\n\\n\r\nMiyano Mamoru who is more famous for quieter characters such as Light from Death Note and Setsuna from Gundam 00 surprised me as Kamogawa who tends to be more of an intense character. He managed to capture both Light’s softness but also brings that gruffness as the old Kamogawa as well. The young Nekota also captures the characteristics and I can’t complain. \\n\\n\r\nKosugi Jurota as Anderson was also awesome. He voiced Kujo Jotaro from Jojo’s Bizarre Adventure so you could never ask for a better seiyuu. And I thought Kiuchi Hidenobu, the voice of Tenma from Monster, was an interesting choice as Eagle. He brings out his \"cheerfulness\" and a silly accent at the same time that works for the character. I really had no expectation of who could play Eagle but he does the job. You gotta love how he says \"Jesus.\" I just wish New Challenger kept more of Hawk's Engrish as well. \\n\\n\r\nThe music is a great improvement and excellently uses tracks from the first season, second season, and has a great original one for this as well. I felt the tracks from season 2 were more properly used in this season. The songs for Sawamura are just perfect with his dark and sadistic character. The songs in the Takamura and Eagle fight were also great. \\n\\n\r\nWell, again, as a manga reader, my issues is that this series is too damn short and this series cut out some very important details that helps the story and development. I just felt this series is very incomplete. But the animation and the soundtrack and voice acting brings a different kind of completeness and satisfaction. I just hope they don't do this again for future anime installments.",
            "date": "2014-03-29T15:26:00+00:00",
            "helpful_count": 64,
            "mal_id": 137769,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ParaParaJMo",
                "username": "ParaParaJMo"
            },
            "url": "https://myanimelist.net/reviews.php?id=137769"
        },
        {
            "content": "Intro:\r\nHajime no Ippo:Rising continues the story presented in the previous 2 seasons. This 3rd season was just a distant shadow of what Hajime no Ippo once was.\r\nAfter the first season ended the series went downhill, not in animation quallity but in the material. \r\nStory: 6/10\r\nI wish I could rate this a 9/10 as I did for the first season, unfortunately that will not happen and here is why.\r\n  - Why the heck is this show named \"Hajime no Ippo\" and not \"Hajime no Everyone Else\"? Ippo did not get any attention in this season, with just one single fight animated I was dissapointed tosay the least. Like in the season 2 of the series, the story is not focused on Ippo’s character. Out of 26 episodes, there are around 2 showing Ippo’s only fight and about 1 more showing his training and state of mind. \\n\r\n  - There was not one fight that I enjoyed this season, not even Takamura’s world title match against Eagle, since his opponent was a classic boxer and there was no real tension, like in the Takamura-Hawk fight.\\n\r\n  - The story brings nothing new to the table, the same routine, Takamura getting another world champion belt, Ippo defending his title as the Featherweight Champion of Japan, Aoki and Kimura just goofing around with their fights and so on.   \\n\r\n  - The comedy and humour are as good as always but the story itself is repetitive.\\n\r\n  - What is the greatest power/ability in Hajime no Ippo? The answer to that question is: Being a main character. After being facefucked rapidly Ippo is still fighting like nothing ever happened, the only explanation being either \"he has the Japanese fighting spirit\" or \"those eyes are glowing green\". \\n\r\n  - The show has gotten extremly unrealistic. A boxer can get hit by a truck 40 times and still get up if he is japanese and has \"the japanese fighting spirit\". Give me a fucking break!\\n\r\n  - Wasn't Kumi supposed to become Ippo's girlfriend? They spend the night in the same room, they went on multiple dates, they went to the beach togheteher, etc. It has been 3-4 years since Ippo met Kumi, did they forget about how much Ippo likes Kumi and umi likes Ippo? Well, I guess the answer is \"fuck that, who remembers it\"\\n\r\n  - During the previous 2 season it was made clear that Ippo had the most destructive punches in all Japan. That creates the question: Why does a fighter that has such great power but lacks the skill or defense to become a great champion and a World Title challenger need and focuses on a predictable and risky tehnique such as the \"demsey role\" that aims to put even more power in his punches at the cost of possibly getting KO'd? Why does a strong fighter that constantly gets beaten up focuses on increasing his ofense and not on his dodging/defense skills? Why does it take 20 of Ippo's strongest punches to take down his opponent? This has gotten to the point that it is annoingly stupid... I do know that the \"dempsey roll\" is a technique Ippo came up with after his only deafeat and that may be a reason for his passion and obsesion with it but those are not the actions of a professional boxer therefore proving Ippo does not have the mind of a professional boxer.\\n\r\n  - The way Ippo fights, constantly getting severly injured in every fight would lead to his early retirement due to severe brain damage, fact that is stated in the anime as well, but no countermeasures are taken against it nor any side effects take form. No matter how hard Ippo get punched, the next day he will be good as new.\\n\r\n  - After Sawamura fought dirty and commited many fouls (hitting Ippo while he was down, elbowing, etc.) and the spectators constantly booed him, when the predictable win of Ippo happened, the crowd started cheering for Sawamura, yelling \"you did great Sawamura\"; \"come to the Hall anytime\"; \"we'll have your back\"; \"great fight\". The writer needs to take a breath and sort his shit out before writing anything, in what world would that happen?\\n\r\n  - In season 2, Ippo's coach said \"from now on, it's time to challenge modern boxing itself\" but nothing of that sort happened in season 3.\\n\r\n  - Ippo dosen't have a clear gole anymore. Ippo's original goal was to find \"what it means to be strong\" then Ippo's goal was to become the Champion and then he received from Date the duty and challenge of defeating the Featherweight World Champion, Ricardo Martinez, the superchampion with no losses and more than 64 wins by KO. Did Ippo forget about all that?\\n\r\n  - I enjoyed the background story of Ippo's coach, but it was not the right time for it to pe showed.\\n\\n\\n\r\nCharacters: 6/10\\n\r\nThe characters do not get any development, they still have various diffrent personalities but nothing new about them has been shown after the first/second season ended.\\n\\n\r\nI am truly disappointed by Ippo's character. Ippo has zero character development, he is the same old, easily intimidated school boy, he is the same guy as in the first season. \\n\r\nIn the gym Ippo is all fired up but as soon as he gets in the ring he is scared of everything. Can't he fight like a real Champion where he only gets grazed, where he performs impressive dodges and does shocking things that make his opponent back the fuck up and carefully think about his next move? No, after 3 seasons I guess it will never happen.\\n\\n\r\nAt one point, the bad and \"evil\" Sawamura punches Kumi (Ippo's future girfriend) and Ippo does nothing but prevents Kumi's brother form taking revenge. Yeah, a real main character Ippo has become, cowering before just about anyone.\\n\r\nIppo is not a good boxer skill wise, he is just a caveman with boxing gloves, his fights and skills are not improving much, he gets hit by any no-name boxer, Ex: he gets injured by a fisherman boxer, he gets beat up by his former apprentice that has only boxed for 2 years and the list goes on. The point is that no matter who Ippo's opponent is, Ippo is going to get badly beaten up and then he will win by a KO. Repetitive much?\\n\\n\r\nSawamura's character, the bad guy Ippo predictably defeated seems to be taken from a cartoon. Sawamura is one-dimensional, cliched, a Japanese copycat of Brian Hawk.\\n\\n\r\nThe main character of the series should have been either Takamura or Myata, they are much better main character material.\\n\\n\\n\r\nAnimation: 8/10\\n\r\nThe animation has not improved much compared to the 2nd season, that being said, the animation is still great and the fight are well coreographed.\\n\\n\\n\r\nSound: 5/10\\n\r\nThe opening theme is horrible, I always skipped it. The ending theme is decent, the OST is average, some of the actor's voices are irritating.\\n\\n\\n\r\nEnjoyment: 6/10\\n\r\nI did not enjoy this season except for part of the jokes and the animation. For the little screen time Ippo received, I have had enough of seeing Ippo struggle with every nobody boxer. His matches are getting annoingly repetitive. \\n\\n\\n\r\nOverall: 6.4/10\\n\r\nThis show did not start out unrealistic but has gotten progressively extremly unrealistic as it has gone to the point of being stupid.  I would recommend this series just for the first season.",
            "date": "2017-02-01T08:29:00+00:00",
            "helpful_count": 32,
            "mal_id": 239651,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5778347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cinefil_original",
                "username": "Cinefil_original"
            },
            "url": "https://myanimelist.net/reviews.php?id=239651"
        },
        {
            "content": "First of all a big thanks to George Morikawa because he did something nearly impossible with Hajime no Ippo. He managed to keep his story interesting and his comedy fresh even after all these years. Sure it has it’s weaknesses(for example some short chapters in the manga plus some repeated stuff in the story etc) but it is still a great accomplishment that only a few are capable of.\r\nThe story is about Ippo a kid without any purpose in his life and fate decides to make a boxer out of him. This season focuses on his challenges to keep his special move sharp and fresh,the Dempsey roll. in the manga the reason for the focus on the Dempsey Roll is explained better but since madhouse tried to handpick parts of the story there had to be some changes so they could fill it all in their schedule which is still no biggie since Ippo is not the best part of the story for me anyway(cause most of the times we know he is gonna win so it takes the tension away for me at least). His coach Kamogawa and his hero Takamura are the best parts and both get to shine in this season. Takamura aimed to rule 6 classes and his fights are always exciting and we get to see his second conquest in this season with a classier opponent this time, Eagle. A man that is exactly the opposite of Hawk, not just in style but also in personality. This is specially for American  so mangaka could show better to them that he is not against Americans!\\n\\n\r\nMadhouse decided to put the best part at the end of the season of course and along with some changes they put the Kamogawa background story at the end of this season which is probably the best part of the whole story and it explains why Kamogawa and Nekota are in their current state(plus Dankichi). As for the other characters Aoki and Kimura are mostly for comical relief like most of the times (even Aoki’s serious fight was funny and unreal probably on purpose) and Manabu is yet to reach his best condition in the manga but he is not liked by many it seems so I guess it’s for the best. (I actually like his character specially his expressions during matches and his second fight with Imai but he seems to me just like an extra character just to extend the story and doesn't add anything meaningful. I get it that he is there to show the growth of next generation but if it is going to be the similar rivalry thing that happened in the previous generations then who cares?!...). as for female characters…sigh, Sport genre and good female characters usually don’t go hand to hand(there are some strong or useful ones in some stories still as characters they are not that interesting). also this season shows one of the key messages the manga has: the importance of rivals.\\n\\n\r\nThe animation doesn’t seem too much improved to be honest specially when you watch Kuroko no baske’s second season and see the improvement there in the short time it had from it’s previous season(although they didn't keep it up till the end) but it still feels a little cleaner and sharper than before. voice acting is strong just like previous seasons although Kamogawa’s voice actor passed away (rest in peace) so they had to replace him. Sadly they replaced him with Miguel’s voice actor but many probably don’t even remember Miguel so who cares and they might not even adopt Wally’s story so he might not be needed since if there is going to be a fourth season they might go for another epic fight or something (Volg’s fight would be good if they could somehow include it too since they had to show Volg this time too so it would be cooler narrative-wise but guess for that reason they should go for Randy J too.). also Coach’s voice in his earlier days didn't fit him(it is done by Mamoru Miyano mostly famous for Light Yagami) it was obvious they were just trying to use a famous Voice actor cause he is an important character but to be honest the fact that it doesn't fit is not a bad thing cause not all characters should have voices that matches their faces or style and as long as voice actors do their job fine they are fine. As for OP and ED I didn’t enjoy them although they made a smart use of a front page of one of the chapters in the ED which I liked.\\n\\n\r\n2013 was filled with great sport anime like Yowamushi pedal, Kuroko no Baske Season 2 and Diamond No Ace and sport fans are hopefully pleased. Hajime no Ippo Rising doesn't lose to those anime of course and it is a worthy adaptation. also Hopefully George Morikawa will start another Takamura fight soon or something as epic so Madhouse gets more tempted for another season.\\n\\n",
            "date": "2014-04-04T23:49:00+00:00",
            "helpful_count": 25,
            "mal_id": 138727,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/131787.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/amirhoss",
                "username": "amirhoss"
            },
            "url": "https://myanimelist.net/reviews.php?id=138727"
        },
        {
            "content": "I think I just wrote review for this season in a panel made for Hajime No Ippo: new Challenger \r\nDon't know how that happend but I will just copy the review here, my bad :/\r\nFinally, we get to see Hajime no Ippo third season, titled \"Rising\"\r\nThe story continues, and that infinite grow of our hero Ippo is also following the epic story that this anime is offering.\r\nI wouldn't call this an \"normal\" review, because I might be comparing this season to others and I will point out some most important notes that this season had to offer.\r\nEvents in this season:\r\n- Ippo is still a championof Japan in featherweight category, and he is ready to defend it untill the end, and in this season we have two fights.One of them is much more bigger and most of the first half of the season is dedicated to that one fight.\\n\r\n- Takamura fighting for WBC middleweight champion of the world\\n\r\n- Nekota's and Kamogawa's arc - their past\\n\\n\r\nIt's just a quick look to \"most important\" events in Ippo this season, but this events put together, with Ippo's style of doing thing is just pure awesomeness.\\n\r\nIf I had to compare, this season may be the weakest one of all three, but in some aspects this season did the best job, amazing job. That job would be the presentation and development in certain characters. The way they brought some characters to some new level of depth is clear evidence of how Hajime no Ippo have amazing characterisation. Mostly I'm talking about Aoki, Umezawa and even Volg, Sendou, Kamogawa.\\n\r\nIf I had to put one flaw(even if it's not flaw), that would be Takamura vs Eagle fight. There wasn't enough build up to it and introduction to Eagle, the way that Takamura was preparing is not shown well enough and it didn't awakened emotions I felt during his fight with Hawk in \"Hajime no Ippo: New Challenger\" . And most of you watchers know on what scale of epic was that fight. This fight didn't felt so big and important, comparing it to Takamura vs Hawk, It might be just 60% of excitement, emotions and goosebumps\\n\\n\r\nIn terms of humour and comedy, Ippo never disappoints. Aoki and Takamura mainted that bright and funny, refreshing atmosphere that only anime where big focus is cast on friendship and humour can make. Bond these characters from Kamogawa gym share never ceases to amuse and make me laugh or even cry.\\n\\n\r\nAnimation is great and even differs from the previous season. Body movements are better and expressions on character faces are much more realistic than they were.\\n\r\nFights are amazing, but I think they got a little bit darker, if I could put it like that. There is no motivational and epic soundtrack in the climax, conclusion of the fight that makes you want to start jumping and exercising all over the house, instead of that, there is some more serious and \"creepier\" music that wakes uncertainity in you on who might be the winner of the fight. Anyways, fights are still outstanding and sound, music is great too. Voice actors did amazing job.\\n\\n\r\nThe whole season is filled with that old, comic and amusing atmosphere,a good dose of harsh reality and even stronger dose of motivation to try harder, keep believing in yourself and your dreams.\\n\\n\r\nI can't wait for season four\\n",
            "date": "2014-07-16T08:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 152305,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2945293.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/invinsiblstanley",
                "username": "invinsiblstanley"
            },
            "url": "https://myanimelist.net/reviews.php?id=152305"
        },
        {
            "content": "This anime is by far my #1 favorite. In this review I will not just be reviewing Rising, but the entirety of the anime seasons (Hajime No Ippo, New Challenger, and Rising). The movies themselves are good, but will not be included here.\r\nHajime No Ippo is a long running anime with about ~125-127 total. I first learned about it from a friend and this is probably the 3rd or 4th anime I've watched (the others were fairly short). At first I was apprehensive about watching this due to its length and it being only about boxing.. but now that I've finished it, I'm left wantingmore. This series is what really makes me appreciate anime and its last episodes are always on my mind, along with all the good moments I've had throughout watching its run. This anime has amazing storytelling, hilarious comedy, THE best character development I've ever seen, great action sequences, and the most importantly; this show has a lot of heart. While there are many animes out there with some of these good elements, none of them pull them off as perfectly as this one does. The funny thing is, most people find their favorite animes through their favorite characters (whom they relate to), and while there are certain characteristics of the characters that are relatable; there are none that I can truly relate to entirely. With that said, there is no bias here.\\n\\n\r\nThis speaks for the entirety of the series. Since this is on the Hajime No Ippo: Rising section, I may as well review this season specifically a little bit. I'm not going to lie, the first 2 episodes were ok, they're nothing special. The real enjoyment begins at episode 3 and up. Its hard to say that this season is the best one given how long the first season is, but this one is definitely the most memorable due to the way it executed the story, allowing you to remember the whole season instead of chunks of it (like the first season, which may be because of its length). Something that may be considered negative is the fact that Ippo is only the center of the season through the first half of it (maybe up to ep17?). But it makes up for it by paying more attention to some of the characters who have had less development in the last 2 seasons. After Shimabukuro, all of the main fights are good... of Bryan Hawk quality. Finally, this season just had so much heart, especially at the end. This piece is a minor spoiler, but the last 2 episodes focus on the past with Coach Kamogawa/Nekota and it is a MUST watch. Out of all the episodes of the series, the last 2 are a strong mix of sadness/happiness that will leave a mark in the hearts of anyone whos followed the series from the beginning.\\n\\n\r\nWatch this anime.. its a: 10/10\\n\\n",
            "date": "2017-12-18T00:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 265479,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6750153.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PleasureMachine",
                "username": "PleasureMachine"
            },
            "url": "https://myanimelist.net/reviews.php?id=265479"
        },
        {
            "content": "Please note before continuing I reference my reviews on the previous installments of Hajime no Ippo a little bit in this review so you might be a little lost if you haven't read the first two.\r\nThis installment of the series kinda does what I made reference to in my review of Hajime no Ippo: New Challenger. It's quality for me has dropped compared to the previous generations. Do I think this totally ruins the show...? Hell no, but I'll explain in more detail below exactly what I think the reasons for this is. I know this might cause a lot of rotten tomatoes, banana peels,and empty cans to be thrown at me but nonetheless... HAJIME! (I couldn't resist)\\n\\n\r\nAs for the start of the show, it picks up pretty much right where \"New Challenger\" left off. We get to see a little more of Makunouchi's distant past at first and then goes into the fight that was peaked at the end.\\n\\n\r\nTo be honest I noticed that the main aspects that I've loved about the show up till now are kinda broken in \"Rising\". First things first; \\n\r\n1. The \"One-Two\" lost has lost its \"Two\" In none of these bouts do we ever really get the main strength of any of the Kamogawa Gym members opponents. They kind of just appear. That leads me straight to the next...\\n\r\n2. They kind of exist just to push the story along a little bit, fight, then exist stage left. There wasn't really a lot of \"meat and potatoes\" before the fight of any kind here. Feels like we just get peas and carrots in this one when compared.\\n\r\n3. The fight's didn't exactly lack excitement but it felt kind of different. It felt as though the commentator kind of took a back seat. To be completely honest I'm not sure if that's because the commentator had less lines in this series or if the commentator just didn't bring the same drama and excitement to the table this time around.  \\n\\n\r\nI'll compare Hawk from \"New Challenger\" to Eagle of \"Rising\" for the \"meat and potatoes\" because it's the best way I can express what I mean without spoiling to much. There wasn't A LOT of expansion on Hawk by any means but that can be said for just about anyone previously in the franchise outside of Ippo and Takamura but Eagle kinda just lands in Japan walks a little bit, says \"I need to find out why xyz happened\" and then BOOM they are going at it in the ring. It felt really empty for me in a show that has always done a lot with so little if that makes sense. Sawamura's portion of the series was an exception and for me he was a little too wild. I think they did a better job with Hawk, just barely stopping before going over the line with him in \"New Challenger\"\\n\\n\r\nIt did kinda feel like I was watching an OVA as opposed to the actual TV series during the last 3 or so episodes but they were pretty interesting. I might be in the small section of the crowd on that one\\n\\n\r\nAfter all is said an done, I don't dislike this part of the franchise, I just think its a bit below the others. The number rating might tilt things but to be honest if I could, I'd give the first two a 12 outta 10 which illustrates a little better why an 8 isn't bad but definitely marks a difference for me in comparison.\\n",
            "date": "2018-01-16T20:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 268790,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284557.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tactician",
                "username": "Tactician"
            },
            "url": "https://myanimelist.net/reviews.php?id=268790"
        },
        {
            "content": "I'm a huge Hajime no Ippo fan, I love the anime and manga, so when I heard of this latest season coming out I was excited because some of my favourite fights from the manga were going to be animated. \r\nBut honestly I'm disappointed not in the quality, or art but in the material. What I like about this series is the training, prep, and hardwork that builds up to the fights. The previous series showed that in detail which got you pumped up for the amazing fight. \r\nBut this season skips what I think are the best parts of the Hajime no Ippo storyand jump right to the fights. It's understandable since the season is only 25 episodes, but I still felt disappointed.\\n\\n\r\nSo if all you want to see are the amazing boxing matches then you'll love Hajime no Ippo: Rising, but if your like me and enjoying the training and build up to the fights a lot you'll probably feel a bit disappointed, compared to the prequels.",
            "date": "2016-07-03T03:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 222924,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5215547.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kepgine",
                "username": "kepgine"
            },
            "url": "https://myanimelist.net/reviews.php?id=222924"
        }
    ],
    [
        {
            "content": "Representing a sports anime that have over two decades of history, Hajime no Ippo Rising returns in this third installation of its previous predecessors. It only takes one ring to bring together a collective cast of colorful characters, superstars of all shapes and sizes under one goal: to make a name of themselves and earn the respect of the world. Hajime no Ippo Rising accords for a perfect example of an anime based on the foundation of its theme not only in boxing but also in exploring the dynamics of its characters. It’s their time to rise and shine.\r\nBased off the manga of the samename, George Morikawa is famously known for his work known as Hajime no Ippo. The franchise has gained international attention for its exquisite presentation of the sports genre. Focusing on Ippo Makunouchi, the series has set itself as a leading paradigm to the development of his character. Not only does he get the spotlight but the show itself also explores its other cast members under one unity – the conception of boxing and its wonders.\\n\\n\r\nBeing the holder of the Japanese Featherweight Champion holds a variety of meaning for Ippo. Responsibility comes as an archetypical word because top contenders will come after him. It’s his goal to defend his title, night after night, week after week, and possibly years after years. Ippo has already earned the respect of his peers but always strives to continuously aim for bigger heights. To do that, he faces off against powerful adversaries that truly tests his limits in the ring. Hajime no Ippo is known to explore characters both in and outside the ring for that matters. Well-developed stories also connects the characters together and formulates their development. For Ippo, it focuses both internally and externally on his character. This is extended by the clever usage of flashbacks involving his childhood. It’s a childhood that started out as pleasant but later turned cataclysmic after one faithful event relating to his father. We can feel Ippo’s emotions and what he’s been through that has left a painful scar in his mind. Whether in or outside the ring, Ippo identifies himself as a man of integrity – someone that stands out as a great example of a hardworking individual. The third season personifies his character in a way that is relatable and inspiring.\\n\\n\r\nIppo isn’t the only character of this series though. Born from Tokyo, Japan, Takamura Mamoru returns to make his dream come true – to become the WBC champion of the world and eventually conquer all the other weight classes It’s no easy task with the opponents that he faces off such as David Eagle from America. In contrast with the brash boxer that Brian Hawk showed to the world, David stands out more as a motivator with an easygoing personality. There’s a sharp turn in this presentation as Takamura faces off an opponent that is respected for his mannerisms. At the same time, we witness first hand at how much Takamura improved since his most prominent matches from the previous season. No doubt too does Ippo improve with his abilities when he takes on opponents. It’s riveting to see how characters in this show make names for themselves by going through obstacles, battling their internal obstructions, and showing the world that anything can be achieved with purpose.\\n\\n\r\nEven Aoki Masuru gets his highlights in the series for his efforts. While largely downplayed as a mediocre competitor in the boxing world, Aoki’s development is almost instrumental thanks to his unorthodox skills. Despite being still presented as a comic relief on most occasions, Aoki learns the strenuous effort to make a name in the boxing world. He takes on opponents that puts him at the edge of struggling. However, it’s creative in this way to see Aoki in the ring from a different light. We tend to doubt Aoki’s skills but there’s no doubt the man has the guts to perform in front of an audience at his best. At the end of the day, Aoki is one of those guys that puts on a show you won’t forget whether it’s a win, loss, or draw. Even if he’s not the greatest sports entertainer in the world, Aoki represents a character of dignity for his efforts.\\n\\n\r\nAction returns as a classic style that Hajime no Ippo fans should be familiar with. From the moment the bell rings all the way until the last drop of sweat hits the ring stands for an intensely pushed match of integrity. Camera angles are aimed strategically in motions that focuses on every move the characters make. At the same time, the boxers show on their face the feelings of guts, boldness, audacity, courage, power, and experience. It defines these characters as visions of the future for their skill. After all, boxing is a difficult sport to master and perfect. It may take months, years, or a lifetime of training. Some of the characters may make the sport seem like easy but their guts shows more than just punching each other in the faces. It takes skill with various moves such as Ippo’s Dempsey Roll and risks too. Does anyone think becoming a champion is possible without taking a risk? Of course not.\\n\\n\r\nCharacter relationships still stands out as dynamic despite the intense focus on its competitions. In particular, we witness several cases of Ippo’s progression with his love interest, Mashiba Kumi. Unfortunately, the both of them doesn’t hit home base and their relationship doesn’t move forward much. Despite this, it’s clear that they share a mutual connection that can be bittersweet in a tough world of boxing. The Kamogawa Crew’s relationship also stands out as a promising connection between its members. At times, they can be interpreted as rivals. Other times, its members are like a brotherhood or even a family. Being without a father after coming out of childhood years, Ippo’s relationship with the crew becomes a prominent motivation for his character. The bromance and platonic closeness with its crew members stand out as team that unites each other despite some of their clashing ideologies.\\n\\n\r\nOn most parts, Hajime no Ippo’s story classifies itself as development but some parts can also feel slow with its fillerish progression. A few episodes seems like a snooze in the breeze with little more than a typical slice-of-life value. While this isn’t entirely a drawback, it can be staggering and tests the patience of fans who are eagerly wants to watch what’s ahead. Romance doesn’t also hit anywhere in this third season so fans can give up the dreams of their ships. Some comedy bits also becomes stale or even a banality. Yet, there is also a different side to the third season featured prominently in the latter half of the show with its flashback dynamics. In essence, Hajime no Ippo Rising shines itself at best when it focuses on its characters and story. The other parts aren’t entirely back-stab but sometimes just doesn’t work out in this installation. \\n\\n\r\nThe artwork stands out for its original design of the characters with improved artistic values. Most of the boxers classifies and distinguishing themselves with their styles. The battle scars and wounds serves as a proof of their journey as professional boxers. At the same time, there are characters that identity themselves as icons in the industry. Female characters aren’t a prominent feature but does offer credibility with their innocence, compassionate nature, and sometimes obsessiveness with certain factors.\\n\\n\r\nSoundtrack offers virtue that are defined by the characters with their abilities. Each of the characters’ voice mannerisms gives an impression of who they are. The OST matches well for every move, every match, and every episode with its instrumental score. Sound effects of connecting punches are vigorous and is dynamic with the results. The OP and ED song are coordinated with a parallelism with most of the characters’ journeys as a boxer. It gives a feeling of synergy between each match. The characters embraces their beliefs while trying to climbing to that ladder of world championship. \\n\\n\r\nHajime no Ippo Rising isn’t this a show about throwing a punch into someone’s face. While you will witness a lot of that, the show explores characters in paths with compelling depth in a variety of ways. It’s amazing that in just a small ring that so much can be shown. Thanks to Hajime no Ippo, fans will not just see but learn about its concepts with its innovations. It’s not just experimental but inspiring to see how characters come so far with their dreams. That’s because boxing isn’t just a sport but also an art piece. The paintbrushes are the characters and the product represents its beauty for these rising superstars.\\n",
            "date": "2014-05-06T17:09:00+00:00",
            "helpful_count": 78,
            "mal_id": 142521,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=142521"
        },
        {
            "content": "Taking place where New Challenger leaves off, the series starts from Ippo vs Shimabukuro Iwao to the conclusion of the story of Kamogawa in his youth in Post World War II Japan. Naturally, a new anime installment of Hajime no Ippo did excite me. I mean, with New Challenger ending, the animators have nearly 60 volumes to catch up on as opposed to being 60 volumes ahead unlike a certain Studio Pierrot series which you can easily conclude is. \r\nFor now, I would mostly like to focus my personal issues with this season as someone who actively reads the manga and is up to datewith the current chapters. Even though previous installments have skipped over parts from the  manga (such as Aoki’s black face in season 1; omitting Hayami vs Kobashi before Ippo vs Sanada in Championship Road; taking out Okita’s under card fight before Date vs Martinez in New Challenger, etc), but this takes it a whole lot more and so much important information I thought was necessary to the story and the character development were entirely taken out. For example, there is no build up to the Shimabukuro fight and it takes away why is he such a distinct opponent. Plus, in the manga, when Shimabukuro and Ippo meet at the ocean near Ippo’s home, Ippo’s mother actually seems romantically interested in Shimabukuro until he reveals he is actually 22, a year older than Ippo which brought some comedy to their relationship and adds more to how they connect as \"men of the sea\" with their backgrounds. \\n\\n\r\nTwo other major issues I have was taking out how Aoki developed the look away and VERY IMPORTANT elements of Sawamura’s back story. There was a story behind how Aoki developed his look away and I thought that was funny and how it was presented in the manga and the cut-scenes from the PS2 games. As for Sawamura, I felt the anime left out two of the more important aspects of his story; how he meets Sendo for the first time along with how deep the relationship between Sawamura and Kawabe goes. When Sendo meets Sawamura in the hospital in the manga, he actually reveals to Sawamura why Kawabe cares about him so much. I was upset that part was taken out because it was the very reason why Kawabe cares so much about Sawamura. For an anime so far behind in the manga, I just find it inexcusable to take all this important material out and rush it.  \\n\\n\r\nBut I am satisfied the series got around to animating the young Kamogawa and Nekota story arc, but I felt the placement made no sense to me not because it takes place much sooner in the manga, but that Anderson is not an appropriate character to compare with to Eagle as opposed to Hawk. Nishimura came back to direct the last four episodes and he did that those episode justice. Nothing was taken out and it really captured the emotion. \\n\\n\r\nBut I feel this series deserves to be much longer as well. There are other great fights coming up and some shitty ones lol.\\n\\n\r\nWell, the quality and resolution is more in tune with New Challenger under Shishido Jun's direction and the fights are still awesome. What impressed me most was Takamura vs Eagle. I didn’t think the fight was that special in the manga but animated, it got me really interested and immersed and changed my mind about it. I felt Eagle’s fear and respect for Takamura and Takamura’s tenacity at the same time while watching it. I think Eagle’s white trunks from the games worked enough for me but the golden color does add the naturally appropriate compliments to his nickname, \"Golden.\" I also loved how they colored his suit in the press conferences making him look like an American GTO in a way. \\n\\n\r\nIf there is any reason to watch this season, it is most certainly for Ippo vs Sawamura, one of my top 3 favorite fights from the manga. Sawamura’s bullet was handled more realistically than I anticipated to how it is pulled off in the PS2 games despite the red effect. It is well paced and positioned as opposed to awkwardly angled in the games. This is just one of the few fights that I felt that scared me because of Sawamura’s mix of brain and brawn and this is one of the few times that Ippo came close to wanting to kill someone. Hawk may have been a maniac, but Sawamura is a whole different class of beast that crosses a line that Hawk didn’t. \\n\\n\r\nThe only fight cut significant short is just the Shimabukuro one and I felt an important aspect in respect to the fight that pays some homage to the second Ippo/Miyata spar was taken out. I felt that quality was what would have made the Kazuo story arc, which wasn’t in the manga until after the Sawamura fight, would have been an effective first episode in context to the Shimabukuro fight. Also, the build up and the training was a very good story arc and Ippo builds up his muscles and cardio. I can understand cutting out the weigh-in (which was funny) but the training I thought could have been touched upon as well. \\n\\n\r\nMiyata’s fight with Medgoen Dachboy was excellently paced and is faithful to the manga. The fights are just simply still the same quality with the exception of Ippo vs Shimabukuro. \\n\\n\r\nAnd the animation of the Kamogawa arc is just amazing and brings back a certain distinction that Nishimura gave that you can only see in the first season. He brings a distinct sense of crisp and detail to his design and movement and I am glad he was selected to do this and it just brought me back to season 1 in a lot of ways. \\n\\n\r\nWell, I would like to open this review by saying that I do miss the performance of Utsumi Kenji as Kamogawa. God or whoever he may be with rest his soul. He was a great voice actor for Kamogawa along with his other iconic roles, most especially as Raoh from Hokuto no Ken. As Kamogawa, he had this great presence and authority in his voice. His new seiyuu, Iizuka Shozo, previously the voice of Miguel in New Challenger and most famous as Ryu Jose in the first Gundam series really captures his gruffness but has a different kind of tone, but works in terms of the character, but Utsumi will always be Kamogawa to me regardless. It is also sad that another seiyuu legend, Nagai Ichiro, who plays Nekota also has passed on but managed to record some lines prior to his passing and I always love how he ends his sentences in “da ni.” And he was also most famous as the voice of Happousai from Ranma 1/2. \\n\\n\r\nBut my favorite performance this season was that of Miki Shinichiro as Sawamura, who you may know as the voice of Takumi from Initial D. I am used to Miki Shinichiro as a good guy, but as a bad guy he is excellent. Prior to this series, Hiyama Nobuyuki, the voice of Hiei from Yuu Yuu Hakusho was always my personal choice for Sawamura but Miki’s performance truly captures the character. What really made the character with his performance was this dry throat kind of tone he brings. It really represents more a “thirst” for his  meat obsession as opposed to a “hunger,” and I think the “thirst” tone as opposed to a “hunger” tone really represents the sadistic tendencies of Sawamura. Because when he wants meat, he really wants blood and the portrayal really made me love the character more.  \\n\\n\r\nMiyano Mamoru who is more famous for quieter characters such as Light from Death Note and Setsuna from Gundam 00 surprised me as Kamogawa who tends to be more of an intense character. He managed to capture both Light’s softness but also brings that gruffness as the old Kamogawa as well. The young Nekota also captures the characteristics and I can’t complain. \\n\\n\r\nKosugi Jurota as Anderson was also awesome. He voiced Kujo Jotaro from Jojo’s Bizarre Adventure so you could never ask for a better seiyuu. And I thought Kiuchi Hidenobu, the voice of Tenma from Monster, was an interesting choice as Eagle. He brings out his \"cheerfulness\" and a silly accent at the same time that works for the character. I really had no expectation of who could play Eagle but he does the job. You gotta love how he says \"Jesus.\" I just wish New Challenger kept more of Hawk's Engrish as well. \\n\\n\r\nThe music is a great improvement and excellently uses tracks from the first season, second season, and has a great original one for this as well. I felt the tracks from season 2 were more properly used in this season. The songs for Sawamura are just perfect with his dark and sadistic character. The songs in the Takamura and Eagle fight were also great. \\n\\n\r\nWell, again, as a manga reader, my issues is that this series is too damn short and this series cut out some very important details that helps the story and development. I just felt this series is very incomplete. But the animation and the soundtrack and voice acting brings a different kind of completeness and satisfaction. I just hope they don't do this again for future anime installments.",
            "date": "2014-03-29T15:26:00+00:00",
            "helpful_count": 64,
            "mal_id": 137769,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ParaParaJMo",
                "username": "ParaParaJMo"
            },
            "url": "https://myanimelist.net/reviews.php?id=137769"
        },
        {
            "content": "Intro:\r\nHajime no Ippo:Rising continues the story presented in the previous 2 seasons. This 3rd season was just a distant shadow of what Hajime no Ippo once was.\r\nAfter the first season ended the series went downhill, not in animation quallity but in the material. \r\nStory: 6/10\r\nI wish I could rate this a 9/10 as I did for the first season, unfortunately that will not happen and here is why.\r\n  - Why the heck is this show named \"Hajime no Ippo\" and not \"Hajime no Everyone Else\"? Ippo did not get any attention in this season, with just one single fight animated I was dissapointed tosay the least. Like in the season 2 of the series, the story is not focused on Ippo’s character. Out of 26 episodes, there are around 2 showing Ippo’s only fight and about 1 more showing his training and state of mind. \\n\r\n  - There was not one fight that I enjoyed this season, not even Takamura’s world title match against Eagle, since his opponent was a classic boxer and there was no real tension, like in the Takamura-Hawk fight.\\n\r\n  - The story brings nothing new to the table, the same routine, Takamura getting another world champion belt, Ippo defending his title as the Featherweight Champion of Japan, Aoki and Kimura just goofing around with their fights and so on.   \\n\r\n  - The comedy and humour are as good as always but the story itself is repetitive.\\n\r\n  - What is the greatest power/ability in Hajime no Ippo? The answer to that question is: Being a main character. After being facefucked rapidly Ippo is still fighting like nothing ever happened, the only explanation being either \"he has the Japanese fighting spirit\" or \"those eyes are glowing green\". \\n\r\n  - The show has gotten extremly unrealistic. A boxer can get hit by a truck 40 times and still get up if he is japanese and has \"the japanese fighting spirit\". Give me a fucking break!\\n\r\n  - Wasn't Kumi supposed to become Ippo's girlfriend? They spend the night in the same room, they went on multiple dates, they went to the beach togheteher, etc. It has been 3-4 years since Ippo met Kumi, did they forget about how much Ippo likes Kumi and umi likes Ippo? Well, I guess the answer is \"fuck that, who remembers it\"\\n\r\n  - During the previous 2 season it was made clear that Ippo had the most destructive punches in all Japan. That creates the question: Why does a fighter that has such great power but lacks the skill or defense to become a great champion and a World Title challenger need and focuses on a predictable and risky tehnique such as the \"demsey role\" that aims to put even more power in his punches at the cost of possibly getting KO'd? Why does a strong fighter that constantly gets beaten up focuses on increasing his ofense and not on his dodging/defense skills? Why does it take 20 of Ippo's strongest punches to take down his opponent? This has gotten to the point that it is annoingly stupid... I do know that the \"dempsey roll\" is a technique Ippo came up with after his only deafeat and that may be a reason for his passion and obsesion with it but those are not the actions of a professional boxer therefore proving Ippo does not have the mind of a professional boxer.\\n\r\n  - The way Ippo fights, constantly getting severly injured in every fight would lead to his early retirement due to severe brain damage, fact that is stated in the anime as well, but no countermeasures are taken against it nor any side effects take form. No matter how hard Ippo get punched, the next day he will be good as new.\\n\r\n  - After Sawamura fought dirty and commited many fouls (hitting Ippo while he was down, elbowing, etc.) and the spectators constantly booed him, when the predictable win of Ippo happened, the crowd started cheering for Sawamura, yelling \"you did great Sawamura\"; \"come to the Hall anytime\"; \"we'll have your back\"; \"great fight\". The writer needs to take a breath and sort his shit out before writing anything, in what world would that happen?\\n\r\n  - In season 2, Ippo's coach said \"from now on, it's time to challenge modern boxing itself\" but nothing of that sort happened in season 3.\\n\r\n  - Ippo dosen't have a clear gole anymore. Ippo's original goal was to find \"what it means to be strong\" then Ippo's goal was to become the Champion and then he received from Date the duty and challenge of defeating the Featherweight World Champion, Ricardo Martinez, the superchampion with no losses and more than 64 wins by KO. Did Ippo forget about all that?\\n\r\n  - I enjoyed the background story of Ippo's coach, but it was not the right time for it to pe showed.\\n\\n\\n\r\nCharacters: 6/10\\n\r\nThe characters do not get any development, they still have various diffrent personalities but nothing new about them has been shown after the first/second season ended.\\n\\n\r\nI am truly disappointed by Ippo's character. Ippo has zero character development, he is the same old, easily intimidated school boy, he is the same guy as in the first season. \\n\r\nIn the gym Ippo is all fired up but as soon as he gets in the ring he is scared of everything. Can't he fight like a real Champion where he only gets grazed, where he performs impressive dodges and does shocking things that make his opponent back the fuck up and carefully think about his next move? No, after 3 seasons I guess it will never happen.\\n\\n\r\nAt one point, the bad and \"evil\" Sawamura punches Kumi (Ippo's future girfriend) and Ippo does nothing but prevents Kumi's brother form taking revenge. Yeah, a real main character Ippo has become, cowering before just about anyone.\\n\r\nIppo is not a good boxer skill wise, he is just a caveman with boxing gloves, his fights and skills are not improving much, he gets hit by any no-name boxer, Ex: he gets injured by a fisherman boxer, he gets beat up by his former apprentice that has only boxed for 2 years and the list goes on. The point is that no matter who Ippo's opponent is, Ippo is going to get badly beaten up and then he will win by a KO. Repetitive much?\\n\\n\r\nSawamura's character, the bad guy Ippo predictably defeated seems to be taken from a cartoon. Sawamura is one-dimensional, cliched, a Japanese copycat of Brian Hawk.\\n\\n\r\nThe main character of the series should have been either Takamura or Myata, they are much better main character material.\\n\\n\\n\r\nAnimation: 8/10\\n\r\nThe animation has not improved much compared to the 2nd season, that being said, the animation is still great and the fight are well coreographed.\\n\\n\\n\r\nSound: 5/10\\n\r\nThe opening theme is horrible, I always skipped it. The ending theme is decent, the OST is average, some of the actor's voices are irritating.\\n\\n\\n\r\nEnjoyment: 6/10\\n\r\nI did not enjoy this season except for part of the jokes and the animation. For the little screen time Ippo received, I have had enough of seeing Ippo struggle with every nobody boxer. His matches are getting annoingly repetitive. \\n\\n\\n\r\nOverall: 6.4/10\\n\r\nThis show did not start out unrealistic but has gotten progressively extremly unrealistic as it has gone to the point of being stupid.  I would recommend this series just for the first season.",
            "date": "2017-02-01T08:29:00+00:00",
            "helpful_count": 32,
            "mal_id": 239651,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5778347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cinefil_original",
                "username": "Cinefil_original"
            },
            "url": "https://myanimelist.net/reviews.php?id=239651"
        },
        {
            "content": "First of all a big thanks to George Morikawa because he did something nearly impossible with Hajime no Ippo. He managed to keep his story interesting and his comedy fresh even after all these years. Sure it has it’s weaknesses(for example some short chapters in the manga plus some repeated stuff in the story etc) but it is still a great accomplishment that only a few are capable of.\r\nThe story is about Ippo a kid without any purpose in his life and fate decides to make a boxer out of him. This season focuses on his challenges to keep his special move sharp and fresh,the Dempsey roll. in the manga the reason for the focus on the Dempsey Roll is explained better but since madhouse tried to handpick parts of the story there had to be some changes so they could fill it all in their schedule which is still no biggie since Ippo is not the best part of the story for me anyway(cause most of the times we know he is gonna win so it takes the tension away for me at least). His coach Kamogawa and his hero Takamura are the best parts and both get to shine in this season. Takamura aimed to rule 6 classes and his fights are always exciting and we get to see his second conquest in this season with a classier opponent this time, Eagle. A man that is exactly the opposite of Hawk, not just in style but also in personality. This is specially for American  so mangaka could show better to them that he is not against Americans!\\n\\n\r\nMadhouse decided to put the best part at the end of the season of course and along with some changes they put the Kamogawa background story at the end of this season which is probably the best part of the whole story and it explains why Kamogawa and Nekota are in their current state(plus Dankichi). As for the other characters Aoki and Kimura are mostly for comical relief like most of the times (even Aoki’s serious fight was funny and unreal probably on purpose) and Manabu is yet to reach his best condition in the manga but he is not liked by many it seems so I guess it’s for the best. (I actually like his character specially his expressions during matches and his second fight with Imai but he seems to me just like an extra character just to extend the story and doesn't add anything meaningful. I get it that he is there to show the growth of next generation but if it is going to be the similar rivalry thing that happened in the previous generations then who cares?!...). as for female characters…sigh, Sport genre and good female characters usually don’t go hand to hand(there are some strong or useful ones in some stories still as characters they are not that interesting). also this season shows one of the key messages the manga has: the importance of rivals.\\n\\n\r\nThe animation doesn’t seem too much improved to be honest specially when you watch Kuroko no baske’s second season and see the improvement there in the short time it had from it’s previous season(although they didn't keep it up till the end) but it still feels a little cleaner and sharper than before. voice acting is strong just like previous seasons although Kamogawa’s voice actor passed away (rest in peace) so they had to replace him. Sadly they replaced him with Miguel’s voice actor but many probably don’t even remember Miguel so who cares and they might not even adopt Wally’s story so he might not be needed since if there is going to be a fourth season they might go for another epic fight or something (Volg’s fight would be good if they could somehow include it too since they had to show Volg this time too so it would be cooler narrative-wise but guess for that reason they should go for Randy J too.). also Coach’s voice in his earlier days didn't fit him(it is done by Mamoru Miyano mostly famous for Light Yagami) it was obvious they were just trying to use a famous Voice actor cause he is an important character but to be honest the fact that it doesn't fit is not a bad thing cause not all characters should have voices that matches their faces or style and as long as voice actors do their job fine they are fine. As for OP and ED I didn’t enjoy them although they made a smart use of a front page of one of the chapters in the ED which I liked.\\n\\n\r\n2013 was filled with great sport anime like Yowamushi pedal, Kuroko no Baske Season 2 and Diamond No Ace and sport fans are hopefully pleased. Hajime no Ippo Rising doesn't lose to those anime of course and it is a worthy adaptation. also Hopefully George Morikawa will start another Takamura fight soon or something as epic so Madhouse gets more tempted for another season.\\n\\n",
            "date": "2014-04-04T23:49:00+00:00",
            "helpful_count": 25,
            "mal_id": 138727,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/131787.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/amirhoss",
                "username": "amirhoss"
            },
            "url": "https://myanimelist.net/reviews.php?id=138727"
        },
        {
            "content": "I think I just wrote review for this season in a panel made for Hajime No Ippo: new Challenger \r\nDon't know how that happend but I will just copy the review here, my bad :/\r\nFinally, we get to see Hajime no Ippo third season, titled \"Rising\"\r\nThe story continues, and that infinite grow of our hero Ippo is also following the epic story that this anime is offering.\r\nI wouldn't call this an \"normal\" review, because I might be comparing this season to others and I will point out some most important notes that this season had to offer.\r\nEvents in this season:\r\n- Ippo is still a championof Japan in featherweight category, and he is ready to defend it untill the end, and in this season we have two fights.One of them is much more bigger and most of the first half of the season is dedicated to that one fight.\\n\r\n- Takamura fighting for WBC middleweight champion of the world\\n\r\n- Nekota's and Kamogawa's arc - their past\\n\\n\r\nIt's just a quick look to \"most important\" events in Ippo this season, but this events put together, with Ippo's style of doing thing is just pure awesomeness.\\n\r\nIf I had to compare, this season may be the weakest one of all three, but in some aspects this season did the best job, amazing job. That job would be the presentation and development in certain characters. The way they brought some characters to some new level of depth is clear evidence of how Hajime no Ippo have amazing characterisation. Mostly I'm talking about Aoki, Umezawa and even Volg, Sendou, Kamogawa.\\n\r\nIf I had to put one flaw(even if it's not flaw), that would be Takamura vs Eagle fight. There wasn't enough build up to it and introduction to Eagle, the way that Takamura was preparing is not shown well enough and it didn't awakened emotions I felt during his fight with Hawk in \"Hajime no Ippo: New Challenger\" . And most of you watchers know on what scale of epic was that fight. This fight didn't felt so big and important, comparing it to Takamura vs Hawk, It might be just 60% of excitement, emotions and goosebumps\\n\\n\r\nIn terms of humour and comedy, Ippo never disappoints. Aoki and Takamura mainted that bright and funny, refreshing atmosphere that only anime where big focus is cast on friendship and humour can make. Bond these characters from Kamogawa gym share never ceases to amuse and make me laugh or even cry.\\n\\n\r\nAnimation is great and even differs from the previous season. Body movements are better and expressions on character faces are much more realistic than they were.\\n\r\nFights are amazing, but I think they got a little bit darker, if I could put it like that. There is no motivational and epic soundtrack in the climax, conclusion of the fight that makes you want to start jumping and exercising all over the house, instead of that, there is some more serious and \"creepier\" music that wakes uncertainity in you on who might be the winner of the fight. Anyways, fights are still outstanding and sound, music is great too. Voice actors did amazing job.\\n\\n\r\nThe whole season is filled with that old, comic and amusing atmosphere,a good dose of harsh reality and even stronger dose of motivation to try harder, keep believing in yourself and your dreams.\\n\\n\r\nI can't wait for season four\\n",
            "date": "2014-07-16T08:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 152305,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2945293.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/invinsiblstanley",
                "username": "invinsiblstanley"
            },
            "url": "https://myanimelist.net/reviews.php?id=152305"
        },
        {
            "content": "This anime is by far my #1 favorite. In this review I will not just be reviewing Rising, but the entirety of the anime seasons (Hajime No Ippo, New Challenger, and Rising). The movies themselves are good, but will not be included here.\r\nHajime No Ippo is a long running anime with about ~125-127 total. I first learned about it from a friend and this is probably the 3rd or 4th anime I've watched (the others were fairly short). At first I was apprehensive about watching this due to its length and it being only about boxing.. but now that I've finished it, I'm left wantingmore. This series is what really makes me appreciate anime and its last episodes are always on my mind, along with all the good moments I've had throughout watching its run. This anime has amazing storytelling, hilarious comedy, THE best character development I've ever seen, great action sequences, and the most importantly; this show has a lot of heart. While there are many animes out there with some of these good elements, none of them pull them off as perfectly as this one does. The funny thing is, most people find their favorite animes through their favorite characters (whom they relate to), and while there are certain characteristics of the characters that are relatable; there are none that I can truly relate to entirely. With that said, there is no bias here.\\n\\n\r\nThis speaks for the entirety of the series. Since this is on the Hajime No Ippo: Rising section, I may as well review this season specifically a little bit. I'm not going to lie, the first 2 episodes were ok, they're nothing special. The real enjoyment begins at episode 3 and up. Its hard to say that this season is the best one given how long the first season is, but this one is definitely the most memorable due to the way it executed the story, allowing you to remember the whole season instead of chunks of it (like the first season, which may be because of its length). Something that may be considered negative is the fact that Ippo is only the center of the season through the first half of it (maybe up to ep17?). But it makes up for it by paying more attention to some of the characters who have had less development in the last 2 seasons. After Shimabukuro, all of the main fights are good... of Bryan Hawk quality. Finally, this season just had so much heart, especially at the end. This piece is a minor spoiler, but the last 2 episodes focus on the past with Coach Kamogawa/Nekota and it is a MUST watch. Out of all the episodes of the series, the last 2 are a strong mix of sadness/happiness that will leave a mark in the hearts of anyone whos followed the series from the beginning.\\n\\n\r\nWatch this anime.. its a: 10/10\\n\\n",
            "date": "2017-12-18T00:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 265479,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6750153.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PleasureMachine",
                "username": "PleasureMachine"
            },
            "url": "https://myanimelist.net/reviews.php?id=265479"
        },
        {
            "content": "Please note before continuing I reference my reviews on the previous installments of Hajime no Ippo a little bit in this review so you might be a little lost if you haven't read the first two.\r\nThis installment of the series kinda does what I made reference to in my review of Hajime no Ippo: New Challenger. It's quality for me has dropped compared to the previous generations. Do I think this totally ruins the show...? Hell no, but I'll explain in more detail below exactly what I think the reasons for this is. I know this might cause a lot of rotten tomatoes, banana peels,and empty cans to be thrown at me but nonetheless... HAJIME! (I couldn't resist)\\n\\n\r\nAs for the start of the show, it picks up pretty much right where \"New Challenger\" left off. We get to see a little more of Makunouchi's distant past at first and then goes into the fight that was peaked at the end.\\n\\n\r\nTo be honest I noticed that the main aspects that I've loved about the show up till now are kinda broken in \"Rising\". First things first; \\n\r\n1. The \"One-Two\" lost has lost its \"Two\" In none of these bouts do we ever really get the main strength of any of the Kamogawa Gym members opponents. They kind of just appear. That leads me straight to the next...\\n\r\n2. They kind of exist just to push the story along a little bit, fight, then exist stage left. There wasn't really a lot of \"meat and potatoes\" before the fight of any kind here. Feels like we just get peas and carrots in this one when compared.\\n\r\n3. The fight's didn't exactly lack excitement but it felt kind of different. It felt as though the commentator kind of took a back seat. To be completely honest I'm not sure if that's because the commentator had less lines in this series or if the commentator just didn't bring the same drama and excitement to the table this time around.  \\n\\n\r\nI'll compare Hawk from \"New Challenger\" to Eagle of \"Rising\" for the \"meat and potatoes\" because it's the best way I can express what I mean without spoiling to much. There wasn't A LOT of expansion on Hawk by any means but that can be said for just about anyone previously in the franchise outside of Ippo and Takamura but Eagle kinda just lands in Japan walks a little bit, says \"I need to find out why xyz happened\" and then BOOM they are going at it in the ring. It felt really empty for me in a show that has always done a lot with so little if that makes sense. Sawamura's portion of the series was an exception and for me he was a little too wild. I think they did a better job with Hawk, just barely stopping before going over the line with him in \"New Challenger\"\\n\\n\r\nIt did kinda feel like I was watching an OVA as opposed to the actual TV series during the last 3 or so episodes but they were pretty interesting. I might be in the small section of the crowd on that one\\n\\n\r\nAfter all is said an done, I don't dislike this part of the franchise, I just think its a bit below the others. The number rating might tilt things but to be honest if I could, I'd give the first two a 12 outta 10 which illustrates a little better why an 8 isn't bad but definitely marks a difference for me in comparison.\\n",
            "date": "2018-01-16T20:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 268790,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284557.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tactician",
                "username": "Tactician"
            },
            "url": "https://myanimelist.net/reviews.php?id=268790"
        },
        {
            "content": "I'm a huge Hajime no Ippo fan, I love the anime and manga, so when I heard of this latest season coming out I was excited because some of my favourite fights from the manga were going to be animated. \r\nBut honestly I'm disappointed not in the quality, or art but in the material. What I like about this series is the training, prep, and hardwork that builds up to the fights. The previous series showed that in detail which got you pumped up for the amazing fight. \r\nBut this season skips what I think are the best parts of the Hajime no Ippo storyand jump right to the fights. It's understandable since the season is only 25 episodes, but I still felt disappointed.\\n\\n\r\nSo if all you want to see are the amazing boxing matches then you'll love Hajime no Ippo: Rising, but if your like me and enjoying the training and build up to the fights a lot you'll probably feel a bit disappointed, compared to the prequels.",
            "date": "2016-07-03T03:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 222924,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5215547.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kepgine",
                "username": "kepgine"
            },
            "url": "https://myanimelist.net/reviews.php?id=222924"
        }
    ]
]