[
    [
        {
            "content": "All the daughters and sons of the king\r\nWere one day forced into competing\r\nTo see who'll take the crown\r\nAnd inherit the town\r\nIt's a tough job for every sibling\r\nSo the lot of them started campaigning\r\nWith the hope of some supporters gaining\r\nSince the people would choose\r\nNot only who would lose\r\nBut also the next king to be reigning\r\nThey were all being watched at all hours\r\nEverywhere except maybe the showers\r\nThey were shown on TV\r\nFor the townsfolk to see\r\nAs they exercised their super powers\r\nOh yes, one of the siblings could fly\r\nAnd another one could multiply\r\nOne could summon a chair\r\nAs if out of thin air\r\nIf her bank account doesn't run dry\r\nAnd thuseach and every single scion\\n\r\nSought to be someone you could rely on\\n\r\nBut life will find a way\\n\r\nIt's just another day\\n\r\nIn the Castle Town called Dandelion\\n\\n\\n\r\nJoukamachi no Dandelion is a rare series in the sense that it is effectively the anime equivalent of a celebrity variety show. Originally a 4-koma manga, the story follows the royal Sakurada family, consisting of the king and queen as well as their nine children. However despite the tiny country seemingly being a monarchy, the actual decision on which one of the princes and princesses will become the next heir to the throne is done by an entirely democratic process.  They have to go campaigning in the streets and make political speeches in order to attract voters and then hopefully win the upcoming election and thus become the next king. To aid this, there is a total of 200 security cameras distributed throughout the town which follow the Sakuradas’ every move and broadcast it immediately on national TV for the population to see. So it’s basically a sitcom in that sense.\\n\\n\r\nTo add to that already quite erratic premise, all the Sakurada children also have their own individual super powers for whatever reason, including gravity control, instant learning, teleportation, object creation, mathematical future prediction, self-cloning, manipulation of biological growth, superhuman strength, as well as communication with animals and even inanimate objects. In short, there’s a lot of variety in this anime and it does a surprisingly good job at giving each of the Sakurada siblings a respectable amount of screen time and characterization.\\n\\n\r\nBecause of its 4-koma origins, the anime consists of many smaller parts and most of the episodes are divided into two, sometimes even three short stories instead of a single one spanning the entire episode. Despite this however, it still manages to progress the overall election process fairly well throughout the anime. The shorter segments also mean that the large number of main characters still all get a decent amount of storytelling dedicated to them individually, which helps a lot.\\n\\n\r\nI don’t think you can really call anyone a protagonist in this story, but the one who gets the most screen time is Akane. She’s a very typical HanaKana moeblob who is pretty much the spitting image of Onodera Kosaki to me. I have a bit of a problem with her in the sense that she’s so unbelievably shy that sometimes when she gets embarrassed even I’m starting to feel awkward just by watching her, which ticks me off a bit. But either way there are a ton of characters in Dandelion so I’m pretty sure everyone will find at least someone amongst them which they can grow fond of.\\n\\n\r\nOverall, Joukamachi no Dandelion is hardly a masterpiece by any means, but it manages to stand out a bit from your typical slice of life comedy due to its unusually hectic premise and story. If nothing else, I have almost nothing straight-up bad to say about it, which is more than I can say for most anime.",
            "date": "2015-09-18T08:32:00+00:00",
            "helpful_count": 96,
            "mal_id": 198819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=198819"
        },
        {
            "content": "Joukamachi no Dandelion;in English, Castle Town Dandelion, is an incredibly enjoying and fun anime to watch. Despite the story being simple, the show manages to bring out elements of development throughout the entire series, which many animes have failed to do so. \r\nThe Story is simple. Even though the Super Power Genre has been added into the series, it was used very differently compared to other animes, the story does not revolve around the super power, but instead on the daily lives of the 9 characters. Hence, the 'Slice of Life' Genre. \r\nThe sound used in the anime befits the anime a lot, the OSTare cheerful, and fun, or perhaps at times calming. These OST are used properly at the right time, the OST had never felt or sounded weird to me even once, so it's definitely a Plus to the anime. The Opening and Ending are really catchy as well, I've never skipped it even once, hopefully many of you will think so too.\\n\\n\r\nThe Art is just... magnificent LOL. The art is incredibly consistent and bright, it's incredibly pleasant to look at, and it also brings out the Moe of the character to it's best. If you're looking for an anime with really good art, this anime certainly wouldn't fail to reach your expectations.\\n\\n\r\nNow for the main factor which led to me giving a high score to this anime... the Characters. \\n\r\nThe Characters are simply unique, even though their types might be common and seen all about in the anime industry, their personalities differ from these types, and their added sense of duty and responsibility also further shines upon their character.\\n\r\nEach character are different from the rest, there is never a character whom I found boring, from the Benevolent Shiori, to the Shy Akane. Personally, Shu is one of my favorites in this show, his character varies a lot, he's not Denser than the periodic table like the majority of the cohort in anime, nor is he one dimensional. In fact, he consistently displays a unique approach towards dealing with things, which aren't easily seen in many animes nowadays.  \\n\r\nAnd Most importantly, all the characters develop throughout the series from experiencing things, so they're never constantly displaying the same attitude nor behavior throughout the series, which is a Major Plus for me, as I tend to determine a Show's true worth through it's characters and their Development.\\n\\n\r\nIn Conclusion, I'd Highly recommend this anime to anyone who enjoys Slice of Life, or wants a peace of mind from their stressful lives. \\n\r\nCiaos, I hope you will make the decision to watch the anime after reading my review. :D",
            "date": "2015-09-18T11:43:00+00:00",
            "helpful_count": 70,
            "mal_id": 198825,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3782683.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lanciare",
                "username": "Lanciare"
            },
            "url": "https://myanimelist.net/reviews.php?id=198825"
        },
        {
            "content": "~Joukamachi no Dandelion~\r\n- Story - 6 - [Supernatural is not for Action it's quite Unique]\r\nIt's a two story in one episode, but it was executed well.\r\nThe story is very Simple, but the Lessons you can get are the Hidden Message of this Anime. It's very good, the execution is well done and the plot is not all over the place.\r\nThe story is very predictable, but the characters aren't, they've changed a lot.\r\nIn terms of Adaptation over Originality, the Anime is way better, and the pacing is good.\r\nIt's an anime that focuses on Character Development and Supernatural Slice of Life, but the Hidden element of thisstory is the best, Being a Fun Royalty.\\n\r\nSo far they've used Flashbacks, First-person Narration and Magical realism as their literary techniques.\\n\r\nThe Ending was Epic, It was one of the Best! The last episode have shown Principles and Dignity, and the best Conclusion to close the Anime, Overall it's the Best Slice of Life you can get this Year. I love Anime that can bring up their Specific genre, and to make an Unexpected Events, and this one was able to Check that Box, The box of Unpredictable Events, Anime with Sense, Nice comedy and not exaggerated, One of the Best Light Series This Year. If this is a dark anime, this is Par on Fate/Zero, which the Dark Version of this one.\\n\\n\r\n- Art - 7 - [expressions sometimes leads into incest feeling if you're watching] \\n\r\nThe art is clean, it meets the expected standard of an anime.\\n\r\nThe art was able to express the fitting mood, especially the characters expression. And it fits in the Story.\\n\r\nThey didn't mixed any CGI or Live Action Clip, mostly 2d with few 3d art styles.\\n\r\nThe animation is really smooth, especially when the characters Power Up\\n\r\nThe art style is very clean from the start, and the Background and the fits the anime, especially for the beautiful scenes.\\n\r\nThe Character Design is the Best Art in this Anime, they fit so much that it will make you smile when you see them.\\n\r\nThe Character Design is unique, and none of them are repetitive, or based on other works, they've even showed the genealogy of each character, which makes me smile.\\n\\n\r\n- Sound - 6 - [it lacks in many moments, but was able to enter important scenes]\\n\r\nThe Characters have the Best Voice Actors/Actresses, they fit so much that it will make you happy.\\n\r\nThe seiyuus doesn't need to adapt, and they were able to play them perfectly\\n\r\nAnd I think, the seiyuus enjoyed this short anime.\\n\r\nI wanna see them playing their role outside the anime studio or during it's record.\\n\r\nThe background music always fits the mood, it always catch my attention\\n\r\nBut I wasn't able to found any uploaded OSTs which I plan to use if I will read slice of life manga,\\n\r\nThe opening and the ending song are really Light, they promote Happiness.\\n\r\nThough it's not catchy for me, because I love Dark and Metal Songs.\\n\\n\r\n- Character - 8 - [the greatest piece in this anime which is absent in many animes]\\n\r\nThe characters here are the best, They have their own personality with Strength and Weaknesses, and most of the time, they will make you smile.\\n\r\nThe characters always react in realistic way in normal circumstance, but as I said, it's a supernatural anime, but they've used their power in the realistic way.\\n\r\nThe characters are relatable, they have shown their strength, but not their powers, but on how they use them. And they've shown their weaknesses when they are in trouble in life. Lastly, they've always helped each other\\n\r\nAnd the Best in this Anime, is the Character Development. They've developed so much more than what I expected. They've conquered their own weaknesses and was able to changed for better. And they were able to show their Dependable side to people.\\n\r\nThe main characters always stands out, but the background people was able to bring the best role for their scene like: Surprised Reaction\\n\r\nThough I didn't see any antagonist in this anime, the siblings fight for Royal Candidacy, but they fight Fair and Just. But there's no Psychological and Action in this anime, just plain Supernatural Slice of Life.\\n\r\nThe Supporting Characters can par against the Main Characters in terms of Role Playing. They were able to produce the best fitting Supporting Characters needed for some occasions or scenes for each Main Character in this anime.\\n\r\nThey've have used First Person Narration: the Main Characters are ones who narrates the story.\\n\r\nThe Characters are very Likable, you will love them because of their Values, each of them have developed in the story, better than I expected.\\n\r\nI will remember the characters in the story, but not as an individual, but as a Happy Family with Values to Learn [Super Royal Family]\\n\\n\r\n- Enjoyment - 9 - [one of the best relaxing animes]\\n\r\nThe people who loves Comedy, Seinen (Philosophical), Slice of Life, Super Power will love this.\\n\r\nI think this one fits for Teen Newbies, or non anime fan.\\n\r\nThis is really good if you want to watch some scenes, or to re-watched the whole anime.\\n\r\nAnd I think it is still enjoyable to re-watched this anime even it is predictable.\\n\r\nThis is an Anime that should be stored/remembered as a Relaxing/Happy/Light Anime.\\n\r\nThe Values(Philosophies) of this anime is the bests that marked my mind/heart. But I think I might forget this anime, but not the character's principles and the Family. I've just watched this to kill time and stored this for comedy relief if I will read/watch Dark and Intense Manga/Anime.\\n\\n\r\n- Overall - 8 - Fair and Fine [this is par on many great animes, just go to my profile]\\n\r\nHow it was DONE. IT did the Best Thing it can Do. this is already a Good Score in my Rating Style. It was able to bring out its Potential in this Manga. Art meets the mood, sometimes it can create a misunderstanding like \"Twincest\" which is not really true, and the sound was able to enter its scene especially in the Romantic Scene of Shuu. the story is nothing special but it's relaxing, but the Character Development is something that should be present in Many Animes and Mangas. It has Philosophical Values and was able to simplify it for general audiences.\\n\\n\r\n- Worth - 5 - Philosophical Hierarchy [doesn't abused their authority and always gets along with the commoners] [simple creative]\\n\r\nThis anime is worth for its Philosophical Aspects that are not present in many animes. It was Able to turn almost all characters in 180 degrees. It's an example of Characters>Story/Art/Sound, so I really Enjoyed this Show. This is a Recommendable Anime. just go to my account if you're Curious about my Rating Style.",
            "date": "2015-09-21T02:01:00+00:00",
            "helpful_count": 38,
            "mal_id": 199127,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4762431.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/VanAlex",
                "username": "VanAlex"
            },
            "url": "https://myanimelist.net/reviews.php?id=199127"
        },
        {
            "content": "-TL:DR at the bottom, some spoilers too so watch out-\r\nIt’s not often you’ll find an anime where a cast so big is utilised so effectively, where everyone gets a decent amount of spotlight, as well as development. It doesn’t stray with excessive filler, and stays on point to the story, which is the election. With comedic elements and a little bitta eechay, the absolute best thing about Joukamachi is its characters. Each sibling is fitted with their own unique personality, design, interaction as well as powers. Although simple, their powers add much to their development, as well as make the show highly entertaining to watch,apart from your typical slice of life story. \\n\r\nWhat makes this anime super fun to experience as a competition is that they’re family; you will probably rarely ever see interactions of this kind in other anime of similar concept. While they are competitive with each other, they still need to support and care for each other as siblings. This creates important bonds such as those found between Haruka and Misaki, Shu and Kanade etc. It’s not super obvious from the start who is going to win either; the anime manages to keep you guessing. I doubt that a viewer will know from the beginning who does win. At the same time, it also pretty quickly reveals who is serious about the election, and who is not so serious (as well as unlikely). Important to note that it’s an original ending, and the manga is ongoing where the election process is actually 3 years.\\n\r\n~ AOI-SAMA ~\\n\r\nThe oldest sibling, remaining to be the most popular candidate until the end. It is also contradictory that the person who is most likely and fitting to be king (given her powers), doesn’t want to be king. The anime makes Aoi interesting in that fact that she lies about her power initially, even to the general public. Souichiro also decides to keep this a secret and takes pride in that she does not want to be king due to her actual powers. Despite this, this lone fact makes her so strong and convincing as a character; she has no reason or drive to become king, as the election has made her notice what is truly important to her. She does not seek fame, attention or power, but simply craves meaningful and genuine relationships with her friends. The realisation that she could get anyone to do anything for is, in her view, wrongful. It has made her cherish normal relationships as well as a normal life.\\n\r\n~ SHU ~\\n\r\nThe anime does keep us guessing who it is that will end up being king, unless you anticipate an open ending, but anime working towards a final outcome tend not do this. However, Shu being king really does make sense; he is the oldest male in amongst his siblings; he has had a queen in Hana since episode 2 (also giving him a reason to become king); and by the end, is overall the most fitting. Joukamachi covers this eventuality up nicely making Akane very clearly the main character, but also Aoi being first place for the majority of the election and Shu taking a backseat in votes. Shu’s power also seems to be more utility based than anything, still very powerful, but not one suited for ruling like Aoi or Kanade. It’s also another irony, in the fact that his power is based around instant transportation, yet his actual mobility is limited by his injury. Ultimately it makes sense for Shu to become king. In the end segment, he got his final speech in and showed what mattered to him most – ensuring the safety and happiness of all the people he cares about, that being his country and loved ones, and proving this by taking initiative in the hot air balloon incident. Not to mention, he looks exactly like his dad when he was younger.\\n\\n\r\n~ KANADE ~\\n\r\nKanade had been the fiercest competitor since the start, but ultimately had selfish reasons for doing so. She’s shown to be a character who won’t stop at getting what she wants, which is befitting of her power where she literally can. Despite this, it’s ironic in that fact that in some scenes, she’s seen shopping just as any other ordinary citizen. She excuses that menial tasks also mean more chance to be in the public eye. Kanade is all about efficiency and is a very forward-looking person, at times manipulative. Kanade does not like uncertainty and wants to prove to Haruka that probabilities are not just probabilities. Even though this is the case, the reasoning behind all her actions is more fragile than you’d think, though does still make sense. Not only wanting to help Shu, she more so wants to be seen as an equal, being Shu’s twin. However, in the view of Shu, the older brother must always take care of the little sister, which is also true of Haruka and Misaki, as well as Teru and Shiori.\\n\\n\r\n~ AKANE ~\\n\r\nIs voiced by KanaHana, but I don’t actually care this time, it fits. I think Akane is a really good main character. I often like anime that put emphasis on the side characters but follow the story primarily through one character’s perspective. Akane is the main character, but the anime doesn’t make this overly obvious, and doesn’t put the greatest emphasis on her. Her role in the story is to tie the rest of the family together and provides middle ground for all characters to interact. By the end of the election, Akane’s development is sound. In the end, she seems much more comfortable in public due to the realisation that as a public figure of royalty, she has a duty and responsibility of ensuring the safety of her people and that the payoff of doing so is heavily rewarding. Hiding behind a persona is now unnecessary for her.\\n\\n\r\n~ MISAKI ~\\n\r\nAlthough maybe not taken seriously, Misaki is also a genuine competitor to the election. She may not have what it takes to become king and may not have a true reason for doing so, yet still feels a need to prove that she can become something. Unfortunately, the anime keeps it realistic in never giving her the top spots in votes, however this had gradually motivated her to become more serious about herself and the election throughout the story. Misaki decides to do speeches on her own rather than relying on her clones, as an example. She is an interesting addition in the fact that, while she is shown to be highly useful in day to day life and has a wide coverage of being able to do basically anything with her powers, she herself is not capable of much. However, Haruka sees this as a good thing; she is not highly gifted in certain things and may see the world better in the view of an ordinary person. She is best suited at doing comparatively unimportant tasks, but this is all the more important when her siblings are focused on other things or just aren’t as good as Misaki in a social sense. \\n\\n\\n\\n\r\n~ HARUKA ~\\n\r\nAlso, an interesting addition to the story. Haruka could probably foresee who would win the election throughout the entire process and could’ve actually used that to his advantage to potentially win. However, Haruka remained to be level-headed and realistic about what he himself is capable of, and that he lacks the confidence and drive to put himself in the spotlight and campaign. Instead of this, alongside his powers of prediction, it grants him perspective of whom it would actually be reasonable to become king. He is serious in helping others campaign, knowing that he himself would not be competing, and proves to be reliable on this front. He aids Misaki in assisting her with her confidence issues, proposes to write Misaki’s speeches as well as helps Hikari become an idol. Haruka’s role is especially important, considering how it has helped to develop the other characters so massively, especially Misaki.\\n\r\n~ HIKARI ~\\n\r\nHikari’s development stands out from the rest. You would expect Hikari to be a character that provides comedic relief and moe, but instead brought a meaningful perspective into the story. She was the only one who found what she wanted to do in the future other than becoming king. What started off as a basic idea to gain votes became her actual goal, heavily influenced by Sacchy. It’s interesting in the fact that she had such talent and intuition at such a young age, mixed with her power to mature whenever she wants, it’s almost as if she was born to do this from the start. By the end, Hikari no longer cares for the election, and deems her pride as an idol much more important to not only herself, but her fans. She realises this after her interaction with Aoi, who explained that a lie will remain a lie if you believe it is, which was a struggle that she herself had to face. Being an idol also contrasts the position of king. As she mentioned in the series, idols are not supposed to be perfect and may make mistakes, which ideal and preferable kings have a duty in avoiding. This differed from the clumsy Hikari, who would not take anything seriously when she didn’t feel the need to.\\n\r\n~ TERU ~\\n\r\nBy far the most righteous and respectful character in the story; Teru always refers to his family in a formal manner. His personality is consistent and convincing, Teru feels as if he’s limited by his age and insists on helping out in whichever way he can. His power is potentially the most powerful and reckless, however this is restricted as well as contradicted by his young age (therefore a ‘weak’ social standing in contrast) as well as the promise made to his mother, to which he remains honourable. This makes sense, as kids should listen to their parents(!). Teru can’t be taken seriously in the election but even so provides a refreshing perspective of a cool shounen type main character faced with ‘trials’ throughout the process. (did you see that last episode? Wow.) Also has a strong sense of duty to protect those important to him, especially Shiori.\\n\r\n~ SHIORI ~\\n\r\nShiori does not take part in the election, but dandelion is aware of this. Most of her role entails taking care of her siblings, to make sure they don’t go overboard in the election, and to take proper care of each other and themselves. It could be said that she cares more about others given the fact that she can communicate with anything, hence meaning she’s more considerate of the ‘feelings’ of everything around her. This also adds a comedic aspect; for example, her powers legitimately give a voice to their family cat, Borscht. In the end, it proves to be an extremely useful power which reinforces her ‘support’ role in the series. RIP Suika-san.\\n\\n\r\n~ SOUICHIRO ~\\n\r\nIt’s worth mentioning that Souichiro is also a key aspect in this series. He decided to hold the election at the end stage of Aoi’s high school career, as this was deemed by him the best time where the majority of his kids had a decent chance in becoming king. However, more importantly, it was a time where they could decide what they wanted to do with their lives, and to decide where their true ambition lied. With Hikari, this was an especially effective method. There are other cases as well, such as Aoi simply not wanting to become king even given the opportunity in trade for a normal life, as well as Kanade who changed her reasoning towards the end of the anime. He always grants permission and is a fairly doting parent, though this is simply because he believes strongly that they should not live life restricted by royalty, and that they are granted a choice in whatever it is they want to do. This idea came from the fact that he was an only child, with no real choice of becoming king or not. He did not want his kids to face the same issue, so if they truly wanted to become king, they would campaign.\\n\\n\r\nOverall, Joukamachi Dandelion doesn’t present overly deep themes, but is definitely very good at showing coming of age, values and perspective of its characters, especially within limited time. The art style is mega appealing, and it is generally good at being a unique, comedic, fun, and rewarding slice of life experience. I still don’t know why they chose dandelions, but one thing to note is that it grew in a different place than where it was seen before, perhaps representing change and progress. It may also symbolise Akane, who before was enclosed in her own shell, but now open to the world. Now only one thing bothers me… Does Karen like Akane?\\n\\n\r\nStory- 7 Art-9 Sound-7 Character-7 Enjoyment-7 \\n\r\nOverall- 7/10",
            "date": "2018-03-29T17:37:00+00:00",
            "helpful_count": 11,
            "mal_id": 275662,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4774815.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Abraham_Ford",
                "username": "Abraham_Ford"
            },
            "url": "https://myanimelist.net/reviews.php?id=275662"
        },
        {
            "content": "Last day I entered in my typic watch-anime-online-free-with-tons-of-publicity webpage and saw that the last episode of this series had been shown. I got pretty interested on a slice-of-life of princes so I started watching it.\r\nI finish it and I am very surprised in really different ways. Firstly for the character development. Even being really simple, pretty normal, it was really amazing. But not one for one, but all together. Those clichés characters all together makes the show really funny and interesting to watch. For me. This is the best thing of the anime so far.\r\nSecondly, for a simple reason: This is the type of seriesI like saying it can't be a masterpiece or an horrible show because it hasn't got actually any hide pontetial or truly weakness. The story is pretty simple. 12 episodes does not do magic, and this is the perfect example. If someone is looking for a truly amazing plot on a comedy/slice-of-life/romance series. This won't be yours.\\n\\n\r\nArt and sound didn't surprised actually. The drawing was good but the soundtrack was really bad. I don't remember any song and opening and ending didn't surprised me either.\\n\\n\r\nAn anime with highs and lows that I wouldn't actually recommend you if you haven't still watched other better previous shows.",
            "date": "2015-09-20T03:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 199004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/599757.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/keitwr",
                "username": "keitwr"
            },
            "url": "https://myanimelist.net/reviews.php?id=199004"
        },
        {
            "content": "There are times when you just want to sit down and enjoy a simple, fair and light hearted anime. Where the plot isn't the main focus, but the characters and their ideals. \r\nBy providing a mixture of unique characters with a simple and straight forward plot line, Dandelion seems to be a fun and comedic series that always puts a smile on your face at the end of every episode. \r\nSo if you are looking for an anime that isn't all that story rich but has aspects on character growth, where drama is solved within an episode. Joukamachi No Dandelion may just be anime you'relooking for.",
            "date": "2015-12-13T02:40:00+00:00",
            "helpful_count": 7,
            "mal_id": 205420,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4654901.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kaitonomiyaki",
                "username": "Kaitonomiyaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=205420"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nThanksgiving is just around the corner (at least, it was when I wrote this).\r\nThanksgiving means the succulent taste of an oven roasted turkey. Thanksgiving means exactly that: giving thanks. Thanksgiving means getting ready for Christmas. But what Thanksgiving means the most, like most holidays, is family. Getting to reminisce with Aunt Lisa while munching on her famous home-cooked bread. Letting Mary use her signature purple lipstick to leave the perfect kiss mark on everyone’s cheeks. Wishing that the grandparents would have stuck around instead of scurrying off to Florida.\r\nIn our family (and by family, I meanuncles, cousins, etc.) tradition is key. Thanksgiving is where we choose out of a hat the name of our Secret Santa, leaving us all plenty of time to agonize over what gifts to purchase. There is also the customary Apples to Apples card battle, trickery a must. And of course one cannot do without the chocolate milk speech just before the main meal.\\n\\n\r\nThis is a time for food and games and repetitive radio music. However it is family that makes the occasion not just a random gathering but a special, memorable event. Joukamachi no Dandelion likewise places family on a pedestal yet, metaphorically speaking, the stuffing is missing.\\n\\n\\n\r\nSTORY\\n\\n\r\nJoukamachi no Dandelion falls under the broad category of “nothing more than a small comedy”. Jokes, heartfelt moments, and a dash of romance fill the majority of the plot, realistically leaving little to discuss besides the usual quips on comedy and connection.\\n\\n\r\nAt the minimum, the construction of Joukamachi no Dandelion’s narrative (if it can be called as much) takes a smart approach. Most episodes are comprised of two – sometimes three – different tales rather than a whole arc. This slicing carves the show into manageable pieces, causing the slice-of-life scenarios to feel like they should: singular sections that get right to the point. Nothing ever feels prolonged since the snapshot direction keeps the action moving and the jokes flying. The comedy itself is not aimless, too. An overarching plot involving the royal election keeps the comedy focused enough to prevent meandering into random territory. For instance, Akane flying around as the “masked” heroine Scarlet Bloom seems random but in fact her stunts are designed to boost her numbers in the polls. The same can be said for their family “beach” outing (there is a lot of masquerading that goes on…) that is secluded due to their royal status. So at the minimum Joukamachi no Dandelion’s micro and macro approach leaves the narrative in a seemingly comfortable position.\\n\\n\r\nThe anime starts to falter when the content of these segmented tales are investigated. Joukamachi no Dandelion has a clear theme on family. Family is supposed to stick together, family implies equal fairness, and so on. But in the show, this does not happen. Understandably Akane garners a lot of the attention – she is the main protagonist – however the rest of the cast is proportionally unequal in terms of screen-time. Hikari the idol arguably has too much time relegated for her, whereas Haruka the probability master, Teru the strength kid, and Shiori the cute-yet-possibly-psychotic object whisperer each receive considerably less time compared to their brothers and sisters.\\n\\n\r\nTo be fair, these characters are not that interesting, but they are as uninteresting as they are because the anime refused to work with them. A paradox. Still, not using the characters, regardless of how interesting they happen to be, is not a smart move for a few reasons. One, they are a part of the main cast, so leaving them on the wayside is counterintuitive to including them in the series in the first place. Two, they add variety to the festivities. Akane is cute when she blushes and Hikari has a nice singing voice, but relying on their same shticks time and again – especially when other siblings are ready and waiting to have a moment in the spotlight – induces avoidable repetition. And three, their inclusion fits this family theme. They are the royal family, not the royal individuals-who-occasionally-do-stuff-together. This is a huge misstep that the anime makes semi-regularly; Shuu, Kanade, and Aoi are other siblings that take up the middle ground, meaning Joukamachi no Dandelion is not always focusing on the cute girl and the singer. But the anime foregoes its own characters enough to become a noticeable negative.\\n\\n\r\nAnother negative is the anime’s attempts at sentimentality. Particular members of the cast have troubling pasts. For example, Kanade ruined Shuu’s soccer career when she caused an accident as a child, Akane had a run-in with a couple of burglars that spawned her anxiety, and so on. Simply having these parts around detracts from the comedy that the anime strives for. That is, Joukamachi no Dandelion tries to add depth to its narrative that ultimately takes away from its more important comedic elements. Even worse is that these dramatic moments are taken care of way too quickly. Akane’s in particular – her complete inability to handle public outings – is a crutch the anime leans on for every episode, yet she is cured in the span of a few minutes (and accidentally at that). Doing this demonstrates how little the anime cares for these segments and consequently how useless they are to the narrative as a whole.\\n\\n\r\nUselessness continues in Joukamachi no Dandelion’s main familial theme. The theme itself is already on thin ice since the disproportioned character focus goes against the sense of fairness family brings. The ice starts to crack further when the anime fails to make its own family feel like a family. Hints of this do exist. Haruka supporting Misaki when she feels sad, Kanade taking care of Shiori while the parents are away, and Akane setting up a surprise birthday party for Aoi are instances of brotherly and sisterly love. But the comedic and sappy moments get in the way of the family moments that expound on this family theme. Like the drama scenarios, these familial scenarios zoom in and then zoom out, pushing away the construction of the relationships and the dynamic of the family to make room for a gluttonous clone or a menacing phone call. In essence, its shallow exploration of its theme served as little more than a hindrance.\\n\\n\r\nAt this point the anime makes it clear that it does not know, exactly, what it wants to be. When the anime is not trying to make the viewer laugh, drama ensues. When the drama dies down, the family idea is brought up again. Then when the family idea has been touched on, comedy appears once more, and the cycle never ends. The show is forever in a loop, tugging itself in multiple directions without ever settling down on one path, causing the anime to feel directionless in its presentation.\\n\\n\r\nNowhere is this directionless behavior more evident than in the conclusion. Joukamachi no Dandelion highlights the need for an ending speech from each character which makes logical sense. There is an election going on so having the cast give their personal take on how the previous year went and what they have learned would (even if heavy-handedly) let the audience understand the meaning behind the whole season. Instead, some calamity occurs, the election – like many parts of the anime – happens in a few seconds despite this conflict being the string that tugged everything along, and their speeches are forgotten. The anime was trying to wrap everything up as best as it could, but the final episode ends up too all-over-the-place, mirroring the narrative’s direction throughout the entire season.\\n\\n\r\nSo while Joukamachi no Dandelion might keep its slice-of-life and overarching plots in tandem, the dance they perform from start to finish is one muddled with missteps and poor choreography.\\n\\n\r\nANIMATION\\n\\n\r\nJoukamachi no Dandelion surprisingly has a lot of opportunities for action sequences. The characters’ powers make this an obvious statement. Akane flying around, Shuu teleporting everywhere, and Teru digging furiously elevate the amount of actual animation the anime employs. The quick nature of the comedy also makes the hasty transitions and character movements a welcome sight. Characters will often exaggerate their actions, such as jumping up-and-down on their bed or the explosion of dust when someone starts running. Hair and eye details are not extreme but they are around to a reasonable extent, making sure the people on screen do not act like lifeless husks. As a whole, the anime does not have an extensive amount of actual animation but what amount the show does provide is nothing to scoff at.\\n\\n\r\nScoffing can be done with the art style, though. For the most part, Joukamachi no Dandelion sticks to a minor set of areas: the school, the Sakurada household, and the idol studio are the most prominent locations. This rapidly induces blandness since the anime does not dabble in quirky camera handling or nuanced lighting. To be more specific, the camera- and light-work is as par for the course as one can get, the byproduct being further accentuation of the bland artistic direction. The show does try to switch up its presentation slightly when its characters adopt reaction faces or the city landscape is replaced with colorful backgrounds, but here the quickness of the comedy works against itself, making these deviations from the norm a rarity. The result is the anime constantly mired in the same, boring art, making the action on-screen an obstacle to sit through rather than another part of the experience.\\n\\n\r\nFor the character designs, they sit somewhere between the actual animation and the art, between being a satisfaction and an obstacle. Besides the avant-garde colorings for some of the characters’ hair – Aoi’s blue, Haruka’s purple, and so on – the designs are decidedly plain. Shuu and Kanade in particular are strangely similar, their black hair and casual clothes coinciding with their dull personas. Symbolism does exist in the colorings – Akane’s tendency for red matches her embarrassed and blushing attitude, Misaki’s use of pink goes with her girly behavior, and so on – though beyond the different hues not many other symbols are found. Nobody has distinct accessories, nobody dons intricate outfits (arguably, Akane’s Scarlet Bloom gothic dress is a contender), and their faces are almost identical to each other (granted, they are siblings). Collectively the cast’s designs are suited for Joukamachi no Dandelion, however they are not as involved as they could have been.\\n\\n\r\nCHARACTERS\\n\\n\r\nAs it was with the story, the characters of Joukamachi no Dandelion leave next to no room for discussion because hardly anything is provided.\\n\\n\r\nThe cast is large, so characters are rarely given adequate time to shine. And as was previously mentioned, when the characters do have that opportunity to develop, the moment either happens too quickly or the moment is too worthless. Either way, that particular person is left stranded on a rough patch of mediocrity writing-wise. At the minimum, each character does have their own set of characterizations that differentiate themselves from each other. Aoi is a natural leader, Shuu is often impractical, Kanade cares immensely for the safety of her family. Akane is incredibly shy, Haruka keeps to himself, Misaki is plainly average. Hikari wants to prove herself, Teru has a huge heart, and Shiori lets her actions talk for her. Standard fare for any cast.\\n\\n\r\nAlongside their base characterizations are the unique abilities that each character holds. Going through the list once more makes this easy to spot. Aoi can force anyone to do her bidding, Shuu can teleport anywhere, Kanade can create anything out of thin air so long as she has the reserves in her bank account. Akane can manipulate gravity, Haruka sees the probabilities for every action, Misaki can split herself up into several people with their own personalities. Hikari can increase or decrease the age of anything, Teru has super-strength, and Shiori can speak with inanimate objects. Again, standard stuff, but these types of features stop the cast from being totally bland.\\n\\n\r\nA discernible oddity can be found when the characters’ base traits are juxtaposed with these special abilities they tout. The characters’ abilities are the opposite of how they normally portray themselves. To put it differently, their powers symbolically reflect their individual strengths. Aoi could forcibly lead if she chose but her affability and kindness inherently cause people to look up to her. Shuu has the most practical power of the group but somehow always comes to the most impractical solutions. Kanade can literally buy anything she could ever want but she knows that “money cannot buy happiness.” For her, that happiness is her family. Akane feels the overbearing pressure of eyes and cameras, and coincidentally her flight capabilities create further embarrassing moments. Haruka can technically make every correct decision for the rest of his life but instead he is content with letting events proceed normally. Misaki’s averageness compared to her clones actually makes her perfect for specific roles. Hikari can cheat aging but never cheats when she has to prove her prowess. Teru’s heart is bigger than the strength he wields. As for Shiori, she might be able to talk with random objects, but “actions speak louder than words”. Thus the characters’ powers are not just for show but rather extensions of themselves, adding complexity where much is needed.\\n\\n\r\nUnfortunately, Joukamachi no Dandelion does little else with its characters. A tiny comedy does not require insanely complex characters but a comedy (and to be honest, any type of anime) does at least need characters who leave a lasting impression. These characters fail to do this. The symbolism of their powers is definitely interesting but that is not enough. Their personalities are lacking, their character growth is stunted, and their interpersonal relationships – caused by the anime’s narrative direction – are shaky at best. In the end, the cast simply does not have enough clout to noticeably influence the audience, immensely reducing the overall execution of the characters.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme is very upbeat, not just in the lyrics but in the tempo of the piece itself. Varying the vocalists also helps to align itself with the familial theme of the show, improving the purpose of the piece. While the track does not try anything new in terms of instruments or sound, the catchiness of the beginning and the final bits make the song not outright forgettable. The ending theme is a bit too similar to its OP counterpart, the middle section a chorus of sound that goes in one ear and out the other. Again the happy beat follows the format of Joukamachi no Dandelion. And instead of changing vocalists the ED makes use of repetition to make the track easy to follow, the trade-off being this sense of looping that reduces the power of the piece. And while the lyrical triplets, loud lead-in, and the clapping each try to bring that power back up, the track is just not strong enough to stand on its own.\\n\\n\r\nOne of the best tracks of the soundtrack is technically not even a complete song. The transitions between the A, B, and C parts – the six note-or-so onomatopoeia – was a charming little effect that segued nicely from one story and into the next. The remainder of the soundtrack is not as notable, the pieces sticking mostly to common, slice-of-life compositions. Once again, due to the elated feeling of the anime, a lot of the tracks are happy or silly in design. But other, more relevant music – such as drum numbers and dainty or ominous piano pieces – help to offset the wacky fun the majority of the OST maintains. In the end, though, the OST is a lackluster offering, one that does not try to be anything more than what it barely has to.\\n\\n\r\nAs for the voice acting, the cast of Joukamachi no Dandelion provide an overall average performance. Kana Hanazawa as Akane uses a cute and flustered voice for the equally cute and equally flustered girl. Aina Suzuki as Shiori does not quite capture a childlike voice, making Shiori sound out of place whenever she said anything. This is one of her first (and biggest) roles in the medium, though, meaning one can expect Ms. Suzuki to hone her craft the more roles she takes on. And Yui Ogura as Hikari uses a nice singing voice during her idol moments while simultaneously using a tone that fits the younger sister well enough. The rest of the cast does not stick out in either a positive or negative light, the net result being the aforementioned average outing.\\n\\n\r\nENJOYMENT\\n\\n\r\nI have some beef with this anime. Petty beef, no doubt, but beef all the same.\\n\\n\r\nThe show had a spectacular opportunity to poll its audience throughout the season in order to determine who would be crowned the king or queen. An interactive experience rather than an arbitrary decision. A way to get the community involved that was not cheap or forced but a clever direction. But no. The show not only chooses the winner but the show also chooses the most boring candidate. Shuu taking the crown is literally how succession has worked for a millennia – the first born son is next in line. The anime was all about these quirky characters, their crazy abilities and personalities instantly recognizable to anyone in the city. How hilarious would the whole ending have been if Shiori won? Or if Haruka, who did nothing the whole time, actually had a secret weapon up his sleeve? Or maybe Akane does win, her easy handling of the position signifying her newfound vigor? Shuu is such an uninteresting choice to make, and coupled with the fact that he is not the smartest fellow on the planet, the decision almost seems illogical. Were the audience given the chance, the eldest brother would not have reigned.\\n\\n\r\nMore beef. I was not sure if I should put this here or in the “Story” section, but why dandelions? The anime is called, in English, Castle Town Dandelion. “Castle” makes sense since there is a castle and the people in the show come from royalty. “Town” likewise makes sense since everything happens within one town. But “dandelion”? There are almost zero references to dandelions throughout the show. Dandelions are not the crest for the family, none of the characters declare their love for dandelions. There is a dandelion shown as the final shot of the anime just to remind everyone that dandelions are somehow related. Disregarding their nonexistence, why dandelions at all? Dandelions are technically a weed, a plant that puts a blemish on gardens. Am I meant to interpret the powers as weeds? The show certainly did not take that direction. In fact, without their abilities, many people (including themselves) would have perished. Are the characters weeds? Again, their presence is not an evil or an unwanted one, so this interpretation fails as well.\\n\\n\r\nMost likely the dandelion is supposed to represent change (evidenced by Akane’s final monologue), as in a flower blooming. But there are better, more distinguished flowers for this purpose, such as roses, tulips, and daises. The dandelion might also have to do with making ones dreams come true. Wishes are often made on fully-bloomed dandelions, the scattering of the seeds symbolizing the multiple chances at future success (the OP uses a lyric similar to this). Contextually, the characters were also hoping for future success in becoming the next successor. This makes the most logical sense, although it is a bit of stretch, and even then there is the counterargument that the show was not about the election (the future) and more about family, love, and determination (the present, the latter of which is the opposite of dreaming).\\n\\n\r\nThe beef goes from petty to filet when the romance portions kick in. They are few and far between but they are quite satisfying to watch unfold. Shuu and Sato’s relationship was cute, the affectionate words and love between them placing a smile on my face with ease. But my favorite story was about the parents in their younger days. Their own romantic beginning and their love of family dynamics was awesome to watch.\\n\\n\r\nThe mother and father were definitely not what the anime was centered on, but thankfully the non-romance sections were a nice bout of fun, too. They were usually silly and adorable, such as when the watermelon sacrificed itself for Shiori or when Akane obliviously walked around the school with no pants on (more specifically, the reaction of the student body and her best friend). These scenes pale in comparison to the romantic ones, but they at least got a chuckle or two out of me while watching. And although the lame dramatic detours and the anime’s irksome choices dampened my experience, I was still entertained nicely enough.\\n\\n\r\nJoukamachi no Dandelion is filled with family, royalty, and comedy. But beyond this thin veil is a smattering of problems – from the weak cast of characters to the unmemorable music selection – that collectively hurt the show. Suffice it to say that watching this one is a Thanksgiving tradition that nobody will be embarking on anytime soon.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, slice-of-life and overarching material work together, but the disproportioned screen-time, the unnecessary sentimental moments, and the unexplored theme on family lead to a directionless presentation\\n\\n\r\nAnimation: Fine, average actual animation, boring art style, okay character designs\\n\\n\r\nCharacters: Bad, nice symbolism for each child of the royal family, but dull personalities, little growth, and shaky relationships do not let the cast leave a lasting impression\\n\\n\r\nSound: Bad, fine OP, bad ED, bad OST, average VA performances\\n\\n\r\nEnjoyment: Fine, peeved by no real-world election, no dandelions, but the romance and comedy still made me giddy\\n\\n\r\nFinal Score: 3/10",
            "date": "2016-01-07T01:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 207948,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=207948"
        },
        {
            "content": "Overall for it's genre, this anime is pretty good! If your into Slice of Life/Comedy animes this one is definitely for you. \r\nThe story is pretty straight forward. To me the story was okay but there wasn't really anything super unique about it. The one thing is that all the siblings have superpowers which isn't super important throughout the show. In my opinion the whole superpower thing was more of a plot device. \r\nI liked the art alot in this series! The backgrounds are nice and the character designs are really nice! I like the color schemes on the siblings especially. There is also anoutfit that Akane, the main character wears a little later on that is super nice! Overall I think this anime is very aesthetically pleasing. \\n\\n\r\nThe sound is good to! Nothing really remarkable about it but it's very good. The background music didn't really stand out much to me, but the quality of everything was good. The voice acting is also good with the exception of one supporting characters voice which I found kind of irritating? Other then that though, good.\\n\\n\r\nThe characters was one of the most enjoyable aspects. I liked all the main characters and enjoyed following all of their stories. I felt that alot of them fell kind of short though because 12 episodes isn't really enough time to fully flesh out nine characters. Only a few of them were really focused on alot and 2 of the supporting characters felt kind of one sided because they were only focused on one thing. One of them I didn't like but for the most part,I  either liked the characters or felt neutral about them. \\n\\n\r\nOverall this is a pretty good show. I'm not a huge fan of shows that primarily focus on slice of life but for it's genre, it did a very good job and it's something I would recommend to slice of life fans since even though it can be sort of average, it has it's unique aspects as well.  \\n\\n",
            "date": "2015-09-17T22:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 198799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4856037.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Bravocube",
                "username": "Bravocube"
            },
            "url": "https://myanimelist.net/reviews.php?id=198799"
        },
        {
            "content": "How can a huge bunch of siblings with super powers competing for the title of king while dealing with disasters somehow manage to leave a weak impression? The truth is out there but still partially eludes me after watching this three times.\r\nThe story, characters and situations are all ready to go nuts and it should be an explosive combination but somehow it still feels much more like a mellow slice of life with odd magic thrown in for little more than comedy. Absolutely not unpleasant for a viewer looking to unwind with light stuff and many characters are easy to develop warm feelings for, butit sort of settles for an experience that is just a bit hollow and in the end feels like trying to sate hunger by eating cotton candy.\\n\\n\r\nAs a bit of a voice acting fan I'd say Akane has the absolutely most fitting voice possible for her character type and that's the full extent of how much sticks after watching the whole season thrice. Rather enjoyable slice of life, a few good laughs, Akane has a perfect voice. That's it.",
            "date": "2017-10-20T06:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 261235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261235"
        },
        {
            "content": "Ah, Joukamachi no Dandelion. I actually wonder how would monarchy be like in Japan, but instead this anime turned out to have an interesting royal family. Produced by Production IMS, which also did ‘Ore, Twintails ni Narimasu.’, it is a slice of life anime that is pretty enjoyable because of these short stories of each sibling trying to do their best.\r\nThe story follows a royal family in Japan, but instead of their fancy castle on the riverside, they live in a typical house that fits everyone in. It was an idea thought out by the father, who is the king of his fine country, andthat way the siblings live on as normal citizens would be. An election to vote for the next king is coming by, and the siblings are trying their best to gain support through their own means. There is also a twist to this family, and it is that the siblings have different super powers. These powers may prove to help the citizens or themselves, and may help in gaining more support.\\n\\n\r\nIt is easy to follow indeed; it is not like there is a complicated political trope that everyone needs to understand, it is just a damn slice of life anime. Most of the episodes have segments that focuses on a sibling either trying to find ways to gain support or letting us know more about him/her. Nothing special or very tragic happened in the anime, but it is worth noting that each story can be pretty engaging for the viewers. There are a lot of comedic value in the anime, especially moments that make everyone laugh. Sometimes, there are moments where the siblings reflect on and striving to do their best. So, I do believe that it is nice watching at how they grow.\\n\\n\r\nI do not really dislike a particular scene in this anime, hence the story is entertaining as a whole. Many claimed that the ending of the anime has to be one of the best in this season, and I may think so too. For a slice of life anime, it closes well and certainly there is nothing left out.\\n\\n\r\nMost of the cast are the members of the Sakurada family, a fine royal family led by the king and father, Shouichirou, the only child of his parents. A total of nine siblings from as young as a cute kindergarten kid to as old as a third-year high schooler. As I mentioned before, they live as normal citizens, hence they are cool hanging around with their friends and other fellow citizens, although some of them show more respect. As how the story goes, the shy cutely-dense Akane seems to be the focus of the whole anime. She hopes to become king just to remove surveillance cameras which she never likes being aimed at. It is quite ironic that she needs more attention from the citizens in order to get more votes, but nevertheless she is really trying hard. Another few siblings are also focused, such as Kanade, Aoi, Shuu, Misaki and Hikari. They have their own reasons of wanting to be king and they went through many ways to gain supporters. I would say that they have their own unique story that are interesting to watch. \\n\\n\r\nNot every character has their deserved character development, and due to the 12-episode length, some of them have their own development which is fine. The characters, although they are nice to watch, do not stand out as very special characters. When you think of it, their personalities are as similar to other anime characters you might have watched. But hey, it is still worth watching them.\\n\\n\r\nThe art is simple and not really unique. Yes, the character designs are cute and nice, but it is still not outstanding. If you watched OreTwi, you should know that the studio both produced these two anime, as well as the same original character designer. You may also know the studio for its infamous ‘quality’ in animation in OreTwi, and this disease may have also been caught on Joukamachi too, sadly. Not that it is concerning, but it can leave a bad mark on the studio. The sceneries looks like your standard slice of life anime, and the facial expressions are good-looking and sometimes goofy-fun.\\n\\n\r\nBoth the opening and ending songs have a certain charm, which is that they are both lovely and exciting. I can’t count how many times I replayed the previews but they are awesome! They do match how it feels like in this anime, and so I do give props to Yui Ogura and Kaori Ishihara, who are also both voice actresses in the anime. The soundtrack does not really stand out at most, but they are comforting as what you hear in other slice of life anime. The voice acting is great, especially for Kana Hanazawa for her work with Akane. A few of them are relatively new to the voice acting scene, such as Aina Suzuki who voices Shiori. Indeed she played the role really well, and I hope to hear more from her in Love Live! Sunshine.\\n\\n\r\nOverall, Joukamachi no Dandelion is an anime which I fell in love watching throughout the series. It is sad that there would not probably be a second season for it, and I do not know if the manga is fully translated, but it was a fun ride. This is one of my most enjoyable anime this season, and so I recommend this anime to everyone for the fun.\\n\\n\r\nHowever, there is one question: how is the mother be able to have these siblings at this kind of span? Insane.",
            "date": "2015-09-20T06:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 199024,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440083.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SkyNoHoshi",
                "username": "SkyNoHoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=199024"
        },
        {
            "content": "The concept of good comedy in anime is something of a rarity.  When a genre becomes so stale that different shows reuse similar gags in order to earn chuckles, the only way to truly shine is to make something different, something that is unique to make the show memorable.  So...what about an entire show wrapped around nine siblings, all of whom are not only royalty, but also have superpowers?  Yeah...that'll work.\r\nStory: Joukamachi, as I will be calling this series focuses on the town called \"Dandelion Town\", a place that while looks like a normal city on the outside, is actually a townruled over by a monarchy.  By proclamation of the king, his nine children will be running for election in order to raise to power as the next king.  (Even though 5 of them are girls.)  Not only that, but each of the nine children have a kind of superpower, each different to the others.  And so here we follow the story of Akane, the 3rd daughter and 4th child to the Sakurada family and her rather rocky road to the election date.\\n\\n\r\nJoukamachi falls towards the 4-koma style of storytelling rather than a normal fluid story where everything goes from one scene to another.  Instead of going from scene to scene, every episode of Joukamachi has two or more minisodes that make up the entire runtime of any given episodes, which alludes to an episodic format, progressing the story into the actual election itself by the end of the entire series.  (Yes, contrary to what one might think with the way the story is structured, this series actually ends with what it intended to do.)  Within each episode contrary to what the synopsis might say, we follow the story of one or more children in the Sakurada family as they live their life as the princesses and princes of the nation.  (It is still a slice of life after all.)  \\n\\n\r\nFocusing solely on the children's lives in the anime, the show puts heavy emphasis on the characters and traits of each child in the family.  The issue with this is the fact that not every child is treated the same.  Since there are nine children in the family, the show simply didn't have enough screentime and chose to put several members of the family into the supporting category while spending more time on others (particularly the older ones) and developing them a little more through the use of backstories and just general progression through episode to episode.  While the show does have character development, it's not balanced in the sense that everyone gets treated the same way, which is a bit of a shame since Joukamachi completely devotes itself to focusing on these nine siblings.  \\n\\n\r\nAnother issue comes with the mood of the show.  Since it focuses also on developing the characters of the nine siblings, Joukamachi sometimes goes into a more \"serious\" tone rather than its generally carefree attitude.  The issue with this is the fact that it clashes with the show to some extent and while does provide some enjoyable parts as we get to know the characters in the show, it butts heads with what we would normally expect from a comedy slice of life and creates some awkward shifts in tone.\\n\\n\r\nAs for the comedy of Joukamachi, the show mostly focuses on the more focused character of the series, Akane, and her inability to receive attention on account of the fact that she has terrible fright when encountered with anyone's gaze.  While the show does focus on other antics that the other children have, Akane is usually gives the brunt of the show's comedy.  The issue I have is the fact that Joukamachi is very repetitive.  There honestly isn't much variation in the stuff that they do for comedy in that show.  Is it enjoyable?  Well, that depends on what your definition of enjoyable is, but at the very least, Joukamachi is a show that can and will utilize the same jokes more than once. \\n\\n\r\nAll in all, Joukamachi is a show that I does decent with what it tries to achieve.  With several aspects of the show being unique in a comedy slice of life (such as the big family and several other things) as well as some pleasant character development despite its sudden tone shifts, Joukmachi also gave us an actual end to the show by finishing the plot that it established at the start of the series, which is honestly rare for a show that uses minisodes as its presentation.  It still does suffer some issues from its overuse of gags and lack of proper attention to all members of the main cast.\\n\\n\r\nOverview:\\n\r\n+ Unique story idea\\n\r\n+ Character development\\n\r\n-  Comedy troupe overuse (with little to no variation half the time)\\n\r\n-  Imbalance for who got development \\n\\n\r\nCharacters: As mentioned before, Joukamachi focuses solely on the nine siblings and their antics for trying to get themselves elected, and in some cases, not elected for the title of ruler for their kingdom.  Since there are nine main characters, I'll just overview them from oldest to youngest.\\n\\n\r\n1.  Aoi        Power = Invisible Work:  Ability to memorize everything the moment she sees it.\\n\r\n2.  Shuu     Power = Transporter: Ability to transport to wherever he wants to \\n\r\n3.  Kanade  Power = Heaven's Gate: Ability to make whatever she wants while deducting money from her savings account\\n\r\n4.  Akane   Power = Gravity Core: Ability to control the gravity of any person or object\\n\r\n5.  Misaki   Power = All for one: Ability to make up to seven clones of herself\\n\r\n6.  Haruka   Power = Lots of Next: Ability to predict the outcome of anything in percentages\\n\r\n7.  Hikari     Power = God Hand: Ability to make change the growth state of any living being\\n\r\n8.  Teru      Power= Limit Over: Ability to increase his body's strength drastically\\n\r\n9.  Shiori     Power = Soulmate: Ability to telepathically communicate to any inanimate object\\n\\n\r\nWith their Chuunibyou named powers, the nine siblings are the heart of the series.  With each of their unique powers, each of them get into various situations (usually Akane), which creates the brunt of the entertainment value for this series.  As mentioned before, only the older siblings (and Hikari) really get any semblance of development for this series and as a result, several of them are left in the dust simply because they are either put into the supporting role like Haruka, or are only there sparingly like Shiori.  They don't juggle the nine sibling gimmick well which does hurt the show as a whole.  \\n\\n\r\nAside from the siblings, the rest of the cast is comprised of their parents, as well as various other people from around the city, the side characters primarily being people that the family interacts with on a daily basis, such as the siblings' friends, attendants from the royal guard, and the cat, who only shows up for like, two episodes disappointingly.  The side characters are for the most part plot devices and only serve to move the story along as a whole.  They don't play much of a role beyond that as they really only support the respective Sakurada sibling that they interact with.  \\n\\n\r\nOverview:\\n\r\n+ The siblings themselves (because the concept and execution of them was good, I admit)\\n\r\n-  Some of the siblings were simply shoved to the side\\n\r\n-  Side characters serve as nothing more than plot devices in order to move the plot along\\n\\n\r\nArt: Joukamachi's artstyle is very standard for the level of animation one can expect from today's seasonal anime.  Every character is drawn with a moe style of design and the show itself doesn't really look much different than what you would generally expect.  As a comedy anime, it also uses exaggerated expressions and occasional face changes in order to showcase a comedic version as to what the character is feeling at the moment.  Honestly though, there's nothing particularly remarkable about it, so there's nothing really much to say for the art style as a whole.\\n\\n\r\nHowever, there are a couple specific things about the look that does raise a couple questions.  One of the more prominent things are the cameras in the series.  In order to add to Akane's shyness from attention, the entire realm of Dandelion Town is riddled with security cameras that she tries to hide away from.  The thing is, these cameras are CGI pieces and are so glaring to look at that they do not fit into the series at all.  They look awkward and are just honestly cringeworthy.  Another thing to note is the fact that several backgrounds in the show lack some detail when they're being introduced.  These still images of background shots honestly look lackluster and are severely lacking in quality, which is both easy to spot and cringeworthy to watch.\\n\\n\r\nOverview:\\n\r\n+/- Standard moe artstyle (dependent on your feelings towards moe)\\n\r\n-  Some details were glaringly obviously lazily made\\n\\n\r\nSound:  For the soundtrack of Joukamachi, the series hosts a pair of OP and ED tracks that honestly, sound the same.  They're both these very bubbly and bright songs that utilize guitars and other upbeat melodies and basically sound the same.  They're pretty generic and there's really nothing particularly noteworthy about them since they don't have that specific memorable part or anything of that sort to make them a memorable track.  \\n\\n\r\nOverview:\\n\r\n+/-  Average soundtrack\\n\\n\r\nPersonal Enjoyment: Joukamachi is a show that despite its flaws was still fairly fun to watch.  There were parts of it that actually set it apart form some other comedy Slice of Life anime, which made the show a little more unique as a whole.  \\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nYes, I did.  While I do complain about a couple things, Joukamachi was overall still pretty fun to watch.  Enjoying the interactions between the nine siblings was something that I got a pretty good laugh out of and in the end, it was entertaining to watch.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nMore than anything, the tone shift from happy to serious or vice versa did leave  a little bit to be desired.  Since the show had several backstories as to why some characters are the way they are presented in the series, the show shifted its generally carefree attitude in exchange for a slightly depressing one to explain the \"tragedy\" which angers me a bit because it does a complete tone shift and doesn't feel like the show it's supposed to be until it switches back.\\n\\n\r\nWould I recommend this anime?  \\n\\n\r\nIf you're like me and you want to watch a half-decent comedy anime, Joukamachi is worth giving a shot.  While it's not the most original seeing how its comedy focuses mostly on the flustering of the shy girl, there are some aspects to it that make it a little bit more interesting to watch than one may think.  But then again, comedy is subjective, so take that with a grain of salt when deciding.",
            "date": "2015-09-19T01:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 198869,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=198869"
        },
        {
            "content": "It's so sad anime series always have an end...\r\nAnyways back to the review!\r\nShort Summary:\r\nThe Sakuraba family which is an \"ordinary\" family of 11 people, however they are the royal family. Each of the children have a special power that is proof of having the royal blood. Sakuraba Soichiro, the king and their father decides to hold an election to see who takes his place as the king. These elections are to be held when the oldest child Aoi graduates high school. \r\nWho will be the next king?\r\nSo first off WHAT A PLOT!\r\nTo think that someone could even THINK of a plot like this!\r\nEven the partwhere each of the children have their own unique powers makes it even MORE interesting!\\n\r\nHonestly I had so much fun watching this anime.\\n\\n\r\nAs you can see from the plot the children will each be aiming to gain plenty of votes to increase their chances of winning but it doesn't really stop their!\\n\r\nThey each have their own reasons for aiming to be king which are very unique as well.\\n\\n\r\nWhat I can say is that this anime series is unique in its own way. Even the jokes in the anime is classical yet unique! I really enjoyed the humor in this anime, no doubt about that!\\n\\n\r\nAlthough it may seem a little childish to some people due to the super powers and setting of the story \\n\r\nBUT\\n\r\nI can say that I fully enjoyed this anime!\\n\r\nAnd best of all the anime ended with a satisfying ending!!\\n\r\nHooray!!",
            "date": "2015-09-22T03:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 199201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=199201"
        },
        {
            "content": "An anime that has a really deep family relationship. Honestly , i never seen anime like this before. A story about 9 king's daughter/son and there was something special about them all. They all have a some mysterious power inclueding the king too.\r\nWell , from the story, this is comedy and drama type of anime so obviously there is no big twist. I like the plot. All the king's child was trying very hard to be a king. they all have their own objective to be a king even the younger one too. and from them all , there was one girl that didn't wantto be a king because it's to embarrassing just for people to see her. \\n\r\nThe story was simple but it was funny, and it's not about her too. the story is telling us about the others relationship too, Well there was a little bit romance too , though. Overall from the story , it was normal for me but the comedy really funny , So 7/10.\\n\\n\r\nThe art , the animation was standard for me. nothing special about the animation but it's a different matter for the character design. I really like the character design especially Kanade.\\n\r\nThere were a little bit of action , but not too hardcore so it was a little bit disappointing for me. They only show the hardcore one at the final episode and it was only for a while too. 8/10\\n\\n\r\nThe sound really fit perceft to the show. the OP and The ED really good , there were nothing wrong about the Soundtrack too , So Overall 7/10\\n\\n\r\nNow finally the character. I really like the character especially Akane , Aoi and Kanade. \\n\r\nAkane was a shy person. for some issue when she was still a kid, she can't stand for people seeing her again even she can't stand being seen by security camera. because of that she must got to school without getting cought by the security camera. If there's people walk pass by her, she will always hiding behind her sister and i found that very cute. If she's not with her sister, she will never go out from house. but aferwards she was trying very hard to overcome her weakness. \\n\\n\r\nThe first and the eldest child , Aoi , was very calm and cool , and kind too. She is too kind. For some mysterious reason , she got another new ability. That ability can make people do whatever she say. But even still , she will never use it to her friend , family or other people. I like her for doing that. Her kindness really warm. 7/10\\n\\n\r\nKanade, The third child or the second oldest daughter. i don't know people have the same thought as me or not, from my opinion , Kanade really likes teasing people, But the truth she was very kind person inside. She always cares for her brother and sister and always treasure it. This type of character was what i most like. \\n\r\nSo if i choose from Akane , Aoi and Kanade, I choose Kanade. \\n\r\nFor the rest of the character, The rest 6 sakurada child have their own personality and it was a unique ones. they all get a chance to tell their own story in the episode and i like that. 9/10 \\n\\n\r\nSo well , overall i really enjoy the episode. The comedy always following up to the story. So , yeah... , i like it. 8/10\\n\r\nOverall 9/10\\n\\n\r\nI really recommend this anime to you all , if you like slice of life anime.\\n\r\nSorry if my english isn't very good.\\n\r\nHope the review can be helpfull to you all :D \\n\\n",
            "date": "2015-09-21T04:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 199131,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4481249.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/YizelTro",
                "username": "YizelTro"
            },
            "url": "https://myanimelist.net/reviews.php?id=199131"
        },
        {
            "content": "Joukamachi no Dandelion is a series of short stories weaved together to tell the story of a royal family with super powers who are competing in an election to be the new king of their country. Joukamachi no Dnadelion reveals each character's motivations and backstory in a short story, episodic manner. \r\nThe story of JnD is fair, it's style of storytelling is an innovation to the standard metric but it has its pitfalls. Due to its style of focusing in on a few characters each episode, the story is largely strong or weak based on the characters. The actual lack of plot is probably thebiggest problem, with most of the important \"stuff\" that happens in the story being the result of flashbacks and not actions taken by the character in the present. This is not a damning problem though, because its short story format allows for this style of story telling. The ending is much much stronger than the first half and it's really enjoyable for that reason. The pacing is alright, and character development is something that is actually noticeable episode by episode.\\n\\n\r\nI love the art is JnD. Each character feels distinctive due to their attention to detail and unique appearances. The small details bring an already appealing style up to a great standard. The sound is very good, with Kana Hanazawa doing a fantastic job.\\n\\n\r\nOverall, this is a pretty enjoyable ride. It's not thrilling, deep, or dark edgy nine me. It's simple, silly, and it will make you feel content with its above average qualities. If you like short stories, you'll love this!\\n\\n\r\nStory (6), Art (9), Sound (8), Character (8), Enjoyment (7) Overall (8)",
            "date": "2015-10-22T10:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 201753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3171461.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tevron",
                "username": "Tevron"
            },
            "url": "https://myanimelist.net/reviews.php?id=201753"
        },
        {
            "content": "There are some anime you just can't help but feel happy while watching.  Joukamachi no Dandelion, or Castle Town Dandelion, is one of those anime.  Firstly I would like to share my one and only real complaint.  The description of this anime made me believe that a big part of the story would focus solely around Akane, and while it does to an extent I personally just felt it wasn't enough to justify her specific character being used in the anime's description.  Now, I will write a review based on each of the six categories in the rating system: story, art,sound, character, enjoyment, and overall.  \\n\\n\r\n1) Story\\n\r\nThe basic background of the story really isn't all that new.  There have been stories over \"the battle for the throne\" for forever, however Joukamachi no Dandelion revisits this idea with a fresh twist.  The concept of having a democratic election in a monarchy is utterly unique and was really the biggest draw for me.  And even though the anime mainly revolves around the campaign, the story itself is still more an inside look at a family who just happen to be royalty and a year in their lives leading up to an all-important election to decide who will be the next king.  \\n\\n\r\n2) Art\\n\r\nI love the art all-around.  The style is nice and clean, the animated effects were done very well, and the background was vibrant but not distracting.  Absolutely perfect.  \\n\\n\r\n3) Sound\\n\r\nTypical sounds such as special effects, voice acting, ect. were very good, but that's not what I want to focus on!  I'm the type who will typically watch the OP and ED of an anime once or twice so that I know it, but then I want to just skip it and get to the actual anime.  Joukamachi no Dandelion is an exception.  I absolutely had to listen to them, there were no if's, and's, or but's about it!  Even while writing this review, Ring Ring Rainbow!! is still playing in the back of my mind~!\\n\\n\r\n4) Characters\\n\r\nI adored the cast of characters in Joukamachi no Dandelion.  Since the siblings were the focal point for the series, of course, we saw a lot of them.  However, how do you properly showcase nine characters in a 12-episode-long anime?  Not only that but how do you manage to give them any depth of character?  Well, I have no idea how they did it, but the makers of Joukamachi no Dandelion managed it.  I personally would have liked to see more of the two youngest siblings, but thinking about it logically I know it would have been a time waster to put more airtime on two characters that were obviously not seriously in the running for the crown.  Now in saying that, I believe that they both do get sufficient time to showcase their personalities and play their own role in the big picture.  Speaking of personalities, there are a lot!  Each sibling has their own story and character to round out, and somehow in 12 episodes we get to see it all.  Not only do we get to personally know the siblings and get a sneak-peek into their private lives, but the makers of Joukamachi no Dandelion somehow also found a way to add in some insight into the parents as well!  \\n\\n\r\nTo finish off I'm going to bundle Enjoyment and Overall together since in my mind they're kind of one in the same.  There wasn't a dull moment in this entire anime.  I loved every second of it.  I was able to get so immersed in the story and get to know the cast of characters so well.  This could have easily been drawn out into a more lengthy series, but it wasn't.  And it's one of the rare times where I feel like the length of the anime was just right.  I leave feeling happy and fulfilled.  And I hope that anyone who chooses to watch Joukamachi no Dandelion leaves feeling the same.",
            "date": "2016-08-06T23:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 226115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1428667.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kina-chan",
                "username": "Kina-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=226115"
        },
        {
            "content": "Story: 7/10\r\nIt is a slice of life/comedy anime, and even if I enjoy watching this kind of anime I’m REALLY picky in it. Let me tell you this one is of the few ones I really enjoyed and kept me waiting for the next episode, it wasn’t because of the art or the depth of the characters but because it was actually funny and made me laugh my lungs out. The story is linear and there’s no way to lose yourself in complex plot or anything, just follow the daily life of nine siblings that happen to be part of royalty. The story mainly followsall the events that happen before the election for the new king, which all the siblings partake. Some episodes really don’t bring anything new to the main plot but they are amusing to watch, though I hated the ending not because of who was chosen but it was all too quick to even take it seriously.\\n\\n\r\nArt: 6/10 \\n\r\nThe art is that of a classic shoujo, which is not bad but I think I have seen a lot of this style lately. It is nothing that stands out from the crowd and makes it look kind of bland, but the art style fit perfectly tah type of story it’s telling. And one last thing that bothered me from the beginning… Why don’t they at least look a bit alike though they are all from the same father and mother? Anime logic in its truest expression right here. \\n\\n\r\nSound: 7/10\\n\r\nThe voices were okay, then again nothing that stands out. The opening and ending were really nice, I already have the OST and I love it, represents what the anime wants to transmit. A heart-warming and cute aura all around. I highly recommend the two songs. \\n\\n\r\nCharacters: 7/10\\n\r\nIn the anime they tried to expose every sibling’s personalities, which resulted in all the episodes viewpoint’s changing and made it more dynamic than remaining on a single character. Some characters were more developed than others, but the depth that some characters reflected was amazing. My favorite character will always be Aoi-neesama, why didn’t anyone made a fan club for her?\\n\\n\r\nEnjoyment: 7/10 \\n\r\nThe story although it was different from any other it still lacked something, and I will never forget how they threw the ending as if they just got too tired to even care anymore. The growth of the characters was the only thing interesting to watch at the end, which made the series amusing to watch. I would recommend the anime only if you have nothing else to watch and want to laugh for a while. \\n",
            "date": "2015-09-29T22:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 200125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1280209.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Queen-Usagi",
                "username": "Queen-Usagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=200125"
        },
        {
            "content": "The royal Sakurada family houses eleven members--the king, the queen, and their nine children with different colored hair: Aoi, Shuu, Kanade, Akane, Haruka, Misaki, Hikari, Teru, and Shiori. All nine of the children have unique superpowers. The king decides he wants to decide on his successor, so he designs a popularity test that normal citizens can participate in. The entire kingdom is filmed by hundreds of security cameras, so the citizens can observe the nine siblings and vote for their choice for the next king.\r\nJoukamachi no Dandelion is a mildly entertaining comedy/slice of life show that was kind of doomed from the start because ofits premise. Despite having its funny moments and its \"I'm dying laughing\" moments, it has some plot holes that fail to be addressed throughout the entire series. Why does the king want to choose an heir now? Is he ailing? If there's no rush, why would he hold an election now when more than half of his children haven't even entered high school yet? How are the two youngest children, who aren't even in first grade yet, supposed to have a fair shot? We never get the answers to these questions, and they make the entire show seem kind of....pointless.\\n\\n\r\nThe other reason I say that Dandelion was doomed from the start is because of its ridiculous wealth of main characters. There are NINE. We sort of regard Akane as the \"main\" main character, since she narrates the beginning of the series, but the series is given the hard task of equally representing nine siblings in just 12 episodes. Does it do a good job? Not really. The ending is an asspull, and the election result comes out of left field. It kind of undermines what happened in the previous 11 episodes, which is a disappointment to say the least.\\n\\n\r\nWhile there are some really great comedy gold moments in Dandelion (usually involving Akane and/or her fan club), there are just as many monotonous scenes. (Looking at you, Hikari.) And because there's such an iffy plot, a lot of airtime is spent selling and trying to develop the individual siblings. Like I said, nine main characters is a bit much for any show, even more so a one-cour show. It doesn't help that most of the siblings' motivations are stupid and undeserving of a crown.\\n\\n\r\nThat isn't to say that anime with lots of characters can't be successful. A perfect example is Shirobako, the infamous \"animeception\" series that featured over 50 characters, so many that I don't even remember most of their names. And another example is any sports anime, basically. Despite having so many characters and needing to cover so many backstories, these anime do well. Why? Perhaps it's because the plot is so more compelling. And as I already mentioned, Dandelion's plot has some significant holes from the start.\\n\\n\r\nDandelion's art is pretty good, albeit generic. It can be hard to tell the characters apart sometimes (especially Karen and Kanade, or Shu and Fukushina). The OST didn't particularly stand out to me, but it was light-hearted and complemented the overall mood of the anime. And the animation was nice and fluid, with no hiccups. (Mikagura Gakuen Kumikyoku comes to mind.) And the voice acting was ON POINT; I was especially thrilled to hear HanaKana's kawaii-as-fuck voice again!\\n\\n\r\nThis may sound hypocritical now, but Joukamachi no Dandelion was my 2nd favorite anime of the season. It was enjoyable and comedic at times, despite the plot holes I mentioned above. It was a fun watch, even though overall it wasn't one of the better comedy/slice of life shows I've seen. I think it would have done much better with half as many characters. But I'd still watch it again.\\n\\n\r\nOverall score: 6/10 \\n\r\nDo I recommend it? Yes.",
            "date": "2015-09-21T18:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 199178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2969759.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/psychoalchemist",
                "username": "psychoalchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=199178"
        },
        {
            "content": "[This review contains minor spoilers.]\r\nI am glad that I watched this.\r\nI would probably recommend this to others.\r\nI have watched this once, subtitled. I have only watched the anime.\r\nI probably won't watch this again.\r\n---- Positives ----\r\nThe series covers most of the characters well enough, and gives a higher amount of focus to Akane.\r\nThis series has nine siblings to focus on, which is understandably difficult. Akane gets more focus than the other characters, which makes the series easier to follow. All of the siblings get decent coverage. However, coverage is partially a negative, covered in the Negatives section below.\r\nThe characters are upbeat.\r\nEven though the main focus ofthis series is on the upcoming royal election, the characters gather support solely through positive efforts. They don't pull each other down.\\n\\n\r\nSpecial powers are lightly explained as they're used.\\n\r\nThis series doesn't go into too much detail on the special powers of the royal siblings. Instead, they use their powers to varying degrees without limitations being the focus [a few events actually do focus on limitations, though]. This is listed as a positive because the series worked well without limitations being the focus.\\n\\n\r\nIt actually ends.\\n\r\nThe final episode actually wraps the series up.\\n\\n\r\nA good romantic couple.\\n\r\nThis series has a confession and a positive reply, and the relationship makes sense and works throughout the series. It also gets a fair bit of indirect focus.\\n\\n\r\nAkane's voice.\\n\r\nAkane is voiced particularly well for her role.\\n\\n\r\n---- Negatives ----\\n\\n\r\nThe ending wasn't bad, but it wasn't good either.\\n\r\nSomeone actually does win the royal election, but the way that they win it, and who the winner is could have been done better. There are a few hints about the chosen ending, but it still feels like the writers chose the winner without giving enough characterization to any of the royal siblings.\\n\r\nOpportunity for cancel: Maybe. The actual focus of the series seemed to be about the royal siblings growing as people, with the election just being a reason for doing it. After the election winner is announced, everyone seems to go along with result without any objections, and things conclude on a high note.\\n\\n\r\nThere are a lot of main characters, so some don't get much coverage.\\n\r\nIt felt like Akane, Kanade, Shuu, and Hikari got the most focus. Teru, Shiori, Misaki, Haruka, and Aoi seemed to get less focus. This estimate isn't by time, but by direct focus and prominence throughout the series, by the impression that I got after my first watch. [note : Aoi got a high amount of time spent on her, but those sections were comparatively tame]\\n\r\nOpportunity for cancel: Yes. Giving more focus to certain characters when dealing with a large cast is a good strategy. If characters get too even of a focus, there's a risk of the series being difficult to casually follow. All characters got a good base level of focus, just some acceptably more than others.",
            "date": "2017-03-06T22:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 242034,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5753100.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sorata861",
                "username": "sorata861"
            },
            "url": "https://myanimelist.net/reviews.php?id=242034"
        },
        {
            "content": "This show is stupid. That needs to be said. The premise is ridiculous, the story stretches itself too far, and it's not exactly inspired in terms of jokes or visual design.\r\nHowever, it must also be said, you need to watch at least the first two episodes. The exponential quality jump from Episode 1 to Episode 2 is what made me reconsider this show as a lackluster guilty pleasure for the absurdity to a genuine story that I would want to follow. It establishes a through-line that carries the entire series, and things get much better from the initial impressions.\r\nThis show has some solid emotional highpoints and an interesting examination of several members of the family, though not quite all of them. Initially you think this is a show about Akane and her panties, but it really takes the time to develop the character's perspectives over the course of the show. The wacky powers are used a bit too much as plot progression, but they do add a fun flair to the siblings' interactions.\\n\\n\r\nWhat really lets this show down is the dialogue. This is extremely exacerbated in the first episode, where I felt like I was being beat over the head with repeated explanations. Again, this does get better, but I think the acting through situations and animation is better than the script, though the voice cast isn't bad. The dialogue was just so persistently uninspired that it really made me grit my teeth when there was a great scene with no back supporting it.\\n\\n\r\nI was really surprised how much I was invested by the end of this show. It's dumb fun with some good laughs once it gets rolling. Don't expect them to do something amazing with the premise, but the characters really pulled this show through. They are memorable and quirky in all the right ways to make for an interesting goal-oriented comedy.",
            "date": "2016-05-04T11:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 217866,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4627708.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AguyinaRPG",
                "username": "AguyinaRPG"
            },
            "url": "https://myanimelist.net/reviews.php?id=217866"
        }
    ],
    [
        {
            "content": "All the daughters and sons of the king\r\nWere one day forced into competing\r\nTo see who'll take the crown\r\nAnd inherit the town\r\nIt's a tough job for every sibling\r\nSo the lot of them started campaigning\r\nWith the hope of some supporters gaining\r\nSince the people would choose\r\nNot only who would lose\r\nBut also the next king to be reigning\r\nThey were all being watched at all hours\r\nEverywhere except maybe the showers\r\nThey were shown on TV\r\nFor the townsfolk to see\r\nAs they exercised their super powers\r\nOh yes, one of the siblings could fly\r\nAnd another one could multiply\r\nOne could summon a chair\r\nAs if out of thin air\r\nIf her bank account doesn't run dry\r\nAnd thuseach and every single scion\\n\r\nSought to be someone you could rely on\\n\r\nBut life will find a way\\n\r\nIt's just another day\\n\r\nIn the Castle Town called Dandelion\\n\\n\\n\r\nJoukamachi no Dandelion is a rare series in the sense that it is effectively the anime equivalent of a celebrity variety show. Originally a 4-koma manga, the story follows the royal Sakurada family, consisting of the king and queen as well as their nine children. However despite the tiny country seemingly being a monarchy, the actual decision on which one of the princes and princesses will become the next heir to the throne is done by an entirely democratic process.  They have to go campaigning in the streets and make political speeches in order to attract voters and then hopefully win the upcoming election and thus become the next king. To aid this, there is a total of 200 security cameras distributed throughout the town which follow the Sakuradas’ every move and broadcast it immediately on national TV for the population to see. So it’s basically a sitcom in that sense.\\n\\n\r\nTo add to that already quite erratic premise, all the Sakurada children also have their own individual super powers for whatever reason, including gravity control, instant learning, teleportation, object creation, mathematical future prediction, self-cloning, manipulation of biological growth, superhuman strength, as well as communication with animals and even inanimate objects. In short, there’s a lot of variety in this anime and it does a surprisingly good job at giving each of the Sakurada siblings a respectable amount of screen time and characterization.\\n\\n\r\nBecause of its 4-koma origins, the anime consists of many smaller parts and most of the episodes are divided into two, sometimes even three short stories instead of a single one spanning the entire episode. Despite this however, it still manages to progress the overall election process fairly well throughout the anime. The shorter segments also mean that the large number of main characters still all get a decent amount of storytelling dedicated to them individually, which helps a lot.\\n\\n\r\nI don’t think you can really call anyone a protagonist in this story, but the one who gets the most screen time is Akane. She’s a very typical HanaKana moeblob who is pretty much the spitting image of Onodera Kosaki to me. I have a bit of a problem with her in the sense that she’s so unbelievably shy that sometimes when she gets embarrassed even I’m starting to feel awkward just by watching her, which ticks me off a bit. But either way there are a ton of characters in Dandelion so I’m pretty sure everyone will find at least someone amongst them which they can grow fond of.\\n\\n\r\nOverall, Joukamachi no Dandelion is hardly a masterpiece by any means, but it manages to stand out a bit from your typical slice of life comedy due to its unusually hectic premise and story. If nothing else, I have almost nothing straight-up bad to say about it, which is more than I can say for most anime.",
            "date": "2015-09-18T08:32:00+00:00",
            "helpful_count": 96,
            "mal_id": 198819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=198819"
        },
        {
            "content": "Joukamachi no Dandelion;in English, Castle Town Dandelion, is an incredibly enjoying and fun anime to watch. Despite the story being simple, the show manages to bring out elements of development throughout the entire series, which many animes have failed to do so. \r\nThe Story is simple. Even though the Super Power Genre has been added into the series, it was used very differently compared to other animes, the story does not revolve around the super power, but instead on the daily lives of the 9 characters. Hence, the 'Slice of Life' Genre. \r\nThe sound used in the anime befits the anime a lot, the OSTare cheerful, and fun, or perhaps at times calming. These OST are used properly at the right time, the OST had never felt or sounded weird to me even once, so it's definitely a Plus to the anime. The Opening and Ending are really catchy as well, I've never skipped it even once, hopefully many of you will think so too.\\n\\n\r\nThe Art is just... magnificent LOL. The art is incredibly consistent and bright, it's incredibly pleasant to look at, and it also brings out the Moe of the character to it's best. If you're looking for an anime with really good art, this anime certainly wouldn't fail to reach your expectations.\\n\\n\r\nNow for the main factor which led to me giving a high score to this anime... the Characters. \\n\r\nThe Characters are simply unique, even though their types might be common and seen all about in the anime industry, their personalities differ from these types, and their added sense of duty and responsibility also further shines upon their character.\\n\r\nEach character are different from the rest, there is never a character whom I found boring, from the Benevolent Shiori, to the Shy Akane. Personally, Shu is one of my favorites in this show, his character varies a lot, he's not Denser than the periodic table like the majority of the cohort in anime, nor is he one dimensional. In fact, he consistently displays a unique approach towards dealing with things, which aren't easily seen in many animes nowadays.  \\n\r\nAnd Most importantly, all the characters develop throughout the series from experiencing things, so they're never constantly displaying the same attitude nor behavior throughout the series, which is a Major Plus for me, as I tend to determine a Show's true worth through it's characters and their Development.\\n\\n\r\nIn Conclusion, I'd Highly recommend this anime to anyone who enjoys Slice of Life, or wants a peace of mind from their stressful lives. \\n\r\nCiaos, I hope you will make the decision to watch the anime after reading my review. :D",
            "date": "2015-09-18T11:43:00+00:00",
            "helpful_count": 70,
            "mal_id": 198825,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3782683.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lanciare",
                "username": "Lanciare"
            },
            "url": "https://myanimelist.net/reviews.php?id=198825"
        },
        {
            "content": "~Joukamachi no Dandelion~\r\n- Story - 6 - [Supernatural is not for Action it's quite Unique]\r\nIt's a two story in one episode, but it was executed well.\r\nThe story is very Simple, but the Lessons you can get are the Hidden Message of this Anime. It's very good, the execution is well done and the plot is not all over the place.\r\nThe story is very predictable, but the characters aren't, they've changed a lot.\r\nIn terms of Adaptation over Originality, the Anime is way better, and the pacing is good.\r\nIt's an anime that focuses on Character Development and Supernatural Slice of Life, but the Hidden element of thisstory is the best, Being a Fun Royalty.\\n\r\nSo far they've used Flashbacks, First-person Narration and Magical realism as their literary techniques.\\n\r\nThe Ending was Epic, It was one of the Best! The last episode have shown Principles and Dignity, and the best Conclusion to close the Anime, Overall it's the Best Slice of Life you can get this Year. I love Anime that can bring up their Specific genre, and to make an Unexpected Events, and this one was able to Check that Box, The box of Unpredictable Events, Anime with Sense, Nice comedy and not exaggerated, One of the Best Light Series This Year. If this is a dark anime, this is Par on Fate/Zero, which the Dark Version of this one.\\n\\n\r\n- Art - 7 - [expressions sometimes leads into incest feeling if you're watching] \\n\r\nThe art is clean, it meets the expected standard of an anime.\\n\r\nThe art was able to express the fitting mood, especially the characters expression. And it fits in the Story.\\n\r\nThey didn't mixed any CGI or Live Action Clip, mostly 2d with few 3d art styles.\\n\r\nThe animation is really smooth, especially when the characters Power Up\\n\r\nThe art style is very clean from the start, and the Background and the fits the anime, especially for the beautiful scenes.\\n\r\nThe Character Design is the Best Art in this Anime, they fit so much that it will make you smile when you see them.\\n\r\nThe Character Design is unique, and none of them are repetitive, or based on other works, they've even showed the genealogy of each character, which makes me smile.\\n\\n\r\n- Sound - 6 - [it lacks in many moments, but was able to enter important scenes]\\n\r\nThe Characters have the Best Voice Actors/Actresses, they fit so much that it will make you happy.\\n\r\nThe seiyuus doesn't need to adapt, and they were able to play them perfectly\\n\r\nAnd I think, the seiyuus enjoyed this short anime.\\n\r\nI wanna see them playing their role outside the anime studio or during it's record.\\n\r\nThe background music always fits the mood, it always catch my attention\\n\r\nBut I wasn't able to found any uploaded OSTs which I plan to use if I will read slice of life manga,\\n\r\nThe opening and the ending song are really Light, they promote Happiness.\\n\r\nThough it's not catchy for me, because I love Dark and Metal Songs.\\n\\n\r\n- Character - 8 - [the greatest piece in this anime which is absent in many animes]\\n\r\nThe characters here are the best, They have their own personality with Strength and Weaknesses, and most of the time, they will make you smile.\\n\r\nThe characters always react in realistic way in normal circumstance, but as I said, it's a supernatural anime, but they've used their power in the realistic way.\\n\r\nThe characters are relatable, they have shown their strength, but not their powers, but on how they use them. And they've shown their weaknesses when they are in trouble in life. Lastly, they've always helped each other\\n\r\nAnd the Best in this Anime, is the Character Development. They've developed so much more than what I expected. They've conquered their own weaknesses and was able to changed for better. And they were able to show their Dependable side to people.\\n\r\nThe main characters always stands out, but the background people was able to bring the best role for their scene like: Surprised Reaction\\n\r\nThough I didn't see any antagonist in this anime, the siblings fight for Royal Candidacy, but they fight Fair and Just. But there's no Psychological and Action in this anime, just plain Supernatural Slice of Life.\\n\r\nThe Supporting Characters can par against the Main Characters in terms of Role Playing. They were able to produce the best fitting Supporting Characters needed for some occasions or scenes for each Main Character in this anime.\\n\r\nThey've have used First Person Narration: the Main Characters are ones who narrates the story.\\n\r\nThe Characters are very Likable, you will love them because of their Values, each of them have developed in the story, better than I expected.\\n\r\nI will remember the characters in the story, but not as an individual, but as a Happy Family with Values to Learn [Super Royal Family]\\n\\n\r\n- Enjoyment - 9 - [one of the best relaxing animes]\\n\r\nThe people who loves Comedy, Seinen (Philosophical), Slice of Life, Super Power will love this.\\n\r\nI think this one fits for Teen Newbies, or non anime fan.\\n\r\nThis is really good if you want to watch some scenes, or to re-watched the whole anime.\\n\r\nAnd I think it is still enjoyable to re-watched this anime even it is predictable.\\n\r\nThis is an Anime that should be stored/remembered as a Relaxing/Happy/Light Anime.\\n\r\nThe Values(Philosophies) of this anime is the bests that marked my mind/heart. But I think I might forget this anime, but not the character's principles and the Family. I've just watched this to kill time and stored this for comedy relief if I will read/watch Dark and Intense Manga/Anime.\\n\\n\r\n- Overall - 8 - Fair and Fine [this is par on many great animes, just go to my profile]\\n\r\nHow it was DONE. IT did the Best Thing it can Do. this is already a Good Score in my Rating Style. It was able to bring out its Potential in this Manga. Art meets the mood, sometimes it can create a misunderstanding like \"Twincest\" which is not really true, and the sound was able to enter its scene especially in the Romantic Scene of Shuu. the story is nothing special but it's relaxing, but the Character Development is something that should be present in Many Animes and Mangas. It has Philosophical Values and was able to simplify it for general audiences.\\n\\n\r\n- Worth - 5 - Philosophical Hierarchy [doesn't abused their authority and always gets along with the commoners] [simple creative]\\n\r\nThis anime is worth for its Philosophical Aspects that are not present in many animes. It was Able to turn almost all characters in 180 degrees. It's an example of Characters>Story/Art/Sound, so I really Enjoyed this Show. This is a Recommendable Anime. just go to my account if you're Curious about my Rating Style.",
            "date": "2015-09-21T02:01:00+00:00",
            "helpful_count": 38,
            "mal_id": 199127,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4762431.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/VanAlex",
                "username": "VanAlex"
            },
            "url": "https://myanimelist.net/reviews.php?id=199127"
        },
        {
            "content": "-TL:DR at the bottom, some spoilers too so watch out-\r\nIt’s not often you’ll find an anime where a cast so big is utilised so effectively, where everyone gets a decent amount of spotlight, as well as development. It doesn’t stray with excessive filler, and stays on point to the story, which is the election. With comedic elements and a little bitta eechay, the absolute best thing about Joukamachi is its characters. Each sibling is fitted with their own unique personality, design, interaction as well as powers. Although simple, their powers add much to their development, as well as make the show highly entertaining to watch,apart from your typical slice of life story. \\n\r\nWhat makes this anime super fun to experience as a competition is that they’re family; you will probably rarely ever see interactions of this kind in other anime of similar concept. While they are competitive with each other, they still need to support and care for each other as siblings. This creates important bonds such as those found between Haruka and Misaki, Shu and Kanade etc. It’s not super obvious from the start who is going to win either; the anime manages to keep you guessing. I doubt that a viewer will know from the beginning who does win. At the same time, it also pretty quickly reveals who is serious about the election, and who is not so serious (as well as unlikely). Important to note that it’s an original ending, and the manga is ongoing where the election process is actually 3 years.\\n\r\n~ AOI-SAMA ~\\n\r\nThe oldest sibling, remaining to be the most popular candidate until the end. It is also contradictory that the person who is most likely and fitting to be king (given her powers), doesn’t want to be king. The anime makes Aoi interesting in that fact that she lies about her power initially, even to the general public. Souichiro also decides to keep this a secret and takes pride in that she does not want to be king due to her actual powers. Despite this, this lone fact makes her so strong and convincing as a character; she has no reason or drive to become king, as the election has made her notice what is truly important to her. She does not seek fame, attention or power, but simply craves meaningful and genuine relationships with her friends. The realisation that she could get anyone to do anything for is, in her view, wrongful. It has made her cherish normal relationships as well as a normal life.\\n\r\n~ SHU ~\\n\r\nThe anime does keep us guessing who it is that will end up being king, unless you anticipate an open ending, but anime working towards a final outcome tend not do this. However, Shu being king really does make sense; he is the oldest male in amongst his siblings; he has had a queen in Hana since episode 2 (also giving him a reason to become king); and by the end, is overall the most fitting. Joukamachi covers this eventuality up nicely making Akane very clearly the main character, but also Aoi being first place for the majority of the election and Shu taking a backseat in votes. Shu’s power also seems to be more utility based than anything, still very powerful, but not one suited for ruling like Aoi or Kanade. It’s also another irony, in the fact that his power is based around instant transportation, yet his actual mobility is limited by his injury. Ultimately it makes sense for Shu to become king. In the end segment, he got his final speech in and showed what mattered to him most – ensuring the safety and happiness of all the people he cares about, that being his country and loved ones, and proving this by taking initiative in the hot air balloon incident. Not to mention, he looks exactly like his dad when he was younger.\\n\\n\r\n~ KANADE ~\\n\r\nKanade had been the fiercest competitor since the start, but ultimately had selfish reasons for doing so. She’s shown to be a character who won’t stop at getting what she wants, which is befitting of her power where she literally can. Despite this, it’s ironic in that fact that in some scenes, she’s seen shopping just as any other ordinary citizen. She excuses that menial tasks also mean more chance to be in the public eye. Kanade is all about efficiency and is a very forward-looking person, at times manipulative. Kanade does not like uncertainty and wants to prove to Haruka that probabilities are not just probabilities. Even though this is the case, the reasoning behind all her actions is more fragile than you’d think, though does still make sense. Not only wanting to help Shu, she more so wants to be seen as an equal, being Shu’s twin. However, in the view of Shu, the older brother must always take care of the little sister, which is also true of Haruka and Misaki, as well as Teru and Shiori.\\n\\n\r\n~ AKANE ~\\n\r\nIs voiced by KanaHana, but I don’t actually care this time, it fits. I think Akane is a really good main character. I often like anime that put emphasis on the side characters but follow the story primarily through one character’s perspective. Akane is the main character, but the anime doesn’t make this overly obvious, and doesn’t put the greatest emphasis on her. Her role in the story is to tie the rest of the family together and provides middle ground for all characters to interact. By the end of the election, Akane’s development is sound. In the end, she seems much more comfortable in public due to the realisation that as a public figure of royalty, she has a duty and responsibility of ensuring the safety of her people and that the payoff of doing so is heavily rewarding. Hiding behind a persona is now unnecessary for her.\\n\\n\r\n~ MISAKI ~\\n\r\nAlthough maybe not taken seriously, Misaki is also a genuine competitor to the election. She may not have what it takes to become king and may not have a true reason for doing so, yet still feels a need to prove that she can become something. Unfortunately, the anime keeps it realistic in never giving her the top spots in votes, however this had gradually motivated her to become more serious about herself and the election throughout the story. Misaki decides to do speeches on her own rather than relying on her clones, as an example. She is an interesting addition in the fact that, while she is shown to be highly useful in day to day life and has a wide coverage of being able to do basically anything with her powers, she herself is not capable of much. However, Haruka sees this as a good thing; she is not highly gifted in certain things and may see the world better in the view of an ordinary person. She is best suited at doing comparatively unimportant tasks, but this is all the more important when her siblings are focused on other things or just aren’t as good as Misaki in a social sense. \\n\\n\\n\\n\r\n~ HARUKA ~\\n\r\nAlso, an interesting addition to the story. Haruka could probably foresee who would win the election throughout the entire process and could’ve actually used that to his advantage to potentially win. However, Haruka remained to be level-headed and realistic about what he himself is capable of, and that he lacks the confidence and drive to put himself in the spotlight and campaign. Instead of this, alongside his powers of prediction, it grants him perspective of whom it would actually be reasonable to become king. He is serious in helping others campaign, knowing that he himself would not be competing, and proves to be reliable on this front. He aids Misaki in assisting her with her confidence issues, proposes to write Misaki’s speeches as well as helps Hikari become an idol. Haruka’s role is especially important, considering how it has helped to develop the other characters so massively, especially Misaki.\\n\r\n~ HIKARI ~\\n\r\nHikari’s development stands out from the rest. You would expect Hikari to be a character that provides comedic relief and moe, but instead brought a meaningful perspective into the story. She was the only one who found what she wanted to do in the future other than becoming king. What started off as a basic idea to gain votes became her actual goal, heavily influenced by Sacchy. It’s interesting in the fact that she had such talent and intuition at such a young age, mixed with her power to mature whenever she wants, it’s almost as if she was born to do this from the start. By the end, Hikari no longer cares for the election, and deems her pride as an idol much more important to not only herself, but her fans. She realises this after her interaction with Aoi, who explained that a lie will remain a lie if you believe it is, which was a struggle that she herself had to face. Being an idol also contrasts the position of king. As she mentioned in the series, idols are not supposed to be perfect and may make mistakes, which ideal and preferable kings have a duty in avoiding. This differed from the clumsy Hikari, who would not take anything seriously when she didn’t feel the need to.\\n\r\n~ TERU ~\\n\r\nBy far the most righteous and respectful character in the story; Teru always refers to his family in a formal manner. His personality is consistent and convincing, Teru feels as if he’s limited by his age and insists on helping out in whichever way he can. His power is potentially the most powerful and reckless, however this is restricted as well as contradicted by his young age (therefore a ‘weak’ social standing in contrast) as well as the promise made to his mother, to which he remains honourable. This makes sense, as kids should listen to their parents(!). Teru can’t be taken seriously in the election but even so provides a refreshing perspective of a cool shounen type main character faced with ‘trials’ throughout the process. (did you see that last episode? Wow.) Also has a strong sense of duty to protect those important to him, especially Shiori.\\n\r\n~ SHIORI ~\\n\r\nShiori does not take part in the election, but dandelion is aware of this. Most of her role entails taking care of her siblings, to make sure they don’t go overboard in the election, and to take proper care of each other and themselves. It could be said that she cares more about others given the fact that she can communicate with anything, hence meaning she’s more considerate of the ‘feelings’ of everything around her. This also adds a comedic aspect; for example, her powers legitimately give a voice to their family cat, Borscht. In the end, it proves to be an extremely useful power which reinforces her ‘support’ role in the series. RIP Suika-san.\\n\\n\r\n~ SOUICHIRO ~\\n\r\nIt’s worth mentioning that Souichiro is also a key aspect in this series. He decided to hold the election at the end stage of Aoi’s high school career, as this was deemed by him the best time where the majority of his kids had a decent chance in becoming king. However, more importantly, it was a time where they could decide what they wanted to do with their lives, and to decide where their true ambition lied. With Hikari, this was an especially effective method. There are other cases as well, such as Aoi simply not wanting to become king even given the opportunity in trade for a normal life, as well as Kanade who changed her reasoning towards the end of the anime. He always grants permission and is a fairly doting parent, though this is simply because he believes strongly that they should not live life restricted by royalty, and that they are granted a choice in whatever it is they want to do. This idea came from the fact that he was an only child, with no real choice of becoming king or not. He did not want his kids to face the same issue, so if they truly wanted to become king, they would campaign.\\n\\n\r\nOverall, Joukamachi Dandelion doesn’t present overly deep themes, but is definitely very good at showing coming of age, values and perspective of its characters, especially within limited time. The art style is mega appealing, and it is generally good at being a unique, comedic, fun, and rewarding slice of life experience. I still don’t know why they chose dandelions, but one thing to note is that it grew in a different place than where it was seen before, perhaps representing change and progress. It may also symbolise Akane, who before was enclosed in her own shell, but now open to the world. Now only one thing bothers me… Does Karen like Akane?\\n\\n\r\nStory- 7 Art-9 Sound-7 Character-7 Enjoyment-7 \\n\r\nOverall- 7/10",
            "date": "2018-03-29T17:37:00+00:00",
            "helpful_count": 11,
            "mal_id": 275662,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4774815.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Abraham_Ford",
                "username": "Abraham_Ford"
            },
            "url": "https://myanimelist.net/reviews.php?id=275662"
        },
        {
            "content": "Last day I entered in my typic watch-anime-online-free-with-tons-of-publicity webpage and saw that the last episode of this series had been shown. I got pretty interested on a slice-of-life of princes so I started watching it.\r\nI finish it and I am very surprised in really different ways. Firstly for the character development. Even being really simple, pretty normal, it was really amazing. But not one for one, but all together. Those clichés characters all together makes the show really funny and interesting to watch. For me. This is the best thing of the anime so far.\r\nSecondly, for a simple reason: This is the type of seriesI like saying it can't be a masterpiece or an horrible show because it hasn't got actually any hide pontetial or truly weakness. The story is pretty simple. 12 episodes does not do magic, and this is the perfect example. If someone is looking for a truly amazing plot on a comedy/slice-of-life/romance series. This won't be yours.\\n\\n\r\nArt and sound didn't surprised actually. The drawing was good but the soundtrack was really bad. I don't remember any song and opening and ending didn't surprised me either.\\n\\n\r\nAn anime with highs and lows that I wouldn't actually recommend you if you haven't still watched other better previous shows.",
            "date": "2015-09-20T03:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 199004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/599757.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/keitwr",
                "username": "keitwr"
            },
            "url": "https://myanimelist.net/reviews.php?id=199004"
        },
        {
            "content": "There are times when you just want to sit down and enjoy a simple, fair and light hearted anime. Where the plot isn't the main focus, but the characters and their ideals. \r\nBy providing a mixture of unique characters with a simple and straight forward plot line, Dandelion seems to be a fun and comedic series that always puts a smile on your face at the end of every episode. \r\nSo if you are looking for an anime that isn't all that story rich but has aspects on character growth, where drama is solved within an episode. Joukamachi No Dandelion may just be anime you'relooking for.",
            "date": "2015-12-13T02:40:00+00:00",
            "helpful_count": 7,
            "mal_id": 205420,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4654901.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kaitonomiyaki",
                "username": "Kaitonomiyaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=205420"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nThanksgiving is just around the corner (at least, it was when I wrote this).\r\nThanksgiving means the succulent taste of an oven roasted turkey. Thanksgiving means exactly that: giving thanks. Thanksgiving means getting ready for Christmas. But what Thanksgiving means the most, like most holidays, is family. Getting to reminisce with Aunt Lisa while munching on her famous home-cooked bread. Letting Mary use her signature purple lipstick to leave the perfect kiss mark on everyone’s cheeks. Wishing that the grandparents would have stuck around instead of scurrying off to Florida.\r\nIn our family (and by family, I meanuncles, cousins, etc.) tradition is key. Thanksgiving is where we choose out of a hat the name of our Secret Santa, leaving us all plenty of time to agonize over what gifts to purchase. There is also the customary Apples to Apples card battle, trickery a must. And of course one cannot do without the chocolate milk speech just before the main meal.\\n\\n\r\nThis is a time for food and games and repetitive radio music. However it is family that makes the occasion not just a random gathering but a special, memorable event. Joukamachi no Dandelion likewise places family on a pedestal yet, metaphorically speaking, the stuffing is missing.\\n\\n\\n\r\nSTORY\\n\\n\r\nJoukamachi no Dandelion falls under the broad category of “nothing more than a small comedy”. Jokes, heartfelt moments, and a dash of romance fill the majority of the plot, realistically leaving little to discuss besides the usual quips on comedy and connection.\\n\\n\r\nAt the minimum, the construction of Joukamachi no Dandelion’s narrative (if it can be called as much) takes a smart approach. Most episodes are comprised of two – sometimes three – different tales rather than a whole arc. This slicing carves the show into manageable pieces, causing the slice-of-life scenarios to feel like they should: singular sections that get right to the point. Nothing ever feels prolonged since the snapshot direction keeps the action moving and the jokes flying. The comedy itself is not aimless, too. An overarching plot involving the royal election keeps the comedy focused enough to prevent meandering into random territory. For instance, Akane flying around as the “masked” heroine Scarlet Bloom seems random but in fact her stunts are designed to boost her numbers in the polls. The same can be said for their family “beach” outing (there is a lot of masquerading that goes on…) that is secluded due to their royal status. So at the minimum Joukamachi no Dandelion’s micro and macro approach leaves the narrative in a seemingly comfortable position.\\n\\n\r\nThe anime starts to falter when the content of these segmented tales are investigated. Joukamachi no Dandelion has a clear theme on family. Family is supposed to stick together, family implies equal fairness, and so on. But in the show, this does not happen. Understandably Akane garners a lot of the attention – she is the main protagonist – however the rest of the cast is proportionally unequal in terms of screen-time. Hikari the idol arguably has too much time relegated for her, whereas Haruka the probability master, Teru the strength kid, and Shiori the cute-yet-possibly-psychotic object whisperer each receive considerably less time compared to their brothers and sisters.\\n\\n\r\nTo be fair, these characters are not that interesting, but they are as uninteresting as they are because the anime refused to work with them. A paradox. Still, not using the characters, regardless of how interesting they happen to be, is not a smart move for a few reasons. One, they are a part of the main cast, so leaving them on the wayside is counterintuitive to including them in the series in the first place. Two, they add variety to the festivities. Akane is cute when she blushes and Hikari has a nice singing voice, but relying on their same shticks time and again – especially when other siblings are ready and waiting to have a moment in the spotlight – induces avoidable repetition. And three, their inclusion fits this family theme. They are the royal family, not the royal individuals-who-occasionally-do-stuff-together. This is a huge misstep that the anime makes semi-regularly; Shuu, Kanade, and Aoi are other siblings that take up the middle ground, meaning Joukamachi no Dandelion is not always focusing on the cute girl and the singer. But the anime foregoes its own characters enough to become a noticeable negative.\\n\\n\r\nAnother negative is the anime’s attempts at sentimentality. Particular members of the cast have troubling pasts. For example, Kanade ruined Shuu’s soccer career when she caused an accident as a child, Akane had a run-in with a couple of burglars that spawned her anxiety, and so on. Simply having these parts around detracts from the comedy that the anime strives for. That is, Joukamachi no Dandelion tries to add depth to its narrative that ultimately takes away from its more important comedic elements. Even worse is that these dramatic moments are taken care of way too quickly. Akane’s in particular – her complete inability to handle public outings – is a crutch the anime leans on for every episode, yet she is cured in the span of a few minutes (and accidentally at that). Doing this demonstrates how little the anime cares for these segments and consequently how useless they are to the narrative as a whole.\\n\\n\r\nUselessness continues in Joukamachi no Dandelion’s main familial theme. The theme itself is already on thin ice since the disproportioned character focus goes against the sense of fairness family brings. The ice starts to crack further when the anime fails to make its own family feel like a family. Hints of this do exist. Haruka supporting Misaki when she feels sad, Kanade taking care of Shiori while the parents are away, and Akane setting up a surprise birthday party for Aoi are instances of brotherly and sisterly love. But the comedic and sappy moments get in the way of the family moments that expound on this family theme. Like the drama scenarios, these familial scenarios zoom in and then zoom out, pushing away the construction of the relationships and the dynamic of the family to make room for a gluttonous clone or a menacing phone call. In essence, its shallow exploration of its theme served as little more than a hindrance.\\n\\n\r\nAt this point the anime makes it clear that it does not know, exactly, what it wants to be. When the anime is not trying to make the viewer laugh, drama ensues. When the drama dies down, the family idea is brought up again. Then when the family idea has been touched on, comedy appears once more, and the cycle never ends. The show is forever in a loop, tugging itself in multiple directions without ever settling down on one path, causing the anime to feel directionless in its presentation.\\n\\n\r\nNowhere is this directionless behavior more evident than in the conclusion. Joukamachi no Dandelion highlights the need for an ending speech from each character which makes logical sense. There is an election going on so having the cast give their personal take on how the previous year went and what they have learned would (even if heavy-handedly) let the audience understand the meaning behind the whole season. Instead, some calamity occurs, the election – like many parts of the anime – happens in a few seconds despite this conflict being the string that tugged everything along, and their speeches are forgotten. The anime was trying to wrap everything up as best as it could, but the final episode ends up too all-over-the-place, mirroring the narrative’s direction throughout the entire season.\\n\\n\r\nSo while Joukamachi no Dandelion might keep its slice-of-life and overarching plots in tandem, the dance they perform from start to finish is one muddled with missteps and poor choreography.\\n\\n\r\nANIMATION\\n\\n\r\nJoukamachi no Dandelion surprisingly has a lot of opportunities for action sequences. The characters’ powers make this an obvious statement. Akane flying around, Shuu teleporting everywhere, and Teru digging furiously elevate the amount of actual animation the anime employs. The quick nature of the comedy also makes the hasty transitions and character movements a welcome sight. Characters will often exaggerate their actions, such as jumping up-and-down on their bed or the explosion of dust when someone starts running. Hair and eye details are not extreme but they are around to a reasonable extent, making sure the people on screen do not act like lifeless husks. As a whole, the anime does not have an extensive amount of actual animation but what amount the show does provide is nothing to scoff at.\\n\\n\r\nScoffing can be done with the art style, though. For the most part, Joukamachi no Dandelion sticks to a minor set of areas: the school, the Sakurada household, and the idol studio are the most prominent locations. This rapidly induces blandness since the anime does not dabble in quirky camera handling or nuanced lighting. To be more specific, the camera- and light-work is as par for the course as one can get, the byproduct being further accentuation of the bland artistic direction. The show does try to switch up its presentation slightly when its characters adopt reaction faces or the city landscape is replaced with colorful backgrounds, but here the quickness of the comedy works against itself, making these deviations from the norm a rarity. The result is the anime constantly mired in the same, boring art, making the action on-screen an obstacle to sit through rather than another part of the experience.\\n\\n\r\nFor the character designs, they sit somewhere between the actual animation and the art, between being a satisfaction and an obstacle. Besides the avant-garde colorings for some of the characters’ hair – Aoi’s blue, Haruka’s purple, and so on – the designs are decidedly plain. Shuu and Kanade in particular are strangely similar, their black hair and casual clothes coinciding with their dull personas. Symbolism does exist in the colorings – Akane’s tendency for red matches her embarrassed and blushing attitude, Misaki’s use of pink goes with her girly behavior, and so on – though beyond the different hues not many other symbols are found. Nobody has distinct accessories, nobody dons intricate outfits (arguably, Akane’s Scarlet Bloom gothic dress is a contender), and their faces are almost identical to each other (granted, they are siblings). Collectively the cast’s designs are suited for Joukamachi no Dandelion, however they are not as involved as they could have been.\\n\\n\r\nCHARACTERS\\n\\n\r\nAs it was with the story, the characters of Joukamachi no Dandelion leave next to no room for discussion because hardly anything is provided.\\n\\n\r\nThe cast is large, so characters are rarely given adequate time to shine. And as was previously mentioned, when the characters do have that opportunity to develop, the moment either happens too quickly or the moment is too worthless. Either way, that particular person is left stranded on a rough patch of mediocrity writing-wise. At the minimum, each character does have their own set of characterizations that differentiate themselves from each other. Aoi is a natural leader, Shuu is often impractical, Kanade cares immensely for the safety of her family. Akane is incredibly shy, Haruka keeps to himself, Misaki is plainly average. Hikari wants to prove herself, Teru has a huge heart, and Shiori lets her actions talk for her. Standard fare for any cast.\\n\\n\r\nAlongside their base characterizations are the unique abilities that each character holds. Going through the list once more makes this easy to spot. Aoi can force anyone to do her bidding, Shuu can teleport anywhere, Kanade can create anything out of thin air so long as she has the reserves in her bank account. Akane can manipulate gravity, Haruka sees the probabilities for every action, Misaki can split herself up into several people with their own personalities. Hikari can increase or decrease the age of anything, Teru has super-strength, and Shiori can speak with inanimate objects. Again, standard stuff, but these types of features stop the cast from being totally bland.\\n\\n\r\nA discernible oddity can be found when the characters’ base traits are juxtaposed with these special abilities they tout. The characters’ abilities are the opposite of how they normally portray themselves. To put it differently, their powers symbolically reflect their individual strengths. Aoi could forcibly lead if she chose but her affability and kindness inherently cause people to look up to her. Shuu has the most practical power of the group but somehow always comes to the most impractical solutions. Kanade can literally buy anything she could ever want but she knows that “money cannot buy happiness.” For her, that happiness is her family. Akane feels the overbearing pressure of eyes and cameras, and coincidentally her flight capabilities create further embarrassing moments. Haruka can technically make every correct decision for the rest of his life but instead he is content with letting events proceed normally. Misaki’s averageness compared to her clones actually makes her perfect for specific roles. Hikari can cheat aging but never cheats when she has to prove her prowess. Teru’s heart is bigger than the strength he wields. As for Shiori, she might be able to talk with random objects, but “actions speak louder than words”. Thus the characters’ powers are not just for show but rather extensions of themselves, adding complexity where much is needed.\\n\\n\r\nUnfortunately, Joukamachi no Dandelion does little else with its characters. A tiny comedy does not require insanely complex characters but a comedy (and to be honest, any type of anime) does at least need characters who leave a lasting impression. These characters fail to do this. The symbolism of their powers is definitely interesting but that is not enough. Their personalities are lacking, their character growth is stunted, and their interpersonal relationships – caused by the anime’s narrative direction – are shaky at best. In the end, the cast simply does not have enough clout to noticeably influence the audience, immensely reducing the overall execution of the characters.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme is very upbeat, not just in the lyrics but in the tempo of the piece itself. Varying the vocalists also helps to align itself with the familial theme of the show, improving the purpose of the piece. While the track does not try anything new in terms of instruments or sound, the catchiness of the beginning and the final bits make the song not outright forgettable. The ending theme is a bit too similar to its OP counterpart, the middle section a chorus of sound that goes in one ear and out the other. Again the happy beat follows the format of Joukamachi no Dandelion. And instead of changing vocalists the ED makes use of repetition to make the track easy to follow, the trade-off being this sense of looping that reduces the power of the piece. And while the lyrical triplets, loud lead-in, and the clapping each try to bring that power back up, the track is just not strong enough to stand on its own.\\n\\n\r\nOne of the best tracks of the soundtrack is technically not even a complete song. The transitions between the A, B, and C parts – the six note-or-so onomatopoeia – was a charming little effect that segued nicely from one story and into the next. The remainder of the soundtrack is not as notable, the pieces sticking mostly to common, slice-of-life compositions. Once again, due to the elated feeling of the anime, a lot of the tracks are happy or silly in design. But other, more relevant music – such as drum numbers and dainty or ominous piano pieces – help to offset the wacky fun the majority of the OST maintains. In the end, though, the OST is a lackluster offering, one that does not try to be anything more than what it barely has to.\\n\\n\r\nAs for the voice acting, the cast of Joukamachi no Dandelion provide an overall average performance. Kana Hanazawa as Akane uses a cute and flustered voice for the equally cute and equally flustered girl. Aina Suzuki as Shiori does not quite capture a childlike voice, making Shiori sound out of place whenever she said anything. This is one of her first (and biggest) roles in the medium, though, meaning one can expect Ms. Suzuki to hone her craft the more roles she takes on. And Yui Ogura as Hikari uses a nice singing voice during her idol moments while simultaneously using a tone that fits the younger sister well enough. The rest of the cast does not stick out in either a positive or negative light, the net result being the aforementioned average outing.\\n\\n\r\nENJOYMENT\\n\\n\r\nI have some beef with this anime. Petty beef, no doubt, but beef all the same.\\n\\n\r\nThe show had a spectacular opportunity to poll its audience throughout the season in order to determine who would be crowned the king or queen. An interactive experience rather than an arbitrary decision. A way to get the community involved that was not cheap or forced but a clever direction. But no. The show not only chooses the winner but the show also chooses the most boring candidate. Shuu taking the crown is literally how succession has worked for a millennia – the first born son is next in line. The anime was all about these quirky characters, their crazy abilities and personalities instantly recognizable to anyone in the city. How hilarious would the whole ending have been if Shiori won? Or if Haruka, who did nothing the whole time, actually had a secret weapon up his sleeve? Or maybe Akane does win, her easy handling of the position signifying her newfound vigor? Shuu is such an uninteresting choice to make, and coupled with the fact that he is not the smartest fellow on the planet, the decision almost seems illogical. Were the audience given the chance, the eldest brother would not have reigned.\\n\\n\r\nMore beef. I was not sure if I should put this here or in the “Story” section, but why dandelions? The anime is called, in English, Castle Town Dandelion. “Castle” makes sense since there is a castle and the people in the show come from royalty. “Town” likewise makes sense since everything happens within one town. But “dandelion”? There are almost zero references to dandelions throughout the show. Dandelions are not the crest for the family, none of the characters declare their love for dandelions. There is a dandelion shown as the final shot of the anime just to remind everyone that dandelions are somehow related. Disregarding their nonexistence, why dandelions at all? Dandelions are technically a weed, a plant that puts a blemish on gardens. Am I meant to interpret the powers as weeds? The show certainly did not take that direction. In fact, without their abilities, many people (including themselves) would have perished. Are the characters weeds? Again, their presence is not an evil or an unwanted one, so this interpretation fails as well.\\n\\n\r\nMost likely the dandelion is supposed to represent change (evidenced by Akane’s final monologue), as in a flower blooming. But there are better, more distinguished flowers for this purpose, such as roses, tulips, and daises. The dandelion might also have to do with making ones dreams come true. Wishes are often made on fully-bloomed dandelions, the scattering of the seeds symbolizing the multiple chances at future success (the OP uses a lyric similar to this). Contextually, the characters were also hoping for future success in becoming the next successor. This makes the most logical sense, although it is a bit of stretch, and even then there is the counterargument that the show was not about the election (the future) and more about family, love, and determination (the present, the latter of which is the opposite of dreaming).\\n\\n\r\nThe beef goes from petty to filet when the romance portions kick in. They are few and far between but they are quite satisfying to watch unfold. Shuu and Sato’s relationship was cute, the affectionate words and love between them placing a smile on my face with ease. But my favorite story was about the parents in their younger days. Their own romantic beginning and their love of family dynamics was awesome to watch.\\n\\n\r\nThe mother and father were definitely not what the anime was centered on, but thankfully the non-romance sections were a nice bout of fun, too. They were usually silly and adorable, such as when the watermelon sacrificed itself for Shiori or when Akane obliviously walked around the school with no pants on (more specifically, the reaction of the student body and her best friend). These scenes pale in comparison to the romantic ones, but they at least got a chuckle or two out of me while watching. And although the lame dramatic detours and the anime’s irksome choices dampened my experience, I was still entertained nicely enough.\\n\\n\r\nJoukamachi no Dandelion is filled with family, royalty, and comedy. But beyond this thin veil is a smattering of problems – from the weak cast of characters to the unmemorable music selection – that collectively hurt the show. Suffice it to say that watching this one is a Thanksgiving tradition that nobody will be embarking on anytime soon.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, slice-of-life and overarching material work together, but the disproportioned screen-time, the unnecessary sentimental moments, and the unexplored theme on family lead to a directionless presentation\\n\\n\r\nAnimation: Fine, average actual animation, boring art style, okay character designs\\n\\n\r\nCharacters: Bad, nice symbolism for each child of the royal family, but dull personalities, little growth, and shaky relationships do not let the cast leave a lasting impression\\n\\n\r\nSound: Bad, fine OP, bad ED, bad OST, average VA performances\\n\\n\r\nEnjoyment: Fine, peeved by no real-world election, no dandelions, but the romance and comedy still made me giddy\\n\\n\r\nFinal Score: 3/10",
            "date": "2016-01-07T01:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 207948,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=207948"
        },
        {
            "content": "Overall for it's genre, this anime is pretty good! If your into Slice of Life/Comedy animes this one is definitely for you. \r\nThe story is pretty straight forward. To me the story was okay but there wasn't really anything super unique about it. The one thing is that all the siblings have superpowers which isn't super important throughout the show. In my opinion the whole superpower thing was more of a plot device. \r\nI liked the art alot in this series! The backgrounds are nice and the character designs are really nice! I like the color schemes on the siblings especially. There is also anoutfit that Akane, the main character wears a little later on that is super nice! Overall I think this anime is very aesthetically pleasing. \\n\\n\r\nThe sound is good to! Nothing really remarkable about it but it's very good. The background music didn't really stand out much to me, but the quality of everything was good. The voice acting is also good with the exception of one supporting characters voice which I found kind of irritating? Other then that though, good.\\n\\n\r\nThe characters was one of the most enjoyable aspects. I liked all the main characters and enjoyed following all of their stories. I felt that alot of them fell kind of short though because 12 episodes isn't really enough time to fully flesh out nine characters. Only a few of them were really focused on alot and 2 of the supporting characters felt kind of one sided because they were only focused on one thing. One of them I didn't like but for the most part,I  either liked the characters or felt neutral about them. \\n\\n\r\nOverall this is a pretty good show. I'm not a huge fan of shows that primarily focus on slice of life but for it's genre, it did a very good job and it's something I would recommend to slice of life fans since even though it can be sort of average, it has it's unique aspects as well.  \\n\\n",
            "date": "2015-09-17T22:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 198799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4856037.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Bravocube",
                "username": "Bravocube"
            },
            "url": "https://myanimelist.net/reviews.php?id=198799"
        },
        {
            "content": "How can a huge bunch of siblings with super powers competing for the title of king while dealing with disasters somehow manage to leave a weak impression? The truth is out there but still partially eludes me after watching this three times.\r\nThe story, characters and situations are all ready to go nuts and it should be an explosive combination but somehow it still feels much more like a mellow slice of life with odd magic thrown in for little more than comedy. Absolutely not unpleasant for a viewer looking to unwind with light stuff and many characters are easy to develop warm feelings for, butit sort of settles for an experience that is just a bit hollow and in the end feels like trying to sate hunger by eating cotton candy.\\n\\n\r\nAs a bit of a voice acting fan I'd say Akane has the absolutely most fitting voice possible for her character type and that's the full extent of how much sticks after watching the whole season thrice. Rather enjoyable slice of life, a few good laughs, Akane has a perfect voice. That's it.",
            "date": "2017-10-20T06:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 261235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261235"
        },
        {
            "content": "Ah, Joukamachi no Dandelion. I actually wonder how would monarchy be like in Japan, but instead this anime turned out to have an interesting royal family. Produced by Production IMS, which also did ‘Ore, Twintails ni Narimasu.’, it is a slice of life anime that is pretty enjoyable because of these short stories of each sibling trying to do their best.\r\nThe story follows a royal family in Japan, but instead of their fancy castle on the riverside, they live in a typical house that fits everyone in. It was an idea thought out by the father, who is the king of his fine country, andthat way the siblings live on as normal citizens would be. An election to vote for the next king is coming by, and the siblings are trying their best to gain support through their own means. There is also a twist to this family, and it is that the siblings have different super powers. These powers may prove to help the citizens or themselves, and may help in gaining more support.\\n\\n\r\nIt is easy to follow indeed; it is not like there is a complicated political trope that everyone needs to understand, it is just a damn slice of life anime. Most of the episodes have segments that focuses on a sibling either trying to find ways to gain support or letting us know more about him/her. Nothing special or very tragic happened in the anime, but it is worth noting that each story can be pretty engaging for the viewers. There are a lot of comedic value in the anime, especially moments that make everyone laugh. Sometimes, there are moments where the siblings reflect on and striving to do their best. So, I do believe that it is nice watching at how they grow.\\n\\n\r\nI do not really dislike a particular scene in this anime, hence the story is entertaining as a whole. Many claimed that the ending of the anime has to be one of the best in this season, and I may think so too. For a slice of life anime, it closes well and certainly there is nothing left out.\\n\\n\r\nMost of the cast are the members of the Sakurada family, a fine royal family led by the king and father, Shouichirou, the only child of his parents. A total of nine siblings from as young as a cute kindergarten kid to as old as a third-year high schooler. As I mentioned before, they live as normal citizens, hence they are cool hanging around with their friends and other fellow citizens, although some of them show more respect. As how the story goes, the shy cutely-dense Akane seems to be the focus of the whole anime. She hopes to become king just to remove surveillance cameras which she never likes being aimed at. It is quite ironic that she needs more attention from the citizens in order to get more votes, but nevertheless she is really trying hard. Another few siblings are also focused, such as Kanade, Aoi, Shuu, Misaki and Hikari. They have their own reasons of wanting to be king and they went through many ways to gain supporters. I would say that they have their own unique story that are interesting to watch. \\n\\n\r\nNot every character has their deserved character development, and due to the 12-episode length, some of them have their own development which is fine. The characters, although they are nice to watch, do not stand out as very special characters. When you think of it, their personalities are as similar to other anime characters you might have watched. But hey, it is still worth watching them.\\n\\n\r\nThe art is simple and not really unique. Yes, the character designs are cute and nice, but it is still not outstanding. If you watched OreTwi, you should know that the studio both produced these two anime, as well as the same original character designer. You may also know the studio for its infamous ‘quality’ in animation in OreTwi, and this disease may have also been caught on Joukamachi too, sadly. Not that it is concerning, but it can leave a bad mark on the studio. The sceneries looks like your standard slice of life anime, and the facial expressions are good-looking and sometimes goofy-fun.\\n\\n\r\nBoth the opening and ending songs have a certain charm, which is that they are both lovely and exciting. I can’t count how many times I replayed the previews but they are awesome! They do match how it feels like in this anime, and so I do give props to Yui Ogura and Kaori Ishihara, who are also both voice actresses in the anime. The soundtrack does not really stand out at most, but they are comforting as what you hear in other slice of life anime. The voice acting is great, especially for Kana Hanazawa for her work with Akane. A few of them are relatively new to the voice acting scene, such as Aina Suzuki who voices Shiori. Indeed she played the role really well, and I hope to hear more from her in Love Live! Sunshine.\\n\\n\r\nOverall, Joukamachi no Dandelion is an anime which I fell in love watching throughout the series. It is sad that there would not probably be a second season for it, and I do not know if the manga is fully translated, but it was a fun ride. This is one of my most enjoyable anime this season, and so I recommend this anime to everyone for the fun.\\n\\n\r\nHowever, there is one question: how is the mother be able to have these siblings at this kind of span? Insane.",
            "date": "2015-09-20T06:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 199024,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440083.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SkyNoHoshi",
                "username": "SkyNoHoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=199024"
        },
        {
            "content": "The concept of good comedy in anime is something of a rarity.  When a genre becomes so stale that different shows reuse similar gags in order to earn chuckles, the only way to truly shine is to make something different, something that is unique to make the show memorable.  So...what about an entire show wrapped around nine siblings, all of whom are not only royalty, but also have superpowers?  Yeah...that'll work.\r\nStory: Joukamachi, as I will be calling this series focuses on the town called \"Dandelion Town\", a place that while looks like a normal city on the outside, is actually a townruled over by a monarchy.  By proclamation of the king, his nine children will be running for election in order to raise to power as the next king.  (Even though 5 of them are girls.)  Not only that, but each of the nine children have a kind of superpower, each different to the others.  And so here we follow the story of Akane, the 3rd daughter and 4th child to the Sakurada family and her rather rocky road to the election date.\\n\\n\r\nJoukamachi falls towards the 4-koma style of storytelling rather than a normal fluid story where everything goes from one scene to another.  Instead of going from scene to scene, every episode of Joukamachi has two or more minisodes that make up the entire runtime of any given episodes, which alludes to an episodic format, progressing the story into the actual election itself by the end of the entire series.  (Yes, contrary to what one might think with the way the story is structured, this series actually ends with what it intended to do.)  Within each episode contrary to what the synopsis might say, we follow the story of one or more children in the Sakurada family as they live their life as the princesses and princes of the nation.  (It is still a slice of life after all.)  \\n\\n\r\nFocusing solely on the children's lives in the anime, the show puts heavy emphasis on the characters and traits of each child in the family.  The issue with this is the fact that not every child is treated the same.  Since there are nine children in the family, the show simply didn't have enough screentime and chose to put several members of the family into the supporting category while spending more time on others (particularly the older ones) and developing them a little more through the use of backstories and just general progression through episode to episode.  While the show does have character development, it's not balanced in the sense that everyone gets treated the same way, which is a bit of a shame since Joukamachi completely devotes itself to focusing on these nine siblings.  \\n\\n\r\nAnother issue comes with the mood of the show.  Since it focuses also on developing the characters of the nine siblings, Joukamachi sometimes goes into a more \"serious\" tone rather than its generally carefree attitude.  The issue with this is the fact that it clashes with the show to some extent and while does provide some enjoyable parts as we get to know the characters in the show, it butts heads with what we would normally expect from a comedy slice of life and creates some awkward shifts in tone.\\n\\n\r\nAs for the comedy of Joukamachi, the show mostly focuses on the more focused character of the series, Akane, and her inability to receive attention on account of the fact that she has terrible fright when encountered with anyone's gaze.  While the show does focus on other antics that the other children have, Akane is usually gives the brunt of the show's comedy.  The issue I have is the fact that Joukamachi is very repetitive.  There honestly isn't much variation in the stuff that they do for comedy in that show.  Is it enjoyable?  Well, that depends on what your definition of enjoyable is, but at the very least, Joukamachi is a show that can and will utilize the same jokes more than once. \\n\\n\r\nAll in all, Joukamachi is a show that I does decent with what it tries to achieve.  With several aspects of the show being unique in a comedy slice of life (such as the big family and several other things) as well as some pleasant character development despite its sudden tone shifts, Joukmachi also gave us an actual end to the show by finishing the plot that it established at the start of the series, which is honestly rare for a show that uses minisodes as its presentation.  It still does suffer some issues from its overuse of gags and lack of proper attention to all members of the main cast.\\n\\n\r\nOverview:\\n\r\n+ Unique story idea\\n\r\n+ Character development\\n\r\n-  Comedy troupe overuse (with little to no variation half the time)\\n\r\n-  Imbalance for who got development \\n\\n\r\nCharacters: As mentioned before, Joukamachi focuses solely on the nine siblings and their antics for trying to get themselves elected, and in some cases, not elected for the title of ruler for their kingdom.  Since there are nine main characters, I'll just overview them from oldest to youngest.\\n\\n\r\n1.  Aoi        Power = Invisible Work:  Ability to memorize everything the moment she sees it.\\n\r\n2.  Shuu     Power = Transporter: Ability to transport to wherever he wants to \\n\r\n3.  Kanade  Power = Heaven's Gate: Ability to make whatever she wants while deducting money from her savings account\\n\r\n4.  Akane   Power = Gravity Core: Ability to control the gravity of any person or object\\n\r\n5.  Misaki   Power = All for one: Ability to make up to seven clones of herself\\n\r\n6.  Haruka   Power = Lots of Next: Ability to predict the outcome of anything in percentages\\n\r\n7.  Hikari     Power = God Hand: Ability to make change the growth state of any living being\\n\r\n8.  Teru      Power= Limit Over: Ability to increase his body's strength drastically\\n\r\n9.  Shiori     Power = Soulmate: Ability to telepathically communicate to any inanimate object\\n\\n\r\nWith their Chuunibyou named powers, the nine siblings are the heart of the series.  With each of their unique powers, each of them get into various situations (usually Akane), which creates the brunt of the entertainment value for this series.  As mentioned before, only the older siblings (and Hikari) really get any semblance of development for this series and as a result, several of them are left in the dust simply because they are either put into the supporting role like Haruka, or are only there sparingly like Shiori.  They don't juggle the nine sibling gimmick well which does hurt the show as a whole.  \\n\\n\r\nAside from the siblings, the rest of the cast is comprised of their parents, as well as various other people from around the city, the side characters primarily being people that the family interacts with on a daily basis, such as the siblings' friends, attendants from the royal guard, and the cat, who only shows up for like, two episodes disappointingly.  The side characters are for the most part plot devices and only serve to move the story along as a whole.  They don't play much of a role beyond that as they really only support the respective Sakurada sibling that they interact with.  \\n\\n\r\nOverview:\\n\r\n+ The siblings themselves (because the concept and execution of them was good, I admit)\\n\r\n-  Some of the siblings were simply shoved to the side\\n\r\n-  Side characters serve as nothing more than plot devices in order to move the plot along\\n\\n\r\nArt: Joukamachi's artstyle is very standard for the level of animation one can expect from today's seasonal anime.  Every character is drawn with a moe style of design and the show itself doesn't really look much different than what you would generally expect.  As a comedy anime, it also uses exaggerated expressions and occasional face changes in order to showcase a comedic version as to what the character is feeling at the moment.  Honestly though, there's nothing particularly remarkable about it, so there's nothing really much to say for the art style as a whole.\\n\\n\r\nHowever, there are a couple specific things about the look that does raise a couple questions.  One of the more prominent things are the cameras in the series.  In order to add to Akane's shyness from attention, the entire realm of Dandelion Town is riddled with security cameras that she tries to hide away from.  The thing is, these cameras are CGI pieces and are so glaring to look at that they do not fit into the series at all.  They look awkward and are just honestly cringeworthy.  Another thing to note is the fact that several backgrounds in the show lack some detail when they're being introduced.  These still images of background shots honestly look lackluster and are severely lacking in quality, which is both easy to spot and cringeworthy to watch.\\n\\n\r\nOverview:\\n\r\n+/- Standard moe artstyle (dependent on your feelings towards moe)\\n\r\n-  Some details were glaringly obviously lazily made\\n\\n\r\nSound:  For the soundtrack of Joukamachi, the series hosts a pair of OP and ED tracks that honestly, sound the same.  They're both these very bubbly and bright songs that utilize guitars and other upbeat melodies and basically sound the same.  They're pretty generic and there's really nothing particularly noteworthy about them since they don't have that specific memorable part or anything of that sort to make them a memorable track.  \\n\\n\r\nOverview:\\n\r\n+/-  Average soundtrack\\n\\n\r\nPersonal Enjoyment: Joukamachi is a show that despite its flaws was still fairly fun to watch.  There were parts of it that actually set it apart form some other comedy Slice of Life anime, which made the show a little more unique as a whole.  \\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nYes, I did.  While I do complain about a couple things, Joukamachi was overall still pretty fun to watch.  Enjoying the interactions between the nine siblings was something that I got a pretty good laugh out of and in the end, it was entertaining to watch.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nMore than anything, the tone shift from happy to serious or vice versa did leave  a little bit to be desired.  Since the show had several backstories as to why some characters are the way they are presented in the series, the show shifted its generally carefree attitude in exchange for a slightly depressing one to explain the \"tragedy\" which angers me a bit because it does a complete tone shift and doesn't feel like the show it's supposed to be until it switches back.\\n\\n\r\nWould I recommend this anime?  \\n\\n\r\nIf you're like me and you want to watch a half-decent comedy anime, Joukamachi is worth giving a shot.  While it's not the most original seeing how its comedy focuses mostly on the flustering of the shy girl, there are some aspects to it that make it a little bit more interesting to watch than one may think.  But then again, comedy is subjective, so take that with a grain of salt when deciding.",
            "date": "2015-09-19T01:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 198869,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=198869"
        },
        {
            "content": "It's so sad anime series always have an end...\r\nAnyways back to the review!\r\nShort Summary:\r\nThe Sakuraba family which is an \"ordinary\" family of 11 people, however they are the royal family. Each of the children have a special power that is proof of having the royal blood. Sakuraba Soichiro, the king and their father decides to hold an election to see who takes his place as the king. These elections are to be held when the oldest child Aoi graduates high school. \r\nWho will be the next king?\r\nSo first off WHAT A PLOT!\r\nTo think that someone could even THINK of a plot like this!\r\nEven the partwhere each of the children have their own unique powers makes it even MORE interesting!\\n\r\nHonestly I had so much fun watching this anime.\\n\\n\r\nAs you can see from the plot the children will each be aiming to gain plenty of votes to increase their chances of winning but it doesn't really stop their!\\n\r\nThey each have their own reasons for aiming to be king which are very unique as well.\\n\\n\r\nWhat I can say is that this anime series is unique in its own way. Even the jokes in the anime is classical yet unique! I really enjoyed the humor in this anime, no doubt about that!\\n\\n\r\nAlthough it may seem a little childish to some people due to the super powers and setting of the story \\n\r\nBUT\\n\r\nI can say that I fully enjoyed this anime!\\n\r\nAnd best of all the anime ended with a satisfying ending!!\\n\r\nHooray!!",
            "date": "2015-09-22T03:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 199201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=199201"
        },
        {
            "content": "An anime that has a really deep family relationship. Honestly , i never seen anime like this before. A story about 9 king's daughter/son and there was something special about them all. They all have a some mysterious power inclueding the king too.\r\nWell , from the story, this is comedy and drama type of anime so obviously there is no big twist. I like the plot. All the king's child was trying very hard to be a king. they all have their own objective to be a king even the younger one too. and from them all , there was one girl that didn't wantto be a king because it's to embarrassing just for people to see her. \\n\r\nThe story was simple but it was funny, and it's not about her too. the story is telling us about the others relationship too, Well there was a little bit romance too , though. Overall from the story , it was normal for me but the comedy really funny , So 7/10.\\n\\n\r\nThe art , the animation was standard for me. nothing special about the animation but it's a different matter for the character design. I really like the character design especially Kanade.\\n\r\nThere were a little bit of action , but not too hardcore so it was a little bit disappointing for me. They only show the hardcore one at the final episode and it was only for a while too. 8/10\\n\\n\r\nThe sound really fit perceft to the show. the OP and The ED really good , there were nothing wrong about the Soundtrack too , So Overall 7/10\\n\\n\r\nNow finally the character. I really like the character especially Akane , Aoi and Kanade. \\n\r\nAkane was a shy person. for some issue when she was still a kid, she can't stand for people seeing her again even she can't stand being seen by security camera. because of that she must got to school without getting cought by the security camera. If there's people walk pass by her, she will always hiding behind her sister and i found that very cute. If she's not with her sister, she will never go out from house. but aferwards she was trying very hard to overcome her weakness. \\n\\n\r\nThe first and the eldest child , Aoi , was very calm and cool , and kind too. She is too kind. For some mysterious reason , she got another new ability. That ability can make people do whatever she say. But even still , she will never use it to her friend , family or other people. I like her for doing that. Her kindness really warm. 7/10\\n\\n\r\nKanade, The third child or the second oldest daughter. i don't know people have the same thought as me or not, from my opinion , Kanade really likes teasing people, But the truth she was very kind person inside. She always cares for her brother and sister and always treasure it. This type of character was what i most like. \\n\r\nSo if i choose from Akane , Aoi and Kanade, I choose Kanade. \\n\r\nFor the rest of the character, The rest 6 sakurada child have their own personality and it was a unique ones. they all get a chance to tell their own story in the episode and i like that. 9/10 \\n\\n\r\nSo well , overall i really enjoy the episode. The comedy always following up to the story. So , yeah... , i like it. 8/10\\n\r\nOverall 9/10\\n\\n\r\nI really recommend this anime to you all , if you like slice of life anime.\\n\r\nSorry if my english isn't very good.\\n\r\nHope the review can be helpfull to you all :D \\n\\n",
            "date": "2015-09-21T04:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 199131,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4481249.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/YizelTro",
                "username": "YizelTro"
            },
            "url": "https://myanimelist.net/reviews.php?id=199131"
        },
        {
            "content": "Joukamachi no Dandelion is a series of short stories weaved together to tell the story of a royal family with super powers who are competing in an election to be the new king of their country. Joukamachi no Dnadelion reveals each character's motivations and backstory in a short story, episodic manner. \r\nThe story of JnD is fair, it's style of storytelling is an innovation to the standard metric but it has its pitfalls. Due to its style of focusing in on a few characters each episode, the story is largely strong or weak based on the characters. The actual lack of plot is probably thebiggest problem, with most of the important \"stuff\" that happens in the story being the result of flashbacks and not actions taken by the character in the present. This is not a damning problem though, because its short story format allows for this style of story telling. The ending is much much stronger than the first half and it's really enjoyable for that reason. The pacing is alright, and character development is something that is actually noticeable episode by episode.\\n\\n\r\nI love the art is JnD. Each character feels distinctive due to their attention to detail and unique appearances. The small details bring an already appealing style up to a great standard. The sound is very good, with Kana Hanazawa doing a fantastic job.\\n\\n\r\nOverall, this is a pretty enjoyable ride. It's not thrilling, deep, or dark edgy nine me. It's simple, silly, and it will make you feel content with its above average qualities. If you like short stories, you'll love this!\\n\\n\r\nStory (6), Art (9), Sound (8), Character (8), Enjoyment (7) Overall (8)",
            "date": "2015-10-22T10:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 201753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3171461.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tevron",
                "username": "Tevron"
            },
            "url": "https://myanimelist.net/reviews.php?id=201753"
        },
        {
            "content": "There are some anime you just can't help but feel happy while watching.  Joukamachi no Dandelion, or Castle Town Dandelion, is one of those anime.  Firstly I would like to share my one and only real complaint.  The description of this anime made me believe that a big part of the story would focus solely around Akane, and while it does to an extent I personally just felt it wasn't enough to justify her specific character being used in the anime's description.  Now, I will write a review based on each of the six categories in the rating system: story, art,sound, character, enjoyment, and overall.  \\n\\n\r\n1) Story\\n\r\nThe basic background of the story really isn't all that new.  There have been stories over \"the battle for the throne\" for forever, however Joukamachi no Dandelion revisits this idea with a fresh twist.  The concept of having a democratic election in a monarchy is utterly unique and was really the biggest draw for me.  And even though the anime mainly revolves around the campaign, the story itself is still more an inside look at a family who just happen to be royalty and a year in their lives leading up to an all-important election to decide who will be the next king.  \\n\\n\r\n2) Art\\n\r\nI love the art all-around.  The style is nice and clean, the animated effects were done very well, and the background was vibrant but not distracting.  Absolutely perfect.  \\n\\n\r\n3) Sound\\n\r\nTypical sounds such as special effects, voice acting, ect. were very good, but that's not what I want to focus on!  I'm the type who will typically watch the OP and ED of an anime once or twice so that I know it, but then I want to just skip it and get to the actual anime.  Joukamachi no Dandelion is an exception.  I absolutely had to listen to them, there were no if's, and's, or but's about it!  Even while writing this review, Ring Ring Rainbow!! is still playing in the back of my mind~!\\n\\n\r\n4) Characters\\n\r\nI adored the cast of characters in Joukamachi no Dandelion.  Since the siblings were the focal point for the series, of course, we saw a lot of them.  However, how do you properly showcase nine characters in a 12-episode-long anime?  Not only that but how do you manage to give them any depth of character?  Well, I have no idea how they did it, but the makers of Joukamachi no Dandelion managed it.  I personally would have liked to see more of the two youngest siblings, but thinking about it logically I know it would have been a time waster to put more airtime on two characters that were obviously not seriously in the running for the crown.  Now in saying that, I believe that they both do get sufficient time to showcase their personalities and play their own role in the big picture.  Speaking of personalities, there are a lot!  Each sibling has their own story and character to round out, and somehow in 12 episodes we get to see it all.  Not only do we get to personally know the siblings and get a sneak-peek into their private lives, but the makers of Joukamachi no Dandelion somehow also found a way to add in some insight into the parents as well!  \\n\\n\r\nTo finish off I'm going to bundle Enjoyment and Overall together since in my mind they're kind of one in the same.  There wasn't a dull moment in this entire anime.  I loved every second of it.  I was able to get so immersed in the story and get to know the cast of characters so well.  This could have easily been drawn out into a more lengthy series, but it wasn't.  And it's one of the rare times where I feel like the length of the anime was just right.  I leave feeling happy and fulfilled.  And I hope that anyone who chooses to watch Joukamachi no Dandelion leaves feeling the same.",
            "date": "2016-08-06T23:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 226115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1428667.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kina-chan",
                "username": "Kina-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=226115"
        },
        {
            "content": "Story: 7/10\r\nIt is a slice of life/comedy anime, and even if I enjoy watching this kind of anime I’m REALLY picky in it. Let me tell you this one is of the few ones I really enjoyed and kept me waiting for the next episode, it wasn’t because of the art or the depth of the characters but because it was actually funny and made me laugh my lungs out. The story is linear and there’s no way to lose yourself in complex plot or anything, just follow the daily life of nine siblings that happen to be part of royalty. The story mainly followsall the events that happen before the election for the new king, which all the siblings partake. Some episodes really don’t bring anything new to the main plot but they are amusing to watch, though I hated the ending not because of who was chosen but it was all too quick to even take it seriously.\\n\\n\r\nArt: 6/10 \\n\r\nThe art is that of a classic shoujo, which is not bad but I think I have seen a lot of this style lately. It is nothing that stands out from the crowd and makes it look kind of bland, but the art style fit perfectly tah type of story it’s telling. And one last thing that bothered me from the beginning… Why don’t they at least look a bit alike though they are all from the same father and mother? Anime logic in its truest expression right here. \\n\\n\r\nSound: 7/10\\n\r\nThe voices were okay, then again nothing that stands out. The opening and ending were really nice, I already have the OST and I love it, represents what the anime wants to transmit. A heart-warming and cute aura all around. I highly recommend the two songs. \\n\\n\r\nCharacters: 7/10\\n\r\nIn the anime they tried to expose every sibling’s personalities, which resulted in all the episodes viewpoint’s changing and made it more dynamic than remaining on a single character. Some characters were more developed than others, but the depth that some characters reflected was amazing. My favorite character will always be Aoi-neesama, why didn’t anyone made a fan club for her?\\n\\n\r\nEnjoyment: 7/10 \\n\r\nThe story although it was different from any other it still lacked something, and I will never forget how they threw the ending as if they just got too tired to even care anymore. The growth of the characters was the only thing interesting to watch at the end, which made the series amusing to watch. I would recommend the anime only if you have nothing else to watch and want to laugh for a while. \\n",
            "date": "2015-09-29T22:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 200125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1280209.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Queen-Usagi",
                "username": "Queen-Usagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=200125"
        },
        {
            "content": "The royal Sakurada family houses eleven members--the king, the queen, and their nine children with different colored hair: Aoi, Shuu, Kanade, Akane, Haruka, Misaki, Hikari, Teru, and Shiori. All nine of the children have unique superpowers. The king decides he wants to decide on his successor, so he designs a popularity test that normal citizens can participate in. The entire kingdom is filmed by hundreds of security cameras, so the citizens can observe the nine siblings and vote for their choice for the next king.\r\nJoukamachi no Dandelion is a mildly entertaining comedy/slice of life show that was kind of doomed from the start because ofits premise. Despite having its funny moments and its \"I'm dying laughing\" moments, it has some plot holes that fail to be addressed throughout the entire series. Why does the king want to choose an heir now? Is he ailing? If there's no rush, why would he hold an election now when more than half of his children haven't even entered high school yet? How are the two youngest children, who aren't even in first grade yet, supposed to have a fair shot? We never get the answers to these questions, and they make the entire show seem kind of....pointless.\\n\\n\r\nThe other reason I say that Dandelion was doomed from the start is because of its ridiculous wealth of main characters. There are NINE. We sort of regard Akane as the \"main\" main character, since she narrates the beginning of the series, but the series is given the hard task of equally representing nine siblings in just 12 episodes. Does it do a good job? Not really. The ending is an asspull, and the election result comes out of left field. It kind of undermines what happened in the previous 11 episodes, which is a disappointment to say the least.\\n\\n\r\nWhile there are some really great comedy gold moments in Dandelion (usually involving Akane and/or her fan club), there are just as many monotonous scenes. (Looking at you, Hikari.) And because there's such an iffy plot, a lot of airtime is spent selling and trying to develop the individual siblings. Like I said, nine main characters is a bit much for any show, even more so a one-cour show. It doesn't help that most of the siblings' motivations are stupid and undeserving of a crown.\\n\\n\r\nThat isn't to say that anime with lots of characters can't be successful. A perfect example is Shirobako, the infamous \"animeception\" series that featured over 50 characters, so many that I don't even remember most of their names. And another example is any sports anime, basically. Despite having so many characters and needing to cover so many backstories, these anime do well. Why? Perhaps it's because the plot is so more compelling. And as I already mentioned, Dandelion's plot has some significant holes from the start.\\n\\n\r\nDandelion's art is pretty good, albeit generic. It can be hard to tell the characters apart sometimes (especially Karen and Kanade, or Shu and Fukushina). The OST didn't particularly stand out to me, but it was light-hearted and complemented the overall mood of the anime. And the animation was nice and fluid, with no hiccups. (Mikagura Gakuen Kumikyoku comes to mind.) And the voice acting was ON POINT; I was especially thrilled to hear HanaKana's kawaii-as-fuck voice again!\\n\\n\r\nThis may sound hypocritical now, but Joukamachi no Dandelion was my 2nd favorite anime of the season. It was enjoyable and comedic at times, despite the plot holes I mentioned above. It was a fun watch, even though overall it wasn't one of the better comedy/slice of life shows I've seen. I think it would have done much better with half as many characters. But I'd still watch it again.\\n\\n\r\nOverall score: 6/10 \\n\r\nDo I recommend it? Yes.",
            "date": "2015-09-21T18:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 199178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2969759.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/psychoalchemist",
                "username": "psychoalchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=199178"
        },
        {
            "content": "[This review contains minor spoilers.]\r\nI am glad that I watched this.\r\nI would probably recommend this to others.\r\nI have watched this once, subtitled. I have only watched the anime.\r\nI probably won't watch this again.\r\n---- Positives ----\r\nThe series covers most of the characters well enough, and gives a higher amount of focus to Akane.\r\nThis series has nine siblings to focus on, which is understandably difficult. Akane gets more focus than the other characters, which makes the series easier to follow. All of the siblings get decent coverage. However, coverage is partially a negative, covered in the Negatives section below.\r\nThe characters are upbeat.\r\nEven though the main focus ofthis series is on the upcoming royal election, the characters gather support solely through positive efforts. They don't pull each other down.\\n\\n\r\nSpecial powers are lightly explained as they're used.\\n\r\nThis series doesn't go into too much detail on the special powers of the royal siblings. Instead, they use their powers to varying degrees without limitations being the focus [a few events actually do focus on limitations, though]. This is listed as a positive because the series worked well without limitations being the focus.\\n\\n\r\nIt actually ends.\\n\r\nThe final episode actually wraps the series up.\\n\\n\r\nA good romantic couple.\\n\r\nThis series has a confession and a positive reply, and the relationship makes sense and works throughout the series. It also gets a fair bit of indirect focus.\\n\\n\r\nAkane's voice.\\n\r\nAkane is voiced particularly well for her role.\\n\\n\r\n---- Negatives ----\\n\\n\r\nThe ending wasn't bad, but it wasn't good either.\\n\r\nSomeone actually does win the royal election, but the way that they win it, and who the winner is could have been done better. There are a few hints about the chosen ending, but it still feels like the writers chose the winner without giving enough characterization to any of the royal siblings.\\n\r\nOpportunity for cancel: Maybe. The actual focus of the series seemed to be about the royal siblings growing as people, with the election just being a reason for doing it. After the election winner is announced, everyone seems to go along with result without any objections, and things conclude on a high note.\\n\\n\r\nThere are a lot of main characters, so some don't get much coverage.\\n\r\nIt felt like Akane, Kanade, Shuu, and Hikari got the most focus. Teru, Shiori, Misaki, Haruka, and Aoi seemed to get less focus. This estimate isn't by time, but by direct focus and prominence throughout the series, by the impression that I got after my first watch. [note : Aoi got a high amount of time spent on her, but those sections were comparatively tame]\\n\r\nOpportunity for cancel: Yes. Giving more focus to certain characters when dealing with a large cast is a good strategy. If characters get too even of a focus, there's a risk of the series being difficult to casually follow. All characters got a good base level of focus, just some acceptably more than others.",
            "date": "2017-03-06T22:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 242034,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5753100.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sorata861",
                "username": "sorata861"
            },
            "url": "https://myanimelist.net/reviews.php?id=242034"
        },
        {
            "content": "This show is stupid. That needs to be said. The premise is ridiculous, the story stretches itself too far, and it's not exactly inspired in terms of jokes or visual design.\r\nHowever, it must also be said, you need to watch at least the first two episodes. The exponential quality jump from Episode 1 to Episode 2 is what made me reconsider this show as a lackluster guilty pleasure for the absurdity to a genuine story that I would want to follow. It establishes a through-line that carries the entire series, and things get much better from the initial impressions.\r\nThis show has some solid emotional highpoints and an interesting examination of several members of the family, though not quite all of them. Initially you think this is a show about Akane and her panties, but it really takes the time to develop the character's perspectives over the course of the show. The wacky powers are used a bit too much as plot progression, but they do add a fun flair to the siblings' interactions.\\n\\n\r\nWhat really lets this show down is the dialogue. This is extremely exacerbated in the first episode, where I felt like I was being beat over the head with repeated explanations. Again, this does get better, but I think the acting through situations and animation is better than the script, though the voice cast isn't bad. The dialogue was just so persistently uninspired that it really made me grit my teeth when there was a great scene with no back supporting it.\\n\\n\r\nI was really surprised how much I was invested by the end of this show. It's dumb fun with some good laughs once it gets rolling. Don't expect them to do something amazing with the premise, but the characters really pulled this show through. They are memorable and quirky in all the right ways to make for an interesting goal-oriented comedy.",
            "date": "2016-05-04T11:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 217866,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4627708.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AguyinaRPG",
                "username": "AguyinaRPG"
            },
            "url": "https://myanimelist.net/reviews.php?id=217866"
        }
    ]
]