[
    [
        {
            "content": "This sequel has blown me away...\r\nAnd not in the good way, either. \r\nYes, it is true. The first season of Seikon No Qwaser started out great and ended with a decent cliffhanger. However, the continuation of the series (Seikon No Qwaser II) follows Sasha and Hana as they search for the Magdalena of Thunder, supposedly inactive and hiding within a girl at the Roman Curia Surei Academy. Sounds interesting, right? In the first six episodes, Sasha is dressed as a woman in an all girls school where the technology to expand and focus your mind has been used as a way to bait girls ofvarious backgrounds to attend the Academy. Members of the Adepts start to show up to complicate matters and things begin to get heated as the presence of the Magdalena of Thunder is revealed to be inside the Academy, hidden deep beneath the flesh of a young woman. The idea is promising... \\n\\n\r\n...Until the episodes following the sixth just begin to drag. Disappointing, really. This is where the show really began to nose dive into a downward spiral - and frankly, suicide!\\n\\n\r\nMost of the episodes were fillers with no real  intention to further the plot of the story. Every now and again, a character would slightly develop or would come to a sudden realization surrounded by a clusterfuck of fan-service. A COLOSSAL AMOUNT OF FAN-SERVICE.\\n\r\nBOOBIES... EVERYWHERE. \\n\\n\r\nYou want cleavage? YOU'VE GOT IT!\\n\r\n You want boobies that jiggle for no reason? YOU'VE GOT IT! \\n\r\nYou want breasts of every shape and size? YOU'VE GOT IT. \\n\\n\r\nUnfortunately, the clusterfuck of fan-service actually killed the plot of the show. It felt as though in every episode, the mangaka left a pair of boobs lying around purely for the sake of his viewers to sit around and gawk at them. A little fan-service is good, yes, but it became more of a hassle to finish the series as the show very slowly progressed. \\n\\n\r\nThe last episode was engaging and yet, it felt somewhat rushed. Most of the action and deepening of the plot took place within the last 24 minutes of the series, leaving yet another cliffhanger at the end. \\n\\n\r\nART :: The art of the show was the same as the previous season's. A few times, the author had failed to correlate speech with lip movement in minor scenes or forgot to draw a movement to a sound, but nothing too serious. The detail of the characters and their wardrobe has improved since the last season, but the background is still rather average. \\n\\n\r\nSOUND :: I highly enjoyed the opening and ending themes. Upbeat, funky, and melancholy, the song \"Rasen, Arui wa Seinaru Yokubou\" by Faylan was well done, but definitely does NOT compare to the first season’s “Baptize” OP. On the contrary, \"Metaphor\" by Shoujo Byou, the ending theme, is my favorite from the Seikon series by far. If anything, the ending OP adds to what the anime is trying to define as the atmosphere of the show. \\n\\n\r\nCHARACTER :: Not much development, if very minimal. Aside from the goofy and unnecessary fan-service of the show, there were hardly any slots open for serious character interaction. What has developed between the main characters in the first series stays relatively stagnant throughout the production. New characters emerge from the foreground, but are eventually shouldered to the side after the recovery of the Magdalena of Thunder; this, despite the maturation of the characters. Only one character from Surei Academy appears throughout the remainder of the episodes, but her appearances are primarily reserved for Ekaterina. \\n\\n\r\nOVERALL ENJOYMENT: \\n\r\nNot much. I rated this a 6 [enjoyment & overall] because the story lacked any real meat, there was hardly any action or development of the plot, the characters were static, and almost everything was sugar-coated with filler episodes. Seikon No Qwaser II ended up becoming a giant boob-sucking travesty, rather than a form of entertainment.",
            "date": "2012-03-07T11:25:00+00:00",
            "helpful_count": 60,
            "mal_id": 55511,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257517.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KnightsGuardian",
                "username": "KnightsGuardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=55511"
        },
        {
            "content": "To put it simply I was disappointed with this second series, it shouldn't have even been made.\r\nSTORY:\r\nIn the first season there was your usual beginning, middle and end. There were interesting relationships between the characters and some character development. I thoroughly enjoyed it and if you did as well then don't bother with the second season. The second season started out with some semblance of a plot, a goal if you will. However this was all over by the fifth or sixth episode and to be honest it wasn't even very satisfying. From then on it is pretty much half a series of random ministories that don't really entertain. There is also a whole lot more ecchi this time around, which is fine for some, however it looks as though  they exchanged any pretense of a storyline for more fanservice. There's an extremely weird ending too.\\n\\n\r\nCHARACTER:\\n\r\nAll character development ended with the first season. That's really the only way you can put it. If you were looking for a continuance of some of the romances and rivalries don't bother, they pretty much continue on as they were when the first season left off. \\n\\n\r\nOVERALL:\\n\r\nThis did not leave me hanging out for more. If there is a third season I doubt I'll bother watching it. Usually I try to find some good points in an any but there just weren't any for me this time around. There may have been a few moments that I laughed throughout the series however this was more because of the ridiculous non-existant plot rather than anything intentional. When is comes down to it, how can you rate an anime in which nothing at all happened?",
            "date": "2011-07-18T20:04:00+00:00",
            "helpful_count": 41,
            "mal_id": 39473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218928.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stachipopp",
                "username": "Stachipopp"
            },
            "url": "https://myanimelist.net/reviews.php?id=39473"
        },
        {
            "content": "** THIS IS A NEW SERIES SO THERE ARE ONLY A FEW EPISODES OUT. 3 ARE RELEASED AT THE TIME OF THIS REVIEW **\r\nSo I'm assuming you know what Seikon No Qwaser is all about if you're interested in Season 2, but if you aren't then I'll give you a brief intro (this might have some manga stuff thrown in since I read/watched both).\r\nBasically the male protagonist Sasha came to Japan under the orders of a group called \"Athos\" to prevent the opposing side, the \"Adepts\" from obtaining some amazing power in Season 1. The Adepts are made up of Qwasers (people who have abilitiesrelated to the elements of the periodic table. For instance: Sasha (Alexander) is the Iron Qwaser, so he can manipulate Iron). \\n\\n\r\nHERE IS THE REVIEW NOW :)\\n\\n\r\n* STORY * \\n\\n\r\n~ Much like every other second season opening you are thrown into a fresh new atmosphere and slowly things are explained to you about what happened between the final episode of the previous season and this current episode. So far the story seems to be progressing slowly but surely, however around episode 3 is when I began to feel some sort of \"excitement\" flowing through me. I won't spoil it but it's the first time that you see an old friend make an appearance other then Hana, who is introduced in episode 1, so that's not much of a spoiler anyways.\\n\\n\r\n* ART *\\n\\n\r\n~ I don't think the artwork has changed much, or maybe since it's 2011 more sites have the \"high quality\" releases then the previous season. Seikon No Qwaser Season 2 is a tradeoff in terms of looks. If you prefer for it to look really nice then say goodbye to the \"Ecchi scenes\". Much like the first season, the higher quality releases cover up the \"good parts\" with a yellow glare -___- \\n\\n\r\nYeah I know, it bothers me too. But if you're impatient like me, you will attempt to find the uncensored version but only find the first season episodes. So just deal with it for now lol.\\n\\n\r\n* Sound *\\n\\n\r\n~ I always felt like the OP for Seikon No Qwaser was more exciting then the ending which I feel is true for the second season. The ending for both the first season and the second season scare the sh*t out of me. It's just so hardcore and deathly ( or at least the second season is, I usually just go to the next episode before I hear enough of the endings :P )\\n\\n\r\n* Character *\\n\\n\r\n~ Can't really say much yet since only 3 episodes are out but Sasha has retained his \"openness\" rather then reverting back to his cold demeanor thanks to Mafuyu (gotta love her), although Mafuyu hasn't been shown yet since her and Katja have apparently gone to train elsewhere in order to get stronger. \\n\\n\r\nThe new characters introduced however are something new and exciting. Some more backstory is shown and a few new faces appear, and also some old ones. Mostly adept members so far.\\n\\n\r\n* Enjoyment *\\n\\n\r\nBy the time I started watching Season 2 there was already 2 episodes out so I didn't have to wait too long to wonder what was going to happen next. The 3rd episode really got me feeling \"excited\" again since the first 2 were a bit bland. This is of course due to a guest appearance by a familiar person from Season 1.\\n\\n\\n\r\n**** OVERALL *****\\n\\n\r\nI feel like if you enjoyed Season 1 you will definitely enjoy Season 2. It has the breast sucking, and the fight scenes and a little bit more. Although I haven't seen Mafuyu and the gang yet, I personally loved Mafuyu :3 (she was such a sweetheart), the new characters sort of make up for it.\\n\\n\r\nAt least Hana is there to keep things lively since she's Katjas slave no matter what haha.\\n\\n\\n\\n\\n\\n\r\n~ I'll probably change this as the episodes go on.\\n",
            "date": "2011-04-28T16:39:00+00:00",
            "helpful_count": 33,
            "mal_id": 36548,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=36548"
        },
        {
            "content": "Here goes: \r\nI've watched the first season straight through in one sitting, it was pretty good if you are into that sort-of thing. (Which I am, 10/10!) I was happy to see that this anime got a second season too! It was just more enjoyment to be had. God have mercy on my poor soul. I watched the first two episodes of the new season, without ruining TOO much of the plot here's what I've got for you:\r\nSasha is now pretending to be a girl (poorly) and sucking everyone's breasts which they seem to be fine with. Hana is now Sasha's maria, which is ahorrible match-up. If Hana was willing to go into this organization to be with Katja, why wouldn't Mafuyu? Why wouldn't they send Katja to this mission instead of Sasha? She IS a girl, and she has that *cuteness* to get all the girls to like her, as proven in season one.\\n\\n\r\nStory: 1 (0 if I could) -  the very plot is flawed, the execution is pathetic, it's even more ridiculous than most of the nonsensical parts of season 1.\\n\\n\r\nArt: 5 - People say this is higher quality, they call it higher quality, It looks MUCH worse than the way Season 1 was done. I guess I'm just a sucker for the old way.\\n\\n\r\nSound: 8 -  Not too many subbed anime have a \"sound\" problem of any kind, though it has been an issue on a few anime I'm sure.\\n\\n\r\nCharacter 3 - Why 3? Sasha isn't Sasha if he can't be as blunt as he was in Season 1. Hana isn't Hana if she doesn't have Katja to give her a \"roundness\" that she had in Season 1 (A fully developed personality)\\n\\n\r\nEnjoyment 1 - Pathetic is right. They saw some of the bright points of Season 1, and made this anime a string of breast sucking. Fine, we like how they suck breasts... tone it back a bit!\\n\\n\\n\r\nOverall 3 - I am forced into giving this a 3. It's only poor, not pathetic. Which is just because, while the art isn't as good as season 1, it's still not TERRIBLE. and the sound is of decent quality. That's 2 points higher than it would have gotten based on how I feel about it personally.\\n\\n\r\nIf you liked season 1, and you liked how the relationships developed, you enjoyed seeing Sasha put people back in their place... This anime is NOT for you. Stop at Season 1, I'll continue to watch this anime (probably just the ending) to see if Sasha returns to you-know-where (Don't want to spoil season 1!)\\n\\n\r\nOh yeah, I forgot something: While I'm still on this site to hopefully prevent you from wasting your life watching this:\\n\\n\r\nPart of this story takes place in virtual reality! Yeah. Nuff said. *wipes hands together and shows you the palms* This is a HORRIBLE attempt at a second season. Avoid it like the plague! Shield your eyes! Or prepare to have your thoughts and feelings about the first season one bent over a chair right in front of you.",
            "date": "2012-01-30T03:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 52855,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1125705.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/chibchub123",
                "username": "chibchub123"
            },
            "url": "https://myanimelist.net/reviews.php?id=52855"
        },
        {
            "content": "Your enjoyment of this will come down to whether you like hardcore ecchi or not. Breasts are everywhere, bouncing and wobbling, as the main character grabs and sucks them like they were ripe Alphonso mango. The characters' art is good and won't get in the way of the lewd scenes. \r\nHOWEVER, when it tries to take the story seriously, tackling deep philosophical concepts of good vs bad, right vs wrong, then it really comes off as it was written by an 11 years old. The creators should've explored more the comedic aspect of the anime because that seemed another thing they did well.\r\nOverall, not verygood. I would only recommend this to those who love heavy ecchi, big boobs, and are looking for a quick wank.",
            "date": "2018-09-25T13:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 289983,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/the_dumbest_dude",
                "username": "the_dumbest_dude"
            },
            "url": "https://myanimelist.net/reviews.php?id=289983"
        },
        {
            "content": "I'm going to keep this very short since I did this really to give those who have seen season one and intend on watching season two. For those of you who wish/intend to do that, I say: you will be disappointed.\r\nYes, here we have yet another example of how authors can go the wrong way when doing works for many reasons. Sad to say, I'm not completely sure which reason the author of Seikon no Qwaser went the wrong direction, but the most common reason would simply be a lack of planning and plotting things out.\r\nI mean, the first season, in my point of view,was just 'okay'. I didn't have anything special about it, but it at least had managed to score a overall five for me. The main reason would be because of the stimulating ecchi in it that all of us I'm sure was watching it for. But, as the old saying goes too much of a good thing is a bad thing, and eventually I began to actually like it a little bit for the plot, and especially the idea. I mean, getting energy from breast milk? It isn't the most decent idea as its just for stimulation of the watchers, but it still was creative in a sense.\\n\\n\r\nBut, then we have Seikon no Qwaser II. Usually when a writer makes a part one to a series,e specially like Seikon no Qwaser they have the first season just be ecchi to get the watchers stimulated. But as I said, eventually the watchers would want some actual plot in-cooperate into the entire thing rather than just mindless soft pornography. Seikon no Qwaser fails because of this as it didn't do any such thing. Instead of coming with a reasonable plot--even if it isn't the best--it comes with probably the worst plot ever that focus even more on mindless ecchi. The ecchi wasn't even good enough to make me care anymore, as one would expect the author to in-cooperate more ecchi to cover the terrible plot.\\n\\n\r\nMaybe it was just my expectations that made the season two a let down, but I doubt it considering the reviews.\\n\\n\r\nOverall, it scores a three that borders to be a two for me. Not even ecchi can cover the bad plot.",
            "date": "2012-09-16T15:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 72495,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/737523.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MarikSwift",
                "username": "MarikSwift"
            },
            "url": "https://myanimelist.net/reviews.php?id=72495"
        },
        {
            "content": "So for the second season of Seikon No Qwaser ... \r\nAfter seeing the first episodes i thought that this is going to be interesting but what i didn‘t know was that after the 6th ep the rest of the story kinda ended and the rest were just some kind of randomly made episodes because of fan service ... I was truly dissapointed !!!\r\nSo if u enjoyed the first season  like i did then just watch the first 6 episodes of season 2 and don‘t bother to watch the rest because you will be dissapointed as well .\r\nAnd for those who liked Mafuyu as Sashasmaria ... well  even more dissapointment\\n",
            "date": "2012-03-19T14:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 56357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/933147.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/janulo",
                "username": "janulo"
            },
            "url": "https://myanimelist.net/reviews.php?id=56357"
        },
        {
            "content": "For all who have seen season 1 and wanted to see more, well sorry but season 2 was handsdown a let down. Why? Well lets start with the fact that in season 2, the creators suddenly (after a whole season of not really carring about this) sencored every little thing which really pissed me off. Thats why i gave art only a 5, i mean yea sure it looked better then before but the censoring took a lot of the beauty of it away in my believe because you pay more attention to the sencoring and less on the art itself. The story itself startedboring, with our hero being a girl?! after that there are some developments but nothing like season 1, still the ending left me wanting more. The sound was normal most of the time, with the execption of a few out of syn voicing. In the end I would give Seikon no Qwaser 2 a 6, compared to the 9 i gave to season 1.",
            "date": "2016-01-03T15:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 207674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Coolplayer14",
                "username": "Coolplayer14"
            },
            "url": "https://myanimelist.net/reviews.php?id=207674"
        },
        {
            "content": "Well a lot of time passed from my last review(school stuff) but now i will review this awsome anime (Season 1 and Season 2).\r\nWell i realy loved this anime i mean as an echii and comedy fan i will just say this anime is awsome at any scale that i would imagine so ill just say this and every body (atleast 70% people that watched S1 and S2) will say that the S1 was awsome had a great story,nice art,nice funny sccenes and a lot of good stu.But............S2 was something else.....the first 6 or 7 episodes it had some story thing with it and spoilermaybe (Sasha acting as a girl) was ok by my thoughts but the rest of the episodes like from 6 to 12 was just fillers i mean i didnt mind them they where ok (and that wedding scene xD)  but the rest of them nothing special i mean there were enjoying episodes kinda....but still funny as hell.Im realy interested will there be an season 3??? or an OVA??? but mostly will there be S3 couse that 12 episode was a big cliffhanger and i hope to see what will happen but i dont want to read the manga becouse im more intrested seeing Sasha drinking soma in anime stile xD.\\n\\n\r\nStory was an 8/10 (i count S1 and episodes 1-6 and ep 12 from S2 ceouse from 6-12 are just fillers) the story is cool i like the thing that Qwasers use some element from the periodic table to fight (Iron to the win) and that thing with drinking some from womens breasts is AWSOME (not in an perverted way i mean a lot of comedy comes from that thats why its awsome) i realy like the story and hope for S3.\\n\\n\r\nArt is nicly done i realy dont have anything else to say i liked it and thats that 9/10 the characters are realy cool looking (Sasha the best ofcourse).\\n\\n\r\nSound, well the voices are good the music is good the environment is cool so 8/10.\\n\\n\r\nCharacters man i can talk about that a lot but i wont i wrote enough for now......Looking good,voices are cool,the story of some Qwasers are awsome,and the situations when Sasha gets in trouble for drinking soma thats halarious 10/10.A realy nice number of characters.\\n\\n\r\nEnjoyment 10/10 nothing else to say i realy liked this anime.Enjoyed it a lot its just so funny but so cool in the same time.Thats why im an Echii/Comedy fan (echii becouse a lot of comedy comes from that and i freaking love those scenes where he seas a naked body part of a girl man poor guys).\\n\\n\r\nOverall,a solid 9/10 A funny echii anime that hits my spot to watch it but even more if it has an awsome story.Characters are cool,the story is awsome,battle scenes are awsome.Basicly This anime is AWSOME.I reccomend it for guys like me.\\n\\n\r\nSorry for typos if there are any.Please leave a comment.",
            "date": "2014-02-10T12:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 132151,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3476755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MrEpicMichael",
                "username": "MrEpicMichael"
            },
            "url": "https://myanimelist.net/reviews.php?id=132151"
        },
        {
            "content": "here we go again...another season of Seikon no Qwaser...or as I like to call it...Titty Sucking 101. This anime takes as much hentai as it could, crammed it into 24 episodes (first season) and said this isnt hentai. Now, we have our eyes in the second, season, how much more hentai and ecchi is there? To be honest, loads more. \r\nSeikon No Qwaser II-Now with 99% more boobs and titty sucking !\r\nStory-5(Boobs=/= story)\r\nthe story from the beginning was descent, not perfect. It was not a contiuation from the first season like i had hoped.Mafuyu doesn even show up until half way through the series andthe first 6 or so episodes is mainly about Sasha and Hana and the girls at this academy they invade. It also mainly consits of sasha looking like a girl and his boobs looking more real than those of half of the girls there. At some point Katja comes in, gets a new slave. Then, after the school arc, its just turns into slice of life with tit sucking. Sasha is almost addicted to Soma in this season. Every five seconds it feels like he sucking tits, or half the discussions are about boobs.\\n\\n\r\nArt-8(Great for boobage)\\n\r\nthe art was great, considering half the time i was looking at boobs. Also, i'll give credit to who ever aired it:they aired it uncensored. They didnt even censor the lower area of the girls and certainly not the tit sucking. Considering i was looking at tits for half the season, i think art was good. \\n\\n\r\nSounds-8(The OP and ED are amazing)\\n\r\nThe voice acting was decent but where the sound really shines is the OP and ED. I am planning downloading them and raping the play button to listen to them because they have a catchy tune. It trumps the first seasons OP and ED by a lot. Another note on voice acting-Sasha still sounds like a chick who has had one too many cigarettes.\\n\\n\r\nCharacter-7(Those school Girls were 2-D as heck!)\\n\r\nThe main characters really didnt progress this season. The only progression is saw was at the end with Sasha, and thats it. Sasha was the only one who we saw even move an inch in character from the first season. Mafuyu and Oribe epsecially were just still blobs of giant boobs. \\n\\n\r\nEnjoyment-6(Hey, I cant only enjoy tit sucking everyone and a while)\\n\r\nOne can only enjoy tit sucking and fan service every so often. Seikon no Qwaser absolutlly  over did  it on the fan service department. The story went out the window with the addition of several more tit sucking scenes. I feel it had more tit sucking in the second season with 12 episodes than the first season with 24 episodes. If you like tit sucking and ecchi and fan service and just plain boobs, then you just found your anime. \\n\\n\r\nOverall-7(Heck, it was interesting to say the least)\\n\r\nOverall, it isnt bad as a stand alone anime, however, it doesnt mesure up to the first season. This season lacks a good story and the story feels rushed. It tries to make up for rushed story with more titty sucking and talk of boobs(and lets not forget the ocassional bondage slaves) If your daring then watch the second season of Seikon no Qwaser, but please dont expect much from it because sequals are never as good as the originals.",
            "date": "2011-07-28T13:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 40227,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214727.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Denmark-Chan",
                "username": "Denmark-Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=40227"
        }
    ],
    [
        {
            "content": "This sequel has blown me away...\r\nAnd not in the good way, either. \r\nYes, it is true. The first season of Seikon No Qwaser started out great and ended with a decent cliffhanger. However, the continuation of the series (Seikon No Qwaser II) follows Sasha and Hana as they search for the Magdalena of Thunder, supposedly inactive and hiding within a girl at the Roman Curia Surei Academy. Sounds interesting, right? In the first six episodes, Sasha is dressed as a woman in an all girls school where the technology to expand and focus your mind has been used as a way to bait girls ofvarious backgrounds to attend the Academy. Members of the Adepts start to show up to complicate matters and things begin to get heated as the presence of the Magdalena of Thunder is revealed to be inside the Academy, hidden deep beneath the flesh of a young woman. The idea is promising... \\n\\n\r\n...Until the episodes following the sixth just begin to drag. Disappointing, really. This is where the show really began to nose dive into a downward spiral - and frankly, suicide!\\n\\n\r\nMost of the episodes were fillers with no real  intention to further the plot of the story. Every now and again, a character would slightly develop or would come to a sudden realization surrounded by a clusterfuck of fan-service. A COLOSSAL AMOUNT OF FAN-SERVICE.\\n\r\nBOOBIES... EVERYWHERE. \\n\\n\r\nYou want cleavage? YOU'VE GOT IT!\\n\r\n You want boobies that jiggle for no reason? YOU'VE GOT IT! \\n\r\nYou want breasts of every shape and size? YOU'VE GOT IT. \\n\\n\r\nUnfortunately, the clusterfuck of fan-service actually killed the plot of the show. It felt as though in every episode, the mangaka left a pair of boobs lying around purely for the sake of his viewers to sit around and gawk at them. A little fan-service is good, yes, but it became more of a hassle to finish the series as the show very slowly progressed. \\n\\n\r\nThe last episode was engaging and yet, it felt somewhat rushed. Most of the action and deepening of the plot took place within the last 24 minutes of the series, leaving yet another cliffhanger at the end. \\n\\n\r\nART :: The art of the show was the same as the previous season's. A few times, the author had failed to correlate speech with lip movement in minor scenes or forgot to draw a movement to a sound, but nothing too serious. The detail of the characters and their wardrobe has improved since the last season, but the background is still rather average. \\n\\n\r\nSOUND :: I highly enjoyed the opening and ending themes. Upbeat, funky, and melancholy, the song \"Rasen, Arui wa Seinaru Yokubou\" by Faylan was well done, but definitely does NOT compare to the first season’s “Baptize” OP. On the contrary, \"Metaphor\" by Shoujo Byou, the ending theme, is my favorite from the Seikon series by far. If anything, the ending OP adds to what the anime is trying to define as the atmosphere of the show. \\n\\n\r\nCHARACTER :: Not much development, if very minimal. Aside from the goofy and unnecessary fan-service of the show, there were hardly any slots open for serious character interaction. What has developed between the main characters in the first series stays relatively stagnant throughout the production. New characters emerge from the foreground, but are eventually shouldered to the side after the recovery of the Magdalena of Thunder; this, despite the maturation of the characters. Only one character from Surei Academy appears throughout the remainder of the episodes, but her appearances are primarily reserved for Ekaterina. \\n\\n\r\nOVERALL ENJOYMENT: \\n\r\nNot much. I rated this a 6 [enjoyment & overall] because the story lacked any real meat, there was hardly any action or development of the plot, the characters were static, and almost everything was sugar-coated with filler episodes. Seikon No Qwaser II ended up becoming a giant boob-sucking travesty, rather than a form of entertainment.",
            "date": "2012-03-07T11:25:00+00:00",
            "helpful_count": 60,
            "mal_id": 55511,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257517.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KnightsGuardian",
                "username": "KnightsGuardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=55511"
        },
        {
            "content": "To put it simply I was disappointed with this second series, it shouldn't have even been made.\r\nSTORY:\r\nIn the first season there was your usual beginning, middle and end. There were interesting relationships between the characters and some character development. I thoroughly enjoyed it and if you did as well then don't bother with the second season. The second season started out with some semblance of a plot, a goal if you will. However this was all over by the fifth or sixth episode and to be honest it wasn't even very satisfying. From then on it is pretty much half a series of random ministories that don't really entertain. There is also a whole lot more ecchi this time around, which is fine for some, however it looks as though  they exchanged any pretense of a storyline for more fanservice. There's an extremely weird ending too.\\n\\n\r\nCHARACTER:\\n\r\nAll character development ended with the first season. That's really the only way you can put it. If you were looking for a continuance of some of the romances and rivalries don't bother, they pretty much continue on as they were when the first season left off. \\n\\n\r\nOVERALL:\\n\r\nThis did not leave me hanging out for more. If there is a third season I doubt I'll bother watching it. Usually I try to find some good points in an any but there just weren't any for me this time around. There may have been a few moments that I laughed throughout the series however this was more because of the ridiculous non-existant plot rather than anything intentional. When is comes down to it, how can you rate an anime in which nothing at all happened?",
            "date": "2011-07-18T20:04:00+00:00",
            "helpful_count": 41,
            "mal_id": 39473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218928.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stachipopp",
                "username": "Stachipopp"
            },
            "url": "https://myanimelist.net/reviews.php?id=39473"
        },
        {
            "content": "** THIS IS A NEW SERIES SO THERE ARE ONLY A FEW EPISODES OUT. 3 ARE RELEASED AT THE TIME OF THIS REVIEW **\r\nSo I'm assuming you know what Seikon No Qwaser is all about if you're interested in Season 2, but if you aren't then I'll give you a brief intro (this might have some manga stuff thrown in since I read/watched both).\r\nBasically the male protagonist Sasha came to Japan under the orders of a group called \"Athos\" to prevent the opposing side, the \"Adepts\" from obtaining some amazing power in Season 1. The Adepts are made up of Qwasers (people who have abilitiesrelated to the elements of the periodic table. For instance: Sasha (Alexander) is the Iron Qwaser, so he can manipulate Iron). \\n\\n\r\nHERE IS THE REVIEW NOW :)\\n\\n\r\n* STORY * \\n\\n\r\n~ Much like every other second season opening you are thrown into a fresh new atmosphere and slowly things are explained to you about what happened between the final episode of the previous season and this current episode. So far the story seems to be progressing slowly but surely, however around episode 3 is when I began to feel some sort of \"excitement\" flowing through me. I won't spoil it but it's the first time that you see an old friend make an appearance other then Hana, who is introduced in episode 1, so that's not much of a spoiler anyways.\\n\\n\r\n* ART *\\n\\n\r\n~ I don't think the artwork has changed much, or maybe since it's 2011 more sites have the \"high quality\" releases then the previous season. Seikon No Qwaser Season 2 is a tradeoff in terms of looks. If you prefer for it to look really nice then say goodbye to the \"Ecchi scenes\". Much like the first season, the higher quality releases cover up the \"good parts\" with a yellow glare -___- \\n\\n\r\nYeah I know, it bothers me too. But if you're impatient like me, you will attempt to find the uncensored version but only find the first season episodes. So just deal with it for now lol.\\n\\n\r\n* Sound *\\n\\n\r\n~ I always felt like the OP for Seikon No Qwaser was more exciting then the ending which I feel is true for the second season. The ending for both the first season and the second season scare the sh*t out of me. It's just so hardcore and deathly ( or at least the second season is, I usually just go to the next episode before I hear enough of the endings :P )\\n\\n\r\n* Character *\\n\\n\r\n~ Can't really say much yet since only 3 episodes are out but Sasha has retained his \"openness\" rather then reverting back to his cold demeanor thanks to Mafuyu (gotta love her), although Mafuyu hasn't been shown yet since her and Katja have apparently gone to train elsewhere in order to get stronger. \\n\\n\r\nThe new characters introduced however are something new and exciting. Some more backstory is shown and a few new faces appear, and also some old ones. Mostly adept members so far.\\n\\n\r\n* Enjoyment *\\n\\n\r\nBy the time I started watching Season 2 there was already 2 episodes out so I didn't have to wait too long to wonder what was going to happen next. The 3rd episode really got me feeling \"excited\" again since the first 2 were a bit bland. This is of course due to a guest appearance by a familiar person from Season 1.\\n\\n\\n\r\n**** OVERALL *****\\n\\n\r\nI feel like if you enjoyed Season 1 you will definitely enjoy Season 2. It has the breast sucking, and the fight scenes and a little bit more. Although I haven't seen Mafuyu and the gang yet, I personally loved Mafuyu :3 (she was such a sweetheart), the new characters sort of make up for it.\\n\\n\r\nAt least Hana is there to keep things lively since she's Katjas slave no matter what haha.\\n\\n\\n\\n\\n\\n\r\n~ I'll probably change this as the episodes go on.\\n",
            "date": "2011-04-28T16:39:00+00:00",
            "helpful_count": 33,
            "mal_id": 36548,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=36548"
        },
        {
            "content": "Here goes: \r\nI've watched the first season straight through in one sitting, it was pretty good if you are into that sort-of thing. (Which I am, 10/10!) I was happy to see that this anime got a second season too! It was just more enjoyment to be had. God have mercy on my poor soul. I watched the first two episodes of the new season, without ruining TOO much of the plot here's what I've got for you:\r\nSasha is now pretending to be a girl (poorly) and sucking everyone's breasts which they seem to be fine with. Hana is now Sasha's maria, which is ahorrible match-up. If Hana was willing to go into this organization to be with Katja, why wouldn't Mafuyu? Why wouldn't they send Katja to this mission instead of Sasha? She IS a girl, and she has that *cuteness* to get all the girls to like her, as proven in season one.\\n\\n\r\nStory: 1 (0 if I could) -  the very plot is flawed, the execution is pathetic, it's even more ridiculous than most of the nonsensical parts of season 1.\\n\\n\r\nArt: 5 - People say this is higher quality, they call it higher quality, It looks MUCH worse than the way Season 1 was done. I guess I'm just a sucker for the old way.\\n\\n\r\nSound: 8 -  Not too many subbed anime have a \"sound\" problem of any kind, though it has been an issue on a few anime I'm sure.\\n\\n\r\nCharacter 3 - Why 3? Sasha isn't Sasha if he can't be as blunt as he was in Season 1. Hana isn't Hana if she doesn't have Katja to give her a \"roundness\" that she had in Season 1 (A fully developed personality)\\n\\n\r\nEnjoyment 1 - Pathetic is right. They saw some of the bright points of Season 1, and made this anime a string of breast sucking. Fine, we like how they suck breasts... tone it back a bit!\\n\\n\\n\r\nOverall 3 - I am forced into giving this a 3. It's only poor, not pathetic. Which is just because, while the art isn't as good as season 1, it's still not TERRIBLE. and the sound is of decent quality. That's 2 points higher than it would have gotten based on how I feel about it personally.\\n\\n\r\nIf you liked season 1, and you liked how the relationships developed, you enjoyed seeing Sasha put people back in their place... This anime is NOT for you. Stop at Season 1, I'll continue to watch this anime (probably just the ending) to see if Sasha returns to you-know-where (Don't want to spoil season 1!)\\n\\n\r\nOh yeah, I forgot something: While I'm still on this site to hopefully prevent you from wasting your life watching this:\\n\\n\r\nPart of this story takes place in virtual reality! Yeah. Nuff said. *wipes hands together and shows you the palms* This is a HORRIBLE attempt at a second season. Avoid it like the plague! Shield your eyes! Or prepare to have your thoughts and feelings about the first season one bent over a chair right in front of you.",
            "date": "2012-01-30T03:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 52855,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1125705.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/chibchub123",
                "username": "chibchub123"
            },
            "url": "https://myanimelist.net/reviews.php?id=52855"
        },
        {
            "content": "Your enjoyment of this will come down to whether you like hardcore ecchi or not. Breasts are everywhere, bouncing and wobbling, as the main character grabs and sucks them like they were ripe Alphonso mango. The characters' art is good and won't get in the way of the lewd scenes. \r\nHOWEVER, when it tries to take the story seriously, tackling deep philosophical concepts of good vs bad, right vs wrong, then it really comes off as it was written by an 11 years old. The creators should've explored more the comedic aspect of the anime because that seemed another thing they did well.\r\nOverall, not verygood. I would only recommend this to those who love heavy ecchi, big boobs, and are looking for a quick wank.",
            "date": "2018-09-25T13:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 289983,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/the_dumbest_dude",
                "username": "the_dumbest_dude"
            },
            "url": "https://myanimelist.net/reviews.php?id=289983"
        },
        {
            "content": "I'm going to keep this very short since I did this really to give those who have seen season one and intend on watching season two. For those of you who wish/intend to do that, I say: you will be disappointed.\r\nYes, here we have yet another example of how authors can go the wrong way when doing works for many reasons. Sad to say, I'm not completely sure which reason the author of Seikon no Qwaser went the wrong direction, but the most common reason would simply be a lack of planning and plotting things out.\r\nI mean, the first season, in my point of view,was just 'okay'. I didn't have anything special about it, but it at least had managed to score a overall five for me. The main reason would be because of the stimulating ecchi in it that all of us I'm sure was watching it for. But, as the old saying goes too much of a good thing is a bad thing, and eventually I began to actually like it a little bit for the plot, and especially the idea. I mean, getting energy from breast milk? It isn't the most decent idea as its just for stimulation of the watchers, but it still was creative in a sense.\\n\\n\r\nBut, then we have Seikon no Qwaser II. Usually when a writer makes a part one to a series,e specially like Seikon no Qwaser they have the first season just be ecchi to get the watchers stimulated. But as I said, eventually the watchers would want some actual plot in-cooperate into the entire thing rather than just mindless soft pornography. Seikon no Qwaser fails because of this as it didn't do any such thing. Instead of coming with a reasonable plot--even if it isn't the best--it comes with probably the worst plot ever that focus even more on mindless ecchi. The ecchi wasn't even good enough to make me care anymore, as one would expect the author to in-cooperate more ecchi to cover the terrible plot.\\n\\n\r\nMaybe it was just my expectations that made the season two a let down, but I doubt it considering the reviews.\\n\\n\r\nOverall, it scores a three that borders to be a two for me. Not even ecchi can cover the bad plot.",
            "date": "2012-09-16T15:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 72495,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/737523.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MarikSwift",
                "username": "MarikSwift"
            },
            "url": "https://myanimelist.net/reviews.php?id=72495"
        },
        {
            "content": "So for the second season of Seikon No Qwaser ... \r\nAfter seeing the first episodes i thought that this is going to be interesting but what i didn‘t know was that after the 6th ep the rest of the story kinda ended and the rest were just some kind of randomly made episodes because of fan service ... I was truly dissapointed !!!\r\nSo if u enjoyed the first season  like i did then just watch the first 6 episodes of season 2 and don‘t bother to watch the rest because you will be dissapointed as well .\r\nAnd for those who liked Mafuyu as Sashasmaria ... well  even more dissapointment\\n",
            "date": "2012-03-19T14:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 56357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/933147.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/janulo",
                "username": "janulo"
            },
            "url": "https://myanimelist.net/reviews.php?id=56357"
        },
        {
            "content": "For all who have seen season 1 and wanted to see more, well sorry but season 2 was handsdown a let down. Why? Well lets start with the fact that in season 2, the creators suddenly (after a whole season of not really carring about this) sencored every little thing which really pissed me off. Thats why i gave art only a 5, i mean yea sure it looked better then before but the censoring took a lot of the beauty of it away in my believe because you pay more attention to the sencoring and less on the art itself. The story itself startedboring, with our hero being a girl?! after that there are some developments but nothing like season 1, still the ending left me wanting more. The sound was normal most of the time, with the execption of a few out of syn voicing. In the end I would give Seikon no Qwaser 2 a 6, compared to the 9 i gave to season 1.",
            "date": "2016-01-03T15:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 207674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Coolplayer14",
                "username": "Coolplayer14"
            },
            "url": "https://myanimelist.net/reviews.php?id=207674"
        },
        {
            "content": "Well a lot of time passed from my last review(school stuff) but now i will review this awsome anime (Season 1 and Season 2).\r\nWell i realy loved this anime i mean as an echii and comedy fan i will just say this anime is awsome at any scale that i would imagine so ill just say this and every body (atleast 70% people that watched S1 and S2) will say that the S1 was awsome had a great story,nice art,nice funny sccenes and a lot of good stu.But............S2 was something else.....the first 6 or 7 episodes it had some story thing with it and spoilermaybe (Sasha acting as a girl) was ok by my thoughts but the rest of the episodes like from 6 to 12 was just fillers i mean i didnt mind them they where ok (and that wedding scene xD)  but the rest of them nothing special i mean there were enjoying episodes kinda....but still funny as hell.Im realy interested will there be an season 3??? or an OVA??? but mostly will there be S3 couse that 12 episode was a big cliffhanger and i hope to see what will happen but i dont want to read the manga becouse im more intrested seeing Sasha drinking soma in anime stile xD.\\n\\n\r\nStory was an 8/10 (i count S1 and episodes 1-6 and ep 12 from S2 ceouse from 6-12 are just fillers) the story is cool i like the thing that Qwasers use some element from the periodic table to fight (Iron to the win) and that thing with drinking some from womens breasts is AWSOME (not in an perverted way i mean a lot of comedy comes from that thats why its awsome) i realy like the story and hope for S3.\\n\\n\r\nArt is nicly done i realy dont have anything else to say i liked it and thats that 9/10 the characters are realy cool looking (Sasha the best ofcourse).\\n\\n\r\nSound, well the voices are good the music is good the environment is cool so 8/10.\\n\\n\r\nCharacters man i can talk about that a lot but i wont i wrote enough for now......Looking good,voices are cool,the story of some Qwasers are awsome,and the situations when Sasha gets in trouble for drinking soma thats halarious 10/10.A realy nice number of characters.\\n\\n\r\nEnjoyment 10/10 nothing else to say i realy liked this anime.Enjoyed it a lot its just so funny but so cool in the same time.Thats why im an Echii/Comedy fan (echii becouse a lot of comedy comes from that and i freaking love those scenes where he seas a naked body part of a girl man poor guys).\\n\\n\r\nOverall,a solid 9/10 A funny echii anime that hits my spot to watch it but even more if it has an awsome story.Characters are cool,the story is awsome,battle scenes are awsome.Basicly This anime is AWSOME.I reccomend it for guys like me.\\n\\n\r\nSorry for typos if there are any.Please leave a comment.",
            "date": "2014-02-10T12:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 132151,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3476755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MrEpicMichael",
                "username": "MrEpicMichael"
            },
            "url": "https://myanimelist.net/reviews.php?id=132151"
        },
        {
            "content": "here we go again...another season of Seikon no Qwaser...or as I like to call it...Titty Sucking 101. This anime takes as much hentai as it could, crammed it into 24 episodes (first season) and said this isnt hentai. Now, we have our eyes in the second, season, how much more hentai and ecchi is there? To be honest, loads more. \r\nSeikon No Qwaser II-Now with 99% more boobs and titty sucking !\r\nStory-5(Boobs=/= story)\r\nthe story from the beginning was descent, not perfect. It was not a contiuation from the first season like i had hoped.Mafuyu doesn even show up until half way through the series andthe first 6 or so episodes is mainly about Sasha and Hana and the girls at this academy they invade. It also mainly consits of sasha looking like a girl and his boobs looking more real than those of half of the girls there. At some point Katja comes in, gets a new slave. Then, after the school arc, its just turns into slice of life with tit sucking. Sasha is almost addicted to Soma in this season. Every five seconds it feels like he sucking tits, or half the discussions are about boobs.\\n\\n\r\nArt-8(Great for boobage)\\n\r\nthe art was great, considering half the time i was looking at boobs. Also, i'll give credit to who ever aired it:they aired it uncensored. They didnt even censor the lower area of the girls and certainly not the tit sucking. Considering i was looking at tits for half the season, i think art was good. \\n\\n\r\nSounds-8(The OP and ED are amazing)\\n\r\nThe voice acting was decent but where the sound really shines is the OP and ED. I am planning downloading them and raping the play button to listen to them because they have a catchy tune. It trumps the first seasons OP and ED by a lot. Another note on voice acting-Sasha still sounds like a chick who has had one too many cigarettes.\\n\\n\r\nCharacter-7(Those school Girls were 2-D as heck!)\\n\r\nThe main characters really didnt progress this season. The only progression is saw was at the end with Sasha, and thats it. Sasha was the only one who we saw even move an inch in character from the first season. Mafuyu and Oribe epsecially were just still blobs of giant boobs. \\n\\n\r\nEnjoyment-6(Hey, I cant only enjoy tit sucking everyone and a while)\\n\r\nOne can only enjoy tit sucking and fan service every so often. Seikon no Qwaser absolutlly  over did  it on the fan service department. The story went out the window with the addition of several more tit sucking scenes. I feel it had more tit sucking in the second season with 12 episodes than the first season with 24 episodes. If you like tit sucking and ecchi and fan service and just plain boobs, then you just found your anime. \\n\\n\r\nOverall-7(Heck, it was interesting to say the least)\\n\r\nOverall, it isnt bad as a stand alone anime, however, it doesnt mesure up to the first season. This season lacks a good story and the story feels rushed. It tries to make up for rushed story with more titty sucking and talk of boobs(and lets not forget the ocassional bondage slaves) If your daring then watch the second season of Seikon no Qwaser, but please dont expect much from it because sequals are never as good as the originals.",
            "date": "2011-07-28T13:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 40227,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214727.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Denmark-Chan",
                "username": "Denmark-Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=40227"
        }
    ]
]