[
    [
        {
            "content": "Kamisama Hajimemashita was a really pretty and easy to watch anime. If you liked the first season, Kamisama Hajimemashita◎ did not disappoint at all; in fact, the romance portion got a little heavier, so all you romance lovers out there are sure to be saying \"d'aww\" at least three times an episode. I highly recommend it if you enjoyed S1.\r\nStory: 8\r\nThe story picks up right from where S1 ended, but it takes a bit of a break from Nanami \"learning how to be a Land God\" to more of a \"Nanami being a boss God\" approach. There are a ton of new characters, and reappearancesof older ones (i.e. Himemeko x Kotaro, the one and only Kurama, and Mizuki), making for a fairly diverse story line and change in direction. But it was a good change, so nothing was too stale.\\n\\n\r\nNanami delves deeper into her duties as a Land God, such as visits and becoming a stronger deity. When she's figuring this out, she still carries support from her faithful familiars, Tomoe and the adorable snake Mizuki. They fight, Nanami breaks it up, and they go on with their lives. While this is happening, a variety of plots unfold, all leading to Tomoe having successive epiphanies about his cheerful human goddess.\\n\\n\r\nCharacters: 9\\n\r\nThe new characters were all pretty funny and added a nice touch to the whole atmosphere of the show, even though some of their stories were left hanging, like Kirihito, Tomoe's old companion from his wild fox days. But we also got a deeper look into Kurama's character, which was a sweet bonus. \\n\\n\r\nAs for the main characters, Tomoe this season is ridiculously cute. Seriously, I could not get enough of him, with his revelations and inner monologue. There's actually a lot more focus on Tomoe this season as well, so you get more time to understand his thoughts, which was a good addition. And Nanami was still the same oblivious and happy-go-lucky Nanami as last season, but perhaps a bit more mature and refined as a deity. \\n\\n\r\nYes, she continues her funny antics, like creating Mamoru, the adorable monkey child, who is added to the list of \"Things/People that Antagonize Tomoe\". But hey, that only serves to bring joy to us viewers, right? XP To sum it all up, character development was as strong this season as much as the last, if not more so.\\n\\n\r\nArt: 8\\n\r\nOkay, here's where it got a little different. With season one having 7 producers and season two having 3, the art style definitely took a turn. It wasn't bad at all; but it was really easy to tell the contrast. The colors are still charming and pleasant, but the style is a little simpler and there are a ton of close-ups each episode. As in, like 30 per episode. It wasn't exactly annoying, but it was a tad abundant for me. For the rest, I had no complaints. Still the same characters and designs we know and love.\\n\\n\r\nSound: 8\\n\r\nThe artist Hanae has provided both seasons of Kamisama Hajimemashita with adorable and awesome OPs and EDs, and I love it. The songs are cute and dancey, but they still tie in with the whole atmosphere of the show. Can't really complain, they just work. Also, I felt like the background music they used was very effective in each scene they used to get across the tone of the situation. It was nothing too fancy, but it was still satisfying. \\n\\n\r\nEnjoyment: 9\\n\r\nI realize I have been comparing S1 and S2 a whole lot this entire time, but don't get me wrong, Kamisama Hajimemashita is a solid show. Heck, S1 is in my favorites. S2 was just as good, and probably even better if you're just here for a ton of googly-eyeing. Which, I was, not gonna lie.\\n\\n\r\nThe romance definitely got a lot stronger, as well as the story, and characters. There was so much cuteness in this show, and it did not fail to continue that legacy in this season. I went through episodes at a madman's pace, and I'm pretty sad that it's over already. :(\\n\\n\r\nOverall: 8.5\\n\r\nAbsolutely watch this if you are having any doubts. This is by no means one of those shows with a terrible S2. Really, this season was nearly on par with the first, which makes it rather awesome and a good watch. If for no other reason, watch for Tomoe. Hey, I won't judge. Much.",
            "date": "2015-03-30T14:38:00+00:00",
            "helpful_count": 57,
            "mal_id": 184133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4401035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sunnierskies",
                "username": "sunnierskies"
            },
            "url": "https://myanimelist.net/reviews.php?id=184133"
        },
        {
            "content": "Shojo manga series by Julietta Suzuki that adapted once again into anime after it first season, Kamisama Hajimemashita. The first season left some curiosities to the audience who enjoys romance genre about “what will happen between the main characters after this?” Well, the answer might be found in this second season. But, I can’t guarantee that you’ll find all of those answers in it either. So, it would be better just watch it for yourself and you will know what I meant.\r\n(SPOILER ALERT)\r\n(*) Story\r\nThe story remains around our main characters, let’s just say “the girl and the fox” who continue their life in Mikage’s templeafter several of supernatural events in the first season happened and affect their relationship with each other very well into some kind of “more-love-interest” relationship. The first season starts with the character’s past and main conflict that goes on until pops up some supporting characters who help fill the sensation, mood and the story itself to be life and joy. But, we’re not gonna talk about the first season in here. So, still. according to that, just don’t confuse when you see the beginning episode of the second season starts with scary vision and dark red color background which apparently a dream belongs to a white-pale but cool guy that just wake up from his sleep. You’ll need to memorize the last episode of the first season to know who is that character. But, don’t worry if you lazy to watch it again because you’ll see a “familiar introduction” after that (just like in the first season) and you’ll know who that is when you watching this anime completely.  Well, back to the main topic, the story consist of two parts in one episode. Those parts linked to one another and they give sign about it with some “free pic” (I called it because I always save the pic whenever they show up haha, so it is “free”) which is similar to most other anime. In this season, there’s different seasoning than the first, for an example like the problem solving of the conflict that I thought it would spend a long time to be solved but it solved with some simple idea. I didn’t say that was bad, but what can I say? It’s so supernatural, everything could happen. Or I guess they need to hurry the solving part to match or catch up the amount of episode of this anime which I suggest they need to plus the amount of it to do it just like I thought. But, despite it, I think the story was good enough, I like the writer’s idea whenever there’s romance scene that somehow manage to balanced the comedy which makes me feel the essence and the character’s feeling about themselves or the events that they’ve been through. The ending was absurd, that makes sense because the pace and new character that shows up. They need more episode to make it epic “if” this is their last anime adaptation. (I hope not!) But, it’s not that bad to watch it till the end. It’s romantic, it’s hilarious, it’s supernature and fantastical, it describes how love could grow between a human and a yokai. I would say that is “very touching and makes my heart melted”.\\n\\n\r\n(*) Art\\n\r\nThe art was good. It’s certainly nailed it to bring the romance and peaceful aura to the audience. It fits the story although I hope they could detail the background to help the story a little. But, I don’t mind about that. Because I believe there’s limit in everyone’s skill and we should respect other’s work. It’s unique in a good way and actually, I found that I fond of the character’s art. All with the background effects, filler and especially the chibi or funny looking expression that often shows up.\\n\\n\r\n(*) Sound\\n\r\nSuzuko Mimori’s voice suits Nanami well. I loved it, especially whenever she shouts and mad on Tomoe because some kind of simple or serious problems she had with him. And the character voice of Tomoe is even better. I could say that Shinnosuke Tachibana has succeeded to cast Tomoe from the first season and I bet he especially nailed it for drawing attention to female’s audience out there to watch this anime too. And don’t forget about the other’s character voice actor like Daisuke Kishio (Kurama), Nobuhiko Okamoto (Mizuki), Junichi Suwabe (Akura-oh), Horie Yui (Himemiko), Akira Ishida (Mikage) and many others, they have succeeded too. I will not protest about them. They’re professional and they absolutely “nailed” it! For the OP and ED theme, I’d like to say that it’s fair enough. The singer as same as the first season. It’s good and cute to hear. Talking about the back sounds, I…. really loved them. They hit the feel, the situation and help the story serving a lot to the audience. My favorite back sound was the sound that historical but peaceful when there’s some meaningful scene that shows up.\\n\\n\r\n(*) Character\\n\r\nThere’s new characters that show up in this second season. For an example like Akura-oh (Tomoe’s partner from the past) who enjoys caused destruction through all over the world or Jirou (the fourth chief of Kurama Mountain) that suddenly turns into a memorable yet important for several episodes (you’ll understand when you watch it) and many others. They have unique characteristic and amazing looks too that make my brain memorize them. Besides that, I like how Nanami develops her character even more in this season (through her past or her attitude towards some problems that makes her skill of spiritual power level up) and I like how she could handle her feeling towards Tomoe. I see her courage even more rather than the first season and by that, I can tell that her character was well-developed. For Tomoe, he changed to care for Nanami a lot rather than usual, he more often to jealous, sulking, teasing and see Nanami differently especially after the last episode when he saw Nanami’s past. And he did realize what he actually feel towards Nanami in this season. I would say that their both character develop as same as their feeling to one another. I love the quotes too especially the quote that Mikage said to Nanami about “the taboo love between human and yokai”.\\n\\n\r\n(*) Enjoyment\\n\r\nI enjoy watching this. I can’t believe it for myself either but it is enjoyable. For several times, the director and the writer had succeeded to draw curiosities and cut episode when there’s surprising event. I hate whenever they did that, but as long as it worth to watch, why not? As it ended, I just hoped that the last episode was not the last of it.\\n\\n\r\nIn conclusion, “all of you who likes romance or rom-com story genre would be best to watch this anime right now”. Kamisama Hajimemashita (Season 2) it’s worth to watch, funny, heartwarming and I found it amazingly enjoyable (haha). Well, I suggest you watch the first season before watching this one.",
            "date": "2015-12-30T11:08:00+00:00",
            "helpful_count": 33,
            "mal_id": 207310,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4719047.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Akafection",
                "username": "Akafection"
            },
            "url": "https://myanimelist.net/reviews.php?id=207310"
        },
        {
            "content": "Story (8):\r\nThe second season of kamisama hajimemashita contain Tomoe's past and the feelings that Tomoe has for his lady and mistress, Nanami. Like many other stories it's about a female girl who's poor life soon turns into a rowdy one filled with friends (as most of you already know this is mentioned in season 1) Season two is about the female lead, Nanami, meeting new gods and finally taking charge and developing into the proper Land Goddess. It has romance, comedy, and drama. The second season has many new settings, characters, music and moments where you'd laugh.\r\nArt(8): \r\nThe art is the same as the firstseason, at least to me. Since this is a light hearted anime the colors are all pretty and go with the anime. It's pretty too look at with the light colors here and there. The details are also great, but they seemed to be less exact than the first season. This though didn't ruin the experience. \\n\\n\r\nSound(9):\\n\r\nI think the OP and ending are better than the first season. Reason why is because it's more up beat and goes with the anime. You have no idea how many times I ended up singing the OP at random times. \"Kamisama no kamisama\" by Hanae starts out with a flute which will already get you in the mood. (Laughs while remembering Mizuki trying to play the flute) The endings you want to watch the next episode because of the cliffhangers and cause of the song.\\n\\n\r\nCharacters(10):\\n\r\nNot only was there Nanami, Mizuki, Tomoe, and the shrines servants, but manyyy more amazing characters got introduced. The antagonist was introduced, Kurama's past was discovered which led to even more awesome characters. It was a character boatload!!\\n\r\nEvery character was awesome in their own way and you'd always want to see more of them. Even the antagonist. The quarrels between Tomoe and Mizuki over Nanami and over stupid little things always made me laugh. You can never get enough of these two. In my opinion, I think the character development and new characters was my favorite part of the entire second season.\\n\\n\r\nEnjoyment(9):\\n\r\nI could never get enough of this. Ever since I finished watching the first season I've wanted more and I finally got it. I was so overjoyed when I started to watch the second season. Since it was ongoing when I watched I hated the fact that I had to wait a week to see the next episodes. Them cliffhangers are suspenseful!\\n\\n\r\nOverall(9):\\n\r\nEven though it ended I still want more. *fingers crossed* hopefully there will be a season 3. Season 2 was better than season 1 in my opinion. Season 2 Op is more upbeat, has a handful of new characters(adorable ones too!), and I liked seeing the past of some of the main characters. I felt like I knew them even more than in season 1.",
            "date": "2015-03-30T16:08:00+00:00",
            "helpful_count": 29,
            "mal_id": 184145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4003033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xANIMExGEEKx",
                "username": "xANIMExGEEKx"
            },
            "url": "https://myanimelist.net/reviews.php?id=184145"
        },
        {
            "content": "To be honest, this show always had always been a sort of epitome for what shoujo is. The characteristics, backgrounds, and general premise all points to the direction of what the franchise has tried to be. And from the first season, it capitalized on every opportunity to craft shoujo. Season 2 isn’t far different by experiences as it will feel just like the first season. What that means is another charming trip with our supernatural familiar friends and the all adorable Nanami once again.\r\nOut of any show that got the news of receiving a season 2 in 2014, this one hit the mark. It tookme by surprise when the sequel was announced especially since it just popped out of nowhere. Make no mistake though. This sequel is something I welcome with open arms. Titled “Kamisama Hajimemashita◎”, the season 2 assumes that you have completed the first season. As it begins directly from where it left off, viewers should be familiar of what they may expect. \\n\\n\r\nThe show hardly changes from where it had been from the beginning. There’s the familiars, humans, and society that are enveloped by a host of shoujo generics. But for what’s worth, the first few episodes crafts a more independent nature in Nanami. She’s here to prove herself and in fact takes action by attending a Divine Assembly, a meeting between Gods. Being a human herself, one can imagine how she will stand out as the “It Girl”. However, taking a close glance will show that Nanami has established herself as a strong spirited woman. She relies on almost no one and tries to become a better God while fulfilling her sacred duty. As such, this season focuses a lot more on story content rather than romance. The first half of the show easily sends this message as the series focuses on characterization. Not just for Nanami in this case but her partner Tomoe also gets a decent amount of spotlight. There are also some cryptic imagery regarding his past that viewers may be curious of.\\n\\n\r\nBecause the story context become a rather tense focus, we also have conflicts brewing as well. Mysterious characters such as Kirihito will get viewers wondering about his motivations, goals, and role in this season. Furthermore, there’s a bit of interpersonal problems with our main characters as well. For Nanami, we get the idea that she is trying to become a better God but she still has some doubts here and there. Then, there’s Tomoe who finally seems to realize the depth of his feelings. But what do we get in return? Some cliché romance delivery where neither seems to tie the knot. What that means is that there’s a whole load of teasing but nothing in the end is resolved for their romance. I can’t say this is exactly surprising with shoujo content. It usually takes time for this to develop and the first season portrayed that quite clearly with its romance angles. But as for this show, romance itself should be a more prominent term. It’s like a heart of this show that needs to pump (almost literally in a way) to get the show moving. Sometimes, this season does that cleverly and other time moves back to square one For what’s worth, season 2 relies much more on its story context rather than romance focus.\\n\\n\r\nDespite this, the second season still has that soft feeling of charming elegance. Some episodes has that slice of life feel combined with shoujo themes. And while most of this is hardly original, it creates the essence of a satisfying shoujo. Adaptation wise, the show retains its comedy and drama. Most of the comedy is lighthearted with the expressive tones and scenarios that can be taken to heart. To say the least, this show always balances itself when it comes to all of its plot elements. From the cryptic imagery, dialogue, and plot developments to character building, this sequel is more or less of shoujo story book. Each page adds more context to some parts of the story while focusing on certain characters. In fact, Tomoe and Nanami aren’t just the only main characters we get to know more. There’s other prominent figures such as Kurama and Jiro that we get a nice bite out of their past lives. In retrospect, the franchise’s characters all stand out in some way along with this delicate story wrapped by shoujo.\\n\\n\r\nTechnical production in regards to the artwork remains generally the same for the sequel. Nothing has changed in regards to the world fiction of this series. It’s marvelous and can even be breathtaking at times to see the difference between the spiritual and human world. In particular, the Netherworld brings a different mood to this charming shoujo. Character designs remains generally the same for all the main characters. While we do get some new cute characters such as a monkey familiar, hardly anything else has changed. Nanami does have a more independent nature in her for this season though as she becomes more determined than ever to become a better God. The expressive emotions she delivers gives credibility to quite just that.\\n\\n\r\nSoundtrack is mostly decent by standards. Sadly, it’s not really a strength for this season. OST still has that serene-like feeling although not memorable enough to leave a strong impression. On the other hand, the OP/ED songs has a really sharp focus with its shoujo style. Of course, we can’t forget the main characters who are able to express their thoughts and feelings with their voices. While nothing is largely memorable by experience, it’s still charming to watch the characters act out in their roles. By voice content, it is satisfying.\\n\\n\r\nAt some point in this season, it won’t be a surprise to realize that the sequel drives its story by pushing its plot elements. While the first season has an intuitive focus on romance, this season takes the steering wheel to go with the context of the story. But there are still room for romance because every shoujo focuses a bit more on that. For what’s worth, Kamisama Hajimemashita◎ stands out as a way to show how much Nanami has changed from the beginning. The relationships she has with others is still a good focus in this season with its interpersonal perspectives. It has a convincing nature with everything it sets up from Nanami’s will to become a better God and to Tomoe’s realization of what he feels towards Nanami. Be prepared for a ride that blurs the line between humans and Gods.",
            "date": "2015-03-30T16:45:00+00:00",
            "helpful_count": 27,
            "mal_id": 184148,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=184148"
        },
        {
            "content": "Story 8/10\r\nThe story picks up right where S1 left off. Nanami has now learned her duties as a god and now we see her applying her knowledge. The story is as you would expect it to be: she encounters challenges and works to fix them on her own. What I really liked about this time around is that Nanami got a lot more done without Tomoe (which don't get me wrong, i love it when he helps her out) but it just showed Nanami's progression as a character. What I did think was a little confusing (thus reducing my score for this anime) was thatI thought that at the end of the anime, Nanami and Tomoe knew they both loved each other and where a couple...but it seems as if that didn't happen because Tomoe still tries to hide his feelings from Nanami and they aren't together in a relationship.\\n\\n\r\nArt 9/10\\n\r\nI'm a big fan of the art. I personally enjoyed it better than S1 art. To me personally, I felt like this art was more mature and S1 was more silly. I found the colors and the nice details to be visually stunning. Plus the characters are beautiful to look at. Especially Nanami and Tomoe (^o^). \\n\\n\r\nSound 9/10\\n\r\nI cannot stop humming and singing these OP and EP. As like the first season, I loved both the OP and EP, which is rare for me to say. I usually only like one or the other (usually the OP) or none at all but not in Kamisama's case. I loved both. Also the effects and the background music always seemed to be subtle yet right for the scene. I also think that the voice acting was great. \\n\\n\r\nCharacter 9/10\\n\r\nIn this season we were introduced to more characters and the characters that we already knew got more depth added to them (especially Kurama). I loved all (well most) of the new characters. Jiro was great, Kurama's story was great, Akura was fantastic (I wish we got more of him though but there's always the manga). I also loved the fact that not only did Nanami get a lot more of character development to her (especially in the last two episodes), but Tomoe did too. We got to see how much he has evolved as a characters especially when Akura was having those flashbacks about Tomoe and him and it transitions to Tomoe making \"Nanami's favorite hamburger\". I thought that scene was fabulous. \\n\\n\r\nEnjoyment 10/10\\n\r\nI'm not usually a supernatural fan but this anime had just enough for me to handle. I like it when show's have consistency in their \"supernatural-ness\" i.e. Avatar the Last Airbender/Legend of Korra and while this show SOMETIMES  has it it doesn't have it so bad to the point where I can't watch it but that's just something minor. I found myself more intrigued in this season than I had been in S1. Maybe it's because I watched this season as it aired versus the other one but I was always looking forward to next Monday to watch the next episode. Aside from that, we get so much more NanamixTomoe feels in like every episode which is a BIG plus for me. \\n\\n\r\nOveall 9/10\\n\r\nAlthough it's not my favorite anime, it is in my top 5. I really enjoyed so much about this show and I feel like we might get a third season. The colors, music, characters plot was just so enjoyable to watch. It was a great shoujo romance anime and I highly recommend it for people to watch/read. The second season does not disappoint and in my opinion, I actually feel like it was better than the first season. This anime was a blast to watch and will forever be a favorite of mine. Lets hope we get a season 3!!\\n\\n",
            "date": "2015-03-30T18:49:00+00:00",
            "helpful_count": 15,
            "mal_id": 184162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4418537.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AvatarKorra",
                "username": "AvatarKorra"
            },
            "url": "https://myanimelist.net/reviews.php?id=184162"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’m thankful to have both of my grandmothers still alive. One, though, lives in a nursing home. She has bad ankles, memory loss, and internal issues that prevent her from living a normal, “everyday” life in the home she’s always known. My wonderful mother always visits her, not just because that’s her own mom, but because it helps to defeat something that is an unfortunate byproduct. And that’s loneliness. We all experience it at some point; it’s a strange feeling that causes a longing for companionship of any kind, be it a close friend, a dearlover, or a thoughtful family member. Yet it’s really easy to cure. You can visit them personally like my mom, or you can call to talk, send a text, or even mail a letter to show that somebody out there is looking out for them. No matter the size of the gesture itself, simply “being” there for another person in there time of need has a profoundly, positive impact on his or her life. This is the idea that Kamisama Hajimemashita 2nd Season works with, presenting an anime that at least doesn’t make you feel lonely.\\n\\n\r\nSTORY\\n\\n\r\nKamisama Kiss 2 follows a short period after the events of the first season. Nanami is still a land god, Tomoe is her familiar, and the two find themselves embarking on more heavenly journeys together.\\n\\n\r\nWhat’s interesting about this second season is that it really only has two main focuses: this theme of loneliness and indirect character exploration (which will be discussed later). Loneliness is very strange. Like coldness, it’s simply thelack of something else. In this case, it happens to be relationships or connections we share with the people around us. It, by definition, implies a sense of longing, of wanting to have that which we don’t. Because most people don’t actively seek to be alone; it’s human nature to want to be with and surrounded by others. To this end, Kamisama Kiss 2 sets up each of its three arcs with loneliness in mind. These three plot lines revolve around: Akura-ou, Jiro and Kurama, and Nanami, respectively. But it’s not that the show simply brings up the topic, but how it explores this theme that makes it so purposeful. Specifically speaking, the anime does a nice job of showing what causes loneliness,how we deal with it, and ultimately how it is cured.\\n\\n\r\nAssuming loneliness is something that is unwanted, it’s not always caused by our own devices. More often than not, it’s something that manifests through outside influences. Each arc demonstrates this aptly: Akura-ou lost and was betrayed by his best friend; Kurama was bullied as a child; and Nanami was affected by unfortunate circumstances. There is a correlation between each example, that being it is others that force such lonely feelings on another. It’s ironic, really – it’s precisely the very aspect of life that these people need that has generated it in the first place. Jiro’s case is the same but different; he willingly pushed those around him away despite the comfort they could provide to his stern heart.\\n\\n\r\nJust as each person’s loneliness was brought about in its own way, the anime also shows how these same characters handle the feeling they acquired. For Akura-ou, he turns it into revenge and rage, not just towards the friend who crossed him but towards all others. In a way, he wants people to experience the same feelings of loss and loneliness that he has felt. Kurama instead chooses to create a mask of sorts to attract people. He had always been alone, so being able to entice others to follow or idolize him was something he had never known – and always wanted. And Nanami is special. Her mother passed away when she was little and her father was a chronic gambler. Whether by bad luck or terrible coincidence, she had nobody to turn to. But rather than hurting or seeking others, her happy and active personality kept her both optimistic and adaptable.\\n\\n\r\nIt turns out to be rather sad, seeing these characters succumbing to an emotion that leaves one feeling helpless or afraid. This is why the anime makes sure to alleviate these worries. Akura-ou, despite his anger, enjoys the niceties his “mother” directs towards him, proving that even the most evil of people revel in another’s company. Kurama had Suiro, the only other “tengu” to support him. Suiro’s physical saving of the boy wasn’t his greatest feat; it was being there to guide him when nobody else would. And while nowadays Nanami has her rambunctious crew to govern, Tomoe’s time spent with her kid-self implanted memories that trumped some of the more depressing ones. Her cure is a bit unrealistic, all things considered, but it hammers home a poignant statement: loneliness is not absolute. It can be defeated and it can be avoided; all that’s needed is a tiny bit of love.\\n\\n\r\nANIMATION\\n\\n\r\nThe art for Kamisama Kiss 2 remains relatively the same when compared to the first season. It’s usually soft, inviting the audience to relax in its sparkling backgrounds, fluffy locations, and serene environments. Other times, it gets drearier, with miasma-filled forests and darkened valleys. And it can go further still, providing locales fraught with danger, despondency, and despair. The blend of the godly settings with the more realistic ones is appropriately carried out, giving the anime a good sense of direction overall. On top of all this, the show also adopts a minimalist style that aides in making the comedy that much more hilarious.\\n\\n\r\nThe character designs, like the art, keep their consistency. Nanami is once again strangely beautiful. It isn’t her large eyes, full smile, and long brown hair that make her grab one’s attention – but these simple details definitely don’t hurt her – but rather this aura she has about her that makes her more womanly and refined than she tends to behave. Other regulars like Tomoe and Himemiko maintain their white attire and purple persona, respectively. And the newcomers receive the same attention to detail; Jiro’s green cloak and red-painted eyes make him out to be as menacing as he is, whereas Yatori’s massive hair, funny mask, and crazy pupils capture his ridiculousness quite well.\\n\\n\r\nWhen it comes to actual animation, it sits somewhere around average. Much of the show focuses on the characters, their conversations, and the thoughts they are having. Meaning, lots of sitting and near still-frames are had. There isn’t too much action, and even when it does occur, its regular running or walking segments.\\n\\n\r\nCHARACTERS\\n\\n\r\nIn the initial section, the notion of “indirect character exploration” was introduced. What does this mean? Essentially, the characters that Kamisama Kiss 2 sets its sights on might seem to be the ones gaining a lot of the focus. But in actuality, they use these characters to bolster those nearby – these close characters receive characterization and development indirectly through the ones that have the majority of the attention. This isn’t to say that the “bystanders” aren’t looked at individually; it’s that the indirect comparisons are stronger. Or to put it differently, they allow the viewer to see these characters in a roundabout perspective.\\n\\n\r\nAn obvious contender for this approach is Jiro. Kurama’s arc takes up about half of the season, and initially it seems as if he is the focus. But Kurama’s experiences – and indeed many of the other “tengus” encountered throughout this segment – work towards bolstering Jiro’s person. There are distinct parallels between Jiro’s and Kurama’s upbringing. Both were ridiculed for their general weakness, with both wanting to become stronger than they were. Suiro’s relationship towards Kurama was initially seen by Jiro as a mistake; that it only brought about pain. But he sees that such pain gave way to something greater: elation. For as was talked about, Jiro and Kurama at one point had no friends to call their own. So Jiro sees Suiro’s relationship with the young Kurama as something to be revered and not something to be shunned. The little “tengu” brothers further make him understand the abusive stance he’s taken. He witnesses that he treats these “weak” children exactly in the same manner as he had been treated years prior, causing him to question his own goals. And even Nanami influences him. While he saves her from the thunder-beast – more parallels between Kurama and Suiro – its him seeing this young, “heretic” of a woman protect that which he was not that motivates him to see both the literal and figurative light around him.\\n\\n\r\nA fascinating detail about this sequel is in who it’s actually about. The first focused on Nanami and her rise to god-hood, all the while toying with the romantic connection between her and Tomoe. Here, though, and hearkening back to the idea of “indirect character exploration,” this isn’t a season about Akura-ou, Jiro, or even Nanami. It’s in reality about Tomoe. Every arc has him more or less on the sidelines, but the events that take place and subsequently the characters’ exploration leads to his development. For example, through Akura-ou, we come to learn more about Tomoe’s unsavory past and eventual change of heart. He also (indirectly) forces Tomoe to question the same connection that was already established previously. Jiro provides his own form of mirroring, with Tomoe seeing the same, inner-turmoil in the winged man. And Nanami’s past elicits, perhaps coincidentally, childlike wonderment. Her first-ever backstory gives Tomoe the wherewithal to push their relationship towards a place that he truly wants it to go. Because despite all of his abrasive words towards his master, and aligning with the themes of the anime, Tomoe is lonely. Nobody understands or loves him – the gods fear his powers and his closest “friend” Mizuki constantly quarrels with him. Nobody, that is, besides Nanami. In other words, the entirety of Kamisama Kiss 2 was structured to get Tomoe primed and ready for the feelings he’s always wanted, and to leave behind the loneliness he’s felt for way too long.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme is quite dainty, with the flute, guitar, and vocalist creating more fun than it should. This keeps up for most of the song, even picking up in tempo and rhythm during the middle portions. Its conclusion ends on an oddly somber note, as an indication that the show isn’t just fun and games. And the motif on loneliness proves this without a doubt. The ending theme is very slow, contrasting with the OP with ease. Lyrically, it follows the theme of loneliness once more; the constant “Hello? Can you hear me?” phrase is similar to a call for help, to get someone to notice that he or she is there. It’s purposefully built, but the piece itself isn’t as catchy as its beginning counterpart.\\n\\n\r\nThe rest of the soundtrack is heavily influenced by the culture of the world Namani and co. find themselves in. “Korin! Okuninushimikoto” is a lovely piece, filled with powerful movements and strong emotion. “Chigiri…Futatabi?” is melancholic in its presentation, yet strangely hopeful in feeling. And “Sarani Shisso! Taima Kekkai” is entirely upbeat, coinciding with the show’s general happy tones. It’s a pleasant OST containing beautiful and fitting arrangements alike.\\n\\n\r\nVoice acting for the anime is somewhere around average. A special shout-out goes to Suzuko Mimori as Nanami for her womanly voice and determined way of speaking, no matter the situation.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one sits in a precarious position. It’s pretty funny at times; the character interactions are repetitive but usually managed to make me laugh. And Nanami herself is hysterical when she wants to be. At the same time, a lot of the drama didn’t do much for me. The loneliness theme is executed well, but I never felt worried or concerned for Akura-ou, Kurama, or Jiro. In other words, I never felt invested in what the anime had to offer.\\n\\n\r\nBeyond this, I found the romantic parts of the show to be sorely lacking. Part of this is due to Tomoe searching to understand his own self, but because of this, the show chooses to forego any sort of worthwhile relationship between him and Nanami, acting more as a regress than as development in the bond they seemingly share. However, there were some pretty interesting scenarios. Nanami accidentally getting into Tomoe’s bed was tense to watch whereas Nanami as a toddler and a child was way too adorable to see. The overall experience was pretty flat, but very specific moments like these didn’t make the show entirely boring to watch to completion.\\n\\n\r\nKamisama Hajimemashita 2nd Season performs at about the same level as its prequel. The narrative takes on loneliness to the best of its ability and the characters are developed in a peculiar way. But the alright animation and sound-work keep it from being something too good. There’s apparently still more to be said about the god and “yokai” pair, so hopefully any further continuations can capitalize on the foundations already crafted. If not, they really will become lonely.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, focuses on the theme of loneliness, exploring its causes, effects, and the ways in which it is defeated nicely enough\\n\\n\r\nAnimation: Fine, nice art style, good character designs, average actual animation\\n\\n\r\nCharacters: Good, Nanami and others see individual focus, but its Jiro’s and especially Tomoe’s indirect character exploration that matters most\\n\\n\r\nSound: Fine, okay OP, okay ED, good soundtrack, average VA work\\n\\n\r\nEnjoyment: Fine, nice comedy, unemotional drama, not enough romance, but very specific scenes make this season not wholly boring\\n\\n\r\nFinal Score: 6/10",
            "date": "2015-06-14T16:52:00+00:00",
            "helpful_count": 15,
            "mal_id": 190324,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=190324"
        },
        {
            "content": "this is nothing but cliche's, and plot holes with dry slap stick comedy and half assed romance(queue the laughter track). don't waste your time watching this stupid anime. it was simple and straight forward trash. i went into this hoping it would carry at least the mediocre content of the of the former and instead it drops all of the romantic development from the previous season and starts over again. as if we want to watch the same cringe inducing bantering that took them too long to realize their feelings all over again. the main charicter is pathetic and useless wearing obvious plot armor madeof enchanted diamonds. a summary of this anime: something bad happens, the main character says we should help, the supporting character says grr i don't want to, they slap each other a few times and then the support give in and they magically find a way to fix things. rinse and repeat.",
            "date": "2018-08-24T02:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 287255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TheRedGojo",
                "username": "TheRedGojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=287255"
        },
        {
            "content": "Well, I am so happy that they actually decided to do a season 2. The first review that I did was a bit too short. It is also a good way for me to sort of fix my review of the first season without actually having to go back and rewrite it. I noticed that I really didn’t explain well what I felt about this show. I do love watching this show and the characters are rather interesting, even more so in the new season then the last one. We get to see a lot more character development as well as backgrounds that were notexplained before. This makes me like the characters even more now that I can tell why they are the way they are. \\n\\n\r\nWe get a lot more info on Kurama and his family situation, on the inner workings of the gods and so on. Where the first one was more slice of life with supernatural elements, this one is more supernatural with slice of life elements. Instead of every episode being sort of episodic in nature, we have story arcs that last about three or four episodes before finally concluding. I like how this one also seems to have a ‘standard’ enemy that the characters should face instead of just random inconveniences that pop up every once in a while along with the everyday troubles of the human world. It gives the show a bit more stability to hang on to.\\n\\n\r\nNanami has also grown on me a bit, making me like her character a little more. She is getting stronger and stronger each day with her powers. The romance between her and Tomoe is also stronger but it sort of makes me want to bang my head against the desk as when Nanami is so open to her feelings about Tomoe, Tomoe on the other hand is just so stubborn and cold-hearted to her even when he figures out his own feelings. If he’s not truthful, she may end up with all the other suitors she has been collecting. And I mean many. Almost everywhere she goes, for some reason the really hard core mean boys end up falling for her slightly. \\n\\n\r\nThe animation is pretty much the same as the first one, meaning the good and the bad are the same. The artwork is dark in a colorful way but what I didn’t really say before was that the very light hearted bit of the show is bright with a lot of pastels. Again, it’s a nice contrast between the two worlds and the fact that each episode seems to get darker and darker as the story goes on adds to a build up that might be coming. I say might because I don’t want to spoil anything.\\n\\n\r\nThe English voices are the same as well and I’m not sure about what to add to what I said before. Again, Tatum does a amazing job as Tomoe, A very strong voice that also can be gentle when needed to be. Nanami talks way too much still but in this season, she seems to of grown on me or just has learned to not rattle off a ton of stuff. I kind of like this more ‘mature’ Nanami in that way as she grows with the show. There is actually much more growth in season two then in season one and I think that is why they sort of took the series and split it this way. I found there were also two OVA’s that were between this one and the first but at this time, I have not seen them yet so not sure if that had any base to her growth.\\n\\n\r\nTo sum it all up, I like the second season a bit more then the first. We had a lot more story and background to the characters but on the sad side, they opened a lot more questions that need to be answered. There wasn't an ending with this one like the first one seemed to have. The ending for the first series may have landed a bit flat but at least it did have an ending that I could consider a ending. This one ended with a lot more questions, especially on the main antagonist that they had.",
            "date": "2015-05-12T23:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 187714,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=187714"
        },
        {
            "content": "Okay. I have been watching lots of Anime recently. But my life changed completely when I started watching Kamisama Hajimemashita! \r\nI don't insist on telling what exactly but I got through lots of emotions while watching this incredible masterpiece. \r\nTomoe is by far my favourite character and his mystery kept me on the hook. His voice... his strange manners... his lady and mistress Nanami was also a pretty amazing character. It left me craving for more. I'm not te type to obsess over characters but I am by far obsessed with him! The anime has a lot of characters and you sooner or later getattached to them.\\n\\n\r\nThe story, art, sound, characters..... I can't find a flaw at all. \\n\r\nI only wish they didn't rush the last 4 episodes from Kako-hen. \\n\\n\r\nIF you really like deep and intense anime then you should definitely watch Kamisama Hajimemashita!",
            "date": "2017-03-05T08:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 241917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069087.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mervollo",
                "username": "mervollo"
            },
            "url": "https://myanimelist.net/reviews.php?id=241917"
        },
        {
            "content": "Kamisama Hajimemashita, or Kamisama Kiss is a Japanese manga series written and illustrated by Julietta Suzuki and serialized by Hakusensha in the shoujo manga magazine called ‘Hana to Yume.’ An anime television series adaptation of Kamisama Kiss was produced by ‘TMS Entertainment’ and directed by Akitaro Daichi (Fruits Basket, Kaleido Star). It began airing on October 1, 2012. There are also two OVA episodes, which first aired on August 26, 2013, bundled with the 16th volume of the manga. One of the included episodes is based on the story from the 15th volume, while the other contains an all-new original story. The 17th issue ofHakusensha's Hana to Yume magazine announced on August 2014 that the manga series inspired a second anime season, which began airing on January 5, 2015.\\n\\n\r\nMomozono Nanami is only 17 years old, but she has never felt lucky. She has quite an average academic progress and boys do not think that she is cute. She would love to fix her school problems and spare more time for the girls’ stuff, but she cannot do that, since her father is a big gambler, who always causes her daughter a ton of problems. Too bad, but her misfortune only continues: she is evicted from her apartment, because of her father’s debts. However, Nanami does not curse her misfortune. One day, she saves a good-looking young man in a park from a huge phobia he has; he is afraid of dogs. After a small talk, the young man listens to Nanami’s problems and offers her to live at his place, which he abandoned 20 years ago. In addition to this, he also kisses her on the forehead to express his gratitude. It turns out that Nanami is invited to live in a God’s shrine and that the young man that kissed her actually passed her the mark of the area’s deity. The unfortunate girl is no longer unfortunate, but her life has not gotten any easier, too. She now should take care of her academic progress, as well as of her deity’s duties. Kamisama Kiss Season 2 focuses more on Tomoe’s backstory and also continues the story of Momozono Nanami. This time Nanami will have to see other gods and undertake many challenges. \\n\\n\r\nStory wise, Kamikiss is still great. Many characters are being introduced, as well as their backstories. They all receive the needed character development and there is nothing I can criticize. Animation wise, it has become even better than season 1. However, one major and, perhaps, the only negative side of this anime is the fact that there is no continuation. No information on a possible season 3 has been published so far, and it has been almost 3 years already. So to make a long story short, if you are not a fan of manga, I would not recommend you to watch this anime, because most likely, there will never be season three. But I do not know for sure; no one does. That is why I want to make one thing clear: it is still a great romance story, I would even say ‘one of the best romance stories.’ And you can still find out about the ending by reading the manga adaption, which is even BETTER than the anime adaption of Kamisama Hajimemashita. If you are a fan of reading, Kamikiss is what you are looking for!\\n\\n\r\nOverall, not as breathtaking as season 1, but it is still is one of the greatest romance stories you will probably find.",
            "date": "2018-01-28T04:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 269884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6086058.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Scientiiaa",
                "username": "Scientiiaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=269884"
        },
        {
            "content": "for anyone who enjoys season 1, would definitely enjoy season 2 as well.\r\ni personally don't really enjoy the first season and thinking back, i could not remember much about the first season except the girl kept on having someone falls in love/have a crush on/confessed to her and the story development almost made me drop the series (it made me think ''ahh..is this another anime that had one girl surrounded by lots of guys and everyone liking her..blablabla..\") but i continued because the anime had humour and the characters expressions were funny..\r\nand so it took me this long to actually start watching and recently finishedwatching season 2. season 2 is great in my opinion because of the back story and thus showing characters development. this also exudes a promising 3rd season with all the stories the series have yet to tell and offer. not to mention, despite being only a 12 episode anime series, there are several events that happened in the series so you will not find the flow of the series mundane. the excitement andhumour does not wears off and you should be able to watch the series continuously.\\n\\n\r\nin short, the story is good and have great art with easy to your ears soundtracks..the characters also shows a lot of development and i want to know what will happen to them in the future. i enjoy the series enough to make me write a review (just because it changed my perception from the previous season) and would recommend this to anyone seeking that cute 'kyaa!' or 'awww, so sweet...' moment..",
            "date": "2015-12-13T12:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 205449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sloweater",
                "username": "sloweater"
            },
            "url": "https://myanimelist.net/reviews.php?id=205449"
        },
        {
            "content": "I was so happy when I saw that Kamisama had a second season. To start, I'm going to give a little advice. Make sure to watch the OVA if you haven't. Sometimes I will wait to watch the OVA's until after I finish the main series, but this one actually related to the main story line and introduced this season.\r\nStory - I really liked the story, it was a great continuation to the first season. To me, it really picked up on the relationship between Nanami and Tomoe. It also brought in a bunch of new characters and gave back stories to old ones! Theonly complaint was the ending. I hope there's a continuation of this season because it left some questions for me. Of course, going to the manga would answer all but I would hope they wouldn't end the anime series that way. Don't get me wrong it was a great ending, but I think it could have been improved. \\n\\n\r\nArt - I really enjoyed the art. I love how they designed all the characters and I didn't notice much change from season one.\\n\\n\r\nSound - I think the sound design is perfect for the anime. I'm happy they kept the same theme to it.\\n\\n\r\nCharacter - I liked the character development and it was nice to see more characters get back stories. There was also a reasonable amount of development of all the characters. The only thing that held me back was the number of episodes. It felt rushed to me and I wish it could have been expanded a bit more. But hey I didn't think there would be a second season so lets hope for the future.\\n\\n\r\nEnjoyment - I love this genre of anime, so it really made me happy watching it. If you watched the first season I would really recommend watching the second season. You will love it and  it will fly by. I had some free time and it literally took me less than a day to finish.... ;_;",
            "date": "2015-04-29T15:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 186788,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1387819.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/timedoctor",
                "username": "timedoctor"
            },
            "url": "https://myanimelist.net/reviews.php?id=186788"
        },
        {
            "content": "It's certainly not bad, but I have to say that the story in S2 of Kamisama Hajimemashita is all over the place.\r\nIt's very weird and feels rushed. Half of the episodes are more like stand-alones not tied to time and space, so it's hard to get a feel of when and where they happen. I'm sure they're all minuscule slices of the source manga, but being unfamiliar with said manga the adaptation just has this weird feeling of jumping all over the place.\r\nThe other half do form a longer arc, but even that has nothing in common with Season 1 and as such kinda comesout of the blue.\\n\\n\r\nAll in all this season is much less cohesive in story than S1, but that's not necessarily a bad thing, just unexpected.\\n\r\nOn the upside there are also way more gags which feels fitting, and also somewhat more romance.",
            "date": "2019-04-24T12:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 307060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6043370.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sadenia",
                "username": "sadenia"
            },
            "url": "https://myanimelist.net/reviews.php?id=307060"
        },
        {
            "content": "I give this anime an 8.5 overall. It's not my favourite series, but it is something I very much enjoy watching. This series is getting better and better, through each act. It could quite possibly become one of my favourites.. maybe..\r\n(edit: Has now become my favourite series of all time (: The OVAs sold me)\r\nStory: 8\r\nIts nothing AMAZING but I quite enjoy the Kamisama Hajimemashita world. I like the concept of it all and the drama and problems they run into never seem too forced to me. The romance is very great, especially this season, very swoon worthy and great development. \r\nArt: 9\r\nIs it justme or did the art get a lot better? Especially in the opening. The art just flows very well. It's very beautiful in my opinion and with a great range of color pallet. In the first season the use of the constant bubbly background was used far to often and would get annoying, but it died down a lot in this season. \\n\\n\r\nSound: 9\\n\r\nThe soundtrack is something I really like about this anime. I love the opening song at the start. There was also a song they included, that really made me happy to hear. I think the background music is pretty unique, its memorable for me.\\n\\n\r\nCharacter 9:\\n\r\nOnce again the characters are all amazing. They all make me laugh, especially Tomoe. I love this cast of characters a lot and enjoy seeing them interact with each other. Their interactions never cease to make laugh. Nanami goes through some pretty good development in this season, which I very much enjoyed seeing.\\n\\n\r\nEnjoyment: 8\\n\r\nLike I said this anime is my not favourite but its something I very much enjoy watching. It makes me laugh and there are even a couple of scenes that made me want to cry. \\n\\n\r\nOverall: 8.5\\n\r\nI do love this anime and I am very much looking forward to season 3 which I heard was coming out in December. I'm going to into reading the manga, since I do enjoy Kamisama Hajimemashita. It funny, adorable, very good story and continues to get better as the story goes along.",
            "date": "2016-06-18T03:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 221048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5255364.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jaedencex",
                "username": "jaedencex"
            },
            "url": "https://myanimelist.net/reviews.php?id=221048"
        },
        {
            "content": "Dear Fellow Otaku/ Anime Lovers, :3\r\nKamisama Kiss, was a great anime, for anyone who into guys with animal ears, reverse harems or loves the voice actor John Michael Tatum (Sebastian from Black Butler), I just tend to like this voice actor a lot more than a few more that I know. Okay back on tracked, I really do recommend this anime to everyone it' has a very good story plot, I love how it picked right off where they left off with the other part of the anime. I didn't get confused with the transition. I didn't get bored with it. I fell in lovewith the pairing of Tomoe and Nanami. I really do recommend watching this anime.",
            "date": "2017-03-22T07:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 243142,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5825028.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YuiFireDragneel",
                "username": "YuiFireDragneel"
            },
            "url": "https://myanimelist.net/reviews.php?id=243142"
        }
    ],
    [
        {
            "content": "Kamisama Hajimemashita was a really pretty and easy to watch anime. If you liked the first season, Kamisama Hajimemashita◎ did not disappoint at all; in fact, the romance portion got a little heavier, so all you romance lovers out there are sure to be saying \"d'aww\" at least three times an episode. I highly recommend it if you enjoyed S1.\r\nStory: 8\r\nThe story picks up right from where S1 ended, but it takes a bit of a break from Nanami \"learning how to be a Land God\" to more of a \"Nanami being a boss God\" approach. There are a ton of new characters, and reappearancesof older ones (i.e. Himemeko x Kotaro, the one and only Kurama, and Mizuki), making for a fairly diverse story line and change in direction. But it was a good change, so nothing was too stale.\\n\\n\r\nNanami delves deeper into her duties as a Land God, such as visits and becoming a stronger deity. When she's figuring this out, she still carries support from her faithful familiars, Tomoe and the adorable snake Mizuki. They fight, Nanami breaks it up, and they go on with their lives. While this is happening, a variety of plots unfold, all leading to Tomoe having successive epiphanies about his cheerful human goddess.\\n\\n\r\nCharacters: 9\\n\r\nThe new characters were all pretty funny and added a nice touch to the whole atmosphere of the show, even though some of their stories were left hanging, like Kirihito, Tomoe's old companion from his wild fox days. But we also got a deeper look into Kurama's character, which was a sweet bonus. \\n\\n\r\nAs for the main characters, Tomoe this season is ridiculously cute. Seriously, I could not get enough of him, with his revelations and inner monologue. There's actually a lot more focus on Tomoe this season as well, so you get more time to understand his thoughts, which was a good addition. And Nanami was still the same oblivious and happy-go-lucky Nanami as last season, but perhaps a bit more mature and refined as a deity. \\n\\n\r\nYes, she continues her funny antics, like creating Mamoru, the adorable monkey child, who is added to the list of \"Things/People that Antagonize Tomoe\". But hey, that only serves to bring joy to us viewers, right? XP To sum it all up, character development was as strong this season as much as the last, if not more so.\\n\\n\r\nArt: 8\\n\r\nOkay, here's where it got a little different. With season one having 7 producers and season two having 3, the art style definitely took a turn. It wasn't bad at all; but it was really easy to tell the contrast. The colors are still charming and pleasant, but the style is a little simpler and there are a ton of close-ups each episode. As in, like 30 per episode. It wasn't exactly annoying, but it was a tad abundant for me. For the rest, I had no complaints. Still the same characters and designs we know and love.\\n\\n\r\nSound: 8\\n\r\nThe artist Hanae has provided both seasons of Kamisama Hajimemashita with adorable and awesome OPs and EDs, and I love it. The songs are cute and dancey, but they still tie in with the whole atmosphere of the show. Can't really complain, they just work. Also, I felt like the background music they used was very effective in each scene they used to get across the tone of the situation. It was nothing too fancy, but it was still satisfying. \\n\\n\r\nEnjoyment: 9\\n\r\nI realize I have been comparing S1 and S2 a whole lot this entire time, but don't get me wrong, Kamisama Hajimemashita is a solid show. Heck, S1 is in my favorites. S2 was just as good, and probably even better if you're just here for a ton of googly-eyeing. Which, I was, not gonna lie.\\n\\n\r\nThe romance definitely got a lot stronger, as well as the story, and characters. There was so much cuteness in this show, and it did not fail to continue that legacy in this season. I went through episodes at a madman's pace, and I'm pretty sad that it's over already. :(\\n\\n\r\nOverall: 8.5\\n\r\nAbsolutely watch this if you are having any doubts. This is by no means one of those shows with a terrible S2. Really, this season was nearly on par with the first, which makes it rather awesome and a good watch. If for no other reason, watch for Tomoe. Hey, I won't judge. Much.",
            "date": "2015-03-30T14:38:00+00:00",
            "helpful_count": 57,
            "mal_id": 184133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4401035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sunnierskies",
                "username": "sunnierskies"
            },
            "url": "https://myanimelist.net/reviews.php?id=184133"
        },
        {
            "content": "Shojo manga series by Julietta Suzuki that adapted once again into anime after it first season, Kamisama Hajimemashita. The first season left some curiosities to the audience who enjoys romance genre about “what will happen between the main characters after this?” Well, the answer might be found in this second season. But, I can’t guarantee that you’ll find all of those answers in it either. So, it would be better just watch it for yourself and you will know what I meant.\r\n(SPOILER ALERT)\r\n(*) Story\r\nThe story remains around our main characters, let’s just say “the girl and the fox” who continue their life in Mikage’s templeafter several of supernatural events in the first season happened and affect their relationship with each other very well into some kind of “more-love-interest” relationship. The first season starts with the character’s past and main conflict that goes on until pops up some supporting characters who help fill the sensation, mood and the story itself to be life and joy. But, we’re not gonna talk about the first season in here. So, still. according to that, just don’t confuse when you see the beginning episode of the second season starts with scary vision and dark red color background which apparently a dream belongs to a white-pale but cool guy that just wake up from his sleep. You’ll need to memorize the last episode of the first season to know who is that character. But, don’t worry if you lazy to watch it again because you’ll see a “familiar introduction” after that (just like in the first season) and you’ll know who that is when you watching this anime completely.  Well, back to the main topic, the story consist of two parts in one episode. Those parts linked to one another and they give sign about it with some “free pic” (I called it because I always save the pic whenever they show up haha, so it is “free”) which is similar to most other anime. In this season, there’s different seasoning than the first, for an example like the problem solving of the conflict that I thought it would spend a long time to be solved but it solved with some simple idea. I didn’t say that was bad, but what can I say? It’s so supernatural, everything could happen. Or I guess they need to hurry the solving part to match or catch up the amount of episode of this anime which I suggest they need to plus the amount of it to do it just like I thought. But, despite it, I think the story was good enough, I like the writer’s idea whenever there’s romance scene that somehow manage to balanced the comedy which makes me feel the essence and the character’s feeling about themselves or the events that they’ve been through. The ending was absurd, that makes sense because the pace and new character that shows up. They need more episode to make it epic “if” this is their last anime adaptation. (I hope not!) But, it’s not that bad to watch it till the end. It’s romantic, it’s hilarious, it’s supernature and fantastical, it describes how love could grow between a human and a yokai. I would say that is “very touching and makes my heart melted”.\\n\\n\r\n(*) Art\\n\r\nThe art was good. It’s certainly nailed it to bring the romance and peaceful aura to the audience. It fits the story although I hope they could detail the background to help the story a little. But, I don’t mind about that. Because I believe there’s limit in everyone’s skill and we should respect other’s work. It’s unique in a good way and actually, I found that I fond of the character’s art. All with the background effects, filler and especially the chibi or funny looking expression that often shows up.\\n\\n\r\n(*) Sound\\n\r\nSuzuko Mimori’s voice suits Nanami well. I loved it, especially whenever she shouts and mad on Tomoe because some kind of simple or serious problems she had with him. And the character voice of Tomoe is even better. I could say that Shinnosuke Tachibana has succeeded to cast Tomoe from the first season and I bet he especially nailed it for drawing attention to female’s audience out there to watch this anime too. And don’t forget about the other’s character voice actor like Daisuke Kishio (Kurama), Nobuhiko Okamoto (Mizuki), Junichi Suwabe (Akura-oh), Horie Yui (Himemiko), Akira Ishida (Mikage) and many others, they have succeeded too. I will not protest about them. They’re professional and they absolutely “nailed” it! For the OP and ED theme, I’d like to say that it’s fair enough. The singer as same as the first season. It’s good and cute to hear. Talking about the back sounds, I…. really loved them. They hit the feel, the situation and help the story serving a lot to the audience. My favorite back sound was the sound that historical but peaceful when there’s some meaningful scene that shows up.\\n\\n\r\n(*) Character\\n\r\nThere’s new characters that show up in this second season. For an example like Akura-oh (Tomoe’s partner from the past) who enjoys caused destruction through all over the world or Jirou (the fourth chief of Kurama Mountain) that suddenly turns into a memorable yet important for several episodes (you’ll understand when you watch it) and many others. They have unique characteristic and amazing looks too that make my brain memorize them. Besides that, I like how Nanami develops her character even more in this season (through her past or her attitude towards some problems that makes her skill of spiritual power level up) and I like how she could handle her feeling towards Tomoe. I see her courage even more rather than the first season and by that, I can tell that her character was well-developed. For Tomoe, he changed to care for Nanami a lot rather than usual, he more often to jealous, sulking, teasing and see Nanami differently especially after the last episode when he saw Nanami’s past. And he did realize what he actually feel towards Nanami in this season. I would say that their both character develop as same as their feeling to one another. I love the quotes too especially the quote that Mikage said to Nanami about “the taboo love between human and yokai”.\\n\\n\r\n(*) Enjoyment\\n\r\nI enjoy watching this. I can’t believe it for myself either but it is enjoyable. For several times, the director and the writer had succeeded to draw curiosities and cut episode when there’s surprising event. I hate whenever they did that, but as long as it worth to watch, why not? As it ended, I just hoped that the last episode was not the last of it.\\n\\n\r\nIn conclusion, “all of you who likes romance or rom-com story genre would be best to watch this anime right now”. Kamisama Hajimemashita (Season 2) it’s worth to watch, funny, heartwarming and I found it amazingly enjoyable (haha). Well, I suggest you watch the first season before watching this one.",
            "date": "2015-12-30T11:08:00+00:00",
            "helpful_count": 33,
            "mal_id": 207310,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4719047.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Akafection",
                "username": "Akafection"
            },
            "url": "https://myanimelist.net/reviews.php?id=207310"
        },
        {
            "content": "Story (8):\r\nThe second season of kamisama hajimemashita contain Tomoe's past and the feelings that Tomoe has for his lady and mistress, Nanami. Like many other stories it's about a female girl who's poor life soon turns into a rowdy one filled with friends (as most of you already know this is mentioned in season 1) Season two is about the female lead, Nanami, meeting new gods and finally taking charge and developing into the proper Land Goddess. It has romance, comedy, and drama. The second season has many new settings, characters, music and moments where you'd laugh.\r\nArt(8): \r\nThe art is the same as the firstseason, at least to me. Since this is a light hearted anime the colors are all pretty and go with the anime. It's pretty too look at with the light colors here and there. The details are also great, but they seemed to be less exact than the first season. This though didn't ruin the experience. \\n\\n\r\nSound(9):\\n\r\nI think the OP and ending are better than the first season. Reason why is because it's more up beat and goes with the anime. You have no idea how many times I ended up singing the OP at random times. \"Kamisama no kamisama\" by Hanae starts out with a flute which will already get you in the mood. (Laughs while remembering Mizuki trying to play the flute) The endings you want to watch the next episode because of the cliffhangers and cause of the song.\\n\\n\r\nCharacters(10):\\n\r\nNot only was there Nanami, Mizuki, Tomoe, and the shrines servants, but manyyy more amazing characters got introduced. The antagonist was introduced, Kurama's past was discovered which led to even more awesome characters. It was a character boatload!!\\n\r\nEvery character was awesome in their own way and you'd always want to see more of them. Even the antagonist. The quarrels between Tomoe and Mizuki over Nanami and over stupid little things always made me laugh. You can never get enough of these two. In my opinion, I think the character development and new characters was my favorite part of the entire second season.\\n\\n\r\nEnjoyment(9):\\n\r\nI could never get enough of this. Ever since I finished watching the first season I've wanted more and I finally got it. I was so overjoyed when I started to watch the second season. Since it was ongoing when I watched I hated the fact that I had to wait a week to see the next episodes. Them cliffhangers are suspenseful!\\n\\n\r\nOverall(9):\\n\r\nEven though it ended I still want more. *fingers crossed* hopefully there will be a season 3. Season 2 was better than season 1 in my opinion. Season 2 Op is more upbeat, has a handful of new characters(adorable ones too!), and I liked seeing the past of some of the main characters. I felt like I knew them even more than in season 1.",
            "date": "2015-03-30T16:08:00+00:00",
            "helpful_count": 29,
            "mal_id": 184145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4003033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xANIMExGEEKx",
                "username": "xANIMExGEEKx"
            },
            "url": "https://myanimelist.net/reviews.php?id=184145"
        },
        {
            "content": "To be honest, this show always had always been a sort of epitome for what shoujo is. The characteristics, backgrounds, and general premise all points to the direction of what the franchise has tried to be. And from the first season, it capitalized on every opportunity to craft shoujo. Season 2 isn’t far different by experiences as it will feel just like the first season. What that means is another charming trip with our supernatural familiar friends and the all adorable Nanami once again.\r\nOut of any show that got the news of receiving a season 2 in 2014, this one hit the mark. It tookme by surprise when the sequel was announced especially since it just popped out of nowhere. Make no mistake though. This sequel is something I welcome with open arms. Titled “Kamisama Hajimemashita◎”, the season 2 assumes that you have completed the first season. As it begins directly from where it left off, viewers should be familiar of what they may expect. \\n\\n\r\nThe show hardly changes from where it had been from the beginning. There’s the familiars, humans, and society that are enveloped by a host of shoujo generics. But for what’s worth, the first few episodes crafts a more independent nature in Nanami. She’s here to prove herself and in fact takes action by attending a Divine Assembly, a meeting between Gods. Being a human herself, one can imagine how she will stand out as the “It Girl”. However, taking a close glance will show that Nanami has established herself as a strong spirited woman. She relies on almost no one and tries to become a better God while fulfilling her sacred duty. As such, this season focuses a lot more on story content rather than romance. The first half of the show easily sends this message as the series focuses on characterization. Not just for Nanami in this case but her partner Tomoe also gets a decent amount of spotlight. There are also some cryptic imagery regarding his past that viewers may be curious of.\\n\\n\r\nBecause the story context become a rather tense focus, we also have conflicts brewing as well. Mysterious characters such as Kirihito will get viewers wondering about his motivations, goals, and role in this season. Furthermore, there’s a bit of interpersonal problems with our main characters as well. For Nanami, we get the idea that she is trying to become a better God but she still has some doubts here and there. Then, there’s Tomoe who finally seems to realize the depth of his feelings. But what do we get in return? Some cliché romance delivery where neither seems to tie the knot. What that means is that there’s a whole load of teasing but nothing in the end is resolved for their romance. I can’t say this is exactly surprising with shoujo content. It usually takes time for this to develop and the first season portrayed that quite clearly with its romance angles. But as for this show, romance itself should be a more prominent term. It’s like a heart of this show that needs to pump (almost literally in a way) to get the show moving. Sometimes, this season does that cleverly and other time moves back to square one For what’s worth, season 2 relies much more on its story context rather than romance focus.\\n\\n\r\nDespite this, the second season still has that soft feeling of charming elegance. Some episodes has that slice of life feel combined with shoujo themes. And while most of this is hardly original, it creates the essence of a satisfying shoujo. Adaptation wise, the show retains its comedy and drama. Most of the comedy is lighthearted with the expressive tones and scenarios that can be taken to heart. To say the least, this show always balances itself when it comes to all of its plot elements. From the cryptic imagery, dialogue, and plot developments to character building, this sequel is more or less of shoujo story book. Each page adds more context to some parts of the story while focusing on certain characters. In fact, Tomoe and Nanami aren’t just the only main characters we get to know more. There’s other prominent figures such as Kurama and Jiro that we get a nice bite out of their past lives. In retrospect, the franchise’s characters all stand out in some way along with this delicate story wrapped by shoujo.\\n\\n\r\nTechnical production in regards to the artwork remains generally the same for the sequel. Nothing has changed in regards to the world fiction of this series. It’s marvelous and can even be breathtaking at times to see the difference between the spiritual and human world. In particular, the Netherworld brings a different mood to this charming shoujo. Character designs remains generally the same for all the main characters. While we do get some new cute characters such as a monkey familiar, hardly anything else has changed. Nanami does have a more independent nature in her for this season though as she becomes more determined than ever to become a better God. The expressive emotions she delivers gives credibility to quite just that.\\n\\n\r\nSoundtrack is mostly decent by standards. Sadly, it’s not really a strength for this season. OST still has that serene-like feeling although not memorable enough to leave a strong impression. On the other hand, the OP/ED songs has a really sharp focus with its shoujo style. Of course, we can’t forget the main characters who are able to express their thoughts and feelings with their voices. While nothing is largely memorable by experience, it’s still charming to watch the characters act out in their roles. By voice content, it is satisfying.\\n\\n\r\nAt some point in this season, it won’t be a surprise to realize that the sequel drives its story by pushing its plot elements. While the first season has an intuitive focus on romance, this season takes the steering wheel to go with the context of the story. But there are still room for romance because every shoujo focuses a bit more on that. For what’s worth, Kamisama Hajimemashita◎ stands out as a way to show how much Nanami has changed from the beginning. The relationships she has with others is still a good focus in this season with its interpersonal perspectives. It has a convincing nature with everything it sets up from Nanami’s will to become a better God and to Tomoe’s realization of what he feels towards Nanami. Be prepared for a ride that blurs the line between humans and Gods.",
            "date": "2015-03-30T16:45:00+00:00",
            "helpful_count": 27,
            "mal_id": 184148,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=184148"
        },
        {
            "content": "Story 8/10\r\nThe story picks up right where S1 left off. Nanami has now learned her duties as a god and now we see her applying her knowledge. The story is as you would expect it to be: she encounters challenges and works to fix them on her own. What I really liked about this time around is that Nanami got a lot more done without Tomoe (which don't get me wrong, i love it when he helps her out) but it just showed Nanami's progression as a character. What I did think was a little confusing (thus reducing my score for this anime) was thatI thought that at the end of the anime, Nanami and Tomoe knew they both loved each other and where a couple...but it seems as if that didn't happen because Tomoe still tries to hide his feelings from Nanami and they aren't together in a relationship.\\n\\n\r\nArt 9/10\\n\r\nI'm a big fan of the art. I personally enjoyed it better than S1 art. To me personally, I felt like this art was more mature and S1 was more silly. I found the colors and the nice details to be visually stunning. Plus the characters are beautiful to look at. Especially Nanami and Tomoe (^o^). \\n\\n\r\nSound 9/10\\n\r\nI cannot stop humming and singing these OP and EP. As like the first season, I loved both the OP and EP, which is rare for me to say. I usually only like one or the other (usually the OP) or none at all but not in Kamisama's case. I loved both. Also the effects and the background music always seemed to be subtle yet right for the scene. I also think that the voice acting was great. \\n\\n\r\nCharacter 9/10\\n\r\nIn this season we were introduced to more characters and the characters that we already knew got more depth added to them (especially Kurama). I loved all (well most) of the new characters. Jiro was great, Kurama's story was great, Akura was fantastic (I wish we got more of him though but there's always the manga). I also loved the fact that not only did Nanami get a lot more of character development to her (especially in the last two episodes), but Tomoe did too. We got to see how much he has evolved as a characters especially when Akura was having those flashbacks about Tomoe and him and it transitions to Tomoe making \"Nanami's favorite hamburger\". I thought that scene was fabulous. \\n\\n\r\nEnjoyment 10/10\\n\r\nI'm not usually a supernatural fan but this anime had just enough for me to handle. I like it when show's have consistency in their \"supernatural-ness\" i.e. Avatar the Last Airbender/Legend of Korra and while this show SOMETIMES  has it it doesn't have it so bad to the point where I can't watch it but that's just something minor. I found myself more intrigued in this season than I had been in S1. Maybe it's because I watched this season as it aired versus the other one but I was always looking forward to next Monday to watch the next episode. Aside from that, we get so much more NanamixTomoe feels in like every episode which is a BIG plus for me. \\n\\n\r\nOveall 9/10\\n\r\nAlthough it's not my favorite anime, it is in my top 5. I really enjoyed so much about this show and I feel like we might get a third season. The colors, music, characters plot was just so enjoyable to watch. It was a great shoujo romance anime and I highly recommend it for people to watch/read. The second season does not disappoint and in my opinion, I actually feel like it was better than the first season. This anime was a blast to watch and will forever be a favorite of mine. Lets hope we get a season 3!!\\n\\n",
            "date": "2015-03-30T18:49:00+00:00",
            "helpful_count": 15,
            "mal_id": 184162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4418537.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AvatarKorra",
                "username": "AvatarKorra"
            },
            "url": "https://myanimelist.net/reviews.php?id=184162"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’m thankful to have both of my grandmothers still alive. One, though, lives in a nursing home. She has bad ankles, memory loss, and internal issues that prevent her from living a normal, “everyday” life in the home she’s always known. My wonderful mother always visits her, not just because that’s her own mom, but because it helps to defeat something that is an unfortunate byproduct. And that’s loneliness. We all experience it at some point; it’s a strange feeling that causes a longing for companionship of any kind, be it a close friend, a dearlover, or a thoughtful family member. Yet it’s really easy to cure. You can visit them personally like my mom, or you can call to talk, send a text, or even mail a letter to show that somebody out there is looking out for them. No matter the size of the gesture itself, simply “being” there for another person in there time of need has a profoundly, positive impact on his or her life. This is the idea that Kamisama Hajimemashita 2nd Season works with, presenting an anime that at least doesn’t make you feel lonely.\\n\\n\r\nSTORY\\n\\n\r\nKamisama Kiss 2 follows a short period after the events of the first season. Nanami is still a land god, Tomoe is her familiar, and the two find themselves embarking on more heavenly journeys together.\\n\\n\r\nWhat’s interesting about this second season is that it really only has two main focuses: this theme of loneliness and indirect character exploration (which will be discussed later). Loneliness is very strange. Like coldness, it’s simply thelack of something else. In this case, it happens to be relationships or connections we share with the people around us. It, by definition, implies a sense of longing, of wanting to have that which we don’t. Because most people don’t actively seek to be alone; it’s human nature to want to be with and surrounded by others. To this end, Kamisama Kiss 2 sets up each of its three arcs with loneliness in mind. These three plot lines revolve around: Akura-ou, Jiro and Kurama, and Nanami, respectively. But it’s not that the show simply brings up the topic, but how it explores this theme that makes it so purposeful. Specifically speaking, the anime does a nice job of showing what causes loneliness,how we deal with it, and ultimately how it is cured.\\n\\n\r\nAssuming loneliness is something that is unwanted, it’s not always caused by our own devices. More often than not, it’s something that manifests through outside influences. Each arc demonstrates this aptly: Akura-ou lost and was betrayed by his best friend; Kurama was bullied as a child; and Nanami was affected by unfortunate circumstances. There is a correlation between each example, that being it is others that force such lonely feelings on another. It’s ironic, really – it’s precisely the very aspect of life that these people need that has generated it in the first place. Jiro’s case is the same but different; he willingly pushed those around him away despite the comfort they could provide to his stern heart.\\n\\n\r\nJust as each person’s loneliness was brought about in its own way, the anime also shows how these same characters handle the feeling they acquired. For Akura-ou, he turns it into revenge and rage, not just towards the friend who crossed him but towards all others. In a way, he wants people to experience the same feelings of loss and loneliness that he has felt. Kurama instead chooses to create a mask of sorts to attract people. He had always been alone, so being able to entice others to follow or idolize him was something he had never known – and always wanted. And Nanami is special. Her mother passed away when she was little and her father was a chronic gambler. Whether by bad luck or terrible coincidence, she had nobody to turn to. But rather than hurting or seeking others, her happy and active personality kept her both optimistic and adaptable.\\n\\n\r\nIt turns out to be rather sad, seeing these characters succumbing to an emotion that leaves one feeling helpless or afraid. This is why the anime makes sure to alleviate these worries. Akura-ou, despite his anger, enjoys the niceties his “mother” directs towards him, proving that even the most evil of people revel in another’s company. Kurama had Suiro, the only other “tengu” to support him. Suiro’s physical saving of the boy wasn’t his greatest feat; it was being there to guide him when nobody else would. And while nowadays Nanami has her rambunctious crew to govern, Tomoe’s time spent with her kid-self implanted memories that trumped some of the more depressing ones. Her cure is a bit unrealistic, all things considered, but it hammers home a poignant statement: loneliness is not absolute. It can be defeated and it can be avoided; all that’s needed is a tiny bit of love.\\n\\n\r\nANIMATION\\n\\n\r\nThe art for Kamisama Kiss 2 remains relatively the same when compared to the first season. It’s usually soft, inviting the audience to relax in its sparkling backgrounds, fluffy locations, and serene environments. Other times, it gets drearier, with miasma-filled forests and darkened valleys. And it can go further still, providing locales fraught with danger, despondency, and despair. The blend of the godly settings with the more realistic ones is appropriately carried out, giving the anime a good sense of direction overall. On top of all this, the show also adopts a minimalist style that aides in making the comedy that much more hilarious.\\n\\n\r\nThe character designs, like the art, keep their consistency. Nanami is once again strangely beautiful. It isn’t her large eyes, full smile, and long brown hair that make her grab one’s attention – but these simple details definitely don’t hurt her – but rather this aura she has about her that makes her more womanly and refined than she tends to behave. Other regulars like Tomoe and Himemiko maintain their white attire and purple persona, respectively. And the newcomers receive the same attention to detail; Jiro’s green cloak and red-painted eyes make him out to be as menacing as he is, whereas Yatori’s massive hair, funny mask, and crazy pupils capture his ridiculousness quite well.\\n\\n\r\nWhen it comes to actual animation, it sits somewhere around average. Much of the show focuses on the characters, their conversations, and the thoughts they are having. Meaning, lots of sitting and near still-frames are had. There isn’t too much action, and even when it does occur, its regular running or walking segments.\\n\\n\r\nCHARACTERS\\n\\n\r\nIn the initial section, the notion of “indirect character exploration” was introduced. What does this mean? Essentially, the characters that Kamisama Kiss 2 sets its sights on might seem to be the ones gaining a lot of the focus. But in actuality, they use these characters to bolster those nearby – these close characters receive characterization and development indirectly through the ones that have the majority of the attention. This isn’t to say that the “bystanders” aren’t looked at individually; it’s that the indirect comparisons are stronger. Or to put it differently, they allow the viewer to see these characters in a roundabout perspective.\\n\\n\r\nAn obvious contender for this approach is Jiro. Kurama’s arc takes up about half of the season, and initially it seems as if he is the focus. But Kurama’s experiences – and indeed many of the other “tengus” encountered throughout this segment – work towards bolstering Jiro’s person. There are distinct parallels between Jiro’s and Kurama’s upbringing. Both were ridiculed for their general weakness, with both wanting to become stronger than they were. Suiro’s relationship towards Kurama was initially seen by Jiro as a mistake; that it only brought about pain. But he sees that such pain gave way to something greater: elation. For as was talked about, Jiro and Kurama at one point had no friends to call their own. So Jiro sees Suiro’s relationship with the young Kurama as something to be revered and not something to be shunned. The little “tengu” brothers further make him understand the abusive stance he’s taken. He witnesses that he treats these “weak” children exactly in the same manner as he had been treated years prior, causing him to question his own goals. And even Nanami influences him. While he saves her from the thunder-beast – more parallels between Kurama and Suiro – its him seeing this young, “heretic” of a woman protect that which he was not that motivates him to see both the literal and figurative light around him.\\n\\n\r\nA fascinating detail about this sequel is in who it’s actually about. The first focused on Nanami and her rise to god-hood, all the while toying with the romantic connection between her and Tomoe. Here, though, and hearkening back to the idea of “indirect character exploration,” this isn’t a season about Akura-ou, Jiro, or even Nanami. It’s in reality about Tomoe. Every arc has him more or less on the sidelines, but the events that take place and subsequently the characters’ exploration leads to his development. For example, through Akura-ou, we come to learn more about Tomoe’s unsavory past and eventual change of heart. He also (indirectly) forces Tomoe to question the same connection that was already established previously. Jiro provides his own form of mirroring, with Tomoe seeing the same, inner-turmoil in the winged man. And Nanami’s past elicits, perhaps coincidentally, childlike wonderment. Her first-ever backstory gives Tomoe the wherewithal to push their relationship towards a place that he truly wants it to go. Because despite all of his abrasive words towards his master, and aligning with the themes of the anime, Tomoe is lonely. Nobody understands or loves him – the gods fear his powers and his closest “friend” Mizuki constantly quarrels with him. Nobody, that is, besides Nanami. In other words, the entirety of Kamisama Kiss 2 was structured to get Tomoe primed and ready for the feelings he’s always wanted, and to leave behind the loneliness he’s felt for way too long.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme is quite dainty, with the flute, guitar, and vocalist creating more fun than it should. This keeps up for most of the song, even picking up in tempo and rhythm during the middle portions. Its conclusion ends on an oddly somber note, as an indication that the show isn’t just fun and games. And the motif on loneliness proves this without a doubt. The ending theme is very slow, contrasting with the OP with ease. Lyrically, it follows the theme of loneliness once more; the constant “Hello? Can you hear me?” phrase is similar to a call for help, to get someone to notice that he or she is there. It’s purposefully built, but the piece itself isn’t as catchy as its beginning counterpart.\\n\\n\r\nThe rest of the soundtrack is heavily influenced by the culture of the world Namani and co. find themselves in. “Korin! Okuninushimikoto” is a lovely piece, filled with powerful movements and strong emotion. “Chigiri…Futatabi?” is melancholic in its presentation, yet strangely hopeful in feeling. And “Sarani Shisso! Taima Kekkai” is entirely upbeat, coinciding with the show’s general happy tones. It’s a pleasant OST containing beautiful and fitting arrangements alike.\\n\\n\r\nVoice acting for the anime is somewhere around average. A special shout-out goes to Suzuko Mimori as Nanami for her womanly voice and determined way of speaking, no matter the situation.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one sits in a precarious position. It’s pretty funny at times; the character interactions are repetitive but usually managed to make me laugh. And Nanami herself is hysterical when she wants to be. At the same time, a lot of the drama didn’t do much for me. The loneliness theme is executed well, but I never felt worried or concerned for Akura-ou, Kurama, or Jiro. In other words, I never felt invested in what the anime had to offer.\\n\\n\r\nBeyond this, I found the romantic parts of the show to be sorely lacking. Part of this is due to Tomoe searching to understand his own self, but because of this, the show chooses to forego any sort of worthwhile relationship between him and Nanami, acting more as a regress than as development in the bond they seemingly share. However, there were some pretty interesting scenarios. Nanami accidentally getting into Tomoe’s bed was tense to watch whereas Nanami as a toddler and a child was way too adorable to see. The overall experience was pretty flat, but very specific moments like these didn’t make the show entirely boring to watch to completion.\\n\\n\r\nKamisama Hajimemashita 2nd Season performs at about the same level as its prequel. The narrative takes on loneliness to the best of its ability and the characters are developed in a peculiar way. But the alright animation and sound-work keep it from being something too good. There’s apparently still more to be said about the god and “yokai” pair, so hopefully any further continuations can capitalize on the foundations already crafted. If not, they really will become lonely.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, focuses on the theme of loneliness, exploring its causes, effects, and the ways in which it is defeated nicely enough\\n\\n\r\nAnimation: Fine, nice art style, good character designs, average actual animation\\n\\n\r\nCharacters: Good, Nanami and others see individual focus, but its Jiro’s and especially Tomoe’s indirect character exploration that matters most\\n\\n\r\nSound: Fine, okay OP, okay ED, good soundtrack, average VA work\\n\\n\r\nEnjoyment: Fine, nice comedy, unemotional drama, not enough romance, but very specific scenes make this season not wholly boring\\n\\n\r\nFinal Score: 6/10",
            "date": "2015-06-14T16:52:00+00:00",
            "helpful_count": 15,
            "mal_id": 190324,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=190324"
        },
        {
            "content": "this is nothing but cliche's, and plot holes with dry slap stick comedy and half assed romance(queue the laughter track). don't waste your time watching this stupid anime. it was simple and straight forward trash. i went into this hoping it would carry at least the mediocre content of the of the former and instead it drops all of the romantic development from the previous season and starts over again. as if we want to watch the same cringe inducing bantering that took them too long to realize their feelings all over again. the main charicter is pathetic and useless wearing obvious plot armor madeof enchanted diamonds. a summary of this anime: something bad happens, the main character says we should help, the supporting character says grr i don't want to, they slap each other a few times and then the support give in and they magically find a way to fix things. rinse and repeat.",
            "date": "2018-08-24T02:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 287255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TheRedGojo",
                "username": "TheRedGojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=287255"
        },
        {
            "content": "Well, I am so happy that they actually decided to do a season 2. The first review that I did was a bit too short. It is also a good way for me to sort of fix my review of the first season without actually having to go back and rewrite it. I noticed that I really didn’t explain well what I felt about this show. I do love watching this show and the characters are rather interesting, even more so in the new season then the last one. We get to see a lot more character development as well as backgrounds that were notexplained before. This makes me like the characters even more now that I can tell why they are the way they are. \\n\\n\r\nWe get a lot more info on Kurama and his family situation, on the inner workings of the gods and so on. Where the first one was more slice of life with supernatural elements, this one is more supernatural with slice of life elements. Instead of every episode being sort of episodic in nature, we have story arcs that last about three or four episodes before finally concluding. I like how this one also seems to have a ‘standard’ enemy that the characters should face instead of just random inconveniences that pop up every once in a while along with the everyday troubles of the human world. It gives the show a bit more stability to hang on to.\\n\\n\r\nNanami has also grown on me a bit, making me like her character a little more. She is getting stronger and stronger each day with her powers. The romance between her and Tomoe is also stronger but it sort of makes me want to bang my head against the desk as when Nanami is so open to her feelings about Tomoe, Tomoe on the other hand is just so stubborn and cold-hearted to her even when he figures out his own feelings. If he’s not truthful, she may end up with all the other suitors she has been collecting. And I mean many. Almost everywhere she goes, for some reason the really hard core mean boys end up falling for her slightly. \\n\\n\r\nThe animation is pretty much the same as the first one, meaning the good and the bad are the same. The artwork is dark in a colorful way but what I didn’t really say before was that the very light hearted bit of the show is bright with a lot of pastels. Again, it’s a nice contrast between the two worlds and the fact that each episode seems to get darker and darker as the story goes on adds to a build up that might be coming. I say might because I don’t want to spoil anything.\\n\\n\r\nThe English voices are the same as well and I’m not sure about what to add to what I said before. Again, Tatum does a amazing job as Tomoe, A very strong voice that also can be gentle when needed to be. Nanami talks way too much still but in this season, she seems to of grown on me or just has learned to not rattle off a ton of stuff. I kind of like this more ‘mature’ Nanami in that way as she grows with the show. There is actually much more growth in season two then in season one and I think that is why they sort of took the series and split it this way. I found there were also two OVA’s that were between this one and the first but at this time, I have not seen them yet so not sure if that had any base to her growth.\\n\\n\r\nTo sum it all up, I like the second season a bit more then the first. We had a lot more story and background to the characters but on the sad side, they opened a lot more questions that need to be answered. There wasn't an ending with this one like the first one seemed to have. The ending for the first series may have landed a bit flat but at least it did have an ending that I could consider a ending. This one ended with a lot more questions, especially on the main antagonist that they had.",
            "date": "2015-05-12T23:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 187714,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=187714"
        },
        {
            "content": "Okay. I have been watching lots of Anime recently. But my life changed completely when I started watching Kamisama Hajimemashita! \r\nI don't insist on telling what exactly but I got through lots of emotions while watching this incredible masterpiece. \r\nTomoe is by far my favourite character and his mystery kept me on the hook. His voice... his strange manners... his lady and mistress Nanami was also a pretty amazing character. It left me craving for more. I'm not te type to obsess over characters but I am by far obsessed with him! The anime has a lot of characters and you sooner or later getattached to them.\\n\\n\r\nThe story, art, sound, characters..... I can't find a flaw at all. \\n\r\nI only wish they didn't rush the last 4 episodes from Kako-hen. \\n\\n\r\nIF you really like deep and intense anime then you should definitely watch Kamisama Hajimemashita!",
            "date": "2017-03-05T08:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 241917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069087.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mervollo",
                "username": "mervollo"
            },
            "url": "https://myanimelist.net/reviews.php?id=241917"
        },
        {
            "content": "Kamisama Hajimemashita, or Kamisama Kiss is a Japanese manga series written and illustrated by Julietta Suzuki and serialized by Hakusensha in the shoujo manga magazine called ‘Hana to Yume.’ An anime television series adaptation of Kamisama Kiss was produced by ‘TMS Entertainment’ and directed by Akitaro Daichi (Fruits Basket, Kaleido Star). It began airing on October 1, 2012. There are also two OVA episodes, which first aired on August 26, 2013, bundled with the 16th volume of the manga. One of the included episodes is based on the story from the 15th volume, while the other contains an all-new original story. The 17th issue ofHakusensha's Hana to Yume magazine announced on August 2014 that the manga series inspired a second anime season, which began airing on January 5, 2015.\\n\\n\r\nMomozono Nanami is only 17 years old, but she has never felt lucky. She has quite an average academic progress and boys do not think that she is cute. She would love to fix her school problems and spare more time for the girls’ stuff, but she cannot do that, since her father is a big gambler, who always causes her daughter a ton of problems. Too bad, but her misfortune only continues: she is evicted from her apartment, because of her father’s debts. However, Nanami does not curse her misfortune. One day, she saves a good-looking young man in a park from a huge phobia he has; he is afraid of dogs. After a small talk, the young man listens to Nanami’s problems and offers her to live at his place, which he abandoned 20 years ago. In addition to this, he also kisses her on the forehead to express his gratitude. It turns out that Nanami is invited to live in a God’s shrine and that the young man that kissed her actually passed her the mark of the area’s deity. The unfortunate girl is no longer unfortunate, but her life has not gotten any easier, too. She now should take care of her academic progress, as well as of her deity’s duties. Kamisama Kiss Season 2 focuses more on Tomoe’s backstory and also continues the story of Momozono Nanami. This time Nanami will have to see other gods and undertake many challenges. \\n\\n\r\nStory wise, Kamikiss is still great. Many characters are being introduced, as well as their backstories. They all receive the needed character development and there is nothing I can criticize. Animation wise, it has become even better than season 1. However, one major and, perhaps, the only negative side of this anime is the fact that there is no continuation. No information on a possible season 3 has been published so far, and it has been almost 3 years already. So to make a long story short, if you are not a fan of manga, I would not recommend you to watch this anime, because most likely, there will never be season three. But I do not know for sure; no one does. That is why I want to make one thing clear: it is still a great romance story, I would even say ‘one of the best romance stories.’ And you can still find out about the ending by reading the manga adaption, which is even BETTER than the anime adaption of Kamisama Hajimemashita. If you are a fan of reading, Kamikiss is what you are looking for!\\n\\n\r\nOverall, not as breathtaking as season 1, but it is still is one of the greatest romance stories you will probably find.",
            "date": "2018-01-28T04:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 269884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6086058.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Scientiiaa",
                "username": "Scientiiaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=269884"
        },
        {
            "content": "for anyone who enjoys season 1, would definitely enjoy season 2 as well.\r\ni personally don't really enjoy the first season and thinking back, i could not remember much about the first season except the girl kept on having someone falls in love/have a crush on/confessed to her and the story development almost made me drop the series (it made me think ''ahh..is this another anime that had one girl surrounded by lots of guys and everyone liking her..blablabla..\") but i continued because the anime had humour and the characters expressions were funny..\r\nand so it took me this long to actually start watching and recently finishedwatching season 2. season 2 is great in my opinion because of the back story and thus showing characters development. this also exudes a promising 3rd season with all the stories the series have yet to tell and offer. not to mention, despite being only a 12 episode anime series, there are several events that happened in the series so you will not find the flow of the series mundane. the excitement andhumour does not wears off and you should be able to watch the series continuously.\\n\\n\r\nin short, the story is good and have great art with easy to your ears soundtracks..the characters also shows a lot of development and i want to know what will happen to them in the future. i enjoy the series enough to make me write a review (just because it changed my perception from the previous season) and would recommend this to anyone seeking that cute 'kyaa!' or 'awww, so sweet...' moment..",
            "date": "2015-12-13T12:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 205449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sloweater",
                "username": "sloweater"
            },
            "url": "https://myanimelist.net/reviews.php?id=205449"
        },
        {
            "content": "I was so happy when I saw that Kamisama had a second season. To start, I'm going to give a little advice. Make sure to watch the OVA if you haven't. Sometimes I will wait to watch the OVA's until after I finish the main series, but this one actually related to the main story line and introduced this season.\r\nStory - I really liked the story, it was a great continuation to the first season. To me, it really picked up on the relationship between Nanami and Tomoe. It also brought in a bunch of new characters and gave back stories to old ones! Theonly complaint was the ending. I hope there's a continuation of this season because it left some questions for me. Of course, going to the manga would answer all but I would hope they wouldn't end the anime series that way. Don't get me wrong it was a great ending, but I think it could have been improved. \\n\\n\r\nArt - I really enjoyed the art. I love how they designed all the characters and I didn't notice much change from season one.\\n\\n\r\nSound - I think the sound design is perfect for the anime. I'm happy they kept the same theme to it.\\n\\n\r\nCharacter - I liked the character development and it was nice to see more characters get back stories. There was also a reasonable amount of development of all the characters. The only thing that held me back was the number of episodes. It felt rushed to me and I wish it could have been expanded a bit more. But hey I didn't think there would be a second season so lets hope for the future.\\n\\n\r\nEnjoyment - I love this genre of anime, so it really made me happy watching it. If you watched the first season I would really recommend watching the second season. You will love it and  it will fly by. I had some free time and it literally took me less than a day to finish.... ;_;",
            "date": "2015-04-29T15:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 186788,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1387819.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/timedoctor",
                "username": "timedoctor"
            },
            "url": "https://myanimelist.net/reviews.php?id=186788"
        },
        {
            "content": "It's certainly not bad, but I have to say that the story in S2 of Kamisama Hajimemashita is all over the place.\r\nIt's very weird and feels rushed. Half of the episodes are more like stand-alones not tied to time and space, so it's hard to get a feel of when and where they happen. I'm sure they're all minuscule slices of the source manga, but being unfamiliar with said manga the adaptation just has this weird feeling of jumping all over the place.\r\nThe other half do form a longer arc, but even that has nothing in common with Season 1 and as such kinda comesout of the blue.\\n\\n\r\nAll in all this season is much less cohesive in story than S1, but that's not necessarily a bad thing, just unexpected.\\n\r\nOn the upside there are also way more gags which feels fitting, and also somewhat more romance.",
            "date": "2019-04-24T12:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 307060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6043370.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sadenia",
                "username": "sadenia"
            },
            "url": "https://myanimelist.net/reviews.php?id=307060"
        },
        {
            "content": "I give this anime an 8.5 overall. It's not my favourite series, but it is something I very much enjoy watching. This series is getting better and better, through each act. It could quite possibly become one of my favourites.. maybe..\r\n(edit: Has now become my favourite series of all time (: The OVAs sold me)\r\nStory: 8\r\nIts nothing AMAZING but I quite enjoy the Kamisama Hajimemashita world. I like the concept of it all and the drama and problems they run into never seem too forced to me. The romance is very great, especially this season, very swoon worthy and great development. \r\nArt: 9\r\nIs it justme or did the art get a lot better? Especially in the opening. The art just flows very well. It's very beautiful in my opinion and with a great range of color pallet. In the first season the use of the constant bubbly background was used far to often and would get annoying, but it died down a lot in this season. \\n\\n\r\nSound: 9\\n\r\nThe soundtrack is something I really like about this anime. I love the opening song at the start. There was also a song they included, that really made me happy to hear. I think the background music is pretty unique, its memorable for me.\\n\\n\r\nCharacter 9:\\n\r\nOnce again the characters are all amazing. They all make me laugh, especially Tomoe. I love this cast of characters a lot and enjoy seeing them interact with each other. Their interactions never cease to make laugh. Nanami goes through some pretty good development in this season, which I very much enjoyed seeing.\\n\\n\r\nEnjoyment: 8\\n\r\nLike I said this anime is my not favourite but its something I very much enjoy watching. It makes me laugh and there are even a couple of scenes that made me want to cry. \\n\\n\r\nOverall: 8.5\\n\r\nI do love this anime and I am very much looking forward to season 3 which I heard was coming out in December. I'm going to into reading the manga, since I do enjoy Kamisama Hajimemashita. It funny, adorable, very good story and continues to get better as the story goes along.",
            "date": "2016-06-18T03:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 221048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5255364.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jaedencex",
                "username": "jaedencex"
            },
            "url": "https://myanimelist.net/reviews.php?id=221048"
        },
        {
            "content": "Dear Fellow Otaku/ Anime Lovers, :3\r\nKamisama Kiss, was a great anime, for anyone who into guys with animal ears, reverse harems or loves the voice actor John Michael Tatum (Sebastian from Black Butler), I just tend to like this voice actor a lot more than a few more that I know. Okay back on tracked, I really do recommend this anime to everyone it' has a very good story plot, I love how it picked right off where they left off with the other part of the anime. I didn't get confused with the transition. I didn't get bored with it. I fell in lovewith the pairing of Tomoe and Nanami. I really do recommend watching this anime.",
            "date": "2017-03-22T07:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 243142,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5825028.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YuiFireDragneel",
                "username": "YuiFireDragneel"
            },
            "url": "https://myanimelist.net/reviews.php?id=243142"
        }
    ]
]