[
    [
        {
            "content": "What's up MAL community, here I am bringing you another review about how bad something is.  Seriously this one deserves a bad review.\r\nIsuca is quite possibly the worst anime I have ever seen like of all time.  I know my review of Absolute Duo painted that series as bad but this one makes that show look like a masterpiece.\r\nBy now you all probably know what this show is about thanks to the effort of those who actually tried to write a review without wanting to puke so I won't get into the details, I'm just going to tell you why you shouldn't bother.\r\nStory- 1\\n\\n\r\nThe story seems like it is nothing but recycled retools of series that already exist and is mashed together into one anime that is supposed to make you appreciate the verse.  Take Kekkaishi, elements of supernatural harems like DxD or Shinmai (and I make this comparison very loosely), the importance of kissing like from Sekirei and gore that doesn't make sense as to why it is censored and that is basically Isuca in a nutshell with a shotty plot. But really, there is no story.\\n\\n\r\nArt - 4\\n\\n\\n\r\nThe art manages to skate by but only so much as to make this tragedy only slightly visually appearing.\\n\\n\r\nSound - 5\\n\\n\r\nThe soundtrack is okay but there isn't really anything in terms of sound that makes this anime even remotely memorable\\n\\n\r\nCharacter - 1\\n\\n\r\nThe main heroine is supposed to be some head of a clan but she takes so much shit for just existing that you wonder why she doesn't just tell everyone to off themselves.  The main male is like a super hesitant dense ass fuck with no balls and he seems completely useless unless he becomes a plot device.  There is no real character growth either so the characters pretty much stay the same throughout.  Also, there is like a copy of Origami from Date A Live in this series: emotionless and ready to rape the MC at any moment she can but ironically is like the best character to me.\\n\\n\r\nEnjoyment - 1\\n\\n\r\nIf I remotely enjoyed this series, it lasted for a solid second.\\n\\n\r\nOverall - 1\\n\\n\r\nA harem that isn't really a harem that has no real substance for a story and makes you question why money was wasted on something like this.  Isuca is the worst anime of 2015 and watching makes you want to drill a nail in your head or something.  All in all, do not waste your time.",
            "date": "2015-03-27T11:37:00+00:00",
            "helpful_count": 109,
            "mal_id": 183627,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3071063.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/DedPanda",
                "username": "DedPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=183627"
        },
        {
            "content": "\"Masterpiece\" is what I would describe anything else compared to Isuca. I felt like the time I wasted watching this show was better off watching paint dry or some other nonsense I could come up with. This is something you need to stay away from. The writing will make you cringe because of how cheesy it is, the animation is horrid, and characters are just disgraceful and pathetic. \r\nStory (2/10): The plot is nonsensical and downright redundant. It had the grounds to be a somewhat decent plot, yet all their creativity was used to instead put the main character in ridiculous and perverted situations. Thestory itself was easy to follow, it wasn't a jumbled mess, but rather the plot was executed so poorly that you just seem to lose all interest.\\n\\n\r\nArt/Sound (3/10): The Animation was pathetic, just by the opening of how Asano pulls out his sword, you instantly know that the animation would be jagged. If I were to give this show any props it would be the animation. That just means that's how high the standard would ever be, in the lowly disappointing range. The sound was equally as bad. The OST was dead to me, none of it even clicked while I was watching this show. That could also just be that my brain was working so hard to understand why I was wasting my time on something as horrendous as this. \\n\\n\r\nCharacter (3/10): Instead of giving you an in depth analysis of each characters, just take all the generic harems you've ever watched, and remember how those specific characters were. Chances are they are infinitely better than any character this show has to offer. There is one character though that stuck to me like a leach, and that was Tamako. I could write an entire essay and you still would not be able to fully grasp my frustration about this character. I love cat girls as much as the next guy, but this is someone that will annoy you to no end. \\n\\n\r\nEnjoyment (0/10) - Usually, to escape the harsh realities of doing work or anything productive for that matter, I go and watch anime. This show made me want to write a 10 page thesis on how grass grows. The only reason I did not drop this show is due to the fact that I'm a completionist and it would bother me that I wasn't able to finish it. In the end it was sheer willpower that kept me going. If you do want to suffer and watch this show, I recommend that you lower your expectations and your brain capacity to the point where anything can be considered interesting. That is the only way to finish this disaster.\\n\\n\r\nOverall (2/10): As I stated before, you will find it more intriguing to watch paint dry. Go outside or take a bath, just stay away from this show. It might be good if you're into the Ecchi genre, but why bother? I'm willing to bet that a Hentai out there has a better plot, character, animation, etc.",
            "date": "2015-04-07T21:15:00+00:00",
            "helpful_count": 75,
            "mal_id": 185112,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Elegade",
                "username": "Elegade"
            },
            "url": "https://myanimelist.net/reviews.php?id=185112"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nMany people growing up, at one point or another, encounter a situation in which they have to “prove their worth.” Sometimes it’s small, like performing well on the job to earn a raise. Sometimes it’s huge, like saving someone from a fatal accident. But no matter the severity or the situation, accomplishing such a moment makes that guy or girl grow into an overall better person. And even if they don’t achieve their goal, the experience earned gives them the necessary tools to hopefully make that next opportunity one that’s more positive than the last. Isucatries to work with this heartfelt message, but it turns out it can’t prove its worth since it’s worth nothing to begin with.\\n\\n\\n\r\nSTORY\\n\\n\r\nIsuca follows Shinichirou Asano, a young high school boy who happens to cross paths with a girl named Sakuya Shimazu. Through a series of events, it’s revealed that Shinichirou has the ability to give others spiritual energy through kissing and that Isuca fights demons, leading the two on a quest of self-worth.\\n\\n\r\nWhere does one begin? Isuca has far and away one of the worst narratives ever conceived in anime form. One of theseveral reasons for this is the show’s inability to carry its drama or plot points from one episode to the next. Most anime have either one overarching story that covers the events that take place, a few arcs that hold relevancy between them, or a series of literal episodic tales. Isuca’s initial downfall is trying to mix these all together. The overarching story makes absolutely zero sense because it goes all over the place. Sakuya has daddy issues, her extended family is looking to out her, her cousin is vying for her leader position; there are so many small ideas at play that never seem to resolve, let alone go anywhere worthwhile. What’s worse is that the show even refuses to utilize its own, established plot points. The two largest grievances are the ending and Sakuya’s “true name.” The former leaves everything open, causing one to come to the realization that nothing happened besides our two main characters coming together. The latter isn’t even used; “Isuca” is Sakuya’s “true name,” which allows her to be controlled by the person who knows it. But it’s used one time and referenced once after the initial discovery. If the anime is given its title by such a device, one would think that it would hold some modicum of importance. But no, Isuca stunningly avoids its own namesake.\\n\\n\r\nThe problems continue when looking at each individual episode, rather than the entirety of the series. There are essentially three issues here: the lack of “cause and effect,” the monster formula, and the fan-service. Starting with the largest problem of the three, Isuca, like its total narrative, doesn’t do anything with what happens between episodes. In essence, each episode acts as its own arc, with whatever events that happen to take place in one episode not transitioning to the next (with the exception of the last two episodes). In other words, Isuca tries to tell ninedifferent “stories” at once. But due to their inability to affect one another, it comes off as completely incoherent. These “stories,” though, don’t even stand by themselves. Each becomes a “monster-of-the-week” style, which can be fine if executed nicely. Except here, the exact same events take place: group shows up, Isuca can never defeat the demon, and Shinichirou kisses her to give the energy needed to win. It’s repetitive and pointless. And just to add insult to injury, the fan-service is incredibly weak when it is relied upon. Like the formula, fan-service isn’t automatically bad if it’s done right. But here, not only is it censored at every turn but what is given – dissolving clothes, some underwear shots, a few breasts, etc. – lacks originality, is always lame, and often unattractive to see.\\n\\n\r\nThe only “theme” Isuca tries to work with is the one presented in the introduction: “proving one’s worth” to better their person. Besides being lost among the disjointed storytelling and horrible fan-service, it doesn’t make sense. Sakuya wants to demonstrate her powers to both her cousin and the rest of her family due to her “outcast” status and due to her currently holding the top spot. But hearkening back to the repetitive formula, Sakuya always needs Shinichirou’s help – his literal “kiss of life.” That is, she never has the opportunity to “prove her worth” to anyone let alone herself because Shinichirou’s always the one to do the saving. And even when she does get the chance, she’sforbidden from trying her tactics again. The anime literally prevents its own theme from being looked at in favor of the couple kissing one another intermittently. Based on this and the long list of negatives, Isuca’s narrative, simply put, has no redeeming qualities with which to speak of.\\n\\n\r\nANIMATION\\n\\n\r\nIsuca doesn’t continue its downward spiral, because that would imply that it started off rather high. Instead, the show began digging its own grave, with the hole steadily getting deeper the further one goes.\\n\\n\r\nIsuca’s art is as bland as it looks. The locations visited are often devoid of detail, taking on a dreary persona to match the “evil” atmosphere that is generated. Prominently, the show takes place at Sakuya’s mansion, the school, and at random locations that hold no relevancy. Despite being a mansion, it seems to “only” have two rooms: the living room and the kitchen, because nothing else is shown. As for the school, it’s as generic looking as any other. Beyond this, the camera direction isn’t anything to marvel at and everyone involved has an extremely limited set of moves to use – Suseri, Sakuya’s cousin, seems to use one move for the majority of the anime – which brings about less variation and therefore style.\\n\\n\r\nAs if it needs to be said, the character designs are rather poor. The only notable person is Sakuya; her long blonde hair, red, blue, and gold outfit, her hair ribbon, and especially her striking green eyes help her to stand out in a sea of mediocrity. The rest of the cast is found in this sea: Shinichirou is painfully plain, Suseri has abnormally large breasts along with her ridiculous haircut, and the evil mage wears all white while touting a silly witch’s staff.\\n\\n\r\nAnd when the show tries to make everything move, it fails at doing so. A lot of the action that takes place isn’t so much action as it is cardboard cutouts moving across the screen. At most, you’ll see a few arrows flying here and a ferret twirling there, but that’s the extent to which Isuca sees actual animation. In most other cases, the characters are standing around, talking to one another with their poorly detailed designs and their generic backgrounds.\\n\\n\r\nCHARACTERS\\n\\n\r\nIsuca’s grave-digging continues with its cast, where there is nobody of consequence or purpose when the series concludes, let alone while it is progressing.\\n\\n\r\nThe extent of Sakuya’s characterization is so minimal, that’s it’s surprising that she was given one of the top spots within the anime. Her dialogue consists of mainly two phrases: “Shinichirou!” and “Shut up!” Often times, they’re used in tandem. But regardless of when or how many times they are used, that’s it. There is some information given in regards to her father and mother whose marriage apparently ostracized Sakuya when she was smaller. But her plight doesn’t contain any sense of drama due to the aforementioned show’s inability to resolve anything. Conflicts such as Suseri’s quarreling, the rest of the family’s objections, and whoever her father actually is do not amount to anything, therefore making her character’s “development” hold no weight. And many of Sakuya’s issues are directlycaused by her own personality; she’s incredibly standoffish, rude, and angry towards others. This is most likely due to her outing from an early age and her need to, as has been discussed, “prove her worth” in front of everyone. She acts immature and only opens up to Shinichirou very slightly. But not only is it not enough to warrant importance but it holds no relevancy to the issues surrounding her, making her character absolutely useless.\\n\\n\r\nSpeaking of Shinichirou, he’s arguably the “best” character within the anime for the simple reason that he’s the most normal. While he has this odd ability to give others spiritual energy, in relation to everyone’s arrows, spells, and dolls, from the outside he seems like any regular dude. He isn’t overpowered, he isn’t interesting, and he isn’t there for any other reason than he’s “a nice guy.” He starts off this way and ends this way, without undergoing any sort of development over the course of the show. He’s relatable because he’s grounded to reality. Yet, without a quirk of his own or experiencing any sort of change throughout the anime, he’s unbelievably stagnant as a character. There’s almost nothing too say about him because he’s so simple of a person.\\n\\n\r\nAnd regardless of who else you look at, they’re as equally useless or so insignificant that there’s next to nothing to say about any of them. Tamako’s development happens over the course of ten minutes within the first episode, from somewhat evil to obsessively servant-like. Suseri’s emotionless ways prevent her from interacting with any of the characters in a meaningful manner. Nadeshiko, the professor, acts as Sakuya’s pseudo-mother and only provides assistance near the end of the anime, and even then she contributes nothing whatsoever. And the “evil” Isuca harbors some unexplained hatred towards Sakuya and her family – it’s hinted at, but without any clear indication or investigation to her character besides her showing up, performing magic, and shouting a lot, the audience doesn’t learn anything about her besides her one-dimensional despising. The entire cast, from Isuca to Isuca, is an amalgamation of horribleness that clearly indicates the anime’s total ineptitude.\\n\\n\r\nSOUND\\n\\n\r\nAt this point, the grave is filled and the tombstone is being rolled in.\\n\\n\r\nBoth the opening and ending themes are generic beyond imagining and contribute nothing to the show’s overall purpose. The OP is named “Never Say Never.” It’s supposed to be about Sakuya and the others never giving up on the problems they face, but it’s drowned out by the simple beat and loud sound effects. And when listening to the ED, it’s supposed to be this “cool” arrangement. But with Isuca’s “mustache” being funny due to how silly it is, and the rest of the track’s unmemorable tone and singing, it isn’t cool but in fact lame.\\n\\n\r\nThe rest of the soundtrack is simply there as background filler. There exist “fun” tracks during the naked, fan-service moments, battle-hardened pieces that accompany the “action” that takes place, and tense music that plays when dealing with the demons. But in similar fashion to the OP and ED, it’s either extremely generic or entirely forgettable.\\n\\n\r\nLikewise, the voice-acting involved is somewhere below average, with no special shout-outs to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis anime is astonishing in its capability to fall flat at whatever it is that it’s doing. The show tries to be funny, but it isn’t. As already mentioned, the fan-service is deplorable, with no amount of kissing being able to save it. The fighting that occurs against the demons is boring, the dramatic moments are a slog, the characters are worthless, the execution is nonexistent, the music is insanely not worth listening to, and the narrative is so bad that’s a phenomenon that it managed to have as many episodes as it did in the first place.\\n\\n\r\nWhile nobody attended Isuca’s own funeral, here’s what its headstone reads: “Here lies Isuca, one of the worst anime of all time.”\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, incoherent plot, unresolved ideas, repetitive in nature, uninspired fan-service, and self-inflicted thematic loss\\n\\n\r\nAnimation: Terrible, bad art style, ridiculous character designs, below average actual animation\\n\\n\r\nCharacters: Terrible, nobody is worthwhile or developed in the slightest\\n\\n\r\nSound: Terrible, bad OP, bad ED, forgettable soundtrack, below average VA work\\n\\n\r\nEnjoyment: Terrible, not comedic, not dramatic, not fun, with nothing of value being found\\n\\n\r\nFinal Score: 1/10",
            "date": "2015-05-13T03:55:00+00:00",
            "helpful_count": 49,
            "mal_id": 187723,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=187723"
        },
        {
            "content": "Anime adaptations of manga or light novels make up most of what one would see in any given anime season.  With these adaptations, several results can appear.  1.  A series will get a perfect adaptation of the source material and get good feedback.  2.  A series can resemble the source material to the extent of its being still good.  3.  Screw the source material, just do whatever you want, and reap what you sow.  Isuca...follows choice #3.\r\nStory (5.00/10): The story of Isuca follows a boy named Shinichiro, a boy who wishes to seek out a part-time jobin order to unburden his family to a certain degree by supporting himself.  Upon asking one of his teachers for a job, he then gets assigned a housekeeping job for a household that is more of a pigsty than anything.  It is here where he meets Sakuya, the owner of the house, sending him into the world of Youkai, magic, and spirits in a job where he never gets paid.\\n\\n\r\nAt first glance, Isuca does have some promising things to be had.  Utilizing the fish out of water style of storytelling with our main protagonist being thrown into an unknown situation, one could expect something decent, right?  Well, not really.  To put it bluntly, Isuca fails to do the thing that all anime adaptations are meant to do upon creation, follow the source material.  Having read the actual Isuca manga, this 10 episode crapfest fails to even resemble the series that it was based off to any sort of degree aside from pointing out the more important points in the series.  \\n\\n\r\nThe entire show can basically be summed up like so.  A random, evil Youkai threatens the city, people, sometimes many people die in a horrible fashion, the main female protagonist bitches about having to do things herself even when she clearly can't do anything alone, defeat the youkai after lots of hardship and refusal, evil troll villain laughs at the main characters and leaves without doing anything, scene.  Rather than building upon the actual story of the series, this anime adaptation follows a more episodic style of storytelling which really doesn't work at all simply because every episode is more or less the same thing without any variation.  It's pretty much just different Youkai attacking our main characters every episode with little to no plot progression.  And that right there is just the beginning of this show's problems.\\n\\n\r\nIn addition, the series fails to tie up any loose ends.  As far as I'm aware, an anime that is only 10 episodes long either fails, or does not do well simply because of the lack of time.  Isuca follows this awful tradition by not being able to solve any of the series's issues.  Because the series tried to slowly feed in a plotline that requires answers, Isuca failed to really explain what exactly was going on in the series.  We're hinted at who the main antagonist of the series is, but we don't actually get to know or learn who he is.  There is no character explanation for that, and that really drives home how bad of a series this is.   \\n\\n\r\nOverall, Isuca was a shining example how not to create an anime adaptation.  Aside from not following the plotline of the original series and going off to do whatever it wanted, Isuca didn't really end on a note that was satisfying.  It doesn't solve any questions, it doesn't resolve anything, and the series just kinda...ends without really anything happening.  \\n\\n\r\nOverview:\\n\r\n+  Good story idea  (This was the reason I got into this series in the first place)\\n\r\n-   Awful execution\\n\r\n-   Too many loose ends\\n\r\n-   resembles little to the source material\\n\\n\r\nCharacters (3.49/10): While the story itself was something that left to be desired, the characters of this series simply just BEG to be criticized.  \\n\\n\r\nFirst up, Sakuya Shimazu.  Oh boy...another tsundere, short, flat-chested girl.  I totally haven't seen that before...  Moving on, Sakuya is the title character of this series, (which really should be a red flag), who is both Shinichiro's boss as her house is the one being cleaned, and classmate.  As someone who is part of the Shimazu family, Sakuya has the ability to utilize a magical bow in order to perform exorcisms, essentially having the Youkai who wander around the world \"pass on\" as they say.  While a main female of a tsundere troupe is something that we've seen again, and again, and again, Sakuya manages to break that in the WORST WAY POSSIBLE.  Compared to other tsundere characters, Sakuya manages to lean towards a tsuntsun personality, where she simply just doesn't show any soft side.  Any time she's in a fight, she does whatever she wants without any word or warning, and pays the price for going off alone recklessly.  It is with this unbreakable will of hers that comes off a character that is much hated by fans of the series because she lacks any sort of common sense and treats everyone as someone who is below her.  In fact, even the characters hate her, with practically every character pointing out her flaws time and time again in the series.  You know that whenever other characters point out one character's awful personality, he/she is an awful person.  \\n\\n\r\nAnd then we have Shinichiro, the fish out of water character in this story.  As someone who throws himself into the world of exorcisms, Shinichiro makes out to be the nice guy troupe, earning dokis from some girls in the series, while also not really having a personality to himself.  The entire series, Shinichiro plays the chivalry card, demanding that he protect and help Sakuya throughout the entire run of the series.  (Honestly, I don't get how he can do that given how she treats him.  It's like a slave pact in that household.)  He throws himself into the same situations as Sakuya, making himself to look like a \"hero\" of sorts while also not really doing anything cause he can't use magic.  So, useless MC.  \\n\\n\r\nApart from these two, the rest of cast show themselves to not only be more interesting than the main characters, but more developed in some sense.  The biggest example is Suseri as the series progresses with the slight character development that pushes her to be overall, a better character.  While side characters didn't really serve much of a purpose beyond being \"the crew\" that aided the main protagonists, they were still overall, much more likable than the main cast.  (A couple great characters, particularly the grandmother were never really used, and that really sucks for this series.)  \\n\\n\r\nBut the real killer I felt for the series aside from the demon spawn that is Sakuya, is the main antagonist of the series.  For one thing, the true main antagonist never really shows up.  This really puts a big hit on the series because as the audience, we don't really understand the goals of the antagonist or why he's doing anything.  Hell, we don't even know his name.  Instead though, we get a character known only as Isuca as the \"main antagonist\". (And no, while her name is the title of this show, she is not really a main character.)  The entire series more or less revolves around Isuca's antics as she sends random Youkai to attack people, swearing vengeance on the humans that she hates so much, a fact that you will never forget because she spouts out that shtick every 30 seconds of screentime.  Long story short, the antagonists are very underdeveloped and their motives are never learned, thus leading to the massive plot holes that are left by the end of the series.\\n\\n\r\nOverview:\\n\r\n+  Decent side characters\\n\r\n-   Completely unlikable main female\\n\r\n-   Generic MC\\n\r\n-   Antagonists are underdeveloped without any real character motives\\n\\n\r\nArt and Sound (5.55/10 and 4.98/10): The art for Isuca was made by studio Arms, the same company who produced Elfen Lied, and Brynhildr in the Darkness.  The art for Iscua really is nothing all that special.  The animation quality is subpar at best, so there's not really many things to say positively about it because of that.  What I can say is that the art does waver HEAVILY.  Depending on the background for the series, Iscua's artsyle wavers to the extent of it almost being on completely different spectrums.  When the show goes into daytime, it's fine, although a little meh at times.  But whenever the scene turns to night, the animation quality dips VERY quickly to the point of it having the same kind of quality from anime a decade back.  It is because of this that even the art for the series didn't impress me, but that wasn't all, oh no, we're just getting started.\\n\\n\r\nIn addition to the artstyle, Isuca adds in a couple of things not existent in the original series to make the show just a bit more ridiculous visually.  Those things are, blood and gore, and censor bars.  First off, the blood and gore.  It's hilarious.  Because Isuca was changed so that random Youkai kill people, the Youkai well, kill people and they kill people in an Elfen Lied way, where massive spurts of blood come out like a fountain from dead corpses.  Personally, I found this unneeded because it made the scenes that they were tied to kind of meh.  It didn't really add anything to the series because the only people getting killed were extras that we the viewers didn't really care for.  In addition, Iscua hosts a brand of censorship that is reminiscent of Terra Formers, with random flashes of light, or simply just a big black dot to cover up any breast or nether region that the series added in cause the actual Isuca admittedly, does actually have scenes like this.  The censorship is ridiculous, and it would've been better to not even strip the clothes off of the characters because it's so glaringly obvious as to what they were trying to do.  (Like seriously, a big black dot is just going to be more distracting.)\\n\\n\r\nThe soundtrack of this series wasn't anything particularly memorable.  Nothing stood out, and it was all rather meh in the grand scheme of things.  (Though, I don't understand the approach of having Sakuya put on a moustache.  What was the point of that?)\\n\\n\r\nOverview:\\n\r\n+/-  Meh art\\n\r\n-   Animation quality wavered heavily\\n\r\n-   Unnecessary gore\\n\r\n-   Censorship actually took away from the show\\n\r\n-   Forgettable soundtrack\\n\\n\r\nPersonal Enjoyment (3.50/10): When I first read up the Isuca series, I was rather intrigued by what could come from this.  While my expectations of the series after reading the manga were somewhat crushed on account of the 10 episode runtime, I never really expected anything quite like this...\\n\\n\r\nDid I like this anime?\\n\\n\r\nNo.  Plain and simple, this adaptation failed in every sense of the word.  It failed to capture anything that Isuca as a series had, it missed a lot of details in its storyline, and overall, just didn't sit well with me.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nReally though, I'd say this entire series is put to blame.  10 episodes have never been a good amount of time to make a complete series out of, so there were always bound to be mistakes.  As for what we did get, there wasn't one point where I was happy about the way things turned out,  (except for the Suseri episode) and I was unsatisfied with the approach that this series took.  While source material is something that an anime can deviate from, there is a certain degree as to how far away a series should be in from said source material.  Cause honestly, Isuca the manga, and Isuca the anime, are two completely different creatures.  Plus, Shinichiro, while does his job, doesn't EVER get paid.  He even points this out himself!  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nNo.  Isuca should be regarded as an anime that is a waste of time.  There is nothing proprietary about this series other than how genuinely horrible it is.  Above not following the actual story, having plot holes, and a really unlikable main girl, the aesthetics for the series are average at best and there's nothing significant that this show has to show for.  In the end though, Isuca is a failure of an anime adaptation, making itself to be a show that has zero redeeming qualities on account of everything being less than sub-par.  \\n\\n\r\nOverall Score:  4.04/10",
            "date": "2015-03-28T13:17:00+00:00",
            "helpful_count": 48,
            "mal_id": 183768,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=183768"
        },
        {
            "content": "Genre: Action, Comedy, Ecchi, Romance, School, Supernatural, Seinen\r\nEpisodes Watched: 5\r\nIsuca is another anime this season that tries to fit in with the rest, but can be considered another \"been there, done that\" type of anime. An analogy for this show could be that Isuca is a poor mans High School DxD or the latter. It seems to have an identity crisis within itself, it doesn't know when to be a romance, action, school, harem, super natural, or echi/fan-service when it comes down to it. It's on the road to be a not surprising disappointment. \r\nStory: 5\r\nThe story is rather straightforward, like the synopsis states, theMC finds himself working as a house mom/maid of sorts, where one family member of a renown exorcise group if you will, in the Shumazu family resides. He is ultimately mixed in her affairs because of a certain gift he possess, and it starts to go downhill from there for the would be lucky MC, as multiple females take their interest in him. As of now there is such a huge lack of information and substance regarding the plot, which makes for a really bland and sub par story. The pacing of the story isn't too much of a factor, but it's just the quality in which it's given is severely lacking. If there wasn't any gore, I would not take this anime seriously in the lightest.\\n\\n\\n\r\nAnimation: 7\\n\\n\r\nPossibly their wild card if you will, but still the other sum of its parts weigh down this only plus it has. The art and animation is fairly standard for current anime these days, but nothing really sticks out to write home about.\\n\\n\\n\r\nCharacters: 5\\n\\n\r\nAnother department where it suffers from its core. The characters are immensely reused and bland, that it's seriously worthy of an actual pace palm, besides possibly one character (meow) and that's it. Tsundere can be considered as a type of fine wine, you either have a refreshing taste for it or it might leave a foul taste, however in this case, personally I wouldn't even want to pop the cork. As already mentioned but, there is hardly any back-story to these characters, even the MC for heavens sake, which makes for a cast that no one really cares about, although they try to remedy this with flash backs, but still ceases to do anything with it. One easy way you can tell if an anime is good or not, is If you can remember the MC's name, heroine or a certain cast member of an anime you're currently watching, if you come up with a blank, you have you're answer; unless your watching tons of anime, but that's the only slack one has.\\n\\n\\n\\n\r\nWow Factor: 5\\n\\n\\n\r\nIsuca didn't have a strong debut showing other than the showing of our heroines favorite undergarments and oppai, but overall it seemly looked decent at first. Over these past couple episodes it's methodically on the decline, pertaining to the entertainment and overall enjoyment aspect and doesn't seem to know how to pick itself back up. This is a likely drop candidate. \\n\\n\\n\\n\r\nFinal Grade: 5\\n\\n\\n\\n\r\n+ True names\\n\\n\r\n- Nothing new\\n\\n\\n\\n\r\nWill I continue to watch this series?\\n\r\nMost likely not.\\n\\n\\n\r\nDo I recommend this series to watch?\\n\r\nIf you need a weekly fix of fan service and can withstand a mediocre story, this might be for you\\n\\n\\n\\n\\n\\n\r\n- Azure",
            "date": "2015-02-23T19:11:00+00:00",
            "helpful_count": 31,
            "mal_id": 181094,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3439279.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/azurexsky",
                "username": "azurexsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=181094"
        },
        {
            "content": "Overview:\r\nHow could something so generic be so ungodly horrible!!? Usually when a movie or series adapts a completely \"paint by numbers\" approach the result is mediocre, dull, and predictable. It won't win any critical awards, but it probably won't be one of the worst movies or shows you have ever seen! Look at the incredibly generic shonen formula that created Fairy Tail. They just recycled old shonen tropes and with no real effort or creativity they made a show that was pretty average in quality. Isuca manages to stand out despite all its generic cliches because it is SO lazy , SO poorly executed, andSO underwhelming in every category!\\n\\n\\n\r\nThe plot is that an incredibly obnoxious \"tsundere\" bitch is the latest in an ancient line of Demon Hunters and must strong arm an incredibly bland beta male into helping her fight Demons. Along the way, a harem will develop and a LOT of unfunny slapstick involving the male character being mistaken as a pervert will ensue. The plot is basically just what we've already seen in shows like \"Devil Hunter Yohko, Familiar of Zero, and a million others. What makes Isuca truly special as mentioned before is the spectacular level of fail in each category it attempts! The comedy isn't just bland or \"not very funny\". The comedy is PROFOUNDLY unfunny. The jokes are so cliche and the set ups leading to the jokes are so poorly executed that it almost seems like the show is attempting Andy Kaufman's style of \"anti-humor\". That clearly isn't the case though. Isuca really thinks that the kind of jokes that would have gotten a few grins and maybe a chuckle from anime fans in 1991 are going to get big laughs in 2015! \"HAHAHA She thought he was looking up her skirt and punched him while calling him a Baka!\" HAHAHA! That's the funniest thing I've ever seen in my LIFE!\" This is honestly how the director of this piece of shit thought audiences would react!\\n\\n\r\nNow that we've discussed the \"comedy\" present throughout the series, let's look at the erotic echii content. This series markets itself as an echii series and has frequent and shameless use of fanservice...but then it censors itself and doesn't even show panties! Forget seeing asses and titties, you aren't even going to see panties because incredibly awkward black bars of censorship will appear out of nowhere. The censorship is so amateurish and so unsubtle that you would think this was intended as a joke, but no. The series is simply THAT incompetent! The series honestly expects us to put up with incredibly obnoxious characters and unfunny jokes in order to see tits and be satisfied by seeing a black bar that someone did in 5 seconds with Microsoft Paint! \\n\\n\r\nSo the show isn't funny and no one could whack off to it. There are still things it could get right! Are the action scenes good? Does it have scary or tense scenes like it clearly wants to and spends so much time attempting? HELL NO! The action scenes short, poorly choreographed, and are marred by terrible CGI. The attempts at horror and establishing creepy atmosphere are equally inept and simply waste the viewer's time! This is one of those rare anime that manages to do absolutely NOTHING well from an objective standpoint.\\n\\n\r\nSo the CGI isn't very good. What about the character art and animation? Surely they did SOMETHING right in this flaming wreck of a series?! I have 2 words for you: \"Studio ARMS!\" Yes, in the distant past that studio produced some anime with decent art. However, in the past decade their quality has decreased each and every year. At this point the only other studio that can compare in terms of laziness and flat out not giving a fuck is Toei! \\n\\n\r\nOk, so it wasn't funny, wasn't erotic, had terrible art, obnoxious characters, crappy action, and was really boring...but what about the music and voice acting?! If you were optimistic enough to think they got this right...you need help. The music is utterly forgetable and the main 2 characters are voiced by a no name noob and the actress that played the little girl in Pupa! We're in great hands here folks!\\n\\n\r\nTo say Isuca isn't very entertaining would be the understatement of the century. Isuca is absolutely unwatchable unless you are a complete masochist! This is a show that took a cliche and generic premise and somehow through sheer laziness and ineptitude created a product that is astonishingly bad! This is to anime what Big Rigs Over the Road Racing is to video games. Congratulations Isuca! You are Loser!!!",
            "date": "2015-08-31T15:34:00+00:00",
            "helpful_count": 28,
            "mal_id": 197578,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=197578"
        },
        {
            "content": "Before watching the series, I decided to look up some of the reviews on this show from others on here. I was quite shocked to see so many 1/2 overall ratings. I feel that this series deserves a higher rating in the least.\r\nStoryline - 8/10 - I actually find the storyline intriguing. I really was into the storyline way more than I should have. \r\nArtwork - 9/10 - The artwork was really well done. I really liked the vibrancy, the pastel, and even the dark motifs in the show. \r\nSound - 8/10 - The music for the series wasn't astounding, but it was still verygood. The theme songs were alright, didn't wow me though.\\n\\n\r\nCharacter - 7/10 - I feel that the characters could have used more development. In a 10 episode series, it's hard to gather development in such a short amount of time. Though the series focuses on the two main people, I really feel that they should have included some of the side characters within the development (non-human wise).\\n\\n\r\nEnjoyment - 8/10 - I do say, I rather enjoyed this series. The minute I had read the synopsis about fighting demons and the like, I was thrilled to watch it. I like series like Inuyasha, RINNE, Yakumo, anything to do with spirits, youkai, etc... So this for me, was also really great to watch. Though, they could have um... did the censorship in a more different way? *sweatdrop*\\n\\n\r\nOverall - 8/10 - In total, it was a great series to watch. I really did enjoy the storyline, and I do hope they continue it. It's a series that, if you don't take the time to watch to it's full extent, you won't feel the enjoyment of the series.",
            "date": "2015-08-18T01:00:00+00:00",
            "helpful_count": 18,
            "mal_id": 196439,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3304.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xKiYoMiNaTiONx",
                "username": "xKiYoMiNaTiONx"
            },
            "url": "https://myanimelist.net/reviews.php?id=196439"
        },
        {
            "content": "When I started to watch this, I kind of expected it to be better as I am a reader of the manga, but surprisingly not.\r\nHere's the short summary of the categories-\r\nStory: 7\r\nThe story itself is a good thing in itself, has a male (kind of cliche kind, house-husband dude) who meets the short 5 foot 4 tsundere girl who uses a magical bow to kill spirits. Shit goes on from there when he realizes his part-time housekeeping job is with her. \r\nPersonally, there wasn't really that much manga for the writers to go off of and thats most likely one of the big reasons thisanime only has 10 episodes.\\n\r\nArt: 10\\n\r\nThe one thing the anime does extremly well is the art, especially in the lewd outro, which brings me to the second thing which kind of ruined the anime for me.\\n\r\nCensoring. The manga, (watch my true colors show here), had a lot of ecchi situations that gave it humor, and the anime just takes away the pleasure by darkening anything ecchi or gore related, which the anime actually does decently in.\\n\r\nCharacters: 6\\n\r\nTheres a loli-type...well actually we dont know what the grandmothers true body actually looks like yet (Spoiler).\\n\r\nShort tsundere heroine that would probably annoy the crap out of you in real life.\\n\r\nWeak kind house-husband main protagonist that has a hidden power that activates when you kiss.\\n\r\nQuiet busty shrine maiden girl whos sister to main heroine.\\n\r\nAnd a whole lot of side characters who the author is not scared to kill 5 seconds after introducing them.\\n\r\nYea that sums most of them up, next.\\n\r\nEnjoyment: 3\\n\r\nI personally wanted to be uncensored, as that was one of the perks of the manga, and had a lot more funniness to it...as well as arousement as I personally find the catgirl to be adorable (one of the few good things about this anime). I also noticed that the writers just didnt have enough to go off of and resulted to having only 10 episodes, and I personally think they should have waited a year for more manga to have a full on 24 episode season.\\n\r\nOverall: 6\\n\r\nAs stated before, the two main things that killed me were the lack of episodes and the overuse of censoring (this is supposed to be a gorey and perverted anime why make it if your going to censor it). If you are truly interested in this show, I suggest you give reading the manga a try. No bullshit censor and more story.",
            "date": "2015-03-28T00:59:00+00:00",
            "helpful_count": 13,
            "mal_id": 183700,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066335.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Somebody101",
                "username": "Somebody101"
            },
            "url": "https://myanimelist.net/reviews.php?id=183700"
        },
        {
            "content": "Lion Tamers, here we go again.\r\nThis time I'm gonna be contrary, and purposely choose an anime everybody only moderately dislikes to outright hates.\r\nThe chosen anime is \"Isuca\", and after watching the entire 10 episodes, I can confirm there are in fact some weak spots.\r\nBut there are some strong showings in this anime as well; in fact they are so good at points, I have to wonder if other folks and myself were watching the same anime.\r\nBut first, let's talk about the parts I had problems with, and I'll leave the good stuff for last. I know, I usually do it the other way around, butremember I'm being a bit contrary.\\n\\n\r\n-----------------------\\n\\n\r\nStuff that bothered me;\\n\\n\r\n1). Because of excessive 'Fan Service', the first episode had a lot of problems getting started.\\n\r\n I agree with others, there was a lot of it. This is especially true of the first episode. I'm not really bothered about it, because it's there. I'm aggravated because there was so much of it that it hammered the anime, in that the story just couldn't seem to get off the ground.\\n\\n\r\nWhile things did seem to fly after about the end of the second episode, the first episode was so distinctly outrageous that I almost gave up on Isuca right there. But settle down Isuca did, until the fan service dropped to a tolerable level, at least for me. First episode fan service content-11. After that, decreasing until it hit about a 5 level, and tolerable.\\n\\n\r\nBut first a bit of history. And why I have a gripe against the producers of Isuca.\\n\r\nI went to high-school in the 1960's. When I went to school, the notion of two young fellows sitting and looking out the window of class and ogling girls; was not unknown. The stuff that's unknown was the idea of talking about their breast size. It simply would not happen.\\n\\n\r\nEven the young members of clicks/gangs would almost never stoop to that kind of conversation. It was simply just too coarse and would have lacked dignity, both the girls, and the boys with the big mouths. I realize this is beginning to sound like the recollections of '... the good old days ...', but I'm actually quite serious. More over, this behavior was not something that was forced on us, by teachers or parents. It was just the way things were. Anybody that does that today, literally must stoop to such a level, that your neighbors' shoe would be impossible to see over.\\n\\n\r\nThe only thing this kind of talk means, is that fellows doing it are so frightened of girls that they don't have the balls to speak like that in person. And they do it in small groups, as a means of doing something they think needs courage while being buttressed by their fellows. This kind of behavior is a clear indication of cowardice.\\n\\n\r\nEither say it in person, and suffer a slap across the mouth; or shut up and learn manners. There is no third way.\\n\\n\r\nAnd so I get to the producers of Isuca. They made this show with that kind of content, on the assumption that this kind treatment of young ladies was normal and ubiquitous. It not only isn't; but points to an outrageous rejection of all things civilized. This show requires the understanding of what is Right, to make the philosophical issues meaningful. Fighting for what's Right, has no meaning when the only thing important to life, is what color a girls' hair is.\\n\\n\r\nI agree with other reviewers, in that there is too much of a certain worthless form of teenage bravado. While it happens in many anime productions, it is here in spades. And was a needless exercise. If the producers had decreased the fan service, they would have had much more time to develop the story better. The producers should have known better.\\n\\n\r\n2). 10 episodes, for a production this complex, is far too short.\\n\r\nIsuca is not a broken or haphazard effort; as intimated by other reviewers. It is merely too short to get some of the heavy lifting done, as to background issues, and character development. Does that mean the story is a clear fail? No. But there was not enough room to complete this effort in a fashion that might have been more satisfying.\\n\\n\r\n3). Music\\n\r\nThere was very little soundtrack, but that seemed tolerable. It was neither good nor bad.\\n\\n\r\nWhat was bad was the opening and closing musical songs. While they are cute and bouncy, and even the lyrics actually meant something in reference to the show (which I was astonished by), they are also J-PoP rubbish of the worst kind. I hate J-PoP with a passion bordering on vitriolic rage.\\n\\n\r\nI especially dislike J-PoP which is constructed by having the singers singing a song at normal speed, only to have technology enter the picture and speed them up to sound like chipmunks or squirrels. Even some of the instruments get this treatment, depending on what is required at the production company. It is an outrageous abuse of the artists involved, and it is so grating on my ears that I wanna throw things at my computer for uttering these noises.\\n\\n\r\nThe J-PoP tunes in Isuca are no exception. I tended to skip the opening and ending title sequences, just to blank out the outrageously bad music. I realize that some of the readers herein, actually like this sort of thing. But for me, anything else is better, except outright grunge heavy-metal. If J-PoP is so popular by itself, let's have a good singer which is fat and ugly sing the songs, and then we'll see how they sell!\\n\\n\r\n4). Voices, while all of the voice-actors did very well, the dialog they were asked to deal with had an issue I think could have had a work-around that improved the product. The Witch Isuca laughed so much, it actually got in the way of dialog, and the understanding of her character. Tone down the laughter, a little more in the ominous department would have solved all problems. The laughter only made the character appear so nuts that her actions looked out of place. Too nuts, is when a character can't possibly perform the activities we witness, in normal life. And that's where the Witch Isuca stands.\\n\\n\r\n5). The artwork.\\n\r\nThere's only one item, but it annoys me. Many new anime are beginning to give everybody eyes that have metallic tints. These colors are not normal for Human-Beings. And in extreme cases, it makes people look like their dead. Isuca uses these metallic highlights. I wish the artists would stop that.\\n\\n\r\n-----------------------\\n\\n\r\nNow I can do what I wanted in the beginning. And that is, discuss the parts of 'Isuca' I actually liked.\\n\\n\r\nThat being said I want to start with the plot. Many people felt the plot was a little dated, or just plain a repeat of many they had watched.\\n\\n\r\nWith that I want to make an aside comment. 'Visual Jaundice' can be a serious problem. Anyone that, over the last 5-years has managed to watch more than 500-anime and then read more than 250-manga; has now become a person with no life. Get out of the house, go watch a movie or a baseball game. Date someone, take a drive. But anime and manga, is not a substitute for life or understanding. And cannot possibly improve your understanding of either anime or manga!\\n\\n\r\nThe only thing too much of this stuff will do is cause you to arrive at a point where almost nothing will please you, or provide entertainment. This is true of any form of overdone entertainment. Too much of anything brings about a jaded attitude towards all things related. We all need more variety in our lives, to keep our perspectives fresh and clean. The purpose of Isuca, and any other anime, is to entertain. If you are so jaded that the parts of Isuca leaves no impact, then get away from all of this for while. You owe it to yourself.\\n\\n\\n\r\nLet's get to the good stuff, in characters and plot points.\\n\r\nWhile much of this plot is very rushed, especially under the restrictions of having only 10-episodes; the fact is the story is nothing less than way above average. It is not perfect, and it has development flaws, but the story is quite good and very watchable. Parts of this story is fresh and original.\\n\\n\r\n1). Did anyone notice the point about destroying all the churches in the city, to remove the basic spiritual protection of it; so that the large snake-monster could be brought in? Even the Witch Isuca confirmed this necessity. While there may be other anime that creates this idea; this is the only anime I've seen that has this plot point. After all, when ISIS goes into a country, what is one of the first things they attack? That's right. The churches and temples. Not just Christian churches, but all of them.\\n\\n\r\n2). Did anybody get the significance of Suseri and Sakuya Shimizu's growth of character? While most viewers might see only pain in the ass difficult personalities (what strong anime fans would call a tsundere); I saw much more. Both these girls were tortured into the state we find them, at the beginning of the series. \\n\\n\r\nSuseri was tortured repeatedly by her mother, into a person who rarely speaks (because she could not talk back to her mother), frozen in water at her mother's order (one wonders if her mother had ever to do this in her life?), forced out of archery without sufficient training (because her mother wanted to make sure Suseri did something that would not align Suseri with Sakuya's art form); and several other points?\\n\\n\r\nSakuya was tortured by the loss of her parents, and the reaction of her clan, both before and after their loss. Being the only representative of her own personal bloodline, in a clan that honored a pureblood history, is a tragic existence for a child growing up, and very painful.\\n\\n\r\nI know, boo-hoo. You live through that, and then tell me it has no significance. Both these girls are the product of their extreme and torturous upbringing, and somehow they find their way through all that; to grow wiser, stronger, more flexible to the changing winds of misfortune. And entirely thoughout the story.\\n\\n\r\nThis is a story about unbridled courage in the face of terror most of us will never face; by young girls and a young man; who never give up and find a way to succeed. This kind of courage is the reason we live, or we fail at living by rejecting courage.\\n\\n\r\n3). Did anybody notice how important Tomoka became? She is loyal, compliant without being a doormat, congenial, and affectionate. All of this, on the strength of basic kindnesses extended that you or I might find a slightly weak reason for all of that.\\n\\n\r\nTomoka is almost unique in anime. Let's see if I can make this simple. Maybe not. Tomoka is not a new kind of character. She stands as a cat-human hybrid, and is a magical monster, in that she can morph into several ranges between outright human, to housecat to monster cat. But the real charm of Tomoka is that she isn't really human in her personality.\\n\\n\r\nTomoka is a real cat, in the way she behaves. I have a 14-lb black female cat, with yellow eyes. And both my 'Inky' and Tomoka share all of the same traits. Anyone ever try to put a sweater on a full-grown cat? Not a great idea, you'll get clawed to death. Cats don't like to be clothed, as if they need it. It's wrong for cats, and Tomoka carries this trait. She will wear something, if it isn't too bulky, but she'd rather wear nothing at all. Which we see. While I'm aware most people see this as part of the fan service, it isn't. Tomoka is very cat-like in almost every way.\\n\\n\r\nTomoka likes to eat food on her own schedule. Housecats behave the same way. Tomoka tries to avoid violence, and most housecats try to do the same thing. Tomoka is very affectionate to Shinichirou Asano. And well she should. Housecats that learn to like their owners are equally affectionate, kind-hearted, and generally friendly. Even to the point of being clingy. Mine certainly is. Tomoka has every right to carry on the way she does.\\n\\n\r\nAll in all, Tomoka is so much like a real cat, that almost every other cat-human in other anime, pales in comparison. They tend to be for appearance only, taking on all normal human actions and responses. Tomoka is the real deal and I think she stands as a unique character.\\n\\n\r\n---------------------------\\n\\n\r\nWith all of the previous, I finish this review. This is certainly not an endorsement of the entire production; but I don't condemn it either. It stands as one of the fastest moving anime I've ever watched. 23.5-minutes per episode, and you get more than 40-minutes of information.\\n\\n\r\nIsuca is certainly not a ten rating, but the ratings from other reviewers in the one-or-two range is also not equitable. The story stands up, it has length and breadth, develops as the story travels from episode to episode; and in the end, sets itself up for the next set of episodes.\\n\\n\r\nMy only fear is, Isuca will not return and clean up or finish what it has started. With such a wonderful start, it deserves another chance, and another set of episodes to create something really new in the fantasy school quasi-harem genre. \\n\\n\r\nI give Isuca a very strong 7!\\n",
            "date": "2015-04-09T01:24:00+00:00",
            "helpful_count": 12,
            "mal_id": 185198,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KD7BWB",
                "username": "KD7BWB"
            },
            "url": "https://myanimelist.net/reviews.php?id=185198"
        },
        {
            "content": "I finally got the time to do this review on this sad disappointment of an anime that was hard for me to watch, but since it was only ten episodes i thought I mind as well finish it.\r\nStory: 2\r\nIsuca is your typical ecchi/harem anime about a boy name Shinichirō, a male student who gets a job as a housekeeper in order to pay his rent. While on the job, he accidentally releases a strange creature into the world, and he learns that his female employer named Sakuya Shimizu is the head of the Shimizu clan that hunts these creatures. Shinichirō cooperates with her to huntdown the monsters that are running loose. Now the anime really doesn't bring anything new to the table we haven't seen before, really you can say the plot is very generic and predictable and at times cliche and boring that made me what to drop it at times. \\n\\n\r\nArt: 4\\n\\n\r\nNow the anime's art isn't anything to brag home about ether at times the show would stop animating and the show had one of the worst censorship effect I have seen since Terra Formars, but other then that it was ok\\n\\n\r\nSound: 2\\n\\n\r\nNow I don't remember this show's score at all, mainly because there wasn't anything remediable at all. The op and ed where cool I didn't find myself liking them as much as some animes, but they fit the shows atmosphere.\\n\\n\r\nCharacter: 1\\n\\n\r\nOk, there is one word that fits this main cast of characters in this show generic. None and I mean none of them do anything we haven't seen before in a ecchi/harem anime like this one. The main character Shinichirou is wimpy, weak and only there to be a cock tease to his harem. Then theirs Sakuya the main heroine who is just a tsudere who has a secret past that doesn't get to much explaining in the series, and then you have the  other characters that really don't do anything for this show just more for his harem.\\n\\n\r\nEnjoyment: 1\\n\\n\r\nSadly I didn't find myself enjoying this show at and at times I was bored and would scheme through the episode just to get it over with.\\n\\n\r\nOverall: 2\\n\\n\r\nOverall Isuca is a very bad and generic anime that bored me to the point it made me want to drop it but I stuck in there to the end. In my opinion there are other shows that are from the same genre that are way better, I think you should avoid this anime if I were you.",
            "date": "2015-03-28T14:30:00+00:00",
            "helpful_count": 10,
            "mal_id": 183780,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4416449.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/qdsqjmsdnakdnp",
                "username": "qdsqjmsdnakdnp"
            },
            "url": "https://myanimelist.net/reviews.php?id=183780"
        },
        {
            "content": "The very first line of dialogue in this anime goes something like this.\r\n\"You will have your life force sucked out, in exchange for the ultimate pleasure\".\r\nThat's actually a slight paraphrase, but everything you'll need to know about this anime is said in that very first line of dialogue. I'm not going imply whether this anime is \"good\" or \"bad\" because that's not up to me. For the purpose of this review, I'm basically telling you to interpret that line, in the most literal sense possible, and decide if watching Isuca is worth your time, based just on that one line. That is all.",
            "date": "2017-02-03T20:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 239855,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4003743.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/YEROCKY",
                "username": "YEROCKY"
            },
            "url": "https://myanimelist.net/reviews.php?id=239855"
        },
        {
            "content": "The story is fine. However too much effort is wasted on ecchi and some slow motion you-know-what part. 4/10\r\nShinichirou is like a support character, simply there to resupply the energy of the girls.\r\nNothing to complement/complain about the sound or music.\r\nThe art is done quite nicely but I can only give a maximum of 4/10 for it because the whole battle scene is basically censored thanks to all those ecchi and seinen contents.\r\nThe action + seinen combination in this anime is one of the worst I've seen. Also, whats with that ending?! It felt like 2 episodes or more being cut off directly. Overall 4/10with tons of question marks in my mind what the heck I just watched.",
            "date": "2015-04-01T08:59:00+00:00",
            "helpful_count": 9,
            "mal_id": 184380,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4525380.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ele9",
                "username": "Ele9"
            },
            "url": "https://myanimelist.net/reviews.php?id=184380"
        },
        {
            "content": "This will be a short review due to it being a late review. There is a simple thing to understand about Isuca that can quickly determine whether or not you will enjoy it. \r\nIt all comes down to one question: Are you able to stomach a very weak male MC if the rest of the show is decent? Because that is really what Isuca comes down to. The art and animation is good. The action scenes are well done and the plot itself isn't half bad. But that MC. Oh boy oh lord that MC. Asano is quite possibly the most pathetic soyboy \"Indecisive wuss\"clone character I have ever seen - and I have seen a lot of anime with this type of male lead. Saying he has no balls would be an understatement. He also has a hidden power that requires no effort on his part and only serves as a weak attempt to give him a place in an anime about exterminating youma. \\n\\n\r\nEverything else about Isuca is a solid 8/10, brought down heavily by a bad main character that almost makes you feel like you are watching Twilight with the genders reversed. If you don't mind the \"Shinji clone\" main character type, then you will likely find Isuca more enjoyable than the average rating. If you do not, then skip this one. He never gets any better throughout the entire series and will only serve to annoy you. \\n\\n",
            "date": "2018-02-13T14:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 271440,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1315147.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The_Walker",
                "username": "The_Walker"
            },
            "url": "https://myanimelist.net/reviews.php?id=271440"
        },
        {
            "content": "I decided to use a random generator to pick which anime to review first. As luck would have it, it chose the worst anime I've ever seen. \r\nThis is my first written review for an anime, so wish me luck.\r\nI rated it according to MyAnimeList's standards (so 1 would be appalling).\r\nStory:\r\nI'm not going to lie to you. I watched the entirety of Isuca and have no idea what the plot is about. Were I to take a guess, I'd say it's about a bland male main character getting caught up in the world of a blonde female main character who's name isn't Isuca but Ithought it was so what does Isuca mean? I don't know. Wait. What.\\n\r\nWhat's this aforementioned world consist of, you didn't ask?\\n\r\nWell, not much different to ours I suppose, minus the inexplicable spider-women demon things, the consistently pandering and derogatory nude scenes, and the unexplained demon hunting that appears to be going on.\\n\r\nSound exciting?\\n\r\nIt's not. It's awful.\\n\r\nI know I haven't really explained the story properly, but honestly the story felt so generic that you could probably go watch any other light novel adaptation and get the same feel.\\n\\n\r\nArt:\\n\r\nBarebones basic 2004 anime art is constantly present. There's no 'woah, didcha see that!?' moments and the animation is sub-par. The main character must have been spawned from the most boring human beings to have existed - not that any of the other characters look any better, but I digress.\\n\\n\r\nSound:\\n\r\nI can't remember. Let me go listen to the Opening again...\\n\r\nWell that was a mistake. There's a reason I buried that corny mess into the furthest recesses of my mind.\\n\r\nThat's not to say that the voice acting was abysmal though. I just think Kido Ibuki is probably not suited to play the role of an intentionally unbearable tsundere character. Her performance as Rinka Urushiba in Tokyo ESP last year was very good, so I'll boil it down to miscasting.\\n\r\nUnfortunately, Keisuke Koumoto doesn't lend his full potential as a voice actor to the main character, Asano Shinichirou, who ultimately ends up coming out as flat and disinteresting. Though again, it's not like he had much to go off - considering his character development could be summed up by a mute.\\n\\n\r\nCharacter:\\n\r\nWell I've already touched upon the characters quite a bit, but I suppose I could explain myself a bit more.\\n\r\nFirst we have Asano Shinichirou, the main character. I know nothing about him.\\n\r\nSecond, we have Isuca - no, wait, sorry - Sakuya Shimazu. Possibly the most aggravating character to come out of the anime industry in quite some time. Her character screams 'tsundere', but not in a good way. See, whereas Asuka and Kurisu both succeed at playing the confusing role of the tsundere, Shimazu flops at every opportunity. Every time that Asano may accidentally have Shimazu land upon his crotch beyond his control, she lashes out violently, screaming and hurling kicks and insults. The creators probably thought she seemed cute, but she just comes out looking like a bit of an unreasonable and relentless bitch. \\n\r\nWhy Asano hung around with her for 12 episodes I'm not entirely sure. Probably for love. Or something. But then why would he fall in love with her? She's a dick. Because anime, maybe.\\n\r\nThere's also the generic neko-pandering catlady who follows the Isuca norm of having no character development. She's not really worth talking about.\\n\\n\r\nEnjoyment:\\n\r\nI didn't. I mean, I just didn't. I've seen Mars of Destruction and Skelter Heaven. I know what bad anime looks like. Yet I rated this lower than them both (though they also got 1s). Because I didn't have to sit through 12 whole episodes of Mars of Destruction. I didn't have to watch approximately 240 minutes of Skelter Heaven.\\n\r\nI've tried to find something worth praising in this show, but I honestly can't.\\n\\n\r\nConclusion:\\n\r\nDon't watch this. The first minute of episode 1 is misleading. There's gore and breasts, yes, but go watch Elfen Lied if you want that so bad. There's plenty of good anime out there, but this isn't one of them.",
            "date": "2015-09-15T21:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 198666,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2908361.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Dayface",
                "username": "Dayface"
            },
            "url": "https://myanimelist.net/reviews.php?id=198666"
        },
        {
            "content": "Simply put, this anime doesn't deserve the condemnation that the vocal minority are currently giving it.  Just look at the MAL rating compared to the top like 6 most \"helpful\" reviews.  For this rating with so many 1s... means there are FAR more (on a scale of far more than 2:1... since most people don't give only 1s and 10s) people who found it to be enjoyable in some way.\r\nThere is nothing spectacular or innovative about the story/art/etc...  However, in order to be enjoyable doesn't require any of that.  This is an ecchi harem(ish) anime, you should never expect it tobe ground-breaking just based on the genre.  It has a solid story, standard art, decent voice acting, at least ATTEMPTS to form some character backstory (which alone makes it impossible to be called the WORST anime in existence), and is oddly relaxing and enjoyable to watch.\\n\\n\r\nThis is a simple anime.  Nothing complex.  It's short (only 10 REAL episodes... plus an obligatory ecchi trope of girls on the beach OVAs).  And it is simply enjoyable.",
            "date": "2018-01-12T16:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 268338,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3648499.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stangryn",
                "username": "Stangryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=268338"
        },
        {
            "content": "It is NOT a comedy and it is barely a romance and not realy ecchi. This anime is a action drama with horror scenes. So yes i gues you can understand why its score is not so good, it is because description is all wrong.\r\nSo in story there sre some girls hunting spirits and there is that guy that is helping them. And i gues if youre looking for an easy horror action anime then you may even like it, however if you want to enjoy a ecchi romantic comedy then go watch something alse.\r\nAnd its not unusual that people try to sell dramas ascomedy for some reason, i usualy get lured to watch such animes by wrong description.",
            "date": "2018-05-03T13:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 279707,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7134195.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rasly2",
                "username": "Rasly2"
            },
            "url": "https://myanimelist.net/reviews.php?id=279707"
        },
        {
            "content": "i am only giving my prospective for this review\r\nwhen i first watch this anime i thought that this only normal anime nothing good nothing bad\r\nstory\r\nnothing new kissing the male protagonist will boost up her power in a small amount of time just \r\nlike negima but on negima kissing is like a contract that can boost up the femail character and they can reactivate and deactivate there power.(well depending on the negima SEARIS).\r\nAnother thing her mission is basically the same as negima (well i haven't read the manga if the is any realist so i am basing this information on the 1-10 episode of isuca )\\n\\n\r\nArt of the anime is good, sound and music fair the opening is good. in character prospective i have my favorite character who is Shimazu, Suseri  that boost the rating of this anime one of the main reason i continue to watch his anime, she is a shrine maiden who is suited the be a Japanese Exorcist.\\n\\n\r\nwell for my prospective  for the hero Shimazu, Sakuya is she is like class C tsundere that doesn't have a spark or sign of cuteness when she acting tsun-tsun \\n\\n\r\nwell for other information my friend told me that i am a fan of femail supporting character rather like a side character than the hero of the anime. like sayuri kurata of kanon T_T\\n\\n\r\nand for enjoin-met of the anime is normal over all rating normal fair. for% of watching the anime probability some part of the episode\\n\\n\\n",
            "date": "2015-03-28T03:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 183708,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4522705.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/latias9003",
                "username": "latias9003"
            },
            "url": "https://myanimelist.net/reviews.php?id=183708"
        },
        {
            "content": "What is Isuca actually? Honestly, after watching 5 episodes, no idea yet!\r\nI did enjoy watching the first few episodes, specifically 1 - 3, whereas 4 started to get weird and a bit annoying due to clichés and whatnot.\r\nStory - 1\r\nBecause the score itself says \"pathetic\" which I couldn't agree more, not only did it fail to convey a story in half it's story line, having folklore creatures and having characters does not count as a story. I wasn't expecting a masterpiece nor a pure story driven anime but this was just painful.\r\nArt - 8\r\nThis was the better part of this anime, I found spots thatwere not exceptional but it was overall enjoyable to watch, I mean excluding the fan service, it was a good eye candy at parts. But also made me wonder what were the directors, artists and animators focused on. A given example of good art was the ending, felt really high quality and sharp, plus the heroine looks hotter then in the real show.\\n\\n\r\nSound -7\\n\\n\r\nThere were no noticeable aspects regarding sounds, it was not great but it wasn't bad at all either, if I would have to choose I would put it on the better side, it was pleasurable to see the animations being in sync with the sound.\\n\\n\r\nCharacter - 1\\n\\n\r\nAgain, pathetic, no character depth at all but the occasional flashbacks which has no relation to their personalities at all, at least that's what it appears to me. As scenes went on the sociable aspect between characters felt stiff and forced, doesn't feel like they even tried and just went for anything ecchi.\\n\\n\r\nEnjoyment - 5\\n\\n\r\nI can't give it a really bad score because sadly I did enjoy some portions of it and mediocre describes my feelings toward it accurately. The only enjoyable parts were mainly the art, sound and the Ending, also a bit of ecchi here and there, but if it wasn't for the story I would've liked this anime.\\n\\n\r\nOverall - 3\\n\\n\r\nEven with a score of 3 overall I still feel like being generous but honestly if you want to watch it I would advice you to get ready to grit your teeth in frustration and the rage of wanting to stop watching it midway.\\n\\n\r\nWould I recommend this anime? Yeah sure, why not? You surely will find some parts of it that you will enjoy but be warned that there's a really heavy negative side to this work, story and characters. Hope you enjoyed reading this review and that it helped :)",
            "date": "2015-09-14T17:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 198614,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/166033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/dskilly",
                "username": "dskilly"
            },
            "url": "https://myanimelist.net/reviews.php?id=198614"
        },
        {
            "content": "See this anime is the same as standardize what is the same in all anime and assemble a fully animated \"cliche\". The story, if I may call it a story begins in a very simple manner and results from fully \"standard\" way of animes \"ecchi\", with a very simple action scenes and bland.\r\nThe appearance of the characters are literally generic other anime without any differentiating characteristic. The personality of them are also simple in a way \"cliche\". The male protagonist and a standard character in my opinion if not the protagonist it would make no difference in the anime. Already the female protagonist and withouta doubt the character \"tsundere\" simpler and more gave me \"sleep\" all anime I've ever seen.\\n\r\nThe anime itself is bland, without history, without different characters of \"extras\" in other anime and in my opinion was the \"worst\" anime \"gender\" of the season and play will be the worst of the year (in my opinion) .\\n\\n\\n\r\n- Original ( Portugues ) :::: \\n\\n\r\nVer esse anime é a mesma coisa que padronizar o que existe de igual em todos os animes e montar uma animação totalmente \" cliche \". A historia, se é que posso chamar aquilo de historia começa de uma forma totalmente simples e decorre de maneira totalmente \"padrão\" de animes \"ecchi\" , com cenas de ação totalmente simples e sem graça. \\n\r\nA aparência dos personagens são literalmente genéricos de outros animes, sem nenhuma característica diferente. A personalidade deles também são simples de certa maneira \" cliche \" . O protagonista masculino e um personagem padrão que na minha opinião se não fosse o protagonista ele não faria diferença nenhuma no anime. Já a protagonista feminina e sem duvida alguma a personagem \"tsundere\" mais simples e que mais me deu \" sono \" de todos os animes que eu já vi. \\n\r\nO anime em si é sem graça, sem historia , sem personagens diferentes de \"figurantes\" em outros animes e na minha opinião foi o \"pior\" anime do \"gênero\" da temporada e se brincar será o pior do ano ( na minha opinião ).",
            "date": "2015-04-27T16:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 186614,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4468469.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Kuroittei",
                "username": "Kuroittei"
            },
            "url": "https://myanimelist.net/reviews.php?id=186614"
        },
        {
            "content": "A review of *Isuca, an ecchi with a surprisingly interesting world.* \r\nIsuca's first three episodes led me to rate it as the worst anime of the winter season, and yet the series turned everything around to make arguably the best ecchi of the winter season.\r\nAt first, Sakuya is the typical old school tsundere that annoyingly kicks the protagonist for absolutely no reason, and while she still retains much of her tsundere-ness, it is toned down later in the series. Shockingly, a romance between Sakuya and Shinichirou forms towards the later part of the series. It is not prominent or conclusive, but it goes to thepoint where it is clear that those two characters are together rather than the usual indecisiveness of harem protagonists. \\n\\n\r\nIsuca's best aspect is its world of east vs. west society of mages and magical. While the concept is not explored nearly enough, and it may not be all that original, the overarching story is somewhat interesting for a harem. Unfortunately, there is no conclusion, but the combination of Japanese lore and western magic creates an interesting dynamic.\\n\\n\r\nFor an ecchi, Isuca is an above average with a decently executed world, concept, and characters. With that said, saying that those aspects are good “for an ecchi\" does not mean all that much compared to anime in general, but it has just enough positive elements to make me actually want to see another season to further expand upon the fantasy world.\\n\r\n_Watch if you like:_ Ecchi, Harem, Supernatural-Ecchi,\\n\r\n*-5.0/10*\\n",
            "date": "2015-04-17T06:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 185800,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3578061.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JamestheReviewer",
                "username": "JamestheReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=185800"
        }
    ],
    [
        {
            "content": "What's up MAL community, here I am bringing you another review about how bad something is.  Seriously this one deserves a bad review.\r\nIsuca is quite possibly the worst anime I have ever seen like of all time.  I know my review of Absolute Duo painted that series as bad but this one makes that show look like a masterpiece.\r\nBy now you all probably know what this show is about thanks to the effort of those who actually tried to write a review without wanting to puke so I won't get into the details, I'm just going to tell you why you shouldn't bother.\r\nStory- 1\\n\\n\r\nThe story seems like it is nothing but recycled retools of series that already exist and is mashed together into one anime that is supposed to make you appreciate the verse.  Take Kekkaishi, elements of supernatural harems like DxD or Shinmai (and I make this comparison very loosely), the importance of kissing like from Sekirei and gore that doesn't make sense as to why it is censored and that is basically Isuca in a nutshell with a shotty plot. But really, there is no story.\\n\\n\r\nArt - 4\\n\\n\\n\r\nThe art manages to skate by but only so much as to make this tragedy only slightly visually appearing.\\n\\n\r\nSound - 5\\n\\n\r\nThe soundtrack is okay but there isn't really anything in terms of sound that makes this anime even remotely memorable\\n\\n\r\nCharacter - 1\\n\\n\r\nThe main heroine is supposed to be some head of a clan but she takes so much shit for just existing that you wonder why she doesn't just tell everyone to off themselves.  The main male is like a super hesitant dense ass fuck with no balls and he seems completely useless unless he becomes a plot device.  There is no real character growth either so the characters pretty much stay the same throughout.  Also, there is like a copy of Origami from Date A Live in this series: emotionless and ready to rape the MC at any moment she can but ironically is like the best character to me.\\n\\n\r\nEnjoyment - 1\\n\\n\r\nIf I remotely enjoyed this series, it lasted for a solid second.\\n\\n\r\nOverall - 1\\n\\n\r\nA harem that isn't really a harem that has no real substance for a story and makes you question why money was wasted on something like this.  Isuca is the worst anime of 2015 and watching makes you want to drill a nail in your head or something.  All in all, do not waste your time.",
            "date": "2015-03-27T11:37:00+00:00",
            "helpful_count": 109,
            "mal_id": 183627,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3071063.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/DedPanda",
                "username": "DedPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=183627"
        },
        {
            "content": "\"Masterpiece\" is what I would describe anything else compared to Isuca. I felt like the time I wasted watching this show was better off watching paint dry or some other nonsense I could come up with. This is something you need to stay away from. The writing will make you cringe because of how cheesy it is, the animation is horrid, and characters are just disgraceful and pathetic. \r\nStory (2/10): The plot is nonsensical and downright redundant. It had the grounds to be a somewhat decent plot, yet all their creativity was used to instead put the main character in ridiculous and perverted situations. Thestory itself was easy to follow, it wasn't a jumbled mess, but rather the plot was executed so poorly that you just seem to lose all interest.\\n\\n\r\nArt/Sound (3/10): The Animation was pathetic, just by the opening of how Asano pulls out his sword, you instantly know that the animation would be jagged. If I were to give this show any props it would be the animation. That just means that's how high the standard would ever be, in the lowly disappointing range. The sound was equally as bad. The OST was dead to me, none of it even clicked while I was watching this show. That could also just be that my brain was working so hard to understand why I was wasting my time on something as horrendous as this. \\n\\n\r\nCharacter (3/10): Instead of giving you an in depth analysis of each characters, just take all the generic harems you've ever watched, and remember how those specific characters were. Chances are they are infinitely better than any character this show has to offer. There is one character though that stuck to me like a leach, and that was Tamako. I could write an entire essay and you still would not be able to fully grasp my frustration about this character. I love cat girls as much as the next guy, but this is someone that will annoy you to no end. \\n\\n\r\nEnjoyment (0/10) - Usually, to escape the harsh realities of doing work or anything productive for that matter, I go and watch anime. This show made me want to write a 10 page thesis on how grass grows. The only reason I did not drop this show is due to the fact that I'm a completionist and it would bother me that I wasn't able to finish it. In the end it was sheer willpower that kept me going. If you do want to suffer and watch this show, I recommend that you lower your expectations and your brain capacity to the point where anything can be considered interesting. That is the only way to finish this disaster.\\n\\n\r\nOverall (2/10): As I stated before, you will find it more intriguing to watch paint dry. Go outside or take a bath, just stay away from this show. It might be good if you're into the Ecchi genre, but why bother? I'm willing to bet that a Hentai out there has a better plot, character, animation, etc.",
            "date": "2015-04-07T21:15:00+00:00",
            "helpful_count": 75,
            "mal_id": 185112,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Elegade",
                "username": "Elegade"
            },
            "url": "https://myanimelist.net/reviews.php?id=185112"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nMany people growing up, at one point or another, encounter a situation in which they have to “prove their worth.” Sometimes it’s small, like performing well on the job to earn a raise. Sometimes it’s huge, like saving someone from a fatal accident. But no matter the severity or the situation, accomplishing such a moment makes that guy or girl grow into an overall better person. And even if they don’t achieve their goal, the experience earned gives them the necessary tools to hopefully make that next opportunity one that’s more positive than the last. Isucatries to work with this heartfelt message, but it turns out it can’t prove its worth since it’s worth nothing to begin with.\\n\\n\\n\r\nSTORY\\n\\n\r\nIsuca follows Shinichirou Asano, a young high school boy who happens to cross paths with a girl named Sakuya Shimazu. Through a series of events, it’s revealed that Shinichirou has the ability to give others spiritual energy through kissing and that Isuca fights demons, leading the two on a quest of self-worth.\\n\\n\r\nWhere does one begin? Isuca has far and away one of the worst narratives ever conceived in anime form. One of theseveral reasons for this is the show’s inability to carry its drama or plot points from one episode to the next. Most anime have either one overarching story that covers the events that take place, a few arcs that hold relevancy between them, or a series of literal episodic tales. Isuca’s initial downfall is trying to mix these all together. The overarching story makes absolutely zero sense because it goes all over the place. Sakuya has daddy issues, her extended family is looking to out her, her cousin is vying for her leader position; there are so many small ideas at play that never seem to resolve, let alone go anywhere worthwhile. What’s worse is that the show even refuses to utilize its own, established plot points. The two largest grievances are the ending and Sakuya’s “true name.” The former leaves everything open, causing one to come to the realization that nothing happened besides our two main characters coming together. The latter isn’t even used; “Isuca” is Sakuya’s “true name,” which allows her to be controlled by the person who knows it. But it’s used one time and referenced once after the initial discovery. If the anime is given its title by such a device, one would think that it would hold some modicum of importance. But no, Isuca stunningly avoids its own namesake.\\n\\n\r\nThe problems continue when looking at each individual episode, rather than the entirety of the series. There are essentially three issues here: the lack of “cause and effect,” the monster formula, and the fan-service. Starting with the largest problem of the three, Isuca, like its total narrative, doesn’t do anything with what happens between episodes. In essence, each episode acts as its own arc, with whatever events that happen to take place in one episode not transitioning to the next (with the exception of the last two episodes). In other words, Isuca tries to tell ninedifferent “stories” at once. But due to their inability to affect one another, it comes off as completely incoherent. These “stories,” though, don’t even stand by themselves. Each becomes a “monster-of-the-week” style, which can be fine if executed nicely. Except here, the exact same events take place: group shows up, Isuca can never defeat the demon, and Shinichirou kisses her to give the energy needed to win. It’s repetitive and pointless. And just to add insult to injury, the fan-service is incredibly weak when it is relied upon. Like the formula, fan-service isn’t automatically bad if it’s done right. But here, not only is it censored at every turn but what is given – dissolving clothes, some underwear shots, a few breasts, etc. – lacks originality, is always lame, and often unattractive to see.\\n\\n\r\nThe only “theme” Isuca tries to work with is the one presented in the introduction: “proving one’s worth” to better their person. Besides being lost among the disjointed storytelling and horrible fan-service, it doesn’t make sense. Sakuya wants to demonstrate her powers to both her cousin and the rest of her family due to her “outcast” status and due to her currently holding the top spot. But hearkening back to the repetitive formula, Sakuya always needs Shinichirou’s help – his literal “kiss of life.” That is, she never has the opportunity to “prove her worth” to anyone let alone herself because Shinichirou’s always the one to do the saving. And even when she does get the chance, she’sforbidden from trying her tactics again. The anime literally prevents its own theme from being looked at in favor of the couple kissing one another intermittently. Based on this and the long list of negatives, Isuca’s narrative, simply put, has no redeeming qualities with which to speak of.\\n\\n\r\nANIMATION\\n\\n\r\nIsuca doesn’t continue its downward spiral, because that would imply that it started off rather high. Instead, the show began digging its own grave, with the hole steadily getting deeper the further one goes.\\n\\n\r\nIsuca’s art is as bland as it looks. The locations visited are often devoid of detail, taking on a dreary persona to match the “evil” atmosphere that is generated. Prominently, the show takes place at Sakuya’s mansion, the school, and at random locations that hold no relevancy. Despite being a mansion, it seems to “only” have two rooms: the living room and the kitchen, because nothing else is shown. As for the school, it’s as generic looking as any other. Beyond this, the camera direction isn’t anything to marvel at and everyone involved has an extremely limited set of moves to use – Suseri, Sakuya’s cousin, seems to use one move for the majority of the anime – which brings about less variation and therefore style.\\n\\n\r\nAs if it needs to be said, the character designs are rather poor. The only notable person is Sakuya; her long blonde hair, red, blue, and gold outfit, her hair ribbon, and especially her striking green eyes help her to stand out in a sea of mediocrity. The rest of the cast is found in this sea: Shinichirou is painfully plain, Suseri has abnormally large breasts along with her ridiculous haircut, and the evil mage wears all white while touting a silly witch’s staff.\\n\\n\r\nAnd when the show tries to make everything move, it fails at doing so. A lot of the action that takes place isn’t so much action as it is cardboard cutouts moving across the screen. At most, you’ll see a few arrows flying here and a ferret twirling there, but that’s the extent to which Isuca sees actual animation. In most other cases, the characters are standing around, talking to one another with their poorly detailed designs and their generic backgrounds.\\n\\n\r\nCHARACTERS\\n\\n\r\nIsuca’s grave-digging continues with its cast, where there is nobody of consequence or purpose when the series concludes, let alone while it is progressing.\\n\\n\r\nThe extent of Sakuya’s characterization is so minimal, that’s it’s surprising that she was given one of the top spots within the anime. Her dialogue consists of mainly two phrases: “Shinichirou!” and “Shut up!” Often times, they’re used in tandem. But regardless of when or how many times they are used, that’s it. There is some information given in regards to her father and mother whose marriage apparently ostracized Sakuya when she was smaller. But her plight doesn’t contain any sense of drama due to the aforementioned show’s inability to resolve anything. Conflicts such as Suseri’s quarreling, the rest of the family’s objections, and whoever her father actually is do not amount to anything, therefore making her character’s “development” hold no weight. And many of Sakuya’s issues are directlycaused by her own personality; she’s incredibly standoffish, rude, and angry towards others. This is most likely due to her outing from an early age and her need to, as has been discussed, “prove her worth” in front of everyone. She acts immature and only opens up to Shinichirou very slightly. But not only is it not enough to warrant importance but it holds no relevancy to the issues surrounding her, making her character absolutely useless.\\n\\n\r\nSpeaking of Shinichirou, he’s arguably the “best” character within the anime for the simple reason that he’s the most normal. While he has this odd ability to give others spiritual energy, in relation to everyone’s arrows, spells, and dolls, from the outside he seems like any regular dude. He isn’t overpowered, he isn’t interesting, and he isn’t there for any other reason than he’s “a nice guy.” He starts off this way and ends this way, without undergoing any sort of development over the course of the show. He’s relatable because he’s grounded to reality. Yet, without a quirk of his own or experiencing any sort of change throughout the anime, he’s unbelievably stagnant as a character. There’s almost nothing too say about him because he’s so simple of a person.\\n\\n\r\nAnd regardless of who else you look at, they’re as equally useless or so insignificant that there’s next to nothing to say about any of them. Tamako’s development happens over the course of ten minutes within the first episode, from somewhat evil to obsessively servant-like. Suseri’s emotionless ways prevent her from interacting with any of the characters in a meaningful manner. Nadeshiko, the professor, acts as Sakuya’s pseudo-mother and only provides assistance near the end of the anime, and even then she contributes nothing whatsoever. And the “evil” Isuca harbors some unexplained hatred towards Sakuya and her family – it’s hinted at, but without any clear indication or investigation to her character besides her showing up, performing magic, and shouting a lot, the audience doesn’t learn anything about her besides her one-dimensional despising. The entire cast, from Isuca to Isuca, is an amalgamation of horribleness that clearly indicates the anime’s total ineptitude.\\n\\n\r\nSOUND\\n\\n\r\nAt this point, the grave is filled and the tombstone is being rolled in.\\n\\n\r\nBoth the opening and ending themes are generic beyond imagining and contribute nothing to the show’s overall purpose. The OP is named “Never Say Never.” It’s supposed to be about Sakuya and the others never giving up on the problems they face, but it’s drowned out by the simple beat and loud sound effects. And when listening to the ED, it’s supposed to be this “cool” arrangement. But with Isuca’s “mustache” being funny due to how silly it is, and the rest of the track’s unmemorable tone and singing, it isn’t cool but in fact lame.\\n\\n\r\nThe rest of the soundtrack is simply there as background filler. There exist “fun” tracks during the naked, fan-service moments, battle-hardened pieces that accompany the “action” that takes place, and tense music that plays when dealing with the demons. But in similar fashion to the OP and ED, it’s either extremely generic or entirely forgettable.\\n\\n\r\nLikewise, the voice-acting involved is somewhere below average, with no special shout-outs to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis anime is astonishing in its capability to fall flat at whatever it is that it’s doing. The show tries to be funny, but it isn’t. As already mentioned, the fan-service is deplorable, with no amount of kissing being able to save it. The fighting that occurs against the demons is boring, the dramatic moments are a slog, the characters are worthless, the execution is nonexistent, the music is insanely not worth listening to, and the narrative is so bad that’s a phenomenon that it managed to have as many episodes as it did in the first place.\\n\\n\r\nWhile nobody attended Isuca’s own funeral, here’s what its headstone reads: “Here lies Isuca, one of the worst anime of all time.”\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, incoherent plot, unresolved ideas, repetitive in nature, uninspired fan-service, and self-inflicted thematic loss\\n\\n\r\nAnimation: Terrible, bad art style, ridiculous character designs, below average actual animation\\n\\n\r\nCharacters: Terrible, nobody is worthwhile or developed in the slightest\\n\\n\r\nSound: Terrible, bad OP, bad ED, forgettable soundtrack, below average VA work\\n\\n\r\nEnjoyment: Terrible, not comedic, not dramatic, not fun, with nothing of value being found\\n\\n\r\nFinal Score: 1/10",
            "date": "2015-05-13T03:55:00+00:00",
            "helpful_count": 49,
            "mal_id": 187723,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=187723"
        },
        {
            "content": "Anime adaptations of manga or light novels make up most of what one would see in any given anime season.  With these adaptations, several results can appear.  1.  A series will get a perfect adaptation of the source material and get good feedback.  2.  A series can resemble the source material to the extent of its being still good.  3.  Screw the source material, just do whatever you want, and reap what you sow.  Isuca...follows choice #3.\r\nStory (5.00/10): The story of Isuca follows a boy named Shinichiro, a boy who wishes to seek out a part-time jobin order to unburden his family to a certain degree by supporting himself.  Upon asking one of his teachers for a job, he then gets assigned a housekeeping job for a household that is more of a pigsty than anything.  It is here where he meets Sakuya, the owner of the house, sending him into the world of Youkai, magic, and spirits in a job where he never gets paid.\\n\\n\r\nAt first glance, Isuca does have some promising things to be had.  Utilizing the fish out of water style of storytelling with our main protagonist being thrown into an unknown situation, one could expect something decent, right?  Well, not really.  To put it bluntly, Isuca fails to do the thing that all anime adaptations are meant to do upon creation, follow the source material.  Having read the actual Isuca manga, this 10 episode crapfest fails to even resemble the series that it was based off to any sort of degree aside from pointing out the more important points in the series.  \\n\\n\r\nThe entire show can basically be summed up like so.  A random, evil Youkai threatens the city, people, sometimes many people die in a horrible fashion, the main female protagonist bitches about having to do things herself even when she clearly can't do anything alone, defeat the youkai after lots of hardship and refusal, evil troll villain laughs at the main characters and leaves without doing anything, scene.  Rather than building upon the actual story of the series, this anime adaptation follows a more episodic style of storytelling which really doesn't work at all simply because every episode is more or less the same thing without any variation.  It's pretty much just different Youkai attacking our main characters every episode with little to no plot progression.  And that right there is just the beginning of this show's problems.\\n\\n\r\nIn addition, the series fails to tie up any loose ends.  As far as I'm aware, an anime that is only 10 episodes long either fails, or does not do well simply because of the lack of time.  Isuca follows this awful tradition by not being able to solve any of the series's issues.  Because the series tried to slowly feed in a plotline that requires answers, Isuca failed to really explain what exactly was going on in the series.  We're hinted at who the main antagonist of the series is, but we don't actually get to know or learn who he is.  There is no character explanation for that, and that really drives home how bad of a series this is.   \\n\\n\r\nOverall, Isuca was a shining example how not to create an anime adaptation.  Aside from not following the plotline of the original series and going off to do whatever it wanted, Isuca didn't really end on a note that was satisfying.  It doesn't solve any questions, it doesn't resolve anything, and the series just kinda...ends without really anything happening.  \\n\\n\r\nOverview:\\n\r\n+  Good story idea  (This was the reason I got into this series in the first place)\\n\r\n-   Awful execution\\n\r\n-   Too many loose ends\\n\r\n-   resembles little to the source material\\n\\n\r\nCharacters (3.49/10): While the story itself was something that left to be desired, the characters of this series simply just BEG to be criticized.  \\n\\n\r\nFirst up, Sakuya Shimazu.  Oh boy...another tsundere, short, flat-chested girl.  I totally haven't seen that before...  Moving on, Sakuya is the title character of this series, (which really should be a red flag), who is both Shinichiro's boss as her house is the one being cleaned, and classmate.  As someone who is part of the Shimazu family, Sakuya has the ability to utilize a magical bow in order to perform exorcisms, essentially having the Youkai who wander around the world \"pass on\" as they say.  While a main female of a tsundere troupe is something that we've seen again, and again, and again, Sakuya manages to break that in the WORST WAY POSSIBLE.  Compared to other tsundere characters, Sakuya manages to lean towards a tsuntsun personality, where she simply just doesn't show any soft side.  Any time she's in a fight, she does whatever she wants without any word or warning, and pays the price for going off alone recklessly.  It is with this unbreakable will of hers that comes off a character that is much hated by fans of the series because she lacks any sort of common sense and treats everyone as someone who is below her.  In fact, even the characters hate her, with practically every character pointing out her flaws time and time again in the series.  You know that whenever other characters point out one character's awful personality, he/she is an awful person.  \\n\\n\r\nAnd then we have Shinichiro, the fish out of water character in this story.  As someone who throws himself into the world of exorcisms, Shinichiro makes out to be the nice guy troupe, earning dokis from some girls in the series, while also not really having a personality to himself.  The entire series, Shinichiro plays the chivalry card, demanding that he protect and help Sakuya throughout the entire run of the series.  (Honestly, I don't get how he can do that given how she treats him.  It's like a slave pact in that household.)  He throws himself into the same situations as Sakuya, making himself to look like a \"hero\" of sorts while also not really doing anything cause he can't use magic.  So, useless MC.  \\n\\n\r\nApart from these two, the rest of cast show themselves to not only be more interesting than the main characters, but more developed in some sense.  The biggest example is Suseri as the series progresses with the slight character development that pushes her to be overall, a better character.  While side characters didn't really serve much of a purpose beyond being \"the crew\" that aided the main protagonists, they were still overall, much more likable than the main cast.  (A couple great characters, particularly the grandmother were never really used, and that really sucks for this series.)  \\n\\n\r\nBut the real killer I felt for the series aside from the demon spawn that is Sakuya, is the main antagonist of the series.  For one thing, the true main antagonist never really shows up.  This really puts a big hit on the series because as the audience, we don't really understand the goals of the antagonist or why he's doing anything.  Hell, we don't even know his name.  Instead though, we get a character known only as Isuca as the \"main antagonist\". (And no, while her name is the title of this show, she is not really a main character.)  The entire series more or less revolves around Isuca's antics as she sends random Youkai to attack people, swearing vengeance on the humans that she hates so much, a fact that you will never forget because she spouts out that shtick every 30 seconds of screentime.  Long story short, the antagonists are very underdeveloped and their motives are never learned, thus leading to the massive plot holes that are left by the end of the series.\\n\\n\r\nOverview:\\n\r\n+  Decent side characters\\n\r\n-   Completely unlikable main female\\n\r\n-   Generic MC\\n\r\n-   Antagonists are underdeveloped without any real character motives\\n\\n\r\nArt and Sound (5.55/10 and 4.98/10): The art for Isuca was made by studio Arms, the same company who produced Elfen Lied, and Brynhildr in the Darkness.  The art for Iscua really is nothing all that special.  The animation quality is subpar at best, so there's not really many things to say positively about it because of that.  What I can say is that the art does waver HEAVILY.  Depending on the background for the series, Iscua's artsyle wavers to the extent of it almost being on completely different spectrums.  When the show goes into daytime, it's fine, although a little meh at times.  But whenever the scene turns to night, the animation quality dips VERY quickly to the point of it having the same kind of quality from anime a decade back.  It is because of this that even the art for the series didn't impress me, but that wasn't all, oh no, we're just getting started.\\n\\n\r\nIn addition to the artstyle, Isuca adds in a couple of things not existent in the original series to make the show just a bit more ridiculous visually.  Those things are, blood and gore, and censor bars.  First off, the blood and gore.  It's hilarious.  Because Isuca was changed so that random Youkai kill people, the Youkai well, kill people and they kill people in an Elfen Lied way, where massive spurts of blood come out like a fountain from dead corpses.  Personally, I found this unneeded because it made the scenes that they were tied to kind of meh.  It didn't really add anything to the series because the only people getting killed were extras that we the viewers didn't really care for.  In addition, Iscua hosts a brand of censorship that is reminiscent of Terra Formers, with random flashes of light, or simply just a big black dot to cover up any breast or nether region that the series added in cause the actual Isuca admittedly, does actually have scenes like this.  The censorship is ridiculous, and it would've been better to not even strip the clothes off of the characters because it's so glaringly obvious as to what they were trying to do.  (Like seriously, a big black dot is just going to be more distracting.)\\n\\n\r\nThe soundtrack of this series wasn't anything particularly memorable.  Nothing stood out, and it was all rather meh in the grand scheme of things.  (Though, I don't understand the approach of having Sakuya put on a moustache.  What was the point of that?)\\n\\n\r\nOverview:\\n\r\n+/-  Meh art\\n\r\n-   Animation quality wavered heavily\\n\r\n-   Unnecessary gore\\n\r\n-   Censorship actually took away from the show\\n\r\n-   Forgettable soundtrack\\n\\n\r\nPersonal Enjoyment (3.50/10): When I first read up the Isuca series, I was rather intrigued by what could come from this.  While my expectations of the series after reading the manga were somewhat crushed on account of the 10 episode runtime, I never really expected anything quite like this...\\n\\n\r\nDid I like this anime?\\n\\n\r\nNo.  Plain and simple, this adaptation failed in every sense of the word.  It failed to capture anything that Isuca as a series had, it missed a lot of details in its storyline, and overall, just didn't sit well with me.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nReally though, I'd say this entire series is put to blame.  10 episodes have never been a good amount of time to make a complete series out of, so there were always bound to be mistakes.  As for what we did get, there wasn't one point where I was happy about the way things turned out,  (except for the Suseri episode) and I was unsatisfied with the approach that this series took.  While source material is something that an anime can deviate from, there is a certain degree as to how far away a series should be in from said source material.  Cause honestly, Isuca the manga, and Isuca the anime, are two completely different creatures.  Plus, Shinichiro, while does his job, doesn't EVER get paid.  He even points this out himself!  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nNo.  Isuca should be regarded as an anime that is a waste of time.  There is nothing proprietary about this series other than how genuinely horrible it is.  Above not following the actual story, having plot holes, and a really unlikable main girl, the aesthetics for the series are average at best and there's nothing significant that this show has to show for.  In the end though, Isuca is a failure of an anime adaptation, making itself to be a show that has zero redeeming qualities on account of everything being less than sub-par.  \\n\\n\r\nOverall Score:  4.04/10",
            "date": "2015-03-28T13:17:00+00:00",
            "helpful_count": 48,
            "mal_id": 183768,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=183768"
        },
        {
            "content": "Genre: Action, Comedy, Ecchi, Romance, School, Supernatural, Seinen\r\nEpisodes Watched: 5\r\nIsuca is another anime this season that tries to fit in with the rest, but can be considered another \"been there, done that\" type of anime. An analogy for this show could be that Isuca is a poor mans High School DxD or the latter. It seems to have an identity crisis within itself, it doesn't know when to be a romance, action, school, harem, super natural, or echi/fan-service when it comes down to it. It's on the road to be a not surprising disappointment. \r\nStory: 5\r\nThe story is rather straightforward, like the synopsis states, theMC finds himself working as a house mom/maid of sorts, where one family member of a renown exorcise group if you will, in the Shumazu family resides. He is ultimately mixed in her affairs because of a certain gift he possess, and it starts to go downhill from there for the would be lucky MC, as multiple females take their interest in him. As of now there is such a huge lack of information and substance regarding the plot, which makes for a really bland and sub par story. The pacing of the story isn't too much of a factor, but it's just the quality in which it's given is severely lacking. If there wasn't any gore, I would not take this anime seriously in the lightest.\\n\\n\\n\r\nAnimation: 7\\n\\n\r\nPossibly their wild card if you will, but still the other sum of its parts weigh down this only plus it has. The art and animation is fairly standard for current anime these days, but nothing really sticks out to write home about.\\n\\n\\n\r\nCharacters: 5\\n\\n\r\nAnother department where it suffers from its core. The characters are immensely reused and bland, that it's seriously worthy of an actual pace palm, besides possibly one character (meow) and that's it. Tsundere can be considered as a type of fine wine, you either have a refreshing taste for it or it might leave a foul taste, however in this case, personally I wouldn't even want to pop the cork. As already mentioned but, there is hardly any back-story to these characters, even the MC for heavens sake, which makes for a cast that no one really cares about, although they try to remedy this with flash backs, but still ceases to do anything with it. One easy way you can tell if an anime is good or not, is If you can remember the MC's name, heroine or a certain cast member of an anime you're currently watching, if you come up with a blank, you have you're answer; unless your watching tons of anime, but that's the only slack one has.\\n\\n\\n\\n\r\nWow Factor: 5\\n\\n\\n\r\nIsuca didn't have a strong debut showing other than the showing of our heroines favorite undergarments and oppai, but overall it seemly looked decent at first. Over these past couple episodes it's methodically on the decline, pertaining to the entertainment and overall enjoyment aspect and doesn't seem to know how to pick itself back up. This is a likely drop candidate. \\n\\n\\n\\n\r\nFinal Grade: 5\\n\\n\\n\\n\r\n+ True names\\n\\n\r\n- Nothing new\\n\\n\\n\\n\r\nWill I continue to watch this series?\\n\r\nMost likely not.\\n\\n\\n\r\nDo I recommend this series to watch?\\n\r\nIf you need a weekly fix of fan service and can withstand a mediocre story, this might be for you\\n\\n\\n\\n\\n\\n\r\n- Azure",
            "date": "2015-02-23T19:11:00+00:00",
            "helpful_count": 31,
            "mal_id": 181094,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3439279.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/azurexsky",
                "username": "azurexsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=181094"
        },
        {
            "content": "Overview:\r\nHow could something so generic be so ungodly horrible!!? Usually when a movie or series adapts a completely \"paint by numbers\" approach the result is mediocre, dull, and predictable. It won't win any critical awards, but it probably won't be one of the worst movies or shows you have ever seen! Look at the incredibly generic shonen formula that created Fairy Tail. They just recycled old shonen tropes and with no real effort or creativity they made a show that was pretty average in quality. Isuca manages to stand out despite all its generic cliches because it is SO lazy , SO poorly executed, andSO underwhelming in every category!\\n\\n\\n\r\nThe plot is that an incredibly obnoxious \"tsundere\" bitch is the latest in an ancient line of Demon Hunters and must strong arm an incredibly bland beta male into helping her fight Demons. Along the way, a harem will develop and a LOT of unfunny slapstick involving the male character being mistaken as a pervert will ensue. The plot is basically just what we've already seen in shows like \"Devil Hunter Yohko, Familiar of Zero, and a million others. What makes Isuca truly special as mentioned before is the spectacular level of fail in each category it attempts! The comedy isn't just bland or \"not very funny\". The comedy is PROFOUNDLY unfunny. The jokes are so cliche and the set ups leading to the jokes are so poorly executed that it almost seems like the show is attempting Andy Kaufman's style of \"anti-humor\". That clearly isn't the case though. Isuca really thinks that the kind of jokes that would have gotten a few grins and maybe a chuckle from anime fans in 1991 are going to get big laughs in 2015! \"HAHAHA She thought he was looking up her skirt and punched him while calling him a Baka!\" HAHAHA! That's the funniest thing I've ever seen in my LIFE!\" This is honestly how the director of this piece of shit thought audiences would react!\\n\\n\r\nNow that we've discussed the \"comedy\" present throughout the series, let's look at the erotic echii content. This series markets itself as an echii series and has frequent and shameless use of fanservice...but then it censors itself and doesn't even show panties! Forget seeing asses and titties, you aren't even going to see panties because incredibly awkward black bars of censorship will appear out of nowhere. The censorship is so amateurish and so unsubtle that you would think this was intended as a joke, but no. The series is simply THAT incompetent! The series honestly expects us to put up with incredibly obnoxious characters and unfunny jokes in order to see tits and be satisfied by seeing a black bar that someone did in 5 seconds with Microsoft Paint! \\n\\n\r\nSo the show isn't funny and no one could whack off to it. There are still things it could get right! Are the action scenes good? Does it have scary or tense scenes like it clearly wants to and spends so much time attempting? HELL NO! The action scenes short, poorly choreographed, and are marred by terrible CGI. The attempts at horror and establishing creepy atmosphere are equally inept and simply waste the viewer's time! This is one of those rare anime that manages to do absolutely NOTHING well from an objective standpoint.\\n\\n\r\nSo the CGI isn't very good. What about the character art and animation? Surely they did SOMETHING right in this flaming wreck of a series?! I have 2 words for you: \"Studio ARMS!\" Yes, in the distant past that studio produced some anime with decent art. However, in the past decade their quality has decreased each and every year. At this point the only other studio that can compare in terms of laziness and flat out not giving a fuck is Toei! \\n\\n\r\nOk, so it wasn't funny, wasn't erotic, had terrible art, obnoxious characters, crappy action, and was really boring...but what about the music and voice acting?! If you were optimistic enough to think they got this right...you need help. The music is utterly forgetable and the main 2 characters are voiced by a no name noob and the actress that played the little girl in Pupa! We're in great hands here folks!\\n\\n\r\nTo say Isuca isn't very entertaining would be the understatement of the century. Isuca is absolutely unwatchable unless you are a complete masochist! This is a show that took a cliche and generic premise and somehow through sheer laziness and ineptitude created a product that is astonishingly bad! This is to anime what Big Rigs Over the Road Racing is to video games. Congratulations Isuca! You are Loser!!!",
            "date": "2015-08-31T15:34:00+00:00",
            "helpful_count": 28,
            "mal_id": 197578,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=197578"
        },
        {
            "content": "Before watching the series, I decided to look up some of the reviews on this show from others on here. I was quite shocked to see so many 1/2 overall ratings. I feel that this series deserves a higher rating in the least.\r\nStoryline - 8/10 - I actually find the storyline intriguing. I really was into the storyline way more than I should have. \r\nArtwork - 9/10 - The artwork was really well done. I really liked the vibrancy, the pastel, and even the dark motifs in the show. \r\nSound - 8/10 - The music for the series wasn't astounding, but it was still verygood. The theme songs were alright, didn't wow me though.\\n\\n\r\nCharacter - 7/10 - I feel that the characters could have used more development. In a 10 episode series, it's hard to gather development in such a short amount of time. Though the series focuses on the two main people, I really feel that they should have included some of the side characters within the development (non-human wise).\\n\\n\r\nEnjoyment - 8/10 - I do say, I rather enjoyed this series. The minute I had read the synopsis about fighting demons and the like, I was thrilled to watch it. I like series like Inuyasha, RINNE, Yakumo, anything to do with spirits, youkai, etc... So this for me, was also really great to watch. Though, they could have um... did the censorship in a more different way? *sweatdrop*\\n\\n\r\nOverall - 8/10 - In total, it was a great series to watch. I really did enjoy the storyline, and I do hope they continue it. It's a series that, if you don't take the time to watch to it's full extent, you won't feel the enjoyment of the series.",
            "date": "2015-08-18T01:00:00+00:00",
            "helpful_count": 18,
            "mal_id": 196439,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3304.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xKiYoMiNaTiONx",
                "username": "xKiYoMiNaTiONx"
            },
            "url": "https://myanimelist.net/reviews.php?id=196439"
        },
        {
            "content": "When I started to watch this, I kind of expected it to be better as I am a reader of the manga, but surprisingly not.\r\nHere's the short summary of the categories-\r\nStory: 7\r\nThe story itself is a good thing in itself, has a male (kind of cliche kind, house-husband dude) who meets the short 5 foot 4 tsundere girl who uses a magical bow to kill spirits. Shit goes on from there when he realizes his part-time housekeeping job is with her. \r\nPersonally, there wasn't really that much manga for the writers to go off of and thats most likely one of the big reasons thisanime only has 10 episodes.\\n\r\nArt: 10\\n\r\nThe one thing the anime does extremly well is the art, especially in the lewd outro, which brings me to the second thing which kind of ruined the anime for me.\\n\r\nCensoring. The manga, (watch my true colors show here), had a lot of ecchi situations that gave it humor, and the anime just takes away the pleasure by darkening anything ecchi or gore related, which the anime actually does decently in.\\n\r\nCharacters: 6\\n\r\nTheres a loli-type...well actually we dont know what the grandmothers true body actually looks like yet (Spoiler).\\n\r\nShort tsundere heroine that would probably annoy the crap out of you in real life.\\n\r\nWeak kind house-husband main protagonist that has a hidden power that activates when you kiss.\\n\r\nQuiet busty shrine maiden girl whos sister to main heroine.\\n\r\nAnd a whole lot of side characters who the author is not scared to kill 5 seconds after introducing them.\\n\r\nYea that sums most of them up, next.\\n\r\nEnjoyment: 3\\n\r\nI personally wanted to be uncensored, as that was one of the perks of the manga, and had a lot more funniness to it...as well as arousement as I personally find the catgirl to be adorable (one of the few good things about this anime). I also noticed that the writers just didnt have enough to go off of and resulted to having only 10 episodes, and I personally think they should have waited a year for more manga to have a full on 24 episode season.\\n\r\nOverall: 6\\n\r\nAs stated before, the two main things that killed me were the lack of episodes and the overuse of censoring (this is supposed to be a gorey and perverted anime why make it if your going to censor it). If you are truly interested in this show, I suggest you give reading the manga a try. No bullshit censor and more story.",
            "date": "2015-03-28T00:59:00+00:00",
            "helpful_count": 13,
            "mal_id": 183700,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066335.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Somebody101",
                "username": "Somebody101"
            },
            "url": "https://myanimelist.net/reviews.php?id=183700"
        },
        {
            "content": "Lion Tamers, here we go again.\r\nThis time I'm gonna be contrary, and purposely choose an anime everybody only moderately dislikes to outright hates.\r\nThe chosen anime is \"Isuca\", and after watching the entire 10 episodes, I can confirm there are in fact some weak spots.\r\nBut there are some strong showings in this anime as well; in fact they are so good at points, I have to wonder if other folks and myself were watching the same anime.\r\nBut first, let's talk about the parts I had problems with, and I'll leave the good stuff for last. I know, I usually do it the other way around, butremember I'm being a bit contrary.\\n\\n\r\n-----------------------\\n\\n\r\nStuff that bothered me;\\n\\n\r\n1). Because of excessive 'Fan Service', the first episode had a lot of problems getting started.\\n\r\n I agree with others, there was a lot of it. This is especially true of the first episode. I'm not really bothered about it, because it's there. I'm aggravated because there was so much of it that it hammered the anime, in that the story just couldn't seem to get off the ground.\\n\\n\r\nWhile things did seem to fly after about the end of the second episode, the first episode was so distinctly outrageous that I almost gave up on Isuca right there. But settle down Isuca did, until the fan service dropped to a tolerable level, at least for me. First episode fan service content-11. After that, decreasing until it hit about a 5 level, and tolerable.\\n\\n\r\nBut first a bit of history. And why I have a gripe against the producers of Isuca.\\n\r\nI went to high-school in the 1960's. When I went to school, the notion of two young fellows sitting and looking out the window of class and ogling girls; was not unknown. The stuff that's unknown was the idea of talking about their breast size. It simply would not happen.\\n\\n\r\nEven the young members of clicks/gangs would almost never stoop to that kind of conversation. It was simply just too coarse and would have lacked dignity, both the girls, and the boys with the big mouths. I realize this is beginning to sound like the recollections of '... the good old days ...', but I'm actually quite serious. More over, this behavior was not something that was forced on us, by teachers or parents. It was just the way things were. Anybody that does that today, literally must stoop to such a level, that your neighbors' shoe would be impossible to see over.\\n\\n\r\nThe only thing this kind of talk means, is that fellows doing it are so frightened of girls that they don't have the balls to speak like that in person. And they do it in small groups, as a means of doing something they think needs courage while being buttressed by their fellows. This kind of behavior is a clear indication of cowardice.\\n\\n\r\nEither say it in person, and suffer a slap across the mouth; or shut up and learn manners. There is no third way.\\n\\n\r\nAnd so I get to the producers of Isuca. They made this show with that kind of content, on the assumption that this kind treatment of young ladies was normal and ubiquitous. It not only isn't; but points to an outrageous rejection of all things civilized. This show requires the understanding of what is Right, to make the philosophical issues meaningful. Fighting for what's Right, has no meaning when the only thing important to life, is what color a girls' hair is.\\n\\n\r\nI agree with other reviewers, in that there is too much of a certain worthless form of teenage bravado. While it happens in many anime productions, it is here in spades. And was a needless exercise. If the producers had decreased the fan service, they would have had much more time to develop the story better. The producers should have known better.\\n\\n\r\n2). 10 episodes, for a production this complex, is far too short.\\n\r\nIsuca is not a broken or haphazard effort; as intimated by other reviewers. It is merely too short to get some of the heavy lifting done, as to background issues, and character development. Does that mean the story is a clear fail? No. But there was not enough room to complete this effort in a fashion that might have been more satisfying.\\n\\n\r\n3). Music\\n\r\nThere was very little soundtrack, but that seemed tolerable. It was neither good nor bad.\\n\\n\r\nWhat was bad was the opening and closing musical songs. While they are cute and bouncy, and even the lyrics actually meant something in reference to the show (which I was astonished by), they are also J-PoP rubbish of the worst kind. I hate J-PoP with a passion bordering on vitriolic rage.\\n\\n\r\nI especially dislike J-PoP which is constructed by having the singers singing a song at normal speed, only to have technology enter the picture and speed them up to sound like chipmunks or squirrels. Even some of the instruments get this treatment, depending on what is required at the production company. It is an outrageous abuse of the artists involved, and it is so grating on my ears that I wanna throw things at my computer for uttering these noises.\\n\\n\r\nThe J-PoP tunes in Isuca are no exception. I tended to skip the opening and ending title sequences, just to blank out the outrageously bad music. I realize that some of the readers herein, actually like this sort of thing. But for me, anything else is better, except outright grunge heavy-metal. If J-PoP is so popular by itself, let's have a good singer which is fat and ugly sing the songs, and then we'll see how they sell!\\n\\n\r\n4). Voices, while all of the voice-actors did very well, the dialog they were asked to deal with had an issue I think could have had a work-around that improved the product. The Witch Isuca laughed so much, it actually got in the way of dialog, and the understanding of her character. Tone down the laughter, a little more in the ominous department would have solved all problems. The laughter only made the character appear so nuts that her actions looked out of place. Too nuts, is when a character can't possibly perform the activities we witness, in normal life. And that's where the Witch Isuca stands.\\n\\n\r\n5). The artwork.\\n\r\nThere's only one item, but it annoys me. Many new anime are beginning to give everybody eyes that have metallic tints. These colors are not normal for Human-Beings. And in extreme cases, it makes people look like their dead. Isuca uses these metallic highlights. I wish the artists would stop that.\\n\\n\r\n-----------------------\\n\\n\r\nNow I can do what I wanted in the beginning. And that is, discuss the parts of 'Isuca' I actually liked.\\n\\n\r\nThat being said I want to start with the plot. Many people felt the plot was a little dated, or just plain a repeat of many they had watched.\\n\\n\r\nWith that I want to make an aside comment. 'Visual Jaundice' can be a serious problem. Anyone that, over the last 5-years has managed to watch more than 500-anime and then read more than 250-manga; has now become a person with no life. Get out of the house, go watch a movie or a baseball game. Date someone, take a drive. But anime and manga, is not a substitute for life or understanding. And cannot possibly improve your understanding of either anime or manga!\\n\\n\r\nThe only thing too much of this stuff will do is cause you to arrive at a point where almost nothing will please you, or provide entertainment. This is true of any form of overdone entertainment. Too much of anything brings about a jaded attitude towards all things related. We all need more variety in our lives, to keep our perspectives fresh and clean. The purpose of Isuca, and any other anime, is to entertain. If you are so jaded that the parts of Isuca leaves no impact, then get away from all of this for while. You owe it to yourself.\\n\\n\\n\r\nLet's get to the good stuff, in characters and plot points.\\n\r\nWhile much of this plot is very rushed, especially under the restrictions of having only 10-episodes; the fact is the story is nothing less than way above average. It is not perfect, and it has development flaws, but the story is quite good and very watchable. Parts of this story is fresh and original.\\n\\n\r\n1). Did anyone notice the point about destroying all the churches in the city, to remove the basic spiritual protection of it; so that the large snake-monster could be brought in? Even the Witch Isuca confirmed this necessity. While there may be other anime that creates this idea; this is the only anime I've seen that has this plot point. After all, when ISIS goes into a country, what is one of the first things they attack? That's right. The churches and temples. Not just Christian churches, but all of them.\\n\\n\r\n2). Did anybody get the significance of Suseri and Sakuya Shimizu's growth of character? While most viewers might see only pain in the ass difficult personalities (what strong anime fans would call a tsundere); I saw much more. Both these girls were tortured into the state we find them, at the beginning of the series. \\n\\n\r\nSuseri was tortured repeatedly by her mother, into a person who rarely speaks (because she could not talk back to her mother), frozen in water at her mother's order (one wonders if her mother had ever to do this in her life?), forced out of archery without sufficient training (because her mother wanted to make sure Suseri did something that would not align Suseri with Sakuya's art form); and several other points?\\n\\n\r\nSakuya was tortured by the loss of her parents, and the reaction of her clan, both before and after their loss. Being the only representative of her own personal bloodline, in a clan that honored a pureblood history, is a tragic existence for a child growing up, and very painful.\\n\\n\r\nI know, boo-hoo. You live through that, and then tell me it has no significance. Both these girls are the product of their extreme and torturous upbringing, and somehow they find their way through all that; to grow wiser, stronger, more flexible to the changing winds of misfortune. And entirely thoughout the story.\\n\\n\r\nThis is a story about unbridled courage in the face of terror most of us will never face; by young girls and a young man; who never give up and find a way to succeed. This kind of courage is the reason we live, or we fail at living by rejecting courage.\\n\\n\r\n3). Did anybody notice how important Tomoka became? She is loyal, compliant without being a doormat, congenial, and affectionate. All of this, on the strength of basic kindnesses extended that you or I might find a slightly weak reason for all of that.\\n\\n\r\nTomoka is almost unique in anime. Let's see if I can make this simple. Maybe not. Tomoka is not a new kind of character. She stands as a cat-human hybrid, and is a magical monster, in that she can morph into several ranges between outright human, to housecat to monster cat. But the real charm of Tomoka is that she isn't really human in her personality.\\n\\n\r\nTomoka is a real cat, in the way she behaves. I have a 14-lb black female cat, with yellow eyes. And both my 'Inky' and Tomoka share all of the same traits. Anyone ever try to put a sweater on a full-grown cat? Not a great idea, you'll get clawed to death. Cats don't like to be clothed, as if they need it. It's wrong for cats, and Tomoka carries this trait. She will wear something, if it isn't too bulky, but she'd rather wear nothing at all. Which we see. While I'm aware most people see this as part of the fan service, it isn't. Tomoka is very cat-like in almost every way.\\n\\n\r\nTomoka likes to eat food on her own schedule. Housecats behave the same way. Tomoka tries to avoid violence, and most housecats try to do the same thing. Tomoka is very affectionate to Shinichirou Asano. And well she should. Housecats that learn to like their owners are equally affectionate, kind-hearted, and generally friendly. Even to the point of being clingy. Mine certainly is. Tomoka has every right to carry on the way she does.\\n\\n\r\nAll in all, Tomoka is so much like a real cat, that almost every other cat-human in other anime, pales in comparison. They tend to be for appearance only, taking on all normal human actions and responses. Tomoka is the real deal and I think she stands as a unique character.\\n\\n\r\n---------------------------\\n\\n\r\nWith all of the previous, I finish this review. This is certainly not an endorsement of the entire production; but I don't condemn it either. It stands as one of the fastest moving anime I've ever watched. 23.5-minutes per episode, and you get more than 40-minutes of information.\\n\\n\r\nIsuca is certainly not a ten rating, but the ratings from other reviewers in the one-or-two range is also not equitable. The story stands up, it has length and breadth, develops as the story travels from episode to episode; and in the end, sets itself up for the next set of episodes.\\n\\n\r\nMy only fear is, Isuca will not return and clean up or finish what it has started. With such a wonderful start, it deserves another chance, and another set of episodes to create something really new in the fantasy school quasi-harem genre. \\n\\n\r\nI give Isuca a very strong 7!\\n",
            "date": "2015-04-09T01:24:00+00:00",
            "helpful_count": 12,
            "mal_id": 185198,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KD7BWB",
                "username": "KD7BWB"
            },
            "url": "https://myanimelist.net/reviews.php?id=185198"
        },
        {
            "content": "I finally got the time to do this review on this sad disappointment of an anime that was hard for me to watch, but since it was only ten episodes i thought I mind as well finish it.\r\nStory: 2\r\nIsuca is your typical ecchi/harem anime about a boy name Shinichirō, a male student who gets a job as a housekeeper in order to pay his rent. While on the job, he accidentally releases a strange creature into the world, and he learns that his female employer named Sakuya Shimizu is the head of the Shimizu clan that hunts these creatures. Shinichirō cooperates with her to huntdown the monsters that are running loose. Now the anime really doesn't bring anything new to the table we haven't seen before, really you can say the plot is very generic and predictable and at times cliche and boring that made me what to drop it at times. \\n\\n\r\nArt: 4\\n\\n\r\nNow the anime's art isn't anything to brag home about ether at times the show would stop animating and the show had one of the worst censorship effect I have seen since Terra Formars, but other then that it was ok\\n\\n\r\nSound: 2\\n\\n\r\nNow I don't remember this show's score at all, mainly because there wasn't anything remediable at all. The op and ed where cool I didn't find myself liking them as much as some animes, but they fit the shows atmosphere.\\n\\n\r\nCharacter: 1\\n\\n\r\nOk, there is one word that fits this main cast of characters in this show generic. None and I mean none of them do anything we haven't seen before in a ecchi/harem anime like this one. The main character Shinichirou is wimpy, weak and only there to be a cock tease to his harem. Then theirs Sakuya the main heroine who is just a tsudere who has a secret past that doesn't get to much explaining in the series, and then you have the  other characters that really don't do anything for this show just more for his harem.\\n\\n\r\nEnjoyment: 1\\n\\n\r\nSadly I didn't find myself enjoying this show at and at times I was bored and would scheme through the episode just to get it over with.\\n\\n\r\nOverall: 2\\n\\n\r\nOverall Isuca is a very bad and generic anime that bored me to the point it made me want to drop it but I stuck in there to the end. In my opinion there are other shows that are from the same genre that are way better, I think you should avoid this anime if I were you.",
            "date": "2015-03-28T14:30:00+00:00",
            "helpful_count": 10,
            "mal_id": 183780,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4416449.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/qdsqjmsdnakdnp",
                "username": "qdsqjmsdnakdnp"
            },
            "url": "https://myanimelist.net/reviews.php?id=183780"
        },
        {
            "content": "The very first line of dialogue in this anime goes something like this.\r\n\"You will have your life force sucked out, in exchange for the ultimate pleasure\".\r\nThat's actually a slight paraphrase, but everything you'll need to know about this anime is said in that very first line of dialogue. I'm not going imply whether this anime is \"good\" or \"bad\" because that's not up to me. For the purpose of this review, I'm basically telling you to interpret that line, in the most literal sense possible, and decide if watching Isuca is worth your time, based just on that one line. That is all.",
            "date": "2017-02-03T20:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 239855,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4003743.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/YEROCKY",
                "username": "YEROCKY"
            },
            "url": "https://myanimelist.net/reviews.php?id=239855"
        },
        {
            "content": "The story is fine. However too much effort is wasted on ecchi and some slow motion you-know-what part. 4/10\r\nShinichirou is like a support character, simply there to resupply the energy of the girls.\r\nNothing to complement/complain about the sound or music.\r\nThe art is done quite nicely but I can only give a maximum of 4/10 for it because the whole battle scene is basically censored thanks to all those ecchi and seinen contents.\r\nThe action + seinen combination in this anime is one of the worst I've seen. Also, whats with that ending?! It felt like 2 episodes or more being cut off directly. Overall 4/10with tons of question marks in my mind what the heck I just watched.",
            "date": "2015-04-01T08:59:00+00:00",
            "helpful_count": 9,
            "mal_id": 184380,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4525380.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ele9",
                "username": "Ele9"
            },
            "url": "https://myanimelist.net/reviews.php?id=184380"
        },
        {
            "content": "This will be a short review due to it being a late review. There is a simple thing to understand about Isuca that can quickly determine whether or not you will enjoy it. \r\nIt all comes down to one question: Are you able to stomach a very weak male MC if the rest of the show is decent? Because that is really what Isuca comes down to. The art and animation is good. The action scenes are well done and the plot itself isn't half bad. But that MC. Oh boy oh lord that MC. Asano is quite possibly the most pathetic soyboy \"Indecisive wuss\"clone character I have ever seen - and I have seen a lot of anime with this type of male lead. Saying he has no balls would be an understatement. He also has a hidden power that requires no effort on his part and only serves as a weak attempt to give him a place in an anime about exterminating youma. \\n\\n\r\nEverything else about Isuca is a solid 8/10, brought down heavily by a bad main character that almost makes you feel like you are watching Twilight with the genders reversed. If you don't mind the \"Shinji clone\" main character type, then you will likely find Isuca more enjoyable than the average rating. If you do not, then skip this one. He never gets any better throughout the entire series and will only serve to annoy you. \\n\\n",
            "date": "2018-02-13T14:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 271440,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1315147.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The_Walker",
                "username": "The_Walker"
            },
            "url": "https://myanimelist.net/reviews.php?id=271440"
        },
        {
            "content": "I decided to use a random generator to pick which anime to review first. As luck would have it, it chose the worst anime I've ever seen. \r\nThis is my first written review for an anime, so wish me luck.\r\nI rated it according to MyAnimeList's standards (so 1 would be appalling).\r\nStory:\r\nI'm not going to lie to you. I watched the entirety of Isuca and have no idea what the plot is about. Were I to take a guess, I'd say it's about a bland male main character getting caught up in the world of a blonde female main character who's name isn't Isuca but Ithought it was so what does Isuca mean? I don't know. Wait. What.\\n\r\nWhat's this aforementioned world consist of, you didn't ask?\\n\r\nWell, not much different to ours I suppose, minus the inexplicable spider-women demon things, the consistently pandering and derogatory nude scenes, and the unexplained demon hunting that appears to be going on.\\n\r\nSound exciting?\\n\r\nIt's not. It's awful.\\n\r\nI know I haven't really explained the story properly, but honestly the story felt so generic that you could probably go watch any other light novel adaptation and get the same feel.\\n\\n\r\nArt:\\n\r\nBarebones basic 2004 anime art is constantly present. There's no 'woah, didcha see that!?' moments and the animation is sub-par. The main character must have been spawned from the most boring human beings to have existed - not that any of the other characters look any better, but I digress.\\n\\n\r\nSound:\\n\r\nI can't remember. Let me go listen to the Opening again...\\n\r\nWell that was a mistake. There's a reason I buried that corny mess into the furthest recesses of my mind.\\n\r\nThat's not to say that the voice acting was abysmal though. I just think Kido Ibuki is probably not suited to play the role of an intentionally unbearable tsundere character. Her performance as Rinka Urushiba in Tokyo ESP last year was very good, so I'll boil it down to miscasting.\\n\r\nUnfortunately, Keisuke Koumoto doesn't lend his full potential as a voice actor to the main character, Asano Shinichirou, who ultimately ends up coming out as flat and disinteresting. Though again, it's not like he had much to go off - considering his character development could be summed up by a mute.\\n\\n\r\nCharacter:\\n\r\nWell I've already touched upon the characters quite a bit, but I suppose I could explain myself a bit more.\\n\r\nFirst we have Asano Shinichirou, the main character. I know nothing about him.\\n\r\nSecond, we have Isuca - no, wait, sorry - Sakuya Shimazu. Possibly the most aggravating character to come out of the anime industry in quite some time. Her character screams 'tsundere', but not in a good way. See, whereas Asuka and Kurisu both succeed at playing the confusing role of the tsundere, Shimazu flops at every opportunity. Every time that Asano may accidentally have Shimazu land upon his crotch beyond his control, she lashes out violently, screaming and hurling kicks and insults. The creators probably thought she seemed cute, but she just comes out looking like a bit of an unreasonable and relentless bitch. \\n\r\nWhy Asano hung around with her for 12 episodes I'm not entirely sure. Probably for love. Or something. But then why would he fall in love with her? She's a dick. Because anime, maybe.\\n\r\nThere's also the generic neko-pandering catlady who follows the Isuca norm of having no character development. She's not really worth talking about.\\n\\n\r\nEnjoyment:\\n\r\nI didn't. I mean, I just didn't. I've seen Mars of Destruction and Skelter Heaven. I know what bad anime looks like. Yet I rated this lower than them both (though they also got 1s). Because I didn't have to sit through 12 whole episodes of Mars of Destruction. I didn't have to watch approximately 240 minutes of Skelter Heaven.\\n\r\nI've tried to find something worth praising in this show, but I honestly can't.\\n\\n\r\nConclusion:\\n\r\nDon't watch this. The first minute of episode 1 is misleading. There's gore and breasts, yes, but go watch Elfen Lied if you want that so bad. There's plenty of good anime out there, but this isn't one of them.",
            "date": "2015-09-15T21:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 198666,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2908361.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Dayface",
                "username": "Dayface"
            },
            "url": "https://myanimelist.net/reviews.php?id=198666"
        },
        {
            "content": "Simply put, this anime doesn't deserve the condemnation that the vocal minority are currently giving it.  Just look at the MAL rating compared to the top like 6 most \"helpful\" reviews.  For this rating with so many 1s... means there are FAR more (on a scale of far more than 2:1... since most people don't give only 1s and 10s) people who found it to be enjoyable in some way.\r\nThere is nothing spectacular or innovative about the story/art/etc...  However, in order to be enjoyable doesn't require any of that.  This is an ecchi harem(ish) anime, you should never expect it tobe ground-breaking just based on the genre.  It has a solid story, standard art, decent voice acting, at least ATTEMPTS to form some character backstory (which alone makes it impossible to be called the WORST anime in existence), and is oddly relaxing and enjoyable to watch.\\n\\n\r\nThis is a simple anime.  Nothing complex.  It's short (only 10 REAL episodes... plus an obligatory ecchi trope of girls on the beach OVAs).  And it is simply enjoyable.",
            "date": "2018-01-12T16:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 268338,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3648499.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stangryn",
                "username": "Stangryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=268338"
        },
        {
            "content": "It is NOT a comedy and it is barely a romance and not realy ecchi. This anime is a action drama with horror scenes. So yes i gues you can understand why its score is not so good, it is because description is all wrong.\r\nSo in story there sre some girls hunting spirits and there is that guy that is helping them. And i gues if youre looking for an easy horror action anime then you may even like it, however if you want to enjoy a ecchi romantic comedy then go watch something alse.\r\nAnd its not unusual that people try to sell dramas ascomedy for some reason, i usualy get lured to watch such animes by wrong description.",
            "date": "2018-05-03T13:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 279707,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7134195.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rasly2",
                "username": "Rasly2"
            },
            "url": "https://myanimelist.net/reviews.php?id=279707"
        },
        {
            "content": "i am only giving my prospective for this review\r\nwhen i first watch this anime i thought that this only normal anime nothing good nothing bad\r\nstory\r\nnothing new kissing the male protagonist will boost up her power in a small amount of time just \r\nlike negima but on negima kissing is like a contract that can boost up the femail character and they can reactivate and deactivate there power.(well depending on the negima SEARIS).\r\nAnother thing her mission is basically the same as negima (well i haven't read the manga if the is any realist so i am basing this information on the 1-10 episode of isuca )\\n\\n\r\nArt of the anime is good, sound and music fair the opening is good. in character prospective i have my favorite character who is Shimazu, Suseri  that boost the rating of this anime one of the main reason i continue to watch his anime, she is a shrine maiden who is suited the be a Japanese Exorcist.\\n\\n\r\nwell for my prospective  for the hero Shimazu, Sakuya is she is like class C tsundere that doesn't have a spark or sign of cuteness when she acting tsun-tsun \\n\\n\r\nwell for other information my friend told me that i am a fan of femail supporting character rather like a side character than the hero of the anime. like sayuri kurata of kanon T_T\\n\\n\r\nand for enjoin-met of the anime is normal over all rating normal fair. for% of watching the anime probability some part of the episode\\n\\n\\n",
            "date": "2015-03-28T03:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 183708,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4522705.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/latias9003",
                "username": "latias9003"
            },
            "url": "https://myanimelist.net/reviews.php?id=183708"
        },
        {
            "content": "What is Isuca actually? Honestly, after watching 5 episodes, no idea yet!\r\nI did enjoy watching the first few episodes, specifically 1 - 3, whereas 4 started to get weird and a bit annoying due to clichés and whatnot.\r\nStory - 1\r\nBecause the score itself says \"pathetic\" which I couldn't agree more, not only did it fail to convey a story in half it's story line, having folklore creatures and having characters does not count as a story. I wasn't expecting a masterpiece nor a pure story driven anime but this was just painful.\r\nArt - 8\r\nThis was the better part of this anime, I found spots thatwere not exceptional but it was overall enjoyable to watch, I mean excluding the fan service, it was a good eye candy at parts. But also made me wonder what were the directors, artists and animators focused on. A given example of good art was the ending, felt really high quality and sharp, plus the heroine looks hotter then in the real show.\\n\\n\r\nSound -7\\n\\n\r\nThere were no noticeable aspects regarding sounds, it was not great but it wasn't bad at all either, if I would have to choose I would put it on the better side, it was pleasurable to see the animations being in sync with the sound.\\n\\n\r\nCharacter - 1\\n\\n\r\nAgain, pathetic, no character depth at all but the occasional flashbacks which has no relation to their personalities at all, at least that's what it appears to me. As scenes went on the sociable aspect between characters felt stiff and forced, doesn't feel like they even tried and just went for anything ecchi.\\n\\n\r\nEnjoyment - 5\\n\\n\r\nI can't give it a really bad score because sadly I did enjoy some portions of it and mediocre describes my feelings toward it accurately. The only enjoyable parts were mainly the art, sound and the Ending, also a bit of ecchi here and there, but if it wasn't for the story I would've liked this anime.\\n\\n\r\nOverall - 3\\n\\n\r\nEven with a score of 3 overall I still feel like being generous but honestly if you want to watch it I would advice you to get ready to grit your teeth in frustration and the rage of wanting to stop watching it midway.\\n\\n\r\nWould I recommend this anime? Yeah sure, why not? You surely will find some parts of it that you will enjoy but be warned that there's a really heavy negative side to this work, story and characters. Hope you enjoyed reading this review and that it helped :)",
            "date": "2015-09-14T17:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 198614,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/166033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/dskilly",
                "username": "dskilly"
            },
            "url": "https://myanimelist.net/reviews.php?id=198614"
        },
        {
            "content": "See this anime is the same as standardize what is the same in all anime and assemble a fully animated \"cliche\". The story, if I may call it a story begins in a very simple manner and results from fully \"standard\" way of animes \"ecchi\", with a very simple action scenes and bland.\r\nThe appearance of the characters are literally generic other anime without any differentiating characteristic. The personality of them are also simple in a way \"cliche\". The male protagonist and a standard character in my opinion if not the protagonist it would make no difference in the anime. Already the female protagonist and withouta doubt the character \"tsundere\" simpler and more gave me \"sleep\" all anime I've ever seen.\\n\r\nThe anime itself is bland, without history, without different characters of \"extras\" in other anime and in my opinion was the \"worst\" anime \"gender\" of the season and play will be the worst of the year (in my opinion) .\\n\\n\\n\r\n- Original ( Portugues ) :::: \\n\\n\r\nVer esse anime é a mesma coisa que padronizar o que existe de igual em todos os animes e montar uma animação totalmente \" cliche \". A historia, se é que posso chamar aquilo de historia começa de uma forma totalmente simples e decorre de maneira totalmente \"padrão\" de animes \"ecchi\" , com cenas de ação totalmente simples e sem graça. \\n\r\nA aparência dos personagens são literalmente genéricos de outros animes, sem nenhuma característica diferente. A personalidade deles também são simples de certa maneira \" cliche \" . O protagonista masculino e um personagem padrão que na minha opinião se não fosse o protagonista ele não faria diferença nenhuma no anime. Já a protagonista feminina e sem duvida alguma a personagem \"tsundere\" mais simples e que mais me deu \" sono \" de todos os animes que eu já vi. \\n\r\nO anime em si é sem graça, sem historia , sem personagens diferentes de \"figurantes\" em outros animes e na minha opinião foi o \"pior\" anime do \"gênero\" da temporada e se brincar será o pior do ano ( na minha opinião ).",
            "date": "2015-04-27T16:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 186614,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4468469.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Kuroittei",
                "username": "Kuroittei"
            },
            "url": "https://myanimelist.net/reviews.php?id=186614"
        },
        {
            "content": "A review of *Isuca, an ecchi with a surprisingly interesting world.* \r\nIsuca's first three episodes led me to rate it as the worst anime of the winter season, and yet the series turned everything around to make arguably the best ecchi of the winter season.\r\nAt first, Sakuya is the typical old school tsundere that annoyingly kicks the protagonist for absolutely no reason, and while she still retains much of her tsundere-ness, it is toned down later in the series. Shockingly, a romance between Sakuya and Shinichirou forms towards the later part of the series. It is not prominent or conclusive, but it goes to thepoint where it is clear that those two characters are together rather than the usual indecisiveness of harem protagonists. \\n\\n\r\nIsuca's best aspect is its world of east vs. west society of mages and magical. While the concept is not explored nearly enough, and it may not be all that original, the overarching story is somewhat interesting for a harem. Unfortunately, there is no conclusion, but the combination of Japanese lore and western magic creates an interesting dynamic.\\n\\n\r\nFor an ecchi, Isuca is an above average with a decently executed world, concept, and characters. With that said, saying that those aspects are good “for an ecchi\" does not mean all that much compared to anime in general, but it has just enough positive elements to make me actually want to see another season to further expand upon the fantasy world.\\n\r\n_Watch if you like:_ Ecchi, Harem, Supernatural-Ecchi,\\n\r\n*-5.0/10*\\n",
            "date": "2015-04-17T06:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 185800,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3578061.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JamestheReviewer",
                "username": "JamestheReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=185800"
        }
    ],
    [
        {
            "content": "*Note: Review is based on 6 episodes( I'm surprised I didn't drop it earlier like I was as an infant, just kidding.) Also this review can seem very biased and is purely my opinion and I recommend you don't read this review if you're easily butthurt* \r\nForgot to mention HAS A VERY TINY BIT OF SPOILERS IN THE CHARACTER SECTION\r\nStory (Score 1): Alright you got the MC here who's a complete \"nice guy\" type of person that literally you could fuck his girl say sorry and still wouldn't get mad( or says he it's the inside that matters / it's ONLY the personality that matters).Then you got the main bitch alright , this girl is the complete opposite of nice guy which for one is difficult material to work with ( not saying all tsundere+nice guy ships are bad just that it's not easy to write a good story out of them.) *Fun fact: MC wears crocs, yes CROCS in the special episode, shows you how much of a faggot he is.*\\n\\n\r\nArt (Score 2): I'm going to get hated a lot of this part because I have pretty high standards when it comes to art. I mean we are in the 21st century what is this art. Excuse my hypocrisy for one second but if the story is good enough then art can be over looked (Ex: kill la kill).\\n\\n\r\nSound ( Score 3) : I don't have much to say for this literally nothing special and I'm not too sure how I feel about it which is also why it has the highest score out of all the other sections\\n\\n\r\nCharacters (Score 1): The characters make me want to kms , in fact I've never seen characters in anime this bad before. It literally has not even a single bit of originality. Sexy teacher , it's there. Girl with big boobs, it's there. Loli , it's there although shes technically not a loli because she's the grand mother of main bitch tsundere and she could possibly be a lot older but I don't remember or it was never mentioned in 6 episodes. Antagonist that shows up and surprise fucks everyone in his/her first appearance, it's there. There's probably more but I couldn't remember the others.\\n\\n\r\nEnjoyment (Score 1): I think I'd rather watch 2 girls 1 cup. Literally made me want to kms.\\n\\n\r\nOverall (Score 1): I'd only recommend it to that one friend that recently started watching anime and won't stop asking you for your \"top 10 romance/harem/action/comedy , etc. * This is the end of the review but continue reading if you wish to read more of my biased opinion pointing out it's flaws* If you anyone ever wanted to make a parody of cinema sins and for anime , this would be the first one that I suggest as there's at least one flaw/cliche cringe action that MC makes or somewhere in the story. Or if you've ever had an annoying cousin/person/friend in your life  and want to ruin his/her life this would be your most optimal weapon of choice, for one it doesn't get you in jail if that person kills him/herself after watching this and  is probably more lethal than telling him/her to drink bleach because this anime is going to leave a bad taste in their mouth for the rest of their lives and they're going to wish they drank bleach instead.",
            "date": "2016-02-16T20:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 211073,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Turtlesses",
                "username": "Turtlesses"
            },
            "url": "https://myanimelist.net/reviews.php?id=211073"
        },
        {
            "content": "This anime has widely been received as completely terrible with no redeeming features and hence that may have had a major effect on my expectations, but overall I just found it to be okay, not really bad or good. It is incredibly generic. Most characters fit into roles that have been done a million times before and though there is character and relationship development, its the standard stuff that goes exactly as you'd expect and implemented only decently. The plot too is tremendously predictable, and doesn't really have anything that pops out as super interesting or as a major unexpected twist, being largely forgettable. Thecombat had structure, which I thought was nice, though the implementation of such was rather weak as there were only a couple moves and overall the battles weren't that cool. The only things that popped out to me as noticeably strange was tonal issues, in that parts that had a horror/creepy tone with blood/gore were put back to back with scenes that were supposed to be the complete opposite, which was noticeable jarring and didn't really work at all. The art and animation were okay. The soundtrack was forgettable. The OP/ED were pretty good though. So all in all, nothing much struck out as good, and nothing really struck out as bad, and hence I thought it was completely nonoffensively plain. It was enjoyable enough for what it was, though it isn't really special in anyway. \\n\\n\r\nAn incredibly generic anime that doesn't have much to like or dislike.\\n\\n\r\n7/10",
            "date": "2018-10-03T18:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 290841,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=290841"
        },
        {
            "content": "If you like ecchi, just watch it. The story is bare-bones.\r\nThe animation is stiff, rushed, choppy and basic. And mind you i watched the Blu Ray version. So don’t expect anything from that department. It is as average as it gets.\r\nThe main character, Shimazu Sakuya, has a recurrent trope where she constantly hits the other main character, Shinichirou Asano, for whatever reason. I found it surprising that for an anime that lasts 10 episodes, Sakuya's behaviour gets annoying and repetitive extremely fast. Looking like she won't be able to break out from her psychotic tsundere personality.\r\nThis makes her character unrelatable, repulsive and appalling to withstand.\r\nDefinitelysomething i hated throughout the series.\\n\\n\r\nThe story is bare-bones, right on the start of the first episode you are supposed to understand a lot of things that are happening that never got explained in the first place. So that's a rough start that lasts until mid series where most things get finally clarified. \\n\\n\r\nThis anime has lots of fan service and titi shots, so if you like hard ecchi anime, you'll like this anime.\\n\r\nA huge point is the gore scenes, very direct and crude. Definitely liked that and expect the amounts of blood it had to offer.\\n\\n\r\nOverall, it is rushed and bare-bones, of course the ending is not the original one since the anime started in Jan 24, 2015. And the manga ended in Apr 4, 2017. Yet that is not a good enough reason not to watch this anime.\\n\r\nThe poor quality is withstandable.\\n\\n\r\nIt has a cat girl, big tits, small tits, nipples, magic and gore in its favor. If you are into that, give it a shot. This has nothing else of value.",
            "date": "2018-07-15T12:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 284050,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3505977.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JAMPS",
                "username": "JAMPS"
            },
            "url": "https://myanimelist.net/reviews.php?id=284050"
        },
        {
            "content": "To start there is a lot of gratuitous fan service in this anime. That aside it is a very enjoyable show. Obviously from the ending they were hoping for a second season. It needs one please. I'm sure I'm not the only one who feels that way. \r\n       I do not get technical about art, story, or sound. If I like the characters and enjoy the show, I consider it a good show. I liked this show and could not tell you why I just did.\r\n       Itwas a simplistic premise. The harem was underdeveloped. The main is annoying. Despite all that I really enjoyed this show.\\n\r\n       It fulfilled what I wanted it to do. It entertained me to the point that I stayed up till 2 on a work night to watch it in its entirety.(I get up at 6.)\\n\r\n       In short if you are looking to be entertained this anime delivers. Nothing heavy to think about , nothing breathtaking to look at, just a good batch of entertainment.",
            "date": "2016-06-26T22:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 222118,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5383141.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/UnkaFunkie69",
                "username": "UnkaFunkie69"
            },
            "url": "https://myanimelist.net/reviews.php?id=222118"
        },
        {
            "content": "Shinichirou Asano is lucky to still have his life after saved by (at first sight looks like) an archer. He was targeted by unwanted creature in the lonely street of the night, and the creature was exorcised by this female archer. Later fateful encounter meets these two, Shinichirou finally knows who save him at that night, she is Shimazu Sakuya. The young girl from Shimazu Clan in his age is the head of the clan whose job to eliminate the creatures from endanger human.\r\n       The main character, Sakuya Shimazu, is a short-tempered weak type of girl which makes everyaction looks terribly bad and goes to negative side. Whenever the action goes through our screen, that's also the time Sakuya bluntly goes freak or uncontrollable. The action itself isn't something so wow about, too average even the genre itself is mentioned action and supernatural. Sometimes I wished for the action but I was half-hearted myself to watch the battle scenes. Sadly, it's worsen by too much talking during fights (lovey-dovey between Sakuya and Shinichirou is damn fail ouch), and logic thinking to explain the fights plus strategy is poor.\\n\\n\r\n    From what I can assume, the weak characterization is showed to lure our feelings like she needs to be caring of, weak enough to get attention and pity from viewers. I regretted it because it makes Shimazu as if she doesn't have the real feelings as core of the story and influential characters. The deepening characterization is faint by its forcing weak characters. It tried to boost the sense of loss Sakuya of her parents after all. The characterization focuses on this loss and unstable maturity.\\n\r\n        For a show with a little explanation of Specters, the family head, summoning and so on, it does really a slow one to come up with conclusion or strategic planning, like when the logic way to prevent attacks, logic way to explain cases, or even logic way to just elaborate how the enemy works (ex: a smoke spirit in the tunnel goes offense effectively in a small place and with its smoke to ambush them). Then, the gore I expect wasn't proven by the show, similar like other series which involve quite harsh battles where you can find slicing parts of body, splattering blood, so simple like that.\\n\\n\r\n[somewhat SPOILER] The silly scene was in the first battle that involved appearance of western mage in their school, where their friends captured and Shimazu just focused on attacking the enemy without letting her heart answered. and when it answered and decided to help them, it was freaking too late. Their friends captured and sunk into a concrete wall, they died because of the attack Shimazu gave to the enemy's force, then the show told us about the absolute incident like this will occur if the enemy's force killed when captured humans, and showed how shock and trembled Shimazu. What the heck was with the feeling and poor rationality in the late time? duh\\n\\n\r\n      The music aspect doesn't help either but the soundtracks aren't as bad as the show itself. The OP theme is sung by Afilia Saga titled \"Never say Never\" and for ED theme is sung by TWO-FORMULA \"Somebody to love\".\\n\r\nI can't agree for more with majority of reviewers, say this anime is bad, I would like to give it 2.\\n\r\nCons:\\n\r\nThe animations\\n\r\nPoor characterization, too out of focus\\n\r\nUnworthy plot\\n\r\nI feel the series has no meaning to be delivered except being weak will help you gain supporters.",
            "date": "2016-07-21T23:48:00+00:00",
            "helpful_count": 0,
            "mal_id": 224636,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224636"
        }
    ]
]