[
    [
        {
            "content": "Watching \"ef- a tale of melodies\" is not like watching a regular anime, but more like an artistic painting come to life. It really is a unique experience!\r\nStory: 8/10\r\nTaking place after the first installment known as ef- a tale of memories, we now follow the tale of most of the supporting cast from the original I just mentioned. Going into this I was a bit bummed that they didn’t decide to simply go with a whole brand new cast for this, but it actually worked out quite well, as this time around we get to learn more about: Kuze, Mizuki, Yuuko and Yu. (which againwere simply the supporting cast from the first ef series) And get a better understanding as to who they are, and also answer questions that were not answered from the original. You will be transported back and forth from the past to the present, as the overall plot can only be understood by doing so. Now watching this series you won’t really find anything particularly new here with the story, most of the events that take place are more along the lines of what you would see in a Soap Opera---in other words, lots and LOTS of drama here. Basically each of the four cast members will (or eventually) fall for one another, each having to face their own personal demons (just a medifore) in the process. Most of them are not quite what they appear to be at first, and as the story progress you get a much more in depth look as to who they are. The way it is told though, is what really makes \"ef- a tale of melodies\" stand out. You don’t just simply watch the story and love scenes progress like you would a regular anime. This one is told in a more artistic tone. For example: when the characters are in deep thought from a certain situation, you may see them in a room by themselves--or even see them all chained up as a black silhouette, (this of course represents that the certain character is a prisoner either to themselves, or by another) and a lot of it takes place in the character’s mind and not in the physical form. So you can’t go into this series expecting a \"what you see is what you get\" idea, because this series doesn’t do it that way. Setting the artistic themes aside for a moment, the situations themselves are pretty standard for a drama, which may turn off some people and give the feeling to them that the whole \"medifore\" idea is simply there to only cover up a more standard fared story. Which quite honestly isn’t too far from the truth, as many scenes tended to last quite long, and sometimes seemed to give a more slower pace to the storyline. Still, what it lacks in actual new material with its story, it makes up for by the artistic way it shows it. It also has a worth while ending too! \\n\\n\r\nArt: 10/10\\n\r\nThe art of this series is so rich and detailed, I would expect nothing less from the \"ef\" series, in fact just watching the opening scene with the paper airplane gliding along the sunset sky, is truly appealing for the eyes, as is the entire series. The character design (while nothing particularly new) is well distinct. I especially liked the eyes of the characters. The water effects that come from the ocean will seem to just glide across your screen so fluently. And the character animation and backgrounds are truly superb!\\n\\n\r\nSound: 8/10\\n\r\nI have to say that the sound was the weakest link for me in the anime, the opening and closing were indeed well planned out tracks (both ranging from soft and sincere, to catchy \"finger snapping\" tunes, \" one even sung in English no less) The background music was a bit lack luster though, while you do get nice and appropriate orchestral music that plays in the back during events, nothing ever really stands out too much, with the exception of Kuze’s violin piece. The voice cast was a bit of a \"hit and miss\" for me too. Most of the deep males voices were nice at complimenting the artistic theme of the anime. But most of the female cast I found to be a bit on the standard side, with the exception of a girl name Yuuko, her’s was well fitting the part. Overall it was a great soundtrack, but it just didn't seem to be quite as good as the original's. \\n\\n\r\nCharacters: 9/10\\n\r\nI really liked each and everyone of the characters, nobody ever came off as annoying, or would make you feel that they tossed one in just for the sake of doing so. I was especially captivated with the character \"Kuze, \" he is a musician with a quite interesting past, and the turmoil he goes through is quite sad--yet exciting at times. The character chemistry was a bit rushed for one of the couples, but seemed to be pulled off appropriately at the end. Since half of this title is all about back story, you get a pretty in depth look into the character’s lives and can really connect with just who they are, and will feel what they feel!\\n\\n\r\nOverall: 9/10\\n\r\nef - a tale of melodies is a truly satisfying experience if you can appreciate it’s approach in things. It's debatable as to whether this one surpassed the original or not.  It can at least be said however, that this is truly an outstanding sequel! If you prefer a simple and casual romance themed anime then it would probably be best to avoid this one. As many of its extended medifore scenes may tend to drag out and frustrate some viewers. But if you’re an anime fan with a taste for the arts, or perhaps looking for a new way of viewing a romance title, then this series is for you. ef - a tale of melodies is not spectacular in what it shows...but how it shows it!\\n\\n\r\nSide Note: If you are interested in watching this title, I would recommend watching the prequel first. As some of the original main characters from the first make an appearance here, and the whole overall story can only be understood fully from both sides.",
            "date": "2008-12-26T12:02:00+00:00",
            "helpful_count": 178,
            "mal_id": 10653,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=10653"
        },
        {
            "content": "Tale of Melodies is like watching Leonardo Di Vinci paint a sequel to the Mona Lisa. He's technical skills has improved, his techniques more refined, but does he have enough soul to mold a creation that matches the sheer brilliance of the original?\r\nAlmost...\r\nNote: If you have not see the Tale of Memories, do not read this review. It'll be rather meaningless.\r\nMake no mistake, Tale of Melodies is definitely not a mediocre sequel. Judged by itself, Melodies would fit the true hallmarks of a classic. Watching episode after episode is akin to surfing upon waves of pure emotion, there will be scenes that are guaranteed toeven make terminator a little teary.\\n\\n\r\nLike its original, Melodies is an utter masterpiece of both visual and melodic artistic direction. The visuals accentuate the emotions in every scene, the speech often feature rhythmic and even poetic undertone; when you watch Melodies, you do not feel like you're just watching an anime, but rather appreciating an awe-inspiring piece of art.\\n\\n\r\nWhere's most anime are content to have the animations fluidly and attractively portray an event,  Melodies goes five steps further. Each and everything scene, including even the placement and subtle variations of the OP, are the way the way for some subtle purpose. There's little else to be said but to experience it. If Clannad for a 10/10 for art, Melodies surely deserves an 11.\\n\\n\r\nIn terms of technical and artistic talent, Melodies arguably surpasses its original. Yuuko's suffering in Episode 6 for example, ups the ante even in comparison to the famous phone messages of Miyako in season 1. So what keeps Melodies from rivaling memories?\\n\\n\r\nIt's certainly not the art or the music, nor is it likely the characters. The dialogue and characters remain strong, with a subtle since a humour that'll be familiar to anyone who enjoyed memories. The story, at outset, looks to have  at least equal potential. On the one side, you have Mizuki, whose must find a way to bestow her love (Kuze) with the will to live and fight against a terminal disease. On the other, you have Yuu, who must save Yuuko from a history of abuse.\\n\\n\r\nYet, in watching the entire series, one can't help but feel something's missing. In the final episodes, there was just not quite the rush of anxiety one experienced when Chihiro tore out the pages of her diary. Perhaps some of the sudden twists in Melodies was too sudden and lacked the anxious suspense the original; perhaps it was the lack of something to rival the powerful metaphor delivered by the tale of the only girl in the world. The episodes of Melodies, while individually excellent, didn't appear to quite to weave together as flawlessly as the original.\\n\\n\r\nOr perhaps it is just inspiration, or soul. \\n\\n\r\nJust as Leonardo developed better skills after painting the Mona Lisa, SHAFT's technical capacity only improved after memories. Yet Melodies just has that little bit missing...\\n\\n\r\nIt's not quite the masterpiece memories was, but remains a brilliant piece of art.",
            "date": "2008-12-26T20:39:00+00:00",
            "helpful_count": 125,
            "mal_id": 10669,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=10669"
        },
        {
            "content": "*Please watch ef: A Tale of Memories first, because there is a continuation of the love stories presented in the prequel. Feel free to read my review for Memories also.*\r\nAfter watching Memories, you probably asked yourself these questions:\r\n- Why does Yuuko pop up out of nowhere and disappear before you can blink an eye?\r\n- How do Yuuko and Yuu know each other?\r\n- How do Renji and Chihiro; Hiro and Miyako; and Kyousuke and Kei's relationships continue?\r\nef: A Tale of Melodies will answer all of those questions as it introduces the background of vague characters from Memories: Mizuki, Yuuko, Yuu, Kuze, and Nagi. There is abrilliant connection between those characters and the ones from Memories. Just like in Memories, there's drama, psychological history in characters, brutal pasts, and everlasting romance resulting from someone refusing to let go of the person they love.\\n\\n\r\nThe anime shows three stories:\\n\r\n- Yuuko and Yuu have one of the most romantic histories in the series, mainly because they knew each other since childhood. They met each other in an orphanage when they were younger. Yuu lost his little sister in an earthquake in Japan, and he rejects Yuuko because of his grievance. Once they meet again in high school, Yuu regrets how he treated Yuuko after he finds out how brutal her life became after she left the orphanage. Determined to protect the woman he loves, he goes through all odds to hold onto her.\\n\\n\r\n- While visiting her cousin Renji in Australia, Mizuki was introduced to Kuze by Renji's mom. Mizuki heard a beautiful song played by the violin one day, and Renji's mom insisted that Mizuki and Kuze spend time together. Mizuki and Kuze spend the next few days together in Kuze's nearly-empty house. After confessing her love for Kuze, their relationship began to blossom. Shortly, Kuze began pushing Mizuki away to avoid hurting her, even though he loved her, too. Despite Kuze's medical condition and his rejection, Mizuki is determined to stay by his side no matter what it takes. You should see all of the crazy yet romantic things she does to make him happy.\\n\\n\r\n- Relationships from Memories continue...\\n\\n\r\nArt and Sound: The art and sound fit perfectly together. It is more museum-like with the mirrored bodies and masks. As the art is displayed, dramatic music is played simultaneously. Kuze's violin piece and Yuuko's improvised lyrics fully explains the moral of the entire series. In order to avoid confusion, the anime presents footnotes at the end of each episode to describe certain terms and references mentioned in the episode. Also, it attaches the time so you can recall where you heard the reference.\\n\\n\r\nCharacters:\\n\r\n- Yuu is an artist and draws quite often. He never desired to join the Art Club, but he drew amazing landscapes and portraits, especially of Yuuko. His dream is to create a beautiful city filled with kind people, which is why he stayed in Australia.\\n\r\n- Yuuko was Yuu's lover in the past. She is now the magical advisor that appears before the main characters to bring happiness to them all. With the same dream as Yuu, she is located in Japan.\\n\r\n- Kuze is a famous violinist and Renji's next-door neighbor. He struggled with a personality disorder ever since he had a heart spasm during a concert. As he awaits for his death, he attempts to end all relationships in an attempt to make it so that he simply disappeared.\\n\r\n- Mizuki is Kei's close friend and appears off and on in Memories. She's quite energetic and refuses to shed a tear in front of others. After graduating from Otawa Academy, she moved to Australia to live with Renji (her cousin). There is when she met Kuze.\\n\r\n- Nagi is the elder sister of Hiro, Kei, and Chihiro. She used to crush on Yuu in high school but lost to Yuuko. She later became engaged to Kuze.\\n\\n\r\nJust as Memories, you're in for some deep romantic stories.",
            "date": "2013-10-25T02:25:00+00:00",
            "helpful_count": 49,
            "mal_id": 118189,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=118189"
        },
        {
            "content": "&ldquo;Right art tells right people the right things\"\r\nI don&rsquo;t remember exactly in which movie did I hear this phrase, but it has haunted me ever since the first time I heard it. It contains in itself an irrevocable truth about human mind, that tastes are not \"universal\", but rather contained in each individual. \r\nThus some people would manage to enjoy stuff like Rosario to Vampire and Miley Sirius music, while others might rather puke at mere mention of them. \r\nWhere does the difference lie? In the intelligence of the one who enjoys it, perhaps? I doubt it.  If such were the case, it wouldbe reason, not emotions, the one that would makes the difference, and its a well know empirical fact that don&rsquo;t &quot;think&quot; you like something, you just &quot;know&quot;. (It is more probable that intelligent people might be reluctant to be lumped up with &quot;the stupid&quot; and avoid everything that&rsquo;s &quot;main stream&quot; like not long ago the aristocracy rejected that which was done by those not belonging to noble class. )\\n\\n\r\nI think the difference falls into the capability of the subject to relate it self with the art. Once it become something similar, akin to experience, one can truly understand its meaning and able to get its true message. Think of this: love songs will often sound &quot;shallow&quot; and &quot;stupid&quot; until you fall in for the first time. Then, Oh!  everything make sense. In fact , Too much sense \\n\\n\r\nWhen one &quot;gets&quot; what they are talking about, then you can move on to the next phase.   The art cannot only speak of what you have already experienced, but leave you with a new perspective of the situation. It might affect your way of thinking altogether and change you for good. That is right art, one that is not only a passive object, but one that becomes part of the observant and modifies him into something new.  \\n\\n\r\nWith that in mind, I can say with out regrets that Ef- a tale of memories/melodies ( I must consider both, since they actualy belong to the same game)  is not only a piece art, but &quot;right art&quot;.  It tackled to of my favourite topics (God and death) and managed to give me new perspective into those issues, and some little changes in my view of my life as a whole. (it may sound exaggerated and melodramatic, but think how many people had their life changed because of Evangelion. That one did screw up my entire generation, and almost every generation after that one. Compared to that this one is just a mere breeze )  \\n\\n\r\nWith that in mind, I must lay down a warning. You might find it either a Masterpiece or no more than a cheap soap opera with around 15 minutes of talk and 10 minutes of Songs. It depends on your capacity to relate to the story, which in itself depends on the way you had lived your life so far. It will also depends in the reason you have to watch anime as a whole, or even in your emotional states as you go throught the episodes.\\n\r\nThen, I specially recommend trying it if had ever thought you are fucked up and hated God, if you had loss someone you loved, or if you like pretty drawings and shiny colourful scenes that have nothing to do with the story. If you are not one of those, I could still recommend it if you have nothing else to watch, if only so you can brag about it later and write condescending reviews to mocks those who didnt like it so they can see how cool you are.",
            "date": "2009-01-05T06:56:00+00:00",
            "helpful_count": 44,
            "mal_id": 11127,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92902.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/nightsword",
                "username": "nightsword"
            },
            "url": "https://myanimelist.net/reviews.php?id=11127"
        },
        {
            "content": "Ef- a Tale of Melodies is somehow an unnecessary sequel. Unnecessary in a way the first season didn't let any hole for a new season, as I felt it was complete and didn't need to go on. Even tough, I was still thrilled to watch A Tale of Melodies since its predecessor was absolutely beautiful. Perhaps, it would be as beautiful or as interesting.\r\nSadly, I could only dream about it.\r\nThe story is presented in the same pattern as Memories, at this point the viewer shouldn't be confused in the way it's made.  While most of the cast are back, they actually switch roll ina sense that the main characters of the first season would become the support cast and vice versa. The most drastic change some can feel while watching Melodies is that is darker than the first season and perhaps darker than someone would Imagine. And here's the problem, both of the story arcs were dark and yet they both failed to have a sense of suspense. SHAFT was successful in creating a blend of suspense and romance in the first season(Notably the ending of the Hiro-Miyako) and thus the reason why A Tale of Memories was very good. One could think that A Tale of Melodies would be a parallel. Well, Shaft didn't succeed this time.While the stories had a premise start, As darker these story arcs were, they also felt more cliché, more unbelievable and sadly more boring as it was getting to its end.\\n\\n\r\nI also have to point that ending didn't have the same expectation as the first season. While A Tale of Memories felt completed, the ending of a Tale of Melodies is left with the feeling that there's still something more to tell which can leave an unsatisfying feeling for the viewers.\\n\\n\r\nNothing can't really be said against the art except for some of the characters design that really felt bland or been done before. Truly amazing backgrounds and sunset. The SHAFT art, which consist of high contrast, simple colours, black and white and so on is also magnificent as it played a key role in the most important scenes.\\n\\n\r\nA Tale of melodies did deliver a great cast, no doubt about that. Yet, the series still suffered from few characters who weren't developed enough and made them quite uninteresting(Notably Nagi, who even though she's a supporting character, still had an important role). Another problem that can be regarded is the quality of the dialogues. The series did have some good dialogues, yet a lot of them were predictable, silly and also cliché.\\n\\n\r\nI have to admit, enjoying the series was quite hard. While I admit Melodies had beautiful moment and memorable SHAFT scenes, it still suffered from long scenes where all it did was turning around the block(Not getting to the point).\\n\\n\r\nIn overall, A Tale of Melodies could have been a great sequel there's no doubt about that. We hoped for something as good or better, but it isn't the case. Like I said, it had a premised start and the only element needed was a good execution. This element was never included.\\n\\n\r\nBeside, most of the fans of first did like this one. I guess I wasn't in the majority. So go on, flame me.",
            "date": "2010-01-17T16:08:00+00:00",
            "helpful_count": 34,
            "mal_id": 22473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/219844.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Wilio",
                "username": "Wilio"
            },
            "url": "https://myanimelist.net/reviews.php?id=22473"
        },
        {
            "content": "\"Sequel.\" A variety of reactions could be displayed when seeing/hearing this word: \"I hope this is as good as/keeps up with/better than the original.\" \"Will they explain that?\" \"No, this is enough; anything more will ruin the story.\" Some more of this piece of crap?\" \"Yes, more of this show!\" Of course, I had the last sentiment. It is no easy task to follow up on a story. As we all know, if something drags on for too long, it loses its essence, and I believe that usually, beginnings are the best part of anything. Rarely they are not. This is an especially difficult taskwith an anime as great as Ef. I can safely say, though, that Ef - A Tale of Melodies lives up to its prequel, Ef - A Tale of Memories.\\n\\n\r\nThe anime is based on an adult visual novel, called Ef - A Fairy Tale of the Two, with original female character design by Nanao Naru, who also did the manga version. The mystery of Himura Yuu and Amamiya Yuuko finally unravels here. Firstly, let me give you a proper synopsis.\\n\\n\r\nAs narrated by the protagonist, Himura, there are two cities called Otowa, one that is built on the burnt rubble of its former self, and another that is a fake mirror of it. Yuu and Shuuichi are talking while the latter is burning his letters, ending his relationships, including one by Nagi, which, though rare of her, he does not read. In the past, a high school boy was walking down the street, when he noticed a girl on a roof. He went to her, and the two talked. It seemed as if she, Amamiya Yuuko, knew who he, Himura Yuu, was, yet, he did not recognize her. She proceeded by saying that she still hated Yuu. At school, Himura saw the words \"Art room - Hirono\" on his desk, and exclaimed \"ano baka (that idiot).\" On his way there, to his surprise, he met with his friend, Kuze, who was having a flea market before going abroad. After Shuuichi learned where Yuu was going, he wished him a safe trip (as if he were leaving to a dangerous place). Near the art room, Himura also met with Amamiya Akira-sensei, who thought that Yuu was at last joining the art club, like Amamiya had always wanted him to, but Himura quickly and bluntly dismisses the idea. Holding an unlighted cigarette, Amamiya said that it is horrible how people are always drawn to art, whether it is voluntary or by being dragged thanks to those who are, advising Himura to simply join. After reaching the room, Yuu witnessed Hirono Nagi there, drawing a nude self-portrait with no clothes on. He immediately told her to wear her uniform, thinking that what Amamiya had said might really be true, then she forced him to go shopping with her, much to his dismay. Going home, they noticed a girl, Amamiya Yuuko, following them. A conversation ensued between the three, and ended up with Hirono throwing a sketch book she wanted to give as a present on Himura. Yuu and Yuuko went to the beach, where the former eventually said he remembered the latter. At the present, Hayama Mizuki, who is about to enter college by recommendation, is staying with her cousin, Asou Renji, a former protagonist. After waking up from another bad dream, she realizes that famous violinist, Kuze Shuuichi, is living next door, and insists on meeting him to hear him play nama (live or bare; there is a small joke on that here and a big one in B Gata H Kei). Renji suspiciously tries to prevent her from doing so, but he has no choice, since, unlike Mizuki, he has to study for college examinations. She finally meets Shuuichi, who immediately reminds her of Tsutsumi Kyousuku, another previous protagonist and her senpai, Shindou Kei's boyfriend; a womanizer. He agrees to play with her. However, Mizuki notices strange things at Shuuichi's place, but for which he always comes up with an excuse. First of all, his living room contains very little furniture, making Hayama think Kuze is about to move, but he says he just likes big spaces. Second of all, she tells him she wants to hear him play the violin, but he replies he cannot, and after being inquired as to why, he says it is broken. Third of all, a clock alarm rings in the afternoon, and Shuuichi exclaims that it is for his stomach (to eat). Mizuki only finds drinks in the refrigerator, but he informs her he has ice as well. Kuze speaks in a formal manner, which Hayama picks up on, but he explains that he has to talk this way, as he meets a lot of people, likening it to wearing masks, which he has hung up on the wall. Mizuki lightly says that cat masks are kawaii (cute), and asks Shuuichi to lie on the ground with her, just relaxing and enjoying the lack of shoujo manga, which she loves, that takes up space in her room. Later, however, when Hayama leaves, Kuze, alone in a dark room, feels a severe chest pain, and is forced to sit on his couch, saying, \"not yet . . .\"\\n\\n\r\nA good mystery is answered with more mysteries, as this season does. One of the few down points this series has is a supernatural element that is revealed at the end. Those who finish it will understand. I still like the morals that are taught, though.\\n\\n\r\nThe best way to continue a series is by showing past events, linking them to current ones, which Ef - A Tale of Melodies brilliantly and intricately executes, despite the aforementioned extraordinary happening. Showing the main characters as young kids is informative and gives depth to them. Seeing the lead, Himura Yuu being more carefree and displaying funny facial expressions is refreshing from his current more depressing, somber self. The same thing can be said of the heroine, Amamiya Yuuko, who is now a serious, wise girl, where she was outgoing and always smiling, hiding her true feelings. Hirono Hiro, the prequel's protagonist's oneechan (older sister) surprisingly plays a major role now, where she was just mentioned as part of his pseudonym, Shindou Nagi. Their love triangle is similar to Hirono Hiro, Miyamura Miyako, and Shindou Kei's, where two of them have a friendly relationship, and a girl appears, changing things. Another surprise is that two people have met before any of them could remember, but it happens later, in episode ten, the best and saddest one, although it is in black and white.\\n\\n\r\nThe opening sequence is also played in black and white. Similar to the previous season, the song, portraying the main characters, is in English, except for the final episode, twelve, where it is played in Japanese, which is better, with the same catchy tune. In one episode, the piece is instrumental (referring to the title, I believe) (showing no characters), and, at one time, the ending sequence is a slowed-down version of the opening sequence without the melody; both of which never took place in the prequel. Again, however, like the first season, the ending sequences vary, with some of them dedicated to the heroines. The soundtrack and seiyuu in general are amazing.\\n\\n\r\nOne of the other reviewers said that he wanted a different cast for this season. What is that about? The entire series revolves around Himura Yuu and Amamiya Yuuko; it would not be right to leave their story hanging, though I would not mind if there were an unrelated (or related) third season, because I could not find another series even close to this one in terms of epicness, but that is highly unlikely, since it is based on a game that has already finished, as mentioned in the Latter Tale's trailer.\\n\\n\r\nI could talk on and on about how wonderful this show is, but you will have to see it for yourself. This is romance, drama, and tragedy at their best. The artwork is beautiful and the story is spectacular. I guarantee you will love this anime. It is my all-time favorite one (along with Ef - A Tale of Memories).\\n\\n\\n\\n\\n\\n\r\n\"You will never see Amamiya Yuuko again.\" - Kuze Shuuichi",
            "date": "2011-07-01T03:07:00+00:00",
            "helpful_count": 21,
            "mal_id": 38537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/487479.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Seijurou",
                "username": "Seijurou"
            },
            "url": "https://myanimelist.net/reviews.php?id=38537"
        },
        {
            "content": "It is so beautiful, i enjoyed it better than the first season.\r\nThe characters are really well-made and have very deep connections with the ones in the first season.\r\nThe plot is even better than the first season; the beginning is a bit strange but it just keeps getting better and better.\r\nThe music is what i like the most. Every song was perfect in the moment they placed it, they're also really beautiful and fit the series perfectly.\r\nThe art is really something. Not only the abundance of opening versions they made, about 8, but also the landscapes and those romantic moments; the art it's been worked ona lot.\\n\r\nI really enjoyed this series to the4 point i cried in the last episode. If you like original romantic anime I strongly recommend this. It's not your typical romantic story, it's fantastic.",
            "date": "2008-12-27T09:16:00+00:00",
            "helpful_count": 19,
            "mal_id": 10682,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116937.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lotusres",
                "username": "lotusres"
            },
            "url": "https://myanimelist.net/reviews.php?id=10682"
        },
        {
            "content": "I often see people making the comparison of this anime to Clannad. But in my opinion, that is a little misleading. Unlike the focus on family with a general tone of warmth. ef is more like finding that dwindling bit of fire in the cold world and live on with an iron will.\r\nOtowa, the place where the story takes place in, is spelled as 音羽 in kanji. \"音\" means \"sound\", referring to the Suuichi's violin, and how the music will stop when the bow stop. \"羽\" refers to the eternal feather of Yukko and the continuation of hope. \r\nIn fact, the theme that carries throughoutboth season of ef is the decision of eternal and temporality. Like 13 hours of memory that Chihiro has and Renji's untiring pursuit of her. Or the conversation between Hiro and Mihako on the telephone. Unlike other shows that ask rhetorical questions and never answer them. ef gives its solution. \\n\\n\r\n\"No matter how much you treasure them, both people and things will die someday. The bonds, the feelings, the memories, the hearts, and their lives. There's nothing in this world that won't die. There's nothing that won't break. Happiness is nothing more than a fabrication; a false mirage. That's why... That's why we should treasure them. So that we can face the farewell that'll one day visit us without regret. Because it'll break, it is precious. Let's make it precious.\" \\n\\n\r\nThe anime is also filled with symbolism and clues in its progressively changing op, use of colors, camera transition screens and even the tiles of each episode. (hint: the first letter)\\n\\n\r\nI guess the reason why I spent this much time writing this \"review\" is that I don't think people truly appreciate this anime and how barely anyone mentions it in anime discussions. I guess that's the fate of being an art piece: not being financially successful and is only enjoyed by the few. Yet, a part of me almost doesn't want it to be popular. Like that small cafe down the corner of the street. You enjoy its quietness and the coffee and want to share it with more people. Yet that would ruin why you like it in the first place: the peacefulness.",
            "date": "2019-01-24T17:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 299942,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6504333.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/whi",
                "username": "whi"
            },
            "url": "https://myanimelist.net/reviews.php?id=299942"
        },
        {
            "content": "ef - a tale of melodies is a deep, unique anime embedded with both strong and subtle themes in a purposeful elegance.\r\nThe second season of the ef series (tale of memories was the first season), a tale of melodies comes full circle. A tale of melodies is an awe-inspiring storyline that can be described as enigmatic, ephemeral, and turbulent, yet leaves an impression that (ironically) is vivid, lasting, and resolute. Little about tale of melodies is immediately straightforward, yet that is what makes the story possess the kind of depth that enables it to project multiple themes.\r\nWhile the first season (a tale of memories) confoundedmany viewers with its strange representation and plot development, a tale of melodies thrilled using the same strategy. Much of it is attributed towards the familiarity of the intended audience to some of the characters and better continuity associated with brilliant storylines.\\n\\n\r\nAs a warning, I would not recommend watching a tale of melodies before a tale of memories although in my opinion a tale of memories is a much inferior work, as it is important to understand the characters, which a tale of memories did not do as well or project to such a high level of excellence.\\n\\n\r\nOf the many facets that make a tale of memories amazing is the number of thematic layers it possesses with such an unpredictable plot. The depiction and manipulation of time and space within the anime was played to perfection by allowing viewers to see the anime from multiple perspectives (each with their own unique set of themes) that eventually merge into one. The anime is is devoid of 'filler' and each scene has a purpose.\\n\\n\r\nOne of the things I found to very impressive about a tale of melodies was that it was able to preserve the continuity and consistency with story and character despite the entropic pace and developments within the story. Everything that happens possesses a meaning, yet nothing is immediately obvious before it happened. Often the anime has abrupt shifts in themes, yet blend with masterful synergy. Nothing from the anime is what it initially seems, and that is one of the reasons it is so good. In a sense, the creators imposed a set of strong themes towards the viewer without giving anything away, which is rarely seen in animes with similar storylines. \\n\\n\r\nAlong with depth and uniqueness, the broad variety of characters with different personalities, behaviors, beliefs, and even morality added more color and detail to the already intriguing anime. The level of information gained within each character was amazing given the anime's short length (12 episodes) to develop each of them. Not only were the creators able to do that, but they also developed the characters to such a high level of synergy  that each character was connected to the other characters within a large web that if broken would distort the entire anime. To develop an anime that can sustain such a brilliant plot and strong themes while navigating through such a fragile web is nothing short of masterful.\\n\\n\r\nHowever, in the end what makes a tale of memories a masterpiece is its message. It pieces together many facets of life such as distress, egotism, nostalgia, love, sorrow, loss, and hope and knits it into a quilt that provides different messages based on the viewer. Although the message might vary from person to person, it is undeniably profound.\\n\\n\r\nA tale of melodies is a work of art. It paints a medley of characters in a world that it cannot be detached to and leaves viewers amazed.\\n\\n",
            "date": "2012-01-02T02:45:00+00:00",
            "helpful_count": 15,
            "mal_id": 50717,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332050.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KnightessKana",
                "username": "KnightessKana"
            },
            "url": "https://myanimelist.net/reviews.php?id=50717"
        },
        {
            "content": "Future?  A unknown phenomenon that occurs after the present moment. You’ll never know what might be in store for you so the only thing you must do is gather your courage and determination and march forward!!\r\nIf you have watch the prequel of this story then you will not be disappointed however have you ever wonder who was the girl with the blue hair was. She always appears when the main characters are in a slump, troubled on what to do next. Exactly who and what is she? a deity? a ghost? She appears and then disappears without a trace. Also who was Himura,he seemed to know a lot of the answers regarding life but is it from personal experience? He was waiting for someone and in the end the first series, he was waiting for Yuko, the girl with blue hair but who is she and what exactly is their relationship? Well you are about to find out in this sequel to E.F: A Tales of Melodies!! If you like the first series with the crazy philosophical sense in the artwork and in the setting then you w]on’t be let down. This time it isn’t just full of drama.. it has action too.\\n\r\nThis time this story is focus on the characters that were giving guidance (Himura, Yuko and Kuze) to the protagonists of the first series. We get to look into the proof behind those words that help the young protagonist out, starting with the view the relationship that Himura had while he was in high school. After all Himura is the protagonist of the story and present Kuze. That’s right instead of 3 male lead, its 2! \\n\r\n\tThis series rather than focusing on the emotional dilemmas and love ties like “A tales of Memories” this series does indeed has those trait incorporated but it takes them to a whole another level. This one incorporates the themes from the prequel plus the addition of torture and suffering of losing someone. The only difference is whether one wants to enjoy ever last moment they have or try to forget them before they get to deep. The protagonist is rather considerate to others yet very cruel to himself. He would rather suffer and die alone without bothering anyone or hurting anyone too deeply. In one view point he is very courageous but in another viewpoint he is very conceited. Though it is a really painful decision to make and not anyone could have this determination to break all ties. \\n\r\nThe other protagonist however is face with a more traumatizing dilemma. Everyone has a scar that can never heal after losing a loved one in an accident, but everyone has their own way of recovering over it. In Himura’s scenario, it’s rather intense. He encounters his childhood friend who got adopted before him and learned something horrifying about her. Nobody could be more prepared to suddenly lose a loved one. No can cope with the facts right away. Wounds take time to heal especially the one in the heart, but this scenario is insane. “When one thinks of another’s feeling and blame oneself, it actually makes the other suffer more. But when the one inflicting the pain is the one who felt the most pain. When one loses a loved one, one could recover by the comfort and support from family or friend but what if that family or friend is the one you lost and there’s no one else who could help you? This person found a replacement for their loved one. Instead of showering them with emotion of the one they lost, they inflict pain on the innocent. However there is a twist!!... \\n\r\nAs the plot deepens, the story gets more realistic in the way where we could somewhat apply in our own lives. This story shows us a grander psychological angle. However the similarity between both characters is that they are both running away from reality. They seem to be thinking they are doing the right thing but that is only for self-satisfaction. They are insecure and thinking it’s the right thing to do. However they are scared to face the truth!\\n\\n\r\nAs always the artwork is fantastic as well, the symbols of the scenery really capture the mood and setting. Plus the variety of colors really describe the mood of the characters and sort of sending out a subliminal message on how the viewers should feel. The characters are drawn in the same way as the first series, and the character get drawn in a different frame all locked up to inscribe to us how they are feeling inside. Showing us this abstract scene really get oneself engross on the character. This part I don’t despise but sometime I feel frighten on how the story unravel. However that is this anime’s hook!\\n\\n\r\nThis anime is truly a beautiful piece of work. It is magnificent, how the story is laid out the way it is. I especially like how it has more than one male lead in these romance stories because that way the story does end and not leave the viewer hanging and also for other people to not loathe the author for not matching up the character with the one they chose. \\n\\n\r\nHonestly to sum up this series, I’ll end with a quote!\\n\r\nThis is a story of “Will.” “People who walk toward the future will eventually reach the place that they once dreamt of. Toward the tomorrow that gleam of light”\\n\\n\r\nI highly recommend this anime to those fanatics out there who really loves a good romantic, sad and tragic anime. You will really enjoy this and will be engross with it. Hope you enjoy it as much as I have. \\n\\n\\n\r\nCan you hear it? The Melody of Truth\\n\\n\\n\r\n~Later\\n\r\n--------------------------------------------\\n\r\nFun Fact that I notice:\\n\r\nThe pen name that from the first series that Hirono Hiro used was “Shinto Nagi”\\n\r\n“Shinto” last name from Shinto Kei\\n\r\n“Nagi”  First name from his sister Hirono Nagi \\n\\n",
            "date": "2012-02-08T12:03:00+00:00",
            "helpful_count": 14,
            "mal_id": 53473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/494748.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ray357",
                "username": "ray357"
            },
            "url": "https://myanimelist.net/reviews.php?id=53473"
        },
        {
            "content": "I enjoyed the second EF much more than the first. Story lines were much deeper in this, characters seemed more realistic.And while I liked how they kept with the 2 main stories at a time deal as they did with the first, the flow between these two seemed almost seamless and really complimented eachother. \r\nAs for the story, like any anime I watch I can't tell how much I'd like the story fully until the ending. Far too many times do animes with great stories ruin it with the end. The end here was a bit anticlimactic for my tastes, it wasn't completely screwed upto the point of ruining the series for me but it seemed a bit meh for all the tension it was building.\\n\\n\r\nIf you watched the first EF you will notice that the main charaters in this one are the side characters from the first season. I loved this part. Usually I hate when an anime dives off its main story line into side characters excessively, but this being a new season with a whole new story line and the original being completed I loved it. Really original, while the main characters from the first season appear here as side ones. Great concept. \\n\\n\r\nThis one threw in 2 different plot twists than memories, the first being the time aspect, one of the stories occurs during the past and if you've watched memories your pretty much know where it's going to go. But the way they alluded to this story line durring memories was so interesting to me. They teased you with it and never told you, until melodies. \\n\\n\r\nThe other is the distant thing. I was completely unaware during memories that the two stories were occurring on different continents. This part really didn't come across well at all. The characters switch around what country they are in at the drop of the hat, they made many mistakes as to who was in what country when (Listing them would all be spoilers)  While I liked how they tied the characters together some of it just seemed forced and trying to draw the line between how this character knew this character from where- when the lines were crossing constantly and across continents just made my head hurt. \\n\\n\r\nAs for the characters themselves, much, much better than memories. I'm really impressed with how much of an improvment they made with this one. You grew to genuinlly care for these people for the most part, I hate when a writer wants to have two characters fall in love and instead of taking the time to build a logical relationship, showing the cause of the love between to characters they basically just shove them together for a day and when they come out declare their love for one another for no apparent reason. (Or not a believable one at least) While memories was riddled with this problem, melodies mearlly featured it. A little more build up in the love story would have been good, but this wasnt horrible. \\n\\n\r\nMiki was the one character that just got under my skin. And as her earlier story line progressed, got really confusing. The earlier parts gave her depth, but I really wish they had expanded on that because as she is now she just seems like the typical ditzy anime girl. \\n\\n\r\nAs for the visuals in this one I didnt find them as dynamic as I did in the first. This one was all about good characters and good deep story lines. Memories to me relied way more on its looks. The english in both series's OP and end were a funny listen, though with the amount of drama contained within the episodes probably not the time you want to here something funny. I dont think anyone would find it romantic if I walked up to them and told them I wanted to see their insides. They should have just done them in Japanese, it would have come across much better and taken the cheese factor down a notch for me. \\n\\n\r\nOverall this was a pretty good anime. Some minor flaws keeping it from perfection but after memories I am pleasantly surprised with this one. Defnitley worth the watch.",
            "date": "2009-06-30T04:30:00+00:00",
            "helpful_count": 12,
            "mal_id": 16274,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/181267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BurningLeaves",
                "username": "BurningLeaves"
            },
            "url": "https://myanimelist.net/reviews.php?id=16274"
        },
        {
            "content": "This is probably one of the most beautiful, yet complex anime that I have ever laid my eyes upon. Every little single details in this anime are continually emphasized to draw in the viewer closer and closer. I am almost at lost of words right now. The way they portrayed everything was too beautiful and surreal that it is almost unexpressable. \r\nI absoulutely loved how closely season 1 and 2 are incorporated. Every character from season 1 and 2 were carefully intertwined with one and another, giving the show a wonderful feel to it. \r\nThe opening from both seasons were awesome and sung in englishtoo, which is something that doesn't happen very often. There was even an episode that had both of the openings played and thus added in a lively tone for the episode. \\n\\n\r\nThis anime was certainlly a masterpiece. Each and every little love story were strokes of success for this anime. Ef, was certainly a refreshing one and is something that will stand out for many years to come. It has truly inspired me as a person to persue my passions and have also encouraged me to face the long road of happiness ahead. I hope that every single viewer out there can take a little piece of this anime and keep it for the rest of their lives. Then maybe one day, there will be a town full of happiness.",
            "date": "2009-09-01T00:08:00+00:00",
            "helpful_count": 12,
            "mal_id": 18293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207915.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kurogashi",
                "username": "Kurogashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=18293"
        },
        {
            "content": "This anime really surprised me by way it was told and the characters relationships. It was a really good anime with a great plot and music that complimented the moments to create additional emotion. It was the first in this genre that I've ever watched and it blew me away easily becoming my favorite anime so far and I doubt that'll change. The show was really interesting and I wasn't bored as there was always something I was interested in. I loved this anime and think its one of the few masterpieces out there and would recommend it to anyone whether they watch anime ornot. Be sure to watch the first series before this one called \"ef a tale of memories\" which is also just as good.",
            "date": "2013-02-16T21:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 86999,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2186015.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/godzillabrandon",
                "username": "godzillabrandon"
            },
            "url": "https://myanimelist.net/reviews.php?id=86999"
        },
        {
            "content": "i went into watching ef with no recommendations and decided to see it all the way though. it ended up becoming my #3 favorite anime. i found myself caring for each of the characters as though they were truly here with me. episode 6 of this anime had me in goosebumps the entire time and it is something i will never forget. i highly recommend this anime.",
            "date": "2012-10-02T20:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 73955,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/777699.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Efx",
                "username": "Efx"
            },
            "url": "https://myanimelist.net/reviews.php?id=73955"
        },
        {
            "content": "I'll be honest . Ef: A Tale of Melodies does have a lot of improvement than Memories but not much . Although , Ef series does made onto my Memorable anime .\r\nStory:8\r\nThis time , the story is a bit different . It tell us about how Yuuko Amamiya meet up with Yuu Himura and how Mizuki Hayama knows Yuuko Amamiya . I'll be honest that Melodies made me cry a bit more than Memories . Won't say much because i'm just gonna spoil it for you\r\nArt:9\r\nThe arts and animation is improved a bit on this one . More 3D animations and it does have somebeautiful arts that capture my interest .\\n\\n\r\nSound:8\\n\r\nSame voice characters from Memories . Love Chihiro voice actress by the way . The OP and ED is good . Not enough to made me listen many many times but it's okay i guess . I just love the violin part . It's was relaxing and yet a bit sad .\\n\\n\r\nCharacter:9\\n\r\nThe same characters from Memories . Now , they focus on Yuuko Amamiya , Mizuki Hayama , Yuu Himura , Kuze Shuichi and Nagi Hirono . I just can't accept how Yuuko's life was that sad . It literally made me sympathize her . While Kuze Shuichi with his sickness . All i can say is that Melodies did a good job on the character plots .\\n\\n\r\nEnjoyment:9\\n\r\nMore drama , less comedy , perfect for those who in need of crying . Does have some weird moments like Yuuko rapping (refer to episode 6 if i'm not mistaken) and Kuze rapping (forgot which episode was on) . Literally , it was a bit of weird because how fast they can pronounce each words correctly . Japan got talent for rapping i guess .\\n\\n\r\nOverall:9\\n\r\nI will say that Melodies did make me watch with one go . It was a good anime that focus on drama . If you want to have some crying moments , this is for you . But , do mind to watch the Memories first because if you watch this one first , It might just spoil everything and ruined it .",
            "date": "2015-03-07T03:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 181873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=181873"
        },
        {
            "content": "This is not simple to watch! \r\nI am a grown man, but i have never in my life cried so much as trough this so called anime series. It is impossible to call this a simple anime. It touches your heart to the deepest level!\r\nI recommend this to people that love sad romance stories. But i do not recommend it for people like me, which have high level of empathy. I cried at almost every serie. \r\nA true master piece",
            "date": "2013-11-16T14:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 120495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2600269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/madpucca",
                "username": "madpucca"
            },
            "url": "https://myanimelist.net/reviews.php?id=120495"
        },
        {
            "content": "Story: The story in \"melodies\" is definitely better than in \"memories\". Once again, we have two storylines- One focusing on the past of Himura (the guy with white hair), and the the other on Mizuki (Kei's blonde friend).  After watching \"melodies\", i realised that issues of characters from season one were rather... Shallow. For example, the whole problem of \"love triangle\" in \"memories\" is really weak in comparision with Yuuko and Himura relationship. The ending was much more convincing as well. If it is about the second story, it's very similar to Chichiro's issue from season one. The main difference lies in intensity ofthe story, though i can't write anything more, because it might spoil the fun.\\n\\n\r\nArt: It was really solid. Character design haven't changed, but the animation got better, and much more artistic eksperiments were used. There are some memorable scenes, but no suprises- you are probably used to the unusual directing if you watched &quot;memories&quot;\\n\\n\r\nSound: Nice, but nothing out of ordinary. There are no tracks that you would remember after finishing whole series, but they match the scenes, and are quite enjoyable. The opening is very similar to the opening from the first season, but it has a nice feeling to it. \\n\\n\r\nCharacter: The main characters in &quot;melodies&quot; are very well made, and i liked them much more than main characters in &quot;memories&quot;. I felt that they are more mature and convincing, but their development was rather predictable. Still- better than in first season.\\n\\n\r\nEnjoyment: I believe everybody will find something they will like in &quot;ef - a tale of melodies&quot;. The story is quite intense (for a drama series), but short (12 episodes). Personally, i finished it in two days, so i didin't get too attached to the whole series, but i still find it very amusing, and i don't regret one minute spent in front of the screen. \\n\\n\r\nOverall: Great piece of work. Everything is solid and well-made, so i gave the series 9. If you didin't liked the first season, i don't think you will like the second, because it basicly extends the ideas from the first one. However, it's worth a try, since it's a a little bit better.",
            "date": "2009-02-11T14:29:00+00:00",
            "helpful_count": 8,
            "mal_id": 12341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/earthshine",
                "username": "earthshine"
            },
            "url": "https://myanimelist.net/reviews.php?id=12341"
        },
        {
            "content": "ef- a tale of melodies comes to complete the \"tale of memories\".\r\nI really love this anime because it combines the beauty of music, art and strong characters.\r\nA violin, a sketch, a smile, a memory , a melody... \"Death or life just something small to grab on\".\r\nLove, friendship, pain, the fear of being alone, the fear of hearting the one you love  all mixed  with a beautiful soundtrack makes you wonder of your own life, the melody of your life.\r\nSo let me ask you \"Can you hear it? the true melody\"?",
            "date": "2009-03-11T15:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 13120,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/57832.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Annise",
                "username": "Annise"
            },
            "url": "https://myanimelist.net/reviews.php?id=13120"
        },
        {
            "content": "I actually made my account on myanimelist because of this anime. I wanted to share my views after seeing it all. \r\nHaving watched Tale of Memories, I went into this one with high expectations. And, unfortunately, was let down.\r\n'Tale of Memories' was the first anime after 'Clannad' to actually move me, both 'Air' and 'Kannon' failing in that department (I only saw the latter two after Clannad, and they felt pale in comparison). However, 'Tale of Melodies', in my opinion, went the wrong way. It OVERLOADS you with stylistyc art and does not deliver on the story. \r\nIf you split it into two stories, neitherbrings any joy from watching. \\n\\n\r\nThe back story is borderline awful, dark and twisted. One of the characters is so despicable and horrid that you wish only the worst kind of death for him. His resolution felt extremely out of place. The drama in the story was also very much forced and out of the blue.\\n\\n\r\nThe 'contemporary' story is not any better. Actually, what story? Looking back, there hardly is a story to begin with. 95% of it is just fancy art stylings.\\n\\n\r\nPossibly the worst thing about this anime is that it almost ruined some of the characters from 'Memories' for me. Luckly, in the end, they were 'spared'.\\n\\n\\n\r\nBottom line is: If you only liked 'Tale of Memories' for its art only, go ahead and watch 'Melodies'. There is plenty more of it in the sequel (almost to the point of annoyence). If you liked 'Memories' for the story, the characters and the feelings, 'Melodies' will disappoint you. Don't expect anything remotely close to the touching story of Renji and Chihiro in this one.\\n\\n",
            "date": "2013-02-17T02:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 87025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2189709.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/rogue1982",
                "username": "rogue1982"
            },
            "url": "https://myanimelist.net/reviews.php?id=87025"
        },
        {
            "content": "Do you here it - a true melody?\r\nWhat could I say about this anime. Hm... It's still my \"number one\" between anime-dramas. I felt in love with Tale of Memories and second season was even better than first one.\r\nStory. Both stories not unique but very interesting ansd dramatic. Really hard emotions appears than you watch it. Ends of 6 and 10 serries were real shock for me. That's how real drama should look like. And I really liked that all storylines were bounded together in this season.\r\nCharacters. Really interesting. All of them could be characterized by typical classes but it's hard to find the samecharacters somthere else. They were made very bright and individual.\\n\\n\r\nVisual. Best part of this anime. Beatufull drawing and interesting visuall \"tricks\" for \"brightning\" especially dramatical moments. That was really cool.\\n\\n\r\nMusic. OP is perfect. Maybe, the best I heared in anime. Theme songs and melodies very good too. Endings... it's hard to find drama with good ED themes but they are much better than, for example, Clannad ED.\\n\\n\r\nTotal. \"Must see\" for all, who love dramas\\n",
            "date": "2009-09-24T06:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 19065,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/234654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nachtwandler_21",
                "username": "Nachtwandler_21"
            },
            "url": "https://myanimelist.net/reviews.php?id=19065"
        }
    ],
    [
        {
            "content": "Watching \"ef- a tale of melodies\" is not like watching a regular anime, but more like an artistic painting come to life. It really is a unique experience!\r\nStory: 8/10\r\nTaking place after the first installment known as ef- a tale of memories, we now follow the tale of most of the supporting cast from the original I just mentioned. Going into this I was a bit bummed that they didn’t decide to simply go with a whole brand new cast for this, but it actually worked out quite well, as this time around we get to learn more about: Kuze, Mizuki, Yuuko and Yu. (which againwere simply the supporting cast from the first ef series) And get a better understanding as to who they are, and also answer questions that were not answered from the original. You will be transported back and forth from the past to the present, as the overall plot can only be understood by doing so. Now watching this series you won’t really find anything particularly new here with the story, most of the events that take place are more along the lines of what you would see in a Soap Opera---in other words, lots and LOTS of drama here. Basically each of the four cast members will (or eventually) fall for one another, each having to face their own personal demons (just a medifore) in the process. Most of them are not quite what they appear to be at first, and as the story progress you get a much more in depth look as to who they are. The way it is told though, is what really makes \"ef- a tale of melodies\" stand out. You don’t just simply watch the story and love scenes progress like you would a regular anime. This one is told in a more artistic tone. For example: when the characters are in deep thought from a certain situation, you may see them in a room by themselves--or even see them all chained up as a black silhouette, (this of course represents that the certain character is a prisoner either to themselves, or by another) and a lot of it takes place in the character’s mind and not in the physical form. So you can’t go into this series expecting a \"what you see is what you get\" idea, because this series doesn’t do it that way. Setting the artistic themes aside for a moment, the situations themselves are pretty standard for a drama, which may turn off some people and give the feeling to them that the whole \"medifore\" idea is simply there to only cover up a more standard fared story. Which quite honestly isn’t too far from the truth, as many scenes tended to last quite long, and sometimes seemed to give a more slower pace to the storyline. Still, what it lacks in actual new material with its story, it makes up for by the artistic way it shows it. It also has a worth while ending too! \\n\\n\r\nArt: 10/10\\n\r\nThe art of this series is so rich and detailed, I would expect nothing less from the \"ef\" series, in fact just watching the opening scene with the paper airplane gliding along the sunset sky, is truly appealing for the eyes, as is the entire series. The character design (while nothing particularly new) is well distinct. I especially liked the eyes of the characters. The water effects that come from the ocean will seem to just glide across your screen so fluently. And the character animation and backgrounds are truly superb!\\n\\n\r\nSound: 8/10\\n\r\nI have to say that the sound was the weakest link for me in the anime, the opening and closing were indeed well planned out tracks (both ranging from soft and sincere, to catchy \"finger snapping\" tunes, \" one even sung in English no less) The background music was a bit lack luster though, while you do get nice and appropriate orchestral music that plays in the back during events, nothing ever really stands out too much, with the exception of Kuze’s violin piece. The voice cast was a bit of a \"hit and miss\" for me too. Most of the deep males voices were nice at complimenting the artistic theme of the anime. But most of the female cast I found to be a bit on the standard side, with the exception of a girl name Yuuko, her’s was well fitting the part. Overall it was a great soundtrack, but it just didn't seem to be quite as good as the original's. \\n\\n\r\nCharacters: 9/10\\n\r\nI really liked each and everyone of the characters, nobody ever came off as annoying, or would make you feel that they tossed one in just for the sake of doing so. I was especially captivated with the character \"Kuze, \" he is a musician with a quite interesting past, and the turmoil he goes through is quite sad--yet exciting at times. The character chemistry was a bit rushed for one of the couples, but seemed to be pulled off appropriately at the end. Since half of this title is all about back story, you get a pretty in depth look into the character’s lives and can really connect with just who they are, and will feel what they feel!\\n\\n\r\nOverall: 9/10\\n\r\nef - a tale of melodies is a truly satisfying experience if you can appreciate it’s approach in things. It's debatable as to whether this one surpassed the original or not.  It can at least be said however, that this is truly an outstanding sequel! If you prefer a simple and casual romance themed anime then it would probably be best to avoid this one. As many of its extended medifore scenes may tend to drag out and frustrate some viewers. But if you’re an anime fan with a taste for the arts, or perhaps looking for a new way of viewing a romance title, then this series is for you. ef - a tale of melodies is not spectacular in what it shows...but how it shows it!\\n\\n\r\nSide Note: If you are interested in watching this title, I would recommend watching the prequel first. As some of the original main characters from the first make an appearance here, and the whole overall story can only be understood fully from both sides.",
            "date": "2008-12-26T12:02:00+00:00",
            "helpful_count": 178,
            "mal_id": 10653,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=10653"
        },
        {
            "content": "Tale of Melodies is like watching Leonardo Di Vinci paint a sequel to the Mona Lisa. He's technical skills has improved, his techniques more refined, but does he have enough soul to mold a creation that matches the sheer brilliance of the original?\r\nAlmost...\r\nNote: If you have not see the Tale of Memories, do not read this review. It'll be rather meaningless.\r\nMake no mistake, Tale of Melodies is definitely not a mediocre sequel. Judged by itself, Melodies would fit the true hallmarks of a classic. Watching episode after episode is akin to surfing upon waves of pure emotion, there will be scenes that are guaranteed toeven make terminator a little teary.\\n\\n\r\nLike its original, Melodies is an utter masterpiece of both visual and melodic artistic direction. The visuals accentuate the emotions in every scene, the speech often feature rhythmic and even poetic undertone; when you watch Melodies, you do not feel like you're just watching an anime, but rather appreciating an awe-inspiring piece of art.\\n\\n\r\nWhere's most anime are content to have the animations fluidly and attractively portray an event,  Melodies goes five steps further. Each and everything scene, including even the placement and subtle variations of the OP, are the way the way for some subtle purpose. There's little else to be said but to experience it. If Clannad for a 10/10 for art, Melodies surely deserves an 11.\\n\\n\r\nIn terms of technical and artistic talent, Melodies arguably surpasses its original. Yuuko's suffering in Episode 6 for example, ups the ante even in comparison to the famous phone messages of Miyako in season 1. So what keeps Melodies from rivaling memories?\\n\\n\r\nIt's certainly not the art or the music, nor is it likely the characters. The dialogue and characters remain strong, with a subtle since a humour that'll be familiar to anyone who enjoyed memories. The story, at outset, looks to have  at least equal potential. On the one side, you have Mizuki, whose must find a way to bestow her love (Kuze) with the will to live and fight against a terminal disease. On the other, you have Yuu, who must save Yuuko from a history of abuse.\\n\\n\r\nYet, in watching the entire series, one can't help but feel something's missing. In the final episodes, there was just not quite the rush of anxiety one experienced when Chihiro tore out the pages of her diary. Perhaps some of the sudden twists in Melodies was too sudden and lacked the anxious suspense the original; perhaps it was the lack of something to rival the powerful metaphor delivered by the tale of the only girl in the world. The episodes of Melodies, while individually excellent, didn't appear to quite to weave together as flawlessly as the original.\\n\\n\r\nOr perhaps it is just inspiration, or soul. \\n\\n\r\nJust as Leonardo developed better skills after painting the Mona Lisa, SHAFT's technical capacity only improved after memories. Yet Melodies just has that little bit missing...\\n\\n\r\nIt's not quite the masterpiece memories was, but remains a brilliant piece of art.",
            "date": "2008-12-26T20:39:00+00:00",
            "helpful_count": 125,
            "mal_id": 10669,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=10669"
        },
        {
            "content": "*Please watch ef: A Tale of Memories first, because there is a continuation of the love stories presented in the prequel. Feel free to read my review for Memories also.*\r\nAfter watching Memories, you probably asked yourself these questions:\r\n- Why does Yuuko pop up out of nowhere and disappear before you can blink an eye?\r\n- How do Yuuko and Yuu know each other?\r\n- How do Renji and Chihiro; Hiro and Miyako; and Kyousuke and Kei's relationships continue?\r\nef: A Tale of Melodies will answer all of those questions as it introduces the background of vague characters from Memories: Mizuki, Yuuko, Yuu, Kuze, and Nagi. There is abrilliant connection between those characters and the ones from Memories. Just like in Memories, there's drama, psychological history in characters, brutal pasts, and everlasting romance resulting from someone refusing to let go of the person they love.\\n\\n\r\nThe anime shows three stories:\\n\r\n- Yuuko and Yuu have one of the most romantic histories in the series, mainly because they knew each other since childhood. They met each other in an orphanage when they were younger. Yuu lost his little sister in an earthquake in Japan, and he rejects Yuuko because of his grievance. Once they meet again in high school, Yuu regrets how he treated Yuuko after he finds out how brutal her life became after she left the orphanage. Determined to protect the woman he loves, he goes through all odds to hold onto her.\\n\\n\r\n- While visiting her cousin Renji in Australia, Mizuki was introduced to Kuze by Renji's mom. Mizuki heard a beautiful song played by the violin one day, and Renji's mom insisted that Mizuki and Kuze spend time together. Mizuki and Kuze spend the next few days together in Kuze's nearly-empty house. After confessing her love for Kuze, their relationship began to blossom. Shortly, Kuze began pushing Mizuki away to avoid hurting her, even though he loved her, too. Despite Kuze's medical condition and his rejection, Mizuki is determined to stay by his side no matter what it takes. You should see all of the crazy yet romantic things she does to make him happy.\\n\\n\r\n- Relationships from Memories continue...\\n\\n\r\nArt and Sound: The art and sound fit perfectly together. It is more museum-like with the mirrored bodies and masks. As the art is displayed, dramatic music is played simultaneously. Kuze's violin piece and Yuuko's improvised lyrics fully explains the moral of the entire series. In order to avoid confusion, the anime presents footnotes at the end of each episode to describe certain terms and references mentioned in the episode. Also, it attaches the time so you can recall where you heard the reference.\\n\\n\r\nCharacters:\\n\r\n- Yuu is an artist and draws quite often. He never desired to join the Art Club, but he drew amazing landscapes and portraits, especially of Yuuko. His dream is to create a beautiful city filled with kind people, which is why he stayed in Australia.\\n\r\n- Yuuko was Yuu's lover in the past. She is now the magical advisor that appears before the main characters to bring happiness to them all. With the same dream as Yuu, she is located in Japan.\\n\r\n- Kuze is a famous violinist and Renji's next-door neighbor. He struggled with a personality disorder ever since he had a heart spasm during a concert. As he awaits for his death, he attempts to end all relationships in an attempt to make it so that he simply disappeared.\\n\r\n- Mizuki is Kei's close friend and appears off and on in Memories. She's quite energetic and refuses to shed a tear in front of others. After graduating from Otawa Academy, she moved to Australia to live with Renji (her cousin). There is when she met Kuze.\\n\r\n- Nagi is the elder sister of Hiro, Kei, and Chihiro. She used to crush on Yuu in high school but lost to Yuuko. She later became engaged to Kuze.\\n\\n\r\nJust as Memories, you're in for some deep romantic stories.",
            "date": "2013-10-25T02:25:00+00:00",
            "helpful_count": 49,
            "mal_id": 118189,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=118189"
        },
        {
            "content": "&ldquo;Right art tells right people the right things\"\r\nI don&rsquo;t remember exactly in which movie did I hear this phrase, but it has haunted me ever since the first time I heard it. It contains in itself an irrevocable truth about human mind, that tastes are not \"universal\", but rather contained in each individual. \r\nThus some people would manage to enjoy stuff like Rosario to Vampire and Miley Sirius music, while others might rather puke at mere mention of them. \r\nWhere does the difference lie? In the intelligence of the one who enjoys it, perhaps? I doubt it.  If such were the case, it wouldbe reason, not emotions, the one that would makes the difference, and its a well know empirical fact that don&rsquo;t &quot;think&quot; you like something, you just &quot;know&quot;. (It is more probable that intelligent people might be reluctant to be lumped up with &quot;the stupid&quot; and avoid everything that&rsquo;s &quot;main stream&quot; like not long ago the aristocracy rejected that which was done by those not belonging to noble class. )\\n\\n\r\nI think the difference falls into the capability of the subject to relate it self with the art. Once it become something similar, akin to experience, one can truly understand its meaning and able to get its true message. Think of this: love songs will often sound &quot;shallow&quot; and &quot;stupid&quot; until you fall in for the first time. Then, Oh!  everything make sense. In fact , Too much sense \\n\\n\r\nWhen one &quot;gets&quot; what they are talking about, then you can move on to the next phase.   The art cannot only speak of what you have already experienced, but leave you with a new perspective of the situation. It might affect your way of thinking altogether and change you for good. That is right art, one that is not only a passive object, but one that becomes part of the observant and modifies him into something new.  \\n\\n\r\nWith that in mind, I can say with out regrets that Ef- a tale of memories/melodies ( I must consider both, since they actualy belong to the same game)  is not only a piece art, but &quot;right art&quot;.  It tackled to of my favourite topics (God and death) and managed to give me new perspective into those issues, and some little changes in my view of my life as a whole. (it may sound exaggerated and melodramatic, but think how many people had their life changed because of Evangelion. That one did screw up my entire generation, and almost every generation after that one. Compared to that this one is just a mere breeze )  \\n\\n\r\nWith that in mind, I must lay down a warning. You might find it either a Masterpiece or no more than a cheap soap opera with around 15 minutes of talk and 10 minutes of Songs. It depends on your capacity to relate to the story, which in itself depends on the way you had lived your life so far. It will also depends in the reason you have to watch anime as a whole, or even in your emotional states as you go throught the episodes.\\n\r\nThen, I specially recommend trying it if had ever thought you are fucked up and hated God, if you had loss someone you loved, or if you like pretty drawings and shiny colourful scenes that have nothing to do with the story. If you are not one of those, I could still recommend it if you have nothing else to watch, if only so you can brag about it later and write condescending reviews to mocks those who didnt like it so they can see how cool you are.",
            "date": "2009-01-05T06:56:00+00:00",
            "helpful_count": 44,
            "mal_id": 11127,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92902.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/nightsword",
                "username": "nightsword"
            },
            "url": "https://myanimelist.net/reviews.php?id=11127"
        },
        {
            "content": "Ef- a Tale of Melodies is somehow an unnecessary sequel. Unnecessary in a way the first season didn't let any hole for a new season, as I felt it was complete and didn't need to go on. Even tough, I was still thrilled to watch A Tale of Melodies since its predecessor was absolutely beautiful. Perhaps, it would be as beautiful or as interesting.\r\nSadly, I could only dream about it.\r\nThe story is presented in the same pattern as Memories, at this point the viewer shouldn't be confused in the way it's made.  While most of the cast are back, they actually switch roll ina sense that the main characters of the first season would become the support cast and vice versa. The most drastic change some can feel while watching Melodies is that is darker than the first season and perhaps darker than someone would Imagine. And here's the problem, both of the story arcs were dark and yet they both failed to have a sense of suspense. SHAFT was successful in creating a blend of suspense and romance in the first season(Notably the ending of the Hiro-Miyako) and thus the reason why A Tale of Memories was very good. One could think that A Tale of Melodies would be a parallel. Well, Shaft didn't succeed this time.While the stories had a premise start, As darker these story arcs were, they also felt more cliché, more unbelievable and sadly more boring as it was getting to its end.\\n\\n\r\nI also have to point that ending didn't have the same expectation as the first season. While A Tale of Memories felt completed, the ending of a Tale of Melodies is left with the feeling that there's still something more to tell which can leave an unsatisfying feeling for the viewers.\\n\\n\r\nNothing can't really be said against the art except for some of the characters design that really felt bland or been done before. Truly amazing backgrounds and sunset. The SHAFT art, which consist of high contrast, simple colours, black and white and so on is also magnificent as it played a key role in the most important scenes.\\n\\n\r\nA Tale of melodies did deliver a great cast, no doubt about that. Yet, the series still suffered from few characters who weren't developed enough and made them quite uninteresting(Notably Nagi, who even though she's a supporting character, still had an important role). Another problem that can be regarded is the quality of the dialogues. The series did have some good dialogues, yet a lot of them were predictable, silly and also cliché.\\n\\n\r\nI have to admit, enjoying the series was quite hard. While I admit Melodies had beautiful moment and memorable SHAFT scenes, it still suffered from long scenes where all it did was turning around the block(Not getting to the point).\\n\\n\r\nIn overall, A Tale of Melodies could have been a great sequel there's no doubt about that. We hoped for something as good or better, but it isn't the case. Like I said, it had a premised start and the only element needed was a good execution. This element was never included.\\n\\n\r\nBeside, most of the fans of first did like this one. I guess I wasn't in the majority. So go on, flame me.",
            "date": "2010-01-17T16:08:00+00:00",
            "helpful_count": 34,
            "mal_id": 22473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/219844.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Wilio",
                "username": "Wilio"
            },
            "url": "https://myanimelist.net/reviews.php?id=22473"
        },
        {
            "content": "\"Sequel.\" A variety of reactions could be displayed when seeing/hearing this word: \"I hope this is as good as/keeps up with/better than the original.\" \"Will they explain that?\" \"No, this is enough; anything more will ruin the story.\" Some more of this piece of crap?\" \"Yes, more of this show!\" Of course, I had the last sentiment. It is no easy task to follow up on a story. As we all know, if something drags on for too long, it loses its essence, and I believe that usually, beginnings are the best part of anything. Rarely they are not. This is an especially difficult taskwith an anime as great as Ef. I can safely say, though, that Ef - A Tale of Melodies lives up to its prequel, Ef - A Tale of Memories.\\n\\n\r\nThe anime is based on an adult visual novel, called Ef - A Fairy Tale of the Two, with original female character design by Nanao Naru, who also did the manga version. The mystery of Himura Yuu and Amamiya Yuuko finally unravels here. Firstly, let me give you a proper synopsis.\\n\\n\r\nAs narrated by the protagonist, Himura, there are two cities called Otowa, one that is built on the burnt rubble of its former self, and another that is a fake mirror of it. Yuu and Shuuichi are talking while the latter is burning his letters, ending his relationships, including one by Nagi, which, though rare of her, he does not read. In the past, a high school boy was walking down the street, when he noticed a girl on a roof. He went to her, and the two talked. It seemed as if she, Amamiya Yuuko, knew who he, Himura Yuu, was, yet, he did not recognize her. She proceeded by saying that she still hated Yuu. At school, Himura saw the words \"Art room - Hirono\" on his desk, and exclaimed \"ano baka (that idiot).\" On his way there, to his surprise, he met with his friend, Kuze, who was having a flea market before going abroad. After Shuuichi learned where Yuu was going, he wished him a safe trip (as if he were leaving to a dangerous place). Near the art room, Himura also met with Amamiya Akira-sensei, who thought that Yuu was at last joining the art club, like Amamiya had always wanted him to, but Himura quickly and bluntly dismisses the idea. Holding an unlighted cigarette, Amamiya said that it is horrible how people are always drawn to art, whether it is voluntary or by being dragged thanks to those who are, advising Himura to simply join. After reaching the room, Yuu witnessed Hirono Nagi there, drawing a nude self-portrait with no clothes on. He immediately told her to wear her uniform, thinking that what Amamiya had said might really be true, then she forced him to go shopping with her, much to his dismay. Going home, they noticed a girl, Amamiya Yuuko, following them. A conversation ensued between the three, and ended up with Hirono throwing a sketch book she wanted to give as a present on Himura. Yuu and Yuuko went to the beach, where the former eventually said he remembered the latter. At the present, Hayama Mizuki, who is about to enter college by recommendation, is staying with her cousin, Asou Renji, a former protagonist. After waking up from another bad dream, she realizes that famous violinist, Kuze Shuuichi, is living next door, and insists on meeting him to hear him play nama (live or bare; there is a small joke on that here and a big one in B Gata H Kei). Renji suspiciously tries to prevent her from doing so, but he has no choice, since, unlike Mizuki, he has to study for college examinations. She finally meets Shuuichi, who immediately reminds her of Tsutsumi Kyousuku, another previous protagonist and her senpai, Shindou Kei's boyfriend; a womanizer. He agrees to play with her. However, Mizuki notices strange things at Shuuichi's place, but for which he always comes up with an excuse. First of all, his living room contains very little furniture, making Hayama think Kuze is about to move, but he says he just likes big spaces. Second of all, she tells him she wants to hear him play the violin, but he replies he cannot, and after being inquired as to why, he says it is broken. Third of all, a clock alarm rings in the afternoon, and Shuuichi exclaims that it is for his stomach (to eat). Mizuki only finds drinks in the refrigerator, but he informs her he has ice as well. Kuze speaks in a formal manner, which Hayama picks up on, but he explains that he has to talk this way, as he meets a lot of people, likening it to wearing masks, which he has hung up on the wall. Mizuki lightly says that cat masks are kawaii (cute), and asks Shuuichi to lie on the ground with her, just relaxing and enjoying the lack of shoujo manga, which she loves, that takes up space in her room. Later, however, when Hayama leaves, Kuze, alone in a dark room, feels a severe chest pain, and is forced to sit on his couch, saying, \"not yet . . .\"\\n\\n\r\nA good mystery is answered with more mysteries, as this season does. One of the few down points this series has is a supernatural element that is revealed at the end. Those who finish it will understand. I still like the morals that are taught, though.\\n\\n\r\nThe best way to continue a series is by showing past events, linking them to current ones, which Ef - A Tale of Melodies brilliantly and intricately executes, despite the aforementioned extraordinary happening. Showing the main characters as young kids is informative and gives depth to them. Seeing the lead, Himura Yuu being more carefree and displaying funny facial expressions is refreshing from his current more depressing, somber self. The same thing can be said of the heroine, Amamiya Yuuko, who is now a serious, wise girl, where she was outgoing and always smiling, hiding her true feelings. Hirono Hiro, the prequel's protagonist's oneechan (older sister) surprisingly plays a major role now, where she was just mentioned as part of his pseudonym, Shindou Nagi. Their love triangle is similar to Hirono Hiro, Miyamura Miyako, and Shindou Kei's, where two of them have a friendly relationship, and a girl appears, changing things. Another surprise is that two people have met before any of them could remember, but it happens later, in episode ten, the best and saddest one, although it is in black and white.\\n\\n\r\nThe opening sequence is also played in black and white. Similar to the previous season, the song, portraying the main characters, is in English, except for the final episode, twelve, where it is played in Japanese, which is better, with the same catchy tune. In one episode, the piece is instrumental (referring to the title, I believe) (showing no characters), and, at one time, the ending sequence is a slowed-down version of the opening sequence without the melody; both of which never took place in the prequel. Again, however, like the first season, the ending sequences vary, with some of them dedicated to the heroines. The soundtrack and seiyuu in general are amazing.\\n\\n\r\nOne of the other reviewers said that he wanted a different cast for this season. What is that about? The entire series revolves around Himura Yuu and Amamiya Yuuko; it would not be right to leave their story hanging, though I would not mind if there were an unrelated (or related) third season, because I could not find another series even close to this one in terms of epicness, but that is highly unlikely, since it is based on a game that has already finished, as mentioned in the Latter Tale's trailer.\\n\\n\r\nI could talk on and on about how wonderful this show is, but you will have to see it for yourself. This is romance, drama, and tragedy at their best. The artwork is beautiful and the story is spectacular. I guarantee you will love this anime. It is my all-time favorite one (along with Ef - A Tale of Memories).\\n\\n\\n\\n\\n\\n\r\n\"You will never see Amamiya Yuuko again.\" - Kuze Shuuichi",
            "date": "2011-07-01T03:07:00+00:00",
            "helpful_count": 21,
            "mal_id": 38537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/487479.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Seijurou",
                "username": "Seijurou"
            },
            "url": "https://myanimelist.net/reviews.php?id=38537"
        },
        {
            "content": "It is so beautiful, i enjoyed it better than the first season.\r\nThe characters are really well-made and have very deep connections with the ones in the first season.\r\nThe plot is even better than the first season; the beginning is a bit strange but it just keeps getting better and better.\r\nThe music is what i like the most. Every song was perfect in the moment they placed it, they're also really beautiful and fit the series perfectly.\r\nThe art is really something. Not only the abundance of opening versions they made, about 8, but also the landscapes and those romantic moments; the art it's been worked ona lot.\\n\r\nI really enjoyed this series to the4 point i cried in the last episode. If you like original romantic anime I strongly recommend this. It's not your typical romantic story, it's fantastic.",
            "date": "2008-12-27T09:16:00+00:00",
            "helpful_count": 19,
            "mal_id": 10682,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116937.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lotusres",
                "username": "lotusres"
            },
            "url": "https://myanimelist.net/reviews.php?id=10682"
        },
        {
            "content": "I often see people making the comparison of this anime to Clannad. But in my opinion, that is a little misleading. Unlike the focus on family with a general tone of warmth. ef is more like finding that dwindling bit of fire in the cold world and live on with an iron will.\r\nOtowa, the place where the story takes place in, is spelled as 音羽 in kanji. \"音\" means \"sound\", referring to the Suuichi's violin, and how the music will stop when the bow stop. \"羽\" refers to the eternal feather of Yukko and the continuation of hope. \r\nIn fact, the theme that carries throughoutboth season of ef is the decision of eternal and temporality. Like 13 hours of memory that Chihiro has and Renji's untiring pursuit of her. Or the conversation between Hiro and Mihako on the telephone. Unlike other shows that ask rhetorical questions and never answer them. ef gives its solution. \\n\\n\r\n\"No matter how much you treasure them, both people and things will die someday. The bonds, the feelings, the memories, the hearts, and their lives. There's nothing in this world that won't die. There's nothing that won't break. Happiness is nothing more than a fabrication; a false mirage. That's why... That's why we should treasure them. So that we can face the farewell that'll one day visit us without regret. Because it'll break, it is precious. Let's make it precious.\" \\n\\n\r\nThe anime is also filled with symbolism and clues in its progressively changing op, use of colors, camera transition screens and even the tiles of each episode. (hint: the first letter)\\n\\n\r\nI guess the reason why I spent this much time writing this \"review\" is that I don't think people truly appreciate this anime and how barely anyone mentions it in anime discussions. I guess that's the fate of being an art piece: not being financially successful and is only enjoyed by the few. Yet, a part of me almost doesn't want it to be popular. Like that small cafe down the corner of the street. You enjoy its quietness and the coffee and want to share it with more people. Yet that would ruin why you like it in the first place: the peacefulness.",
            "date": "2019-01-24T17:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 299942,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6504333.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/whi",
                "username": "whi"
            },
            "url": "https://myanimelist.net/reviews.php?id=299942"
        },
        {
            "content": "ef - a tale of melodies is a deep, unique anime embedded with both strong and subtle themes in a purposeful elegance.\r\nThe second season of the ef series (tale of memories was the first season), a tale of melodies comes full circle. A tale of melodies is an awe-inspiring storyline that can be described as enigmatic, ephemeral, and turbulent, yet leaves an impression that (ironically) is vivid, lasting, and resolute. Little about tale of melodies is immediately straightforward, yet that is what makes the story possess the kind of depth that enables it to project multiple themes.\r\nWhile the first season (a tale of memories) confoundedmany viewers with its strange representation and plot development, a tale of melodies thrilled using the same strategy. Much of it is attributed towards the familiarity of the intended audience to some of the characters and better continuity associated with brilliant storylines.\\n\\n\r\nAs a warning, I would not recommend watching a tale of melodies before a tale of memories although in my opinion a tale of memories is a much inferior work, as it is important to understand the characters, which a tale of memories did not do as well or project to such a high level of excellence.\\n\\n\r\nOf the many facets that make a tale of memories amazing is the number of thematic layers it possesses with such an unpredictable plot. The depiction and manipulation of time and space within the anime was played to perfection by allowing viewers to see the anime from multiple perspectives (each with their own unique set of themes) that eventually merge into one. The anime is is devoid of 'filler' and each scene has a purpose.\\n\\n\r\nOne of the things I found to very impressive about a tale of melodies was that it was able to preserve the continuity and consistency with story and character despite the entropic pace and developments within the story. Everything that happens possesses a meaning, yet nothing is immediately obvious before it happened. Often the anime has abrupt shifts in themes, yet blend with masterful synergy. Nothing from the anime is what it initially seems, and that is one of the reasons it is so good. In a sense, the creators imposed a set of strong themes towards the viewer without giving anything away, which is rarely seen in animes with similar storylines. \\n\\n\r\nAlong with depth and uniqueness, the broad variety of characters with different personalities, behaviors, beliefs, and even morality added more color and detail to the already intriguing anime. The level of information gained within each character was amazing given the anime's short length (12 episodes) to develop each of them. Not only were the creators able to do that, but they also developed the characters to such a high level of synergy  that each character was connected to the other characters within a large web that if broken would distort the entire anime. To develop an anime that can sustain such a brilliant plot and strong themes while navigating through such a fragile web is nothing short of masterful.\\n\\n\r\nHowever, in the end what makes a tale of memories a masterpiece is its message. It pieces together many facets of life such as distress, egotism, nostalgia, love, sorrow, loss, and hope and knits it into a quilt that provides different messages based on the viewer. Although the message might vary from person to person, it is undeniably profound.\\n\\n\r\nA tale of melodies is a work of art. It paints a medley of characters in a world that it cannot be detached to and leaves viewers amazed.\\n\\n",
            "date": "2012-01-02T02:45:00+00:00",
            "helpful_count": 15,
            "mal_id": 50717,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332050.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KnightessKana",
                "username": "KnightessKana"
            },
            "url": "https://myanimelist.net/reviews.php?id=50717"
        },
        {
            "content": "Future?  A unknown phenomenon that occurs after the present moment. You’ll never know what might be in store for you so the only thing you must do is gather your courage and determination and march forward!!\r\nIf you have watch the prequel of this story then you will not be disappointed however have you ever wonder who was the girl with the blue hair was. She always appears when the main characters are in a slump, troubled on what to do next. Exactly who and what is she? a deity? a ghost? She appears and then disappears without a trace. Also who was Himura,he seemed to know a lot of the answers regarding life but is it from personal experience? He was waiting for someone and in the end the first series, he was waiting for Yuko, the girl with blue hair but who is she and what exactly is their relationship? Well you are about to find out in this sequel to E.F: A Tales of Melodies!! If you like the first series with the crazy philosophical sense in the artwork and in the setting then you w]on’t be let down. This time it isn’t just full of drama.. it has action too.\\n\r\nThis time this story is focus on the characters that were giving guidance (Himura, Yuko and Kuze) to the protagonists of the first series. We get to look into the proof behind those words that help the young protagonist out, starting with the view the relationship that Himura had while he was in high school. After all Himura is the protagonist of the story and present Kuze. That’s right instead of 3 male lead, its 2! \\n\r\n\tThis series rather than focusing on the emotional dilemmas and love ties like “A tales of Memories” this series does indeed has those trait incorporated but it takes them to a whole another level. This one incorporates the themes from the prequel plus the addition of torture and suffering of losing someone. The only difference is whether one wants to enjoy ever last moment they have or try to forget them before they get to deep. The protagonist is rather considerate to others yet very cruel to himself. He would rather suffer and die alone without bothering anyone or hurting anyone too deeply. In one view point he is very courageous but in another viewpoint he is very conceited. Though it is a really painful decision to make and not anyone could have this determination to break all ties. \\n\r\nThe other protagonist however is face with a more traumatizing dilemma. Everyone has a scar that can never heal after losing a loved one in an accident, but everyone has their own way of recovering over it. In Himura’s scenario, it’s rather intense. He encounters his childhood friend who got adopted before him and learned something horrifying about her. Nobody could be more prepared to suddenly lose a loved one. No can cope with the facts right away. Wounds take time to heal especially the one in the heart, but this scenario is insane. “When one thinks of another’s feeling and blame oneself, it actually makes the other suffer more. But when the one inflicting the pain is the one who felt the most pain. When one loses a loved one, one could recover by the comfort and support from family or friend but what if that family or friend is the one you lost and there’s no one else who could help you? This person found a replacement for their loved one. Instead of showering them with emotion of the one they lost, they inflict pain on the innocent. However there is a twist!!... \\n\r\nAs the plot deepens, the story gets more realistic in the way where we could somewhat apply in our own lives. This story shows us a grander psychological angle. However the similarity between both characters is that they are both running away from reality. They seem to be thinking they are doing the right thing but that is only for self-satisfaction. They are insecure and thinking it’s the right thing to do. However they are scared to face the truth!\\n\\n\r\nAs always the artwork is fantastic as well, the symbols of the scenery really capture the mood and setting. Plus the variety of colors really describe the mood of the characters and sort of sending out a subliminal message on how the viewers should feel. The characters are drawn in the same way as the first series, and the character get drawn in a different frame all locked up to inscribe to us how they are feeling inside. Showing us this abstract scene really get oneself engross on the character. This part I don’t despise but sometime I feel frighten on how the story unravel. However that is this anime’s hook!\\n\\n\r\nThis anime is truly a beautiful piece of work. It is magnificent, how the story is laid out the way it is. I especially like how it has more than one male lead in these romance stories because that way the story does end and not leave the viewer hanging and also for other people to not loathe the author for not matching up the character with the one they chose. \\n\\n\r\nHonestly to sum up this series, I’ll end with a quote!\\n\r\nThis is a story of “Will.” “People who walk toward the future will eventually reach the place that they once dreamt of. Toward the tomorrow that gleam of light”\\n\\n\r\nI highly recommend this anime to those fanatics out there who really loves a good romantic, sad and tragic anime. You will really enjoy this and will be engross with it. Hope you enjoy it as much as I have. \\n\\n\\n\r\nCan you hear it? The Melody of Truth\\n\\n\\n\r\n~Later\\n\r\n--------------------------------------------\\n\r\nFun Fact that I notice:\\n\r\nThe pen name that from the first series that Hirono Hiro used was “Shinto Nagi”\\n\r\n“Shinto” last name from Shinto Kei\\n\r\n“Nagi”  First name from his sister Hirono Nagi \\n\\n",
            "date": "2012-02-08T12:03:00+00:00",
            "helpful_count": 14,
            "mal_id": 53473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/494748.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ray357",
                "username": "ray357"
            },
            "url": "https://myanimelist.net/reviews.php?id=53473"
        },
        {
            "content": "I enjoyed the second EF much more than the first. Story lines were much deeper in this, characters seemed more realistic.And while I liked how they kept with the 2 main stories at a time deal as they did with the first, the flow between these two seemed almost seamless and really complimented eachother. \r\nAs for the story, like any anime I watch I can't tell how much I'd like the story fully until the ending. Far too many times do animes with great stories ruin it with the end. The end here was a bit anticlimactic for my tastes, it wasn't completely screwed upto the point of ruining the series for me but it seemed a bit meh for all the tension it was building.\\n\\n\r\nIf you watched the first EF you will notice that the main charaters in this one are the side characters from the first season. I loved this part. Usually I hate when an anime dives off its main story line into side characters excessively, but this being a new season with a whole new story line and the original being completed I loved it. Really original, while the main characters from the first season appear here as side ones. Great concept. \\n\\n\r\nThis one threw in 2 different plot twists than memories, the first being the time aspect, one of the stories occurs during the past and if you've watched memories your pretty much know where it's going to go. But the way they alluded to this story line durring memories was so interesting to me. They teased you with it and never told you, until melodies. \\n\\n\r\nThe other is the distant thing. I was completely unaware during memories that the two stories were occurring on different continents. This part really didn't come across well at all. The characters switch around what country they are in at the drop of the hat, they made many mistakes as to who was in what country when (Listing them would all be spoilers)  While I liked how they tied the characters together some of it just seemed forced and trying to draw the line between how this character knew this character from where- when the lines were crossing constantly and across continents just made my head hurt. \\n\\n\r\nAs for the characters themselves, much, much better than memories. I'm really impressed with how much of an improvment they made with this one. You grew to genuinlly care for these people for the most part, I hate when a writer wants to have two characters fall in love and instead of taking the time to build a logical relationship, showing the cause of the love between to characters they basically just shove them together for a day and when they come out declare their love for one another for no apparent reason. (Or not a believable one at least) While memories was riddled with this problem, melodies mearlly featured it. A little more build up in the love story would have been good, but this wasnt horrible. \\n\\n\r\nMiki was the one character that just got under my skin. And as her earlier story line progressed, got really confusing. The earlier parts gave her depth, but I really wish they had expanded on that because as she is now she just seems like the typical ditzy anime girl. \\n\\n\r\nAs for the visuals in this one I didnt find them as dynamic as I did in the first. This one was all about good characters and good deep story lines. Memories to me relied way more on its looks. The english in both series's OP and end were a funny listen, though with the amount of drama contained within the episodes probably not the time you want to here something funny. I dont think anyone would find it romantic if I walked up to them and told them I wanted to see their insides. They should have just done them in Japanese, it would have come across much better and taken the cheese factor down a notch for me. \\n\\n\r\nOverall this was a pretty good anime. Some minor flaws keeping it from perfection but after memories I am pleasantly surprised with this one. Defnitley worth the watch.",
            "date": "2009-06-30T04:30:00+00:00",
            "helpful_count": 12,
            "mal_id": 16274,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/181267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BurningLeaves",
                "username": "BurningLeaves"
            },
            "url": "https://myanimelist.net/reviews.php?id=16274"
        },
        {
            "content": "This is probably one of the most beautiful, yet complex anime that I have ever laid my eyes upon. Every little single details in this anime are continually emphasized to draw in the viewer closer and closer. I am almost at lost of words right now. The way they portrayed everything was too beautiful and surreal that it is almost unexpressable. \r\nI absoulutely loved how closely season 1 and 2 are incorporated. Every character from season 1 and 2 were carefully intertwined with one and another, giving the show a wonderful feel to it. \r\nThe opening from both seasons were awesome and sung in englishtoo, which is something that doesn't happen very often. There was even an episode that had both of the openings played and thus added in a lively tone for the episode. \\n\\n\r\nThis anime was certainlly a masterpiece. Each and every little love story were strokes of success for this anime. Ef, was certainly a refreshing one and is something that will stand out for many years to come. It has truly inspired me as a person to persue my passions and have also encouraged me to face the long road of happiness ahead. I hope that every single viewer out there can take a little piece of this anime and keep it for the rest of their lives. Then maybe one day, there will be a town full of happiness.",
            "date": "2009-09-01T00:08:00+00:00",
            "helpful_count": 12,
            "mal_id": 18293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207915.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kurogashi",
                "username": "Kurogashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=18293"
        },
        {
            "content": "This anime really surprised me by way it was told and the characters relationships. It was a really good anime with a great plot and music that complimented the moments to create additional emotion. It was the first in this genre that I've ever watched and it blew me away easily becoming my favorite anime so far and I doubt that'll change. The show was really interesting and I wasn't bored as there was always something I was interested in. I loved this anime and think its one of the few masterpieces out there and would recommend it to anyone whether they watch anime ornot. Be sure to watch the first series before this one called \"ef a tale of memories\" which is also just as good.",
            "date": "2013-02-16T21:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 86999,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2186015.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/godzillabrandon",
                "username": "godzillabrandon"
            },
            "url": "https://myanimelist.net/reviews.php?id=86999"
        },
        {
            "content": "i went into watching ef with no recommendations and decided to see it all the way though. it ended up becoming my #3 favorite anime. i found myself caring for each of the characters as though they were truly here with me. episode 6 of this anime had me in goosebumps the entire time and it is something i will never forget. i highly recommend this anime.",
            "date": "2012-10-02T20:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 73955,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/777699.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Efx",
                "username": "Efx"
            },
            "url": "https://myanimelist.net/reviews.php?id=73955"
        },
        {
            "content": "I'll be honest . Ef: A Tale of Melodies does have a lot of improvement than Memories but not much . Although , Ef series does made onto my Memorable anime .\r\nStory:8\r\nThis time , the story is a bit different . It tell us about how Yuuko Amamiya meet up with Yuu Himura and how Mizuki Hayama knows Yuuko Amamiya . I'll be honest that Melodies made me cry a bit more than Memories . Won't say much because i'm just gonna spoil it for you\r\nArt:9\r\nThe arts and animation is improved a bit on this one . More 3D animations and it does have somebeautiful arts that capture my interest .\\n\\n\r\nSound:8\\n\r\nSame voice characters from Memories . Love Chihiro voice actress by the way . The OP and ED is good . Not enough to made me listen many many times but it's okay i guess . I just love the violin part . It's was relaxing and yet a bit sad .\\n\\n\r\nCharacter:9\\n\r\nThe same characters from Memories . Now , they focus on Yuuko Amamiya , Mizuki Hayama , Yuu Himura , Kuze Shuichi and Nagi Hirono . I just can't accept how Yuuko's life was that sad . It literally made me sympathize her . While Kuze Shuichi with his sickness . All i can say is that Melodies did a good job on the character plots .\\n\\n\r\nEnjoyment:9\\n\r\nMore drama , less comedy , perfect for those who in need of crying . Does have some weird moments like Yuuko rapping (refer to episode 6 if i'm not mistaken) and Kuze rapping (forgot which episode was on) . Literally , it was a bit of weird because how fast they can pronounce each words correctly . Japan got talent for rapping i guess .\\n\\n\r\nOverall:9\\n\r\nI will say that Melodies did make me watch with one go . It was a good anime that focus on drama . If you want to have some crying moments , this is for you . But , do mind to watch the Memories first because if you watch this one first , It might just spoil everything and ruined it .",
            "date": "2015-03-07T03:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 181873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=181873"
        },
        {
            "content": "This is not simple to watch! \r\nI am a grown man, but i have never in my life cried so much as trough this so called anime series. It is impossible to call this a simple anime. It touches your heart to the deepest level!\r\nI recommend this to people that love sad romance stories. But i do not recommend it for people like me, which have high level of empathy. I cried at almost every serie. \r\nA true master piece",
            "date": "2013-11-16T14:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 120495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2600269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/madpucca",
                "username": "madpucca"
            },
            "url": "https://myanimelist.net/reviews.php?id=120495"
        },
        {
            "content": "Story: The story in \"melodies\" is definitely better than in \"memories\". Once again, we have two storylines- One focusing on the past of Himura (the guy with white hair), and the the other on Mizuki (Kei's blonde friend).  After watching \"melodies\", i realised that issues of characters from season one were rather... Shallow. For example, the whole problem of \"love triangle\" in \"memories\" is really weak in comparision with Yuuko and Himura relationship. The ending was much more convincing as well. If it is about the second story, it's very similar to Chichiro's issue from season one. The main difference lies in intensity ofthe story, though i can't write anything more, because it might spoil the fun.\\n\\n\r\nArt: It was really solid. Character design haven't changed, but the animation got better, and much more artistic eksperiments were used. There are some memorable scenes, but no suprises- you are probably used to the unusual directing if you watched &quot;memories&quot;\\n\\n\r\nSound: Nice, but nothing out of ordinary. There are no tracks that you would remember after finishing whole series, but they match the scenes, and are quite enjoyable. The opening is very similar to the opening from the first season, but it has a nice feeling to it. \\n\\n\r\nCharacter: The main characters in &quot;melodies&quot; are very well made, and i liked them much more than main characters in &quot;memories&quot;. I felt that they are more mature and convincing, but their development was rather predictable. Still- better than in first season.\\n\\n\r\nEnjoyment: I believe everybody will find something they will like in &quot;ef - a tale of melodies&quot;. The story is quite intense (for a drama series), but short (12 episodes). Personally, i finished it in two days, so i didin't get too attached to the whole series, but i still find it very amusing, and i don't regret one minute spent in front of the screen. \\n\\n\r\nOverall: Great piece of work. Everything is solid and well-made, so i gave the series 9. If you didin't liked the first season, i don't think you will like the second, because it basicly extends the ideas from the first one. However, it's worth a try, since it's a a little bit better.",
            "date": "2009-02-11T14:29:00+00:00",
            "helpful_count": 8,
            "mal_id": 12341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/earthshine",
                "username": "earthshine"
            },
            "url": "https://myanimelist.net/reviews.php?id=12341"
        },
        {
            "content": "ef- a tale of melodies comes to complete the \"tale of memories\".\r\nI really love this anime because it combines the beauty of music, art and strong characters.\r\nA violin, a sketch, a smile, a memory , a melody... \"Death or life just something small to grab on\".\r\nLove, friendship, pain, the fear of being alone, the fear of hearting the one you love  all mixed  with a beautiful soundtrack makes you wonder of your own life, the melody of your life.\r\nSo let me ask you \"Can you hear it? the true melody\"?",
            "date": "2009-03-11T15:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 13120,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/57832.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Annise",
                "username": "Annise"
            },
            "url": "https://myanimelist.net/reviews.php?id=13120"
        },
        {
            "content": "I actually made my account on myanimelist because of this anime. I wanted to share my views after seeing it all. \r\nHaving watched Tale of Memories, I went into this one with high expectations. And, unfortunately, was let down.\r\n'Tale of Memories' was the first anime after 'Clannad' to actually move me, both 'Air' and 'Kannon' failing in that department (I only saw the latter two after Clannad, and they felt pale in comparison). However, 'Tale of Melodies', in my opinion, went the wrong way. It OVERLOADS you with stylistyc art and does not deliver on the story. \r\nIf you split it into two stories, neitherbrings any joy from watching. \\n\\n\r\nThe back story is borderline awful, dark and twisted. One of the characters is so despicable and horrid that you wish only the worst kind of death for him. His resolution felt extremely out of place. The drama in the story was also very much forced and out of the blue.\\n\\n\r\nThe 'contemporary' story is not any better. Actually, what story? Looking back, there hardly is a story to begin with. 95% of it is just fancy art stylings.\\n\\n\r\nPossibly the worst thing about this anime is that it almost ruined some of the characters from 'Memories' for me. Luckly, in the end, they were 'spared'.\\n\\n\\n\r\nBottom line is: If you only liked 'Tale of Memories' for its art only, go ahead and watch 'Melodies'. There is plenty more of it in the sequel (almost to the point of annoyence). If you liked 'Memories' for the story, the characters and the feelings, 'Melodies' will disappoint you. Don't expect anything remotely close to the touching story of Renji and Chihiro in this one.\\n\\n",
            "date": "2013-02-17T02:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 87025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2189709.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/rogue1982",
                "username": "rogue1982"
            },
            "url": "https://myanimelist.net/reviews.php?id=87025"
        },
        {
            "content": "Do you here it - a true melody?\r\nWhat could I say about this anime. Hm... It's still my \"number one\" between anime-dramas. I felt in love with Tale of Memories and second season was even better than first one.\r\nStory. Both stories not unique but very interesting ansd dramatic. Really hard emotions appears than you watch it. Ends of 6 and 10 serries were real shock for me. That's how real drama should look like. And I really liked that all storylines were bounded together in this season.\r\nCharacters. Really interesting. All of them could be characterized by typical classes but it's hard to find the samecharacters somthere else. They were made very bright and individual.\\n\\n\r\nVisual. Best part of this anime. Beatufull drawing and interesting visuall \"tricks\" for \"brightning\" especially dramatical moments. That was really cool.\\n\\n\r\nMusic. OP is perfect. Maybe, the best I heared in anime. Theme songs and melodies very good too. Endings... it's hard to find drama with good ED themes but they are much better than, for example, Clannad ED.\\n\\n\r\nTotal. \"Must see\" for all, who love dramas\\n",
            "date": "2009-09-24T06:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 19065,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/234654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nachtwandler_21",
                "username": "Nachtwandler_21"
            },
            "url": "https://myanimelist.net/reviews.php?id=19065"
        }
    ],
    [
        {
            "content": "I personally love the series ef, the characters are all well planned out. All of them are different in their own ways, they all have good hearts something you don't find common anymore. Ef. really plays a number on your emotions and feeling. They give you this cold hearted story that seems so tragic that you start to doubt there really is no god on this earth. They repeat a certain line through the series \"Miracles don't exist in this world. There are only inevitabilities and accidents\" which is true in a way, they also speak about there is no god for life won't bethe way it is if there was. But as they climax the characters are forced to deal with their problem before escaping their own nightmare. The series has a really great drama effect to it, you get to see them dealing with their own problem their ways just proving, that everyone has their own nightmare and struggle. That makes them who they are today, even those the character face a different individual problem they are all learning that they need to stop worrying, stop letting their fear control them. Like Chiro explains in order to make your dreams come true you have to do try.  The shows are trying to make their message visible for everyone to see. That giving up isn't your only option. Life still a lot scarier yet that's what makes it beautiful to have someone you love to stand by you isn't that just bittersweet.",
            "date": "2016-12-03T19:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 234840,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5825028.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/YuiFireDragneel",
                "username": "YuiFireDragneel"
            },
            "url": "https://myanimelist.net/reviews.php?id=234840"
        },
        {
            "content": "Very infrequently one comes across an exquisitely presented work of art that mesmerises, thrills and captivates. With every passing glimpse, the spectator is left with a plethora of emotions and a stream of portentous thoughts reverberating around their mind like a pulsating ocean. “Ef: A Tale of Melodies” is a tour de force of this calibre that elicits the full range of emotions from the astonished viewer who is left with a fuller perception of the triumphs and hardships of life. Struggles, achievement and benevolent bonds between individuals encompass life, a reality that is elegantly portrayed by “Ef: A Tale of Melodies” as acast of remarkably believable characters coalesces with a gracefully crafted storyline of immense distinctiveness. This series is the sequel to the exceptional “Ef: A Tale of Memories” that was in itself a truly singular accomplishment; in many ways the sequel is able to serenely surpass the original. \\n\\n\r\n Taking place after the first instalment, “Ef: A Tale of Melodies” entangles the mysteries of most of the supporting characters from the original series. The series uses a narrative similar to the first instalment as two separate and parallel plotlines are successfully portrayed. Yuu Himura is the diligent and assiduous protagonist of the first story which is set years in the past; he is depicted as a determined young man who is intrinsically fixated with maintaining his topmost academic position at Otowa Academy. At school he fatefully comes across an enigmatic girl by the name of Yuuko Amamiya who, to his stark bewilderment, appears to clearly recognise him. From this point the viewer begins to be enthralled by a quintessential emotional voyage as memories from a detached and tragic childhood, fragments of a difficult past rather left irretrievable, begin to come back to Yuu through his encounters with Yuuko. This consequential reunion with Yuuo causes Yuu to once again confront the dejections and resentments of their shared past and present- it sets Yuu on the altruistic path to save Yuuko from a history of violent abuse. Yuu Himura is a young man who carries many intricacies; he is depicted as an archetypal pessimist whose negativity borders upon nihilism and a confused individual who is chronically indecisive. Through his interactions with Yuuko Amamiya, person who displays immense kindness and emotional rigour amidst arduous circumstances, we see the maturation and mental development of an individual who was initially tentative about life. Both characters are effectively portrayed but the encounters between the two can at times be overly dramatic to the point where some scenes lose their realism.  Nonetheless, this story is strikingly well-developed and perhaps the more superior plotline of the series as it induces sorrow, anger and pity through characters that ultimately convey an emboldening sense of equanimity. \\n\\n\r\n The second plotline, which focuses on the present -day lives of Shuuchi Kuze and Mizuki Hayama, is the weaker story since it is not as emotionally charged and distinctive as Yuu and Yuuko’s arc. Due to slower pacing it lacks the gallop of anxiety and the vivid suspense that makes the first story so transfixing; Kuze’s arc is fascinating and well portrayed but the individual scenes are not as well executed as the impeccably weaved melodrama of Yuu’s melancholic past. With regard to the story, Shuuchi may appear to be a definitive womaniser but it soon becomes clear that he is indeed a truly convoluted and tragic character who craves isolation. Yet by sheer chance he comes across a girl by the name of Mizuki Hayama who is infatuated by him as soon as she hears the alluring and ravishing sounds of his violin performance. It is later established that Shuuchi is suffering from a terminal condition and that his days are severely numbered; amidst this reality he has decided to cut off all of his relationships and submit to a sequestered demise. The poignancy of Shuuchi’s character is exceptionally portrayed as the producers skilfully craft an atmosphere that almost forces the viewer to become sympathetic to his condition and struggles. Mizuki Hayama, however, is a person who will not let him perish alone and without resistance; Mizuki attempts to become closer to the dismissive Shuuchi, giving rise to an incipient romance that is blighted by the dejecting shadow of imminent tragedy. The arc is deficient in the emotional melodrama that the first story so powerfully portrayed but on its own, Shuuchi’s plotline is compellingly enacted due to a profound and deeply resonating message- through force of will and sheer determination one can valiantly confront their struggles. The two plotlines introduce a thoroughly engrossing psychological element as the producers give regular insights about the thoughts dominating the characters’ minds, which increases the emotional rapport between the viewer and the cast. Both Shuuchi and Mizuki are flawed characters whose pretensions of ebullience are a façade to mask their own mental conflicts and inner anguishes. The pragmatism through which they are portrayed is a major strength of the plotline since the viewer is able to relate to the characters through a tender heart and sentimental perspective. The viewer is also delightfully reacquainted with the characters from the original series, such as Renji, Chihiro and Kei, which expands the range of the series. Ultimately, both arcs coalesce at as Yuu confronts Shuuchi which engenders a flawlessly weaved narrative that will be cemented in the viewer’s memories.\\n\\n\r\n   “Ef: A Tale of Melodies” is a technical and artistic masterpiece as every scene is meticulously and elegantly crafted- the artwork is singularly detailed and among the finest one will see. So many visual techniques, such as silhouettes and colour contrasts, are utilised to give rise to a series with unrivalled presentation that can be described as a chef-d'oeuvre. The soundtrack, including the themes and opening, is impressive in that it immaculately accompanies the most portentous and emotionally riveting scenes of the series to ascertain that they firmly resonate with the viewer. \\n\\n\r\n Through assiduously presented features, a narrative that captures every possible human emotion and a cast of thoroughly relatable characters, “Ef: A Tale of Melodies” establishes itself as a series with few equals. Whilst the series has some flaws, its accurate depiction of the strengths and flaws of human nature is remarkable and gives rise to an idiosyncratic series that will capture the hearts and imagination of any viewer. Watching “Ef: A Tale of Melodies” is like witnessing an artist who is painting the successor to his greatest work; his skills have been refined, his technique has matured and his mind is more focused. The series is an artistic stroke of genius that transcends convention through its idiosyncrasies and poignantly elicits emotion in the most effective of manners.\\n",
            "date": "2016-02-24T15:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 211629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5141876.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MALHI",
                "username": "MALHI"
            },
            "url": "https://myanimelist.net/reviews.php?id=211629"
        },
        {
            "content": "I loved this anime.  It has a little different style to it than memories though.  I think that the drama is higher and the love stories much more heart wrenching.  I suppose it isn't 100% necessary to watch memories first for the main story, but it certainly fills in some gaps as there are some random references to the prequel.\r\nStory (10): The story lines can make you pause and think for a little bit.  However, that is only because it switches between past and present.  Don't get me wrong, ef switches between stories and times quite nicely in a waythat flows wonderfully, but the simple nature that you are seeing the same characters in the past and present might be confusing for the first episode or so.  That said, I loved the story in this.  It is even better than in tale of memories.  I don't want to give anything away, but the stories were just fantastic.\\n\\n\r\nArt (9): Much like memories, the art can be pretty unique.  The \"regular stuff\" won't blow you away.  It's nice and pretty and at times beautiful, sure, but nothing that will make you pause the video just to look at a beautiful background.  Basically it's is really well done (just not quite OMG enough for a 10).  If you watched memories, you know what I mean when I say that at times the art is unique.  You can tell the artists really tried to be artistic.  And a lot of the times it works really well and to cool effect.  However, sometimes the artists seem to go on these acid trips... it kinda works for the scene that they're in, but you may not like it too much.  Overall, the art quite good, even unique at times, and in no way makes the viewing not enjoyable.\\n\\n\r\nSound (8): No complaints here.  Everything was well done.  There is a sub theme of music in the series (hence the name) and I would say the music was quite good and always did a great job of setting the mood or simply adding extra beauty.\\n\\n\r\nCharacter (9):  Some great characters in the series.  The development was fantastic and the way they mered past and present was really good.  You really got an idea for the characters and what they went through.\\n\\n\r\nEnjoyment (10):  I loved this anime.  Kept me on the edge of my seat and I couldn't help but keep watching.  Great stuff!\\n\\n\r\nOverall (9):  A fantastic series that I recommend to anyone who likes the romance, drama, slice of life style anime.",
            "date": "2010-04-04T23:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 24679,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/spaz4444",
                "username": "spaz4444"
            },
            "url": "https://myanimelist.net/reviews.php?id=24679"
        },
        {
            "content": "yea i just just watched this anime it  is very sad but makes me cry like a boi.?.. I really enjoyed it it uses a unique animation techniques to express character emotions ( a very different approach an I really liked it) it has beautiful background music that also sets the mood of the scenes it has a lot of genres including romance, Drama, mystery and Seinen  the anime is very well made it is a must watch, and if was to  compare it to Clannad Air Kanon ect it would rank very high up in my personal list of anime i'veseen  bois rating?   10 ;) it's really worth watching! (make sure u watch memories 1st) lol.   \\n\\n",
            "date": "2011-08-22T00:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 41919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/509715.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xDaboi",
                "username": "xDaboi"
            },
            "url": "https://myanimelist.net/reviews.php?id=41919"
        },
        {
            "content": "I didn't enjoy watching it.\r\nhow do I put it....there are just way too many negative elements dumped on one person, and the emphasis is either way too focused or way too distracted. I understand that as a drama, there have to be some tragedy involved, either in the past or present. However, this doesn't mean an overemphasis of these tragedies will make the show more tear-jerking. I honestly cried a river in clannad after story but this didn't make me shed one tear. \r\nStory-wise, it goes back and forth from present to past not really in the form of flashbacks, which is nice for athriller, but I think this strategy totally backfired on the drama aspect of the show. By the end, neither what happened in the past nor what's happening in the present can be thoroughly enjoyed. Even the complicated ties among all the characters in the past and present cannot make up for the lack of real bond among all the characters. Why? Because there was never one to start with. The story is badly told to be convincing, not to say the characters are too unreal to be unbelievable. Who on earth get to be adopted, beaten, raped, and then die in a car accident? Even if such persons exist (which I suppose is more believable during war times), the ties are too convenient to be even called fate. Fate would laugh at such ties. \\n\r\nA drama as unreal as this doesn't even deserve to called one. And, this isn't a melodrama either. The psychological sections scattered throughout the story aren't very convincing either because the overall setting and atmosphere aren't powerful enough. Even the dialogues, which I admit have some depth, are too unnatural to even make an impact. \\n\\n\r\nWhat I think is, the creators tried too hard. I feel like they want to make a show that breaks the drama genre without going into horror or action (I'm guessing it from the opening and some excerpts), but I think their effort backfired.I even prefer a good old melodrama to this.",
            "date": "2011-08-11T12:51:00+00:00",
            "helpful_count": 6,
            "mal_id": 41287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/526945.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/movoning",
                "username": "movoning"
            },
            "url": "https://myanimelist.net/reviews.php?id=41287"
        },
        {
            "content": "In my mind, the Ef series defined what great animation was in its time; and the animation style paved the way for some of the techniques that Shaft is now famous for. It is a great relationship show with actual meanings, something that many shows these days seem to lack. Thus without further ado, let us proceed with the review.\r\nEf- A Tale of Melodies is more of a continuation than a sequel to A Tale of Memories. It tells the tale of the older generation (Kuze, Yuko, and Himura) that seemed to show up randomly but at key moments in the first series to givethe young couples words of advice. This series greatly deepens the meaning of the relationships in Memories and puts the whole \"two cities\" and other ideas in perspective. The story very nicely generalizes to the main story behind Himura-Yuuko and Kuze-Mizuki while still maintaining cameo appearances by the cast in the original Memories.\\n\\n\r\nThis series, unlike many other recent watches, attempts to carry a message to the viewer rather than just serving as a means of entertainment. On the note of entertainment, this series is very dark; I would not recommend this series for those under 14. However, the entire point behind the combined series (Memories and Melodies) is the theme of perseverance and hope.\\n\\n\r\nMelodies did an outstanding job of uniting the stories of both series as well as bringing a satisfying sense of completion to the franchise. The ending is very well planned and executed (a sharp contrast with DCIISS) and left me very impressed. I had high expectations for this series after Memories and it did not disappoint.\\n\\n\r\nAnimation:\\n\r\nThe animation quality is very high, making use of many colors giving the series a feeling of warmth or coldness when appropriate. Characters are well drawn and emotions are very apparent at times, basically expect what you saw from Melodies.\\n\\n\r\nThere are many stylistic points that are unique to the Ef series (Minori really) including halos around characters in dark environments and simple yet potent artistic animation sequences.\\n\\n\r\nMany may disagree with me on the animation score due to the fact that many of the animation sequences seem cheap, such as the characters being drawn in monochrome or other easily-animated \"short-cuts\". However, I feel that this is an artistic decision and successfully contributes to the underlying theme of incompleteness. If you pay attention to the OPs/EDs (as in Memories), the final episode is different as now the story is complete and the characters have now been fully exposed (and thus no longer opaque!).\\n\\n\r\nAs I believe the animation decisions were key to the presentation and feel of the series, I felt the drawing style complemented the story and themes perfectly. As close to a masterpiece as I had seen at the time.\\n\\n\r\nSound:\\n\r\nThe OP is done by ELISA just as in Melodies. Though the song is not as vibrant as in the previous series, it still has the same general feel to it. It is in somewhat broken English but those watching this are probably already used to it from Melodies. There are multiple EDs as in Memories and those are fair in quality, comparable to Melodies. The BGM is very reminiscent of the first series. It carries a calm yet not quite friendly feel and compliments the atmosphere created by the artistic style and animation. There is a repeated theme that is played throughout the series. It starts as a fragment of a memory and develops slowly into a complete song by the end of the series, again a great execution decision that adds to the climax.\\n\\n\r\nThe VA cast is the same as in Memories though the main VAs have shifted. Those that had a supporting role in Memories are now the main VAs. Yuko has a particularly difficult role and the VA did an awesome job. If I had anything against the series it would be Himura's voice. He doesn't seem to have the enthusiasm that most of the other characters show, even more so given his character portrayal.\\n\\n\r\nStory:\\n\r\nYu Himura, Yuko Amamiya, Kuze, and Mizuki were all supporting character in Memories. Now they take center stage as their past and present are told in an intricate tale that also links to relationships in the original Melodies series.\\n\\n\r\nAs in the original story, the story takes place in two cities, one in Japan and one in Australia. The two mirror cities is a theme that will be exploited greatly and finally explained in completion by the end of the series.\\n\\n\r\nThe two main stories are the history of Yu Himura and Yuko Amamiya and the present development between Kuze and Mizuki. Both stories are told concurrently in a similar fashion to Melodies, the difference being that Yuko's story is in the past. There aren't episodic cliffhangers, as the entire series as a whole is a cliffhanger in that each episode serves as a teaser to whet the viewer's appetite. Many of the characters have had a very dark past and/or present and these are explained in excruciating detail, giving the viewer a sense of the character's pain. As mentioned previously, some of these are quite graphic and may not be appropriate for younger audiences. However, the series then puts everything into perspective and finally leaves the watcher with a very philosophical and hopeful message at the end. The conclusion explains many of the happenings in both Memories and Melodies and gives a very satisfying sense of conclusion.\\n\\n\r\nOverall, the stories are intricate and well planned. Expect some surprises along the way that deepen the meaning of both series.\\n\\n\r\nCharacter:\\n\r\nThe development of the main characters takes the majority of the series as the viewer listens in to the character thoughts. It is very difficult to say much here without spoiling parts of the story but suffice to say all the characters have had significant difficulties in their past that they are trying to overcome. The exposition of each character is wonderful (yet painful) and the main characters from the previous series also return to explain how their roles are actually related to the main stories in the present.\\n\\n\r\nValue:\\n\r\nMelodies is a wonderful, yet painful, experience that explains many of the confusing aspects that were in Memories. It is show full of details and buried themes that the philosophical-minded viewer will enjoy. As many of the subtle points are buried behind animation sequences and hints, a re-watch will definitely reward the viewer. This series truly breathes life into a genre that I hadn't watched in a while. And it still resonates years after its release. Pick this up if you've watched Memories and liked the artistic qualities and get ready for quite an adventure.",
            "date": "2015-11-05T23:53:00+00:00",
            "helpful_count": 6,
            "mal_id": 202773,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202773"
        },
        {
            "content": "What can I say? I simply loved this anime.\r\nThe use of the artwork - especially the opening theme was just brilliant.\r\nThe use of symbolism was creative and lovely.\r\nThe music was awesome - the USE of the music was so appropriate.\r\nThe stories (I say stories because it's alot of stories combined as one story) was a very nice idea and well done.\r\nWatch it!\r\nCharacter design were beautiful and fitting too.",
            "date": "2009-03-23T22:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 13420,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/162397.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sukari",
                "username": "sukari"
            },
            "url": "https://myanimelist.net/reviews.php?id=13420"
        },
        {
            "content": "Ef - a tale of melodies. Can you hear that? The melody of truth.\r\n1. ARTISTRY: 10/10\r\n\"Artistry is the quality that appeals to one's sense of beauty.\"\r\nIn my opinion, if I were to compare this anime to all the other anime I've watched until now, I'd say this show is unique in a certain aspect.\r\nIt's rare that I get to experience an anime wherein which the artistry and the visual aspect of anime itself moves me deeply.\r\nSymbolisms. These are underated elements that are unseen to some people in the naked eye but I tend to look at each show's symbolisms and imageries, as these hold asecret yet an immense meaning behind them. Symbolisms appeared all over the anime, which is one reason why I like it. Masks, concealing your true identity, indeed a parasite that eventually becomes a part of you as it isolates you from your real self and lives you a life of a fraudulent person. Keys, a symbolism pertaining to the key that opens new doors, new doors in life. Paper airplanes, they soar through the vicinity of the endless horizon, aiming not only high but also forward amidst the sky. Indeed, this series held a bunchful of symbolisms and each one had a distinct and incredible meaning.\\n\\n\r\nThe songs used in this anime are also absolutely beautiful. “Music is what feelings sound like,” and I believe that the feelings felt in each and every song were portrayed to the utmost perfection. A big commendation to the song, A Moon Filled Sky. The violin's tune and melody along with the lyric's message, with them combined, they are able to form a song that brings about feelings of happiness, melancholy, nostalgia, pain and love all at once. Songs like this bring me to tears and bring me to LSS.\\n\\n\r\nThe set-up of the plot, finally, was also plotted out nicely. The story was indeed unique and not cliché. Each series featured multiple stories of a couple's story towards their journey of reaching one another and they were able to balance out the interest of each story.\\n\\n\r\n2. INTELLECTUAL VALUE: 10/10\\n\r\n\"Intellectual value refers to the anime stimulating thought. It enriches our mental life by making us realize fundamental truths about life and human nature.\"\\n\\n\r\nWho wouldn't learn anything after seeing two seasons that foretold true love, pain and anguish of separation? ef - a tale of melodies. was packed with fundamental yet unrealized truths about life itself.\\n\\n\r\nEvery conflict each character faced through, every action each character did, every consequence each character faced is already a realization of the fundamental truth that goodness begets goodness.\\n\\n\r\n3. SUGGESTIVENESS: 10/10\\n\r\n\"Suggestiveness is the quality associated with the emotional power shown and experienced by the audience.\"\\n\\n\r\nWow, I was moved throughout the whole course of the series, both of them, especially this sequel.\\n\\n\r\nPractically, every wavering scene moved my heart. When conflicts appeared and in consequence, caused sadness with each presented couple, when an answer that could solve the problem appeared and eventually did and then they fell happily ever after. In all these moments, strong emotion built up inside of me, I almost wanted to cry but I didn't, as if I did, I would be interfering the flow of the show.\\n\\n\r\nThe very fact that I forced myself not to cry in order to waver the feelings in my heart more while watching the show already raises a 10/10 for suggestiveness, no doubt.\\n\\n\r\nIntense emotions, emitted both in the scene and on the audience's point of view, that is the true epitome of suggestiveness.\\n\\n\r\n4. SPIRITUAL VALUE: 10/10\\n\r\n\"Spiritual value is the quality wherein which the show elevates the spirit by bringing out moral values which make us better persons.\"\\n\\n\r\nI consider the spiritual value of the show the most among all the other aspects. If I learn something out of it, if I'm able to change myself for the better thanks to a show, that show deserves a 10/10 for changing an individual's life.\\n\\n\r\n\"To keep on dreaming... that's the first step to making a dream come true.\"\\n\\n\r\nThis show led me to realize that miracles do happen, dreams do come true and that nothing is impossible. All of them had a simple way for them all to be true and that is to never give up.\\n\\n\r\nLife. Oh yes, it is undoubtedly going to be one hell of a journey. You're going to experience loneliness, anguish, despair and all other painful moments at some point in your life but in the same time, you will experience the greatest feelings you will ever have such as love, happiness and joy, as featured in this show. Everyone in the story had a happy end with an everlasting shine, nevertheless of all the painful experiences they've went through.\\n\\n\r\nThis show gave light to life, despite this world's cruel society, with all the corrupt officials, merciless murderers, deceiving friends. The show singlehandedly inspired me to look at life in a much greater aspect than I had seen it before. I am just pumped up with inspiration and motivation to strive for the best right now so I can live my life to the fullest after watching such a masterpiece.\\n\\n\r\n5. PERMANENCE: 10/10\\n\r\n\"Permanence is shown when a great show endures time and space. Thus, it immortalizes its maker along with the show itself.\"\\n\\n\r\nI'm not gonna forget this show for a long time, I can guarantee that. After all I've learned from the story, there's no way I'll immediately forget it. The moral messages shown throughout the series, those words will soon turn into actions of kindness in my case. I keep in mind that if I learn something, I will always apply it into action to further engrave the message into my mind and into my life.\\n\\n\r\nOVERALL: 10/10 or 10/10\\n\\n\r\nMy overall score may seem a bit exaggerated but what I grade it is true. ef - a tale of melodies. is one of the most magnificent masterpieces of anime I've seen in my whole history of watching anime. If you were to hear my opinion whether this is worthy enough to watch, all I can say is that it won't be a waste of time and that you won't regret watching it. Infact, if you're not watching it yet and you are reading this review, you better stop reading and start watching and I bid you happiness as you watch the series where you indeed can and will hear the melody of truth. ;)",
            "date": "2013-01-02T02:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 82340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/796677.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ru-chan",
                "username": "Ru-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=82340"
        },
        {
            "content": "Story- The story was nothing special but the show stayed on track. I really liked how each episode would add on to the storyline and make sure to develop the characters.\r\nArt- Simply amazing. Ef kept amazing me at the artwork it gave and how the mood touched each scene. It kept an original taste in every frame and the colors always knew how to blend in the perfect way.\r\nSound- Nothing special. It didn't take away from the show and that's all that matters. It went well and everything seemed okay. Nothing shot out as WOAH.\r\nCharacter- It was great to see how characters developed from seasonone and from the beginning of season two to the end. The characters, for the most part, do a great job of seeming realistic in personality.\\n\r\nEnjoyment- I couldn't help but smile when the anime turned from regular to artistic. When it wants to impress you, it will. Most of the episode were great.\\n\r\nOverall- I recommend it to anyone who doesn't mind barely above average across the board until it comes to the art. If you want to see a show with amazing scenes, great color, and balancing perfection, this show is for you.",
            "date": "2009-01-11T19:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 11377,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36150.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SparksOfLogic",
                "username": "SparksOfLogic"
            },
            "url": "https://myanimelist.net/reviews.php?id=11377"
        },
        {
            "content": "Ef- A tale of melodies -first impression- 6/10\r\nIt's a sequel to Memories, or a prequel, depending.\r\nStory-\r\nHalf of this story takes place in the past, which helps explain things from the first season that made everyone say \"Wait, what was that?!\". You see a semi-new story, well a side story really, but it's still nice.\r\nArt- \r\nCarries the same style from the first season. It's still nice.\r\nSound-\r\nWhere this anime really shines. The OP and ED are just awesome. In show music is very mood-setting. It's both relevant and well-done.\r\nCharacter-\r\nHe's an ass! (You know who) Aside from that, most of the other 3 characters are likeable, although Mizukiis super-needy, it fits her char. well.\\n\\n\r\nEnjoyment-\\n\r\nYou may or may not enjoy this as much as the first season. It's iffy. I really only watched it because of the first season, and it didn't add too much. It's also a breeding ground for melodrama.\\n\\n\r\nOverall-\\n\r\nIf you liked Memories, watch melodies.",
            "date": "2010-02-27T14:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 23565,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288742.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/zelda-knight",
                "username": "zelda-knight"
            },
            "url": "https://myanimelist.net/reviews.php?id=23565"
        },
        {
            "content": "In comparison to its prequel, which I gave a score of 5, this series is stale and basically inferior in all aspects.\r\nAnother two love stories featuring characters struggling with undeserved burdens are presented in parallel in the same minimalistic surrealism-tending way, but keeping to the format is forced and botched: it appears disjointed and will bewilder some people given how loosely connected the stories are and that one of them largely occurs chronologically earlier. The themes of the stories are heavier—both deal with mortality with one extending to spirituality—but because the standard of writing is still slackly simplistic their deliveries are farcical: one quickly becomesgrossly predictable and concludes preposterously with what the male protagonist achieves while the other abruptly backs down from its tension building when the main character for that makes a belated reveal. It’s all elementary and the frequent internal conflicts and monologuing in the plot becomes pretentious and tiresome; this show actually has little entertainment or practical value.",
            "date": "2012-12-05T15:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 79262,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/970287.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PreFuturism-0",
                "username": "PreFuturism-0"
            },
            "url": "https://myanimelist.net/reviews.php?id=79262"
        },
        {
            "content": "Warning this review may contain spoilers.\r\nFirst impressions, so after watching tale of memories,\r\nI decided to check out this out to see if it was as good or enjoyable as it,\r\nAnd over all  I wasn't that disappointed.\r\nBecause it still manage to keep to its quality up to a point.\r\nStory, 7/10\r\nSo Ef tale of melodies tells the story of two romances,\r\none of them is in the past and the other is in present day,\r\nIt's basically a prequel/ sequel to its predecessor Ef tale of memories,\r\nSo I am going to brake both of them up and talk about one at a time.\r\nSo let's start this story with\\n\r\nyuu himura an orphan high schooler who trying to persure his dreams.\\n\r\nOne day while leaving school a paper plane hits him on the head form the school roof, after investing he encounters a girl who seems to know him,\\n\r\nBut for the life of him he can't seem to remember,\\n\r\nWhile helping a school friend with her shopping he finds out that he as been followed by the girl who he meet on the roof, who is reviled to be  yuuko amamiya \\n\r\nWho shared a close brother and sister like bond while they where in the orphanage together as kids,\\n\r\nSo after that they decide to pick up where the left off especially since she still has feelings for him. \\n\r\nWhich is kind of sweet you know old friends re kindling old bonds which is always a good thing to do.\\n\\n\r\nSo after this hanging out again like old times and starting to rekindle that bond,we find out that she become the victim of bullying which she doesn't seem to care much about it, it is then reveled that she is actually being   sexually and physically abused her adopted older brother and that the school bullying was actually her doing in order to get back at yuu   For rejecting her offer to be his sister which had her end up in the situation she in now.\\n\\n\r\nSo I thought this whole drama with the brother was kind of interesting and something I Haven't seen that  much of before,\\n\r\nBut I also felt it was played a little to hammy for my taste personally.\\n\r\nI also didn't really like the part where yuuko  was fakeing the school bullying to get back at yuu,\\n\r\nWhich I found quite pitty,\\n\r\nBut don't get me wrong Like I understand the reasoning behind it,\\n\r\nBut I am just thinking to myself oh you bitch,\\n\r\nLike I know you blame him and i like the idea of his past actions coming to bite him in the ass,\\n\r\nBut come on he was like small Kid around the time the made that choice do you honestly think he could of predicted that this  would happen.\\n\r\nPlus people make mistakes especially children.\\n\\n\r\nSo he decides to run away with her in order to get her away from her abuser,\\n\r\nWhich works as well as you think as she returns back to her brother shortly afterward,\\n\r\nWhich I liked because I don't think it's going to work out especially if you have no job or money to keep your going.\\n\r\nwhich leaves both of them time to reflect on the  consequences of what they both done to each other and who they can make it right.\\n\r\nWhich I really liked because both of them realized that both of them have fucked up hard and that need to forgive each other.\\n\r\nWhich though a series of events leads to the older brother killing himself by setting himself and the house a blaze,\\n\r\nWhich I thought of kind of a bit to over the top,\\n\r\nBut I guess that had to solve it one way or another.\\n\\n\r\nWith her brother now gone both of them can now be together.\\n\r\nBut there happiness doesn't last long Which doesn't last for long as one day while waiting for yuu,\\n\r\n yuuko get hit by a car while saving a small child and dies, \\n\r\nWhich yuu still hasn't gotten over even In present  day,\\n\r\nI thought this part of generally tragic because after what they been though together and how much effort it took to get there was just taking in a second \\n\r\nIt's like life decided we haven't had these people suffer enough we need to stick the knife in deeper and twist it.\\n\\n\r\nBut yuuko hasn't given up yet either as her spirit is still waiting for him,\\n\r\nIn Which they finally meet another again in order to spend one last day together before she fully passes on.\\n\r\nWhich I thought was very touching and sweet,\\n\r\nBut it kind of rueing  the impact of her death.\\n\\n\\n\\n\\n\r\nThe second is in present day that starts off with mizuki hayama an outgoing high schooler who is staying with relatives for the winter holidays,\\n\r\nWhile staying there she hears a  violin playing in the background and is I entranced by it sound.\\n\r\nAfter asking her relatives she find out it came from there next door neighbor kuze shichi a middle aged play boy who is a professional  musician,\\n\r\nAfter being introduced to one another they decide to hang out during the holidays.\\n\r\nWhile hanging out together a few times  mizuki starts to becoming even closer and closer to kuze and is developing feelings for him,\\n\r\nOk this is kind of different I wonder how there going to handle this massive age gap.\\n\r\nshe starts noticing that something is wrong with kuze with him at times passing out or   that there somethings he not telling her,\\n\r\nshe finds out that kuze has got a terminal heart illness that will kill him in about a year with him suffering from depression because of it.\\n\r\nNow I found this kind of interesting but also quite mallow dramatic at the same time\\n\r\nAfter finding this out she decides to try's to save him from his depression and make his last days on earth as happy as possible,\\n\r\nWhich at first doesn't really go that well especially since he in a very dark place  and he isn't willing to allow people to help him especially mizuki. \\n\r\nI found this part quite realistic at less of what happens to a person suffering from depression and the fear of death as your body just slowly starts to shut down.\\n\r\nBut though  consent persistence and her love for him she manages to get though to him and convince him to go through the operation that can prolong his life for a few more years. \\n\r\nBut the operation could also kill him as well,\\n\r\nSo giving it all or nothing kuze decide  to go though the operation for mizuki with it working So after the operation both of them begin there relationship together\\n\r\nWhile it lasts.\\n\r\nI thought this was also very sweet and did bring the feels, \\n\r\nBut I think this could have been more tragic and it's already crossing on the fine line where you know this isn't going to have a happy ending at the end of the day unless they have some sort of ass pull \\n\\n\r\nSo while I compare   the two romances together,\\n\\n\r\nI really like that one between kuze and mizuki more then yuu and yuuko,\\n\\n\r\nBecause I personally found there one more relatable,\\n\r\nEven though found it a little pedo-ish. \\n\r\nBecause I can relate to the whole depression thing and it being related to some sort of terminal illness,\\n\r\nLike the struggle you go through, the ups and down of it all.\\n\r\nIs something that I have experienced myself and it's definitely more interesting and relatable to me when compared to childhood friend in a  abusive relationship  Which is probably also quite  relate to quite a few people,\\n\r\nBut personally I couldn't really bye into it.\\n\\n\r\n But I found both of them where handled in the proper way,\\n\r\nEspecially when it came To the subject matter that they both  tackle.\\n\\n\r\nI also found both of the dramas interesting and different from what i usefully see,\\n\\n\r\nBut I think that both  how they end are kind of ass pullish,\\n\r\nBecause your girlfriend is waiting for you as a ghost in order to send one last day with you,\\n\r\nI probably would have liked more is that he dies and then meet her in the after life\\n\r\nBut hay that just me.\\n\\n\r\nAlso your boyfriend with the heart disease living past a operation that had I high chance of killing him or not working.\\n\r\nBut those are my only nick picks.\\n\\n\r\nBut guess my major problem with it is that it kind of ideal for its own good I guess,\\n\\n\r\nBut You know this was based on a porn game so I guess that the reason why.\\n\\n\\n\\n\r\nCharacters, 6/10\\n\\n\r\nYuu and kuze.\\n\r\n I thought yuu  was kind of bland character especially in his high school days,\\n\r\nI mean the only thing he pretty much had going for him as that he was very independent person and he was a orphan,\\n\r\nBut I did think he was a bit more interesting in his adult years,\\n\r\nBecause he kind like this mentor character or something along those lines.\\n\\n\r\nKuze had a bit more going for him especially what was going on,\\n\r\nBecause he was acting quite human \\n\r\nBut other than that he was kind of just the playboy  kind of character.\\n\\n\\n\r\nyuuko and mizuki.\\n\\n\r\nWhen it came to yuuko I thought she was a kind of bland character,\\n\r\nIntill the thing with her brother was found out, \\n\r\nBecause under that happy outside was a girl who pretty much thinks of her self as damaged goods,and it takes yuu to show her that she more than that.\\n\r\nSo I give credit where credit is due \\n\r\nMizuki I found was just the happy girl and nothing really else to her,\\n\r\nOther than the fact she just happen to have a lot of wisdom on life which I thought came out of nowhere.\\n\\n\r\nSide character are pretty average,\\n\\n\r\nAlso all the old characters are back as well,\\n\r\nSo we get to see what there up to as well.\\n\r\nWhich is quite nice.\\n\r\nBut nothing Really happened that much with them.\\n\r\nThere just kind of there.\\n\\n\\n\r\nArt, 7/10 \\n\\n\r\nThe animtion looks very nice,\\n\r\nVery crip and clean \\n\r\nThe background also look very detailed as well,\\n\r\nThere also a very nice color scheme.\\n\\n\r\nIt has this generic v.n style to it especially or VN standards \\n\\n\r\nIt also uses a lot of symbolism in some scenes of importance,\\n\r\nIt basically shaft being shaft.\\n\\n\r\nThe character designs are also generic as well.\\n\\n\r\nSound, 6/10\\n\\n\r\nI thought the op and ending where all right,\\n\r\nI found them relaxing \\n\r\nI thought the ost was on point for very scene it was used.\\n\r\nBut it didn't really stand out that much to me.\\n\\n\\n\\n\r\nEnjoyment, 6/10\\n\\n\r\nI quite enjoyed this,\\n\r\nI found the drama interesting and even though i find it quite generic and kind to ideal for its own good and all my other  my nick picks,\\n\r\nIt probably still one of my favorite rom com shows that I like to watch every now then.\\n\\n\\n\r\nOverall, 7/10 \\n\\n\r\nIf you like romcom or just fans of the VN them probably watch this,\\n\r\nIt's fine for what it is,\\n\\n\r\nBut if didn't like the first one or don't like these types in general then probably stay a way.\\n\\n",
            "date": "2016-10-08T23:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 231405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4681991.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Biogundam",
                "username": "Biogundam"
            },
            "url": "https://myanimelist.net/reviews.php?id=231405"
        },
        {
            "content": "Okay, as always I want to preface my review with the three things I’m looking for in an anime: I want a really good story (+5), I want really good dialogue (characters/character development, etc.)(+3), and I want really good “technicals” (style, sound, etc.)(+2). For this anime, I’ll be giving an independent review per season since, while they’re meant to go together, they can be watched independent of each other (Like Clannad/Clannad: After Story). So let’s get to it!\r\nef: A Tale of Melodies… This is, to me, the darker version of its predecessor, A Tale of Memories. Again, this anime describes what I call “love onthe margins”, that is to say a love that is tragic and beautiful. There are two love stories this time around, one told present day and one told through the lens of the past. In my opinion, they’re both equal in terms of impact, unlike in A Tale of Memories, where I thought one stood above the rest. Also, unlike A Tale of Memories, these tales have a much more somber and sobering feel to them. This time around though, I felt some deus ex machina at work in the story, nothing too major, but…\\n\\n\r\nEarning 3 points \\n\r\n----------------------------\\n\\n\\n\r\nNo change in the quality of the dialogue or anything. Again, there are a lot of important messages being conveyed throughout the season about what it means to love another. And, you know what? The dialogue explained that there are TWO towns! Amazing! For that alone… A solid performance. It goes without saying that everything was on par with what I would expect from a romance/love story here. \\n\\n\r\nEarning 2 points\\n\r\n---------------------\\n\\n\\n\r\nThe technicals are still off the wall awesome here. Truly a work of art. I’m going to throw what might be considered a story element here in the technicals though. I really enjoyed how even though Tale of Memories is a “prequel” to Tale of Melodies, since Melodies focused on quite a bit of flashback storytelling, it actually felt like a prequel itself in a way. Almost like this infinite loop was being created between the two stories. I add it in technicals because the way it was expressed wasn’t exactly by story or dialogue, more like an art to me. Superb. \\n\\n\r\nEarning 2 + 1 points\\n\r\n---------------------\\n\\n\\n\r\nBonus points goes to… well, I’ve again already given a bonus point for technicals, but, extra bonus sketching stuff in the buff! All true art should be done naked in my opinion. It was another scene that ended too quickly though so…\\n\\n\\n\r\nEarning .5 points \\n\r\n--------------------\\n\\n\\n\r\nAdd it all up and we have another score of 8.5! If you watched Tale of Memories, this will not disappoint in expanding the story for you. If you’re looking for a good love story(s), I would start with Tale of Memories because this one is a little more on the darker side of things. Then again, I’d love to see what someone thought of the whole series if they started with this anime and then watched Tale of Memories. Someone should do that!\\n\\n\r\nAs always, since I’m a critic, I’ll round down my score to a 8 because that’s just the way it goes. That way it’ll be better than expected when you watch it! Till next time",
            "date": "2015-10-08T09:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 200765,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875514.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/artalien",
                "username": "artalien"
            },
            "url": "https://myanimelist.net/reviews.php?id=200765"
        },
        {
            "content": "ef-a tale of melodies, i actually start watching the anime because i find the title very interesting. \r\nThe story line is quite complex as there are more than one main characters. I could say the genre is about \"tragedy\" and finally the main characters manage to overcome their problem. I couldn't say whether the ending is sad or happy. it's up to you gus to decide. But one thing for sure, it never fail to excite me and make me shock.\r\n\"Hey i just met you.. and this is crazy.... But here's the title so watch it maybe.\" LOll",
            "date": "2012-09-10T01:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 72015,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1489161.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bormenir",
                "username": "bormenir"
            },
            "url": "https://myanimelist.net/reviews.php?id=72015"
        },
        {
            "content": "ef - a tale of melodies carries on from the prequal ef - a tale of memories, this time focusing on the stories of Yuu and Yuuko, the two older mystic characters from the first series and Renji's neighbour Shuichi andhis cousin Mizuki. If you thought the first series was difficult to understand this series is even more difficult. Before I wirte anymore a quick warning that the end titles have a nasty habit of apearing half way through the second half, if like me you don't normally watch the ed then  make sure you don't miss out any parts of the story whichfall after the ed (I had to rewatch 4 episodes).\\n\\n\r\nThe storyline takes a similar stance to the first series with multiple story lines going on at the same time, this can lead to confusion in setting out what is going on in which story line. I put watching this series off for a while before I watched it because on watching the single episodes I couldn't get into it, it was only when I could watch a few epsiodes in a row that I found it easier to see what was happening. \\n\\n\r\nThe artwork in ef is one of my favourite parts of this show, it has an almost unique way of blending colours and different images, that work really well in provoking afinity for the characters and their situations. The music also plays a similar role but not to as great an extent in melodies, but is not as unique and interesting as the artwork.\\n\\n\r\nOverall its a very good anime, and is up there with Clannad: after stories as one of the best romance/drama animes out in the past few years. If you like this genre or if your looking for something a bit different then this comes highly recommended.",
            "date": "2009-07-16T16:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 16856,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1293.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GeneralCox",
                "username": "GeneralCox"
            },
            "url": "https://myanimelist.net/reviews.php?id=16856"
        },
        {
            "content": "Such an amazing show~\r\nIt takes a little while to understand because it's story is a little complex, but it's still amazing once you understand it. The songs, melodies, OST's are excellent!!!\r\nIf you're interested in a brain twisting show. Watch it. And see how much you will have to think about what happened throughout the show XD.\r\nDefinately worth a 5th rewatch~ XD",
            "date": "2012-01-11T21:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 51583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1096637.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Zetsubou_Matt",
                "username": "Zetsubou_Matt"
            },
            "url": "https://myanimelist.net/reviews.php?id=51583"
        },
        {
            "content": "WARNING: THIS REVIEW CAN CONTAIN SPOILERS \r\nef: a tale of melodies (all lower cases; and from henceforth I shall refer to it as Melodies) is a very nice and welcome improvement over it's prequel - ef: a tale of memories (which shall be shortened to Memories from this point). Memories wasn't a bad show at all but it had a lot of annoying and boring parts due to the fact that it was an incredibly heavy melodrama where characters often did silly things seemingly for no reason just to further the storyline. It also felt somewhat generic and insubstantial. However, I loved the narrative andtook a liking to the characters and the way the anime explored its themes through them and overall felt it was a well-executed show. Melodies offers a complete look into the world of ef and explores many of the questions that were brought up but never answered in Memories.\\n\\n\r\nMelodies is very similar to its prequel. Like Memories, the anime tells us two different but related story lines at the same time often jumping from one to the other. Unlike Memories, however, the story lines this time are set in different times on either side of Memories' timeline allowing it to function as both a prequel and a sequel series. I'll be honest with you, Melodies (and Memories) are not particularly groundbreaking shows nor are their narratives particularly original and refreshing. They take fairly basic romance-drama/melodrama tropes and play them out fairly by-the-book on a narrative level. The thing that allows this series to rise above it's competition, however, is a combination of it's incredible art direction and narrative execution.\\n\\n\r\nThe animation and direction of the show sell the anime very well but there are some drawbacks. Various  visual motifs are scattered throughout the series which range from clever and subtle (like the words appearing to tear the physical space between Mizuki and Shuuichi in episode 7) to levels where it feels a bit beat-over-the-head-ish (like the whole thing with the masks). The series definitely has a more artsy feel to it but I think it worked very well in covering for the absolutely huge amounts of dialogue spoken in the show. This show never tires the eyes yet is not so intrusive as to take attention from the actual plot and characters.  \\n\\n\r\nThe events of Melodies happen at an incredibly natural pace and the director fully understood what it took to build up tension and drama before a large pay-off. This is in large part due to the show's respect of the characters. The MC's of the show are all part of a melodrama so there is always going to be over-the-top actions done and seemingly silly events happening around these characters. The show, however, fully understands these characters and never makes them feel unnatural. They each have their own roles to play and they play it very well. It managed to express them in subtle ways with great dialogue. Our two MC's for the A-part of the show are young!HimuraYuu and Amamiya Yuuko. Himura is played to be somewhat of an jerk with a good heart who suffered the tragedy of his sister's death in a major disaster years before the series' starts. The anime takes this basic character sketch and builds up a very solid and empathetic character through his internal monologues and clear, well-stated motivations. His actions never feel out-of-place for his personality even in the face of incredible melodramatic flairs like his confrontation with Amamiya Akira in episode 7. By the end of the series we can draw a clear connection between young!Himura and his older, mysterious self in the B-plot and Memories. Amamiya Yuuko is probably an even better written character than Himura. I loved the way the first half of the show portrayed her incredibly bleak and nihilistic outlook on life in pure actions and dialogue without giving away or subverting her genuine affable persona. Things like her contemplating the actions of her bullies to be a reflection of their own insecurities really sells her bleak yet thoughtful and observant attitude well. She genuinely felt like an intelligent yet emotionally-complex person. Her character development, along with that of young!Himura is slow yet notable and by the end they feel naturally more rounded and grown-up people. While she is ultimately a damsel-in-distress character she gets some of the best bits of dialogue and screen-time since Himura is more of a reactionary MC. Himura, however, does get good support from the side characters of the A-part like young!KuzeShuuichi and young!HironoNagi. I'm surprised the show managed to fit their own subplots to an already time-constrained arc and it's due to clever pacing and using the B-part to assist their character building. Hirono Nagi, in particular, has a great sub-plot where her unrequited feelings for young!Himura reflect in her inability to create and art she is satisfied with. This motif is actually quite important to the A-part where it is reflected by many of the major characters' insecurities and worries.  \\n\\n\r\nThe B-plot deals with the violinist Kuze Shuuichi and Hayama Mizuki. I don't think the narrative of this part is anywhere near as compelling as the A-plot but it also does things simply. Mizuki is simply a wonderful character who you can cheer for. I liked how she was the connecting points for much of the characters in the series and it was fun seeing her seeking assistance by no less than four previous main characters. She just has the right amount of heart and endearing traits to carry a fairly heavy story through without losing a lot of pace. Kuze Shuuichi is probably the most generic character of the entire ef series. He plays his part well through but following his story sometimes felt a bit too tiring especially since not much happens when only he is in the picture. The show managed to capture his feeling of isolation within his own mind very well, though, and his interactions with Mizuki were great especially at their part's conclusion.\\n\\n\r\nThe actual plot of both parts are fairly standard. Nothing really goes out of the norm and everything is quite predictable. But this really doesn't matter. Melodies aims to bring the stories of the characters out to the light. It allows us to empathize with the characters so we can understand exactly what they're going through at all times. Shuuichi's constant anxiety over his impending demise, Young!Himura's and Mizuki's helplessness, Yuuko's contempt - they're all emotions the anime manages to both subtly seep its way into you as well as hammer it right into the heart. I'd say this series is comparable with Clannad; After Story in terms of pure emotional response. The characters frequently go on long diatribes against others where they use repetition to emphasize their points and, in seeking to alienate themselves from the other character they're talking to - as well as us, the audience - they expose themselves and allow us to understand their pain.  For this is an anime about pain- dealing with it, living with it, obtaining the courage to ask others to help in soothing it. \\n\\n\r\nOverall, I'd highly recommend checking out the ef series if you want something more heavy and personal. The unique visual direction displayed in this anime by Onuma Shin is something that I don't believe he has managed to fully recapture following his departure from Shaft. The plot is simple but the execution makes it work incredibly well. Other shows I'd recommend are all VN adaptations - H2O: Footprints in the Sand (but don't watch the last 2 minutes of the last episode), White Album 2, Clannad and Clannad; After Story, and Air. \\n\\n\r\nThanks for reading!  \\n\\n",
            "date": "2019-02-06T12:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 301030,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5543683.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/raisin-kun",
                "username": "raisin-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=301030"
        },
        {
            "content": "So, I gave this series a seven, while the majority gave it a perfect ten. I will explain why.\r\nStory:\r\nThe story is nothing too unique, but not too stereotyped, either. There is quite a bit of drama, which gets turned into over-done melodrama. Not the plot's fault, but the characters', which I'll explain further down.\r\nAnimation:\r\nThe animation was pretty good. Nothing else to say on that.\r\nArt:\r\nNow, this is something that is also over-done. They try too hard to make this show artsy at points, and go too far with it. Repeating questions over and over and having them written over the screen for several minutes is donea few times. I sat and just prayed it would end. They couldn't cut down on the decoration, and it would have made it not so annoying, in my opinion.\\n\\n\r\nSound:\\n\\n\r\nVoices were nice. Songs were nice. Nothing to complain about.\\n\\n\r\nCharacter:\\n\\n\r\nThe characters were well thought out. That isn't the problem I had. It's just when they wrote the characters making bad decisions and suddenly having personality changes just to make it melodramatic that I had a problem with. I'd explain in further detail, but it'd spoil things.\\n\\n\r\nEnjoyment:\\n\\n\r\nI would've given this a higher score if not for all the needless, repetitive, artsy-fartsy stuff, and the bouts of melodrama. If you can ignore those two things, you'll love the series.\\n",
            "date": "2012-08-14T16:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 69769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/387972.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/livingdeadkat",
                "username": "livingdeadkat"
            },
            "url": "https://myanimelist.net/reviews.php?id=69769"
        },
        {
            "content": "*This is an archive from my Anime-Planet account*\r\nCritic's Log - Earthdate: July 31, 2012. Review #16: Ef - A Tale of Melodies\r\nThe Past can be hard to leave behind, because remembering it might be pleasant, but remembering it can also be painful. But the best way to leave it behind is to keep moving forward to the future, do you have memories that you do not want to forget? Anyway, here is Ef - A Tale of Melodies!\r\nEf - A Tale of Melodies tells two stories (like \"Memories\" did) one takes place in the past where Himura Yuu meets a girl named Amamiya Yuuko whoseems to know him, but he doesn't know her. However, he soon remembers that she was a girl that he knew from long ago. Yuuko then tells him something which he never knew. He was her first love since then and her first love hasn't ended yet. The second story takes place in the present (after the events in \"Memories\") Shuuchi Kuze meets the cousin of Aso Renji, Hayama Mizuki and spends a lot of time with her. Unknown to Mizuki, Kuze had contracted an illness and has little time to live. Kuze had decided to break all romantic ties, but things go for the worse when Mizuki tells him that she loves him.\\n\\n\r\nTo be technical, this is a Studio Shaft production (obviously). This is also a sequel to Ef - A Tale of Memories. This is also an anime that had great potential for Studio Shaft but this show almost looks like Memories but with some differences. The animation is almost the same but it's starting to look a lot better than Ef - A Tale of Memories. Melodies is also much darker than Memories. There are a couple of dark moments in Melodies; The 6th episode of Melodies was a bit haunting. Which I wasn't expecting.\\n\\n\r\nI might mention that the story is full of dialogue with some non-violent action. Like Memories, the dialogue rarely stops. Back is the melodrama (which is a bit darker this time). The romance is a bit believable this time. There is a bit of a lot going on and you really have to pay attention to what's going on. This is also a bit less boring than Memories. and I guess Shin Oonuma surprised some people with the tone of this anime than its predecessor on the direction of this anime.\\n\\n\r\nWhen it comes to voice acting, The subtitled version is very good, the dub isn't bad at all. I prefer the subs here because of cultural settings. Christopher Ayres was the ADR director in the first series and the dub was good in the first show and the same applies here.\\n\\n\r\nThe music by Eiichiro Yanagi and Tenmon has a different tone than Memories, which is good because the music fits the tone of Melodies, especially on the 6th episode of Melodies. The opening for Ef- a tale of melodies is really good\\n\\n\r\nThe characters that are shown frequently in Melodies are a bit more interesting than those that were in Memories, but some characters don't really get developed that well. But oh well... The story is Melodies' shortcoming.\\n\\n\r\nThe Visual gimmick that Memories sorta overuses is present, but the usage of each application of these visual gimmicks is tolerable this time.\\n\\n\r\nEf - A Tale of Melodies is available by Sentai Filmworks. The Ef video games never made it in the US and never will be, the Ef manga and light novels have not been licensed in the US as of yet.\\n\\n\r\nWith that said, I really appreciate the dark elements in Ef - a tale of melodies, I like the really haunting visuals but I really don't have much to say about this anime. If you liked Ef - A Tale of Memories, you'll really like Ef- A Tale of Melodies. I cannot guarantee that the effect of Memories will remain in Melodies. There are indeed some flaws present in Melodies, Memories had some flaws too, but that was not a bad anime. Ef - A Tale of Melodies isn't a bad anime either. It isn't a masterpiece by any standard. It is really a good work of art with some flaws.\\n\\n\\n\r\nI give Ef - A Tale of Melodies a 6.8 out of 10, it is DECENT!\\n\\n\r\nFeel free to leave a comment, and can you hear it? The Melody of Truth?",
            "date": "2013-05-01T01:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 95535,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1731413.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FullmetalCowboy",
                "username": "FullmetalCowboy"
            },
            "url": "https://myanimelist.net/reviews.php?id=95535"
        },
        {
            "content": "This anime has a good story and romance (and has some echi scene too), It tells about 2 separated story (but still have a connection).\r\nFirst is a story that has a background in the city in Japan involve Hirono Hiro (he's a manga artist), Kei Shindou (Hirono's Childhood Friend, and she's secretly in love with him, and she's a part of basketball team), and Miyamura Miyako (not diligent girl and met Hirono inadvertently, later she fallin in love with him too).\r\nSecond story is telling about Kei twins sister, named Chihiro Shindou who has a rare disease (she only can keep memory for only 24hr) andRenji Asou (he's a shy boy that met Chihiro in his favorite place), they lived at the city in Australia.\\n\\n\r\nThe setting of the story is in the two cities are very similar although both are in two different countries. That's why I got a bit confused when the first time I watch this anime, and because of that reason, I gave 6 of 10 score for it.\\n\\n\r\nBut, still I recomended this anime for you who seek a good story and romance. So, just watch it!! okay?",
            "date": "2014-11-25T05:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 169871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4205381.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MugenDreamu",
                "username": "MugenDreamu"
            },
            "url": "https://myanimelist.net/reviews.php?id=169871"
        }
    ],
    [
        {
            "content": "A IMP Review of Ef: A Tale of Melodies (Dubbed edition)\r\n(IMP stands for “In My Prospective”, meaning if someone attempts to correct the way i see the show i have no intention of reading any “corrections”)\r\n2nd Season/second half review-\r\nStory:  I’d rate the story an 8/10 because of the way most of the events in the show were handled. It doesn’t get a higher rating because the beginning was confusing and uninteresting and there were smaller story arcs that didn’t need to be a part of the show tomake everything work out. But overall I believe where the show shined was its symbolism and its middle arc. To not give spoilers let’s just say the middle is where truths are revealed, a coward are brought out to the light of day, and art is seen as a second chance to make a choice. \\n\\n\r\nCharacters: I’d rate the characters 9/10. Like I said in my story section there were smaller story arcs that weren’t needed which is why this isn’t 10/10. Ultimately some will say after watching the show that some characters were cringey, a few characters were assholes and so were just plain unneeded or bland but symbolism is where most of the main group shines. Yes they are not all angels with pure hearts ready to join a generic main characters harem. They have flaws, and flaws make them at least a little relatable to those who don’t think they are perfect the way they are. Putting on a brave face or a hateful face, running away from something to save you or to save something else, hating the world or god because life is unfair, these are all things people can relate which give these characters far more meaning then just someone to be “waifu’d or someone to be liked simply because they act the way you think you act.\\n\\n\r\nArt: For the art I would say 7/10. This show came out in 2008 and it does show in its art style. But it doesn’t show in the same way as a show from 2000 would, its art style isn’t a terrible sight to the eyes and the art used in certain scenes really does a good job enhancing the symbolism of each characters story as the show progresses. The art style uses colors one would rarely see in today’s anime shows because it didn’t go for a flashy type of art style, but a dark fore lording art style that really adds to show as a whole. There were a few issues with what they choose to do with the art like minimal backgrounds, reused clips, mouth movements that didn’t match every word but once again, it was from 2008 so I can be let off the hook. \\n\\n\r\nSound: This one is kind of hard to give a rating to because I wasn’t highly paying attention to the sound, but because of that very reason I’ll give it a 7/10. The show didn’t have a lot of standout background music to speak of which is part of sound as a whole so it factors in here, but the opening and sometimes the ending song because it changes somewhat throughout had an nice melody and the lyrics were highly relatable to me, when i feel like I want to find the intro song and download it, it at least earns a few point in my book. The only other noteworthy sound i clearly recall from the show is when a violin player plays his violin and when a 2 girls sing the same song from the intro or and hum it. But they are reused like this so often that it doesn’t add anything to make the sounds of the show stick out so my score won’t change.\\n\\n\r\nEnjoyment: I’m not sure if enjoyed was the word to describe how I felt about this show, it’s more like the show made me think.  When a show makes me think it deserves a 10/10 rating. There are many shows in the field of anime that I “enjoy”, but few that make me think. Other shows that make me think are things like Bojack Horseman, Jessica Jones, and perhaps 1 or 2 anime from time to time; this show didn’t make me contemplate the meaning of life like Bojack did but it make me question some choices I’ve made in life so that plus the ending of the show I can safely say made me enjoy my time watching beside the beginning of it.\\n\\n\r\nOverall: I’m sure the scores don’t look like they add up to this and I would never tell anyone to give this show the same rating like others do about their favorite animes but I’m going to give it the rareish rating of 10/10-Buy it. Why buy it? Because it’s cheap honestly (most of the time). Why 10/10? Because a show that makes me think is rare and there wasn’t really anything to the show that I didn’t hugely like so why not? Let me tell others 2 things, 1: I will not tell you or encourage you to give the same rating, this is just my personal opinion on this show and 2: honestly I’m doing this review and other reviews as a hobby and for my own “anime records” so to speak, so if you see this and don’t like it just ignore it honestly because its more for me then to help others in the long run. \\n",
            "date": "2018-04-02T00:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 276476,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049125.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SniperKnighter",
                "username": "SniperKnighter"
            },
            "url": "https://myanimelist.net/reviews.php?id=276476"
        },
        {
            "content": "Like the first series, I don't see how mystery and romance mix, nope, they don't mix at all.\r\nStory :\r\nThe story was quite surprising in which the characters are switched to different places which makes a different story. Like some minor characters didn't showed up that much gets more air time. But still, I found this quite stressful to watch until I watch this whilst playing game so that I don't feel boring too much. But still, in the end I survived again watching this and thank God they have a good ending. But I didn't really expect a word of advice from all the charactersat the end of the series. I give this a 7 since it's still good despite how stressful it is but having a good ending. I was like \"Eh, why not right?\"\\n\\n\r\nArt, Sound, Character, Enjoyment :\\n\r\nI purposely put all these 4 together since I think it's pretty much the same as the first ef series.\\n\\n\r\nOverall :\\n\r\nIf you guys want to watch this, make sure you are really ready and try to have a strong heart. I don't want to say that this anime is bad, I believe this anime is good, I saw a lot of people rated this anime at least around 8-10. It's just that I'm not a fan of mystery or anything that stressful to watch anime, pretty much the reason why I gave this a 7 in overall",
            "date": "2016-08-10T09:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 226395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5057652.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Azren1995",
                "username": "Azren1995"
            },
            "url": "https://myanimelist.net/reviews.php?id=226395"
        },
        {
            "content": "After watching the two seasons, I can say that this Anime is one of the best Anime in its genre yet extremely underrated. I can understand it being not everyone's cup of tea anyway.\r\nThe story is very complicated, it's hard to explain it. It doesn't make chronological sense which can be really confusing to some. The events are random that have nothing to do with one another, but I still love it. In fact, I find these kind of stories super interesting.\r\nSo to sum it all up: if you like complex and confusing love stories with a huge amount of drama, I highly recommend this,you'll love it.\\n\\n\r\nOver all I'll rate it a 9/10, it was really interesting. I've always preferred dark romance anime and this was really good for its genre.\\n\\n\r\n*this review has been adopted from my twitter account*",
            "date": "2018-01-14T12:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 268559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5616889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Fatimaalja",
                "username": "Fatimaalja"
            },
            "url": "https://myanimelist.net/reviews.php?id=268559"
        },
        {
            "content": "First off I am not one for hate reviews. But I have never wanted to rid of a character's existence before, not even in School Days, until now.\r\nOkay, so this is a sequel to Ef: a tale of memories. Which I found pleasant; sure it was a bit forceful with the emotions at times, but all in all at the end of the emotional roller coaster I felt satisfied. But Ef: a tale of melodies was way too pushy and on top of that had one character in particular who wouldn't just shut his mouth. It's like they want me to feel bad for somearrogant, deprived, indecisive, (I can't think of another word) ass-HOLE. He's constantly whining and talking about how \"everyone is wearing a mask\". Good grief, it's like he's an over dramatic 15 year old girl. Oh wait, he's in his twenties....And because of him being so unfortunate he disregards everyone who cares for him and out of his self loathing somehow manages to steal a poor high school girl's heart. It made me sick. I wished for his death so many times while watching this anime.\\n\\n\r\nOther than that douche and his disgusting tale of \"I want to die, no wait I want to live, please pay attention to me.\" There was another tale in the series that did touch my heart like its prequel. I'm glad I got to witness that story even if it did leave me a tad unfulfilled. However that ignoramus really ruined the entire experience for me. There, hate review done.",
            "date": "2016-03-30T13:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 214839,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2446345.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ckaos_Inkarnate",
                "username": "Ckaos_Inkarnate"
            },
            "url": "https://myanimelist.net/reviews.php?id=214839"
        },
        {
            "content": "Finally got to watch this after catching up on other animes and this one is a good one and a must see.\r\nThe main story in my opinion is mostly renji-kun life, they had other small stories for everyone else, but most of it i believe leans more to renji. Renji always walks down a railroad track which has been broken for a long time, he meets a girl name Chihiro Shindou while he is walking. they start to talk alot and get to know each other, he has been warned not to fall in love with her and if he does, he will have toface what happens afterwards. Renji finds out that chihiro has a memory of a 13 hour life span, she can only remember 13 hours of her life, she always brings a diary with her and writes everything down so when she wakes up in the morning, she knows what she did they day before. Renji falls in love with her despite the fact of her condition and helps her with a dream she always wanted to do but was nearly impossible because of her condition, which is to write a novel. Anything else i say will basically be spoilers but for some reason i believe the main character in the short stories they have in this anime, renji would be the most important one.\\n\\n\r\nThe art in this anime is beautiful. you have your summer Christmas in a different country, then your winter Christmas in japan. Not only that this anime is all about art, the characters in the anime love to draw, one is a manga artist for example, so seeing all the art and pictures they make themselves is very good.\\n\\n\r\nThis is an overall good anime, you'll need to watch this first before watching ef a tale of melodies, so please watch memories first then melodies, but dont forget to bring something to wipe your tears with after watching this anime, this anime is all about love and romance and how far someone will go to be with someone they fell in love with.",
            "date": "2014-10-02T04:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 163259,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4096207.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lendiznick",
                "username": "lendiznick"
            },
            "url": "https://myanimelist.net/reviews.php?id=163259"
        },
        {
            "content": "I have to say i'm not with the mass majority on this one. Everyone who recommended Ef to me said it fantastic and that the second season was better and more emotional. After watching Ef - a tale of memories I got exited and couldn't wait to watch it. But I have to say I don't feel the same about this one. I just felt let down after watching the first season. The first season made me love all the characters and made me feel thing I've never felt before. I even cried but this time around i felt nothing. I have to say Ijust didn't feel it this time around. It was good but after watching the first season I just feel let down.\\n\\n\r\nNow don't get me wrong now it was a good story. Think about this, I felt \"Ef - a tale of melodies\" was like \"The Dark Knight Rises\" its good and perfect it its own ways with miner flaws, and amazing as a stand alone but \"Ef - a tale of memories\" was \"The Dark Night\". Just mind blowing, amazing and makes it hard to live up to and that's how I feel about \"Melodies\" its good but not as good.\\n\\n\r\nIt was kinda confusing to keep up with the story. Having to go back and forth trying to tell the two stories. Yuuko and Yuu story taking place in the past while Mizuki and Shuuichi took place in the present after the events in the first season. There was a balance in stories this time around with both relationships having to deal with their own problems dealing with betrayal and death. A lot of death this time around. It was hard picking my favorite from these two stories because there stories were strong but at the same time they weren't really that good. Unlike in \"Ef - a tale of memories\" which mines was, and I think everyone's else's favorite was Chihiro and Renji. But this time around I'm not really sure which one l like the most. \\n\\n\r\nBut toward the end I felt like I was dragging my feet to watch the rest. I got bored of this anime, when I was around episode 9 or 10 I felt like giving up but I'm not that kinda person so I finished it. I was expecting to cry even more this time around but nope not even one tear. To be honest I was getting kinda annoyed by everything toward the end. But I'm glad the ending was good. There were things about the ending I kinda hated but I wont write it down because of spoilers. If you want to know message me and ill tell you what was wrong with it. \\n\\n\r\nDon't forget to hit that \"Helpful button\" if you found this helpful in any way so others can find this review. Don't be afraid to send me a message if you want to talk more about this anime or had any comments with my review. ^_^\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2013-01-20T23:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 84333,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1653479.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mathex",
                "username": "mathex"
            },
            "url": "https://myanimelist.net/reviews.php?id=84333"
        },
        {
            "content": "I actually found this anime 2 years ago but at that time i wasn't really interested in anime of this genre so i didnt watch past episode 1. When i found it again i had already decided that the most emotional and moving anime would be Clannad and Angel Beats! therefore i didn't expect much. Thinking back i feel like laughing at myself.\r\nBefore i begin my review i have to apologize if my review contains any form of spoilers although i will try to minimize them.\r\nStory: I really liked this anime for its extremely deep and moving storyline. Besides this i also liked how itwas able to swing back and forth from the past to the present and back to the past. Even more than that it seemed as if switching from the past and present times helped to fill up the missing parts. I also liked how this anime shows how tragic incidents can affect people and invokes a lot of thinking on various subjects such as \" is it better to die with your loved ones or live knowing that you left them to die\". Besides that, this anime also shows you a little on how harsh the world can be at times but at the same time it also shows you that there are people who will be there for you even if its just 1.\\n\\n\r\nArt: I really liked the art as it made the whole anime feel so real, as if you were watching the events in the anime happen in reality. I also have to say that the designs were great and the background and other effects were really magnificent.\\n\\n\r\nSound: Here we find a slight flaw in the anime. While i have no complaints with the soundtracks i sort of prefer those in the previous ef series with the exception of the opening - Ebullient Future - which i liked alot. But either way the timing for every sound effects were well done and the music complimented each scene quite well.\\n\\n\r\nCharacter: Ahh the part i was looking forward to typing about the most. I really love the characters here from the naive young Himura and his kind but indirect older self, Kuze who seems like such a nice and easygoing person while harbouring a great burden and so on. The characters all have their own burdens to deal with although eventually they are finally able to resolve them. An interesting fact to point out is that with the exclusion of Akane, Nagi and Akira, the characters are all the same as the 1st season except this time the main characters of the 1st ef series now become supporting characters while supporting characters now become the main characters, with the exception of Emi. \\n\\n\r\nEnjoyment: Hmm truth to be told. You probably wouldn't find yourself absorbed into it until you watched a few episodes. You may even need to rewatch the series to get attached to it. However, once you get pulled in you can't ever get out.  A good tip for those who aren't patient is to watch this anime when you're bored or when you have alot of free time which you have no idea how to waste.\\n\\n\r\nOverall: You would probably need a little patience with this anime but you would definitely love it if you give it a chance and watch every episode to the end. you would definitely find it worth your while.",
            "date": "2012-06-17T08:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 63639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1084709.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MiyatouSeishirou",
                "username": "MiyatouSeishirou"
            },
            "url": "https://myanimelist.net/reviews.php?id=63639"
        },
        {
            "content": "This series is often compared to Clannad, and I can see why. They are both about love, tragedy and little miracles that can happen amongst all that. \r\nBut I have to say, Ef, while a great anime in itself... Falls short. The series is made up of 12 episodes, the first season also 12. But I will talk about Melodies now, though many of the problems in Melodies, Memories also suffers from. \r\nSo the series is made up of 12 episodes. That is fair. Some of my favourite anime only have 12 episodes, and normally I would call that a strength of sorts. With Efit couldn't be further from the truth. Ef focuses on more than one story, jumping from story to story, giving none the screen time to really bloom. It feels like most of the time each couple is given is for little more than furthering the plot, little of which is for the audience to connect with the characters. Making the whole mess feel forced and sometimes quite cold. There are points while watching where something tragic will be revealed or happen, and you will be left staring at the screen knowing this is meant to make you feel something... But instead you feel nothing, because not enough time has been given to really make you feel for them. And the end result is that it feels pushed in your face, out of place or worse it just takes you out of the anime all together. \\n\r\nOf course by the end episode or so the characters have all had just ENOUGH development time that you finally start to feel something more than shock when something happens... But that is just too late by then, the damage has been done, and it can't be repaired.  \\n\\n\r\nEf would have been better as either a longer series, aka more episodes to each season... Or to focus more or soley on one story per season.\\n\\n\r\nEf is still a good anime however... And I recommend it a watch. \\n",
            "date": "2013-09-26T20:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 114373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/386670.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BloodiRose",
                "username": "BloodiRose"
            },
            "url": "https://myanimelist.net/reviews.php?id=114373"
        },
        {
            "content": "I laughed. I smiled. I cried. I rejoiced. I haven't felt like this before since Clannad. \r\nEf - A tale of melodies is the perfect example of what happens you combine masterful artistic visuals to great storytelling. I felt like I was within the story instead of just watching it, that the character's pains were my pains, and their happiness, my happiness. \r\nStory - 9 The story's this good simply because nothing's rushed. Sure, maybe some of the romance between Mizuki and Kuze were a bit quick paced (and that's the only reason why this didn't get a 10!), but my gosh, every event unfoldedat the perfect time, almost like a fairytale. What's more, is the way the series portrays the ties between each character's philosophical perspectives, and the events that occurred to them to cause them to think in such a way. And finally, how each perspective changes, and ultimately, how they triumph over their individual troubles. It's a rewarding experience, watching them from start to finish, and you'll find yourself undoubtedly growing alongside them. This is an anime that will make you question, and think.  \\n\\n\r\nArt & Sound - 10 Art and sound were both wonderful. Melodies like \"A moon filled night\" will definitely be going onto my top list alongside others like \"Tabi no Tochuu\" and \"Palm of a tiny hand\"\\n\\n\r\nCharacter - 9 Although character development was sometimes a bit rushed, given the fact that this was a 12 episode series, and the way that it all came together in the end really made these little hiccups hard to notice in the grand scheme of things. \\n\\n\r\nOverall, Ef - A tale of melodies is one of those rare animes that will leave you awestruck with its brilliant storytelling and its inspiring messages. It's definitely inspired me to new heights, and I bet it'll inspire you too. \\n\\n\r\nIf you haven't watched it yet, don't sleep tonight until you have :)",
            "date": "2012-10-27T21:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 76061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1694939.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Araconan",
                "username": "Araconan"
            },
            "url": "https://myanimelist.net/reviews.php?id=76061"
        },
        {
            "content": "This anime is one of the most spellbinding. I was hooked from the first series and first episode. This series did not disappoint. \r\nAs a follow on from last series  this series focuses on two different romances, a musician and a student and the friends that should have been. \r\nThe art style is amazing but does drop a once in a while, the sound track is fantastic and over all I cried enough to fill a bathtub. This story will take you to hell and back. I had to pause it a few times before I could carry on watching. \r\nYou'll carry on watchingthis because its just so compelling.",
            "date": "2017-01-24T06:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 239012,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5012949.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sailorchibirose",
                "username": "Sailorchibirose"
            },
            "url": "https://myanimelist.net/reviews.php?id=239012"
        },
        {
            "content": "Story- 7\r\nArt- 8\r\nSound- 9\r\nCharacter- 9\r\nEnjoyment- 9\r\n____________\r\nOverall- 9\r\nSince this was only 12 episodes the story didn't really have enough time to develope and the creators had to rush it, but the story was still explained in a quick and understandable way. The story is basically about the main character who has been friends with a girl since childhood who was later on taken way from him and they later on met up again back in high school (story cut short so I don't have to spoil it).\r\nThe art is just as others have mentioned, its like a person's painting coming to life, which is pretty uniquebut wasn't my taste. The characters were well drawn but there were some minor flaws. The background was also drawn good too.\\n\r\nThe sound was pretty good, the opening theme was nice and so was the music they played throughout the show. The violin that was played in this was perfect. When you listen to it you sorta feel as if your in an opera room.\\n\r\nThe characters in this show were actually developed pretty good with the lack of episodes they had. Each of them having their special personality and also their own problems. The characters were one thing that stuck out in this anime.\\n\r\nOverall I dislike short animes that have only 12 episodes but I did really enjoy this one. There was a mixture of emotions in this and it will have it's twists and turns but I do recommend this to people who are looking for Romance and Drama.",
            "date": "2012-10-19T22:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 75361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1479765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CoolBreeze",
                "username": "CoolBreeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=75361"
        },
        {
            "content": "Story: This really is something else than your normal romance / drama series (not in the sense of school days). Of course, if you've seen the first series (tale of memories), you'll already know the gist of whats going to happen. A hefty sum of twists and turns to keep you watching throughout the whole 13 episodes.\r\nArt: Once again, something different (in some aspects). Different style of graphics to make the art in this stunning.\r\nSound: Tenmon. Same music makers as Place Promised in Our Early Days and 5 Centemeters Per Second. Fantastic use of violins and and some brass to make it very smooth andcalm to rough and violent.\\n\\n\r\nCharacter: Very believable. What people say, their reactions, and the space between talks is similar to how reality would be like.\\n\\n\r\nEnjoyment: Great. To me, I enjoyed it very much. Most certainly wouldn't mind watching it again.\\n\\n\r\nOverall: I would have rated it 10, but math compels me to put 9.",
            "date": "2009-01-06T17:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 11180,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101853.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pirates01",
                "username": "pirates01"
            },
            "url": "https://myanimelist.net/reviews.php?id=11180"
        },
        {
            "content": "PSA: There are two versions of episode 10, they are the same except one has color and other is sepia. I recommend watching the colored version. \r\nI felt second season stayed true to the themes and ideas from first season, while expanding upon them and examining some new ones. Plot logic around the time of ending could potentially be annoying, but I figured it's something that can be taken symbolically, and in that case it works as an artistic expression. There is some non chronological storytelling, and even though it's confusing, it's confusing in a cool Inception kinda way. \r\nThe emotional impact even goes beyondthe first season, though it's a bit different, as expected. The writing, at least to me, seems to be so good that until the very end I couldn't really predict in which way the story would go. It's one of my favourite things about this title, other being those couple of particularly artistic scenes, as well as visuals and music and their direction. Did I just say that pretty much everything was my favourite thing about this? Yeah, I guess that's one way of putting it.",
            "date": "2015-07-11T12:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 193082,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2424123.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Eagleshadow",
                "username": "Eagleshadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=193082"
        }
    ]
]