[
    [
        {
            "content": "No, it’s not what you think. Comet Lucifer is hardly about devil or angels or in fact anything that pertains to religious themes. And the “Comet” part isn’t some catastrophic event like a comet hitting the Earth to set up it look like some apocalyptic world. Taken for granted, I’d see this as a show as a hybrid fusion of sci-fi, mecha, and drama. However, Comet Lucifer doesn’t exactly hit all the right angles with its genres. In fact, its storytelling is barely tolerable and in general, a disappointment.\r\nAs an original show, Comet Lucifer essentially had a lot of potential. The first few episodes introducesus to a fantasy world (Gift) where sci-fi elements are evident. From giant robots to animal hybrids, there’s an immense amount of curiosity to see where the story will go. At the same time, Comet Lucifer has the feel of a Eureka Seven-esque type of anime. It’s simple really. We have a young man named Sogo who happens to encounter a mysterious girl named Felia. She also has a mysterious power that links her to the power of a giant robot. Sound familiar? The sci-fi adventure begins there as Sougo, his friend Kaon, and Felia discovers dark secrets in their world.\\n\\n\r\nThe series composes a small cast of characters although their roles are all important. Sogo is the easy-going type who can easily make friends with just about anyone. His loyalty is also evident throughout the series as he puts others’ lives above his own. Unfortunately, the guy is really dense and a lot of his actions are questionable at times. Characterization regarding Sogo is generally mild as we barely see his background story. Instead, the show focuses more about his actions in the present alongside Kaon. And that brings up the second point. Kaon can be interpreted as the ‘girl next door’ type. No, I’m not talking about the girl who flashes their bodies around but rather as someone that continuously expresses interest in the main guy. However, Sougo barely notices her messages. In essence, Kaon is someone fans may feel sorry for especially after Felia enters the duo’s daily life. As the most mysterious character in the show, Felia is hard to accept. She has a childish personality although she matures throughout the series, literally. Her curiosity and mere presence leads her into dangerous circumstances. This is because there are others who are hunting her for their own purpose. As stereotypical as it sounds, the show does make a valid point about this plot direction. More than half of the show involves a mysterious group who are trying to capture Felia that often leads up to mecha conflicts, kidnappings, and threats of death. On the other hand, there are also some episodes that feels more like a slice of life and even a bit of coming age. While the main plot seems to focus on the adventures of the main trio, there are also some focus with Gift and its world fiction aspects.\\n\\n\r\nFor a series about sci-fi, it’s also expected that we see characteristics that are out of the normalcy. Thankfully, Comet Lucifer knows its purpose with some of its mechanics like the mining town of Garden Indigo. The introduction of rare crystals is also an element that sparks interest. And at the same time, Felia’s little friend Mo Ritika Tzetzes Ura (seriously, how do you pronounce that?) looks hardly normal. There’s a mysterious connection that Felia also shares with the cool looking mecha in the series. We don’t find out much about them later on so the story leans to test the patience of the audience. While all of this is going on, there’s also a nice change of landscapes from time to time. As a series with sci-fi, it’s definitely on the right track initially. The occasional comedy can be a hit or miss though depending on your perspective.\\n\\n\r\nHowever, when it comes down to it, the characters holds the series back. Most if not all the characters in the show are generic and hardly distinguishable with perhaps the exception of Felia. Sougo is the nice guy type, Kaon’s romantic interest in her friend Sougo is often met with intentional arrogance, and Roman’s crush towards Kaon is returned with emptiness. If romance was really also sub-plot, then the show failed miserably. Thankfully, that’s not the case but the characters themselves aren’t decently written. The Gift government and their troops are also pretty stereotypical. For a quick run-down the main roster, we have Gus, a guy who just seems to enjoy fighting for the sake of it. There’s also Pack, a young fighter with decent combat abilities but a hot-blooded personality to create trouble. There’s even a guy who is chasing down Felia with a rather unhealthy and perverse obsession. Really now? How can we ever like some of these bad guys for their motivations in the show? They are pretty much like puppets doing the devil’s work. The only good parts can be accepted with occasional characterization such as with Gus’ past life.  Otherwise, Comet Lucifer’s characters are like fruit baskets without the fruit. Storytelling gets more and more predictable and pulls out generic ideas from the old book. There’s hardly anything later on that will leave fans good memories about the series.\\n\\n\r\nEven though 8-bit is the studio, Comet Lucifer is a good looking show with its visuals. The world of Gift is colorful and adds curiosity each episode with elements it introduces. The towns, although looks normal like a modern world, are equipped with high-tech gear. The flashy space looking vehicles and scooters can also be fun to look at as we see Sougo utilizes them in a cool fashion. Speaking of cool, the show surprisingly carries over a good amount of action. Each time we see mecha clashes, it’s presented with crisp choreography. The smooth movement and fast paced sequences is legitimately nice to follow. Even their designs looks stylish with each mecha having its own modifications, weaponry, or model. On the other hand, character designs looks typically generic. And although the show lacks fan service, it hardly makes it up when most of its main cast looks like kids that is hard grab attention. \\n\\n\r\nIn terms of soundtrack, the show has its presence but that’s about it. It balances between light and tense depending on the circumstance and responds to it. Both the OP and ED theme song has a colorful idea of presenting itself but hardly else noticeable. And voice mannerism isn’t overly impressive either. Felia’s voice can be a mixed bag as she expresses the childish innocence with a lack of personality. There’s not much to worry about it though as she does mature later on. But in overall terms, don’t expect something to be wowed by for its soundtrack craftsmanship.\\n\\n\r\nIf you came looking for a sci-fi adventure, then there you have it. But if a strong story about a memorable cast of characters is what you have in mind, then it’s better to try elsewhere. Comet Lucifer doesn’t capitalize on the main characters’ roles or motivations in the story. As they face obstacles, their purpose is lacking and often makes us question what if they are heading into no man’s land. While I do like the way this show runs with its world fiction elements, it doesn’t ultimately make it up for its storytelling or weak character cast. And that’s quite a shame, really.\\n",
            "date": "2015-12-20T05:57:00+00:00",
            "helpful_count": 103,
            "mal_id": 206106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=206106"
        },
        {
            "content": "Comet Lucifer, at the time of this review still an ongoing anime with six of its twelve episodes previously aired, is in one word, disappointing.  And unfortunately, it is disappointing on nearly every level of critique.  \r\nTo begin, Comet Lucifer starts with a somewhat interesting, even if cliché, set-up to its plot.  Our MC, Sogo, travels into a mine in search of a rare crystal that his mother once mentioned and stumbles upon one of particular interest. Thus he meets Felia, the girl who the anime has clearly set up as the main love interest.  And there you have a basicsummary. So we’ve got an alright but cliché boy-meets-mysterious-girl scenario, a childhood friend who is not-so-secretly interested in the MC, and the makings of what could be an interesting plot to come. An additional note of praise for the rest of the series, the Mechs themselves are interesting and the fights (mostly) well done.\\n\\n\r\nSo where does it go so wrong?\\n\\n\r\nAt the simplest level, Comet Lucifer fails because, in essence, it hasn’t really developed anything in regards to its characters or plot and is content to sit around shoving low-context mech battles in between sub-mediocre Slice of Life scenes.  The tonal whiplash one receives while attempting to watch Comet Lucifer is enough to cause major fractures in all seven of your neck’s vertebrae.  \\n\\n\r\nLikewise, the characters are a massive failing point for the misguided Comet Lucifer.  Mainly in the sense that their actions don’t make a whole lot of sense.  From actively parading around the mysterious mystery girl with telekinetic powers around town (despite the fact that there are clearly people trying to track her down) to not trying to figure out why she has any powers at all (or pressing for any sort of backstory), MC and his childhood friend(zone) companion simply don’t cut it as rational actors. Additionally, the characters don’t really have much personality (other than basic tropes and stereotypes) so as a result watching them is dreadfully boring.  \\n\\n\r\nUnfortunately, the character actions and personalities don’t get any better as the episode count increases.  This itself magnifies the previous problem of the Slice of Life scenes; with characters being an essential ingredient to a good Slice of Life, the lack of any character building hurts Comet Lucifer in multiple aspects. These scenes only serve as a boring intermission between the passable mech scenes, which unfortunately are too few and far between to make up for the rest of Comet Lucifer’s failings.\\n\\n\r\nSo what can we conclude about Comet Lucifer thus far? Well, it is bad, and not worth the watch. Truly, Comet Lucifer lives up to its name, for it may very well be the spawn of the Dark Lord, sent upon anime viewers to drive us to tears of boredom and torture them with false assurances of promise.\\n\\n\r\nDo yourself a favor, dear reader. Don’t waste your time on Comet Lucifer.  \\n",
            "date": "2015-11-09T09:34:00+00:00",
            "helpful_count": 60,
            "mal_id": 203052,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Garpachi",
                "username": "Garpachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=203052"
        },
        {
            "content": "What would happen if I told you, a series that had a lot of potential to become one of the few hidden gems turned out to be one of those shows that wasted it's potential with a big fart bomb where it spouts out \"Fuck You and the Audience\"? Yeah, that's pretty much Comet Lucifer in a nutshell. A series that could have turned into something rather decent or enjoyable despite the flaws it had through the episodes, came out with something so insulting that it just pisses the audience and just stabs them like a knife. That's how most people felt in a wayif I think about it in my perspective. \\n\\n\r\nOne thing that the show does completely wrong and it would break the show as a whole. In fact I wouldn't mind this issue but the problem with the show is that it built up so much, that one thing ruined the entirety of the show from becoming something rather decent or something passable into a big train wreck worse than Chaos Dragon. Which if you have seen that show, I think either you won't have the idea of how it's like but you would have an idea the show is bad, or you know and would avoid it like the plague it can be.\\n\\n\r\nBefore I start with my review I will give a fair warning towards the anime review. I will probably spoil some aspects of the show and that includes the ending (maybe) of the show. As well that each person has a different opinion so if you disagree with my opinion it's perfectly fine, each one has a different opinion and if you enjoyed the show then that's considered fine by me. Just be warned this review will be pointing out the issues of the show.\\n\\n\r\nWithout further, let's go into the review of Comet Lucifer.\\n\\n\r\nStory:\\n\\n\r\nThe synopsis explains itself so pretty much in a short sentence, our main characters or group would be going on an adventure after Sougo finding the girl known as Felia in search for the secrets of the world (based upon the story for the first couple of episodes)\\n\\n\r\nNow one thing the show has done good is a few minor things and that's actually something coming from a show that has a very low score.\\n\\n\r\nFor one thing the show had a nice buildup and foreshadow which would have been in the second half of the series, which despite the issues the show had it was of course interesting enough for a worthwhile and see if it’s going to go towards an acceptable anime despite the cons it had.\\n\\n\r\nBut that’s pretty much the pros of the story.\\n\\n\r\nAbout the cons? Oh boy, how much I would have to say about the cons on the series and I will say this will not be pretty for the story department. So fair warning, this will not be a pretty review for this department.\\n\\n\r\nOne thing that Comet Lucifer does wrong, despite the plot being original and having a lot going forward, it's not executed properly at all. Basically because the whole cliche moments are taking away what the show could have become. And if it did had cliches at least make it miniscule so at least that would be considered as passable. But no, they keep spewing more and more and it's just not working for the show. It's just making it look like a child's cartoon series and it's not even working for the plot at all. It's just making it look more cringey as the episodes passed by until some episodes I stated that build up something.\\n\\n\r\nAnother thing the show had in the issue is the Slice of Life aspect. Literally if there is something fishy here is that the show has the mecha genre, but it's more of a Slice of Life show. And even if it had Slice of Life at least add something to the table, but unfortunately the show doesn't add something to the table along with that aspect and it just makes it even unbareable to watch after said episodes. Which this also causes the show to fall because more Slice of Life and less mecha doesn't fit right for this show especially with it's execution. \\n\\n\r\nThe romance subplot is another issue with the show because including with the final episode, it just goes as forced. The relationship between Sougo and Felia does not work at all in any way and the relationship between them does not fully develop and it just feels completely jarring and it doesn't in cooperate the main plot of the show THAT much. It just makes it very retarded also. Including the final episode and this is where I'm going to spoil the show, Kaon gets married with Roman. \\n\\n\r\nOkay stop right there. KAON NEVER HAD LOVED ROMAN! She had feelings for Sougo, so why in the fuck at the final episode we get this? Them getting married and having kids. That seems just as worse as any type of romance I have seen. It just makes the show itself look as stupid as ever. It just makes you look like a dumbass at the end. \\n\\n\r\nThe explanations about Felia are very poor and at the same time very few things would been taken out, but not to the point of making the show understandable enough about her character and why would these people capture her. It's just ridiculous.\\n\\n\r\nThe adventure aspect doesn't work either because they're not putting any purpose to the main plot also, it just makes it look like \"HEY KIDS LET'S GO ON A FUN RIDE TO FIND THE SECRETS OF FELIA!\" Is this Dora the Explorer 2.0? Fuck no. You're telling me that and I would show this to my siblings but I ain't an idiot.\\n\\n\r\nAnd finally the final episode. This is where I said in the prologue \"a big fart bomb full of fuck you to the audience\". Basically, nothing makes sense to the series and at the same time the ending just fucks off the audience with what I stated about the romance subplot, and that was in the finale, not to mention Felia just disappears and then Sougo turned into a fucking balloon, because that's how I personally perceived in the series. He turned into a big party balloon monster. Which was bad, and made no fucking sense. \\n\\n\r\nThis is one of those endings where you basically go and ask about life itself in a nutshell, and which is why I said the show has a lot of issues and it's pretty inconsistent, cliche as fuck, underdeveloped and also, a dumb as fuck ending which leaves just a big label as a dumbass. \\n\\n\r\nIn the end, the only things I can give the score for the show or the pros is only the build up and foreshadowing the show did, other than that, the story writing is confusing, cliche, not well done, everything was done poorly, the romance was forced, and the ending was shit.\\n\\n\r\nCharacters:\\n\\n\r\nAnother thing that's probably the second bad component of the show is the character department. Simply put the characters like reading the whole Encyclopedia. Yeah, that's how boring they are. Not only that they are boring, but they are so underdeveloped that it makes me feel like this show was making a fun of everyone.\\n\\n\r\nAll of them are just bland and not that very interesting at all except for one of the character who's not the main ones. But getting straight into the point I guess we should describe the characters I guess.\\n\\n\r\nSougo is your stereotypical protagonist that has no type of personality. He's just as uninteresting as an empty headed brain, or a shell. He's just there for the sake of being there and it's just piss poor to see it, not to mention he doesn't really develop at all.\\n\\n\r\nFelia also known as the main female protagonist, is nothing more than a cutesy moe character. Reasons being would be that her character isn't fleshed out and her development was poor as well, not to mention that the fact that we didn't found much info about her and why these people would go after her in the first place, and even if they did explained it doesn't fully get to understand her more. It's just ridiculous.\\n\\n\r\nThen we have our main compañeros of this trope of friends Kaon, Roman and Otto, who simply are bland as clay and paper mashed together and it hurts badly to say that. They're just completely unnecesary to even have them in the first place, not to mention that BY THE END OF THE SHOW which I stated about the romance subplot being completely forced it makes the show just as retarded as it should be.\\n\\n\r\nAll of these main characters with the exception of one are not fleshed out at all and not really characterized, they are as bland as my chocolate cake that I am eating during the time I'm writing this review. They're just bland as hell and the fact that also their motivations are just thrown there like rocks.\\n\\n\r\nThe ONLY character I would care about is Moura, which I personally liked the little guy and at least that character was more likeable than any of the cast, but that's not an accomplishment.\\n\\n\r\nOverall the characters are one of the second worst component of the show and that's saying something.\\n\\n\r\nArt/Animation:\\n\\n\r\nI will say on the positive side the production quality of the show isn't really that bad. The art style/visuals of the show seems rather moe and cute with standard backgrounds but that looks at least decently done, as for the color quality it's not really bad, but not great. It's more like standard to say the least. \\n\\n\r\nThe Mecha designs actually are very nice looking, but when it comes to the fights I guess the mechas are very inconsistent considering having CGI that just depends on how they do it. Other than that I think it's mediocre.\\n\\n\r\nCharacter designs look very nice although a few are very generic and not one of the most well looking ones to say the least.\\n\\n\r\nAnd the 2D animation looks very decent to say the least, not really a bad case to be honest.\\n\\n\r\nMusic/Sound/Voice Acting: \\n\\n\r\nNow the music department isn't really one of the most good composed ones in this season, I think it's pretty mediocre. Song is forgettable but the soundtrack in itself sometimes fits with the scenarios and at times it just doesn't to say the least.\\n\\n\r\nSound department in a way is pretty meh compared to other shows that have the sound department approach. It wasn't something Kaboom and Blam but it's not something like I would go and hold my ears like my mom's shitty singing.\\n\\n\r\nOpening for the song is composed by Fhana (she sang the OPs such as Boku wa Minna Kawaisou and Fate/Kaleid OP3) and the show is of course jolly and happy song, which is really nice and wonderful to hear.\\n\\n\r\nAs for the Ending song... I think it's not one of my favorites. Sure it's not like I would call it shit however the song doesn't go towards my taste in the end of the day.\\n\\n\r\nFor the voice acting I would go and say... it's of course stale, just stale but at the same time a few performances for me were done pretty decently despite the voice acting not standing out as I thought.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nI would personally not deny that I of course enjoyed the show in some areas, but on the other hand it's pretty mediocre to say because at the same time the moments of the show were just untolerable. It's really something. I enjoyed the artstyle and some of the soundtracks, and the Opening, other than that in the end the show went to a train wreck that would kill every body in a second.\\n\\n\r\nOverview:\\n\\n\r\nComet Lucifer is the prime example of trying too much that it epically fails on so many levels, that it's just so cringey that it also makes the show too childish to watch.\\n\\n\r\nThe show doesn't work as a mecha because it doesn't execute them properly.\\n\\n\r\nThe show doesn't work as a romance because it was forced that it looks completely stupid\\n\\n\r\nThe show doesn't work as an adventure because those moments are not really adding much as much to the main plot\\n\\n\r\nThe show doesn't work as a Slice of Life because the way they're doing the aspect is really cliche and it doesn't add anything to the plot.\\n\\n\r\nThe show executes the plot poorly that in the end leaves into dissatisfaction.\\n\\n\r\nThe ending of the show is really shit and it just breaks the show in it's entirety of what it build up (which was minor).\\n\\n\r\nIf anything, Comet Lucifer only had a few redeeming qualities that saved the show from being a 2/10, at the very least. In the end, the show is one of these that wasted what it could have been decent.\\n\\n\r\nWould I recommend it? No I wouldn't. In fact, go and skip this one in my eyes, unless you want to see it just for the entertainment. Just... wasted potential.",
            "date": "2015-12-21T12:15:00+00:00",
            "helpful_count": 37,
            "mal_id": 206305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=206305"
        },
        {
            "content": "I don't normally write reviews, but I couldn't resist doing one after watching comet lucifer. lets get into it.\r\nStory: Honestly, I barely even know what the story is. Here is my attempt at explaining it: his boy, Sogo, finds this girl named Felia(and its never really thoroughly explained how... she just kinda comes out of this gem) and takes her in. For some reason (also never really explained) the government wants to capture Felia. Sogo goes on adventures trying to protect Felia and help Felia adjust to this new world. \r\ni have quite a few problems with the story of this show. First of all,I didn't even know WHY all these people were trying to capture this girl until the 10th or 11th episode, and even that didn't really explain why people were trying to capture her earlier. all i can assume is it was because of Felia's magical powers. But then again, I couldn't even really figure out her powers, because those were never really explained either. so basically, it was a bunch of fighting, and I had no idea what the point of it was.\\n\\n\r\nSecondly, I felt like the story kept trying to switch genres, and I felt like none of them were done well. For the first 5 episodes, it felt like it was trying to be a slice of life for the first 10 minutes of the episode. But it wasn't good slice of life. Later there was some romance (very cliche romance). there was even a hint of ecchi in one of the episodes. it was all over the place.\\n\\n\r\ncharacters: honestly, i disliked most of them.\\n\\n\r\nSogo: the generic \"i must save everyone\" guy. He didn't have much of a personality outside of being self-righteous. Not a horrendous character, but just boring.\\n\\n\r\nFelia: annoying. She was the clueless character who has magical powers but never seems to use them for anything very important. Her voice was also super high pitched which was super duper annoying.\\n\\n\r\nKaon: the girl who realizes she likes the MC after the MC is chasing someone else. she didn't didn't even really have a personality.\\n\\n\r\nOther characters: the creepy pedophile dude whos name I can't remember, Do Mon who was the guy who turned into a badass later but he was too much of a side character, the final bad guy who was there at the end for like and episode and a half, and who wasn't very interesting, and some other generic, lame people.\\n\\n\r\nAlso, there was little to no character development.\\n\\n\r\nSound: there were a few good soundtracks. The opening wasn't too bad either.\\n\\n\r\nArt and animation: it was generally pretty bright. I thought some of the character designs were nice, while others were sorta lame (thinking of you Sogo). Animation was decent. better than the other parts of the show.\\n\\n\r\nFinal thoughts: it was bad. I had to force myself through it and nothing was well explained. Characters were pretty bad. I forgot to mention Moura who would randomly yell JAMON!!!! every 3 seconds which was annoying as hell. I only kept watching it because it was laughably bad, and i wanted to say I had lived through it. You probably shouldn't waste your time with this show.\\n",
            "date": "2015-12-20T15:47:00+00:00",
            "helpful_count": 32,
            "mal_id": 206182,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4609409.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/snapeftw",
                "username": "snapeftw"
            },
            "url": "https://myanimelist.net/reviews.php?id=206182"
        },
        {
            "content": "Comet lucifer is a Mecha/slice of llife/Romance/Fantasy anime. You probably could cram in a few more genre's. At only 12 episodes, this obviously results in problems.\r\nstory: 4/10 \r\nwriters essentially said \"let's make it up as we go along.\" That pretty much sums it up. Then they noticed it was almost over and crammed in an ending. And added the final villain because the show kept hinting but never showed one. Who started getting development halfway through the last episode.\r\nArt 8/10 Unique and pretty good. \r\nSound 7/10 Decent but not very memorable. It was just \"there\".\r\nCharacter 4/10 very cliche and forgettable. Mostly consistent though.\r\n6/10 overall\r\n watchable.Art was best thing about this.",
            "date": "2015-12-20T18:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 206204,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3621113.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/citizen169",
                "username": "citizen169"
            },
            "url": "https://myanimelist.net/reviews.php?id=206204"
        },
        {
            "content": "THIS REVIEW CONTAINS MINOR SPOILERS.\r\nThis is my first review, mostly because this show was awful enough to warrant it.  I thought about dropping it a few times, but I decided it would be best to just push on through to the end.  Man was that a bad idea.\r\n[b]Story[/b]\r\nThe main reason I watch anime is for the story.  Tell me a good story and I'll love you and probably buy some merch.  This story was rushed, didn't flush out ANY real details (because it was rushed), and by the end you were scratching your head wondering what the hell you just watched.They left so many loose ends you would think you were trying to brush Felia's hair. (note: I don't understand how women's hair work, I was just trying to make a dumb comparison)\\n\\n\r\n[b]Art[/b]\\n\r\nHey, it looked pretty.  I'll give it that.  But the random mecha?  Seems kind of forced to me.\\n\\n\r\n[b]Sound[/b]\\n\r\nWell it wasn't awful enough for me to notice.\\n\\n\r\n[b]Character[/b]\\n\r\nLiterally only one character got any real tangible development and that was one of the side characters.  You got random backstory for a few mostly background characters, but the others were basically left as useless fodder.  The main characters (Sogo & Felia) were as dull as they come.\\n\\n\r\n[b]Overall[/b]\\n\r\nThis season was full of trash and this one was a prime example of it.  I feel like a masochist for watching it all the way to the end.  Fingers crossed next season is better.\\n\\n\r\nMINOR SPOILER: this is thinly veiled eco-BS.  You'll see it very clearly in the last episode and that's what dropped my score for this show from 5-6 to 3.  If you're going to push an agenda, don't shove it in my face like this.",
            "date": "2015-12-20T16:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 206186,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287906.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lumilias",
                "username": "Lumilias"
            },
            "url": "https://myanimelist.net/reviews.php?id=206186"
        },
        {
            "content": "\"I am Mora, I will never explain anything and will go robot and back at random moments. And lose all the time.\"\r\n\"I am psycho killer, I will kill room full of people, but then imprison one guy in a room with open ventilation shaft. And then go into robot to kill this guy with giant knife.\"\r\n\"I am military guy. I want to fight robot. I will hire psycho killer and pathetic hacker and kidnap a girl. And jump into robot asap.\"\r\n\"I am Sougo. I do not care who Felia is. I never question Mora. I never care why my hand lights up when he becomesrobot. I will run and cry 'Felia, Felia', even if they have automatic gun shooting at me.\"\\n\r\n\"I am Felia. I will cry 'Sougo, Sougo' and emit purple light.\"\\n\r\n\"I am Typhoon. I will rain a bit. Then snow a bit. Thus prevent ultra high tech aircraft from landing. Then disappear.\"\\n\r\n\"I am mysterious ruling organization of astrologers. I will appear at random moments to make you feel this show have a plot.\"\\n\\n\r\nComet Lucifer is one of those shows that wasted great potential by having terrible writing.  My first impressions on the show were very exciting; I felt like with the crossover between childish fantasy and sci-fi, there might be plot elements that, you know, actually immerse you into the show.  However, there are so many holes in the writing that I hardly want to call it a \"plot\".  I find myself constantly being pulled out of the story.  The following examples contain spoilers, but really they're not important spoilers because the plot was already undercooked.  \\n\\n\r\nSo, we already know that this show is basically about a guy named Sougo who likes to collect crystals, and one day when down in the mines, after falling to near-certain death, finds this child, Felia, and a robot named Mora along with a crystal which is under-explained like almost everything in this series.  Actually, Mora is a sort of rock-like thing that talks and transforms into a robot.  It was kind of cool having a mysterious aspect about him and I could have accepted it if later on, the writers wrote in some important themes regarding said robot.  They only kinda did.  Anyways, Felia is like, the embodiment of the Earth, and theyre now on an adventure to find the Altar of the Abyss.\\n\r\nFelia, at this stage, is just a child.  She's cute, but absolutely useless.  Her only vocabulary is \"Sougo\" and she floats and emits purple light.  It would seem like she has a connection to Sougo's crystal, which has a connection to Mora but I can't really say.  In their \"adventure\", so much stupid shit happens that it's as if the writers were just Creative Writing students from your local primary school.  \\n\\n\r\nFor example, these bad guys who are after Felia, offering no explanation as to why they want her instead of the crystal, which apparently can replace the entire world's energy source.  No mention of getting the crystal comes from them, by the way, they just want Felia.  Of these bad guys, we have a dude who is crazily infatuated with Felia, a young psycho with decent combat skills, and a veteran soldier-type guy, and thats really all you get to know about them.  The veteran-type gets a few flashbacks to his previous life and you learn things about him that don't ever end up really tying to the story.  Anyways, crazy infatuated bad guy hacks into the power grid and sends robots after Sougo and Felia.  He starts shooting at Felia and Sougo whirls through bullets, without Mora, to save her, as he does NUMEROUS TIMES LATER.  In another episode, young psycho captures Sougo, and though he had no problem killing many people before, he just locks Sougo in a room with an open ventilation shaft which Sougo doesn't find or crawl out of until he's been in there for a very long time.  He gets the shit beat out of him and immediately after just opens up the ventilation shaft, and somehow finds Mora in there.  I guess he tracked the crystal, which is still in Sougo's pocket.  He crawls through, gets out, and again starts running through bullet showers screaming \"FELIA! FELIA!\" and somehow makes it... Later on, Felia uses some magic to save herself and Sougo from falling to their deaths, and she matures.  She grew about a foot and expanded her vocabulary beyond \"SOUGO!\"\\n\\n\r\nIf you haven't even started this series (please don't), you might have no idea how quickly Felia's use of the word \"Sougo\" gets old.  I counted 39 times before I decided to stop, in one episode alone.  However, because she matured, she became more bearable, and she actually is pretty cute.  From that point, I thought they could be foreshadowing a sad ending, so I continued watching.  Later on, I would experience dumb shit like.... like when they stopped by a town where a wedding was going on, somehow becoming involved as flowerboy/flowergirl (Sougo/Felia, making Kaon jealous... Oh did I mention that this girl Kaon has been tagging with them too?).  Anyways, in the end, theyre raided by the bad guys, and after they have to fight Mora and another robot belonging to an insignificant character, the villagers start throwing pebbles at them and theyre all like \"FALL BACK! RETREAT!\"  That was jaw-droppingly stupid, but I'm dead serious.  Then more stupid shit like when one guy, Do Mon, is picking out food to eat and he's like \"Oh, this looks like a [so and so] fruit!  It might not be poisonous if i cook it,\" then proceeds to take a head-sized piece of it and chop it and serve it.  Then there's also the time when Felia, Sougo, and Mora break off from the group to go alone to the Altar of the Abyss, knowing there will be soldiers crawling around everywhere, leaving the group including Roman and his battle-grade mecha behind.  Another fucking Mecha would probably be very useful, yknow?  At this point in the series, which is like 8 episodes in, Sougo still doesn't know how to use Mora.\\n\\n\r\nAs far as the characters go, I went through most of this review without mentioning Kaon, Roman, his brother I don't care to know the name of who has been around this whole time, and Do Mon.  Kaon is a \"girl next door\" type to Sougo, and has obvious feelings for him, but is so generic about it.  She pretends, embarrassingly, not to like him, then wonders why Sougo is getting so involved with Felia.  She has an arranged marriage with Roman, a flashy dude and the only character who is a little interesting.  Do Mon is Sougo's father figure, who has to put up with Felia when Sougo brings her in, and she does that god awful dancing vegetables thing.  \\n\\n\r\nBy the way, some of you might have heard of the dancing vegetables.  Yes, the show spent a few full minutes on having Felia make vegetables float around and dance in the air.\\n\\n\r\nSo, please, don't be like me watching the whole series.  What is there to gain from it? +1 on your list?",
            "date": "2015-12-26T01:18:00+00:00",
            "helpful_count": 9,
            "mal_id": 206823,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2899499.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/resinweber",
                "username": "resinweber"
            },
            "url": "https://myanimelist.net/reviews.php?id=206823"
        },
        {
            "content": "You know one anime myth that really needs to die in a ditch? Original shows can always be counted on to be better than adaptations. How in god's name does that make any sense in any sort of capacity? First off, you're basically saying that every manga, novel, visual novel, and light novel out there is shit with that statement, and whilst I definitely agree that finding something good in the latter two categories is about as hard as finding a good Crash Bandicoot game after he left Naughty Dog, any hack writer wanting to create an original work of art can make the samemistakes they did - especially when they're visual novel writers themselves. Second, you don't honestly believe that Ghost Hound, Galilei Donna, or Yatterman Night are good shows, right? Seriously, let me look at your favorites list, and I'd better not see those shows on there.\\n\\n\r\nOkay, that's a bit of a harsh introduction, but I seriously have no idea why anyone ever thought Comet Lucifer had potential when it showed up in the first place. Just because it borrows many elements from successful adventure anime like Eureka Seven and Castle in the Sky? How is that a positive if it doesn't execute any of said elements with any sort of flair at all, particularly with regards to its horrible characterization? You remember in the first episode of E7 when we first see Renton, he's established as a kid who hates his life due to his father's legacy giving him unwanted attention along with his grandfather putting down his dreams? When we're introduced to our main character, Sogo, we literally learn nothing about him besides the fact that he collects rocks. He had no dreams. He had no troubles. How am I supposed to believe he can carry a show if you don't give me anything interesting about the dude that's non-cosmetic?\\n\\n\r\nWhat you don't do in an attempt to make us believe he's leading man material is to drop a magical girlfriend in his lap, who sweeps the awards for \"worst anime lead female\" in every category imaginable. Most Irritating. Most Convenient Plot Device. A bunch of other categories that I won't name because doing so will cause me to projectile vomit on the screen I'm reading whilst typing this. The show doesn't even give us a good reason for why she's the catalyst for Sogo's journey to exist in the first place. She has telekinetic powers and a magical mustached pet that can turn into a mecha or a scantily clad female depending on what the writers want to show off, but Comet Lucifer doesn't do a good job of explaining why the bad guys want her abilities considering it takes place in a fantasy world where robots and powers are treated about as normally as a Hispanic window cleaner. So if we don't know why the bad guys are after the good guys and we don't care about the good guys on account of them not having any story or interesting character flaws, then who is supposed to anchor me in regards to what's going on?\\n\\n\r\nComet Lucifer is hard to really criticize properly because it's just bad in all the most basic ways. It's a textbook definition of a \"lacking\" product - full of cliches and never pushing them to anything it can call its own, like it was written by someone who's a fan of adventure anime but didn't get what made them good. The mecha fights are as fun to watch as an action scene in a Jon Favreau movie, and the journey as a whole is just not very interesting. It takes an unusually long time for the characters to even leave their hometown to begin with, and said journey itself is padded with so many inane slice-of-life scenes that don't add to the story in any significant manner when they should be spent on giving me a reason to care about the journey. The bad guys don't even seem to be doing all that much evil when they're not threatening our heroes to begin with. Not once did I ever see them do something evil that didn't involve trying to capture Felia, and they don't even hurt innocent people or cause significant collateral damage in the process. For all we know, maybe they're the police and Felia is secretly a wanted criminal on accounts of mass murder and being criminally mundane.\\n\\n\r\nAnd whenever something resembling personal stakes does occur, it always happens to the adult characters who don't have much screen time and whose story is mostly just told to us whilst being completely nonsensical in the process. For example, there's this old man named Do Mon who failed to protect Sogo's mother during his time as a soldier, forcing him to take Sogo in whilst the kid cursed his existence for years due to said failure. Fair enough, although the fact that Sogo forgave him by the time the series started takes away some of the impact of that scene, but then there's this idiot soldier named Gus who wants to kill Do Mon for retiring from the military even though he was a hardened adult war veteran at the time the old dog took his leave. No seriously. That's all we know about his grudge, and it was mostly told through whining rather than actual imagery. Although given how Gus consistently fucks up even the most basic of soldier tasks on account of his mentor not being around to teach him how to do them properly, perhaps it's understandable to a degree, but that would then put into question how he managed to stay in the military so long to begin with. This all leads up to Do Mon's death (spoilers) at the hands of an alien creature who looks just like Sogo's mother, but considering his connection to practically anybody in the show was as poor as restaurant Wi-Fi and said death being caused by everyone - including him - being a complete moron, it falls completely flat on its face.\\n\\n\r\nSpeaking of everyone being morons, the entire story gets particularly unfocused in the end because the writers had as much of a grasp on the story as I did when it came time to wrap things up. 95% of the villains suddenly switch over to the good guy side for no real reason and when the show finally reveals why Felia is so important in the first place, it turns out that it's because an alien was behind everything. No seriously. That's it. With no foreshadowing whatsoever, it turned out an alien crash landed on Earth and manipulated the main bad guy off-screen so he could use Felia's powers to turn Earth into the new Krypton, General Zod-style. Said bad guy never questioned the plan once in his life, and thus has no one to blame but himself for killing the people who warned him when said alien turns out to be just as evil as he looks. What's that? Why yes, that is my suspension of disbelief melting in the sun. Why do you ask?\\n\\n\r\nAnd just to add insult to injury, the finale is more rushed than a shotgun wedding in the middle of a snowy blizzard. Characters suddenly declare they love each other for no reason and there's an environmental message at the end that's so ham-handedly crowbarred into the narrative it probably would have sent Hayao Miyzaki into a fit of laughter if there was anything worthwhile to laugh at in regards to Comet Lucifer. In fact, why am I devoting my precious time and energy to this worthless show in the first place? Why don't I just end this review right now and go eat some M&M cookies?\\n\\n\r\nSo in conclusion before I cover myself in crumbs, Comet Lucifer is a worthless show that rips off much better anime you could be watching instead, and I advise you to forget it ever existed, as well as realize that that \"original shows being more interesting than adaptations\" mentality is about as truthful as the lawsuits against Borat.",
            "date": "2016-01-29T12:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 209623,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1147547.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Flawfinder",
                "username": "Flawfinder"
            },
            "url": "https://myanimelist.net/reviews.php?id=209623"
        },
        {
            "content": "The first three episodes didn't made any-sense while they're trying to introduce the mecha and the type of mecha they're evolving into. So, to say, that you need to have a hand signature on your body to release both \"Mecha like human\" and the other creature to transform into a mecha?! This story reminds me of Kakumeiki Valvrave with the hand signature but, it's on the neck instead.The character's are dreadful as if the main character doesn't know what's going on with the crystal. Why did he said \"Now I finally know what my mother want\" or something like that in Episode 1? Does heknow what he found? It seemed like he known about mecha's but at the end of that episode, he surely didn't know much about crystals rather than finding them. I thought he was going to take his hobby that he has interest in with the crsytals to use that with the mecha to understand them better but he's just another clueless character role that doesn't make any-sense. Even the other characters are clueless. The only character I could appreciate for not being clueless so far in this episode is; \"Do Mon, Hajime\". The sound effect is dreadful as each explosion hits. My, that will hurt your ears badly. It's worst than Valvrave's drone effects. But, I could give a different mecha a try but the characters seem so basic. Why must the main character know how to use the mecha but doesn't understand anything about it?! Please stop this formula.",
            "date": "2019-03-07T10:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 303061,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4553541.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Cerenebus",
                "username": "Cerenebus"
            },
            "url": "https://myanimelist.net/reviews.php?id=303061"
        },
        {
            "content": "First review I'm writing on this site. Honestly, this shit was predictable but also all over the place. Besides the art, which is pretty great, the story was rushed and definitely generic. Most Disappointing of 2015 for me personally. I already felt like I was getting tired of these particular types of anime but man did this one leave a sort of bad taste in my mouth. Even if you love this genre you will still find this anime to be average at best even painfully so. I honestly felt like i should've dropped this series a while ago. I writing all this and yetI realize that I still don't even get what the point of Comet Lucifer was. Was it really just to show off some pretty good background art cause that was the point they nailed it but everything else is \"meh.\"",
            "date": "2015-12-21T23:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 206379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3873959.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/FireclownZZ",
                "username": "FireclownZZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=206379"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\n(WARNING: This review spoils various parts of Dante Alighieri’s Divine Comedy, an epic poem that he constructed in the 14th century. His work is regarded by many as one of the greatest pieces of literature ever created. If you do not wish to have Dante’s magnum opus spoiled, read no further. Or, as Dante may write, “turn back to see your shores again.”)\r\nComet Lucifer is like Satan.\r\nBefore completing that simile, we need to define Satan first. In Dante Alighieri’s masterpiece, Divine Comedy, and, more specifically, the Inferno, Dante travels through the depths of Hell and(surprise surprise) he encounters Satan.\\n\\n\r\nLong story short, Satan is eating specific souls (three to be exact) who have committed the most egregious of sins. But this is Satan we are talking about. Instead of simply eating them right away, he gnaws on them. He crunches on them. He bites on them. For eternity.\\n\\n\r\nBack to the simile. Comet Lucifer is like Satan. When it catches you in its maw, it feasts and feasts and feasts until your brain is crushed and your sanity vanishes. Yet, even then, it feasts.\\n\\n\r\nSTORY\\n\\n\r\nTechnically speaking, Comet Lucifer is not the devil incarnate. But it is not a stretch to say that it would have been better off being the literal representation of all that is abysmal than what it ended up as.\\n\\n\r\nThe anime did not start off in such dire straits. If one were to be completely fair, it was actually doing all right before hitting the halfway point of its life. The first four episodes gave the audience its lovable troupe of characters. The episodes gave lots of robots. And the episodes gave a strange world with an even stranger plot. A grand adventure awaited.\\n\\n\r\nThen episode five happened, and all hope had to be abandoned.\\n\\n\r\nAt the first circle, Comet Lucifer encounters the ghosts of repetition. Fights with robots constantly occur, but most frustrating of all is how the gang almost never comes out on top. Moura gets beaten, the others are tossed around, and then the plot resets, causing the loop to occur once more.\\n\\n\r\nAt the second circle, Comet Lucifer encounters a storm caused by subpar writing. Rather than having interesting dialogue or purposeful monologues, the words exchanged mostly boil down to lots of “Sogo…” and “Felia!” These cries, as it were, are difficult to love.\\n\\n\r\nAt the third circle, Comet Lucifer encounters an icy torrent of subplots. Apparently there is a war that had been fought. Apparently there is a council that watches over the world. Apparently there is new science. “Apparently” because these subplots go so unexplained that it is hard to tell one way or another.\\n\\n\r\nAt the fourth circle, Comet Lucifer encounters boulders that disrupt its pacing. Sometimes the narrative moves quickly from one area to another, and other times the narrative slows to a crawl. Either way, the boulders are always around.\\n\\n\r\nAt the fifth circle, Comet Lucifer encounters a morass with Do Mon’s episode. His entire side mission – talking to Gus, then getting shot, and then rushing all the way to Zoneboyle, only to end up at a random graveyard to get murdered – is nonsensical and hard to wade through.\\n\\n\r\nAt the sixth circle, Comet Lucifer encounters wicked flames. While wrapped in fire, it tries to escape by information dumping an absurd amount of details, like the concept of physical angels and earth-bound seeds. Of course, the attempt is to explain Felia’s origins. And, of course, the attempt fails.\\n\\n\r\nAt the seventh circle, Comet Lucifer encounters blood and a forest and runners that each get in the way of the central conflict. The characters are driven by their want to protect Felia. But since they never seem to be able to do that, and, in the end, she is not saved (in fact, she does the saving) made the whole plot impossibly pointless.\\n\\n\r\nAt the eighth circle, Comet Lucifer encounters a Malebolge filled with various maladies. Sogo getting beat up beyond what a normal person can take, yet still he walks around as if nothing happened. Felia growing up only once instead of multiple times. The final, true antagonist appearing out of nowhere. The original antagonists turning into nice guys because why not. And the whole trek to the Altar of Abyss meant absolutely nothing since the conflict moved back to the city.\\n\\n\r\nAt the ninth (and final) circle, Comet Lucifer encounters a sea of ice so slippery and so cold it trips and it freezes. Here, the final message – love saves all – has its heart in the right place, but since Sogo and Felia did not have enough moments alone together, let alone romantic moments, the message lays supine rather than upright.\\n\\n\r\nWhen Purgatorio is reached and contemplation is had, Comet Lucifer admittedly had an interesting idea: the death of Earth’s angel causing Earth’s guardian to attack Felia, Gift’s angel.\\n\\n\r\nUnfortunately, getting to this idea requires a figurative trek through Hell.\\n\\n\r\nANIMATION\\n\\n\r\nIn order to get to the eighth circle of Hell, one must ride upon Geryon, a malformed beast made up of three creatures: a human, a lion, and a scorpion. While the beast is ugly, it is not without its own beauty.\\n\\n\r\nComet Lucifer is similar when it comes to its actual animation and artistic direction in that it is a hodgepodge of parts with flashes of brilliance.\\n\\n\r\nLooking at the animation first, it is not impressive. Besides the CG robots quarreling time and again, the rest of the animation within the show is low. Flapping clothes and hair in the wind is as involved as it gets.\\n\\n\r\nSpeaking of the CG, it manages to cross the river Styx without too much trouble (dancing food notwithstanding). The robots have cool designs – especially Moura’s – and their movements are realistic and varied – flying, swinging, and jumping.\\n\\n\r\nThe art is like an angel that comes down to help for a brief moment then disappears, never to be seen again. Most of the art is comprised of clouds and cliffs and corridors. Yet, occasionally, the anime provides a serene look over the nearby plain or fills the screen with bountiful colors. Sadly (and again) these moments are not around enough.\\n\\n\r\nAnd as far as the character designs are concerned, they, too, are rather boring. Sogo wears a giant monocle in his hair. Roman’s hair is dangerously red hair with a weird yellow streak going through it, but at least he actually looks like a pompous, rich dude. And the (original) antagonists wear a lot of dark colors to appear evil.\\n\\n\r\nThe only characters that seem to receive some attention are Felia and Kaon. The former looks like a dainty, flowery ballerina with color-changing hair and the latter’s ribbon, pink jacket, and jean shorts make her attractive.\\n\\n\r\n(Also, a special, negative shout-out to the ending track that plays during episodes six, seven, and eight. The scrolling effect is lame and is made lamer by Zoneboyle’s silly depiction and the cow floating on a cloud.)\\n\\n\r\nCHARACTERS\\n\\n\r\nIn the area between the fifth and six circles of Hell are the walls of the city Dis. The walls are guarded by harpies and, more importantly, Medusa. Medusa is known for her ability to turn any man to stone who looks directly at her.\\n\\n\r\nThe characters of Comet Lucifer are also known to do the same.\\n\\n\r\nSogo is supposedly the main protagonist of the anime. At first, he is trying to find a red crystal, but, after finding Felia, he makes it his mission to protect her. And that is it. He does not have a flaw that he overcomes, and he rarely experiences anything traumatic. The only time he gets emotionally compromised is when Do Mon dies, but, even then, that is through a phone call.\\n\\n\r\nDo Mon’s character is likewise strange. Initially, he seems like an extreme side character, i.e., a character that is there for a small amount of time then disappears forever. But later on in the season, it is revealed that Do Mon has quite the history. He was once a soldier, he used to be a mentor for Gus, and he took in Sogo when Sogo’s mother was killed. (To be fair, him shooting Sogo’s mother’s killer not once, not twice, but seven times, without any trace of emotion, was hardcore.)\\n\\n\r\nHis character is given pretty quickly through flashback and, true to Comet Lucifer’s form, he is quickly taken out. His departure is a bit too over-the-top, but it is his lack of interaction with the other characters – and more specifically Sogo – that make it nigh impossible to relate or care about him. His lasting detail is a notebook of curry recipes that signifies how much he cared about Sogo, but said notebook, like Do Mon, is quickly forgotten about.\\n\\n\r\nThe same can be said for the other main characters. Kaon, Roman, and Otto hardly interact with Sogo, Felia, and Moura because they are never given the chance since, many times, the anime splits them up into these separate groups. The characters also hardly interact within their respective groups. Roman is always spouting the same words to Kaon, Moura surprisingly has little dialogue with Felia despite being her guardian, and Otto should not have even been a character given how he almost never speaks and almost nothing is known about him.\\n\\n\r\nThis splitting of the cast also causes the anime to lose focus on the first group. The latter half of the anime understandably puts focus on the second group, but, since Kaon and Roman only had their base characterizations of being nice and in love with Sogo and being rich and in love with Kaon, respectively, they do not develop as characters whatsoever.\\n\\n\r\nSomehow the antagonists are just as lacking. The main problem here is that are too many. Gus is bent on fighting others and following orders. Patrick is demented due to his need for violence. And Alfred is a creep since all he lives for his Felia, his “mademoiselle.” Gus at least has something more to go off of: He was saved and inspired by Do Mon. But his motivations as an antagonist are weak; all he ever wants to do is get high off of fighting strong foes.\\n\\n\r\nThe other two, Patrick and Alfred, are simply awful antagonists. Patrick has a single scene where he shows off his crazy skills. Afterwards, he is just a scary kid. Alfred gets an entire episode, but it is dedicated to demonstrating his prowess at hacking. He, like Patrick, literally does nothing but get in the way following his introduction.\\n\\n\r\nAll that is left is Moura and Felia. Moura is the comic-relief side character; she serves her role well enough. Felia is found underground (with Moura), and she is taken in by Sogo and Kaon. She is a kid, learning about words and the world around her. She even comes to like the local “cat pigeons” a lot. She is exactly who she needs to be: an inquisitive, passive child ready to grow.\\n\\n\r\nAnd grow she does, but not necessarily in the right way. The anime has her become a teenager near the halfway marker, turning her from a budding kid into a useless protagonist. “Useless” may be an understatement because Felia just exists. She is not so much a character as she is a plot device, moving from location to location only to be chased, carted, and captured indefinitely. Also, the cat pigeons are not brought up again – more incompetency.\\n\\n\r\nFelia getting bigger does actually have purpose, and it is the first semblance of thought the cast receives. Her getting bigger gives her the opportunity to fall in love with Sogo. (She could not love him in the “woman loves man” kind of way because she was a child.) While those opportunities almost never occur (brought up earlier in the “Story” section), not all is lost. The wedding they crash (love), the confrontation between Sogo and Do Mon (more love), and the help she receives from the rest of the group (even more love) expose her to that nebulous feeling. By the end, she comes to understand what love is through the experiences she had witnessed. Meaning, however slightly, she developed as a character.\\n\\n\r\nSadly, it is not enough, especially when she is so useless, when many of these acts of love do not influence or involve her directly, and when the rest of the cast is as abysmal as they are.\\n\\n\r\nThus, who is the best character of Comet Lucifer? The answer is Malvina, otherwise known as Agent Honeybee. Of course, she is not without issues herself: She decides to stop betraying Sogo and the gang once Do Mon dies to make amends for getting Do Mon killed when she could have just not been evil in the first place.\\n\\n\r\nRegardless, why is she the best character? Because she hides her guns and grenades in loafs of bread. That does not make her a well-written character, but it is a pretty rad trait to have.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track is arguably the only strength of Comet Lucifer. Listening to the opening track, the vocalist does a splendid job. Her range and emotion are palpable, and the various shifts in beat and instruments propel the OP forward. The tone is almost too grand for the scope of the show itself, though, and the fact that it is not that catchy diminishes its value. However, the background choir and the hopeful feeling make up for these negatives.\\n\\n\r\nThe first ending track has a nice first half. The clapping, upbeat beat, and lighthearted singing (the “kokoro” lyric is especially fun) match the slice-of-life vibe that the first few episodes give off. Unfortunately, the second half gets lost among the loud instruments, losing the strong start the first half provided.\\n\\n\r\nThe rest of the music is reminiscent of a group of goblins called the “Evil Claws” that roam in the Malebolge. One of their more famous stunts comes from their leader who “made a trumpet” from his butt. That is, he farted – i.e., he played some of Comet Lucifer’s music.\\n\\n\r\nFor example, a bunch of different EDs replace the first. Some are used only once. (They feel more like insert songs than EDs.) Some do not match the tone of the anime at the time. (The ED for episodes ten and eleven uses an acoustic guitar and vocals that makes it happier than the events therein reflect.) And all sadly come off as “the same.” (Their not as stylistic as the OP and the first ED.)\\n\\n\r\nThe other tracks of the original soundtrack are similarly weak. There are quite a few tracks, but many come off as uninspired or lacking diversity, relying on lots of piano, choirs, and woodland effects.\\n\\n\r\nSome tracks, like “So Ugo To Fe Ria” with its peaceful, everyday feel and “Moura To So Ugo” (the best track in the OST) with its jungle, simple feel make a case for the OST. Other tracks, like “Semari Kuru Kyoufu” which is harrowing and “Nukumori No Arika” (without the quartet) which is magical, also try to make a case. Still, these and the rest of the tracks are just not prominent or powerful enough to enhance the viewing experience.\\n\\n\r\nAnd voice acting performances hover somewhere below average. Ayaka Ohashi does not capture the voice of a child. Inori Minase as Moura used a voice that fit for Moura’s stone form but did not fit at all for her human, warrior form. And Rie Takahashi as Kaon had next to no chances to demonstrate emotion.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhen I got to the end of this one, I was surprised that they decided to include an epilogue. It was a kind gesture, but my surprise and appreciation almost immediately turned into disgust.\\n\\n\r\nIn the epilogue, the anime has the gall to show me Kaon marrying Roman. But more than marrying, they had three children together. Three. This girl who is in love with Sogo. This girl who is continually shot down. This girl who watches this faux romantic relationship between Sogo and Felia that has zero basis. She gets shoved onto Roman, the guy she repeatedly wants nothing to do with. And they make it pretty clear that she has slept with him (at least) three times. It is aggravating beyond belief.\\n\\n\r\nThis feeling just about sums up this anime: aggravation. It is aggravating how nothing makes sense. It is aggravating how the cast acts. It is aggravating how something that starts out pretty okay can turn out so unbelievably bottom-of-the-barrel.\\n\\n\r\nDespite me creating a massive, extended metaphor that likens the anime to Hell on Earth, I honestly do feel bad for something like this. Somebody on staff has to realize how messy the whole project is while it is being created. They put a lot of time and effort into this anime, only to have the return be so negative.\\n\\n\r\nAll of the voice acting and all of the music; all of the time and all of the money; all of the animators and the meetings and the advertisements and the promoting – all of it is for nothing. That makes me sad.\\n\\n\r\nAnd it makes me aggravated.\\n\\n\r\nComet Lucifer is about as horrible as they come. The story is awful. The characters are worse. And everything else that surrounds it is not worth talking about. If God does exist and he asks me to choose between Satan and this one, jumping into the former’s mouth headfirst becomes a no-brainer.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, a figurative trek through Hell\\n\\n\r\nAnimation: Bad, Geryon’s offspring\\n\\n\r\nCharacters: Terrible, what Medusa sees when she looks in a mirror\\n\\n\r\nSound: Bad, like Curly Beard playing his “trumpet”\\n\\n\r\nEnjoyment: Terrible, certainly no Paradiso\\n\\n\r\nFinal Score: 1/10",
            "date": "2016-07-23T12:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 224758,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=224758"
        },
        {
            "content": "Ah, adventure.  The act of embarking on and going to an unknown place fills many with excitement, as the prospect of finding the unknown has thrilled the human psyche with lots of determination to find what's out there.  And so, with Fall 2015 coming to a close, we have Comet Lucifer, an original anime by 8bit, which…well, it’s an adventure all right.\r\nStory: Amagi Sogo is a boy who lives on the world of Gift, a world that looks like a more magical version of our planet and has a bipedal armor (aka mechs) that make the world more technologically advance than our own.Upon one day after helping his friend Kaon escape getting chased by her fiance arranged by their families (you know how that goes.  And yes, this is what happens in the first episode), he stumbles upon a red gem that turns into a little girl, and a lizard mech that embarks Sogo and his friends on an adventure to find out the secrets of this world.\\n\\n\r\nNow, to start off, and just to put it out there, the plot of this anime is pretty lackluster.  The entire series revolves around Sogo trying to find out who and what this little girl who came out of the stone, named Felia is.  In doing so, the show just kind of makes everything fall into place.  Characters become relevant because they have some kind of connection to someone else, and Sogo and his friends especially just follow along with what's happening.  The entire show is basically plot driven to the point that the entire cast just follows along like a lost puppy with what's happening.  All of the antagonists' goals are pretty straightforward so there's a convenient reason to continue with this show, and there just isn't much to care about as a result.  \\n\\n\r\nThe other major issue with the show is the whole mystery that there're trying to put around Felia.  Why are there so many people going after her?  Why does this team rocket-like group keep following and chasing Sogo?  Why do we care about Do Mon's backstory?!  (I'll get to that one later.)  The major problem I find is that the show tried to make its mascot character, Felia, extremely important without mentioning why she's important.  She's, in the series, repeatedly referred to as the \"Lima\", but we don't really get a full understanding of that title till the end of the series in the last few episodes, and even then, it's not really all that satisfactory of a conclusion because the show has another issue that it was never able to resolve, change in plot. \\n\\n\r\nAnother major issue is the fact that Comet Lucifer was just never able to cement itself down on a singular plot because it kept bringing up these little subplots that really don't amount of much.  They're so insignificant that the characters that they're tied to don't really matter that much in the end either.  Like, they devote complete episodes to something that doesn't pertain to Felia, and as such, take away from what is going on at hand.  They try to make it a backstory that has importance to the story, but at that point, it's just flavor text that tries to spice up the story.  \\n\\n\r\nAll in all, Comet Lucifer's story is rather lackluster.  Its entire runtime is filled with an adventure filled with subplots, unsatisfactory mystery, and somewhat uninteresting storytelling that the characters are just dragged along to participate in.  The ending itself didn't really help much either because by that point, the whole show was talking about something it never mentioned before earlier in the series, and they did this whole afterstory thing with little snippets of what happens later to everyone in life.  Which is nice, but kind of irrelevant.  (Especially since half of them didn't make sense.)\\n\\n\r\nOverview:\\n\r\n-  Too many subplots\\n\r\n-  Lack of explanation and/or unsatisfactory explanation\\n\r\n-  Kind of predictable, actually\\n\\n\r\nCharacters:  As I mentioned before, the characters of Comet Lucifer are really just people who are just brought along for the ride according to the law of the story.  A couple of them really have no place in being part of the story, and that just sort of bolstered how little I personally cared for them since a good chunk was something the story could've used without.\\n\\n\r\nUp first, we have Amagi Sogo, our main MC.  I'm not going to waste too much time talking about him because he's really just the stand-in person that acts as the protagonist in this whole adventure.  By the law of anime, he is brought along this adventure and continues to do so to create a motivation or anchor to the two characters that actually matter.  He's not really a character; more like an idea, or an allusion to the idea of a main protagonist.\\n\\n\r\nThen we have the two mascot characters, aka the ones that really matter, Felia and Moura.  Felia, as the true mascot character is the 'Lima', as she is referred to many times in the series.  For the most part, she acts as the plot progresser, being the thing that all of the antagonists want for the 'power' that she holds, which only gets half-explained in the series.  Unlike Sogo, she comes into this series as an innocent little child that as time goes on, starts to understand her role on the planet, but even so, doesn't really make her significant in any way in terms of character since she's really just a plot point.  They also try to shoehorn in this romance subplot that is not only forced and pointless, but so unnecessary that it made the series feel worse than it should've been.  And that's saying something.  \\n\\n\r\nThe other mascot character is the little rock snake named Moura, who turns into a fucking lizard/dragon mech.  Moura is the only character that I personally cared about because unlike everyone else, she had a purpose in this series, acting like the protector to Felia and is brash towards anyone (especially Sogo) who is ignorant in what they were handling.  Moura acted like the one person who actually knows to some extent what's going on and really tried to recover the series, especially with her signature '~Jamon' ending.  But even that wasn't enough.  (Sorry Moura, you tried though.)\\n\\n\r\nOther characters include Do Mon, Sogo's protector who had a past that doesn't really impact the story in any way aside from adding background flavor text to the series, Sogo's friends Kaon, Otto, and Roman, who are just cast fodder to make the adventuring group bigger than just a magic girl, a tiny Onix, and a boy, and a whole host of villains and side characters that do as little as you'd expect, adding in their own little motive for doing things that adds as little as you'd expect.  (They even have a team rocket-esque group that just follows Sogo and tries to capture Felia like she was Pikachu.  Come on now.)  \\n\\n\r\nOverview:\\n\r\n+ Moura (and Felia because her tiny form is an adorable chimera of Renge, Chaika, and Shiro.)  \\n\r\n-  Bland and uninteresting characters\\n\r\n-  Character motives are rather pointless and don't serve to do anything but move the plot\\n\\n\r\nArt: The art of Comet Lucifer uses two distinct things during the show.  The first is its normal style which is colorful in its appearance as everything looks rather whimsical and bright.  Its animation quality isn't much different than what 8bit has done in recent years, so there's nothing extraordinary about that.\\n\\n\r\nAnother thing that Comet Lucifer employs is a style of CGI for its mechas.  Contrary to most CGI that's used, these mechs don't look particularly out of place.  They look a bit awkward, but for the most part, they didn't look too too jarring and were tolerable.  Especially Moura, because Moura's design is pretty good.  \\n\\n\r\nOverview:\\n\r\n+  Moura's mech design\\n\r\n+/- Standard animation\\n\r\n+/- Mechs are ok in CGI, but a little out of place sometimes\\n\\n\r\nSound: The soundtrack for Comet Lucifer employed the help of Fhana, the same artist who did the Bokura wa Minna OP (if anyone reading this knows that show), and as such gives us a bright and joyful song that embodies the spirit of adventure that this series tries to instill.  The story didn't do the song justice in my opinion.  \\n\\n\r\nAs for the ending song, well, there's not really much to say.  It's pretty much a generic track that isn't really all that exciting to listen to.  Its bright, it's happy, but it doesn't evoke the same feeling that Fhana's OP song has even if they have similar tones.\\n\\n\r\nOverview:\\n\r\n+ Good OP\\n\r\n-  Meh ED\\n\\n\r\nPersonal Enjoyment: While Comet Lucifer wasn't particularly a show that I thought did what it wanted to, I still couldn't stop myself from watching it week after week.  I don't know, there was something about it that just kept me going.  It wasn't good by any means, but it wasn't something that I stopped myself from watching or dreaded watching week after week.\\n\\n\r\nDid I like this anime?\\n\\n\r\nNot particularly, but I did enjoy Moura's overall character and the opening song.  (Yes, those are the two things I will say I fully enjoyed.  Not so much Felia because of what happens halfway through the series.)\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nThe rest of the characters are uninteresting, the story is so jumbled and messy that it itself doesn't know what to make of itself simply because it's got all of these subplots that take away what little story it has left.  And even when it focused on the main story it didn't do too well.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nHonestly, if you just want to watch something just because you're bored and got nothing to do, I guess this is worth a shot.  Comet Lucifer is a show that tries too hard and succeeds in very little.  Watching it for the sake of watching it is really the only reason I would suggest you watch this show since it's got so many problems and so little resolve that if you think too hard, you're gonna have a bad time.",
            "date": "2015-12-20T17:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 206194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206194"
        },
        {
            "content": "If you do not wish to read all of this banter, just skip to the very last paragraph for a simpler review of this anime.\r\nWell this anime was quite a boring adventure. I had quite high hopes for it because it seemed like it would be all cute and happy, but in the end all I got was an anime with close to no plot and chaotic boringness.\r\nStory [5]:\r\nIf you asked me what the story was about, I would have no idea how to explain. The plot was so chaotic and only at the last episode did I understand a TINY bit what I hadjust witnessed. It was absolute nonsense. At the very beginning I felt that there was some idea the authors had, then they just came up with stuff as it progressed and later on just tried to mash some kind of conclusion. And so, Comet Lucifer was born. \\n\\n\r\nArt [4]: \\n\\n\r\nThe animation and art seemed really, really simple. I felt like there wasn't much effort put in, only maybe at the parts where giant mechas were fighting, other than that it was plain and boring even though it did seem very colorful at times.\\n\\n\r\nSound [3]:\\n\\n\r\nThere is absolutely nothing memorable from the soundtracks. Just nothing. At least it somewhat did it's job to make the mood right, but even so.\\n\\n\r\nCharacter [5]:\\n\\n\r\nVery plain and cliche. We have the same boring protagonist who ends up in a love triangle with a very cliche tsundere. All of the focus was on Felia it felt like the other characters were completely neglected. They were THERE, but accomplished NOTHING. This is what ticked me off quite a bit, because some characters had potential and I liked them a bit, but they ended up meeting a tragic end or just got completely neglected. Thanks a lot.\\n\\n\r\nEnjoyment [4]:\\n\\n\r\nI felt like I was forcing myself to watch this. In the middle I just put this on as some background noise while I was doing other things, but at the last 2 episodes I managed to force myself to finish it. It's not enjoyable at all, it's completely boring. Okay, maybe at some points it was A BIT entertaining to watch, which is why I gave this a 4 instead of a 1, but those few moments do not make up for the absolute crap this show is.\\n\\n\r\nOverall [5]:\\n\\n\r\nComet Lucifer is one of those boring anime's that you THINK would be good, but in the end it isn't. It's very cliche and a perfect example of a messed up plot. Everything can be predicted, which is why the plot twists the anime TRIED to make were failures. If you wish to give this a try, I suggest you don't. It's simply a waste of your time and you should just watch something worthwhile. Something that doesn't sully the 'mecha' genre, like Bokurano or Code Geass.",
            "date": "2015-12-23T05:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 206531,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2684279.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KittyNom",
                "username": "KittyNom"
            },
            "url": "https://myanimelist.net/reviews.php?id=206531"
        },
        {
            "content": "[REPOSTING CAUSE IT WAS REMOVED]\r\nOk, straight to the point. This. anime. is. shit. It is completely and utterly terrible. I forced myself to watch at least 5 episodes. What can I say, it was very hard.\r\nStory : 3/10\r\nThe idea is stupid. Basically the story so far can be resumed too : \"Girl falls on guy, guy finds magic stone, magic stone becomes loli, loli chased by evil organization.\" The guy who came up with the idea \"hey let's make an evil group who have a mech army on their side and a bunch of super trained soldiers chase after a bunch of 15 year olds\"should get slapped. There is nothing to be said, the story is boring and makes no sense.\\n\\n\r\nArt : 7/10\\n\\n\r\nI feel like with recent anime this is usually the mark that saves the final score. The art is well... nice? It seems kind of weird. The character designs are also ok.\\n\\n\r\nSound : 3/10\\n\\n\r\nThe first time ever I rate 3 on sound. The voice acting is just simply annoying. The characters feel bland, liveless.. The OP is terrible for a mech anime.\\n\\n\r\nCharacter : 1/10\\n\\n\r\nOk, sometimes I say that there is literally 1 good character in the anime, and usually it's an exaggeration. This time, the only OK character is Felia, just because how cute she is. The MC, Amagi Sougo, is just a stone wall, one of those \"project yourself onto this guy plz\". Lanchester Kaon has somethings in common with Asuna from SAO, bland, useless and stupid. Mo Ritika Tzetzes Ura, the useless stone thing never gets an explanation why he exists or why the hell is he a mech and how did he get powers and so on. There is literally not 1 single \"good\" character in the entire anime.\\n\\n\r\nEnjoyment : 1/10\\n\\n\r\nI FORCED myself to watch this. Anime is supposed to be fun to watch, a form of media, not a torture chamber. It is impossible to watch.\\n\\n\r\nOverall : 2/10\\n\\n\r\nSaved by the art and the cuteness of Felia, this anime has the lowest score I have ever given. Would never recommend it, it should just be forgotten and never talked about in the anime community.",
            "date": "2016-01-03T16:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 207679,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634819.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Piezuri",
                "username": "Piezuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=207679"
        },
        {
            "content": "Up until the ending I had this show at about a 7/10, ending kinda ruined it for me. It wasn’t a completely terrible ending, but I didn’t like it either; dropped the show from a 7 to a 4 or 5. Don’t want to give too much away, but just know the ending may be a bit of a bummer if you make it that far. \r\nI don’t really have anything else to say because I don’t really feel like putting too much thought into this review, but I gotta reach the minimum review length so I’ll say this to expand on why I didn’tlike the ending:\\n\\n\r\nPotential spoiler (sort of)\\n\\n\r\nI can handle sad endings sometimes, but in general I prefer happy endings. It depends on how the story unfolds and the factors involved. This story didn’t set up in a way that I could really accept its conclusion. It felt like the writers could have very easily given it a happy ending, but they just chose not to; and those are the kinds of sad endings I have trouble accepting. There were so many things left unexplained, and then they threw some half-baked explanation at you in the last episode and that’s why it had to end the way it did. Wasn’t a fan. Kinda feels like bad writing. Either they should have given it the happy ending that would have made sense, or they should have left more details and clues along the way so that the reason behind the ending made sense. But as it is, they didn’t, and it doesn’t.",
            "date": "2019-01-08T00:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 298403,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7468921.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DJ1495osu",
                "username": "DJ1495osu"
            },
            "url": "https://myanimelist.net/reviews.php?id=298403"
        },
        {
            "content": "I feel like I expected a lot more from this anime than I got out of it. For all those who remember the plot of Guilty Crown, I didn't find anything special from the story, to me it was extraordinarily similar, more so at the very end. But there are certainly things that the anime does well, as the story is not the only element the anime has to give. The characters were unique in their own ways, as we see the usual protagonist, and his childhood friend. Some of the characters did appeal to me at times, and character development often took me bysurprise. The anime sometimes did put out nicely animated full fledged fight scenes between mecha's, and I felt it was nicely animated. The colors, art, and animation together balanced the plot in a way, and I stuck with this anime until the end.",
            "date": "2016-01-02T13:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 207584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5054491.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Niudoru",
                "username": "Niudoru"
            },
            "url": "https://myanimelist.net/reviews.php?id=207584"
        },
        {
            "content": "Comet Lucifer's first episode pays homage to some lost animes in the nineties.  The premise for this show is an old trope but the execution that time felt sincere. Also, the first major scene involved well-choreographed fights and beautifully integrated CGIs. While not perfect, it managed to capture the pure fun (and dumbness) of these type of shows and ended with its audience wanting for more.  \r\nThen it went downhill from there. \r\nStory, what story?: 3/10\r\nTo be fair with Comet Lucifer, it presented a very simple premise in the first episode. There is this teenage guy who wants to save his girl fromthe evil forces that be and that girl supposedly contains some magical powers that could save the world. \\n\\n\r\nThe first few episodes might be little jarring because of the mood whiplash (just can a lighthearted tone be a fight scene literally a second later) but is is never bad. Felia might be a bit mentally challenged but their adventure (as well as the totally random fight scenes later) are engaging albeit a bit boring. \\n\\n\r\nOf course, the story will not be complete without your caricature antagonists who appeared out of nowhere just to torment their peaceful days and a power being the power who manages just everything in this show.\\n\\n\r\nSounds like your endearing 90s anime, isn't it? \\n\\n\r\nWRONG, or maybe not if you consider the negatives these shows used to have.\\n\\n\r\nFor the increase in the episode count, the plot was increasingly muddled with unnecessary flashbacks until it tried to mimic the epic failure that was called Guilty Crown. Who would have thought that Sogo would also be involved in the middle of that convoluted plot despite being a mere crystal idiot? Not to mention his tendency to be so stubborn to the extent of being irritating. Oh, his mother was also a researcher who knows Do Mon.. yada.. yada.. and Do Mon is also an ex-officer who knows this goon yada.. yada.. ZZZZ...\\n\\n\r\nComet Lucifer also used too much anime physics for the suspense of disbelief of the audience. There are also times where Sogo is in the middle of the war and should've been blasted off by the shock from explosion or be hit by a stray bullet but his main character status protected him from warn. The show did not even bother to explain how on Earth that caterpillar became a mecha and how Sogo was able to operate it with ease. And gasp! That caterpillar is a female with a hideous character design just because the show wants to. Yay.\\n\\n\r\nHowever, those missteps were not enough. Guilty Crown took 22 episodes to be that renown (or notorious) and Comet Lucifer aspired to be like that in a span of 12 episodes. The end result? It was not even close.  It is too tame to be called trashy entertainment a.k.a. Guilty Crown and it is just terrible. The show took itself too seriously to be labelled as guilty pleasure but is offending (and sometimes boring) enough to be classified as one of the worst this year. \\n\\n\r\nComet Lucifer tried to salvage itself in the finale only to show more stupidity when it revealed its main plot. Really? A mecha lost its master so it should find a new one out of envy in any way possible. What is this? A girl stealing some doll from another girl? That was supposed to be a Eureka moment in this show but I was busy laughing with the stupidity that show has just given.\\n\\n\r\nCharacter: 3/10\\n\\n\r\nThe moment Felia woke up sent a distress signal in Comet Lucifer. If you are expecting some extraterrestrial being who is naturally wary after all the mouse and cat chase she is in , then you are wrong. What we get is a girl who acts like a five year old who gave a montage of dancing vegetables in Sogo's garden. Yes. She plays the princess in damsel in this show. Ugh.\\n\\n\r\nSogo, on the other hand, may have earned the most stupid male character lead this year after Comet Lucifer. He decided to save Felia 'just because'  and suddenly fell in love with Felia the moment she transformed into a voluptuous woman. No matter how sexist and stubborn Shiro of Fate/Stay Night is, at least he has a reason doing things in the show. Sogo would just do whatever he wants (and mind you, in an irritating manner) and it cost him a lot in a supposedly dramatic episode for his development. Only to look totally what he is exactly before in the next one. \\n\\n\r\nOther characters were tropes not utilized properly. Do Mon exists for the purpose of flashbacks and feels which fizzled. Kaon is the doomed childhood friend that was not given enough time to flesh her character and Roman's group is in this series for God knows why. The reasons for their actions were never explained and they have an emotional quotient of a rock.\\n\\n\r\nIf you are going to show multitudes of characters, then develop at least one of them. Darn it. It seems like they are mere talking card boards than actual characters. Their world could be gone in an instant and the audience will not care about them. \\n\\n\r\nOverall: 3/10\\n\\n\r\nJust avoid this show. It is not worth your time. This is just bad not even on a guilty pleasure level.",
            "date": "2015-12-23T19:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 206610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4369563.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/samui26",
                "username": "samui26"
            },
            "url": "https://myanimelist.net/reviews.php?id=206610"
        },
        {
            "content": "The series composes a small cast of characters although their roles are all important. Sogo is the easy-going type who can easily make friends with just about anyone. His loyalty is also evident throughout the series as he puts others’ lives above his own. Unfortunately, the guy is really dense and a lot of his actions are questionable at times. Characterization regarding Sogo is generally mild as we barely see his background story. Instead, the show focuses more about his actions in the present alongside Kaon. And that brings up the second point. Kaon can be interpreted as the ‘girl next door’ type. No, I’mnot talking about the girl who flashes their bodies around but rather as someone that continuously expresses interest in the main guy. However, Sougo barely notices her messages. In essence, Kaon is someone fans may feel sorry for especially after Felia enters the duo’s daily life. As the most mysterious character in the show, Felia is hard to accept. She has a childish personality although she matures throughout the series, literally. Her curiosity and mere presence leads her into dangerous circumstances. This is because there are others who are hunting her for their own purpose. As stereotypical as it sounds, the show does make a valid point about this plot direction. More than half of the show involves a mysterious group who are trying to capture Felia that often leads up to mecha conflicts, kidnappings, and threats of death. On the other hand, there are also some episodes that feels more like a slice of life and even a bit of coming age. While the main plot seems to focus on the adventures of the main trio, there are also some focus with Gift and its world fiction aspects.\\n\\n\r\nFor a series about sci-fi, it’s also expected that we see characteristics that are out of the normalcy. Thankfully, Comet Lucifer knows its purpose with some of its mechanics like the mining town of Garden Indigo. The introduction of rare crystals is also an element that sparks interest. And at the same time, Felia’s little friend Mo Ritika Tzetzes Ura (seriously, how do you pronounce that?) looks hardly normal. There’s a mysterious connection that Felia also shares with the cool looking mecha in the series. We don’t find out much about them later on so the story leans to test the patience of the audience. While all of this is going on, there’s also a nice change of landscapes from time to time. As a series with sci-fi, it’s definitely on the right track initially. The occasional comedy can be a hit or miss though depending on your perspective.\\n\\n\r\nHowever, when it comes down to it, the characters holds the series back. Most if not all the characters in the show are generic and hardly distinguishable with perhaps the exception of Felia. Sougo is the nice guy type, Kaon’s romantic interest in her friend Sougo is often met with intentional arrogance, and Roman’s crush towards Kaon is returned with emptiness. If romance was really also sub-plot, then the show failed miserably. Thankfully, that’s not the case but the characters themselves aren’t decently written. The Gift government and their troops are also pretty stereotypical. For a quick run-down the main roster, we have Gus, a guy who just seems to enjoy fighting for the sake of it. There’s also Pack, a young fighter with decent combat abilities but a hot-blooded personality to create trouble. There’s even a guy who is chasing down Felia with a rather unhealthy and perverse obsession. Really now? How can we ever like some of these bad guys for their motivations in the show? They are pretty much like puppets doing the devil’s work. The only good parts can be accepted with occasional characterization such as with Gus’ past life. Otherwise, Comet Lucifer’s characters are like fruit baskets without the fruit. Storytelling gets more and more predictable and pulls out generic ideas from the old book. There’s hardly anything later on that will leave fans good memories about the series.\\n\\n\r\nEven though 8-bit is the studio, Comet Lucifer is a good looking show with its visuals. The world of Gift is colorful and adds curiosity each episode with elements it introduces. The towns, although looks normal like a modern world, are equipped with high-tech gear. The flashy space looking vehicles and scooters can also be fun to look at as we see Sougo utilizes them in a cool fashion. Speaking of cool, the show surprisingly carries over a good amount of action. Each time we see mecha clashes, it’s presented with crisp choreography. The smooth movement and fast paced sequences is legitimately nice to follow. Even their designs looks stylish with each mecha having its own modifications, weaponry, or model. On the other hand, character designs looks typically generic. And although the show lacks fan service, it hardly makes it up when most of its main cast looks like kids that is hard grab attention.\\n\\n\r\nIn terms of soundtrack, the show has its presence but that’s about it. It balances between light and tense depending on the circumstance and responds to it. Both the OP and ED theme song has a colorful idea of presenting itself but hardly else noticeable. And voice mannerism isn’t overly impressive either. Felia’s voice can be a mixed bag as she expresses the childish innocence with a lack of personality. There’s not much to worry about it though as she does mature later on. But in overall terms, don’t expect something to be wowed by for its soundtrack craftsmanship.\\n\\n\r\nIf you came looking for a sci-fi adventure, then there you have it. But if a strong story about a memorable cast of characters is what you have in mind, then it’s better to try elsewhere. Comet Lucifer doesn’t capitalize on the main characters’ roles or motivations in the story. As they face obstacles, their purpose is lacking and often makes us question what if they are heading into no man’s land. While I do like the way this show runs with its world fiction elements, it doesn’t ultimately make it up for its storytelling or weak character cast. And that’s quite a shame, really.",
            "date": "2016-03-02T12:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 212106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3422615.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/walker6",
                "username": "walker6"
            },
            "url": "https://myanimelist.net/reviews.php?id=212106"
        },
        {
            "content": "okay well, here we are at an anime where to me the title has nothing to do with the anime really and it will throw you off.\r\nWe meet a boy, Sogo, who likes rocks and gems, so here he is all alone in the dark cold mines looking for something cool when he finds a red jewel, rushes home and that was that. Then while Sogo is out again, with literally up to no introduction we meet his friend, Koan, who in fact has grown up with Sogo, but we dont find this out till like the last episode..\r\nAnyways moving on, she doesnt wanna getmarries and clearly has a hard on for Sogo, but then they get into this accident that brings them underground where Sogo found this red jewel previously. They wait for help and then they get attacked by some army guy who throughout the whole anime I cannot tell if he was a good guy or a bad guy.. and like yeah.... ANYWAYS, then this girl magically appears out of this stone he found and saves them blah blah blah.\\n\\n\r\nThe next half pf the anime is figuring out where Felia came from while also running away from the soldiers who now want to take her away. Sogo constantly finds himself chasing after the recently abducted Felia while Koan suffers from jealousy issues not wanting to marry her arranged marriage dude Roman. \\n\\n\r\nNext thing you know they're on a great adventure to replenish Felia's godly powers only for her to be taken away.. AGAIN. and they have to go save her. They kinda do.. and then it ends. \\n\\n\r\nWOW.. SUCH A GREAT STORY I CANNOT EVEN HANDLE IT.",
            "date": "2017-09-18T15:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 257956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=257956"
        },
        {
            "content": "Long review short: Comet Lucifer is an example of wasted potential.  What could have been an epic fantasy/adventure turned into nothing more than an insipid kinda romance.\r\nThey won't let me get away with my review being short. *sigh* I hate that. Anywho, the artwork is good. The colors are bright. The writing in the first 2 episodes was tight and interesting. It's like they fired the guy with the plot and the other writer(s) floundered from episode 3-12. I had hope for a few episodes, but it was for naught. When the affable guy turns into a killing machine and the ditz pulls shotgunsout of loaves of bread, \"WTH am I watching?\" It would have been alright had it been funny, but nope. That is the poorly named Comet Lucifer.",
            "date": "2015-12-27T11:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 206988,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1739023.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/dragynfaerie",
                "username": "dragynfaerie"
            },
            "url": "https://myanimelist.net/reviews.php?id=206988"
        }
    ],
    [
        {
            "content": "No, it’s not what you think. Comet Lucifer is hardly about devil or angels or in fact anything that pertains to religious themes. And the “Comet” part isn’t some catastrophic event like a comet hitting the Earth to set up it look like some apocalyptic world. Taken for granted, I’d see this as a show as a hybrid fusion of sci-fi, mecha, and drama. However, Comet Lucifer doesn’t exactly hit all the right angles with its genres. In fact, its storytelling is barely tolerable and in general, a disappointment.\r\nAs an original show, Comet Lucifer essentially had a lot of potential. The first few episodes introducesus to a fantasy world (Gift) where sci-fi elements are evident. From giant robots to animal hybrids, there’s an immense amount of curiosity to see where the story will go. At the same time, Comet Lucifer has the feel of a Eureka Seven-esque type of anime. It’s simple really. We have a young man named Sogo who happens to encounter a mysterious girl named Felia. She also has a mysterious power that links her to the power of a giant robot. Sound familiar? The sci-fi adventure begins there as Sougo, his friend Kaon, and Felia discovers dark secrets in their world.\\n\\n\r\nThe series composes a small cast of characters although their roles are all important. Sogo is the easy-going type who can easily make friends with just about anyone. His loyalty is also evident throughout the series as he puts others’ lives above his own. Unfortunately, the guy is really dense and a lot of his actions are questionable at times. Characterization regarding Sogo is generally mild as we barely see his background story. Instead, the show focuses more about his actions in the present alongside Kaon. And that brings up the second point. Kaon can be interpreted as the ‘girl next door’ type. No, I’m not talking about the girl who flashes their bodies around but rather as someone that continuously expresses interest in the main guy. However, Sougo barely notices her messages. In essence, Kaon is someone fans may feel sorry for especially after Felia enters the duo’s daily life. As the most mysterious character in the show, Felia is hard to accept. She has a childish personality although she matures throughout the series, literally. Her curiosity and mere presence leads her into dangerous circumstances. This is because there are others who are hunting her for their own purpose. As stereotypical as it sounds, the show does make a valid point about this plot direction. More than half of the show involves a mysterious group who are trying to capture Felia that often leads up to mecha conflicts, kidnappings, and threats of death. On the other hand, there are also some episodes that feels more like a slice of life and even a bit of coming age. While the main plot seems to focus on the adventures of the main trio, there are also some focus with Gift and its world fiction aspects.\\n\\n\r\nFor a series about sci-fi, it’s also expected that we see characteristics that are out of the normalcy. Thankfully, Comet Lucifer knows its purpose with some of its mechanics like the mining town of Garden Indigo. The introduction of rare crystals is also an element that sparks interest. And at the same time, Felia’s little friend Mo Ritika Tzetzes Ura (seriously, how do you pronounce that?) looks hardly normal. There’s a mysterious connection that Felia also shares with the cool looking mecha in the series. We don’t find out much about them later on so the story leans to test the patience of the audience. While all of this is going on, there’s also a nice change of landscapes from time to time. As a series with sci-fi, it’s definitely on the right track initially. The occasional comedy can be a hit or miss though depending on your perspective.\\n\\n\r\nHowever, when it comes down to it, the characters holds the series back. Most if not all the characters in the show are generic and hardly distinguishable with perhaps the exception of Felia. Sougo is the nice guy type, Kaon’s romantic interest in her friend Sougo is often met with intentional arrogance, and Roman’s crush towards Kaon is returned with emptiness. If romance was really also sub-plot, then the show failed miserably. Thankfully, that’s not the case but the characters themselves aren’t decently written. The Gift government and their troops are also pretty stereotypical. For a quick run-down the main roster, we have Gus, a guy who just seems to enjoy fighting for the sake of it. There’s also Pack, a young fighter with decent combat abilities but a hot-blooded personality to create trouble. There’s even a guy who is chasing down Felia with a rather unhealthy and perverse obsession. Really now? How can we ever like some of these bad guys for their motivations in the show? They are pretty much like puppets doing the devil’s work. The only good parts can be accepted with occasional characterization such as with Gus’ past life.  Otherwise, Comet Lucifer’s characters are like fruit baskets without the fruit. Storytelling gets more and more predictable and pulls out generic ideas from the old book. There’s hardly anything later on that will leave fans good memories about the series.\\n\\n\r\nEven though 8-bit is the studio, Comet Lucifer is a good looking show with its visuals. The world of Gift is colorful and adds curiosity each episode with elements it introduces. The towns, although looks normal like a modern world, are equipped with high-tech gear. The flashy space looking vehicles and scooters can also be fun to look at as we see Sougo utilizes them in a cool fashion. Speaking of cool, the show surprisingly carries over a good amount of action. Each time we see mecha clashes, it’s presented with crisp choreography. The smooth movement and fast paced sequences is legitimately nice to follow. Even their designs looks stylish with each mecha having its own modifications, weaponry, or model. On the other hand, character designs looks typically generic. And although the show lacks fan service, it hardly makes it up when most of its main cast looks like kids that is hard grab attention. \\n\\n\r\nIn terms of soundtrack, the show has its presence but that’s about it. It balances between light and tense depending on the circumstance and responds to it. Both the OP and ED theme song has a colorful idea of presenting itself but hardly else noticeable. And voice mannerism isn’t overly impressive either. Felia’s voice can be a mixed bag as she expresses the childish innocence with a lack of personality. There’s not much to worry about it though as she does mature later on. But in overall terms, don’t expect something to be wowed by for its soundtrack craftsmanship.\\n\\n\r\nIf you came looking for a sci-fi adventure, then there you have it. But if a strong story about a memorable cast of characters is what you have in mind, then it’s better to try elsewhere. Comet Lucifer doesn’t capitalize on the main characters’ roles or motivations in the story. As they face obstacles, their purpose is lacking and often makes us question what if they are heading into no man’s land. While I do like the way this show runs with its world fiction elements, it doesn’t ultimately make it up for its storytelling or weak character cast. And that’s quite a shame, really.\\n",
            "date": "2015-12-20T05:57:00+00:00",
            "helpful_count": 103,
            "mal_id": 206106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=206106"
        },
        {
            "content": "Comet Lucifer, at the time of this review still an ongoing anime with six of its twelve episodes previously aired, is in one word, disappointing.  And unfortunately, it is disappointing on nearly every level of critique.  \r\nTo begin, Comet Lucifer starts with a somewhat interesting, even if cliché, set-up to its plot.  Our MC, Sogo, travels into a mine in search of a rare crystal that his mother once mentioned and stumbles upon one of particular interest. Thus he meets Felia, the girl who the anime has clearly set up as the main love interest.  And there you have a basicsummary. So we’ve got an alright but cliché boy-meets-mysterious-girl scenario, a childhood friend who is not-so-secretly interested in the MC, and the makings of what could be an interesting plot to come. An additional note of praise for the rest of the series, the Mechs themselves are interesting and the fights (mostly) well done.\\n\\n\r\nSo where does it go so wrong?\\n\\n\r\nAt the simplest level, Comet Lucifer fails because, in essence, it hasn’t really developed anything in regards to its characters or plot and is content to sit around shoving low-context mech battles in between sub-mediocre Slice of Life scenes.  The tonal whiplash one receives while attempting to watch Comet Lucifer is enough to cause major fractures in all seven of your neck’s vertebrae.  \\n\\n\r\nLikewise, the characters are a massive failing point for the misguided Comet Lucifer.  Mainly in the sense that their actions don’t make a whole lot of sense.  From actively parading around the mysterious mystery girl with telekinetic powers around town (despite the fact that there are clearly people trying to track her down) to not trying to figure out why she has any powers at all (or pressing for any sort of backstory), MC and his childhood friend(zone) companion simply don’t cut it as rational actors. Additionally, the characters don’t really have much personality (other than basic tropes and stereotypes) so as a result watching them is dreadfully boring.  \\n\\n\r\nUnfortunately, the character actions and personalities don’t get any better as the episode count increases.  This itself magnifies the previous problem of the Slice of Life scenes; with characters being an essential ingredient to a good Slice of Life, the lack of any character building hurts Comet Lucifer in multiple aspects. These scenes only serve as a boring intermission between the passable mech scenes, which unfortunately are too few and far between to make up for the rest of Comet Lucifer’s failings.\\n\\n\r\nSo what can we conclude about Comet Lucifer thus far? Well, it is bad, and not worth the watch. Truly, Comet Lucifer lives up to its name, for it may very well be the spawn of the Dark Lord, sent upon anime viewers to drive us to tears of boredom and torture them with false assurances of promise.\\n\\n\r\nDo yourself a favor, dear reader. Don’t waste your time on Comet Lucifer.  \\n",
            "date": "2015-11-09T09:34:00+00:00",
            "helpful_count": 60,
            "mal_id": 203052,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Garpachi",
                "username": "Garpachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=203052"
        },
        {
            "content": "What would happen if I told you, a series that had a lot of potential to become one of the few hidden gems turned out to be one of those shows that wasted it's potential with a big fart bomb where it spouts out \"Fuck You and the Audience\"? Yeah, that's pretty much Comet Lucifer in a nutshell. A series that could have turned into something rather decent or enjoyable despite the flaws it had through the episodes, came out with something so insulting that it just pisses the audience and just stabs them like a knife. That's how most people felt in a wayif I think about it in my perspective. \\n\\n\r\nOne thing that the show does completely wrong and it would break the show as a whole. In fact I wouldn't mind this issue but the problem with the show is that it built up so much, that one thing ruined the entirety of the show from becoming something rather decent or something passable into a big train wreck worse than Chaos Dragon. Which if you have seen that show, I think either you won't have the idea of how it's like but you would have an idea the show is bad, or you know and would avoid it like the plague it can be.\\n\\n\r\nBefore I start with my review I will give a fair warning towards the anime review. I will probably spoil some aspects of the show and that includes the ending (maybe) of the show. As well that each person has a different opinion so if you disagree with my opinion it's perfectly fine, each one has a different opinion and if you enjoyed the show then that's considered fine by me. Just be warned this review will be pointing out the issues of the show.\\n\\n\r\nWithout further, let's go into the review of Comet Lucifer.\\n\\n\r\nStory:\\n\\n\r\nThe synopsis explains itself so pretty much in a short sentence, our main characters or group would be going on an adventure after Sougo finding the girl known as Felia in search for the secrets of the world (based upon the story for the first couple of episodes)\\n\\n\r\nNow one thing the show has done good is a few minor things and that's actually something coming from a show that has a very low score.\\n\\n\r\nFor one thing the show had a nice buildup and foreshadow which would have been in the second half of the series, which despite the issues the show had it was of course interesting enough for a worthwhile and see if it’s going to go towards an acceptable anime despite the cons it had.\\n\\n\r\nBut that’s pretty much the pros of the story.\\n\\n\r\nAbout the cons? Oh boy, how much I would have to say about the cons on the series and I will say this will not be pretty for the story department. So fair warning, this will not be a pretty review for this department.\\n\\n\r\nOne thing that Comet Lucifer does wrong, despite the plot being original and having a lot going forward, it's not executed properly at all. Basically because the whole cliche moments are taking away what the show could have become. And if it did had cliches at least make it miniscule so at least that would be considered as passable. But no, they keep spewing more and more and it's just not working for the show. It's just making it look like a child's cartoon series and it's not even working for the plot at all. It's just making it look more cringey as the episodes passed by until some episodes I stated that build up something.\\n\\n\r\nAnother thing the show had in the issue is the Slice of Life aspect. Literally if there is something fishy here is that the show has the mecha genre, but it's more of a Slice of Life show. And even if it had Slice of Life at least add something to the table, but unfortunately the show doesn't add something to the table along with that aspect and it just makes it even unbareable to watch after said episodes. Which this also causes the show to fall because more Slice of Life and less mecha doesn't fit right for this show especially with it's execution. \\n\\n\r\nThe romance subplot is another issue with the show because including with the final episode, it just goes as forced. The relationship between Sougo and Felia does not work at all in any way and the relationship between them does not fully develop and it just feels completely jarring and it doesn't in cooperate the main plot of the show THAT much. It just makes it very retarded also. Including the final episode and this is where I'm going to spoil the show, Kaon gets married with Roman. \\n\\n\r\nOkay stop right there. KAON NEVER HAD LOVED ROMAN! She had feelings for Sougo, so why in the fuck at the final episode we get this? Them getting married and having kids. That seems just as worse as any type of romance I have seen. It just makes the show itself look as stupid as ever. It just makes you look like a dumbass at the end. \\n\\n\r\nThe explanations about Felia are very poor and at the same time very few things would been taken out, but not to the point of making the show understandable enough about her character and why would these people capture her. It's just ridiculous.\\n\\n\r\nThe adventure aspect doesn't work either because they're not putting any purpose to the main plot also, it just makes it look like \"HEY KIDS LET'S GO ON A FUN RIDE TO FIND THE SECRETS OF FELIA!\" Is this Dora the Explorer 2.0? Fuck no. You're telling me that and I would show this to my siblings but I ain't an idiot.\\n\\n\r\nAnd finally the final episode. This is where I said in the prologue \"a big fart bomb full of fuck you to the audience\". Basically, nothing makes sense to the series and at the same time the ending just fucks off the audience with what I stated about the romance subplot, and that was in the finale, not to mention Felia just disappears and then Sougo turned into a fucking balloon, because that's how I personally perceived in the series. He turned into a big party balloon monster. Which was bad, and made no fucking sense. \\n\\n\r\nThis is one of those endings where you basically go and ask about life itself in a nutshell, and which is why I said the show has a lot of issues and it's pretty inconsistent, cliche as fuck, underdeveloped and also, a dumb as fuck ending which leaves just a big label as a dumbass. \\n\\n\r\nIn the end, the only things I can give the score for the show or the pros is only the build up and foreshadowing the show did, other than that, the story writing is confusing, cliche, not well done, everything was done poorly, the romance was forced, and the ending was shit.\\n\\n\r\nCharacters:\\n\\n\r\nAnother thing that's probably the second bad component of the show is the character department. Simply put the characters like reading the whole Encyclopedia. Yeah, that's how boring they are. Not only that they are boring, but they are so underdeveloped that it makes me feel like this show was making a fun of everyone.\\n\\n\r\nAll of them are just bland and not that very interesting at all except for one of the character who's not the main ones. But getting straight into the point I guess we should describe the characters I guess.\\n\\n\r\nSougo is your stereotypical protagonist that has no type of personality. He's just as uninteresting as an empty headed brain, or a shell. He's just there for the sake of being there and it's just piss poor to see it, not to mention he doesn't really develop at all.\\n\\n\r\nFelia also known as the main female protagonist, is nothing more than a cutesy moe character. Reasons being would be that her character isn't fleshed out and her development was poor as well, not to mention that the fact that we didn't found much info about her and why these people would go after her in the first place, and even if they did explained it doesn't fully get to understand her more. It's just ridiculous.\\n\\n\r\nThen we have our main compañeros of this trope of friends Kaon, Roman and Otto, who simply are bland as clay and paper mashed together and it hurts badly to say that. They're just completely unnecesary to even have them in the first place, not to mention that BY THE END OF THE SHOW which I stated about the romance subplot being completely forced it makes the show just as retarded as it should be.\\n\\n\r\nAll of these main characters with the exception of one are not fleshed out at all and not really characterized, they are as bland as my chocolate cake that I am eating during the time I'm writing this review. They're just bland as hell and the fact that also their motivations are just thrown there like rocks.\\n\\n\r\nThe ONLY character I would care about is Moura, which I personally liked the little guy and at least that character was more likeable than any of the cast, but that's not an accomplishment.\\n\\n\r\nOverall the characters are one of the second worst component of the show and that's saying something.\\n\\n\r\nArt/Animation:\\n\\n\r\nI will say on the positive side the production quality of the show isn't really that bad. The art style/visuals of the show seems rather moe and cute with standard backgrounds but that looks at least decently done, as for the color quality it's not really bad, but not great. It's more like standard to say the least. \\n\\n\r\nThe Mecha designs actually are very nice looking, but when it comes to the fights I guess the mechas are very inconsistent considering having CGI that just depends on how they do it. Other than that I think it's mediocre.\\n\\n\r\nCharacter designs look very nice although a few are very generic and not one of the most well looking ones to say the least.\\n\\n\r\nAnd the 2D animation looks very decent to say the least, not really a bad case to be honest.\\n\\n\r\nMusic/Sound/Voice Acting: \\n\\n\r\nNow the music department isn't really one of the most good composed ones in this season, I think it's pretty mediocre. Song is forgettable but the soundtrack in itself sometimes fits with the scenarios and at times it just doesn't to say the least.\\n\\n\r\nSound department in a way is pretty meh compared to other shows that have the sound department approach. It wasn't something Kaboom and Blam but it's not something like I would go and hold my ears like my mom's shitty singing.\\n\\n\r\nOpening for the song is composed by Fhana (she sang the OPs such as Boku wa Minna Kawaisou and Fate/Kaleid OP3) and the show is of course jolly and happy song, which is really nice and wonderful to hear.\\n\\n\r\nAs for the Ending song... I think it's not one of my favorites. Sure it's not like I would call it shit however the song doesn't go towards my taste in the end of the day.\\n\\n\r\nFor the voice acting I would go and say... it's of course stale, just stale but at the same time a few performances for me were done pretty decently despite the voice acting not standing out as I thought.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nI would personally not deny that I of course enjoyed the show in some areas, but on the other hand it's pretty mediocre to say because at the same time the moments of the show were just untolerable. It's really something. I enjoyed the artstyle and some of the soundtracks, and the Opening, other than that in the end the show went to a train wreck that would kill every body in a second.\\n\\n\r\nOverview:\\n\\n\r\nComet Lucifer is the prime example of trying too much that it epically fails on so many levels, that it's just so cringey that it also makes the show too childish to watch.\\n\\n\r\nThe show doesn't work as a mecha because it doesn't execute them properly.\\n\\n\r\nThe show doesn't work as a romance because it was forced that it looks completely stupid\\n\\n\r\nThe show doesn't work as an adventure because those moments are not really adding much as much to the main plot\\n\\n\r\nThe show doesn't work as a Slice of Life because the way they're doing the aspect is really cliche and it doesn't add anything to the plot.\\n\\n\r\nThe show executes the plot poorly that in the end leaves into dissatisfaction.\\n\\n\r\nThe ending of the show is really shit and it just breaks the show in it's entirety of what it build up (which was minor).\\n\\n\r\nIf anything, Comet Lucifer only had a few redeeming qualities that saved the show from being a 2/10, at the very least. In the end, the show is one of these that wasted what it could have been decent.\\n\\n\r\nWould I recommend it? No I wouldn't. In fact, go and skip this one in my eyes, unless you want to see it just for the entertainment. Just... wasted potential.",
            "date": "2015-12-21T12:15:00+00:00",
            "helpful_count": 37,
            "mal_id": 206305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=206305"
        },
        {
            "content": "I don't normally write reviews, but I couldn't resist doing one after watching comet lucifer. lets get into it.\r\nStory: Honestly, I barely even know what the story is. Here is my attempt at explaining it: his boy, Sogo, finds this girl named Felia(and its never really thoroughly explained how... she just kinda comes out of this gem) and takes her in. For some reason (also never really explained) the government wants to capture Felia. Sogo goes on adventures trying to protect Felia and help Felia adjust to this new world. \r\ni have quite a few problems with the story of this show. First of all,I didn't even know WHY all these people were trying to capture this girl until the 10th or 11th episode, and even that didn't really explain why people were trying to capture her earlier. all i can assume is it was because of Felia's magical powers. But then again, I couldn't even really figure out her powers, because those were never really explained either. so basically, it was a bunch of fighting, and I had no idea what the point of it was.\\n\\n\r\nSecondly, I felt like the story kept trying to switch genres, and I felt like none of them were done well. For the first 5 episodes, it felt like it was trying to be a slice of life for the first 10 minutes of the episode. But it wasn't good slice of life. Later there was some romance (very cliche romance). there was even a hint of ecchi in one of the episodes. it was all over the place.\\n\\n\r\ncharacters: honestly, i disliked most of them.\\n\\n\r\nSogo: the generic \"i must save everyone\" guy. He didn't have much of a personality outside of being self-righteous. Not a horrendous character, but just boring.\\n\\n\r\nFelia: annoying. She was the clueless character who has magical powers but never seems to use them for anything very important. Her voice was also super high pitched which was super duper annoying.\\n\\n\r\nKaon: the girl who realizes she likes the MC after the MC is chasing someone else. she didn't didn't even really have a personality.\\n\\n\r\nOther characters: the creepy pedophile dude whos name I can't remember, Do Mon who was the guy who turned into a badass later but he was too much of a side character, the final bad guy who was there at the end for like and episode and a half, and who wasn't very interesting, and some other generic, lame people.\\n\\n\r\nAlso, there was little to no character development.\\n\\n\r\nSound: there were a few good soundtracks. The opening wasn't too bad either.\\n\\n\r\nArt and animation: it was generally pretty bright. I thought some of the character designs were nice, while others were sorta lame (thinking of you Sogo). Animation was decent. better than the other parts of the show.\\n\\n\r\nFinal thoughts: it was bad. I had to force myself through it and nothing was well explained. Characters were pretty bad. I forgot to mention Moura who would randomly yell JAMON!!!! every 3 seconds which was annoying as hell. I only kept watching it because it was laughably bad, and i wanted to say I had lived through it. You probably shouldn't waste your time with this show.\\n",
            "date": "2015-12-20T15:47:00+00:00",
            "helpful_count": 32,
            "mal_id": 206182,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4609409.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/snapeftw",
                "username": "snapeftw"
            },
            "url": "https://myanimelist.net/reviews.php?id=206182"
        },
        {
            "content": "Comet lucifer is a Mecha/slice of llife/Romance/Fantasy anime. You probably could cram in a few more genre's. At only 12 episodes, this obviously results in problems.\r\nstory: 4/10 \r\nwriters essentially said \"let's make it up as we go along.\" That pretty much sums it up. Then they noticed it was almost over and crammed in an ending. And added the final villain because the show kept hinting but never showed one. Who started getting development halfway through the last episode.\r\nArt 8/10 Unique and pretty good. \r\nSound 7/10 Decent but not very memorable. It was just \"there\".\r\nCharacter 4/10 very cliche and forgettable. Mostly consistent though.\r\n6/10 overall\r\n watchable.Art was best thing about this.",
            "date": "2015-12-20T18:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 206204,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3621113.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/citizen169",
                "username": "citizen169"
            },
            "url": "https://myanimelist.net/reviews.php?id=206204"
        },
        {
            "content": "THIS REVIEW CONTAINS MINOR SPOILERS.\r\nThis is my first review, mostly because this show was awful enough to warrant it.  I thought about dropping it a few times, but I decided it would be best to just push on through to the end.  Man was that a bad idea.\r\n[b]Story[/b]\r\nThe main reason I watch anime is for the story.  Tell me a good story and I'll love you and probably buy some merch.  This story was rushed, didn't flush out ANY real details (because it was rushed), and by the end you were scratching your head wondering what the hell you just watched.They left so many loose ends you would think you were trying to brush Felia's hair. (note: I don't understand how women's hair work, I was just trying to make a dumb comparison)\\n\\n\r\n[b]Art[/b]\\n\r\nHey, it looked pretty.  I'll give it that.  But the random mecha?  Seems kind of forced to me.\\n\\n\r\n[b]Sound[/b]\\n\r\nWell it wasn't awful enough for me to notice.\\n\\n\r\n[b]Character[/b]\\n\r\nLiterally only one character got any real tangible development and that was one of the side characters.  You got random backstory for a few mostly background characters, but the others were basically left as useless fodder.  The main characters (Sogo & Felia) were as dull as they come.\\n\\n\r\n[b]Overall[/b]\\n\r\nThis season was full of trash and this one was a prime example of it.  I feel like a masochist for watching it all the way to the end.  Fingers crossed next season is better.\\n\\n\r\nMINOR SPOILER: this is thinly veiled eco-BS.  You'll see it very clearly in the last episode and that's what dropped my score for this show from 5-6 to 3.  If you're going to push an agenda, don't shove it in my face like this.",
            "date": "2015-12-20T16:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 206186,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287906.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lumilias",
                "username": "Lumilias"
            },
            "url": "https://myanimelist.net/reviews.php?id=206186"
        },
        {
            "content": "\"I am Mora, I will never explain anything and will go robot and back at random moments. And lose all the time.\"\r\n\"I am psycho killer, I will kill room full of people, but then imprison one guy in a room with open ventilation shaft. And then go into robot to kill this guy with giant knife.\"\r\n\"I am military guy. I want to fight robot. I will hire psycho killer and pathetic hacker and kidnap a girl. And jump into robot asap.\"\r\n\"I am Sougo. I do not care who Felia is. I never question Mora. I never care why my hand lights up when he becomesrobot. I will run and cry 'Felia, Felia', even if they have automatic gun shooting at me.\"\\n\r\n\"I am Felia. I will cry 'Sougo, Sougo' and emit purple light.\"\\n\r\n\"I am Typhoon. I will rain a bit. Then snow a bit. Thus prevent ultra high tech aircraft from landing. Then disappear.\"\\n\r\n\"I am mysterious ruling organization of astrologers. I will appear at random moments to make you feel this show have a plot.\"\\n\\n\r\nComet Lucifer is one of those shows that wasted great potential by having terrible writing.  My first impressions on the show were very exciting; I felt like with the crossover between childish fantasy and sci-fi, there might be plot elements that, you know, actually immerse you into the show.  However, there are so many holes in the writing that I hardly want to call it a \"plot\".  I find myself constantly being pulled out of the story.  The following examples contain spoilers, but really they're not important spoilers because the plot was already undercooked.  \\n\\n\r\nSo, we already know that this show is basically about a guy named Sougo who likes to collect crystals, and one day when down in the mines, after falling to near-certain death, finds this child, Felia, and a robot named Mora along with a crystal which is under-explained like almost everything in this series.  Actually, Mora is a sort of rock-like thing that talks and transforms into a robot.  It was kind of cool having a mysterious aspect about him and I could have accepted it if later on, the writers wrote in some important themes regarding said robot.  They only kinda did.  Anyways, Felia is like, the embodiment of the Earth, and theyre now on an adventure to find the Altar of the Abyss.\\n\r\nFelia, at this stage, is just a child.  She's cute, but absolutely useless.  Her only vocabulary is \"Sougo\" and she floats and emits purple light.  It would seem like she has a connection to Sougo's crystal, which has a connection to Mora but I can't really say.  In their \"adventure\", so much stupid shit happens that it's as if the writers were just Creative Writing students from your local primary school.  \\n\\n\r\nFor example, these bad guys who are after Felia, offering no explanation as to why they want her instead of the crystal, which apparently can replace the entire world's energy source.  No mention of getting the crystal comes from them, by the way, they just want Felia.  Of these bad guys, we have a dude who is crazily infatuated with Felia, a young psycho with decent combat skills, and a veteran soldier-type guy, and thats really all you get to know about them.  The veteran-type gets a few flashbacks to his previous life and you learn things about him that don't ever end up really tying to the story.  Anyways, crazy infatuated bad guy hacks into the power grid and sends robots after Sougo and Felia.  He starts shooting at Felia and Sougo whirls through bullets, without Mora, to save her, as he does NUMEROUS TIMES LATER.  In another episode, young psycho captures Sougo, and though he had no problem killing many people before, he just locks Sougo in a room with an open ventilation shaft which Sougo doesn't find or crawl out of until he's been in there for a very long time.  He gets the shit beat out of him and immediately after just opens up the ventilation shaft, and somehow finds Mora in there.  I guess he tracked the crystal, which is still in Sougo's pocket.  He crawls through, gets out, and again starts running through bullet showers screaming \"FELIA! FELIA!\" and somehow makes it... Later on, Felia uses some magic to save herself and Sougo from falling to their deaths, and she matures.  She grew about a foot and expanded her vocabulary beyond \"SOUGO!\"\\n\\n\r\nIf you haven't even started this series (please don't), you might have no idea how quickly Felia's use of the word \"Sougo\" gets old.  I counted 39 times before I decided to stop, in one episode alone.  However, because she matured, she became more bearable, and she actually is pretty cute.  From that point, I thought they could be foreshadowing a sad ending, so I continued watching.  Later on, I would experience dumb shit like.... like when they stopped by a town where a wedding was going on, somehow becoming involved as flowerboy/flowergirl (Sougo/Felia, making Kaon jealous... Oh did I mention that this girl Kaon has been tagging with them too?).  Anyways, in the end, theyre raided by the bad guys, and after they have to fight Mora and another robot belonging to an insignificant character, the villagers start throwing pebbles at them and theyre all like \"FALL BACK! RETREAT!\"  That was jaw-droppingly stupid, but I'm dead serious.  Then more stupid shit like when one guy, Do Mon, is picking out food to eat and he's like \"Oh, this looks like a [so and so] fruit!  It might not be poisonous if i cook it,\" then proceeds to take a head-sized piece of it and chop it and serve it.  Then there's also the time when Felia, Sougo, and Mora break off from the group to go alone to the Altar of the Abyss, knowing there will be soldiers crawling around everywhere, leaving the group including Roman and his battle-grade mecha behind.  Another fucking Mecha would probably be very useful, yknow?  At this point in the series, which is like 8 episodes in, Sougo still doesn't know how to use Mora.\\n\\n\r\nAs far as the characters go, I went through most of this review without mentioning Kaon, Roman, his brother I don't care to know the name of who has been around this whole time, and Do Mon.  Kaon is a \"girl next door\" type to Sougo, and has obvious feelings for him, but is so generic about it.  She pretends, embarrassingly, not to like him, then wonders why Sougo is getting so involved with Felia.  She has an arranged marriage with Roman, a flashy dude and the only character who is a little interesting.  Do Mon is Sougo's father figure, who has to put up with Felia when Sougo brings her in, and she does that god awful dancing vegetables thing.  \\n\\n\r\nBy the way, some of you might have heard of the dancing vegetables.  Yes, the show spent a few full minutes on having Felia make vegetables float around and dance in the air.\\n\\n\r\nSo, please, don't be like me watching the whole series.  What is there to gain from it? +1 on your list?",
            "date": "2015-12-26T01:18:00+00:00",
            "helpful_count": 9,
            "mal_id": 206823,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2899499.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/resinweber",
                "username": "resinweber"
            },
            "url": "https://myanimelist.net/reviews.php?id=206823"
        },
        {
            "content": "You know one anime myth that really needs to die in a ditch? Original shows can always be counted on to be better than adaptations. How in god's name does that make any sense in any sort of capacity? First off, you're basically saying that every manga, novel, visual novel, and light novel out there is shit with that statement, and whilst I definitely agree that finding something good in the latter two categories is about as hard as finding a good Crash Bandicoot game after he left Naughty Dog, any hack writer wanting to create an original work of art can make the samemistakes they did - especially when they're visual novel writers themselves. Second, you don't honestly believe that Ghost Hound, Galilei Donna, or Yatterman Night are good shows, right? Seriously, let me look at your favorites list, and I'd better not see those shows on there.\\n\\n\r\nOkay, that's a bit of a harsh introduction, but I seriously have no idea why anyone ever thought Comet Lucifer had potential when it showed up in the first place. Just because it borrows many elements from successful adventure anime like Eureka Seven and Castle in the Sky? How is that a positive if it doesn't execute any of said elements with any sort of flair at all, particularly with regards to its horrible characterization? You remember in the first episode of E7 when we first see Renton, he's established as a kid who hates his life due to his father's legacy giving him unwanted attention along with his grandfather putting down his dreams? When we're introduced to our main character, Sogo, we literally learn nothing about him besides the fact that he collects rocks. He had no dreams. He had no troubles. How am I supposed to believe he can carry a show if you don't give me anything interesting about the dude that's non-cosmetic?\\n\\n\r\nWhat you don't do in an attempt to make us believe he's leading man material is to drop a magical girlfriend in his lap, who sweeps the awards for \"worst anime lead female\" in every category imaginable. Most Irritating. Most Convenient Plot Device. A bunch of other categories that I won't name because doing so will cause me to projectile vomit on the screen I'm reading whilst typing this. The show doesn't even give us a good reason for why she's the catalyst for Sogo's journey to exist in the first place. She has telekinetic powers and a magical mustached pet that can turn into a mecha or a scantily clad female depending on what the writers want to show off, but Comet Lucifer doesn't do a good job of explaining why the bad guys want her abilities considering it takes place in a fantasy world where robots and powers are treated about as normally as a Hispanic window cleaner. So if we don't know why the bad guys are after the good guys and we don't care about the good guys on account of them not having any story or interesting character flaws, then who is supposed to anchor me in regards to what's going on?\\n\\n\r\nComet Lucifer is hard to really criticize properly because it's just bad in all the most basic ways. It's a textbook definition of a \"lacking\" product - full of cliches and never pushing them to anything it can call its own, like it was written by someone who's a fan of adventure anime but didn't get what made them good. The mecha fights are as fun to watch as an action scene in a Jon Favreau movie, and the journey as a whole is just not very interesting. It takes an unusually long time for the characters to even leave their hometown to begin with, and said journey itself is padded with so many inane slice-of-life scenes that don't add to the story in any significant manner when they should be spent on giving me a reason to care about the journey. The bad guys don't even seem to be doing all that much evil when they're not threatening our heroes to begin with. Not once did I ever see them do something evil that didn't involve trying to capture Felia, and they don't even hurt innocent people or cause significant collateral damage in the process. For all we know, maybe they're the police and Felia is secretly a wanted criminal on accounts of mass murder and being criminally mundane.\\n\\n\r\nAnd whenever something resembling personal stakes does occur, it always happens to the adult characters who don't have much screen time and whose story is mostly just told to us whilst being completely nonsensical in the process. For example, there's this old man named Do Mon who failed to protect Sogo's mother during his time as a soldier, forcing him to take Sogo in whilst the kid cursed his existence for years due to said failure. Fair enough, although the fact that Sogo forgave him by the time the series started takes away some of the impact of that scene, but then there's this idiot soldier named Gus who wants to kill Do Mon for retiring from the military even though he was a hardened adult war veteran at the time the old dog took his leave. No seriously. That's all we know about his grudge, and it was mostly told through whining rather than actual imagery. Although given how Gus consistently fucks up even the most basic of soldier tasks on account of his mentor not being around to teach him how to do them properly, perhaps it's understandable to a degree, but that would then put into question how he managed to stay in the military so long to begin with. This all leads up to Do Mon's death (spoilers) at the hands of an alien creature who looks just like Sogo's mother, but considering his connection to practically anybody in the show was as poor as restaurant Wi-Fi and said death being caused by everyone - including him - being a complete moron, it falls completely flat on its face.\\n\\n\r\nSpeaking of everyone being morons, the entire story gets particularly unfocused in the end because the writers had as much of a grasp on the story as I did when it came time to wrap things up. 95% of the villains suddenly switch over to the good guy side for no real reason and when the show finally reveals why Felia is so important in the first place, it turns out that it's because an alien was behind everything. No seriously. That's it. With no foreshadowing whatsoever, it turned out an alien crash landed on Earth and manipulated the main bad guy off-screen so he could use Felia's powers to turn Earth into the new Krypton, General Zod-style. Said bad guy never questioned the plan once in his life, and thus has no one to blame but himself for killing the people who warned him when said alien turns out to be just as evil as he looks. What's that? Why yes, that is my suspension of disbelief melting in the sun. Why do you ask?\\n\\n\r\nAnd just to add insult to injury, the finale is more rushed than a shotgun wedding in the middle of a snowy blizzard. Characters suddenly declare they love each other for no reason and there's an environmental message at the end that's so ham-handedly crowbarred into the narrative it probably would have sent Hayao Miyzaki into a fit of laughter if there was anything worthwhile to laugh at in regards to Comet Lucifer. In fact, why am I devoting my precious time and energy to this worthless show in the first place? Why don't I just end this review right now and go eat some M&M cookies?\\n\\n\r\nSo in conclusion before I cover myself in crumbs, Comet Lucifer is a worthless show that rips off much better anime you could be watching instead, and I advise you to forget it ever existed, as well as realize that that \"original shows being more interesting than adaptations\" mentality is about as truthful as the lawsuits against Borat.",
            "date": "2016-01-29T12:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 209623,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1147547.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Flawfinder",
                "username": "Flawfinder"
            },
            "url": "https://myanimelist.net/reviews.php?id=209623"
        },
        {
            "content": "The first three episodes didn't made any-sense while they're trying to introduce the mecha and the type of mecha they're evolving into. So, to say, that you need to have a hand signature on your body to release both \"Mecha like human\" and the other creature to transform into a mecha?! This story reminds me of Kakumeiki Valvrave with the hand signature but, it's on the neck instead.The character's are dreadful as if the main character doesn't know what's going on with the crystal. Why did he said \"Now I finally know what my mother want\" or something like that in Episode 1? Does heknow what he found? It seemed like he known about mecha's but at the end of that episode, he surely didn't know much about crystals rather than finding them. I thought he was going to take his hobby that he has interest in with the crsytals to use that with the mecha to understand them better but he's just another clueless character role that doesn't make any-sense. Even the other characters are clueless. The only character I could appreciate for not being clueless so far in this episode is; \"Do Mon, Hajime\". The sound effect is dreadful as each explosion hits. My, that will hurt your ears badly. It's worst than Valvrave's drone effects. But, I could give a different mecha a try but the characters seem so basic. Why must the main character know how to use the mecha but doesn't understand anything about it?! Please stop this formula.",
            "date": "2019-03-07T10:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 303061,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4553541.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Cerenebus",
                "username": "Cerenebus"
            },
            "url": "https://myanimelist.net/reviews.php?id=303061"
        },
        {
            "content": "First review I'm writing on this site. Honestly, this shit was predictable but also all over the place. Besides the art, which is pretty great, the story was rushed and definitely generic. Most Disappointing of 2015 for me personally. I already felt like I was getting tired of these particular types of anime but man did this one leave a sort of bad taste in my mouth. Even if you love this genre you will still find this anime to be average at best even painfully so. I honestly felt like i should've dropped this series a while ago. I writing all this and yetI realize that I still don't even get what the point of Comet Lucifer was. Was it really just to show off some pretty good background art cause that was the point they nailed it but everything else is \"meh.\"",
            "date": "2015-12-21T23:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 206379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3873959.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/FireclownZZ",
                "username": "FireclownZZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=206379"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\n(WARNING: This review spoils various parts of Dante Alighieri’s Divine Comedy, an epic poem that he constructed in the 14th century. His work is regarded by many as one of the greatest pieces of literature ever created. If you do not wish to have Dante’s magnum opus spoiled, read no further. Or, as Dante may write, “turn back to see your shores again.”)\r\nComet Lucifer is like Satan.\r\nBefore completing that simile, we need to define Satan first. In Dante Alighieri’s masterpiece, Divine Comedy, and, more specifically, the Inferno, Dante travels through the depths of Hell and(surprise surprise) he encounters Satan.\\n\\n\r\nLong story short, Satan is eating specific souls (three to be exact) who have committed the most egregious of sins. But this is Satan we are talking about. Instead of simply eating them right away, he gnaws on them. He crunches on them. He bites on them. For eternity.\\n\\n\r\nBack to the simile. Comet Lucifer is like Satan. When it catches you in its maw, it feasts and feasts and feasts until your brain is crushed and your sanity vanishes. Yet, even then, it feasts.\\n\\n\r\nSTORY\\n\\n\r\nTechnically speaking, Comet Lucifer is not the devil incarnate. But it is not a stretch to say that it would have been better off being the literal representation of all that is abysmal than what it ended up as.\\n\\n\r\nThe anime did not start off in such dire straits. If one were to be completely fair, it was actually doing all right before hitting the halfway point of its life. The first four episodes gave the audience its lovable troupe of characters. The episodes gave lots of robots. And the episodes gave a strange world with an even stranger plot. A grand adventure awaited.\\n\\n\r\nThen episode five happened, and all hope had to be abandoned.\\n\\n\r\nAt the first circle, Comet Lucifer encounters the ghosts of repetition. Fights with robots constantly occur, but most frustrating of all is how the gang almost never comes out on top. Moura gets beaten, the others are tossed around, and then the plot resets, causing the loop to occur once more.\\n\\n\r\nAt the second circle, Comet Lucifer encounters a storm caused by subpar writing. Rather than having interesting dialogue or purposeful monologues, the words exchanged mostly boil down to lots of “Sogo…” and “Felia!” These cries, as it were, are difficult to love.\\n\\n\r\nAt the third circle, Comet Lucifer encounters an icy torrent of subplots. Apparently there is a war that had been fought. Apparently there is a council that watches over the world. Apparently there is new science. “Apparently” because these subplots go so unexplained that it is hard to tell one way or another.\\n\\n\r\nAt the fourth circle, Comet Lucifer encounters boulders that disrupt its pacing. Sometimes the narrative moves quickly from one area to another, and other times the narrative slows to a crawl. Either way, the boulders are always around.\\n\\n\r\nAt the fifth circle, Comet Lucifer encounters a morass with Do Mon’s episode. His entire side mission – talking to Gus, then getting shot, and then rushing all the way to Zoneboyle, only to end up at a random graveyard to get murdered – is nonsensical and hard to wade through.\\n\\n\r\nAt the sixth circle, Comet Lucifer encounters wicked flames. While wrapped in fire, it tries to escape by information dumping an absurd amount of details, like the concept of physical angels and earth-bound seeds. Of course, the attempt is to explain Felia’s origins. And, of course, the attempt fails.\\n\\n\r\nAt the seventh circle, Comet Lucifer encounters blood and a forest and runners that each get in the way of the central conflict. The characters are driven by their want to protect Felia. But since they never seem to be able to do that, and, in the end, she is not saved (in fact, she does the saving) made the whole plot impossibly pointless.\\n\\n\r\nAt the eighth circle, Comet Lucifer encounters a Malebolge filled with various maladies. Sogo getting beat up beyond what a normal person can take, yet still he walks around as if nothing happened. Felia growing up only once instead of multiple times. The final, true antagonist appearing out of nowhere. The original antagonists turning into nice guys because why not. And the whole trek to the Altar of Abyss meant absolutely nothing since the conflict moved back to the city.\\n\\n\r\nAt the ninth (and final) circle, Comet Lucifer encounters a sea of ice so slippery and so cold it trips and it freezes. Here, the final message – love saves all – has its heart in the right place, but since Sogo and Felia did not have enough moments alone together, let alone romantic moments, the message lays supine rather than upright.\\n\\n\r\nWhen Purgatorio is reached and contemplation is had, Comet Lucifer admittedly had an interesting idea: the death of Earth’s angel causing Earth’s guardian to attack Felia, Gift’s angel.\\n\\n\r\nUnfortunately, getting to this idea requires a figurative trek through Hell.\\n\\n\r\nANIMATION\\n\\n\r\nIn order to get to the eighth circle of Hell, one must ride upon Geryon, a malformed beast made up of three creatures: a human, a lion, and a scorpion. While the beast is ugly, it is not without its own beauty.\\n\\n\r\nComet Lucifer is similar when it comes to its actual animation and artistic direction in that it is a hodgepodge of parts with flashes of brilliance.\\n\\n\r\nLooking at the animation first, it is not impressive. Besides the CG robots quarreling time and again, the rest of the animation within the show is low. Flapping clothes and hair in the wind is as involved as it gets.\\n\\n\r\nSpeaking of the CG, it manages to cross the river Styx without too much trouble (dancing food notwithstanding). The robots have cool designs – especially Moura’s – and their movements are realistic and varied – flying, swinging, and jumping.\\n\\n\r\nThe art is like an angel that comes down to help for a brief moment then disappears, never to be seen again. Most of the art is comprised of clouds and cliffs and corridors. Yet, occasionally, the anime provides a serene look over the nearby plain or fills the screen with bountiful colors. Sadly (and again) these moments are not around enough.\\n\\n\r\nAnd as far as the character designs are concerned, they, too, are rather boring. Sogo wears a giant monocle in his hair. Roman’s hair is dangerously red hair with a weird yellow streak going through it, but at least he actually looks like a pompous, rich dude. And the (original) antagonists wear a lot of dark colors to appear evil.\\n\\n\r\nThe only characters that seem to receive some attention are Felia and Kaon. The former looks like a dainty, flowery ballerina with color-changing hair and the latter’s ribbon, pink jacket, and jean shorts make her attractive.\\n\\n\r\n(Also, a special, negative shout-out to the ending track that plays during episodes six, seven, and eight. The scrolling effect is lame and is made lamer by Zoneboyle’s silly depiction and the cow floating on a cloud.)\\n\\n\r\nCHARACTERS\\n\\n\r\nIn the area between the fifth and six circles of Hell are the walls of the city Dis. The walls are guarded by harpies and, more importantly, Medusa. Medusa is known for her ability to turn any man to stone who looks directly at her.\\n\\n\r\nThe characters of Comet Lucifer are also known to do the same.\\n\\n\r\nSogo is supposedly the main protagonist of the anime. At first, he is trying to find a red crystal, but, after finding Felia, he makes it his mission to protect her. And that is it. He does not have a flaw that he overcomes, and he rarely experiences anything traumatic. The only time he gets emotionally compromised is when Do Mon dies, but, even then, that is through a phone call.\\n\\n\r\nDo Mon’s character is likewise strange. Initially, he seems like an extreme side character, i.e., a character that is there for a small amount of time then disappears forever. But later on in the season, it is revealed that Do Mon has quite the history. He was once a soldier, he used to be a mentor for Gus, and he took in Sogo when Sogo’s mother was killed. (To be fair, him shooting Sogo’s mother’s killer not once, not twice, but seven times, without any trace of emotion, was hardcore.)\\n\\n\r\nHis character is given pretty quickly through flashback and, true to Comet Lucifer’s form, he is quickly taken out. His departure is a bit too over-the-top, but it is his lack of interaction with the other characters – and more specifically Sogo – that make it nigh impossible to relate or care about him. His lasting detail is a notebook of curry recipes that signifies how much he cared about Sogo, but said notebook, like Do Mon, is quickly forgotten about.\\n\\n\r\nThe same can be said for the other main characters. Kaon, Roman, and Otto hardly interact with Sogo, Felia, and Moura because they are never given the chance since, many times, the anime splits them up into these separate groups. The characters also hardly interact within their respective groups. Roman is always spouting the same words to Kaon, Moura surprisingly has little dialogue with Felia despite being her guardian, and Otto should not have even been a character given how he almost never speaks and almost nothing is known about him.\\n\\n\r\nThis splitting of the cast also causes the anime to lose focus on the first group. The latter half of the anime understandably puts focus on the second group, but, since Kaon and Roman only had their base characterizations of being nice and in love with Sogo and being rich and in love with Kaon, respectively, they do not develop as characters whatsoever.\\n\\n\r\nSomehow the antagonists are just as lacking. The main problem here is that are too many. Gus is bent on fighting others and following orders. Patrick is demented due to his need for violence. And Alfred is a creep since all he lives for his Felia, his “mademoiselle.” Gus at least has something more to go off of: He was saved and inspired by Do Mon. But his motivations as an antagonist are weak; all he ever wants to do is get high off of fighting strong foes.\\n\\n\r\nThe other two, Patrick and Alfred, are simply awful antagonists. Patrick has a single scene where he shows off his crazy skills. Afterwards, he is just a scary kid. Alfred gets an entire episode, but it is dedicated to demonstrating his prowess at hacking. He, like Patrick, literally does nothing but get in the way following his introduction.\\n\\n\r\nAll that is left is Moura and Felia. Moura is the comic-relief side character; she serves her role well enough. Felia is found underground (with Moura), and she is taken in by Sogo and Kaon. She is a kid, learning about words and the world around her. She even comes to like the local “cat pigeons” a lot. She is exactly who she needs to be: an inquisitive, passive child ready to grow.\\n\\n\r\nAnd grow she does, but not necessarily in the right way. The anime has her become a teenager near the halfway marker, turning her from a budding kid into a useless protagonist. “Useless” may be an understatement because Felia just exists. She is not so much a character as she is a plot device, moving from location to location only to be chased, carted, and captured indefinitely. Also, the cat pigeons are not brought up again – more incompetency.\\n\\n\r\nFelia getting bigger does actually have purpose, and it is the first semblance of thought the cast receives. Her getting bigger gives her the opportunity to fall in love with Sogo. (She could not love him in the “woman loves man” kind of way because she was a child.) While those opportunities almost never occur (brought up earlier in the “Story” section), not all is lost. The wedding they crash (love), the confrontation between Sogo and Do Mon (more love), and the help she receives from the rest of the group (even more love) expose her to that nebulous feeling. By the end, she comes to understand what love is through the experiences she had witnessed. Meaning, however slightly, she developed as a character.\\n\\n\r\nSadly, it is not enough, especially when she is so useless, when many of these acts of love do not influence or involve her directly, and when the rest of the cast is as abysmal as they are.\\n\\n\r\nThus, who is the best character of Comet Lucifer? The answer is Malvina, otherwise known as Agent Honeybee. Of course, she is not without issues herself: She decides to stop betraying Sogo and the gang once Do Mon dies to make amends for getting Do Mon killed when she could have just not been evil in the first place.\\n\\n\r\nRegardless, why is she the best character? Because she hides her guns and grenades in loafs of bread. That does not make her a well-written character, but it is a pretty rad trait to have.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track is arguably the only strength of Comet Lucifer. Listening to the opening track, the vocalist does a splendid job. Her range and emotion are palpable, and the various shifts in beat and instruments propel the OP forward. The tone is almost too grand for the scope of the show itself, though, and the fact that it is not that catchy diminishes its value. However, the background choir and the hopeful feeling make up for these negatives.\\n\\n\r\nThe first ending track has a nice first half. The clapping, upbeat beat, and lighthearted singing (the “kokoro” lyric is especially fun) match the slice-of-life vibe that the first few episodes give off. Unfortunately, the second half gets lost among the loud instruments, losing the strong start the first half provided.\\n\\n\r\nThe rest of the music is reminiscent of a group of goblins called the “Evil Claws” that roam in the Malebolge. One of their more famous stunts comes from their leader who “made a trumpet” from his butt. That is, he farted – i.e., he played some of Comet Lucifer’s music.\\n\\n\r\nFor example, a bunch of different EDs replace the first. Some are used only once. (They feel more like insert songs than EDs.) Some do not match the tone of the anime at the time. (The ED for episodes ten and eleven uses an acoustic guitar and vocals that makes it happier than the events therein reflect.) And all sadly come off as “the same.” (Their not as stylistic as the OP and the first ED.)\\n\\n\r\nThe other tracks of the original soundtrack are similarly weak. There are quite a few tracks, but many come off as uninspired or lacking diversity, relying on lots of piano, choirs, and woodland effects.\\n\\n\r\nSome tracks, like “So Ugo To Fe Ria” with its peaceful, everyday feel and “Moura To So Ugo” (the best track in the OST) with its jungle, simple feel make a case for the OST. Other tracks, like “Semari Kuru Kyoufu” which is harrowing and “Nukumori No Arika” (without the quartet) which is magical, also try to make a case. Still, these and the rest of the tracks are just not prominent or powerful enough to enhance the viewing experience.\\n\\n\r\nAnd voice acting performances hover somewhere below average. Ayaka Ohashi does not capture the voice of a child. Inori Minase as Moura used a voice that fit for Moura’s stone form but did not fit at all for her human, warrior form. And Rie Takahashi as Kaon had next to no chances to demonstrate emotion.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhen I got to the end of this one, I was surprised that they decided to include an epilogue. It was a kind gesture, but my surprise and appreciation almost immediately turned into disgust.\\n\\n\r\nIn the epilogue, the anime has the gall to show me Kaon marrying Roman. But more than marrying, they had three children together. Three. This girl who is in love with Sogo. This girl who is continually shot down. This girl who watches this faux romantic relationship between Sogo and Felia that has zero basis. She gets shoved onto Roman, the guy she repeatedly wants nothing to do with. And they make it pretty clear that she has slept with him (at least) three times. It is aggravating beyond belief.\\n\\n\r\nThis feeling just about sums up this anime: aggravation. It is aggravating how nothing makes sense. It is aggravating how the cast acts. It is aggravating how something that starts out pretty okay can turn out so unbelievably bottom-of-the-barrel.\\n\\n\r\nDespite me creating a massive, extended metaphor that likens the anime to Hell on Earth, I honestly do feel bad for something like this. Somebody on staff has to realize how messy the whole project is while it is being created. They put a lot of time and effort into this anime, only to have the return be so negative.\\n\\n\r\nAll of the voice acting and all of the music; all of the time and all of the money; all of the animators and the meetings and the advertisements and the promoting – all of it is for nothing. That makes me sad.\\n\\n\r\nAnd it makes me aggravated.\\n\\n\r\nComet Lucifer is about as horrible as they come. The story is awful. The characters are worse. And everything else that surrounds it is not worth talking about. If God does exist and he asks me to choose between Satan and this one, jumping into the former’s mouth headfirst becomes a no-brainer.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, a figurative trek through Hell\\n\\n\r\nAnimation: Bad, Geryon’s offspring\\n\\n\r\nCharacters: Terrible, what Medusa sees when she looks in a mirror\\n\\n\r\nSound: Bad, like Curly Beard playing his “trumpet”\\n\\n\r\nEnjoyment: Terrible, certainly no Paradiso\\n\\n\r\nFinal Score: 1/10",
            "date": "2016-07-23T12:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 224758,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=224758"
        },
        {
            "content": "Ah, adventure.  The act of embarking on and going to an unknown place fills many with excitement, as the prospect of finding the unknown has thrilled the human psyche with lots of determination to find what's out there.  And so, with Fall 2015 coming to a close, we have Comet Lucifer, an original anime by 8bit, which…well, it’s an adventure all right.\r\nStory: Amagi Sogo is a boy who lives on the world of Gift, a world that looks like a more magical version of our planet and has a bipedal armor (aka mechs) that make the world more technologically advance than our own.Upon one day after helping his friend Kaon escape getting chased by her fiance arranged by their families (you know how that goes.  And yes, this is what happens in the first episode), he stumbles upon a red gem that turns into a little girl, and a lizard mech that embarks Sogo and his friends on an adventure to find out the secrets of this world.\\n\\n\r\nNow, to start off, and just to put it out there, the plot of this anime is pretty lackluster.  The entire series revolves around Sogo trying to find out who and what this little girl who came out of the stone, named Felia is.  In doing so, the show just kind of makes everything fall into place.  Characters become relevant because they have some kind of connection to someone else, and Sogo and his friends especially just follow along with what's happening.  The entire show is basically plot driven to the point that the entire cast just follows along like a lost puppy with what's happening.  All of the antagonists' goals are pretty straightforward so there's a convenient reason to continue with this show, and there just isn't much to care about as a result.  \\n\\n\r\nThe other major issue with the show is the whole mystery that there're trying to put around Felia.  Why are there so many people going after her?  Why does this team rocket-like group keep following and chasing Sogo?  Why do we care about Do Mon's backstory?!  (I'll get to that one later.)  The major problem I find is that the show tried to make its mascot character, Felia, extremely important without mentioning why she's important.  She's, in the series, repeatedly referred to as the \"Lima\", but we don't really get a full understanding of that title till the end of the series in the last few episodes, and even then, it's not really all that satisfactory of a conclusion because the show has another issue that it was never able to resolve, change in plot. \\n\\n\r\nAnother major issue is the fact that Comet Lucifer was just never able to cement itself down on a singular plot because it kept bringing up these little subplots that really don't amount of much.  They're so insignificant that the characters that they're tied to don't really matter that much in the end either.  Like, they devote complete episodes to something that doesn't pertain to Felia, and as such, take away from what is going on at hand.  They try to make it a backstory that has importance to the story, but at that point, it's just flavor text that tries to spice up the story.  \\n\\n\r\nAll in all, Comet Lucifer's story is rather lackluster.  Its entire runtime is filled with an adventure filled with subplots, unsatisfactory mystery, and somewhat uninteresting storytelling that the characters are just dragged along to participate in.  The ending itself didn't really help much either because by that point, the whole show was talking about something it never mentioned before earlier in the series, and they did this whole afterstory thing with little snippets of what happens later to everyone in life.  Which is nice, but kind of irrelevant.  (Especially since half of them didn't make sense.)\\n\\n\r\nOverview:\\n\r\n-  Too many subplots\\n\r\n-  Lack of explanation and/or unsatisfactory explanation\\n\r\n-  Kind of predictable, actually\\n\\n\r\nCharacters:  As I mentioned before, the characters of Comet Lucifer are really just people who are just brought along for the ride according to the law of the story.  A couple of them really have no place in being part of the story, and that just sort of bolstered how little I personally cared for them since a good chunk was something the story could've used without.\\n\\n\r\nUp first, we have Amagi Sogo, our main MC.  I'm not going to waste too much time talking about him because he's really just the stand-in person that acts as the protagonist in this whole adventure.  By the law of anime, he is brought along this adventure and continues to do so to create a motivation or anchor to the two characters that actually matter.  He's not really a character; more like an idea, or an allusion to the idea of a main protagonist.\\n\\n\r\nThen we have the two mascot characters, aka the ones that really matter, Felia and Moura.  Felia, as the true mascot character is the 'Lima', as she is referred to many times in the series.  For the most part, she acts as the plot progresser, being the thing that all of the antagonists want for the 'power' that she holds, which only gets half-explained in the series.  Unlike Sogo, she comes into this series as an innocent little child that as time goes on, starts to understand her role on the planet, but even so, doesn't really make her significant in any way in terms of character since she's really just a plot point.  They also try to shoehorn in this romance subplot that is not only forced and pointless, but so unnecessary that it made the series feel worse than it should've been.  And that's saying something.  \\n\\n\r\nThe other mascot character is the little rock snake named Moura, who turns into a fucking lizard/dragon mech.  Moura is the only character that I personally cared about because unlike everyone else, she had a purpose in this series, acting like the protector to Felia and is brash towards anyone (especially Sogo) who is ignorant in what they were handling.  Moura acted like the one person who actually knows to some extent what's going on and really tried to recover the series, especially with her signature '~Jamon' ending.  But even that wasn't enough.  (Sorry Moura, you tried though.)\\n\\n\r\nOther characters include Do Mon, Sogo's protector who had a past that doesn't really impact the story in any way aside from adding background flavor text to the series, Sogo's friends Kaon, Otto, and Roman, who are just cast fodder to make the adventuring group bigger than just a magic girl, a tiny Onix, and a boy, and a whole host of villains and side characters that do as little as you'd expect, adding in their own little motive for doing things that adds as little as you'd expect.  (They even have a team rocket-esque group that just follows Sogo and tries to capture Felia like she was Pikachu.  Come on now.)  \\n\\n\r\nOverview:\\n\r\n+ Moura (and Felia because her tiny form is an adorable chimera of Renge, Chaika, and Shiro.)  \\n\r\n-  Bland and uninteresting characters\\n\r\n-  Character motives are rather pointless and don't serve to do anything but move the plot\\n\\n\r\nArt: The art of Comet Lucifer uses two distinct things during the show.  The first is its normal style which is colorful in its appearance as everything looks rather whimsical and bright.  Its animation quality isn't much different than what 8bit has done in recent years, so there's nothing extraordinary about that.\\n\\n\r\nAnother thing that Comet Lucifer employs is a style of CGI for its mechas.  Contrary to most CGI that's used, these mechs don't look particularly out of place.  They look a bit awkward, but for the most part, they didn't look too too jarring and were tolerable.  Especially Moura, because Moura's design is pretty good.  \\n\\n\r\nOverview:\\n\r\n+  Moura's mech design\\n\r\n+/- Standard animation\\n\r\n+/- Mechs are ok in CGI, but a little out of place sometimes\\n\\n\r\nSound: The soundtrack for Comet Lucifer employed the help of Fhana, the same artist who did the Bokura wa Minna OP (if anyone reading this knows that show), and as such gives us a bright and joyful song that embodies the spirit of adventure that this series tries to instill.  The story didn't do the song justice in my opinion.  \\n\\n\r\nAs for the ending song, well, there's not really much to say.  It's pretty much a generic track that isn't really all that exciting to listen to.  Its bright, it's happy, but it doesn't evoke the same feeling that Fhana's OP song has even if they have similar tones.\\n\\n\r\nOverview:\\n\r\n+ Good OP\\n\r\n-  Meh ED\\n\\n\r\nPersonal Enjoyment: While Comet Lucifer wasn't particularly a show that I thought did what it wanted to, I still couldn't stop myself from watching it week after week.  I don't know, there was something about it that just kept me going.  It wasn't good by any means, but it wasn't something that I stopped myself from watching or dreaded watching week after week.\\n\\n\r\nDid I like this anime?\\n\\n\r\nNot particularly, but I did enjoy Moura's overall character and the opening song.  (Yes, those are the two things I will say I fully enjoyed.  Not so much Felia because of what happens halfway through the series.)\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nThe rest of the characters are uninteresting, the story is so jumbled and messy that it itself doesn't know what to make of itself simply because it's got all of these subplots that take away what little story it has left.  And even when it focused on the main story it didn't do too well.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nHonestly, if you just want to watch something just because you're bored and got nothing to do, I guess this is worth a shot.  Comet Lucifer is a show that tries too hard and succeeds in very little.  Watching it for the sake of watching it is really the only reason I would suggest you watch this show since it's got so many problems and so little resolve that if you think too hard, you're gonna have a bad time.",
            "date": "2015-12-20T17:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 206194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206194"
        },
        {
            "content": "If you do not wish to read all of this banter, just skip to the very last paragraph for a simpler review of this anime.\r\nWell this anime was quite a boring adventure. I had quite high hopes for it because it seemed like it would be all cute and happy, but in the end all I got was an anime with close to no plot and chaotic boringness.\r\nStory [5]:\r\nIf you asked me what the story was about, I would have no idea how to explain. The plot was so chaotic and only at the last episode did I understand a TINY bit what I hadjust witnessed. It was absolute nonsense. At the very beginning I felt that there was some idea the authors had, then they just came up with stuff as it progressed and later on just tried to mash some kind of conclusion. And so, Comet Lucifer was born. \\n\\n\r\nArt [4]: \\n\\n\r\nThe animation and art seemed really, really simple. I felt like there wasn't much effort put in, only maybe at the parts where giant mechas were fighting, other than that it was plain and boring even though it did seem very colorful at times.\\n\\n\r\nSound [3]:\\n\\n\r\nThere is absolutely nothing memorable from the soundtracks. Just nothing. At least it somewhat did it's job to make the mood right, but even so.\\n\\n\r\nCharacter [5]:\\n\\n\r\nVery plain and cliche. We have the same boring protagonist who ends up in a love triangle with a very cliche tsundere. All of the focus was on Felia it felt like the other characters were completely neglected. They were THERE, but accomplished NOTHING. This is what ticked me off quite a bit, because some characters had potential and I liked them a bit, but they ended up meeting a tragic end or just got completely neglected. Thanks a lot.\\n\\n\r\nEnjoyment [4]:\\n\\n\r\nI felt like I was forcing myself to watch this. In the middle I just put this on as some background noise while I was doing other things, but at the last 2 episodes I managed to force myself to finish it. It's not enjoyable at all, it's completely boring. Okay, maybe at some points it was A BIT entertaining to watch, which is why I gave this a 4 instead of a 1, but those few moments do not make up for the absolute crap this show is.\\n\\n\r\nOverall [5]:\\n\\n\r\nComet Lucifer is one of those boring anime's that you THINK would be good, but in the end it isn't. It's very cliche and a perfect example of a messed up plot. Everything can be predicted, which is why the plot twists the anime TRIED to make were failures. If you wish to give this a try, I suggest you don't. It's simply a waste of your time and you should just watch something worthwhile. Something that doesn't sully the 'mecha' genre, like Bokurano or Code Geass.",
            "date": "2015-12-23T05:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 206531,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2684279.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KittyNom",
                "username": "KittyNom"
            },
            "url": "https://myanimelist.net/reviews.php?id=206531"
        },
        {
            "content": "[REPOSTING CAUSE IT WAS REMOVED]\r\nOk, straight to the point. This. anime. is. shit. It is completely and utterly terrible. I forced myself to watch at least 5 episodes. What can I say, it was very hard.\r\nStory : 3/10\r\nThe idea is stupid. Basically the story so far can be resumed too : \"Girl falls on guy, guy finds magic stone, magic stone becomes loli, loli chased by evil organization.\" The guy who came up with the idea \"hey let's make an evil group who have a mech army on their side and a bunch of super trained soldiers chase after a bunch of 15 year olds\"should get slapped. There is nothing to be said, the story is boring and makes no sense.\\n\\n\r\nArt : 7/10\\n\\n\r\nI feel like with recent anime this is usually the mark that saves the final score. The art is well... nice? It seems kind of weird. The character designs are also ok.\\n\\n\r\nSound : 3/10\\n\\n\r\nThe first time ever I rate 3 on sound. The voice acting is just simply annoying. The characters feel bland, liveless.. The OP is terrible for a mech anime.\\n\\n\r\nCharacter : 1/10\\n\\n\r\nOk, sometimes I say that there is literally 1 good character in the anime, and usually it's an exaggeration. This time, the only OK character is Felia, just because how cute she is. The MC, Amagi Sougo, is just a stone wall, one of those \"project yourself onto this guy plz\". Lanchester Kaon has somethings in common with Asuna from SAO, bland, useless and stupid. Mo Ritika Tzetzes Ura, the useless stone thing never gets an explanation why he exists or why the hell is he a mech and how did he get powers and so on. There is literally not 1 single \"good\" character in the entire anime.\\n\\n\r\nEnjoyment : 1/10\\n\\n\r\nI FORCED myself to watch this. Anime is supposed to be fun to watch, a form of media, not a torture chamber. It is impossible to watch.\\n\\n\r\nOverall : 2/10\\n\\n\r\nSaved by the art and the cuteness of Felia, this anime has the lowest score I have ever given. Would never recommend it, it should just be forgotten and never talked about in the anime community.",
            "date": "2016-01-03T16:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 207679,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634819.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Piezuri",
                "username": "Piezuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=207679"
        },
        {
            "content": "Up until the ending I had this show at about a 7/10, ending kinda ruined it for me. It wasn’t a completely terrible ending, but I didn’t like it either; dropped the show from a 7 to a 4 or 5. Don’t want to give too much away, but just know the ending may be a bit of a bummer if you make it that far. \r\nI don’t really have anything else to say because I don’t really feel like putting too much thought into this review, but I gotta reach the minimum review length so I’ll say this to expand on why I didn’tlike the ending:\\n\\n\r\nPotential spoiler (sort of)\\n\\n\r\nI can handle sad endings sometimes, but in general I prefer happy endings. It depends on how the story unfolds and the factors involved. This story didn’t set up in a way that I could really accept its conclusion. It felt like the writers could have very easily given it a happy ending, but they just chose not to; and those are the kinds of sad endings I have trouble accepting. There were so many things left unexplained, and then they threw some half-baked explanation at you in the last episode and that’s why it had to end the way it did. Wasn’t a fan. Kinda feels like bad writing. Either they should have given it the happy ending that would have made sense, or they should have left more details and clues along the way so that the reason behind the ending made sense. But as it is, they didn’t, and it doesn’t.",
            "date": "2019-01-08T00:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 298403,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7468921.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DJ1495osu",
                "username": "DJ1495osu"
            },
            "url": "https://myanimelist.net/reviews.php?id=298403"
        },
        {
            "content": "I feel like I expected a lot more from this anime than I got out of it. For all those who remember the plot of Guilty Crown, I didn't find anything special from the story, to me it was extraordinarily similar, more so at the very end. But there are certainly things that the anime does well, as the story is not the only element the anime has to give. The characters were unique in their own ways, as we see the usual protagonist, and his childhood friend. Some of the characters did appeal to me at times, and character development often took me bysurprise. The anime sometimes did put out nicely animated full fledged fight scenes between mecha's, and I felt it was nicely animated. The colors, art, and animation together balanced the plot in a way, and I stuck with this anime until the end.",
            "date": "2016-01-02T13:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 207584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5054491.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Niudoru",
                "username": "Niudoru"
            },
            "url": "https://myanimelist.net/reviews.php?id=207584"
        },
        {
            "content": "Comet Lucifer's first episode pays homage to some lost animes in the nineties.  The premise for this show is an old trope but the execution that time felt sincere. Also, the first major scene involved well-choreographed fights and beautifully integrated CGIs. While not perfect, it managed to capture the pure fun (and dumbness) of these type of shows and ended with its audience wanting for more.  \r\nThen it went downhill from there. \r\nStory, what story?: 3/10\r\nTo be fair with Comet Lucifer, it presented a very simple premise in the first episode. There is this teenage guy who wants to save his girl fromthe evil forces that be and that girl supposedly contains some magical powers that could save the world. \\n\\n\r\nThe first few episodes might be little jarring because of the mood whiplash (just can a lighthearted tone be a fight scene literally a second later) but is is never bad. Felia might be a bit mentally challenged but their adventure (as well as the totally random fight scenes later) are engaging albeit a bit boring. \\n\\n\r\nOf course, the story will not be complete without your caricature antagonists who appeared out of nowhere just to torment their peaceful days and a power being the power who manages just everything in this show.\\n\\n\r\nSounds like your endearing 90s anime, isn't it? \\n\\n\r\nWRONG, or maybe not if you consider the negatives these shows used to have.\\n\\n\r\nFor the increase in the episode count, the plot was increasingly muddled with unnecessary flashbacks until it tried to mimic the epic failure that was called Guilty Crown. Who would have thought that Sogo would also be involved in the middle of that convoluted plot despite being a mere crystal idiot? Not to mention his tendency to be so stubborn to the extent of being irritating. Oh, his mother was also a researcher who knows Do Mon.. yada.. yada.. and Do Mon is also an ex-officer who knows this goon yada.. yada.. ZZZZ...\\n\\n\r\nComet Lucifer also used too much anime physics for the suspense of disbelief of the audience. There are also times where Sogo is in the middle of the war and should've been blasted off by the shock from explosion or be hit by a stray bullet but his main character status protected him from warn. The show did not even bother to explain how on Earth that caterpillar became a mecha and how Sogo was able to operate it with ease. And gasp! That caterpillar is a female with a hideous character design just because the show wants to. Yay.\\n\\n\r\nHowever, those missteps were not enough. Guilty Crown took 22 episodes to be that renown (or notorious) and Comet Lucifer aspired to be like that in a span of 12 episodes. The end result? It was not even close.  It is too tame to be called trashy entertainment a.k.a. Guilty Crown and it is just terrible. The show took itself too seriously to be labelled as guilty pleasure but is offending (and sometimes boring) enough to be classified as one of the worst this year. \\n\\n\r\nComet Lucifer tried to salvage itself in the finale only to show more stupidity when it revealed its main plot. Really? A mecha lost its master so it should find a new one out of envy in any way possible. What is this? A girl stealing some doll from another girl? That was supposed to be a Eureka moment in this show but I was busy laughing with the stupidity that show has just given.\\n\\n\r\nCharacter: 3/10\\n\\n\r\nThe moment Felia woke up sent a distress signal in Comet Lucifer. If you are expecting some extraterrestrial being who is naturally wary after all the mouse and cat chase she is in , then you are wrong. What we get is a girl who acts like a five year old who gave a montage of dancing vegetables in Sogo's garden. Yes. She plays the princess in damsel in this show. Ugh.\\n\\n\r\nSogo, on the other hand, may have earned the most stupid male character lead this year after Comet Lucifer. He decided to save Felia 'just because'  and suddenly fell in love with Felia the moment she transformed into a voluptuous woman. No matter how sexist and stubborn Shiro of Fate/Stay Night is, at least he has a reason doing things in the show. Sogo would just do whatever he wants (and mind you, in an irritating manner) and it cost him a lot in a supposedly dramatic episode for his development. Only to look totally what he is exactly before in the next one. \\n\\n\r\nOther characters were tropes not utilized properly. Do Mon exists for the purpose of flashbacks and feels which fizzled. Kaon is the doomed childhood friend that was not given enough time to flesh her character and Roman's group is in this series for God knows why. The reasons for their actions were never explained and they have an emotional quotient of a rock.\\n\\n\r\nIf you are going to show multitudes of characters, then develop at least one of them. Darn it. It seems like they are mere talking card boards than actual characters. Their world could be gone in an instant and the audience will not care about them. \\n\\n\r\nOverall: 3/10\\n\\n\r\nJust avoid this show. It is not worth your time. This is just bad not even on a guilty pleasure level.",
            "date": "2015-12-23T19:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 206610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4369563.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/samui26",
                "username": "samui26"
            },
            "url": "https://myanimelist.net/reviews.php?id=206610"
        },
        {
            "content": "The series composes a small cast of characters although their roles are all important. Sogo is the easy-going type who can easily make friends with just about anyone. His loyalty is also evident throughout the series as he puts others’ lives above his own. Unfortunately, the guy is really dense and a lot of his actions are questionable at times. Characterization regarding Sogo is generally mild as we barely see his background story. Instead, the show focuses more about his actions in the present alongside Kaon. And that brings up the second point. Kaon can be interpreted as the ‘girl next door’ type. No, I’mnot talking about the girl who flashes their bodies around but rather as someone that continuously expresses interest in the main guy. However, Sougo barely notices her messages. In essence, Kaon is someone fans may feel sorry for especially after Felia enters the duo’s daily life. As the most mysterious character in the show, Felia is hard to accept. She has a childish personality although she matures throughout the series, literally. Her curiosity and mere presence leads her into dangerous circumstances. This is because there are others who are hunting her for their own purpose. As stereotypical as it sounds, the show does make a valid point about this plot direction. More than half of the show involves a mysterious group who are trying to capture Felia that often leads up to mecha conflicts, kidnappings, and threats of death. On the other hand, there are also some episodes that feels more like a slice of life and even a bit of coming age. While the main plot seems to focus on the adventures of the main trio, there are also some focus with Gift and its world fiction aspects.\\n\\n\r\nFor a series about sci-fi, it’s also expected that we see characteristics that are out of the normalcy. Thankfully, Comet Lucifer knows its purpose with some of its mechanics like the mining town of Garden Indigo. The introduction of rare crystals is also an element that sparks interest. And at the same time, Felia’s little friend Mo Ritika Tzetzes Ura (seriously, how do you pronounce that?) looks hardly normal. There’s a mysterious connection that Felia also shares with the cool looking mecha in the series. We don’t find out much about them later on so the story leans to test the patience of the audience. While all of this is going on, there’s also a nice change of landscapes from time to time. As a series with sci-fi, it’s definitely on the right track initially. The occasional comedy can be a hit or miss though depending on your perspective.\\n\\n\r\nHowever, when it comes down to it, the characters holds the series back. Most if not all the characters in the show are generic and hardly distinguishable with perhaps the exception of Felia. Sougo is the nice guy type, Kaon’s romantic interest in her friend Sougo is often met with intentional arrogance, and Roman’s crush towards Kaon is returned with emptiness. If romance was really also sub-plot, then the show failed miserably. Thankfully, that’s not the case but the characters themselves aren’t decently written. The Gift government and their troops are also pretty stereotypical. For a quick run-down the main roster, we have Gus, a guy who just seems to enjoy fighting for the sake of it. There’s also Pack, a young fighter with decent combat abilities but a hot-blooded personality to create trouble. There’s even a guy who is chasing down Felia with a rather unhealthy and perverse obsession. Really now? How can we ever like some of these bad guys for their motivations in the show? They are pretty much like puppets doing the devil’s work. The only good parts can be accepted with occasional characterization such as with Gus’ past life. Otherwise, Comet Lucifer’s characters are like fruit baskets without the fruit. Storytelling gets more and more predictable and pulls out generic ideas from the old book. There’s hardly anything later on that will leave fans good memories about the series.\\n\\n\r\nEven though 8-bit is the studio, Comet Lucifer is a good looking show with its visuals. The world of Gift is colorful and adds curiosity each episode with elements it introduces. The towns, although looks normal like a modern world, are equipped with high-tech gear. The flashy space looking vehicles and scooters can also be fun to look at as we see Sougo utilizes them in a cool fashion. Speaking of cool, the show surprisingly carries over a good amount of action. Each time we see mecha clashes, it’s presented with crisp choreography. The smooth movement and fast paced sequences is legitimately nice to follow. Even their designs looks stylish with each mecha having its own modifications, weaponry, or model. On the other hand, character designs looks typically generic. And although the show lacks fan service, it hardly makes it up when most of its main cast looks like kids that is hard grab attention.\\n\\n\r\nIn terms of soundtrack, the show has its presence but that’s about it. It balances between light and tense depending on the circumstance and responds to it. Both the OP and ED theme song has a colorful idea of presenting itself but hardly else noticeable. And voice mannerism isn’t overly impressive either. Felia’s voice can be a mixed bag as she expresses the childish innocence with a lack of personality. There’s not much to worry about it though as she does mature later on. But in overall terms, don’t expect something to be wowed by for its soundtrack craftsmanship.\\n\\n\r\nIf you came looking for a sci-fi adventure, then there you have it. But if a strong story about a memorable cast of characters is what you have in mind, then it’s better to try elsewhere. Comet Lucifer doesn’t capitalize on the main characters’ roles or motivations in the story. As they face obstacles, their purpose is lacking and often makes us question what if they are heading into no man’s land. While I do like the way this show runs with its world fiction elements, it doesn’t ultimately make it up for its storytelling or weak character cast. And that’s quite a shame, really.",
            "date": "2016-03-02T12:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 212106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3422615.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/walker6",
                "username": "walker6"
            },
            "url": "https://myanimelist.net/reviews.php?id=212106"
        },
        {
            "content": "okay well, here we are at an anime where to me the title has nothing to do with the anime really and it will throw you off.\r\nWe meet a boy, Sogo, who likes rocks and gems, so here he is all alone in the dark cold mines looking for something cool when he finds a red jewel, rushes home and that was that. Then while Sogo is out again, with literally up to no introduction we meet his friend, Koan, who in fact has grown up with Sogo, but we dont find this out till like the last episode..\r\nAnyways moving on, she doesnt wanna getmarries and clearly has a hard on for Sogo, but then they get into this accident that brings them underground where Sogo found this red jewel previously. They wait for help and then they get attacked by some army guy who throughout the whole anime I cannot tell if he was a good guy or a bad guy.. and like yeah.... ANYWAYS, then this girl magically appears out of this stone he found and saves them blah blah blah.\\n\\n\r\nThe next half pf the anime is figuring out where Felia came from while also running away from the soldiers who now want to take her away. Sogo constantly finds himself chasing after the recently abducted Felia while Koan suffers from jealousy issues not wanting to marry her arranged marriage dude Roman. \\n\\n\r\nNext thing you know they're on a great adventure to replenish Felia's godly powers only for her to be taken away.. AGAIN. and they have to go save her. They kinda do.. and then it ends. \\n\\n\r\nWOW.. SUCH A GREAT STORY I CANNOT EVEN HANDLE IT.",
            "date": "2017-09-18T15:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 257956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=257956"
        },
        {
            "content": "Long review short: Comet Lucifer is an example of wasted potential.  What could have been an epic fantasy/adventure turned into nothing more than an insipid kinda romance.\r\nThey won't let me get away with my review being short. *sigh* I hate that. Anywho, the artwork is good. The colors are bright. The writing in the first 2 episodes was tight and interesting. It's like they fired the guy with the plot and the other writer(s) floundered from episode 3-12. I had hope for a few episodes, but it was for naught. When the affable guy turns into a killing machine and the ditz pulls shotgunsout of loaves of bread, \"WTH am I watching?\" It would have been alright had it been funny, but nope. That is the poorly named Comet Lucifer.",
            "date": "2015-12-27T11:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 206988,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1739023.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/dragynfaerie",
                "username": "dragynfaerie"
            },
            "url": "https://myanimelist.net/reviews.php?id=206988"
        }
    ],
    [
        {
            "content": "Well this series was fairly bad. Somehow I had heard good things about it, but I can see it was a mistake to watch it. I honestly feel like I wasted my time. The visuals, character design, and sound were all fairly good. The plot however makes almost no sense, and keeps seeming to change. The characters reactions don't really match what is going on, and more than once something happens that just seems out of line for the concept they were going for. I would not recommend it.\r\nThe sad thing is with the right direction this could have been really good. If they hadtaken the time to really flesh out the characters near the start, and hey maybe actually explain the world a little bit so we knew what was going on, that would be great. As it was I couldn't tell you what the world was like. They'll have old style telephones and radios, someone uses a payphone at some point. Which was fine. Then halfway through the series someone pulls out a cell phone to look something up on the internet.\\n\\n\r\nThey are in SOME sort of country, or city state, or...I don't know. The government is not explained, and they are shown as the bad guys sort of for 'reasons'? There is one character who keeps flip flopping between a really bad person and a really good person and it honestly doesn't match with what I would consider to be human emotions.\\n\\n\r\nAnd there is a part where it tries to be really sad, which almost works, but then they manage to not really give it the attention it deserves and sort of ruins it. \\n\\n\r\nIt tries to be too funny at parts where it isn't, it tries to be a romance at times but then again it sort of ruins it, it tries to be an adventure but doesn't give us enough information so we can't follow it, and it tries to build characters but only gives most of them to us at face value and often changes their entire personality mid way through.\\n\\n\r\nDon't watch it, stay away.",
            "date": "2016-03-24T17:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 213922,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/269513.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/IIEarlGreyII",
                "username": "IIEarlGreyII"
            },
            "url": "https://myanimelist.net/reviews.php?id=213922"
        },
        {
            "content": "The first episode promised a great series. As the episodes pass you realize that all your hopes have been crush.\r\nYou're a loyal follower till the end, towards twelve episodes full of disappointments, a romance based on forced moments.\r\nSpend next five episodes but nothing happens.\r\nHard to start with a couple and end with another. Focus the plot on a love confession that never comes and another love appears only because the script dictates.\r\nA backstory ill conceived, the last three episodes are filled with a summary of what the story should be.\r\nI will not buy the figures of characters that I hate. and you (the creators) havemade me suffer with this series.\\n\\n\r\nA copy of Gurren Lagann from coast to coast, but in the end, a bad copy.",
            "date": "2016-01-04T18:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 207762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5101884.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MatiusLenin",
                "username": "MatiusLenin"
            },
            "url": "https://myanimelist.net/reviews.php?id=207762"
        },
        {
            "content": "Tl;Dr it's a rehashed butchered version of Eureka Seven.\r\nNormally I dont do reviews but Comet Lucifer (CL) is a special case. CL, regardless of its cliche set up and characters, started off great. There was a lot going for it. It could have been one of the greats but instead flopped and started grabbing elements from other series. It tried too hard to be something it wasn't and often times resembled Eureka Seven. I feel like the story was rushed and was bs'd half way through. Mid series you have characters rambling over stuff with no rhyme or reason or even little logic to justifytheir actions. Its only redeeming quality was it's animation and even then it was mediocre.",
            "date": "2016-01-02T11:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 207562,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Geochi",
                "username": "Geochi"
            },
            "url": "https://myanimelist.net/reviews.php?id=207562"
        }
    ]
]