[
    [
        {
            "content": "Story - 8/10\r\nOk. This series started on the \"monster-of-the-week\" formula, so it may be very misleading. Even the sypnosis that a Shikabane Hime must kill 108 corpses to go to Heaven is misleading. The real plot and story has really nothing to do with it. The truth is, this series does provide a reasonable and interesting plot development in the SECOND half of the season only. And the last four episodes or so does have enough plot to build up decent cliffhangers that forced me to watch the raws and chinese subs (instead of waiting for the english subs because of my impatience). But keepin mind that there is a second season that follows up directly, so this whole first season gave me the feeling of PREQUEL to the actual story (which turned out decent)\\n\\n\r\nArt - 7/10\\n\r\nSometimes, the actions are animated in a pretty sloppy way. The characters' design are sometimes too simplistic.But you may argue that it was done intentionally as a more &quot;stylish&quot; way of animation. The colors are all in the range of grey, dark red, black and deep blue, blending into a nice gloomy atmosphere befit of a horror action series.\\n\\n\r\nSound - 9/10\\n\r\nNice fighting music and nice insert songs, opening songs and ending song by angela. The music is very catchy and the voice acting is not bad. Ouri (main protagonist)'s voice sound pretty unique and has a good touch of innocence and tonelessness, befitting his strange attitude towards death (a key element in the plot)\\n\\n\r\nCharacters - 8/10\\n\r\nI would say the characters are decently developped for an anime series. Ouri's evolution is clearly portrayed throughout the series. Makina's realtionship with Keisei is revealed bits by bits in a very good rythmn. At the same time, Makina and Ouri's relationship also evolves with each episode in the SECOND half of this series.\\n\\n\r\nEnjoyment and Overall - 8/10\\n\r\nThe first half was pretty random and generically boring. The second half really redeemed itself. This is series is underrated because the first 6-7 episodes didn't have enough to keep the audience from labelling this as &quot;another generic action series&quot;. Although it is far from being a breakthrough, the second half really made good progress in terms of plot and character development. It does deserve the slightly above average rating of 7.5 to 8 out of 10.\\n\\n\\n",
            "date": "2008-12-25T10:11:00+00:00",
            "helpful_count": 110,
            "mal_id": 10622,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21160.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wakka9ca",
                "username": "wakka9ca"
            },
            "url": "https://myanimelist.net/reviews.php?id=10622"
        },
        {
            "content": "Shikabane Hime: Aka is an anime that deals with the issues of death and life in an interesting manner. However, despite some of this anime's strengths, there were weaknesses littered throughout this series.\r\nThe main thing that the story gives is uniqueness. After being murdered, Makina Hoshimura turns into a \"living corpse\". Armed with dual sub-machine guns, she must kill 108 other corpses in order to gain entry into heaven. She is assisted in this task by Keisei Tagami, a Buddhist priest with links to an anti-corpse group known as the Kougun Cult. The setup of the storyline is rather unusual, and there have not beenmany anime that look at a living corpse working together with a living person to try to destroy other living copses.\\n\\n\r\nThe animatioin was very decent. Each character had their own distinguishable look. The background was very well done and the action scenes are pretty good as well. Gainax is known for creating some of the greatest animation in the industry, but in this anime the art didn't deliver what it could have. Something the animators did very well was creating the mood with the dark animation. You couldn't help but feel scared in some scenes because of the dark backgrounds. Gainax did very well in creating atmosphere.\\n\\n\r\nThe opening theme was very, very good. Other than that the sound was meaningless. I don't remember the sound being a big factor in the anime.\\n\\n\r\nThis anime seems to focus mainly on Ōri and Makina. There was only one character that I truly liked, and it was Makina. She is the main character and a contracted &quot;living corpse&quot;. She is tasked with killing 108 corpses to gain entrance to heaven. She has formidable physical skills and her weapon of choice is an Ingram MAC11 machine gun. Makina starts slow but develops faster than Ōri and by the end of the season she becomes a great character. The main male character, Ōri himself, was really annoying at points. Ōri Kagami is a normal high school boy who was raised at Keisei Tagami's temple. He coincidentally appears at several points where corpses appear and the reason of this is unknown. Ōri is a bland character that slowly develops as the story progresses.\\n\\n\r\nI didn't really enjoy this anime. I kept looking at the time and wanted it to finish faster. It wasn't all that bad. It was pretty confusing but there were a couple episodes that were really good.It was a pretty decent anime. Nothing special but decent.",
            "date": "2009-01-31T09:19:00+00:00",
            "helpful_count": 42,
            "mal_id": 11977,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48866.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ManU-Alchemist",
                "username": "ManU-Alchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=11977"
        },
        {
            "content": "Shikabane Hime&hellip; I wasn&rsquo;t going to do this one either&hellip; seemed a bit too generic. But I bit the bullet and watched it anyway. It wasn&rsquo;t good. It wasn&rsquo;t bad. It was just&hellip; decent. I&rsquo;ll probably watch the next episode to decide if I keep it on my roster for the season. Production values were all right. The OP isn&rsquo;t really memorable, and neither is the ED. The general BGM throughout the show is okay, but isn&rsquo;t really memorable either. It&rsquo;s kind of a shame that music isn&rsquo;t memorable at all in this show. I thought it could really have potential, considering the premise ofthe show is somewhat Bleach like, and Bleach had great music. The animation was all right as well&hellip; a bit jumpy in some spots, but generally fluid. The character art was decent, and semi-consistent, though I say that their noses are far too large for anime. Its just kind of a shame that nothing really stands out as spectacular in this anime. I suppose I should give it time to see if it blossoms, but my cynicism won&rsquo;t let be get my hopes up.\\n\\n\r\nThe premise of the show is very Bleach like, which is not to say that it&rsquo;s a knock off of Bleach, but they are very similar. Spiritually sensitive kid lives in a temple, and sees spirits. He has three friends that have anime stereotype personalities (Rukia is the only good female main character in Bleach, god dammit!). He stumbles upon the main female character Makina, who is a shikabane hime (someone who hunts shikabane, I&rsquo;m guessing) and he is startled that she&rsquo;s dead. He has a trippy run in with a spirit cat that tells him things, but eventually he shrugs it off. Yagami, the male lead, moves out after this incident. It turns out that Yagami&rsquo;s aniki Keisei is the head of this secret society that hunts shikabane. Shikabane are corpses that have enough will to keep moving after death, and its Makina&rsquo;s job to hunt them. I&rsquo;m guessing that Keisei loves Makina or something, because they make it pretty damn obvious when you compare his attitude towards her to the other members of the society. Well, nothing really happens for most of the first episode, then at the end, Makina kicks ass with sub-machine guns and takes out the shikabane for the episode.\\n\\n\r\nWe can all guess that soon, Yagami will delve into all of this business, as he has met Makina. He saves her from being permanently dead (which had a trippy mind-fuck sequence) and then she slaps him and books it. I&rsquo;m kind of disappointed in the first episode. It had real potential to be memorable, but it just didn&rsquo;t wow me. Check it out if you want. I&rsquo;ll probably watch the next episode before deciding anything. I give the show a total 6/10. I should note that this show is already slotted for a sequel, even before the first episode aired. It better turn out damn good, or I get to get out the pimp hand.\\n\\n\r\nProduced by Gainax. Airs on Thursdays. Subs by Lunar.\\n",
            "date": "2008-10-08T15:57:00+00:00",
            "helpful_count": 24,
            "mal_id": 8522,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102053.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/legacy3233old",
                "username": "legacy3233old"
            },
            "url": "https://myanimelist.net/reviews.php?id=8522"
        },
        {
            "content": "Gainax is know for producing great anime and though Shikabane Hime: Aka may fall short in some anime viewers opinion I for one disagree.\r\nStory: The story followed a cliche of \"woman fights monsters, guy waits in sidelines\" & \"protagonist is the only one who can kill the monsters\".\r\nthough people may think its cliche and played out (which it is) Shikabane Hime doesnt stray from its cause. \r\nBleach anime held the exact same features that Shikabane Hime: Aka did with \"monsters come from people who don't yet want to \"pass on\" and thus become monsters in order to stay\".\r\nbut what Bleach didn't do was keep thatmotion of helplessness where the hunter was alone and had to fight alone the majority of the time. Shikabane Hime: Aka is still catching the feeling of weakness where the protagonist is still fragile though she is almost immortal.\\n\\n\r\nArt: isn't very catchy. Very simple scenes like bullets dropping wasn't new but felt satisfying. Hair styles where done cheaply (a first for Gainax). backgrounds and such weren't a letdown. some scenes depicted chibi or other comical relieving art which in my opinion made lite of the story or progression of it. and fight scenes were shortened in a disappointing  way.\\n\\n\r\nSound: The music, sound effects, voice actors are all decent.\\n\r\n though none of them are renown voice actors they still play their parts well catch people into the story. the music wasn't bad in-fact it caught my attention and made me check out the song artist.\\n\\n\r\nCharacter: Cliche, slow development that builds its way up. not much to say.\\n\\n\r\nEnjoyment: i for some reason found the anime very catching after i watched it.",
            "date": "2008-11-21T02:12:00+00:00",
            "helpful_count": 15,
            "mal_id": 9718,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sousen",
                "username": "Sousen"
            },
            "url": "https://myanimelist.net/reviews.php?id=9718"
        },
        {
            "content": "Shikabane Hime is a action horror hybrid from Gainax. It centers around undead girls who are given a chance to enter heaven if they fight and kill other undead. Equal parts exhilarating and disturbing, Shikabane Hime feels like a shounen with heavy horror undertones. This combination is what makes the show worth watching, especially in its later stages, despite its numerous shortcomings. Just for the record, this review covers both seasons: Aka and Kuro.\r\nShikabane are monsters born of strong regrets a person might have when they die. Ageless, powerful, and bearing an animosity towards the living, shikabane are a threat to mankind. The only lineof defense against them is the Kougun Sect, who employ the use of undead girls, called shikabane hime, to eliminate shikabane under the supervision of a contracted monk. If a shikabane hime is able to kill 108 shikabane, then they can enter into heaven. Makina Hoshimura is a shikabane hime with a vendetta and a strong bond with her contracted monk, Keisei Kagami. However, things begin to unhinge when Keisei's adopted younger brother, Ouri, becomes involved in the secret battle between shikabane and the Kougun Sect; a battle neither Keisei nor Makina want him to be involved with.\\n\\n\\n\r\nThe show starts off with an episodic \"monster of the week\" type deal. These opening episodes are in the same vein as Vampire Princess Miyu (the TV anime, not OVA), with our heroin hunting down and destroying shikabane; just done much better than Vampire Princess Miyu, namely because of the more exciting fights. At the same time, the show follows Ouri as he slowly finds out about shikabane and the Kougun Sect. These episodes are the show's weakest because while the fights are all good, the scenarios are hit-or-miss, and time with Ouri is usually dull. Luckily, the show starts getting better mid-way through the first season, when Ouri gets deeply involved with one shikabane hime, having tragic consequences. Characters get some god character development: Ouri struggles with the fact that shikabane hime are dead, Keisei laments Ouri's increasing involvement with shikabane, and Makina's reasons for being a shikabane hime and past with Keisie are relieved. All the while, the viewer is treated to more grotesque scenes of horror and gleefully violent action sequences. Near the end of the first season the main antagonists, a group of shikabane called the Seven Stars (because there are seven of them), appear and aline with the previously introduced Traitor Monk Akasha. In retrospect, I wonder why they didn't do this earlier in the series, as it would have made the show more evenly paced.\\n\\n\r\nThe second season, Kuro, moves at a break-neck speed compared to the first. It is so overstuffed with twists and plot revelations, there is no doubt the show as a whole could have been paced better. Still, it can't be accused of being boring. There is a certain shounen-esque excitement to having a villain league like the Seven Stars in the fray.It is fun to watch Makina take them on one at a time. There is also a lot more drama in this season, mainly concerning Makina and Ouri, which is pretty good; but also some drama involving minor characters which really doesn't go anywhere, just adding more fluff to the already cramped running time.\\n\\n\r\nOne thing the show definitely could have handled better was its themes. The show deals a lot with death and regret, but scarcely actually explores them. There are a few occasions where it does, like at the end of both seasons, but for the most part the concepts of death and regret are thrown around like \"friendship\" and \"courage\" are in a typical shounen. There is also the issue of the relationship between shikabane hime and their contracted monks, which is somewhat like the Fratello in Gunslinger Girl (except including complications of having more matured bodies...), but handled far less maturely. Their relationships range from being as complex as the one between Makina and Keisei (and Ouri), to as simplistic and one dimensional as the one between Saki and Rika. One particularly nasty one is Minai and Itsaki, which is the equivalence of Jean and Rico from Gunslinger Girl, unfortunately does not get enough development (even though an extra episode was dedicated to them).\\n\\n\r\nAs I mentioned at the beginning of the review, this is from Gainax, which means it is going to at least look decent. The show goes for a dark look, even with the vivid color pallet found in most Gainax series, with shading  which borders on unnatural but still suits the show well. Backgrounds are fairly well designed and characters have that certain cartoon-ish expressiveness you will usually find in a Gainax work; the shikabane are a bizarre looking bunch. There is also the copious amount of fan service we've come to expect from Gainax as of late. The animation is for the most part solid, a bit of spottiness here and there but nothing to complain about; the action scenes are treated well. The music does its job of controlling the atmosphere, especially during the tense moments, but honestly you are just not going to remember it. Not the best of Gainax's projects, but certainly not bad at all.\\n\\n\r\nTaken as an action horror, Shikabane Hime is a decent show. It doess have some major problems with its themes and pacing, which are honestly kind of a mess. However, if you are in the mood for violence, disturbing imagery, and maybe even some solid drama, then you might want to give Shikabane Hime a try.",
            "date": "2011-06-17T23:53:00+00:00",
            "helpful_count": 12,
            "mal_id": 38002,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229558.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeverKnowsBest26",
                "username": "NeverKnowsBest26"
            },
            "url": "https://myanimelist.net/reviews.php?id=38002"
        },
        {
            "content": "Shikabane HIme or Corpse Princess was a horror,action and martial art anime,with his and her whole family been killed by a group of shikabanes which is Shichisei,Makina seek a revenge against Shichisei with the help of Keisei Tagami as her contracted Monk and a long with Ouri kagami as the younger brother of Keisei Tagami.At the beginning of the whole episode it only tells what is Shikabane are and how shikabane exist and what the contractor monk use for.At the beginning the story was a bit slow,only a few importance information about the Shikabane been told,even the plot development was a bit slow at thebeginning,but at the middle of it the plot development is getting interesting with the pace are getting faster with the introduction of new Shikabane and their Contractor monk and some of action and corpse,However,until the last episode of Shikabane hime:Aka the story was left a big cliffhanger and this's when the second season Shikabane Hime;kuro take places for the cliffhanger....\\n\r\nThe Art for this series was to be par for good and bad,some of the animation was sloppy even the action scene was a bit sloppy but still good,the character design was simple and each character had their own distinguishable look,the environment and background was too simple and the colours are a bit dark just to blending into the gloomy atmosphere for most horror genre.\\n\r\nThe Sound,the OP/ED was very catchy and it was easy to listen and the BMG was some of it was fit to some scene like the action scene the BMG was a bit disappointing and it was sloppy a bit and some part of the BMG was didn't fit at all for that scene.As for the voice actor sound most of the char are fit with it,and a bit disappointed for Makina voices it just that voices are didn't fit for it at all....the seiyuu has a unique voice but for Makina personality it didn't fit for it.....\\n\r\nCharacter,the story are mainly focus only for Makina and Ouri character develop with a bit by bit the develop between them are evolved,with supported character helped the character development like the other Shikabane and the contracted monk,and that make some of the supported character didn't develop too much,but some of the supported character and the contractor monk got it flash back for how they meet and and become Shikabane...\\n\r\nOverall,truly this anime was enjoyable to watch,it wasn't that bad at all it was a decent anime but t still worth to watch for those who like horror,action and martial art genres.......however the enjoyment still continued at second season for it...",
            "date": "2015-01-04T03:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 176105,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4020933.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xsis",
                "username": "xsis"
            },
            "url": "https://myanimelist.net/reviews.php?id=176105"
        },
        {
            "content": "I have to admit I’m fairly conflicted about this one. I decided to watch a random anime and I got this one, so I figured I should check to see if there’s a sequel, or a prequel, and how time-consuming it could be and there it is, the biggest spoiler I could get about the finale of this particular part. I nearly dropped it right then and there, instead I decided to wait but even after quite some time I still remembered that someone dies at the end. So the ending was pretty much ruined for me. \r\nPutting that aside it was a very enjoyableride so far, I am yet to watch the second season so to speak, but I’ve certainly enjoyed this one. The characters aren’t anything too fresh to be frank. There’s a badass girl using guns, a kid placed into situations beyond what he could possibly handle just so the main character isn’t more knowledgeable about this entire concept than we as an audience are. It does work as it keeps us wondering what he could do to possibly evade death this time, seeing as he is about as clueless as we are. \\n\\n\r\nSo this brings me to Ouri, the he who meets all the right people in this series. Keisei is a contract monk, alright; he’s his brother figure, that’s fine. But his part-time job boss just so happens to be one of the most powerful people in the series. Add in all the encounters starting from Makina, to Minai and others and he just so happened to have a connection to people two Shikabane knew, which wouldn’t be that much of a problem if the second battle wasn’t decided by that factor. That’s pretty much the one and only major flaw I could point out. Ouri as a character is probably my favorite, I like the mystery around him, I like his growth through the first thirteen episodes, I got to see an ordinary, as far as abilities go, clueless teen grow into a so far nicely developed character. I can sympathize with him, I can relate to him, I can’t exactly understand his attachment to death, but I can accept it as a character trait that he could reasonably have. So aside from having connections with all the right people I really do like his character. \\n\\n\r\nThen there’s Makina, at first I wasn’t too keen on her, sure she was a badass but aside from that I didn’t see too much of a personality. But as episodes went by I came to appreciate her character. She’s far from a simple character, though she’s not exactly that complex, she’s in the fine middle with enough traits to grasp at. Her reasoning, her purpose and what drives her, it’s all out in the open, but it’s the culmination of all those things that make her interesting, she’s driven, doesn’t open up easily and it all goes back to her death. If I saw more of her while she was alive I’m sure there would be an even clearer picture of who she is as a person, but even now it is fairly enough to get me to like her. \\n\\n\r\nAkasha and the other main villains, Seven Stars, on the other hand left me with a feeling of not much going for them. They do succeed in moving the plot, but aside from few things here and there I haven’t seen much that would make them memorable, but I’m assuming and hoping the remaining twelve episodes will change that.",
            "date": "2018-08-03T09:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 285467,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3924529.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/VergilLeonidas",
                "username": "VergilLeonidas"
            },
            "url": "https://myanimelist.net/reviews.php?id=285467"
        },
        {
            "content": "Just gonna say this straight off the bat - a VERY average show, despite the interesting concept. If you've just gone sifted through 4 or 5 average shows because you thought you'd find them interesting, hold off watching this or you will just bore yourself. Anyways, onto the review!\r\nI got into this show because I had zombies on my mind (probably because I've been looking at zombie video games/mmos) and decided to scout out some zombie anime. I stumbled across this. I will warn people now, some may consider this spoiler material, and I suppose it is, because I'm going to sum up the plot:-\r\nWhena person dies, sometimes they do not depart from this world. They become corpses, and many turn corrupt and want vengeance on the human race because they died. Some, however, have a relationship with a Shinto priest. Because of this, they help rid the Priests of the corpses. They are called Shikabane Hime - oh, the title of the show! How fitting... Reason it scores high is its setting of Japan. Because I simply cannot get enough of the island. 8.\\n\\n\r\nCharacters - bit of a mix up to my usual setting of a review. We follow the story of Ouri, an orphan (I think) who grows up in an orphanage of sorts that's run by the local priests. Anyway, he moves out once, I dunno, he's turned 16, dunno how it works over in Japan. Ouri is at least relatable - we learn about the story and background as he does. I like that, sometimes shows put you ahead of all the characters then they have to be dumbed down. \\n\r\nThere's a slight catch. Kensei, a priest working (well, suppose an orphanage isn't exactly a workplace is Ouri's brother, which is why Ouri is not exactly an orphan. I've made that more confusing then it actually is. Anyway, Kensei, like the other priests (yeah, the orphanage I guess is also the local temple because Kensei and Ouri's dad is a bishop, like a corporate executive of the whole Shikibane Hime thing... Really, it's not this confusing!) is a contract priest, meaning he has his own Shikibane Hime fighting corpses with him. Her name is Makina. Anyway, Ouri, despite not wanting to be a priest, gets caught up in all this, knows about the shikibane hime, the work they do, and all the characters get fleshed out, including how Makina became a shikibane hime and what relationship she has with her priest. The first half of the show takes on a 'monster-of-the-week' formula while a plot twist kind of intertwines it's way halfway through, which many will see coming to be honest, and maybe that's why I think the show is average. 7.\\n\\n\r\nArt - Again, standard CGI fair, but even in other shows I've reviewed (Love Live and SAO to name two) it's been done better. 6.\\n\\n\r\nSound - Nothing of key interest, kind of a gothic, piano interludes - a soundtrack similar to Mirai Nikki (Future Diary), but not as striking and 'metal' as that. 7.\\n\\n\r\nOverall, this was enjoyable enough, but certainly nothing but average. Worth a look for the characters and maybe a couple of tunes to add to your phone/mp3/ipod, but other than that a short show to fill your anime void if you have nothing else to watch. 7.",
            "date": "2014-04-11T14:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 139587,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2501829.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Waldy565",
                "username": "Waldy565"
            },
            "url": "https://myanimelist.net/reviews.php?id=139587"
        },
        {
            "content": "Very very nice! \r\nDid not like it much when I watched some episodes while it was ongoing.\r\nHad almost made up my mind to drop it,  BUT then I changed my mind, and started watching it all over. \r\nWatching it back to back made one helluva difference.\r\nIt has some comedy, which often means I don't like certain series. Heavens be blessed that did not happen while I was watching Shikabane.\r\nI'm so happy I decided to give it another try. The story and the characters interaction makes it a great watch.\r\nI want to watch the sequel Shikibane Hime Kuro, but I'll hold my breath and trynot to start watching it until it has finished airing.",
            "date": "2009-01-23T16:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 11786,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/131376.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TwoSoxs",
                "username": "TwoSoxs"
            },
            "url": "https://myanimelist.net/reviews.php?id=11786"
        },
        {
            "content": "Well, to start, I binged Watched this one thanks to our friends at funmation.  So I have one review for both seasons (plus bonus).\r\nI was both pleased with this one, and also very displeased.  I know, I know.. you want me to make sense.  Lets get the mechanics out of the way.\r\nCharacter Development:  Not bad.. Most of the main characters (I stress MAIN) are developed well.  they have depth.  Some of the secondary and lesser characters are paper thin (Ie:  the otaku Hime).  \r\nAnimation:  Well done.  At least to my preference.  Detailed back grounds,interesting colours and scenery, smooth animation.\\n\\n\r\nSound:  Also Well Done, except for some of the music overlays.  I felt them to be too loud, and were drowning out the convesations.\\n\\n\r\nSigh.. Story:  I felt the premise to be interesting.  and the action and story development for the most part were good.  And this is the part that kept my attention, Dispite the rest.\\n\\n\r\n  I found the ending to be poor (EDIT:  By ending here, I am refering to Climax of the story), the story lacked the substance needed to pull of such a strange twist.  It ended like so many other animes..  Feeling rushed.  Also, I felt the whole segment about Shikabane Mother could have been chopped from the story line.  It did nothing to advance the main story line.  they could have used those few episodes to make the main plot clearer.\\n\\n\r\nI did like how the very end (The wrap-up portion after the action) left you hanging.  Perhaps a movie?  or another season.  It was left in such a way as it could stay the way it is, or not.\\n\\n\r\nOverall:  I do not regret the time watching this, and I will likely buy it (when I see it), and watch it again.  However, I do not feel this will be an anime that will be remebered in the long run\\n",
            "date": "2009-06-22T22:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 16014,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197617.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ferren",
                "username": "ferren"
            },
            "url": "https://myanimelist.net/reviews.php?id=16014"
        },
        {
            "content": "Halloween is coming up (Or already passed depending on when I finally get this review done) and so what better way to get the chills is to watch a show about corpses coming to life and killing people, right? What I didn’t know about this was that there was a whole bunch more to this show that meets the eye. It brought some questions I never thought I would have to ask myself. \r\nSo when we get into the characters, Kagami is our ‘main character’ of sorts. I call him a main character even though most that I read has had Makina as the maincharacter. Anyway, Kagami has a rather strange personality. At first I found it very hard to believe his reactions to the things happening around him. He wouldn’t freak out at all like a normal person would when faced with the walking dead. He only seemed to react when Tagami, his ‘brother’, teased him. He was out of touch with the real world and had a very drab voice to go with it. As I watched though, I found it easier to understand him slightly, though it did not make him any better at times. Makina is pretty much a tsundara in basic form but then there are parts of her that I would argue that statement. She isn’t a typical tsundara; she has a good reason not to connect herself to those around her. Although she does seem to fall in love, I don’t think she ever really forgets enough of her situation that she falls into the want to leave it all behind. Tagami is… How do I explain him? He has a split personality that makes it hard to actually know what he is going to say. One moment he can be rather smart and wise beyond his years and the next he is acting like a perverted high school boy. I can’t figure out exactly what goes on in his head but I’m pretty sure its messed up. He did break up the tension though with his strange form of humor though which was a nice switch.\\n\\n\r\nCan I ask why a Shikabane Hime needs to dress like a high school girl? Because I don’t understand some of the outfit choices of her and of some of the monks. I mean really, Makina wears a school girl outfit, the sword princess has extremely high heals, there is one monk who wears what looks to be a very small bra under a lab coat, there are some really confusing hair designs in a couple of characters. I thought that if you’re going to fight a demon, then you shouldn’t wear those types of clothing. There is also a thing in that these Shikabane are basically dead people, so dressing them up in outfits that make them look ‘sexy’ just makes it really awkward. There is also another question I have to ask, WHY ARE ALL THE SHIKABANE HIME WOMEN? The way they talk about it, shouldn’t men also turn into them as well? I understand they say Hime meaning Princess but I am sure that men could also be made one.\\n\\n\r\nNow along with this being a show that has a very high supernatural and horror base to it, there was something I don’t think many notice while watching this. It is the question of ‘what does it mean to be human, to be alive?’ It actually is a basic question that I got throughout the show. They keep going back and forward in the idea of what Shikabane and Shikabane Hime mean. They keep on talking about how Shikabane are just people with regrets, and then how Shikabane Hime is those who are only there to kill Shikabane. The Kougon Sect. (the group that has the Shikabane Hime) seems to be split on weather or not Shikabane should be treated as objects or people. So here I ask you, the reader, a question. What does it mean to be human or to be alive? Does it mean you must have a beating heart and able to breath… or does it mean you should be able to feel, to think, to understand right from wrong? \\n\\n\r\nThe artwork is rather dark and full of blacks and purples, much like many of the shows that revolve around the supernatural and hauntings. But it’s not all like that. When they are in the normal world, things seem to take on this misty coloring like it was all a dream. It gives a good balance between the two different worlds and also makes the world of the supernatural look more real then the real world. I know that sounds strange to say that, but the real world in this show seems more like a fantasy or a dream with how bright the supernatural world looks. Sometimes with the action, it doesn’t look all that well. Gainax has this thing where when some action happens, they seem to put a lot less work into it. The opening is pretty nice but with the ending, up to episode 5, they were only using scenes from the episode. At 5, they made an actual ending which had a couple pictures of characters.\\n\\n\r\nThe English dub isn’t much to talk about. It’s pretty bland, especially our protagonist. Kagami just sounds as though nothing ever fazes him. His voice is low and draws out a bit. I think I get a little of what Aaron Dismuki was trying to do but it didn’t work that well. The only time he actually shows off any sort of emotion is when Tagami is teasing him. Even when he finds out that a girl that he knew came back to life, he just seems to stare blankly at the screen he is watching. I don’t know if its just the characters personality or the way the voice actor brought him out as but I think it’s a little of both. I do believe Aaron does get the emotions down when he does put effort into it. Greg Ayres surprisingly did a very good job as a strange talking black cat to a point that I had no idea he was the one voicing him. It’s the perfect sort of haunting voice you would think a mysterious cat would have. You definitely can’t tell weather the cat if friend or foe which I really think is part of his charm. Luci Christian does a pretty good job of Makina with her very harsh style of talking. She is the perfect Tsundara character for this sort of story and I think part of this was because Luci herself has played a lot of Tsundara characters. One of the saddest things for me to say right now is I don’t think one of my favorite voice actors should have been brought in for the voice of the Buddhist Monk. J. Michael Tatum doesn’t really catch the right air I think Tagami was supposed to have. He was rather good for when Tagami got rather series but something just seems a little off when he is trying to do the funny parts of the character. The music is actually rather good, giving an intense feeling when it’s needed and a softer feeling when a sad point is. Sometimes for the sad or emotional points, you can barely hear it which I actually think works well. It makes to try to listen more intensely so you don’t miss anything. \\n\\n\r\nOverall this show was actually rather good and a perfect show to watch for Halloween. It has a lot of gore, violence, and mystery to keep you wanting to watch more, although the ending was a little bit of a cliffhanger. Luckily there is a sequel and though I haven’t seen that yet, I am looking forward to seeing how it goes. Even with all the gore and violence, there is also an interesting philosophical question that I look forward to uncovering just how they will answer it. \\n",
            "date": "2015-10-28T23:48:00+00:00",
            "helpful_count": 5,
            "mal_id": 202189,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=202189"
        },
        {
            "content": "I could describe this anime in so many words: touching, exciting, creepy, beautiful, interesting, moving, powerful, and a thousand more. \r\nI really loved the relationship between Makina and Keisei. They were so beautiful as a partnership, and I would love to watch the two of them forever. \r\nI also loved Ouri. His tenacity and strength is so admirable. He put himself through so much strain and hurt for his brother and Makina. \r\nI'm really glad the history of the Shikabane Hime vs. regular Shikabane was touched on (I think more so in the second season than the first). It was interesting to learn about thestakes of being one or the other as well as the stakes for simply being tied to a contracted monk. \\n\\n\r\nBasically, this quickly became one of my favorite anime series, and I'm so glad I decided to watch it.",
            "date": "2018-01-13T17:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 268458,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=268458"
        },
        {
            "content": "I picked this series by chance after reading its premise about a high school girl which by the way is undead fighting to extract revenge to an organization that wronged her.\r\nThe story revolves around a young man named Ouri in his quest to solve the supernatural mysteries which involves unexplainable deaths that is occurring in his town. While being episodic with the 1 monster-per-week format until about halfway of the series, a lot of things happened in those episodes that told bits of the main story moving the series forward such as meeting up several important characters, his discovery of what his hidden talent cando, and several other events concerning the Kougan cult and the Shikabane Himes in particular. When the real antagonists finally started showing themselves during the middle part of the series, it was at this point that the show finally started to get really interesting. The finale for the series leaves a lot of things to be desired that was later answered when the second season was aired.\\n\\n\r\nThe animation for this series is dark, very dark, even when the setting is daytime. It is something that the viewers can eventually get used to because it suits the series quite well as the story is shrouded in mystery and supernatural phenomena, so a dark setting is really appropriate. The background and characters are somewhat lazily drawn, having poor details and generally bland. The animation is not really sharp and crisp makes you wonder if the series is really an HD show or an upscale. The bright points of the animation are the fight scenes, it is detailed in such a way that makes the effects looks stylish and nicely choreographed while maintaining the simplicity of the animation, special attention was given to the animation of the Shikabane-Himes since they provide the fan-service for the series.\\n\\n\r\nMusic is not really the strength of the series. The OP and ED themes provide a good feel for the series but not really memorable at all. The soundtracks are pretty decent especially during the fighting scenes and several other important scenes have a nice selection of songs playing in the background. Voice acting on the other hand is fairly good. Note worthy amongst the cast are veteran seiyuus such as Sugita Tomozaku, Horie Yui, Fujiwara Keiji, and Yuuki Aoi. What is surprising for me are the seiyuus of the main characters namely Akiyama Nana which voices Makina and Hasome Tatsuya for Ouri, both are very new in the business but did a very good job giving voice and life to the characters they portrayed.\\n\\n\r\nI generally preferred female leads that have strong personalities, one that doesn't back down and is always up to the challenge, so Hoshimura Makina is a big win for me and an important factor that made watching this series an enjoyable experience. In addition to that, she is also hot and cool when she wields her two guns and start shooting on her opponents. The male lead Kagami Ouri is also not to be toyed around. He could be annoying at the beginning especially when he came across to the mysteries that revolved around him but he developed into one fine male lead as the series progresses. The other main character that give huge impact to the story is Tagami Keisei, initially a very secretive character but with his relationship with Makina slowly being revealed, his presence is pivotal into closing the gap between Makina and Ouri. There are also several characters from the Kougan cult, other Shikabane Himes, and antagonists that made an appearance mostly to progress the development of the main characters.\\n\\n\r\nShikabane Hime: Aka is a fairly well done series as a whole. Despite it short-comings in animation and the episodic format in the start, it didn’t affect my overall impression of the series which is more on the positive side of things as it improves at the midpoint and ended with a lot of questions that was eventually answered with the airing of the second season. As for my final note, I would recommend this series for viewers who like stories that are supernatural in genre with lots of action, gore, drama, and hints of romance.\\n\\n\r\nNote: This is a re-review of Shikabane Hime: Aka\\n",
            "date": "2011-06-29T15:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 38473,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384609.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ghostalker",
                "username": "Ghostalker"
            },
            "url": "https://myanimelist.net/reviews.php?id=38473"
        },
        {
            "content": "People are falling victim to creatures called Shikabane, which happen to be reanimated corpses with superhuman and even supernatural abilities. There exist an organization made up of monks who deal with them by using reanimated girls called Shikabane Hime aka Corpse Princess. The girls also possess superhuman abilities. One of their number named Makina, goes into battle against them equipped with two uzi's, along with her guardian a Contracted Monk by the name of Keisei. Together they battle the monsters across the city. But there's a greater threat approaching with sinister motives. -summary\r\nCorpse Princess is another one of those by the number, action oriented titlesthat are a dime a dozen. The core premise is the usual girls with guns vs. monsters, and while I was watching the show it felt as if I was watching three other series simultaneously. Therefore, it's a no brainer that originality was never intended to be factored into the equation. Despite this though, there was quite a bit going on that held my attention, and most of my huge pet peeves were kept to a minimum. The action in the series is nothing to really turn a nose up at either. At this point, I would say that the series is a solid action romp. For the record, this is the first half of two, titled Corpse Princess: Aka, with the second being Corpse Princess: Kuro.\\n\\n\r\nThe plot follows Makina as she battles the Shikabane; her missions become complicated when she constantly runs into her handler's younger brother Ouri. He eventually becomes dragged into the feud with the monsters. At first, it's the standard good vs. evil that results in action packed episode ending showdowns. However, the stories are rather interesting when moving from point A to B. I really don't mind the lack of originality as long as there's some type of creativity thrown into the mix. \\n\\n\r\nThe Shikabane they come across don't always have interesting abilities, instead their origins and episode story elements are sometimes the main draw. For example, one episode sees a doctor completely controlling one that is protecting something important to it, at the same time, he's injecting people with the cells from the beast, and he's given the idea from a mysterious benefactor. This eventually leads to the supposed lead antagonist of the series. Along the way, although there are several detours, the story eventually begins to take some type of form. My interest began to be aroused when a faction called the Seven Stars were introduced, and Ouri's mysterious background begins to come into play as well.\\n\\n\r\nThe style of the series is rather dark at times, but there are slight tonal comedic shifts that take place. I doubt it's a secret that I don't care for segments like these, however this is one of those cases where it actually works. The comedy rarely, if ever, clashes with the tense moments which is a plus; and I think the main reason I can let this pass is because Corpse Princess knows exactly what it wants to be, and that's light entertainment in which it succeeds at. There is actually no attempts towards being high art at all, and I have to commend the writers for this because one thing I can't stand is an anime with an identity crisis.\\n\\n\r\nThe characters are indeed cookie cutter though, for the most part, they're plot devices we have seen about a hundred times before this point, and that is never a good thing. They consist of the tough chick, and whiny male teen who has to question all of her motives, and like always it can be annoying. Thankfully, there are side characters with different abilities who occasionally appear, and sometimes they even have their own drama to deal with. The story behind the Shikabane is interesting in a way, but it feels way too similar to Bleach. People become those creatures when they pass away with certain regrets or obsessions. Even though it feels familiar, this sometimes plays into their powers which adds an interesting twist to the encounters. Corpse Princess does feel like other things, but it tries its hand at being creative.\\n\\n\r\nThe visuals are pretty good with some fluid action scenes that rarely go the lazy route. There's quite a bit of high intensity shootouts and fist to face segments. The battles are well-lit spectacles that I found to be entertaining on some occasions. I found the character designs to be about so-so, and the backgrounds are dark most of the time, which suits the supernatural element properly, especially since all the battles either take place in the night or inside very dark structures. The soundtrack features two J-Pop songs for the opening and ending that I can imagine some folks getting into. While the BGM is nothing to really brag about outside of complimenting the style rather well.\\n\\n\r\nThis first half has its good moments and the story ends on a cliffhanger after a very predictable plot twist. The fan service ranks between very tame to almost non existent, and the gore is moderate. If only the characters weren't cut from the same cloth as so many other shonen heroes, it would probably be better. Still, if you dig hot chicks with guns taking on monsters, then Corpse Princess is something that's worth a look.\\n\\n\r\nHighs: Production values, light entertainment that pretty much succeeds\\n\\n\r\nLows: Bland characters, feels too familiar in many places",
            "date": "2015-11-05T17:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 202758,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4526092.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Luquillo",
                "username": "Luquillo"
            },
            "url": "https://myanimelist.net/reviews.php?id=202758"
        },
        {
            "content": "Shikabane Hime is a barely decent anime that was released in 2 parts: AKA & KURO. For the purposes of convenience, my review is about both parts because its all really the same story and if you watch one part, you'll likely watch the other part as well. From the outset I had a problem with this series. starting with the title \"SHIKABANE HlME\" If it were just the anime title l'd be ok with it but it is a somewhat silly name for a zombie slayer. Why HIME? Is there a king, a queen, a prince? No there isn't it's just once again noone used their imagination or creativity. They know anime viewers all around the world have cottoned on to the Japanese word \"Hime\" by now so hey, why not use the word HIME in the title....it worked so well for Mai-HIME, right? Names aside, like I said, its a barely decent shonen fighting anime about monks & monsters. Of course the monks don't go into battle alone, no, they mostly fight by proxy via supposedly dead little girls dressed in all manner of skimpy or tight-fitting outfits catering to the various otaku fetishes.\\n\r\nI really did not pay attention to the music of this series. I did watch the anime in English audio and I must give credit to the actors, they were pretty good even if the script was just proper shit. Lucy Christian is pretty much good at everything and I especially appreciated Aaron Dismuke's voice, maybe because you just don't hear too many authentic teenage male voices in anime.\\n\r\nNothing earth-shattering about the art here at least not for me. Maybe for teenage boys and horny otaku. I can't remember anything about the places in the anime... Probably because they were just flat and boring or maybe because the art is more focused on the characters, monsters and fighting scenes.  And even something about that annoyed me... like they plagiarized the fighting scenes from Naruto. Didn't that water fight scene between Makina and Hokuto seem eerily similar to the water fight between Naruto and Sasuke? It's the things like that through out the series that got on my nerves. Not just being simply unoriginal but almost seeming to copy bits of successful anime.\\n\r\nThe story is a very basic one, demons exist and there are those that must kill these demons. Nothing supremely new here. Once again I'm a bit underwhelmed. It doesn't take a rocket scientist to see that somewhere, some dude (erm company) said \"Hmmm, I need to make a story about hot chicks fighting in skimpy clothes...let's build around that idea!\" I say this again because the obvious questions arise \"Why HIME?\" Why only girls do battle against the shikabane? Clearly there are male Shikabane, surely the same arrangement can be made. There was some flimsy answer provided, one that they (the creators) easily punched holes thru and contradicted themselves with because there is no genuine interest in cultivating a genuine answer much less perpetuate story integrity. The only real focus is about having big-breasted school girls fight in skimpy clothing and watch it get ripped up. Let's keep it real. Let's keep it 100. I'm actually surprised no one busted out with tentacle monsters.\\n\r\nOK so with the obvious aside, the next logical question is; Is there a real story there, Is Shikabane Hime really worth watching? The answer to that is: meh! To be fair, there is a story there but as far as worth watching... well no. I've seen better and have been entertained by similar and better told stories: Kite, Gunslinger Girl, Mai-HIME, Blood+, just to name a few.  The fact they flip-flopped between comedy and seriousness was tiresome. And then the fact that Shikabane Hime has no overall message or theme, which is vital to any great story was also bothersome. You can feel them making it up as they go along, working with just the basic concepts but never fully fleshing it out. Just generic storytelling at best with lots of very large breasts,  Is the story about revenge?... sorta, with lots of very large breasts. Is the story about love? again... sorta, with lots of very large breasts! But like I said the story dances around vague concepts and notions, just choosing a \"paint by numbers\" approach to storytelling; Let's have a character die here, let's have the sauna scene there. But you don't ever really find yourself crying over any death or being interested in any cartoon titties.\\n\r\nShikabane Hime definitely did not create any revolutionary characters here. It's all pretty much your run of the mill characters, monks & big boobed fighter women all possessing your standard anime stereotypes: big boobed nice girl, big boobed mean girl, big titty ninja chick with toothy fang and cat ears, angry chick with pig tails & ribbons, Loli-type, But it's the so called doctor female with half a white labcoat but all the titties that took the cake...I just wanted her to stab herself in the boob with one of those ninja knives. Who fights with sharp weapons half naked? The monks are just accessories. Everyone just bored me and I just kept wishing they all died.\\n\r\nI definitely give this show as a score of 3. It's lucky to even get that score,  because normally anything lower than a 4, I would just delete it and move on to the next title.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2013-04-25T12:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 94889,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48644.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Bishounen_Hunter",
                "username": "Bishounen_Hunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=94889"
        },
        {
            "content": "“Thank you, Makina. Spending my days fighting alongside you, means everything to me. The pact we made was worth all of this – and more.” – Keisei Tagami \r\nYou know when you go into a show and expect it to be mediocre at best and bad at worst, and it completely surprises you? That what´s happened when I watched “Shikabane Hime” (aka Corpse Princess). I expected flat and stereotypic characters, incoherent plot and plot holes, suspensions less fights, and shit loads of un-necessary fanservice. But boy was I wrong, it´s not often that I get so emotional during a watch as I became during mytime with “Shikabane Hime”. It gripped me on a deeper level then I thought possible, considering the genres (action, horror, martial art). And it has one of my all-time favourite openings – if not watch the show, watch the opening for the music and visuals alone. \\n\\n\r\nSo, what was it that surprised me so positively? I will explain that now.\\n\\n\\n\r\nStory: 9/10\\n\r\nThe plot has a clear path in its narrative and layout. Each episode giving clues and information to upcoming important events, and head enemies. I didn´t perceived the show as episodic, it´s just smoothly builds up the story and characters to the climax, with some suspense and tensions filled moments along the way.\\n\r\nI would definitely not call the plot especially unique or ground-breaking, but it´s for shore executed in a special way. As so many horror anime out there, death is an essential part – and not the physical death only, but the philosophical part of it as well. It has been in myth and folk lore for a long time, that if you die with regrets your spirit can´t pass on, and the spirit is stuck here in our world. This theme has been pondered many times in pretty much all mediums, but it never seems to get old, and can always be interpreted in new ways. \\n\\n\r\n“Shikabane Hime” takes the approach, if you die with strong regrets, then you get stuck in the living world, and this regret or obsession will turn you into a “Shikabane” (Shikabane literally means Dead body or Corpse) – a monster that has a physical form, and completely stripped off its former humanity. The only drive left is the Shikabane´s regrets or obsessions. Which inevitably turns the former human evil, and it will havoc upon the still living world with their super human strength. And of course, it has a counterpart, a group of people that has tasked them self with the non-so pleasant job to protect the living from these Shikabanes. They are called the Kougon Clan, and the members are monks that been trained for this special task of destroying these monsters, and keep the truth about them hidden from the rest of the world. To their help, they have Shikabane Hime´s, female Shikabanes, that they formed contract with. Together they form a team, and the Shikabane Hime takes life energy from her contracted monk to heal herself, and pretty much becomes undefeatable – and keeps her sanity and human form. After the Shikabane Hime has killed 108 Shikabanes, she can go peacefully to heaven with no regrets. \\n\\n\r\nAs a base, this can sound very cliché, but in Shikabane Hime´s case, it made me reflect on some deeper subjects. What´s defines being human? Is it a beating heart and ageing body? Or is it much more complicated than that? Is it our emotions, actions, and thoughts that defines us as human? Because, the Hime´s are treated in many cases as something non-human, more like a tool with an expiration date. \\n\\n\r\nI think how the relationships between the Shikabane Hime´s and their monks, really brought up these questions. Yes, the Hime´s are dead. No pulse, no aging, and very time limited to this world. And the monks, are very alive, ageing, and bound to this world for unknown time. And still they both look human, act human, and feel emotions like humans. And they are absolutely forbidden to have any romantic relationships. And that was another surprising part of the show, how it displayed these complicated relationships and the character’s feelings, or rather how they supressed these strong feeling for each other. What I expected to be a gore fest, with cliché fights, and empty character interactions, became something much more. It became a story of living on, even if dead, with the means of fighting, meaningful and touching character relationships, and the fights had meaning and emotional drive behind them. But of course, it contains lot of gore, it is a horror anime after all. As for the expected fanservice, it was actually very limited. Most of the fanservice is provided in the ending song, and it’s used sparingly during the actual show. Huge plus for me.\\n\\n\r\nNote: Worth having in mind, is that this is the first season of two so all your questions will not be answered in this season. Also worth mentioning is that the manga was still ongoing when the 2: nd season was released, so if you want a conclusive ending, you have to read the manga.\\n\\n\\n\r\nCharacter: 9/10\\n\r\nAs mentioned before, I expected empty stereotypes, doing and saying cliché and dumb thing, with non-exciting development. I was wrong. They all had a certain depth to them, with specific personalities, backed up by their past experiences. All the main and main supporting characters, get some important development and backstory (Ouri get his in the second season). The dynamic between the characters was very defined and meaningful, even scenes there Keisei just goofing around with his adopted little brother Ouri, and making him angry and embarrassed, becomes an important part of the show. Also, as mentioned before, the relationships between the Hime´s and their monks are a central part. All or of them are unique personas, who has established a specific dynamic between them. The interactions and dynamic with other human characters and Shikabane´s, is also an essential part to really get to the depth of what these Hime´s and Monk´s go through. \\n\\n\r\nWhich brings me to Shikabane Hime´s main charcaters.\\n\\n\r\nWe get to follow the Shikabane Hime, Makina, contracted to Keisei, and his adopted little brother Ouri. Keisei never wanted to make a contract with a Hime in the first place, but as he knew Makina in the past, he couldn’t turn her down after she and her family was brutally murdered by a group Shikabane´s. Makina´s regret is a burning hatred for her and her family’s murderers, and she want her revenge. So, they make a pact to always fight to together, and give Makina her revenge. \\n\r\nMakina can at first glance be labelled a tsundere, but her harsh way and words is just a protective shell she´s created. She´s keeping her true feelings and emotions on a tight leash, due to that she knows that some things just can´t be – even though she wishes otherwise. Makina is simply put a badass realist, not a true bread tsundere. Which gives her softer moments a lot more value and emotional impact. Keisei is a character with two very distinct sides – the goofy older brother monk that pretends that nothing is going on, and the more serious and high level Shikabane fighter. Keisei has a heart of gold, and his protectiveness of Makina is nothing but heart clenching. You can clearly see that they harbour strong feeling towards each other. Their relationship and interactions, brought me to tears multiple times during this watch. Sense when did horror anime become such a tear-jerker? Ouri isn´t a monk, and has no clue about what´s his brother is really doing in the beginning, but he is like a moth to light, when it´s comes to death. He seems to be drawn automatically to it. Ouri is very emotionally cut off, much of what he sees and experience almost never faces him in ways that you would expect. He just goes with most of it, and the key to it lays in his past (of course!). And just in he´s case as in Makina´s, his more emotional moments have a lot of more impact, because of his usual lack of response. His loyalty to his brother and those his think of as friends, are nicely portrayed. He´s is the weakling in the beginning, the person all people tells to “Stay out of it, you just going to be in the way!”, but constantly interfere – he just can´t stay away after he came to know about Makina. He´s drawn to her, and sees her as normal girl – which is a huge taboo. Makina tries her best to scare Ouri off, but a time comes there they have to lean heavily on each other. To see there bound slowly grow, also was one of the show´s strong holds for me.\\n\\n\r\nAll the supporting characters are in some way interesting, with pretty solid personalities, development, and backstories. I came to care for all the teams, and be emotionally invested in them to the point there I was like, “Please, don´t let one of them die!”. Even if I knew that in this kind of show, deaths will occur frequently. I enjoyed their stories and screen time just much as Makina´s, Keisei´s, and Ouri´s. \\n\\n\\n\r\nArt: 8/10\\n\r\nI personally really liked the art and animation, but it´s clearly out dated, compared to this day’s anime. Shikabane Hime, is a 2008 production by studio Gainax and feel. I think they managed to catch the atmosphere for the show very well, with carefully chosen colours and light setting. I came to love the character designs, even if some can appear lazily drawn at first. It´s was the small details of them, who made them stand out to regular anime designs. Like, Makina´s thick, pinched eyebrows when irritate or mad, or her evil death smile before she blasts her enemy to oblivion with her uzi´s. Or like Keisei´s spikey hair and shaded glasses. All details that defined their personality and mad them stand out from the norm. \\n\\n\r\nThe backgrounds are beautifully done and coloured, it really could give you an emotional contrast. For example, the cast been out hunting Shikabane´s, and bathed in blood in the dark of night, to watch a stunning sunrise or sunset and have nice small talk. It provided a nice balance, the beauty of life and death, night and day, and violence and peace. \\n\\n\r\nThe animation is mostly well done, but some parts feel a bit sloppy. Personally, I really liked the action scenes, with their special angles and explosiveness. The actually tension in the fights, was brought by the characters and highlighted by the animation. No complains form my point of view. \\n\\n\\n\r\nSound: 9/10\\n\r\nI have already stated that Shikabane Hime, has one of my all-time favourite openings. The song “Beautiful fighter” by angela, is not just suiting the show amazingly well, it´s a masterpiece on its own. I listen to it several times a day, I just can´t stop myself. The two ED´s are also surprisingly good, with my favourite being “My Story” also by angela. There is also where most of the fanservice I provided, but I watched it every time anyway, because the song was so good. Top notch OP and ED.\\n\\n\r\nAs for the OST, it was great. Dramatic instrumental music during intense filled scenes, and it´s softer counterpart during more emotional scenes. No complains what so ever.\\n\\n\r\nI watched the dubbed version, and I liked all the VA´s. Ouri´s VA can sound a bit emotionless or flat, but don´t forget, that Ouri´s character pretty much demand that kind of voice. \\n\\n\r\nAll background sound was absolutely fine, I could really hear the bullets popping, blood splatter on the ground, rasp of fabric against fabric, and the impact a collapsing structure made. Above standard for shore.\\n\\n\\n\r\nEnjoyment: 10/10\\n\r\nIf you not guessed it so far, I enjoyed Shikabane Hime a hell of a lot. I was taken by surprise of the fact, that just after 2 episodes, I was emotionally invested and highly entertained. Makina as the female lead was a treat, not your typical simplistic main girl, but had a lot of badass traits together with a hidden softer and loving side. Huge plus that they used her very little for fanservice, she was often treated with much more respect. I haven´t explored the horror genre that thoroughly, but I can imagine that this will be one of my favourites in the genre for all time, due to its emotional impact on me – the drama behind it all was well portrayed in my opinion. It made me feel intrigued, interested, engaged in the plot and characters, and excited. And not to mention the river of tears.\\n\\n\\n\r\nOverall: 9/10\\n\r\nEven do I can see that the show isn´t perfect, with every angle covered, it felt filled with important content and interesting characters, and character dynamics and relationships. Shikabane Hime, also contains some unrequired love aspects, expressed in a very nice and touching way. So, to me the show is much more than an action/horror train going to one destination. It contains, emotional hardships, the importance of the present time, forbidden love, and fighting to stay alive, and not for just the sake of fighting. So I would recommend the show if you like the themes, and haven´t had the pleasure to dig in to this piece that is Shikabane Hime yet. \\n\\n\r\n“Look at that. You are scared of me now.” – Makina Hoshimura\\n",
            "date": "2017-04-12T06:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 245308,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=245308"
        },
        {
            "content": "Zombies.... ooo zombies... I feel like I can’t think of apocalypse without you anymore. Gruesome bipeds hunting me for my brains, drooling and screaming while you slowly sustain inordinate amounts of lead to the face without cringing... I love you all for all the beautiful dreams and nightmares you give me.\r\nYou can imagine my excitement when I found out my favorite giant robot making studio was going to give it a shot to epically portray all of you in the most gar-ified way possible.  Right when I got into the show I was overwhelmed with the amount of familiar faces, all it was missingwas a huge drill actually and I would have probably wet myself in excitement. The breasts were there, the over the top action was there, the weak but soon to become omnipotent character was there, “K” was there… but something was missing. This something kept bugging me for all throughout the show and by the end I started to realize I can’t think of mediocrity without you anymore as well, but you know, its zombies so I knew you guys were going to put a good show for me regardless, or so I thought.\\n\\n\r\n--\\n\r\nStory\\n\r\n--\\n\\n\r\nARRRRRRRRRRRRRRRGHHHHHHHHHHHHHHHHH!!!!!!!!!!!  This is all I am used to hear from you, so you can imagine my big facepalm with all the repressed angst I got instead. You still did scream a fair amount and I will say those were the shining moments of your performance here, but whenever you silenced the guns and sat around for a long and tedious talk all we got was…. Well, long and tedious talks. At least that was what I would like to call them. In fact, they were long, tedious and flashbacks... lots and lots of them.\\n\\n\r\nPlease, don’t take this as a direct attempt to discredit your motives. Repetition aside, they are fairly well constructed and would provide a perfect scenario for your bloody fest if not for the insistence you had in giving the spotlight for some unnecessary, non zombie, characters. I really liked your plight and how you were thriving to fulfill it, just too bad you had to insist in bringing detractions, the worst offender being the one to get the most out of the screen time, a bit of a masochistic choice if you ask me.\\n\\n\r\nEven then, the variety of zombies you guys presented me with was nice and I found a few particular main characters, even some non zombie ones, pretty compelling, but the climax would only work if you had built upon it better… you know, like the guys behind you are so good at when they are dealing with giant robots. I also felt a bit cheated by you since you spilled all the few twists you had in store right at the opening, and after seeing it eleven times when it actually came to be I really felt like my brain had already been eaten.\\n\\n\r\nI know you must be tempted to tear me apart right now, but hang on a bit longer; I still have some mumblings that might make me even more appetizing.\\n\\n\r\n--\\n\r\nAnimation\\n\r\n--\\n\\n\r\nI have to hand it to you; you still know how to move. Whenever you guys are flying about exploding people’s heads or cutting them in half you really look your best, this time even better since you don’t have your usual decomposing skin anymore and the close ups on your new assets really does provide some extra oomph.\\n\\n\r\nHere is also were the otherwise formulaic nature of your plot helped, since the usually boring queue of weekly monsters waiting to be beheaded brought variety of characters and bloody ways to crush their admittedly interesting entrails. They are vicious, colorful and varied, and contrast perfectly with the pretty schoolgirl variety of zombies you guys brought into display here, bringing to the table that old good “princess and the beast” feel we are all so found off in ample dosages, something that even if we had forgotten for a second a character would promptly shout towards the audience so we would recall it instantly.\\n\\n\r\nStill, I know you can do better. Not even once my inner fangirl started screaming at your fights as it is usual when you are around bludgeoning stuff to death, and this alone is a big red flag. The fluidity both you and the hands drawing you are known for is kind of blurry here… it seems I don’t know you anymore! No need to get dismembered about it thought, it’s just that my final perception of you is lower than what I was expecting… please don’t come eat me alive yet!\\n\\n\r\n--\\n\r\nSound\\n\r\n--\\n\\n\r\nYour frenzied destruction is never complete without an appropriate music, and gladly you managed to score it this time.  Not only the opening and the ending, but the climaxes all felt a bit chewer thanks to the soundtrack. I just wish your voices also sounded as good as the rest, but unfortunately most of it were not up to par…. Perhaps if you would be more willing to scream “brainssssssssssssssssss” more often who knows, the truth is, you only sounded good when the only thing I could hear were the guns and awesome explosions you were creating, as for the biggest part, you sounded dull and out of character.\\n\\n\r\n…I know you must be drooling by now, but just a bit more and you can have a bite at me.\\n\\n\r\n--\\n\r\nConclusion\\n\r\n--\\n\\n\r\nWhat can I say to save myself now? I hang at your side your for the whole time, I tried to get as hyper excited as possible whenever you filled my screen with zombie glory and filled my ears with ultra violence, I even gritted my teeth to try to sob for you when you were sad… but to what avail? You delivered anything but the ordinary I am used to with other much less awesome things such as teenage magical girls!\\n\\n\r\nOk, some of this is my fault. The story only got to an enjoyable portion after the 9th episode barrier, I should’ve kept up with you in silence while you explained to your brainless victims how your plot worked for the 100th time, I should have properly ignored the apparent useless episodes where nothing of notice happened, and I should’ve kept my lack of excitement with your twists out of the room when you arbitrarily did stuff just for the sake of your current attempt to flash characters we don’t want to see.\\n\\n\r\nBut I couldn’t. And this is why I write this to you now, before you munch me, so I leave behind a testament to other people that tread this place. This way they will know that despite still looking good and interesting, you are far from your best here, and they would be much better suited looking for their visceral zombie thrill or cute girl galore somewhere else… at this day and age in a particular high school as well.",
            "date": "2011-01-17T04:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 33830,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/199926.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/711",
                "username": "711"
            },
            "url": "https://myanimelist.net/reviews.php?id=33830"
        },
        {
            "content": "So let me start by saying I haven't finished this series and that is very uncommon and under normal conditions quite stupid to review a series before you have completed it (after all if you drop it half way through or finish it half-way and decides its bad who are you to call it such after as far you know the next episode could very well be the redeemer for the whole series and all of a sudden bring the spark of life it needed to be good). So now let me get to why I am reviewing this one without finishing it (other thanthat it has completed airing yet). This is more of a warning than it is a review, if you're planning on completing this series be prepared to fork out some cash because every subbing group out there has dropped it now while I believe it is important to support artist and creators I must point out that the money you pay for DVD's and such barely even benefits them...that's right most of it goes to the company (the same is not completely true for manga and if you have the money I suggest that you probably should buy them). So yeah back to what I was saying you will only find to episode 6 online or at least that's the cap I reached after searching for hours on end for episode 7. It's a good series I honestly want to know how it ends so now I will sit here and wait patiently until I can be the DVD set cheaply off amazon.com. I promise I will come back and give this a proper review once I have seen the whole series but for now you must excuse my unenlightened and slightly negative attitude towards the series.\\n\r\nStory- This story is about the shikabane hime (misguided souls/demons that hunt other demons/misguided souls) and how they must kill 108 shikabane (demons/misguided souls). The plot indeed thickens out more to that but because of the limited number of episodes I am able to watch this is about all I can sufficiently provide you with (sorry blame funimation).\\n\r\nArt- The art for this series focus on a unique combination of well drawn normal looking characters (okay not that well drawn or normal the eyes and nose seem a little strange in my opinion) with the monsters being drawn to be absolute abominations to the human vision (they seem to using a different coloring and drawing style for each monster which I for one think is amazing if not a little unnecessary).\\n\r\nSound- Surprisingly enough what impresses me most about this series is sound I love the voice acting as I'm quite familiar with a few of the voices I here from other series. Also I love the opening to this series it perfect matches the context of creepy, undead people fighting to the death. This section however lost points from the gun sounds I've fired a lot of weapons in my days and while they did a decent job of capturing the sounds they seemed to have flubbed a little when it came to the sound of the 9mm and rifle.\\n\r\nCharacter- There the leading role (by which I mean the one we follow around the most) Ouri surprisingly has very little to do with the actual story just like us he just seems to be a confused observer that seems to get more in the way of the real heroes rather than show some bad assery of his own however we have a good understanding of his character and how his mind works by the third episode. Makina however our other main character kicks serious butt this only flawed by the fact that she is so cold and mysterious and that even by the sixth episode we only know enough about her to assume things rather than know them (but that's fine and dandy since that's her character type). Kesei I for one think should be the leading role in this series he's charismatic, funny, strong, and has the slight hint of mystery that you always need to make a good story unfortunately the story seems to be focusing more on his brother than him and that can only need to disappointment (also he's a pervy monk hehe he's tries to give his brother porn).\\n\r\nEnjoyment- Despite my whining I really do enjoy this series and do hope to finish it one day as the way things are left off now I want to near tear my finger nails to know what happens in the next couple of episodes. What can I say I have weakness for violence, hot girls, pervy monks, and killing monsters which this series has no lack of.",
            "date": "2008-12-04T15:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 10098,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40654.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aphiel1",
                "username": "Aphiel1"
            },
            "url": "https://myanimelist.net/reviews.php?id=10098"
        },
        {
            "content": "10/10. This was a series I happen to stumble upon. It took merely 5 minutes into episode 1 for me to be hooked. This series really created an atmosphere, a storyline, and characters that are enjoyable and entertaining. I watched all of season one in ONE day. \r\nThe pacing, I thought, was excellent. I would've loved to see more episodes, but they managed to give you a lot of information with a good balance between the 13 episodes. There was never a point where I was bored, or waiting for it to get on with the story. I was thoroughly involved the whole way along.\\n\\n\r\nThe character development was another really strong point. You come to care for all the characters, especially given how many characters have troubled pasts. \\n\\n\r\nThe fight scenes are incredibly animated and just BAD ASS. \\n\\n\r\nThe story is original, action paced, and tragic at times. Definitely check it out! :D",
            "date": "2010-07-21T17:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 28730,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/278094.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BlondeAssassin",
                "username": "BlondeAssassin"
            },
            "url": "https://myanimelist.net/reviews.php?id=28730"
        },
        {
            "content": "At first I thought that the series would be so great and I got so excited because this type of story is one of the genres that I really love but I had “MADA MADA” or just average feeling about it.\r\nThe story was not particularly new. It was about a girl who was already dead but was revived as corpse and gained superhuman strength. Like your typical story, she partnered a human living guy in order to gain energy. The whole story was about her killing another corpse as so she can go to heaven but it turned out she has personal reason as towhy she was searching for the villains. I strongly believe that the story itself was interesting enough but it didn’t work for the series. It was good but not good enough to leave an impression to viewers.\\n\\n\r\nThe characters were not particularly interesting, too. You can’t feel any greatness or impression from the lead characters to the villains. They were not interesting enough that you would remember their character. The main female lead was not great. Even with great abilities, she wasn’t specifically strong or special that would make her different from other SHIKABANE HIME which was so important as so to make her stand out as the lead character. The male lead also was not particularly interesting. He was weak-willed, soft, pure, and naïve. His naive character struggled a lot for the type of world the series has. \\n\\n\r\nIt was entertaining enough to make you want to finish it or anticipate the next season but that would be for the sole reason that you want to finish something that you started not because it was so interesting. I am definitely not loving it but not hating it though. \\n",
            "date": "2012-12-09T07:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 79584,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79584"
        }
    ],
    [
        {
            "content": "Story - 8/10\r\nOk. This series started on the \"monster-of-the-week\" formula, so it may be very misleading. Even the sypnosis that a Shikabane Hime must kill 108 corpses to go to Heaven is misleading. The real plot and story has really nothing to do with it. The truth is, this series does provide a reasonable and interesting plot development in the SECOND half of the season only. And the last four episodes or so does have enough plot to build up decent cliffhangers that forced me to watch the raws and chinese subs (instead of waiting for the english subs because of my impatience). But keepin mind that there is a second season that follows up directly, so this whole first season gave me the feeling of PREQUEL to the actual story (which turned out decent)\\n\\n\r\nArt - 7/10\\n\r\nSometimes, the actions are animated in a pretty sloppy way. The characters' design are sometimes too simplistic.But you may argue that it was done intentionally as a more &quot;stylish&quot; way of animation. The colors are all in the range of grey, dark red, black and deep blue, blending into a nice gloomy atmosphere befit of a horror action series.\\n\\n\r\nSound - 9/10\\n\r\nNice fighting music and nice insert songs, opening songs and ending song by angela. The music is very catchy and the voice acting is not bad. Ouri (main protagonist)'s voice sound pretty unique and has a good touch of innocence and tonelessness, befitting his strange attitude towards death (a key element in the plot)\\n\\n\r\nCharacters - 8/10\\n\r\nI would say the characters are decently developped for an anime series. Ouri's evolution is clearly portrayed throughout the series. Makina's realtionship with Keisei is revealed bits by bits in a very good rythmn. At the same time, Makina and Ouri's relationship also evolves with each episode in the SECOND half of this series.\\n\\n\r\nEnjoyment and Overall - 8/10\\n\r\nThe first half was pretty random and generically boring. The second half really redeemed itself. This is series is underrated because the first 6-7 episodes didn't have enough to keep the audience from labelling this as &quot;another generic action series&quot;. Although it is far from being a breakthrough, the second half really made good progress in terms of plot and character development. It does deserve the slightly above average rating of 7.5 to 8 out of 10.\\n\\n\\n",
            "date": "2008-12-25T10:11:00+00:00",
            "helpful_count": 110,
            "mal_id": 10622,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21160.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wakka9ca",
                "username": "wakka9ca"
            },
            "url": "https://myanimelist.net/reviews.php?id=10622"
        },
        {
            "content": "Shikabane Hime: Aka is an anime that deals with the issues of death and life in an interesting manner. However, despite some of this anime's strengths, there were weaknesses littered throughout this series.\r\nThe main thing that the story gives is uniqueness. After being murdered, Makina Hoshimura turns into a \"living corpse\". Armed with dual sub-machine guns, she must kill 108 other corpses in order to gain entry into heaven. She is assisted in this task by Keisei Tagami, a Buddhist priest with links to an anti-corpse group known as the Kougun Cult. The setup of the storyline is rather unusual, and there have not beenmany anime that look at a living corpse working together with a living person to try to destroy other living copses.\\n\\n\r\nThe animatioin was very decent. Each character had their own distinguishable look. The background was very well done and the action scenes are pretty good as well. Gainax is known for creating some of the greatest animation in the industry, but in this anime the art didn't deliver what it could have. Something the animators did very well was creating the mood with the dark animation. You couldn't help but feel scared in some scenes because of the dark backgrounds. Gainax did very well in creating atmosphere.\\n\\n\r\nThe opening theme was very, very good. Other than that the sound was meaningless. I don't remember the sound being a big factor in the anime.\\n\\n\r\nThis anime seems to focus mainly on Ōri and Makina. There was only one character that I truly liked, and it was Makina. She is the main character and a contracted &quot;living corpse&quot;. She is tasked with killing 108 corpses to gain entrance to heaven. She has formidable physical skills and her weapon of choice is an Ingram MAC11 machine gun. Makina starts slow but develops faster than Ōri and by the end of the season she becomes a great character. The main male character, Ōri himself, was really annoying at points. Ōri Kagami is a normal high school boy who was raised at Keisei Tagami's temple. He coincidentally appears at several points where corpses appear and the reason of this is unknown. Ōri is a bland character that slowly develops as the story progresses.\\n\\n\r\nI didn't really enjoy this anime. I kept looking at the time and wanted it to finish faster. It wasn't all that bad. It was pretty confusing but there were a couple episodes that were really good.It was a pretty decent anime. Nothing special but decent.",
            "date": "2009-01-31T09:19:00+00:00",
            "helpful_count": 42,
            "mal_id": 11977,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48866.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ManU-Alchemist",
                "username": "ManU-Alchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=11977"
        },
        {
            "content": "Shikabane Hime&hellip; I wasn&rsquo;t going to do this one either&hellip; seemed a bit too generic. But I bit the bullet and watched it anyway. It wasn&rsquo;t good. It wasn&rsquo;t bad. It was just&hellip; decent. I&rsquo;ll probably watch the next episode to decide if I keep it on my roster for the season. Production values were all right. The OP isn&rsquo;t really memorable, and neither is the ED. The general BGM throughout the show is okay, but isn&rsquo;t really memorable either. It&rsquo;s kind of a shame that music isn&rsquo;t memorable at all in this show. I thought it could really have potential, considering the premise ofthe show is somewhat Bleach like, and Bleach had great music. The animation was all right as well&hellip; a bit jumpy in some spots, but generally fluid. The character art was decent, and semi-consistent, though I say that their noses are far too large for anime. Its just kind of a shame that nothing really stands out as spectacular in this anime. I suppose I should give it time to see if it blossoms, but my cynicism won&rsquo;t let be get my hopes up.\\n\\n\r\nThe premise of the show is very Bleach like, which is not to say that it&rsquo;s a knock off of Bleach, but they are very similar. Spiritually sensitive kid lives in a temple, and sees spirits. He has three friends that have anime stereotype personalities (Rukia is the only good female main character in Bleach, god dammit!). He stumbles upon the main female character Makina, who is a shikabane hime (someone who hunts shikabane, I&rsquo;m guessing) and he is startled that she&rsquo;s dead. He has a trippy run in with a spirit cat that tells him things, but eventually he shrugs it off. Yagami, the male lead, moves out after this incident. It turns out that Yagami&rsquo;s aniki Keisei is the head of this secret society that hunts shikabane. Shikabane are corpses that have enough will to keep moving after death, and its Makina&rsquo;s job to hunt them. I&rsquo;m guessing that Keisei loves Makina or something, because they make it pretty damn obvious when you compare his attitude towards her to the other members of the society. Well, nothing really happens for most of the first episode, then at the end, Makina kicks ass with sub-machine guns and takes out the shikabane for the episode.\\n\\n\r\nWe can all guess that soon, Yagami will delve into all of this business, as he has met Makina. He saves her from being permanently dead (which had a trippy mind-fuck sequence) and then she slaps him and books it. I&rsquo;m kind of disappointed in the first episode. It had real potential to be memorable, but it just didn&rsquo;t wow me. Check it out if you want. I&rsquo;ll probably watch the next episode before deciding anything. I give the show a total 6/10. I should note that this show is already slotted for a sequel, even before the first episode aired. It better turn out damn good, or I get to get out the pimp hand.\\n\\n\r\nProduced by Gainax. Airs on Thursdays. Subs by Lunar.\\n",
            "date": "2008-10-08T15:57:00+00:00",
            "helpful_count": 24,
            "mal_id": 8522,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102053.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/legacy3233old",
                "username": "legacy3233old"
            },
            "url": "https://myanimelist.net/reviews.php?id=8522"
        },
        {
            "content": "Gainax is know for producing great anime and though Shikabane Hime: Aka may fall short in some anime viewers opinion I for one disagree.\r\nStory: The story followed a cliche of \"woman fights monsters, guy waits in sidelines\" & \"protagonist is the only one who can kill the monsters\".\r\nthough people may think its cliche and played out (which it is) Shikabane Hime doesnt stray from its cause. \r\nBleach anime held the exact same features that Shikabane Hime: Aka did with \"monsters come from people who don't yet want to \"pass on\" and thus become monsters in order to stay\".\r\nbut what Bleach didn't do was keep thatmotion of helplessness where the hunter was alone and had to fight alone the majority of the time. Shikabane Hime: Aka is still catching the feeling of weakness where the protagonist is still fragile though she is almost immortal.\\n\\n\r\nArt: isn't very catchy. Very simple scenes like bullets dropping wasn't new but felt satisfying. Hair styles where done cheaply (a first for Gainax). backgrounds and such weren't a letdown. some scenes depicted chibi or other comical relieving art which in my opinion made lite of the story or progression of it. and fight scenes were shortened in a disappointing  way.\\n\\n\r\nSound: The music, sound effects, voice actors are all decent.\\n\r\n though none of them are renown voice actors they still play their parts well catch people into the story. the music wasn't bad in-fact it caught my attention and made me check out the song artist.\\n\\n\r\nCharacter: Cliche, slow development that builds its way up. not much to say.\\n\\n\r\nEnjoyment: i for some reason found the anime very catching after i watched it.",
            "date": "2008-11-21T02:12:00+00:00",
            "helpful_count": 15,
            "mal_id": 9718,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sousen",
                "username": "Sousen"
            },
            "url": "https://myanimelist.net/reviews.php?id=9718"
        },
        {
            "content": "Shikabane Hime is a action horror hybrid from Gainax. It centers around undead girls who are given a chance to enter heaven if they fight and kill other undead. Equal parts exhilarating and disturbing, Shikabane Hime feels like a shounen with heavy horror undertones. This combination is what makes the show worth watching, especially in its later stages, despite its numerous shortcomings. Just for the record, this review covers both seasons: Aka and Kuro.\r\nShikabane are monsters born of strong regrets a person might have when they die. Ageless, powerful, and bearing an animosity towards the living, shikabane are a threat to mankind. The only lineof defense against them is the Kougun Sect, who employ the use of undead girls, called shikabane hime, to eliminate shikabane under the supervision of a contracted monk. If a shikabane hime is able to kill 108 shikabane, then they can enter into heaven. Makina Hoshimura is a shikabane hime with a vendetta and a strong bond with her contracted monk, Keisei Kagami. However, things begin to unhinge when Keisei's adopted younger brother, Ouri, becomes involved in the secret battle between shikabane and the Kougun Sect; a battle neither Keisei nor Makina want him to be involved with.\\n\\n\\n\r\nThe show starts off with an episodic \"monster of the week\" type deal. These opening episodes are in the same vein as Vampire Princess Miyu (the TV anime, not OVA), with our heroin hunting down and destroying shikabane; just done much better than Vampire Princess Miyu, namely because of the more exciting fights. At the same time, the show follows Ouri as he slowly finds out about shikabane and the Kougun Sect. These episodes are the show's weakest because while the fights are all good, the scenarios are hit-or-miss, and time with Ouri is usually dull. Luckily, the show starts getting better mid-way through the first season, when Ouri gets deeply involved with one shikabane hime, having tragic consequences. Characters get some god character development: Ouri struggles with the fact that shikabane hime are dead, Keisei laments Ouri's increasing involvement with shikabane, and Makina's reasons for being a shikabane hime and past with Keisie are relieved. All the while, the viewer is treated to more grotesque scenes of horror and gleefully violent action sequences. Near the end of the first season the main antagonists, a group of shikabane called the Seven Stars (because there are seven of them), appear and aline with the previously introduced Traitor Monk Akasha. In retrospect, I wonder why they didn't do this earlier in the series, as it would have made the show more evenly paced.\\n\\n\r\nThe second season, Kuro, moves at a break-neck speed compared to the first. It is so overstuffed with twists and plot revelations, there is no doubt the show as a whole could have been paced better. Still, it can't be accused of being boring. There is a certain shounen-esque excitement to having a villain league like the Seven Stars in the fray.It is fun to watch Makina take them on one at a time. There is also a lot more drama in this season, mainly concerning Makina and Ouri, which is pretty good; but also some drama involving minor characters which really doesn't go anywhere, just adding more fluff to the already cramped running time.\\n\\n\r\nOne thing the show definitely could have handled better was its themes. The show deals a lot with death and regret, but scarcely actually explores them. There are a few occasions where it does, like at the end of both seasons, but for the most part the concepts of death and regret are thrown around like \"friendship\" and \"courage\" are in a typical shounen. There is also the issue of the relationship between shikabane hime and their contracted monks, which is somewhat like the Fratello in Gunslinger Girl (except including complications of having more matured bodies...), but handled far less maturely. Their relationships range from being as complex as the one between Makina and Keisei (and Ouri), to as simplistic and one dimensional as the one between Saki and Rika. One particularly nasty one is Minai and Itsaki, which is the equivalence of Jean and Rico from Gunslinger Girl, unfortunately does not get enough development (even though an extra episode was dedicated to them).\\n\\n\r\nAs I mentioned at the beginning of the review, this is from Gainax, which means it is going to at least look decent. The show goes for a dark look, even with the vivid color pallet found in most Gainax series, with shading  which borders on unnatural but still suits the show well. Backgrounds are fairly well designed and characters have that certain cartoon-ish expressiveness you will usually find in a Gainax work; the shikabane are a bizarre looking bunch. There is also the copious amount of fan service we've come to expect from Gainax as of late. The animation is for the most part solid, a bit of spottiness here and there but nothing to complain about; the action scenes are treated well. The music does its job of controlling the atmosphere, especially during the tense moments, but honestly you are just not going to remember it. Not the best of Gainax's projects, but certainly not bad at all.\\n\\n\r\nTaken as an action horror, Shikabane Hime is a decent show. It doess have some major problems with its themes and pacing, which are honestly kind of a mess. However, if you are in the mood for violence, disturbing imagery, and maybe even some solid drama, then you might want to give Shikabane Hime a try.",
            "date": "2011-06-17T23:53:00+00:00",
            "helpful_count": 12,
            "mal_id": 38002,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229558.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeverKnowsBest26",
                "username": "NeverKnowsBest26"
            },
            "url": "https://myanimelist.net/reviews.php?id=38002"
        },
        {
            "content": "Shikabane HIme or Corpse Princess was a horror,action and martial art anime,with his and her whole family been killed by a group of shikabanes which is Shichisei,Makina seek a revenge against Shichisei with the help of Keisei Tagami as her contracted Monk and a long with Ouri kagami as the younger brother of Keisei Tagami.At the beginning of the whole episode it only tells what is Shikabane are and how shikabane exist and what the contractor monk use for.At the beginning the story was a bit slow,only a few importance information about the Shikabane been told,even the plot development was a bit slow at thebeginning,but at the middle of it the plot development is getting interesting with the pace are getting faster with the introduction of new Shikabane and their Contractor monk and some of action and corpse,However,until the last episode of Shikabane hime:Aka the story was left a big cliffhanger and this's when the second season Shikabane Hime;kuro take places for the cliffhanger....\\n\r\nThe Art for this series was to be par for good and bad,some of the animation was sloppy even the action scene was a bit sloppy but still good,the character design was simple and each character had their own distinguishable look,the environment and background was too simple and the colours are a bit dark just to blending into the gloomy atmosphere for most horror genre.\\n\r\nThe Sound,the OP/ED was very catchy and it was easy to listen and the BMG was some of it was fit to some scene like the action scene the BMG was a bit disappointing and it was sloppy a bit and some part of the BMG was didn't fit at all for that scene.As for the voice actor sound most of the char are fit with it,and a bit disappointed for Makina voices it just that voices are didn't fit for it at all....the seiyuu has a unique voice but for Makina personality it didn't fit for it.....\\n\r\nCharacter,the story are mainly focus only for Makina and Ouri character develop with a bit by bit the develop between them are evolved,with supported character helped the character development like the other Shikabane and the contracted monk,and that make some of the supported character didn't develop too much,but some of the supported character and the contractor monk got it flash back for how they meet and and become Shikabane...\\n\r\nOverall,truly this anime was enjoyable to watch,it wasn't that bad at all it was a decent anime but t still worth to watch for those who like horror,action and martial art genres.......however the enjoyment still continued at second season for it...",
            "date": "2015-01-04T03:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 176105,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4020933.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xsis",
                "username": "xsis"
            },
            "url": "https://myanimelist.net/reviews.php?id=176105"
        },
        {
            "content": "I have to admit I’m fairly conflicted about this one. I decided to watch a random anime and I got this one, so I figured I should check to see if there’s a sequel, or a prequel, and how time-consuming it could be and there it is, the biggest spoiler I could get about the finale of this particular part. I nearly dropped it right then and there, instead I decided to wait but even after quite some time I still remembered that someone dies at the end. So the ending was pretty much ruined for me. \r\nPutting that aside it was a very enjoyableride so far, I am yet to watch the second season so to speak, but I’ve certainly enjoyed this one. The characters aren’t anything too fresh to be frank. There’s a badass girl using guns, a kid placed into situations beyond what he could possibly handle just so the main character isn’t more knowledgeable about this entire concept than we as an audience are. It does work as it keeps us wondering what he could do to possibly evade death this time, seeing as he is about as clueless as we are. \\n\\n\r\nSo this brings me to Ouri, the he who meets all the right people in this series. Keisei is a contract monk, alright; he’s his brother figure, that’s fine. But his part-time job boss just so happens to be one of the most powerful people in the series. Add in all the encounters starting from Makina, to Minai and others and he just so happened to have a connection to people two Shikabane knew, which wouldn’t be that much of a problem if the second battle wasn’t decided by that factor. That’s pretty much the one and only major flaw I could point out. Ouri as a character is probably my favorite, I like the mystery around him, I like his growth through the first thirteen episodes, I got to see an ordinary, as far as abilities go, clueless teen grow into a so far nicely developed character. I can sympathize with him, I can relate to him, I can’t exactly understand his attachment to death, but I can accept it as a character trait that he could reasonably have. So aside from having connections with all the right people I really do like his character. \\n\\n\r\nThen there’s Makina, at first I wasn’t too keen on her, sure she was a badass but aside from that I didn’t see too much of a personality. But as episodes went by I came to appreciate her character. She’s far from a simple character, though she’s not exactly that complex, she’s in the fine middle with enough traits to grasp at. Her reasoning, her purpose and what drives her, it’s all out in the open, but it’s the culmination of all those things that make her interesting, she’s driven, doesn’t open up easily and it all goes back to her death. If I saw more of her while she was alive I’m sure there would be an even clearer picture of who she is as a person, but even now it is fairly enough to get me to like her. \\n\\n\r\nAkasha and the other main villains, Seven Stars, on the other hand left me with a feeling of not much going for them. They do succeed in moving the plot, but aside from few things here and there I haven’t seen much that would make them memorable, but I’m assuming and hoping the remaining twelve episodes will change that.",
            "date": "2018-08-03T09:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 285467,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3924529.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/VergilLeonidas",
                "username": "VergilLeonidas"
            },
            "url": "https://myanimelist.net/reviews.php?id=285467"
        },
        {
            "content": "Just gonna say this straight off the bat - a VERY average show, despite the interesting concept. If you've just gone sifted through 4 or 5 average shows because you thought you'd find them interesting, hold off watching this or you will just bore yourself. Anyways, onto the review!\r\nI got into this show because I had zombies on my mind (probably because I've been looking at zombie video games/mmos) and decided to scout out some zombie anime. I stumbled across this. I will warn people now, some may consider this spoiler material, and I suppose it is, because I'm going to sum up the plot:-\r\nWhena person dies, sometimes they do not depart from this world. They become corpses, and many turn corrupt and want vengeance on the human race because they died. Some, however, have a relationship with a Shinto priest. Because of this, they help rid the Priests of the corpses. They are called Shikabane Hime - oh, the title of the show! How fitting... Reason it scores high is its setting of Japan. Because I simply cannot get enough of the island. 8.\\n\\n\r\nCharacters - bit of a mix up to my usual setting of a review. We follow the story of Ouri, an orphan (I think) who grows up in an orphanage of sorts that's run by the local priests. Anyway, he moves out once, I dunno, he's turned 16, dunno how it works over in Japan. Ouri is at least relatable - we learn about the story and background as he does. I like that, sometimes shows put you ahead of all the characters then they have to be dumbed down. \\n\r\nThere's a slight catch. Kensei, a priest working (well, suppose an orphanage isn't exactly a workplace is Ouri's brother, which is why Ouri is not exactly an orphan. I've made that more confusing then it actually is. Anyway, Kensei, like the other priests (yeah, the orphanage I guess is also the local temple because Kensei and Ouri's dad is a bishop, like a corporate executive of the whole Shikibane Hime thing... Really, it's not this confusing!) is a contract priest, meaning he has his own Shikibane Hime fighting corpses with him. Her name is Makina. Anyway, Ouri, despite not wanting to be a priest, gets caught up in all this, knows about the shikibane hime, the work they do, and all the characters get fleshed out, including how Makina became a shikibane hime and what relationship she has with her priest. The first half of the show takes on a 'monster-of-the-week' formula while a plot twist kind of intertwines it's way halfway through, which many will see coming to be honest, and maybe that's why I think the show is average. 7.\\n\\n\r\nArt - Again, standard CGI fair, but even in other shows I've reviewed (Love Live and SAO to name two) it's been done better. 6.\\n\\n\r\nSound - Nothing of key interest, kind of a gothic, piano interludes - a soundtrack similar to Mirai Nikki (Future Diary), but not as striking and 'metal' as that. 7.\\n\\n\r\nOverall, this was enjoyable enough, but certainly nothing but average. Worth a look for the characters and maybe a couple of tunes to add to your phone/mp3/ipod, but other than that a short show to fill your anime void if you have nothing else to watch. 7.",
            "date": "2014-04-11T14:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 139587,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2501829.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Waldy565",
                "username": "Waldy565"
            },
            "url": "https://myanimelist.net/reviews.php?id=139587"
        },
        {
            "content": "Very very nice! \r\nDid not like it much when I watched some episodes while it was ongoing.\r\nHad almost made up my mind to drop it,  BUT then I changed my mind, and started watching it all over. \r\nWatching it back to back made one helluva difference.\r\nIt has some comedy, which often means I don't like certain series. Heavens be blessed that did not happen while I was watching Shikabane.\r\nI'm so happy I decided to give it another try. The story and the characters interaction makes it a great watch.\r\nI want to watch the sequel Shikibane Hime Kuro, but I'll hold my breath and trynot to start watching it until it has finished airing.",
            "date": "2009-01-23T16:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 11786,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/131376.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TwoSoxs",
                "username": "TwoSoxs"
            },
            "url": "https://myanimelist.net/reviews.php?id=11786"
        },
        {
            "content": "Well, to start, I binged Watched this one thanks to our friends at funmation.  So I have one review for both seasons (plus bonus).\r\nI was both pleased with this one, and also very displeased.  I know, I know.. you want me to make sense.  Lets get the mechanics out of the way.\r\nCharacter Development:  Not bad.. Most of the main characters (I stress MAIN) are developed well.  they have depth.  Some of the secondary and lesser characters are paper thin (Ie:  the otaku Hime).  \r\nAnimation:  Well done.  At least to my preference.  Detailed back grounds,interesting colours and scenery, smooth animation.\\n\\n\r\nSound:  Also Well Done, except for some of the music overlays.  I felt them to be too loud, and were drowning out the convesations.\\n\\n\r\nSigh.. Story:  I felt the premise to be interesting.  and the action and story development for the most part were good.  And this is the part that kept my attention, Dispite the rest.\\n\\n\r\n  I found the ending to be poor (EDIT:  By ending here, I am refering to Climax of the story), the story lacked the substance needed to pull of such a strange twist.  It ended like so many other animes..  Feeling rushed.  Also, I felt the whole segment about Shikabane Mother could have been chopped from the story line.  It did nothing to advance the main story line.  they could have used those few episodes to make the main plot clearer.\\n\\n\r\nI did like how the very end (The wrap-up portion after the action) left you hanging.  Perhaps a movie?  or another season.  It was left in such a way as it could stay the way it is, or not.\\n\\n\r\nOverall:  I do not regret the time watching this, and I will likely buy it (when I see it), and watch it again.  However, I do not feel this will be an anime that will be remebered in the long run\\n",
            "date": "2009-06-22T22:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 16014,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197617.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ferren",
                "username": "ferren"
            },
            "url": "https://myanimelist.net/reviews.php?id=16014"
        },
        {
            "content": "Halloween is coming up (Or already passed depending on when I finally get this review done) and so what better way to get the chills is to watch a show about corpses coming to life and killing people, right? What I didn’t know about this was that there was a whole bunch more to this show that meets the eye. It brought some questions I never thought I would have to ask myself. \r\nSo when we get into the characters, Kagami is our ‘main character’ of sorts. I call him a main character even though most that I read has had Makina as the maincharacter. Anyway, Kagami has a rather strange personality. At first I found it very hard to believe his reactions to the things happening around him. He wouldn’t freak out at all like a normal person would when faced with the walking dead. He only seemed to react when Tagami, his ‘brother’, teased him. He was out of touch with the real world and had a very drab voice to go with it. As I watched though, I found it easier to understand him slightly, though it did not make him any better at times. Makina is pretty much a tsundara in basic form but then there are parts of her that I would argue that statement. She isn’t a typical tsundara; she has a good reason not to connect herself to those around her. Although she does seem to fall in love, I don’t think she ever really forgets enough of her situation that she falls into the want to leave it all behind. Tagami is… How do I explain him? He has a split personality that makes it hard to actually know what he is going to say. One moment he can be rather smart and wise beyond his years and the next he is acting like a perverted high school boy. I can’t figure out exactly what goes on in his head but I’m pretty sure its messed up. He did break up the tension though with his strange form of humor though which was a nice switch.\\n\\n\r\nCan I ask why a Shikabane Hime needs to dress like a high school girl? Because I don’t understand some of the outfit choices of her and of some of the monks. I mean really, Makina wears a school girl outfit, the sword princess has extremely high heals, there is one monk who wears what looks to be a very small bra under a lab coat, there are some really confusing hair designs in a couple of characters. I thought that if you’re going to fight a demon, then you shouldn’t wear those types of clothing. There is also a thing in that these Shikabane are basically dead people, so dressing them up in outfits that make them look ‘sexy’ just makes it really awkward. There is also another question I have to ask, WHY ARE ALL THE SHIKABANE HIME WOMEN? The way they talk about it, shouldn’t men also turn into them as well? I understand they say Hime meaning Princess but I am sure that men could also be made one.\\n\\n\r\nNow along with this being a show that has a very high supernatural and horror base to it, there was something I don’t think many notice while watching this. It is the question of ‘what does it mean to be human, to be alive?’ It actually is a basic question that I got throughout the show. They keep going back and forward in the idea of what Shikabane and Shikabane Hime mean. They keep on talking about how Shikabane are just people with regrets, and then how Shikabane Hime is those who are only there to kill Shikabane. The Kougon Sect. (the group that has the Shikabane Hime) seems to be split on weather or not Shikabane should be treated as objects or people. So here I ask you, the reader, a question. What does it mean to be human or to be alive? Does it mean you must have a beating heart and able to breath… or does it mean you should be able to feel, to think, to understand right from wrong? \\n\\n\r\nThe artwork is rather dark and full of blacks and purples, much like many of the shows that revolve around the supernatural and hauntings. But it’s not all like that. When they are in the normal world, things seem to take on this misty coloring like it was all a dream. It gives a good balance between the two different worlds and also makes the world of the supernatural look more real then the real world. I know that sounds strange to say that, but the real world in this show seems more like a fantasy or a dream with how bright the supernatural world looks. Sometimes with the action, it doesn’t look all that well. Gainax has this thing where when some action happens, they seem to put a lot less work into it. The opening is pretty nice but with the ending, up to episode 5, they were only using scenes from the episode. At 5, they made an actual ending which had a couple pictures of characters.\\n\\n\r\nThe English dub isn’t much to talk about. It’s pretty bland, especially our protagonist. Kagami just sounds as though nothing ever fazes him. His voice is low and draws out a bit. I think I get a little of what Aaron Dismuki was trying to do but it didn’t work that well. The only time he actually shows off any sort of emotion is when Tagami is teasing him. Even when he finds out that a girl that he knew came back to life, he just seems to stare blankly at the screen he is watching. I don’t know if its just the characters personality or the way the voice actor brought him out as but I think it’s a little of both. I do believe Aaron does get the emotions down when he does put effort into it. Greg Ayres surprisingly did a very good job as a strange talking black cat to a point that I had no idea he was the one voicing him. It’s the perfect sort of haunting voice you would think a mysterious cat would have. You definitely can’t tell weather the cat if friend or foe which I really think is part of his charm. Luci Christian does a pretty good job of Makina with her very harsh style of talking. She is the perfect Tsundara character for this sort of story and I think part of this was because Luci herself has played a lot of Tsundara characters. One of the saddest things for me to say right now is I don’t think one of my favorite voice actors should have been brought in for the voice of the Buddhist Monk. J. Michael Tatum doesn’t really catch the right air I think Tagami was supposed to have. He was rather good for when Tagami got rather series but something just seems a little off when he is trying to do the funny parts of the character. The music is actually rather good, giving an intense feeling when it’s needed and a softer feeling when a sad point is. Sometimes for the sad or emotional points, you can barely hear it which I actually think works well. It makes to try to listen more intensely so you don’t miss anything. \\n\\n\r\nOverall this show was actually rather good and a perfect show to watch for Halloween. It has a lot of gore, violence, and mystery to keep you wanting to watch more, although the ending was a little bit of a cliffhanger. Luckily there is a sequel and though I haven’t seen that yet, I am looking forward to seeing how it goes. Even with all the gore and violence, there is also an interesting philosophical question that I look forward to uncovering just how they will answer it. \\n",
            "date": "2015-10-28T23:48:00+00:00",
            "helpful_count": 5,
            "mal_id": 202189,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=202189"
        },
        {
            "content": "I could describe this anime in so many words: touching, exciting, creepy, beautiful, interesting, moving, powerful, and a thousand more. \r\nI really loved the relationship between Makina and Keisei. They were so beautiful as a partnership, and I would love to watch the two of them forever. \r\nI also loved Ouri. His tenacity and strength is so admirable. He put himself through so much strain and hurt for his brother and Makina. \r\nI'm really glad the history of the Shikabane Hime vs. regular Shikabane was touched on (I think more so in the second season than the first). It was interesting to learn about thestakes of being one or the other as well as the stakes for simply being tied to a contracted monk. \\n\\n\r\nBasically, this quickly became one of my favorite anime series, and I'm so glad I decided to watch it.",
            "date": "2018-01-13T17:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 268458,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=268458"
        },
        {
            "content": "I picked this series by chance after reading its premise about a high school girl which by the way is undead fighting to extract revenge to an organization that wronged her.\r\nThe story revolves around a young man named Ouri in his quest to solve the supernatural mysteries which involves unexplainable deaths that is occurring in his town. While being episodic with the 1 monster-per-week format until about halfway of the series, a lot of things happened in those episodes that told bits of the main story moving the series forward such as meeting up several important characters, his discovery of what his hidden talent cando, and several other events concerning the Kougan cult and the Shikabane Himes in particular. When the real antagonists finally started showing themselves during the middle part of the series, it was at this point that the show finally started to get really interesting. The finale for the series leaves a lot of things to be desired that was later answered when the second season was aired.\\n\\n\r\nThe animation for this series is dark, very dark, even when the setting is daytime. It is something that the viewers can eventually get used to because it suits the series quite well as the story is shrouded in mystery and supernatural phenomena, so a dark setting is really appropriate. The background and characters are somewhat lazily drawn, having poor details and generally bland. The animation is not really sharp and crisp makes you wonder if the series is really an HD show or an upscale. The bright points of the animation are the fight scenes, it is detailed in such a way that makes the effects looks stylish and nicely choreographed while maintaining the simplicity of the animation, special attention was given to the animation of the Shikabane-Himes since they provide the fan-service for the series.\\n\\n\r\nMusic is not really the strength of the series. The OP and ED themes provide a good feel for the series but not really memorable at all. The soundtracks are pretty decent especially during the fighting scenes and several other important scenes have a nice selection of songs playing in the background. Voice acting on the other hand is fairly good. Note worthy amongst the cast are veteran seiyuus such as Sugita Tomozaku, Horie Yui, Fujiwara Keiji, and Yuuki Aoi. What is surprising for me are the seiyuus of the main characters namely Akiyama Nana which voices Makina and Hasome Tatsuya for Ouri, both are very new in the business but did a very good job giving voice and life to the characters they portrayed.\\n\\n\r\nI generally preferred female leads that have strong personalities, one that doesn't back down and is always up to the challenge, so Hoshimura Makina is a big win for me and an important factor that made watching this series an enjoyable experience. In addition to that, she is also hot and cool when she wields her two guns and start shooting on her opponents. The male lead Kagami Ouri is also not to be toyed around. He could be annoying at the beginning especially when he came across to the mysteries that revolved around him but he developed into one fine male lead as the series progresses. The other main character that give huge impact to the story is Tagami Keisei, initially a very secretive character but with his relationship with Makina slowly being revealed, his presence is pivotal into closing the gap between Makina and Ouri. There are also several characters from the Kougan cult, other Shikabane Himes, and antagonists that made an appearance mostly to progress the development of the main characters.\\n\\n\r\nShikabane Hime: Aka is a fairly well done series as a whole. Despite it short-comings in animation and the episodic format in the start, it didn’t affect my overall impression of the series which is more on the positive side of things as it improves at the midpoint and ended with a lot of questions that was eventually answered with the airing of the second season. As for my final note, I would recommend this series for viewers who like stories that are supernatural in genre with lots of action, gore, drama, and hints of romance.\\n\\n\r\nNote: This is a re-review of Shikabane Hime: Aka\\n",
            "date": "2011-06-29T15:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 38473,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384609.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ghostalker",
                "username": "Ghostalker"
            },
            "url": "https://myanimelist.net/reviews.php?id=38473"
        },
        {
            "content": "People are falling victim to creatures called Shikabane, which happen to be reanimated corpses with superhuman and even supernatural abilities. There exist an organization made up of monks who deal with them by using reanimated girls called Shikabane Hime aka Corpse Princess. The girls also possess superhuman abilities. One of their number named Makina, goes into battle against them equipped with two uzi's, along with her guardian a Contracted Monk by the name of Keisei. Together they battle the monsters across the city. But there's a greater threat approaching with sinister motives. -summary\r\nCorpse Princess is another one of those by the number, action oriented titlesthat are a dime a dozen. The core premise is the usual girls with guns vs. monsters, and while I was watching the show it felt as if I was watching three other series simultaneously. Therefore, it's a no brainer that originality was never intended to be factored into the equation. Despite this though, there was quite a bit going on that held my attention, and most of my huge pet peeves were kept to a minimum. The action in the series is nothing to really turn a nose up at either. At this point, I would say that the series is a solid action romp. For the record, this is the first half of two, titled Corpse Princess: Aka, with the second being Corpse Princess: Kuro.\\n\\n\r\nThe plot follows Makina as she battles the Shikabane; her missions become complicated when she constantly runs into her handler's younger brother Ouri. He eventually becomes dragged into the feud with the monsters. At first, it's the standard good vs. evil that results in action packed episode ending showdowns. However, the stories are rather interesting when moving from point A to B. I really don't mind the lack of originality as long as there's some type of creativity thrown into the mix. \\n\\n\r\nThe Shikabane they come across don't always have interesting abilities, instead their origins and episode story elements are sometimes the main draw. For example, one episode sees a doctor completely controlling one that is protecting something important to it, at the same time, he's injecting people with the cells from the beast, and he's given the idea from a mysterious benefactor. This eventually leads to the supposed lead antagonist of the series. Along the way, although there are several detours, the story eventually begins to take some type of form. My interest began to be aroused when a faction called the Seven Stars were introduced, and Ouri's mysterious background begins to come into play as well.\\n\\n\r\nThe style of the series is rather dark at times, but there are slight tonal comedic shifts that take place. I doubt it's a secret that I don't care for segments like these, however this is one of those cases where it actually works. The comedy rarely, if ever, clashes with the tense moments which is a plus; and I think the main reason I can let this pass is because Corpse Princess knows exactly what it wants to be, and that's light entertainment in which it succeeds at. There is actually no attempts towards being high art at all, and I have to commend the writers for this because one thing I can't stand is an anime with an identity crisis.\\n\\n\r\nThe characters are indeed cookie cutter though, for the most part, they're plot devices we have seen about a hundred times before this point, and that is never a good thing. They consist of the tough chick, and whiny male teen who has to question all of her motives, and like always it can be annoying. Thankfully, there are side characters with different abilities who occasionally appear, and sometimes they even have their own drama to deal with. The story behind the Shikabane is interesting in a way, but it feels way too similar to Bleach. People become those creatures when they pass away with certain regrets or obsessions. Even though it feels familiar, this sometimes plays into their powers which adds an interesting twist to the encounters. Corpse Princess does feel like other things, but it tries its hand at being creative.\\n\\n\r\nThe visuals are pretty good with some fluid action scenes that rarely go the lazy route. There's quite a bit of high intensity shootouts and fist to face segments. The battles are well-lit spectacles that I found to be entertaining on some occasions. I found the character designs to be about so-so, and the backgrounds are dark most of the time, which suits the supernatural element properly, especially since all the battles either take place in the night or inside very dark structures. The soundtrack features two J-Pop songs for the opening and ending that I can imagine some folks getting into. While the BGM is nothing to really brag about outside of complimenting the style rather well.\\n\\n\r\nThis first half has its good moments and the story ends on a cliffhanger after a very predictable plot twist. The fan service ranks between very tame to almost non existent, and the gore is moderate. If only the characters weren't cut from the same cloth as so many other shonen heroes, it would probably be better. Still, if you dig hot chicks with guns taking on monsters, then Corpse Princess is something that's worth a look.\\n\\n\r\nHighs: Production values, light entertainment that pretty much succeeds\\n\\n\r\nLows: Bland characters, feels too familiar in many places",
            "date": "2015-11-05T17:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 202758,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4526092.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Luquillo",
                "username": "Luquillo"
            },
            "url": "https://myanimelist.net/reviews.php?id=202758"
        },
        {
            "content": "Shikabane Hime is a barely decent anime that was released in 2 parts: AKA & KURO. For the purposes of convenience, my review is about both parts because its all really the same story and if you watch one part, you'll likely watch the other part as well. From the outset I had a problem with this series. starting with the title \"SHIKABANE HlME\" If it were just the anime title l'd be ok with it but it is a somewhat silly name for a zombie slayer. Why HIME? Is there a king, a queen, a prince? No there isn't it's just once again noone used their imagination or creativity. They know anime viewers all around the world have cottoned on to the Japanese word \"Hime\" by now so hey, why not use the word HIME in the title....it worked so well for Mai-HIME, right? Names aside, like I said, its a barely decent shonen fighting anime about monks & monsters. Of course the monks don't go into battle alone, no, they mostly fight by proxy via supposedly dead little girls dressed in all manner of skimpy or tight-fitting outfits catering to the various otaku fetishes.\\n\r\nI really did not pay attention to the music of this series. I did watch the anime in English audio and I must give credit to the actors, they were pretty good even if the script was just proper shit. Lucy Christian is pretty much good at everything and I especially appreciated Aaron Dismuke's voice, maybe because you just don't hear too many authentic teenage male voices in anime.\\n\r\nNothing earth-shattering about the art here at least not for me. Maybe for teenage boys and horny otaku. I can't remember anything about the places in the anime... Probably because they were just flat and boring or maybe because the art is more focused on the characters, monsters and fighting scenes.  And even something about that annoyed me... like they plagiarized the fighting scenes from Naruto. Didn't that water fight scene between Makina and Hokuto seem eerily similar to the water fight between Naruto and Sasuke? It's the things like that through out the series that got on my nerves. Not just being simply unoriginal but almost seeming to copy bits of successful anime.\\n\r\nThe story is a very basic one, demons exist and there are those that must kill these demons. Nothing supremely new here. Once again I'm a bit underwhelmed. It doesn't take a rocket scientist to see that somewhere, some dude (erm company) said \"Hmmm, I need to make a story about hot chicks fighting in skimpy clothes...let's build around that idea!\" I say this again because the obvious questions arise \"Why HIME?\" Why only girls do battle against the shikabane? Clearly there are male Shikabane, surely the same arrangement can be made. There was some flimsy answer provided, one that they (the creators) easily punched holes thru and contradicted themselves with because there is no genuine interest in cultivating a genuine answer much less perpetuate story integrity. The only real focus is about having big-breasted school girls fight in skimpy clothing and watch it get ripped up. Let's keep it real. Let's keep it 100. I'm actually surprised no one busted out with tentacle monsters.\\n\r\nOK so with the obvious aside, the next logical question is; Is there a real story there, Is Shikabane Hime really worth watching? The answer to that is: meh! To be fair, there is a story there but as far as worth watching... well no. I've seen better and have been entertained by similar and better told stories: Kite, Gunslinger Girl, Mai-HIME, Blood+, just to name a few.  The fact they flip-flopped between comedy and seriousness was tiresome. And then the fact that Shikabane Hime has no overall message or theme, which is vital to any great story was also bothersome. You can feel them making it up as they go along, working with just the basic concepts but never fully fleshing it out. Just generic storytelling at best with lots of very large breasts,  Is the story about revenge?... sorta, with lots of very large breasts. Is the story about love? again... sorta, with lots of very large breasts! But like I said the story dances around vague concepts and notions, just choosing a \"paint by numbers\" approach to storytelling; Let's have a character die here, let's have the sauna scene there. But you don't ever really find yourself crying over any death or being interested in any cartoon titties.\\n\r\nShikabane Hime definitely did not create any revolutionary characters here. It's all pretty much your run of the mill characters, monks & big boobed fighter women all possessing your standard anime stereotypes: big boobed nice girl, big boobed mean girl, big titty ninja chick with toothy fang and cat ears, angry chick with pig tails & ribbons, Loli-type, But it's the so called doctor female with half a white labcoat but all the titties that took the cake...I just wanted her to stab herself in the boob with one of those ninja knives. Who fights with sharp weapons half naked? The monks are just accessories. Everyone just bored me and I just kept wishing they all died.\\n\r\nI definitely give this show as a score of 3. It's lucky to even get that score,  because normally anything lower than a 4, I would just delete it and move on to the next title.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2013-04-25T12:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 94889,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48644.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Bishounen_Hunter",
                "username": "Bishounen_Hunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=94889"
        },
        {
            "content": "“Thank you, Makina. Spending my days fighting alongside you, means everything to me. The pact we made was worth all of this – and more.” – Keisei Tagami \r\nYou know when you go into a show and expect it to be mediocre at best and bad at worst, and it completely surprises you? That what´s happened when I watched “Shikabane Hime” (aka Corpse Princess). I expected flat and stereotypic characters, incoherent plot and plot holes, suspensions less fights, and shit loads of un-necessary fanservice. But boy was I wrong, it´s not often that I get so emotional during a watch as I became during mytime with “Shikabane Hime”. It gripped me on a deeper level then I thought possible, considering the genres (action, horror, martial art). And it has one of my all-time favourite openings – if not watch the show, watch the opening for the music and visuals alone. \\n\\n\r\nSo, what was it that surprised me so positively? I will explain that now.\\n\\n\\n\r\nStory: 9/10\\n\r\nThe plot has a clear path in its narrative and layout. Each episode giving clues and information to upcoming important events, and head enemies. I didn´t perceived the show as episodic, it´s just smoothly builds up the story and characters to the climax, with some suspense and tensions filled moments along the way.\\n\r\nI would definitely not call the plot especially unique or ground-breaking, but it´s for shore executed in a special way. As so many horror anime out there, death is an essential part – and not the physical death only, but the philosophical part of it as well. It has been in myth and folk lore for a long time, that if you die with regrets your spirit can´t pass on, and the spirit is stuck here in our world. This theme has been pondered many times in pretty much all mediums, but it never seems to get old, and can always be interpreted in new ways. \\n\\n\r\n“Shikabane Hime” takes the approach, if you die with strong regrets, then you get stuck in the living world, and this regret or obsession will turn you into a “Shikabane” (Shikabane literally means Dead body or Corpse) – a monster that has a physical form, and completely stripped off its former humanity. The only drive left is the Shikabane´s regrets or obsessions. Which inevitably turns the former human evil, and it will havoc upon the still living world with their super human strength. And of course, it has a counterpart, a group of people that has tasked them self with the non-so pleasant job to protect the living from these Shikabanes. They are called the Kougon Clan, and the members are monks that been trained for this special task of destroying these monsters, and keep the truth about them hidden from the rest of the world. To their help, they have Shikabane Hime´s, female Shikabanes, that they formed contract with. Together they form a team, and the Shikabane Hime takes life energy from her contracted monk to heal herself, and pretty much becomes undefeatable – and keeps her sanity and human form. After the Shikabane Hime has killed 108 Shikabanes, she can go peacefully to heaven with no regrets. \\n\\n\r\nAs a base, this can sound very cliché, but in Shikabane Hime´s case, it made me reflect on some deeper subjects. What´s defines being human? Is it a beating heart and ageing body? Or is it much more complicated than that? Is it our emotions, actions, and thoughts that defines us as human? Because, the Hime´s are treated in many cases as something non-human, more like a tool with an expiration date. \\n\\n\r\nI think how the relationships between the Shikabane Hime´s and their monks, really brought up these questions. Yes, the Hime´s are dead. No pulse, no aging, and very time limited to this world. And the monks, are very alive, ageing, and bound to this world for unknown time. And still they both look human, act human, and feel emotions like humans. And they are absolutely forbidden to have any romantic relationships. And that was another surprising part of the show, how it displayed these complicated relationships and the character’s feelings, or rather how they supressed these strong feeling for each other. What I expected to be a gore fest, with cliché fights, and empty character interactions, became something much more. It became a story of living on, even if dead, with the means of fighting, meaningful and touching character relationships, and the fights had meaning and emotional drive behind them. But of course, it contains lot of gore, it is a horror anime after all. As for the expected fanservice, it was actually very limited. Most of the fanservice is provided in the ending song, and it’s used sparingly during the actual show. Huge plus for me.\\n\\n\r\nNote: Worth having in mind, is that this is the first season of two so all your questions will not be answered in this season. Also worth mentioning is that the manga was still ongoing when the 2: nd season was released, so if you want a conclusive ending, you have to read the manga.\\n\\n\\n\r\nCharacter: 9/10\\n\r\nAs mentioned before, I expected empty stereotypes, doing and saying cliché and dumb thing, with non-exciting development. I was wrong. They all had a certain depth to them, with specific personalities, backed up by their past experiences. All the main and main supporting characters, get some important development and backstory (Ouri get his in the second season). The dynamic between the characters was very defined and meaningful, even scenes there Keisei just goofing around with his adopted little brother Ouri, and making him angry and embarrassed, becomes an important part of the show. Also, as mentioned before, the relationships between the Hime´s and their monks are a central part. All or of them are unique personas, who has established a specific dynamic between them. The interactions and dynamic with other human characters and Shikabane´s, is also an essential part to really get to the depth of what these Hime´s and Monk´s go through. \\n\\n\r\nWhich brings me to Shikabane Hime´s main charcaters.\\n\\n\r\nWe get to follow the Shikabane Hime, Makina, contracted to Keisei, and his adopted little brother Ouri. Keisei never wanted to make a contract with a Hime in the first place, but as he knew Makina in the past, he couldn’t turn her down after she and her family was brutally murdered by a group Shikabane´s. Makina´s regret is a burning hatred for her and her family’s murderers, and she want her revenge. So, they make a pact to always fight to together, and give Makina her revenge. \\n\r\nMakina can at first glance be labelled a tsundere, but her harsh way and words is just a protective shell she´s created. She´s keeping her true feelings and emotions on a tight leash, due to that she knows that some things just can´t be – even though she wishes otherwise. Makina is simply put a badass realist, not a true bread tsundere. Which gives her softer moments a lot more value and emotional impact. Keisei is a character with two very distinct sides – the goofy older brother monk that pretends that nothing is going on, and the more serious and high level Shikabane fighter. Keisei has a heart of gold, and his protectiveness of Makina is nothing but heart clenching. You can clearly see that they harbour strong feeling towards each other. Their relationship and interactions, brought me to tears multiple times during this watch. Sense when did horror anime become such a tear-jerker? Ouri isn´t a monk, and has no clue about what´s his brother is really doing in the beginning, but he is like a moth to light, when it´s comes to death. He seems to be drawn automatically to it. Ouri is very emotionally cut off, much of what he sees and experience almost never faces him in ways that you would expect. He just goes with most of it, and the key to it lays in his past (of course!). And just in he´s case as in Makina´s, his more emotional moments have a lot of more impact, because of his usual lack of response. His loyalty to his brother and those his think of as friends, are nicely portrayed. He´s is the weakling in the beginning, the person all people tells to “Stay out of it, you just going to be in the way!”, but constantly interfere – he just can´t stay away after he came to know about Makina. He´s drawn to her, and sees her as normal girl – which is a huge taboo. Makina tries her best to scare Ouri off, but a time comes there they have to lean heavily on each other. To see there bound slowly grow, also was one of the show´s strong holds for me.\\n\\n\r\nAll the supporting characters are in some way interesting, with pretty solid personalities, development, and backstories. I came to care for all the teams, and be emotionally invested in them to the point there I was like, “Please, don´t let one of them die!”. Even if I knew that in this kind of show, deaths will occur frequently. I enjoyed their stories and screen time just much as Makina´s, Keisei´s, and Ouri´s. \\n\\n\\n\r\nArt: 8/10\\n\r\nI personally really liked the art and animation, but it´s clearly out dated, compared to this day’s anime. Shikabane Hime, is a 2008 production by studio Gainax and feel. I think they managed to catch the atmosphere for the show very well, with carefully chosen colours and light setting. I came to love the character designs, even if some can appear lazily drawn at first. It´s was the small details of them, who made them stand out to regular anime designs. Like, Makina´s thick, pinched eyebrows when irritate or mad, or her evil death smile before she blasts her enemy to oblivion with her uzi´s. Or like Keisei´s spikey hair and shaded glasses. All details that defined their personality and mad them stand out from the norm. \\n\\n\r\nThe backgrounds are beautifully done and coloured, it really could give you an emotional contrast. For example, the cast been out hunting Shikabane´s, and bathed in blood in the dark of night, to watch a stunning sunrise or sunset and have nice small talk. It provided a nice balance, the beauty of life and death, night and day, and violence and peace. \\n\\n\r\nThe animation is mostly well done, but some parts feel a bit sloppy. Personally, I really liked the action scenes, with their special angles and explosiveness. The actually tension in the fights, was brought by the characters and highlighted by the animation. No complains form my point of view. \\n\\n\\n\r\nSound: 9/10\\n\r\nI have already stated that Shikabane Hime, has one of my all-time favourite openings. The song “Beautiful fighter” by angela, is not just suiting the show amazingly well, it´s a masterpiece on its own. I listen to it several times a day, I just can´t stop myself. The two ED´s are also surprisingly good, with my favourite being “My Story” also by angela. There is also where most of the fanservice I provided, but I watched it every time anyway, because the song was so good. Top notch OP and ED.\\n\\n\r\nAs for the OST, it was great. Dramatic instrumental music during intense filled scenes, and it´s softer counterpart during more emotional scenes. No complains what so ever.\\n\\n\r\nI watched the dubbed version, and I liked all the VA´s. Ouri´s VA can sound a bit emotionless or flat, but don´t forget, that Ouri´s character pretty much demand that kind of voice. \\n\\n\r\nAll background sound was absolutely fine, I could really hear the bullets popping, blood splatter on the ground, rasp of fabric against fabric, and the impact a collapsing structure made. Above standard for shore.\\n\\n\\n\r\nEnjoyment: 10/10\\n\r\nIf you not guessed it so far, I enjoyed Shikabane Hime a hell of a lot. I was taken by surprise of the fact, that just after 2 episodes, I was emotionally invested and highly entertained. Makina as the female lead was a treat, not your typical simplistic main girl, but had a lot of badass traits together with a hidden softer and loving side. Huge plus that they used her very little for fanservice, she was often treated with much more respect. I haven´t explored the horror genre that thoroughly, but I can imagine that this will be one of my favourites in the genre for all time, due to its emotional impact on me – the drama behind it all was well portrayed in my opinion. It made me feel intrigued, interested, engaged in the plot and characters, and excited. And not to mention the river of tears.\\n\\n\\n\r\nOverall: 9/10\\n\r\nEven do I can see that the show isn´t perfect, with every angle covered, it felt filled with important content and interesting characters, and character dynamics and relationships. Shikabane Hime, also contains some unrequired love aspects, expressed in a very nice and touching way. So, to me the show is much more than an action/horror train going to one destination. It contains, emotional hardships, the importance of the present time, forbidden love, and fighting to stay alive, and not for just the sake of fighting. So I would recommend the show if you like the themes, and haven´t had the pleasure to dig in to this piece that is Shikabane Hime yet. \\n\\n\r\n“Look at that. You are scared of me now.” – Makina Hoshimura\\n",
            "date": "2017-04-12T06:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 245308,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=245308"
        },
        {
            "content": "Zombies.... ooo zombies... I feel like I can’t think of apocalypse without you anymore. Gruesome bipeds hunting me for my brains, drooling and screaming while you slowly sustain inordinate amounts of lead to the face without cringing... I love you all for all the beautiful dreams and nightmares you give me.\r\nYou can imagine my excitement when I found out my favorite giant robot making studio was going to give it a shot to epically portray all of you in the most gar-ified way possible.  Right when I got into the show I was overwhelmed with the amount of familiar faces, all it was missingwas a huge drill actually and I would have probably wet myself in excitement. The breasts were there, the over the top action was there, the weak but soon to become omnipotent character was there, “K” was there… but something was missing. This something kept bugging me for all throughout the show and by the end I started to realize I can’t think of mediocrity without you anymore as well, but you know, its zombies so I knew you guys were going to put a good show for me regardless, or so I thought.\\n\\n\r\n--\\n\r\nStory\\n\r\n--\\n\\n\r\nARRRRRRRRRRRRRRRGHHHHHHHHHHHHHHHHH!!!!!!!!!!!  This is all I am used to hear from you, so you can imagine my big facepalm with all the repressed angst I got instead. You still did scream a fair amount and I will say those were the shining moments of your performance here, but whenever you silenced the guns and sat around for a long and tedious talk all we got was…. Well, long and tedious talks. At least that was what I would like to call them. In fact, they were long, tedious and flashbacks... lots and lots of them.\\n\\n\r\nPlease, don’t take this as a direct attempt to discredit your motives. Repetition aside, they are fairly well constructed and would provide a perfect scenario for your bloody fest if not for the insistence you had in giving the spotlight for some unnecessary, non zombie, characters. I really liked your plight and how you were thriving to fulfill it, just too bad you had to insist in bringing detractions, the worst offender being the one to get the most out of the screen time, a bit of a masochistic choice if you ask me.\\n\\n\r\nEven then, the variety of zombies you guys presented me with was nice and I found a few particular main characters, even some non zombie ones, pretty compelling, but the climax would only work if you had built upon it better… you know, like the guys behind you are so good at when they are dealing with giant robots. I also felt a bit cheated by you since you spilled all the few twists you had in store right at the opening, and after seeing it eleven times when it actually came to be I really felt like my brain had already been eaten.\\n\\n\r\nI know you must be tempted to tear me apart right now, but hang on a bit longer; I still have some mumblings that might make me even more appetizing.\\n\\n\r\n--\\n\r\nAnimation\\n\r\n--\\n\\n\r\nI have to hand it to you; you still know how to move. Whenever you guys are flying about exploding people’s heads or cutting them in half you really look your best, this time even better since you don’t have your usual decomposing skin anymore and the close ups on your new assets really does provide some extra oomph.\\n\\n\r\nHere is also were the otherwise formulaic nature of your plot helped, since the usually boring queue of weekly monsters waiting to be beheaded brought variety of characters and bloody ways to crush their admittedly interesting entrails. They are vicious, colorful and varied, and contrast perfectly with the pretty schoolgirl variety of zombies you guys brought into display here, bringing to the table that old good “princess and the beast” feel we are all so found off in ample dosages, something that even if we had forgotten for a second a character would promptly shout towards the audience so we would recall it instantly.\\n\\n\r\nStill, I know you can do better. Not even once my inner fangirl started screaming at your fights as it is usual when you are around bludgeoning stuff to death, and this alone is a big red flag. The fluidity both you and the hands drawing you are known for is kind of blurry here… it seems I don’t know you anymore! No need to get dismembered about it thought, it’s just that my final perception of you is lower than what I was expecting… please don’t come eat me alive yet!\\n\\n\r\n--\\n\r\nSound\\n\r\n--\\n\\n\r\nYour frenzied destruction is never complete without an appropriate music, and gladly you managed to score it this time.  Not only the opening and the ending, but the climaxes all felt a bit chewer thanks to the soundtrack. I just wish your voices also sounded as good as the rest, but unfortunately most of it were not up to par…. Perhaps if you would be more willing to scream “brainssssssssssssssssss” more often who knows, the truth is, you only sounded good when the only thing I could hear were the guns and awesome explosions you were creating, as for the biggest part, you sounded dull and out of character.\\n\\n\r\n…I know you must be drooling by now, but just a bit more and you can have a bite at me.\\n\\n\r\n--\\n\r\nConclusion\\n\r\n--\\n\\n\r\nWhat can I say to save myself now? I hang at your side your for the whole time, I tried to get as hyper excited as possible whenever you filled my screen with zombie glory and filled my ears with ultra violence, I even gritted my teeth to try to sob for you when you were sad… but to what avail? You delivered anything but the ordinary I am used to with other much less awesome things such as teenage magical girls!\\n\\n\r\nOk, some of this is my fault. The story only got to an enjoyable portion after the 9th episode barrier, I should’ve kept up with you in silence while you explained to your brainless victims how your plot worked for the 100th time, I should have properly ignored the apparent useless episodes where nothing of notice happened, and I should’ve kept my lack of excitement with your twists out of the room when you arbitrarily did stuff just for the sake of your current attempt to flash characters we don’t want to see.\\n\\n\r\nBut I couldn’t. And this is why I write this to you now, before you munch me, so I leave behind a testament to other people that tread this place. This way they will know that despite still looking good and interesting, you are far from your best here, and they would be much better suited looking for their visceral zombie thrill or cute girl galore somewhere else… at this day and age in a particular high school as well.",
            "date": "2011-01-17T04:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 33830,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/199926.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/711",
                "username": "711"
            },
            "url": "https://myanimelist.net/reviews.php?id=33830"
        },
        {
            "content": "So let me start by saying I haven't finished this series and that is very uncommon and under normal conditions quite stupid to review a series before you have completed it (after all if you drop it half way through or finish it half-way and decides its bad who are you to call it such after as far you know the next episode could very well be the redeemer for the whole series and all of a sudden bring the spark of life it needed to be good). So now let me get to why I am reviewing this one without finishing it (other thanthat it has completed airing yet). This is more of a warning than it is a review, if you're planning on completing this series be prepared to fork out some cash because every subbing group out there has dropped it now while I believe it is important to support artist and creators I must point out that the money you pay for DVD's and such barely even benefits them...that's right most of it goes to the company (the same is not completely true for manga and if you have the money I suggest that you probably should buy them). So yeah back to what I was saying you will only find to episode 6 online or at least that's the cap I reached after searching for hours on end for episode 7. It's a good series I honestly want to know how it ends so now I will sit here and wait patiently until I can be the DVD set cheaply off amazon.com. I promise I will come back and give this a proper review once I have seen the whole series but for now you must excuse my unenlightened and slightly negative attitude towards the series.\\n\r\nStory- This story is about the shikabane hime (misguided souls/demons that hunt other demons/misguided souls) and how they must kill 108 shikabane (demons/misguided souls). The plot indeed thickens out more to that but because of the limited number of episodes I am able to watch this is about all I can sufficiently provide you with (sorry blame funimation).\\n\r\nArt- The art for this series focus on a unique combination of well drawn normal looking characters (okay not that well drawn or normal the eyes and nose seem a little strange in my opinion) with the monsters being drawn to be absolute abominations to the human vision (they seem to using a different coloring and drawing style for each monster which I for one think is amazing if not a little unnecessary).\\n\r\nSound- Surprisingly enough what impresses me most about this series is sound I love the voice acting as I'm quite familiar with a few of the voices I here from other series. Also I love the opening to this series it perfect matches the context of creepy, undead people fighting to the death. This section however lost points from the gun sounds I've fired a lot of weapons in my days and while they did a decent job of capturing the sounds they seemed to have flubbed a little when it came to the sound of the 9mm and rifle.\\n\r\nCharacter- There the leading role (by which I mean the one we follow around the most) Ouri surprisingly has very little to do with the actual story just like us he just seems to be a confused observer that seems to get more in the way of the real heroes rather than show some bad assery of his own however we have a good understanding of his character and how his mind works by the third episode. Makina however our other main character kicks serious butt this only flawed by the fact that she is so cold and mysterious and that even by the sixth episode we only know enough about her to assume things rather than know them (but that's fine and dandy since that's her character type). Kesei I for one think should be the leading role in this series he's charismatic, funny, strong, and has the slight hint of mystery that you always need to make a good story unfortunately the story seems to be focusing more on his brother than him and that can only need to disappointment (also he's a pervy monk hehe he's tries to give his brother porn).\\n\r\nEnjoyment- Despite my whining I really do enjoy this series and do hope to finish it one day as the way things are left off now I want to near tear my finger nails to know what happens in the next couple of episodes. What can I say I have weakness for violence, hot girls, pervy monks, and killing monsters which this series has no lack of.",
            "date": "2008-12-04T15:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 10098,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40654.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aphiel1",
                "username": "Aphiel1"
            },
            "url": "https://myanimelist.net/reviews.php?id=10098"
        },
        {
            "content": "10/10. This was a series I happen to stumble upon. It took merely 5 minutes into episode 1 for me to be hooked. This series really created an atmosphere, a storyline, and characters that are enjoyable and entertaining. I watched all of season one in ONE day. \r\nThe pacing, I thought, was excellent. I would've loved to see more episodes, but they managed to give you a lot of information with a good balance between the 13 episodes. There was never a point where I was bored, or waiting for it to get on with the story. I was thoroughly involved the whole way along.\\n\\n\r\nThe character development was another really strong point. You come to care for all the characters, especially given how many characters have troubled pasts. \\n\\n\r\nThe fight scenes are incredibly animated and just BAD ASS. \\n\\n\r\nThe story is original, action paced, and tragic at times. Definitely check it out! :D",
            "date": "2010-07-21T17:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 28730,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/278094.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BlondeAssassin",
                "username": "BlondeAssassin"
            },
            "url": "https://myanimelist.net/reviews.php?id=28730"
        },
        {
            "content": "At first I thought that the series would be so great and I got so excited because this type of story is one of the genres that I really love but I had “MADA MADA” or just average feeling about it.\r\nThe story was not particularly new. It was about a girl who was already dead but was revived as corpse and gained superhuman strength. Like your typical story, she partnered a human living guy in order to gain energy. The whole story was about her killing another corpse as so she can go to heaven but it turned out she has personal reason as towhy she was searching for the villains. I strongly believe that the story itself was interesting enough but it didn’t work for the series. It was good but not good enough to leave an impression to viewers.\\n\\n\r\nThe characters were not particularly interesting, too. You can’t feel any greatness or impression from the lead characters to the villains. They were not interesting enough that you would remember their character. The main female lead was not great. Even with great abilities, she wasn’t specifically strong or special that would make her different from other SHIKABANE HIME which was so important as so to make her stand out as the lead character. The male lead also was not particularly interesting. He was weak-willed, soft, pure, and naïve. His naive character struggled a lot for the type of world the series has. \\n\\n\r\nIt was entertaining enough to make you want to finish it or anticipate the next season but that would be for the sole reason that you want to finish something that you started not because it was so interesting. I am definitely not loving it but not hating it though. \\n",
            "date": "2012-12-09T07:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 79584,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79584"
        }
    ]
]