[
    [
        {
            "content": "I guess there's a bit more to Free than 'shirtless bishounens jump in water'. \r\nFor a series that began with a crescendo of confusion, Free has come a long way in carving its identity as a genuinely decent, though largely forgettable sports anime. While I don't think it will convert anyone who detested the first season (and there were indubitably more than a few of them), those who enjoyed or were indifferent towards Free's first offering will find a large improvement in quality. And yes, heterosexual dudes can now watch it without feeling uncomfortable.\r\nThat's not to say that Free has forgotten its primary audience (teenagegirls and Tumblr fujoshi who squeal at the slightest homoerotic undertone), but at least now KyoAni has tried to justify the anime's existence by creating a story of value. It is less about clothes being thrown around and close-up butt shots and more about the boys growing up and finding their place through the love of sport. And each other... just, no, not in that way. \\n\\n\r\nFree's second season shines largely due to its focus on Rin and his close friend and rival, Sousuke. Rin's character development continues throughout the second season with much more detail than previously, taking him from 'antagonistic jackass' to a genuinely believable and complex person. His goals and reasons for swimming swimming are clear and sensible, and so it is easy empathise with him when things take a turn for the dramatic. On the other hand, Sousuke's motivations are purposely made unclear until his secret is revealed in the final episodes. There's nothing complex or excessively grim about his secret-- just that he makes mistakes as all teenagers do and wants to alleviate his regret by competing against his friend. Sousuke's goals are nothing so grand and cliché as being the best in the world, and that's precisely what makes it feel authentic. \\n\\n\r\nFurthermore, the two interact with each other as friends in the real world would in their situation. They aren't characterised by archetypes, catchphrases or 'moe' appeal as many of the others are, and the purity of their friendship is not dragged down by cheap fanservice and fujoshi appeal. They fight, disagree and have each other's back just as real friends do. I just can't say the same for the Iwatobi four.\\n\\n\r\nThe Iwatobi four are far less interesting. Haru represents one of my largest issues with the series; by the end of the story, I did not understand him any more than I did at the very beginning. He swims and sweats for himself and then casts aside years of effort for absolutely no reason at all (unless you consider \"I'm bored\" to be valid characterisation), only to be fired up again when Rin pats him on the shoulder. Uh-huh. Much like the first season, he is blander than a piece of cardboard.\\n\\n\r\nNagisa continues to exist largely as a vehicle for shota appeal and yaoi doujins, behaving so effeminately that even girls would find themselves feeling boyish in comparison. Rei on the other hand is much more interesting, fulfilling a sort of outsider role that the other three do not, but his presence feels a little bit on the uncanny side when you consider that he is a gender-swapped clone of Azusa from K-ON, right down to the inflections in his voice. And then there's Makoto who is just... there, neither offensive nor any great asset to the story. He's characterised more by his friendship with Haru than he is as his own person. \\n\\n\r\nSome of the side characters, like Rin's sister, Gou, add plenty of colour to the cast... but then you have Nitori who exists only to remind us what the show was originally created for. Nitori (who I have personally dubbed as 'That Fucking Guy' and found myself rushing towards the mute button whenever he appeared) is pure, shameless pandering for the fujoshi crowd. There is no reason for him to exist in the story. All he does throughout the series is follow Rin around like a stray kitten, blush and cry repeatedly, and ruin important moments by jumping into arguments that have nothing to do with him. He destroys half of Rin's scenes with his \"d-don't fight!\" and \"y-you can do it!\" and for that I despise him. \\n\\n\r\nThe ending of Free certainly carries its share of emotional weight, and those who like the Iwatobi four more than I do will probably find themselves tearing up once or twice in the final episode. I just wish there was a bit more to it, something with more complexity than the typical \"power of friendship\" fare. It feels like that's all we ever see in sports anime these days.\\n\\n\r\nIt's also worth nothing that the penultimate episode, set in Australia, actually has western people speaking proper English instead of the incomprehensible Engrish common in anime. Wow! There's still the \"all foreigners are blonde\" stereotype, but at least KyoAni shows they're willing to put effort into the smaller things.  \\n\\n\r\nIt should not come as any surprise given KyoAni's seemingly infinite budget, but Free looks amazing. The swimming matches are rendered with finesse and the backgrounds with incredible detail, resulting in a predominant feeling of awe when the characters find themselves in the massive national stadium for the first time. I also wouldn't be surprised if members of KyoAni travelled to Australia to gather research for the episode, given how alive and real the scenery feels. It certainly does more than just look nice. Had Free been drawn by almost any other studio, I'm not sure the characters and story would be anywhere near as effective. \\n\\n\r\nThe music of Free is so great that it does not even need good writing in order to draw emotion from its audience. All that's needed is to listen and the scene will come alive. Even when it was a situation I would not normally give a rat's ass about, the background music grabbed and held my interest in what was going on. To be fair, though, there's no big, memorable track that defines a moment in the story and the ending theme does kinda ruin the moment in the later episodes as it transitions from drama to some upbeat pop song. \\n\\n\r\nIs Free a worthy sequel? It sure is, and I don't think there's any sane individual who could possibly think that the second season is a step back from the first. It improves upon its predecessor in virtually every regard, elevating itself from \"fun garbage\" into something that's consistently decent, occasionally even verging on the point of being 'good'. \\n\\n\r\nBut that doesn't change the fact that it's Free and that Free has a very specific audience in mind. It certainly tries to increase its appeal by toning down the fanservice, but with Nitori's increased screen-time and various questionable scenes (like Rin and Haru sharing a bed in one episode), I still don't think KyoAni has any qualms about alienating those outside its primary demographic. And I guess that's how it's always been and always will be. \\n\\n\r\nKyoAni still has a long ways to go in order to redeem themselves, but the second season of Free is at least a step in the right direction.",
            "date": "2014-09-29T01:27:00+00:00",
            "helpful_count": 260,
            "mal_id": 162839,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=162839"
        },
        {
            "content": "The swimming boys are back! Free! kept its promise from season one (\"See you next summer...\") and returned for another season of swimming, slice of life and manservice. After the first season of five guys swimming competitively and their daily (mis)adventures turned out to be a huge success, it was no surprise that it would get a continuation. And now that the second season finished, how does it compete with its prequel?\r\nFollowing the story of season one, Free!: Eternal Summer starts off with a new high school term. Makoto and Haruka are now third years, while Rei and Nagisa are now second years at Iwatobi.And how else would they start off a new year if not with swimming? They return to the swim club and begin with the search for new members - failing in the process, participating in a friendly competition against the team of Samezuka, dealing with their individual struggles, and much more. All that while they practice and try to improve their swimming even more to participate in the regionals - in hope of success this time.\\n\r\nSpeaking of Samezuka, in the meantime Eternal Summer gives us an insight on the swimming team of Samezuka as well - with Rin as the new team captain and a couple of new members the Samazuka swimmers are up for a fresh start and ready for more challenges. A huge focus here is the addition of Sousuke - an old childhood friend of Rin's, who transfers from another school for certain reasons.\\n\\n\r\nBut swimming is of course not the entire focus of the show. Just like season one, Eternal Summer is filled with lots of slice of life moments, because as we are all aware, Free! is not all about sports. It is not trying to be, anyways. Unlike other sports-themed series, the focus on seemingly \"plotless\" scenes is a huge one, and Eternal Summer is continuing to deliver great slice of life moments that evoke all sorts of emotions. If Iwatobi's hopeless yet funny search for new members, the heartwarming Nagisa-centered episode or the stunning trip to Australia - in the slice of life aspect, Free! is undoubtedly convincing.\\n\r\nAnother central theme of the second season is future. As Haruka, Makoto and Rin are in their last year of high school, it is an unavoidable question of what they will do after graduating. Definitely an interesting topic, and a good set-up for drama. Now, the drama - and the resolution - in Free! is often cheesy and overdramatic - and in the case of this season it is the case too, but still an improvement from season one. Especially episode nine shows how good drama in Free! can be - in this episode it was very well executed. \\n\r\nStory-wise, if you enjoyed season one for its story (or the lack of it in most parts) then you will like it in season two just as much. Lots of friendship, drama, slice of life, swimming is just as present here and just as enjoyable.\\n\\n\r\nCharacter development is very much noticeable in season two. And this even though the cast has not changed much - the main group of five is still the same. The only important additions to the characters are Sousuke, whom I mentioned before, and Momotarou, Seijuurous younger brother, who joins the Samezuka swim team as well. And even though the change is small, the characters go through crucial developments, making them even more interesting than in season one.\\n\r\nStarting off with Haru, who already opened himself a little more compared to season one - while in latter he did not really take interest in swimming competitively (\"I only swim free.\") the final of season one showed its effect. Haru now likes swimming together with his friends, and competing against them. And over the course of Eternal Summer he goes through development too - his struggle with the question if he wants to swim professionally or not makes for some really good drama.\\n\r\nRin's character is also a very interesting one in this season. From the angry and frustrated guy he was in season one he appears now as an easygoing character. It really shows how swimming with his old friends again returned him the joy of the sport. And as the new captain of the swimming team it shows even more.\\n\r\nMakoto, Nagisa and Rei do not get as much focus as Haruka and Rin, though go through some development too. Makoto decides how he wants to continue after high school and continues to support his friends with all his might. Nagisa gets an episode dedicated to him that gives us more insight in his character and is the usual moodmaker of the group. Rei continues to improve his swimming and strengthens his bonds with the group.\\n\\n\r\nJust like season one, Free!: Eternal Summer stands out in the art aspect. The character designs look great as always and the animation is fluid. Especially the scenes where swimming is involved have spectacular animation. One other thing I noticed is how the background drawings are very detailed and beautiful too. It is especially noticeable in episode 12, which has a different setting from the other episodes. The scenery is stunning. Besides that, the series is as colorful as ever, fitting the mood of the show nicely. A thing I could criticize here is that some scenes were not as well animated as others, but this does not disturb the overall performance.\\n\\n\r\nIn terms of music, season two continues with the same old recipe for success. For the opening, we get a new catchy J-Rock song by the band OLDCODEX, that holds well up with season one's opening. The ending song is another fun song by the main cast of the show, accompanied by a hilarious ending animation. The background music continues to be nice, too.\\n\\n\r\nOverall, Free!: Eternal Summer continues to be a fun series with great character development and nice music and art. Thus, I give it an overall rating of 9/10.",
            "date": "2014-09-24T09:51:00+00:00",
            "helpful_count": 114,
            "mal_id": 161911,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1773935.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/silverwalls",
                "username": "silverwalls"
            },
            "url": "https://myanimelist.net/reviews.php?id=161911"
        },
        {
            "content": "There is a limit to how much weight can a single shark lift.\r\nFree!: Eternal Summer is a sports comedy slice of life show and a direct sequel to the first season, Free!. It is a reverse moe trope anime, with moe tropes found in girls given to the guys instead. Usually dubbed as a fanservice show for girls with swimming as a backdrop, does it have anything more in it? The answer is yes, it does, but not so much.\r\nPlot:\r\nAnother summer comes and the swimmers of Iwatobi and Samezuka High School swimming clubs are once again in a rivalry. It is the last school yearfor Haruka, Makoto and Rin, and they have to make their career decisions and find out how much the passion of swimming can help them in the future, all in meanwhile an old childhood friend of Rin's appear to spice up the situation.\\n\\n\r\nThe plot is pretty simple: the characters start swimming and battling each other again while some of them sort out their personal problems and look forward to the future. The problem is though that KyoAni forgot how to make good drama. We witnessed that in Chuunibyo, we now witness that here. The anime fails to have a clear indication of what it wants to be, hovering around fanservice, sports and drama, and does neither well. The main plot element of the story, swimming, is not of much relevance, since the only thing driving it are characters wanting to swim a relay (which by definition is stupid and more on that later on), and is done horribly wrong, and as a sports anime it fails to create a climax and general hype.\\n\\n\r\nCharacters:\\n\\n\r\nThe cast from the first season returns with some new additions and a little bit more development on some, so I'll introduce them shortly: Nagisa, Makoto, Rei, Gou (Kou), Miho on the Iwatobi side, Aiichirou, Momotarou on the Samezuka side are the basic one dimensional characters that can be described by a pair of personality/motivation traits, and are used mainly as plot devices, comic reliefs or assumes a cliched position (like teachers/mentors in Gou and Miho). That's a lot of characters. That's 6 characters in a show that has like 10 total characters that are atleast relevant of some sort. Excluding Makoto, none of these characters get any development apart from simply getting better at swimming (but there's no perspective provided, so that point is irrelevant).\\n\\n\r\nNext on the list is Sousuke, a new (old) Rin's friend. His personal drama was the best in the show, and he is the only character where I could understand why he wants to swim the relay so much. Sousuke is a nice addition to the anime, helping the 2 mains develop and having enough characterization for the audience to care about him aswell.\\n\\n\r\nMoving forward we have Haru. Oh, I personally hate him so much. As the main protagonist he is extremely shallow and unimportant to the story for the most part. The problem with all silent protagonists is that usually they don't show any emotions, meaning that there's no room for characterization from their perspective. You just don't who they are exactly, you can't relate, you can't care for them. \"I like swimming because I don't know exactly\" doesn't give me enough information to care for you. However, Haru's lack of emotions did not go unnoticed by the rest of the cast and ended up being a prrety decent plot point to spark things up. Fortunately, Rin saved him by dragging him to Australia and telling to develop the f*ck up, and he did. And it was actually believable. It doesn't change the fact that he was the worst character for 20 episodes, but he got a legit ending for him and is one of the rare cases where the silent protagonist turns out okay.\\n\\n\r\nAnd here we have Rin, by far the best character in the show. He gets a huge amount of characterization, development, and backstory. In contrast to the other one (or at max two) dimensional characters of the show, he is miles ahead of them. There's nothing so much to talk about him, other than everything makes sense in regards to his character and personalization. All of his actions are completely reasonable and reflect on who he was, who he is now and what he wants in the future. However, he can only do so much alone, and he's not even the main protagonist, only a deuteragonist and even an anti-hero in the first season. If the anime was centered around him, boy that would have ended up so much better.\\n\\n\r\nThe problem with most of the characters again is the lack of characterization. The members on each team exist solely to form a relay, and otherwise are irrelevant. Motivation alone is not proper characterization, that's just a personality quirk. Some of them are so shallow, like Rei and Momo, that it is safe to say that they are just plot devices. Also, their girlish behaviour to reflect on the reverse moe nature of the show just doesn't work. All those blushes and cute moments should be left to girls, as it ruins other aspects of the show that are rather serious, like coming out of age. Furthermore, there's only like 10 characters in the show, the rest are 0 dimensional people that are there for the realism. Where are the other swimmers? Why is it only focused on 8 people when there are thousands of different kind of athletes? Global perspective? The perspective of the best? Nah, those don't exist. Sadly.\\n\\n\r\nWriting:\\n\\n\r\nAnd the swimming is as bullshit as ever. KyoAni, if you wanted to make a sports anime about swimming, please research on what the hell you are trying to create, because swimming does not work that way at all. It reminds me of NASA using the \"Armageddon\" movie as a training program, where they asked the trainees to present all the scientific inaccuracies in a 150 minute film. A total number was 168. In this anime, I counted atleast 60, and with the first season combined that would be well over 100 swimming inaccuracies. That is, ladies and gentlemen, a lot. It's so much that you can safely say that the swimming is executed poorly and without any logic. Having a 12 year (and counting) swimming career experience, this completely destroys any enjoyment I could possibly have had from the races and swimming bits in general, and it saddens me that this anime disgraces swimming so much with its inaccuracy. I will tell you right now, don't get the idea that this sport works like that because it definitely doesn't. It's not K-On where everyone can just take a guitar and form a band, it takes years and years of proper practice and only the select few are successful, something that this anime failed to show us.\\n\\n\r\nMoving on, the comedy is pretty simple. We have two comic reliefs on each side, Momo and Nagisa (Nagi is more of a pseudo). The jokes are mostly reactional, like Gou glancing over muscles, the teacher giving her literacy analogies, Nagisa's playful personality induced character interactions, basic stuff that can be assigned to be a specific character trait (sadly some of the characters are only defined by that single trait). It is not distracting, and it is funny and nice at times, so the comedy's fine. The drama is sometimes mishandled by a long shot (Nagisa runs away from home), or sometimes hits right on the spot (Sousuke's struggles), but the biggest problem is that it is not focused enough, and the anime is not long enough to cover and expand on every plot element. They did have 25 episodes over two seasons but only Rin is the one that got enough focus as an actual character. \\n\\n\r\nThere are a couple of illogical things in the show not regarding swimming (as much as I loved episode 12, them going to Australia was just whaaaat in terms of logic), but for the most part it's okay, since the anime doesn't try to have deep and complex situations and instead restricts itself to simple problems. There are no parents in this show (again), apart for them being mentioned, and I already wrote once that parents are an important piece to developing the personality of the characters, as they are typically the ones that influence children the most, and that especially applies in a coming out of age anime such as this one, where our characters face a dillema of what the future holds for them. As for the actual competition, they overuse the \"power of friendship\" way too much and that symbolism sometimes destroys immersion (like the last episode.... yes, I came to see them swimming with the dolphins, totally)\\n\\n\r\nAnimation and Sound:\\n\\n\r\nOnce again, KyoAni gets the animation done right. It's always a pleasure for the eyes to watch works animated by this company. I have a slight problem with how swimming is animated though, as everyone swims exactly the same and there's no variety at all, and on top of that the hand movements do not look like how it is presented in the show. It doesn't have much of an effect of those who don't know swimming that much, but it is a problem for those who have been a part of competitive swimming or follow the competitive scene.\\n\\n\r\nThe character designs are okay, except the fact that they made Rin's teeth like that to show us that he's kind of an antagonist in the first season, and that totally goes out of character in the second one. The blushes and cute boys doing cute stuff is well, reverse moe thing, you can't say much against it but they don't do anything to serve the narrative.\\n\\n\r\nThe soundtrack is unmemorable, the sound itself is pretty okay. The swimming sounds well and that's about it, nothing much to talk about here. What I could talk about though is the amazing decision to hire Aussie voice actors that speak with an Australian accent instead of getting some local japs to do their bad English gibberish impersonations. That was one of the highlights of the show for me and I was just stunned at the amazing English that was spoken here, something that is very rare. That bit alone made the Australia episode so much better (and one of the reasons why I liked that episode in particular so much)\\n\\n\r\nThe first OP for the show is very manly but otherwise forgettable, same with the second ED where instead of that you get fanservice pondering, cool but uninteresting. They made it better in the first season.\\n\\n\r\nSummary:\\n\\n\r\nFree!: Eternal Summer is a rare case of a show which not only does the first season justice, but actually surpasses it (well, the first season was below average anyways). If the swimming was executed well it would have been a really good anime, sadly that wasn't the case. Apart from the KyoAni visuals style and fanservice for girls, there's really no reason to watch this series. Everything has been done elsewhere and better. Still, this might be your average jack-of-all trades anime where nothing stands out (and some elements stand out as bad), but overall you find it enjoyable enough to follow.\\n\\n\r\nFinal Verdict: 5.2/10\\n\\n\\n\\n",
            "date": "2014-09-25T05:06:00+00:00",
            "helpful_count": 72,
            "mal_id": 162071,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4007477.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Manumento",
                "username": "Manumento"
            },
            "url": "https://myanimelist.net/reviews.php?id=162071"
        },
        {
            "content": "Although sequels can be a hit or miss, Free: Eternal Summer extends on the organic setup of the first season. From shirtless guys to competitive swimming, this show brings the reincarnation of the swimming genre, a sports series that revolutionizes itself with what it has already accomplished from season 1. A good impression for a sequel usually require the essence of the original. While Eternal Summer doesn’t blow the original out the water, neither does it sink beyond salvation.\r\nFrom what’s shown, Free builds on the foundation of its characters and virtues with connections. Characters connect with one another for a common interest and passion. Inthis case, it would be swimming. The first season gave the audience a well-rounded introduction of the characters ranging with a variety of personalities. The sequel expands on this by forging connections and relationships. \\n\\n\r\nA prominent example is Rin, a character who used to share a rivalry with Iwatobi High School’s Haruka Nanase. Rather than putting on a ‘who the hell do you think you are?” attitude, his character becomes more blooming as he builds his own team. His new position as a coach of Samezuka Academy is a testament of this development as Rin becomes a role model for his teammates. These include returning member Aiichiro Nitori but also new members such as Momotaro Mikoshiba and Sousuke Yamazaki. Perhaps the most other prominent character of this team is Sousuke, a childhood of Rin. His personality is interesting to notice because he is almost similar to Rin from the first season. Tough, relentless, and intimidating, the sequel expands on his character through his relationship with both teammates and rivals. \\n\\n\r\nOf course, Samezuka’s rivals are members of the Iwatobi High School. All the members return from the first season with little change to their personalities. One noticeable aspect though is how some of the members begin to seek their potential futures. Because even though swimming is a big part of their lives, their future careers also requires focus to what they’ve learned. The never ending waters still follow the swim members though. The second season titled as “Eternal Summer” follows perhaps all of our characters’ development as that itself is never ending. It’s a rare sequel with significance because it expands on the story without recycling with material it has to work with. Characters such as Nagisa, Makoto, Rei learns through more experience and to work with others. Perhaps what might drag the show down though could be a lack of interest on some of these interests such as the diehard attempts during competitions. But let’s face it, this is swimming and competitions breeds rivalries. Rivalries breeds a dedication to achieve, a will to accomplish.\\n\\n\r\nSwimming doesn’t ride far from the sequel’s objective either. We see how characters improve as well as the impressions new players enter such as Sousuke. But what really stands out is the hidden development with some of the characters on technical terms. Haruka and Sousuke become a part of this formula through their rivalry both in and out the waters. What’s even more important is how it affects them physically and mentally. The sequel preys on this concept with a clever motive as the latter half of the show fleshes out their struggles. Rin too becomes part of the angle as lines of friendship and rivalries are drawn out when it comes to swimming competitions. \\n\\n\r\nHumorous and lighthearted, the show is a feast for the ladies. As the sport requires guys to take off their shirts and dive into their water, you can expect washed out abs flowing smoothly in the pools. You want muscles? You will get muscles. Gestures and movements are also brilliantly rendered with a degree of both realism and imagination. We see how characters move in the waters that captures their dynamic improvements. The whole thing could feel sappy at cases though as some of the swimming competitions zooms lightning fast without much thrilling moments. In retrospect, shirtless guys are delicious to look with its ebullience. However, it still takes its easy path without digging too far or make surprises; except on a few possible occasions. \\n\\n\r\nThe visual front still retains its phenomenal quality thanks to Kyoto Animation’s high class production. Waters are smooth with delicacy while the guys are drawn with well toned muscles. There’s a less emphasis on fashion though with characters like Rei from season 1. Most of it is replaced with lighthearted comedy on various degrees of successes. What I do give praise for is the visual expressions of the characters in this sequel. This is especially shown in the latter half as characters show a variety of emotions such as in the case of Haruka. Nonetheless, the artwork enhances their expressions with opportunistic camera angles and face features. But taking a simple look at the visuals, the series is aim to please, especially for the ladies.\\n\\n\r\nSoundtrack doesn’t change much from the first season with pop tunes and light-toned OST. Character voice mannerisms also retain their way of speaking. Sousuke’s stoic voice stands as a sharp contrast to most of the other members of his team though. In essence, it’s a contrast to the show itself because Free has all this energy while Sousuke seems to hold it back. Similarly, emotional scenarios has fitting music and credibility. I do also give credit for the creative attention of the ED song. Seriously, that song is more than just firemen, merman, or a male stripper. It’s a free style of art!\\n\\n\r\nFree Eternal Summer isn’t by any means an improvement of the first season. I should say it’s probably more or less equivalent but different with its execution. Character relationships are developed with all building up to a climax through initial processes. Its light toned atmosphere combining with a diverse cast of characters will definitely catch your attention. In fact, the sequel is similar like most of Kyoto Animation’s projects with an ability to lift your spirit. Had a bad day? No problem. Free Eternal Summer will bring back the liveliness of what Summer feels like beyond just the naked bodies and swimming movements. For people who love Summer, people who love swimming, and people who love hot guys being wet, this sequel won’t be a disappointment to you.\\n",
            "date": "2014-09-24T09:17:00+00:00",
            "helpful_count": 67,
            "mal_id": 161895,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=161895"
        },
        {
            "content": "The first and start of the second season to this anime was AMAZING.  It was 6th on my top fave anime list.  But as it progressed through the second season it just became really, really, really cheesy.  I expected Rin and Sousuke to start kissing or something, which totally ruined the story for me.  I enjoyed the rush it gave when they were partaking in tournaments  etc, but once that side was over it just became a gay romance anime (not to be taken in offence, this was actually how the characters began to act towards each other)\r\n  Thefirst series was SO GOOD though, like I was literally addicted to it and I was impatient for the second season.  I recommend watching Free!: Iwatobi Swim Club, but if you watch this season you will understand what I mean, hopefully.  I'm sorry if you were offended by my opinion, I have nothing against homosexual romance animes.  I've actually enjoyed many in the past, my favourite being junjou romantica, but it just didn't suit this storyline.  It pretty much killed my attraction to the makoto and haru friendship.  (If you're a fangirl/boy of this \"shipping\" stuff, you will probably ship haruxmako or haruxrin)  \\n\\n\r\n  Anyways, I have it a 5 overall.  It would've been a hell of a lot better if it wasn't for the cheap ending and the weird character friendships that were taking place etc.  I enjoyed the first series though.\\n\\n\r\n[THIS IS MY FIRST EVER REVIEW]",
            "date": "2014-09-27T14:42:00+00:00",
            "helpful_count": 45,
            "mal_id": 162499,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4130121.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/bilbofaggins",
                "username": "bilbofaggins"
            },
            "url": "https://myanimelist.net/reviews.php?id=162499"
        },
        {
            "content": "this got really bad.\r\nthe torturted animista can only suspect who actually were the culprits pressed the studio in this way to deliver a sequel, but do in no way anything like the first run. whoever it seems it was someone pritty fat and humourless but with a lot of influence to actually insist in the second season, for contract reasons only of course (!), but could force the makers to iron the whole thing flat. as flat they just could get it. really flat i mean. \r\nthey removed all elements which created not a spectacular but still entertaining anime in season one, as the senseof humour, the artwork and flawless animation suited the topic, and replace them with more of the dreadful \"ganbanakya, ganbanakya\" singing of morally indisputable, rather square looking crybabies. Was surprised they actually could swim.\\n\\n\r\nholy bukatsu! Now this will propably give president putin some well deserved tears of moral enjoyment. \\n\\n\r\nmaa ii, 3 points because it had some colour and sound! thats quite generous.\\n\\n",
            "date": "2014-10-23T14:45:00+00:00",
            "helpful_count": 19,
            "mal_id": 165941,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/758073.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/animimosa",
                "username": "animimosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=165941"
        },
        {
            "content": "Free! Eternal Summer is the season 2 installation of Free! Iwatobi Swim Club. It continues on where the season 1 had ended. At the start of the series, Captain of the Samezuka Swim Team, Seijuurou Mikoshiba, retired and assigned Matsuoka Rin as the new captain. As the anime continued on, it displayed the powerful bond of Haruka Nanase towards his team and his friends. The main focal point of the season 2 is the Iwatobi Swim Club's dream of competing in the national tournament. \r\nThe anime also introduced a new character namely, Yamazaki Sousuke. Even though character was a supporting one, he played a bigrole in the lives of the main characters. Sousuke became Rin's right hand man and Haru's main driver. Without Sousuke, Rin will never have someone who can protect him and give him advice and hope, while in the Haru's case, no one will remind Haru that Rin needed him badly and drived Haru to find his dream.\\n\\n\r\nThe anime displayed the strong bond of friendship between the characters. One example of this was how Haru's deeply cared about his friends when he revealed to Rin when they were in Australia that it's a big deal for Haru when he fought Makoto because of being stubborn of finding his own dream.  \\n\\n\r\nIt also showed the essence of having a dream,  being a leader, and having a hope to continue for your own future. What's good about the anime was that it not only focused on the main characters but also the supporting characters, like Nitori Aiichirou's struggle of improving his time record, Yamazaki Sousuke's shoulder injury that caused him to unable to swim anymore, and Shigino Hayato's overcoming his fear of water. \\n\\n\r\nOverall, the characters were equally given attention whether main or not, and have each own dreams. The anime taught on how to achieve your dream without giving up and how to look for your own dream by simply looking what's around in you. The music was also good for the moods of each scene and the character songs for each characters. I highly recommended this anime to watch because of the good life lessons it relayed on it's viewers.",
            "date": "2014-10-05T21:50:00+00:00",
            "helpful_count": 14,
            "mal_id": 163821,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4068291.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tachibanahotarou",
                "username": "tachibanahotarou"
            },
            "url": "https://myanimelist.net/reviews.php?id=163821"
        },
        {
            "content": "A little history lesson first:\r\nKyoAni is a very popular Japanese animation studio. KyoAni produced some of the most well-known \"moe\"shows in the industry, and animes like Haruhi, K! On and Clannad were household names in Japan. In retrospect, the popularity of these shows were mainly because of the popularity of the source material, but boy (!), KyoAni made them 10x more popular. On the other hand, KyoAni were not the only one producing those aforementioned shows, rather, they are part of a production committee (together with Kadokawa Shoten etc.), so got only a fraction of financial successes that those anime made (my assumption).\r\n In 2010,KyoAni made the Kyoto Animation Award which seeks (in my opinion) source material for adaptation. No winners were announced but one work received an honorable mention: Chūnibyō demo Koi ga Shitai!. Chunibyu got an animated adaptation in 2012, and even though it is not as popular as the previous franchises, its DVD sales were very good (15,466 average)  and the total combined sales from all other media, made this a financially rewarding production to KyoAni (they got practically all the money). Chunibyu was followed by Tamako Market (an anime original from the creators of K!On), Free! and Kyoukai no Kanata in 2013. Tamako Market and KnK were not financially successful in DVD sales (3,684 and 4,329 respectively), but they showed that KyoAni could create a franchise. But speaking of Free.. KyoAni hit a jackpot and Free! became a blockbuster with 28k+ DVD sales and lots of merchandise sold. It is the most financially rewarding KyoAni production in years buoyed by (probably) its large fujoshi fanbase. In my other review, I called \"KyoAni swimming in money\" because of Free!. Now, buoyed by success by the first season, KyoAni made the obvious sequel, and its Free! Eternal Summer. \\n\\n\r\nMy review:\\n\\n\r\nEternal Summer is a MUCH superior production than its predecessor. \\n\\n\r\nHere are some of its better points than the season 1:\\n\\n\r\n1. It actually featured more swimming than the first season. More sports = More Win. The first season was criticized for being a fanservice show first and a sport anime second. The second season balanced the two, and in my opinion, featured some of the most highly slicked swimming material.\\n\\n\r\n2. The drama is more stable, not contrived than the first season. I like the first season, but one character 'bitchiness ( Rin) does not make a compelling dramatic material. In Eternal Summer, the drama came from the character's choices and conflicts. It present a more realistic world where expectations become the source of stress from a main character. It showed that expectation from other people can break you.\\n\\n\r\n3. KyoAni is a  master at scenery porn. They were famed for creating fluid and solid animation that will make your eyes melt. Season 1 is a very solid entry animation-wise, but in Season 2, the animation stakes are much improved. It seems that KyoAni had an endless budget. Take for example, the swimming scenes in Episode 6 of S2. The fluid is alive and it is breathtaking. Props for KyoAni for bringing their A-game in this one.\\n\\n\r\n4. Much better soundtrack. There is a rap-theme in S2 and I like it. Some of the sounds were recycled from Season 1 but the other soundtrack is much better. \\n\\n\r\n5. Characters that grow and have a development. One of the main criticisms that Free! had received is that most characters were pretty one-dimensional. I have to agree with that. But in Season 2, some of them have their fair share of character development. Haru is not just some water-freak dude. Rin is not just a bitchy-whiny friend. And I like it. It showed that the production team cared for their characters. One new character were introduced, Sousuke, and though I  am initially turned off by his introduction, he grew in me by the reveal of his back story and motives.\\n\\n\r\nSo, I made my case that Eternal Summer is a much superior than Season 1. But I still have some sore points from Eternal Summer.\\n\\n\r\n1. I did not like how the main conflict was addressed. The sticking point is that the built-up stress and breakdown of one of the characters were just magically disappeared upon his visit in a foreign country. It made the \"darker and edgier\" points of the show pretty pointless. I wish the director  fleshly constructed the conflict  more and not some shortcut in its development.\\n\\n\r\n2. In relation to point no. 1 , I wish they did not add the some of the fillers in earlier episodes rather focused more so, in developing the conflict from its characters. I think a more capable screenwriter would create a much more satisfying pay-off by focusing on the main characters. I admit, even though my inner fudanshi is happy with the ending, it leave me cold.\\n\\n\r\nI will rate this show a 9 because I am biased and I want to raise its score in MAL. But objectively, this will score 7.5 for me, but because I love Free!, it is a solid 8.\\n\\n\r\nFree Eternal Summer is a solid effort from KyoAni and I am happy that they are now venturing out of their comfort zone. \\n\\n\r\nRecommended.\\n",
            "date": "2014-11-14T22:02:00+00:00",
            "helpful_count": 13,
            "mal_id": 168631,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3533699.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/peeyaj",
                "username": "peeyaj"
            },
            "url": "https://myanimelist.net/reviews.php?id=168631"
        },
        {
            "content": "Free! Eternal Summer took me for a ride starting from episode 3 till episode 13. Albeit very confusing at first (and last), I eventually learned the hottest guy's name and was satisfied with that. I'm fairly confident that most people watching Free! Eternal Summer will be able to learn at least one of the character's names before the abrupt ending.\r\nThe ending was, Lacking. It was rather unbelievable that the last episode hyped up the nationals swimming competition with a 20 minute intro (without an opening) about their pasts and reminiscing about their stories together, but the team ended up getting *th place. (no spoilers inthe guidelines).",
            "date": "2017-12-23T01:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 266075,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6825063.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ekal",
                "username": "ekal"
            },
            "url": "https://myanimelist.net/reviews.php?id=266075"
        },
        {
            "content": "I never expected myself to cry after watching, especially not a show like Free. But I did. Why? \r\nStory 8/10\r\nAt first I wonder, after competing for the swimming competition for the first season, will they compete again this season? The answer is undoubtedly YES. However, not only preparing for swimming competition, the main characters especially Haruka, Makoto and Rin since they are in the third grade, have to start thinking what they want to do after they graduate. \r\nThis is where I don't expect Free: Eternal Summer to be good. Although it is mostly about Haru finding his dreams, it is very relatable especially toteenagers nowadays who are wondering what to do after high school. While the first season was cute guys doing swimming club (something like K-On but the main casts are males), the second season is about self realization, coming of age and growing up.\\n\\n\r\nArt 9/10\\n\r\nKyoto Animation has gone all out for Free productions... It is really an eye candy. \\n\r\nThe water animation is even better and more fluid than the first season.. feels as it is alive and realistic. We still have the same casts with exact same character designs (thank goodness) with some new ones. I love how they animate the swimming scene and some scenes like crying (basically activities that involve water) but unfortunately animation is not as good in other scenes.\\n\\n\r\nBackground art is another plausible element, it is so beautiful even I screen captured some of them and made them into my computer wallpaper.\\n\\n\r\nSound 7/10\\n\r\nNew season means new opening and ending songs. I don't particularly heart them although they are still catchy (and funny for the ending). Soundtrack is more or less feel the same like the last season, those sonar-like electro and synth sounds. \\n\\n\r\nOne good thing, this season brings out more of the seiyuu's abilities to convey wider range of emotions like anger and frustration, and it was acted well. \\n\\n\r\nCharacter 8/10\\n\r\nWith our third graders graduating, we got to see more character developments between them. \\n\r\nOur Haruka or Haru has always lack the motivation and goal even though he has great talent and potential in swimming. In Eternal Summer his feelings and emotions towards swimming are challenged and explored. We will also see how his friends Makoto, Rin, Nagisa, Rei brings their perspective and insight, in a way helping and shaping Haru in finding his dream. They are more to them than what we saw in the first episode.. each of them have their moments and we learn more about their other side and secrets.\\n\\n\r\nThere are new characters Sousuke and Momo in Samezuka team, it means new friends and rivals. Sousuke is quite deep as a character while Momo is your happy-go-lucky boy, another comic relief.\\n\\n\r\nI wish to see more of Gou and the sensei though.. They barely get any spotlight and exploration, I feel they are just there for the sake of being there even though there are room for improvement.\\n\\n\r\nEnjoyment 8/10\\n\r\nFree: Eternal Summer really exceeds my expectation. I used to think Free as a light and shallow show where you can just watch without thinking and to pass by time. But this season proves me wrong. This time it is more on slice of life than just swimming, there are values we can take away  from the boys.\\n\\n\r\nIt is bad to say this but, this is season is also where we say good bye to our lovely boys. Now they have grown and matured, going their own paths in life.. but as Haru said, \"we will always be connected to each other.\" \\n\r\nThe last episode wraps the show well, the ending was satisfactory I cried in a mixture of sadness and happiness as this show ends. It is a nice way to end summer.\\n",
            "date": "2014-10-12T09:02:00+00:00",
            "helpful_count": 11,
            "mal_id": 164537,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2086837.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aikojazz",
                "username": "aikojazz"
            },
            "url": "https://myanimelist.net/reviews.php?id=164537"
        },
        {
            "content": "My expectations weren't so high... but after I got through the 2nd season I just can say: I did enjoy the show very much!\r\nOf course there actually is a slight homoerotic undertone but this does not mean guys should stay away from it or it's only a show for girls and Yaoi Fans. I think for guys it's quite amusing to see those guys swimming, chatting, ... whatever..., with each other. \r\nHowever, during the show, there is not so much attention on the swimming; rather, how they interact with each other, how they come and work together as a team and how they keep pushingeach other to raise the bar higher and - finally - for achieving their goals and dreams.\\n\\n\r\nFurthermore, Free absolutely stands out for being an Anime with a great character development. It was beautiful to see how the boys - literally - went through the episodes, with their own personal ups and downs (and sometimes something in between).\\n\\n\r\nThe art and the sound work beautifully together. I absolutely love the OST because it does suit in the setting perfectly and gives the anime this unique, pecial Flair.\\n\\n\r\nSo, this is an anime I can highly recommend to everyone! It's anime about swimming, about friendship, about being a part of a Team, about loyalty and about dreams!",
            "date": "2014-12-09T06:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 171545,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4269669.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MestariYN",
                "username": "MestariYN"
            },
            "url": "https://myanimelist.net/reviews.php?id=171545"
        },
        {
            "content": "STORY: 9 \r\nI liked it even more than the first one. Swimming and sweating and more RIN, oh thanks God about that character. \r\nART: 8 \r\nStill very good but nothing special. \r\nSOUND: 9 \r\nI LOVED EVERYTHING AND I REGRET NOTHING. The opening is one of my personal favorites and the ending is really catchy. \r\nCHARACTER: 10 \r\nI liked the characters more than the first season they had a big character development for me. \r\nENJOYMENT: 10 \r\nahhh i really didn't want it to end!! \r\nOVERALL: 9\r\nthanks for reading!",
            "date": "2014-11-28T01:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 170171,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3623895.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pazuhira",
                "username": "pazuhira"
            },
            "url": "https://myanimelist.net/reviews.php?id=170171"
        },
        {
            "content": "Watching this out of curiosity due to the hype and also for some time killing during holiday, Free!Eternal Summer is although might not be the best anime out there, it without a doubt is a very enjoyable series that worth your time.\r\nFollowing its previous season, I must say that Free!ES stepped up their game in its story and characters. \r\nStory: 7/10\r\nWhile I finished Free! in average impression, Free!ES although still maintained its common theme about friendship, passion, ambition etc certainly had improved its plot with more relatable events and less complicated, messy childhood flashbacks unlike Free! Although with the theme is pretty much light andnaive imo, some of the highlighted events were delivered in a very satisfying manner that I found very endearing. Also most importantly it was less angsty and less annoying compared to the first season which I found really boring due to the dragging drama that could have be solved in mere 2 or 3 episode.\\n\\n\r\nNotably, Makoto/Haru friendship ( the best thing in Free! series tbh), Rin/Samezuka team bonding and the overall relationship of the Iwatobi members although the latter only got me all the FEELS at the last minutes of  the last episode. \\n\\n\r\nMy only complaint may be that the plot all in all was quite underwhelmed and as a sports anime, I didnt really get pumped up for the sports but rather to fall for the friendship between Free! characters instead. Not necessarily a bad thing but I wish to see more of the  spirits in these athletes instead of shouting about friendship in each episode.\\n\\n\r\nAlso the new characters introduced in this season were quite random and underdeveloped imo. Their presences seemed to be an awkward addition to the original cast that I couldnt fit them in the old cast dynamic.\\n\\n\r\nArt: 10/10 \\n\\n\r\nBeautiful art as expected from KyoAni production. The characters were drawn in very flashy animation and I got no complaint for all the eye candies in this show. I absolutely love how they animated the water and gave a very detailed touch to its movement and I almost could feel what it is like to the characters  while being in water. \\n\\n\r\nSpecial mention to the emphasis on the eyes that were well used in conveying subtle emotions from the characters without having to blurt any word.\\n\\n\r\nSound: 7/10\\n\\n\r\nI could not give higher rating for the OSTs as I prefer the previous OST more. But it was still good and I got no problem with it aside from my preference of the last season. The voice acting was top notch and they really delivered their character well throughout the show.\\n\\n\r\nCharacters : 8/10 //////MILD SPOILER AHEAD//////\\n\\n\r\nNow move on to the strongest point of this show, the characters. Starting from our stoic, cool protagonist, Nanase Haruka, I must say that I am not entirely satisfied with his character. A man with little words, harboring vast love for water and swimming, didnt feel the need to acknowledge or to be acknowledged, I was baffled as to why majority of the cast were attracted to him. I love Haru but at the same time, I am not really fond of his overall manner in the series. Apart from being deeply bonded with water, his character so far were driven forward by his friends and his passion for swimming.\\n\\n\r\nBut I guess that's a part of his charms, having indifferent attitude made people riled up over him.  Also I kinda wished his conflict ed mind was properly confronted with his own realization instead being dragged around by other people. I wanted to see Haru putting more effort into what he treasures in his life and find a proper meaning of his existence to other people. But despite that, Haru is still a entertaining character that I really enjoy watching him.\\n\\n\r\nNext should be the other protagonist, Matsuoka Rin. Although I was totally annoyed by his angsty appearance in Free! Rin surprisingly amazed me with his development in this season. Moving on from his troubled past, he actually keeps on moving forward and with him being the leader of his team, it totally brings the best out his character. But letting go of your past doesnt mean you can forget your dream, with Sousuke's interference , Rin once again decided to pursue his childhood dream without looking back now. I am glad that they didnt take Rin into Iwatobi team but started anew with new people of Samezuka folks.\\n\\n\r\nI was pretty contented with Rin in this sequel except that he should keep his temper low while confronting with people especially his friends and I kinda want to see more of his relationship with Gou. \\n\\n\r\nMoving on to Tachibana Makoto, easily my favorite character in this series. I always has soft spot for caring, warm hearted character and Makoto is portrayed as a very realistic person. A genuinely kind friend that you wish to have for the rest of your life, he gave me the most impact in this series from his role as Haru's long best friend. Also I love how the anime keeping the subtle-ness in Makoto ways of taking care of his friends especially Haru.\\n\\n\r\nand although being less vocal in his passion in swimming, he actually showed the most development in this sports. Overcoming his fear of water and aspired to be the one who teach others in confronting the shared trauma. He knew what he wanted to do and while sharing the strongest bond with Haru, Makoto truly stands out the most for me as a very gentle and yet assertive friend who pushed Haru forward but at the same time without letting his hands off him.\\n\\n\r\nNagisa and Rei, I was bit disappointed with them having less significant role in this season. Also with Gou... ohh myy I wish they would be more appreciative of her by honoring her job as their manager but it was again solely focused the boys instead.\\n\\n\r\nFor some other characters, I am ashamed to say that I got nothing to say as I didnt really attached to them to get insight of their character. But I did have lil problem with the new character especially, Sousuke. His character was okay and it could've been less awkward if his appearance was foreshadowed in the first season. His presence while it was necessary, he stuck up like a sore thumb in Iwatobi and Rin's relationship he appeared to be very random in some scenes.\\n\\n\r\nwell, that's all I've got to say about the characters with main focus ended up on the main characters lol but Makoto is love!!\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nWhat can I say, with this long ass review you can totally see how much I enjoyed this series lol With the all half naked boys fanservice, I contained my laugh and giggle from all the teasings \\n\\n\r\nOverall: 8/10\\n\\n\r\nI actually wanted to give this a lower rating but then I remember all the fun times watching this anime, it deserves the 8. Not a 'OH WOW masterpiece!' type of anime but it still gave me a real good times following the journey of these passionate swimmers. Also with Makoto the bae in this, I was being kind with the score XD\\n\\n\r\nsooo if you want an anime with eye candy bishounen flashing off their muscles in every second of it but at the same time experiences the joy being under water with the boys, sharing their cries and laughs, follow the dream and journey of their genuine friendship, Free!Eternal Summer wont disappoint you!\\n\\n",
            "date": "2015-01-20T07:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 178645,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1071119.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lilymul",
                "username": "lilymul"
            },
            "url": "https://myanimelist.net/reviews.php?id=178645"
        },
        {
            "content": "I realize this series is more of a fan service anime for girls.  I would recommend any girls to watch this anime, but if you're a guy you probably won't get as much enjoyment out of this anime. I gave this anime a 5 because the anime didn't show much competitive swimming. The show focused a lot on fan service. For me, the first season was much better and this season was more of just a copy of the first, they just got better at swimming. Although the characters did evolve throughout this season.\r\nThe good points of this series for me was the soundtrackwas a 10/10. All the songs blended well with the anime. The art was also another one of its strong points. The story was good, but I think it could've been more entertaining at some points. It was a very relaxing anime, but it was mostly do to its soundtrack.\\n\\n\r\nFor girls I would definitely recommend this anime!!!",
            "date": "2016-05-24T10:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 219231,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4751347.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Chiaki__Nanami",
                "username": "Chiaki__Nanami"
            },
            "url": "https://myanimelist.net/reviews.php?id=219231"
        },
        {
            "content": "When I watched Free season one  I honestly thought it was average at best, not even finishing it untill season two was about to begin. I watched up until episode 8 and dropped it. However coming back to it was the best decison I've made when its come to watching some shows. The last 3 episodes saved the show, making me give it an overall of mark 7 out of 10 for season one! NOW Season two \r\nStory: Much better than season one, there was no awkward rivalry between old friends, as it was resolved at the end of season one and they allgot on very well, you could tell that they had matured and it was a mature enviroment. There was friendly competition and they all looked to the future making it all the more enjoyable to watch, however there was some character arcs that really pushed the show to much better than a simple slice of life of a bunch of \"friends\".\\n\\n\r\nArt: I think everyone knows the art in this show is AMAZING! And I'm not just talking about the man-service. The water and animation of when they are swimming has soo much detail. \\n\\n\r\nSound: Opening was pretty good, and soo was the soundtrack, But the Ending song is what seals it. It's catchy and fun, you will find yourself bouncing around singing to it, it has soo much energy. \\n\\n\r\nCharcters: All the characters grow in their own way through the series. However as Haru is the main character the show revolves around him. This is much different to season one, where it mainly centered around Haru and Rin. However the evolution of Rin is by far the best thin about this show, aswell as the growth of many of the returning cast. Haru deals with his future as well as showing a different side to him. Sosuke is a new character that comes across as a rival but however does give a different perspective throughout the series \\n\\n\r\nEnjoyment: I will start by saying that I LOVE THIS SHOW! Season one was good at best, with the last episodes of the season saving it, but this exceed all of my expectations and made me soo attched and involved with the characters, making me kinda obsessed with it now. \\n\\n\r\nOverall, if you were like me that didnt really get season one, dont worry, season two is excellent!",
            "date": "2015-01-07T20:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 176749,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3570111.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlackOpps_",
                "username": "BlackOpps_"
            },
            "url": "https://myanimelist.net/reviews.php?id=176749"
        },
        {
            "content": "Art (7): This is the only truly good thing about this show. The animation is gorgeous. I've always love Kyoto Animation's aesthetic and they way they animate faces and emotions and the subtleties in the character's expressions. But, I have to say that the characters aren't even really deep enough to animate truly subtle emotions on their faces, one of the things that makes the Haruhi Suzumiya character animations amazing as well as the Lucky Star animation, or what I've watched of the Nichijou adaptation. Granted all the characters in those stories are far more interesting and compelling just as people who have lives outsideof what the central theme of the show is, but now I'm off point. My point is that the animation is amazing. The show is very pretty. And that's its biggest plus. \\n\\n\r\nSound (3): The only music I remember even remotely liking is the ending theme. Which wasn't as good as the first season's ending theme. The OP was as annoying as the first season's and just as unfitting. And I don't remember any other music at all. The dub is okay. I still think that J Michael Tatum was miscast as Rei, though he can be good at times. And Nagisa's voice got annoying after a while of hearing him WHINE AND WHINE AND WHINE!\\n\\n\r\nStory (4): Admittedly, the pacing is better than the first season. Probably because this one has a lot less to establish before just jumping in. The last season had to establish everyone's relationships with each other, then the swim club, then the whole thing with Rin, then get Rei into the club, then have Mako's fear of the ocean (which wasn't necessary, just random fluff), before the regionals. This one just has to establish Sousuke and Momo. Momo is fine. I don't really have any problems with Momo. He was a fine addition and he had good chemistry with the other Samazuka swimmers. We'll get to my problem with Sousuke. Anyway, yeah. The pacing and story was better than the last season (which isn't saying too much, the story was the weakest part of season 1)\\n\\n\r\nCharacters (2): A lot of people love these characters. And I don't give this category such a low score because I hate them. I don't hate all of them. I liked Haru in the first season. I liked Rei in the first season. He was a legitimately entertaining character in the first season, and he still is in this one. I rank this category so low because of a few things. \\n\\n\r\nFirst: I assume that Rin, Mako, Haru, and Nagisa all met when they joined their kid swim league (if not, they knew each other even longer), which means they've all known each other for at least like... 10 years? 12? And SOMEHOW when Mako tells Haru he's already decided his future and Haru gets pissed that's somehow their FIRST FIGHT EVER? ARE YOU FREAKING SERIOUS? Alright, why this is ridiculous, okay. So, I have this friend who I've known for literally the same amount of time. 12 years. We've been best friends for 12 years. And we fight ALL THE TIME! I consider this person my honorary sibling, and we have pretty much all the same interests and incredibly similar opinions on a lot of these things and WE FIGHT ALL THE TIME! It's ridiculous. If it was Nagisa and Rei's first fight, that would make sense. They haven't known each other that long. Only like a year or two. But knowing someone for like 12 years to the point where you see them everyday and have NEVER had a fight is completely ridiculous. \\n\\n\r\nSecond: Everyone assumes that Rei is gonna quit the swim club JUST because his former coach offers him a place on the track team and he's busy after school. Which is dumb. If he came up to them and said that he was gonna quit THEN you can freak out. Don't jump to conclusions.\\n\\n\r\nThird: Nagisa runs away from home just because his parents want him to quit the swim club because he's getting terrible grades. Any reasonable parent would do this. I WOULD DO THIS if my kids were getting bad grades. It doesn't mean \"WE DON'T WANT YOU TO HAVE FUN!\" It means \"Hey, you need to get your grades up, and if you do you can go back to your club.\" It's the one part of the E Class system from Assassination Classroom that makes sense. Kids who don't do well shouldn't have the ability to participate in sports or clubs. That's also how schools work. At my school, if you got bad enough grades they wouldn't LET you join a sports team. This is how motivation works. It's not bad parenting. And all the teachers and club members treat it like it's ABUSIVE! If that's abusive, then almost every American high school is an abusive institution, as are many parents who are loving and caring and just want their kids to do well in school. My point is that this is ridiculous. \\n\\n\r\nFourth: Since Rin, Mako, and Haru are about to graduate they choose to have these super 'emotional' and 'dramatic' conversations about future and dreams and being scouted literally every five minutes and it get so boring and cringey. At least the cringe in the first season wasn't this freaking constant. WE GET IT THEY'RE GRADUATING! I DON'T EVEN FREAKING CARE ANYMORE! GOD! SHUT UP! PLEASE!\\n\\n\r\nFifth: And this is the worst one. Sousuke. Sousuke starts off likable and a reasonable character with realistic goal. Then, the main plot point surrounding him is that his shoulder is seriously injured because he neglected to take care of it when training. THIS IS FREAKING RIDICULOUS AND ILLOGICAL! ARE YOU SERIOUS? YOU REALLY WANT ME TO BUY THIS? Okay, maybe this is harder for me to swallow because I used to be a swimmer myself and I didn't take it anywhere near half as seriously as Sousuke takes it. Any time I had any pain, even minor, I would immediately report it to my coach. Even if I wasn't sure it was swimming related. ANY SENSIBLE HUMAN BEING WOULD IMMEDIATELY TELL THEIR COACH AS SOON AS THEIR SHOULDER STARTED BOTHERING THEM! And then GET A DOCTOR! No one as strongly into being a professional swimmer as Sousuke would allow an injury to get to the point that it hinders him FROM SWIMMING! Seriously. I once sprained my wrist outside of swimming, and while it didn't prevent me from swimming, my coach literally PULLED ME OUT OF THE POOL AND WRAPPED IT FOR ME when I told her about it. This is the responsible thing to do. Sousuke is an idiot. \\n\\n\r\nOverall (3): Watch any other better Kyoto Animation Show or sports anime rather than this series. Please.",
            "date": "2016-08-12T13:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 226578,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4978611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Suzu-kun22",
                "username": "Suzu-kun22"
            },
            "url": "https://myanimelist.net/reviews.php?id=226578"
        },
        {
            "content": "Anime covers just about every genre there is and there is always something for everyone, no matter what your preference might be. That's the beauty of anime. It is all inclusive, yet still unique, still unlike anything else in this world. That doesn't mean that every anime that has ever been made is something to be cherished, but every once in a blue moon, a special cherry blossom appears. The brightest star amongst the dark night sky. Free!: Eternal Summer is that bright star.\r\nI went into this series expecting a simple, fun anime. But what I discovered, was something far deeper than I could haveever imagined. The first season was emotional, but it was more about the fun, the joy of swimming. Eternal Summer goes above and beyond that, focusing on the future and our dreams. Deciding what we want from our future, what it is we long for in life, is crucial to succeeding in this world. Without a dream, we have no future. And without a future, we have nothing.\\n\\n\r\nThis overarching theme weighs heavy on our cast of characters. It is their third and final year of High School. Their third and final Summer together. The Seniors are posed with the same question that every Senior before them has been asked: Where do you plan to go after graduating? This weighs heavily on our band of joyous friends as they release the importance of their futures. The lives they've come to enjoy are beginning to change, and soon their lives will never be the same. This line of though leads to surprising confrontations, surprising revelations, and new determinations. Things that I have never seen so perfectly depicted in ANY form of media before.\\n\\n\r\nKyoto Animation pulled out all the stops for Eternal Summer. There was no holding back, and no looking back. The art is the greatest I have ever seen. It was at many times on par with the work of Ufotable. So beautiful and full of life and depth. And it also further proves that KyoAni is the undisputed king of water animation. Ever wave, every ripple, every drop of water looks so natural that it is hard to believe that it was drawn and animated. The beauty of the water is further emphasized when placed against the early morning sunrise and cherry blossom petals littering the surface of the water. Eternal Summer is a visual spectacle that is rivaled only by the infamous Kara no Kyoukai. And that in and of itself is an honor that very few are granted.\\n\\n\r\nTo top all of this off, the soundtrack tugs at all of your heartstrings, striking all the right chords. I almost cried on numerous occasions. It was unbelievable at first, but as the series went on I feel deeper and deeper into the rabbit hole. It drew me in with the sounds of the rushing water, the gasps of the characters, the raw emotion of the voiceovers, the authentic Australian English, and wonderful orchestra's. It was a feast for the ears, the mind, and the soul.\\n\\n\r\nAnd yet, I'm sad that there will likely never be a Season 3, as the title Eternal Summer even suggests. This is the end of the adventures of the Iwatobi Swim Club gang. But... that for once isn't such a bad thing. As much as I want to see more of them, their story has already been told. And it would probably be next to impossible to top such a masterpiece as Eternal Summer.\\n\\n\r\nFree!: Eternal Summer has accomplished something that only two anime, Clannad and Welcome to the NHK, have done before it: It left me in a state of catharsis. I sat in my chair and thought for a good while. Clannad made me question my life. Questions that I thought I had answered, were suddenly left unanswered. And so I strived to answer them once more, and I thought I had. Then Welcome to the NHK led me to the realization of just what I had become in my ignorance of the world, and I began to see things I had never seen before. And now Eternal Summer has taught me something that I will try my very best to never forget  That I have to find my dream. It just won't find its way to me. I have to go looking for that dream myself, so that I can have a future. Nothing communicated that to me more than Eternal Summer. I have nothing, but praise for this season of Free! and I will never regret deciding to watch it. And so it is with that, that I can wholeheartedly recommend this series to everyone, anime fan and non-anime fan alike. This is a series that should be on everyone's anime Bucket List.",
            "date": "2015-01-18T13:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 178391,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3837703.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nyren",
                "username": "Nyren"
            },
            "url": "https://myanimelist.net/reviews.php?id=178391"
        },
        {
            "content": "I'm going to say it: Free! ES was one of the best shows of the summer. Read into it however you will, but the second season of Free! improves beyond the original in nearly every way.\r\nI remember when Free! first burst onto the scene last year. Personally, I was surprised at how a show about swimming (with some potentially homosexual undertones) developed such a large following so quickly. I was even more surprised when I found that I myself had become part of that following. The first season of Free! was incredibly satisfactory and I found myself looking forward to season 2 almost immediately. Andit doesn't disappoint. Free! Eternal Summer lived up to my expectations and more. \\n\\n\r\nSeason 2 of Free! finds that Rin and the Iwatobi Swim Club have reconciled and are now friendly rivals (thank god). However, Haru, Makoto, and Rin, now third-years, are facing graduation and their last year on their respective teams. This becomes a central focus--what will they do after they graduate? The show explores this question very well and uses it to really get into how the characters are feeling at this turning point in their lives. Rin is dead-set on becoming an internationally-recognized swimmer. Makoto is unsure of what lies ahead, be it swimming on a university team or attending the local college. And Haru, perhaps for the first time in his life, is dealing with genuine pressure. Scouted by universities and without any post-graduation plans, Haru is ill-equipped to handle all of the sudden complications in his life. And we finally get to see what's going on inside Haru's head. He's more than just the quiet kid who likes water a little bit too much. Season 2 really defines Haru as a person and his character makes great strides. Don't worry, Nagisa and Rei are still very much here too. Both get their respective attention in the storyline and also become more than what we originally thought they were. Nagisa isn't always cheerful and carefree and his facade is somewhat broken down. Rei reveals himself as deserving of more credit than we perhaps give him, and really cements himself as an integral member of the team.\\n\\n\r\nJoining the mix are a couple newcomers: Yamazaki Sousuke and Mikoshiba Momotarou. Sousuke is Rin's childhood friend and an elite swimmer; Momotarou is the younger brother of the previous Samezuka team captain and shares his brother's attraction to Gou, much to Rin's chagrin. Sousuke becomes a central character as he is quickly at odds with Haru, while Momotarou provides some comic relief and occasional insights. Both are welcome additions.\\n\\n\r\nOverall, season 2 of Free! focuses largely on the interactions between the main characters. Supporting characters such as Gou and Ama-chan-sensei are kind of put on the back burner as a result, but there really is nothing lost. By shifting the focus from plotline to character, Free! really gets to the root of what drives each one of them, and the show pulls out its fair share of surprises along the way. This is an excellent example of a show that successfully shakes things up while still maintaining a tested formula.\\n\\n\r\nFree! remains a visual pleasure. Iwatobi looks as picturesque as ever and I never tire of the swimming scenes. Credit must be given to this show for making the swimming sequences dynamic and captivating. Free! likes to do this thing where it gets into the mind of each character as they're swimming and it really draws the viewer in during these scenes. Same good stuff we saw in season 1. No complaints here.\\n\\n\r\nA particular little highlight I have to mention is the OP. WOW, it is leaps and bounds ahead of the season 1 OP. From the song to the animation, everything about this OP is just on point. I actually didn't mind watching the OP each week without skipping it. Just a little thing that helps to make the show that much better.\\n\\n\r\nFree! Eternal Summer goes beyond what was accomplished in season 1. They wanted to shake things up a bit and the end product came out beautifully. At the end of the day, Free! is about a group of guys who have a passion for the sport and want to see each other succeed. It's as pure as storytelling gets. And in a summer surrounded by action thrillers and numerous mediocre fanservice shows, Free! provides a welcome breath of fresh air.",
            "date": "2014-09-25T20:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 162215,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1881912.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jambol",
                "username": "jambol"
            },
            "url": "https://myanimelist.net/reviews.php?id=162215"
        },
        {
            "content": "Initially I had no intention of writing about “Free!” again, mainly because I thought it couldn’t offer me anything new… but I was wrong.\r\nThe characteristic trait of “Free!”, and what I loved the most about the first season, was the always present factor of the friendship and camaraderie the swim team shared, it wasn’t the most special or unique one (might say), but it got to me in every sense of the way, thanks to the classic connection felt with teenage characters, that being the struggles of growing up, all accompanied by this, for some people risky, sense of male bonding that made the wholething special.\\n\\n\r\nTake it as you like, I can’t stop anyone from seeing the series as they want to see it… yeah I’m talking to those kind of watchers. Yet to me it was a marvelous display of teenage friendship and “soul searching” (in the cheesiest of ways).\\n\\n\r\nSo when the second season was announced I just expected another adventure for the gang, just another stepping stone towards the same goal, a slightly different display of just about the same thing… but I was wrong, again.\\n\\n\r\n “Eternal Summer” took it a step further, and all in the right directions, straying away from the first season the focus moved away from all the high school drama towards adulthood and the natural evolution of the characters, not as characters in a fictional world, but as people (felt the connection yet again), which was awesome. This season switched focus towards a more personal character focused approach, leaving the “teenage issues” deals behind as they got all changed and transformed by age, and trying to make the transition to adulthood for the characters so real and approachable that anyone who had the misfortune of feeling lost during this time of their life is definitely gonna feel the spark.\\n\\n\r\nAnd that’s the main beauty of “Eternal Summer”, unlike other second parts, it really took the concept a step forward, that concept being common “real” life problems. You might wonder what’s the point of getting too close to home, or what’s so special about it, but you see that’s the key of a good sequel, the interests are already at play and the characters are already developed (so is your care for them), so the stories and personalities don’t dwell in the same topics needlessly, they move beyond their previous state and get their necessary refreshment.\\n\\n\r\nYet not all is good in “Eternal Summer”, the drawback of the plot choices it that they leave the series too focused on the main characters conflicts, and more sooner than later even the main characters became subdivided and the swim team gets prioritized for the sake of making some of their stories more layered towards the end, I don’t need to say which characters get the spotlight… right?\\n\\n\r\nIn the end “Eternal Summer” is as good as a sequel can be, and as they should be, expanding the characters in a natural consistent (yet not equal) way that makes them feel evolved, matured, “grown up”, not forgetting the things that made the original great in the first place, the friendship is there, evolving with them, and the oh so loved camaraderie makes its “grown up” appearance as well, making this second season a full circle, as far as refreshing and improving its contents.\\n\\n\r\nIn conclusion, it a great series, obviously conditioned by how much you loved the first season, but overall a great experience whose message really is to be kept with you like the eternal summer… ok maybe not, but certainly for a long time. \\n",
            "date": "2014-10-29T11:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 166683,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3911503.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Carlzdachu",
                "username": "Carlzdachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=166683"
        },
        {
            "content": "Free! Eternal Summer was not as dramatic as the theme song made it out to be. It had a lot more comedy and somewhat corny scenes than I thought. However, sandwiched between those is an internal battle that is slowly building in Nanase Haru, is swimming because he loves the water really enough? For a fan of Free!, the previous season, it's satisfying to watch the swim team train harder, watch Rei improve, and reaffirm why they swim. As a motivational message, it's almost convincing to make someone want to swim. Still, if you feel the slice of life is being laid on thick, holdout for when they reach regionals (sorry for the spoilers). Everything after that, is rising towards a climax. We start to see the characters stand on their feet. For me, that was the most satisfying. In character development, Free! Eternal Summer is one of the best. It's similar to Houtarou' s situation in Hyouka. I digress. I highly recommend Free! Eternal Summer!",
            "date": "2014-11-12T18:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 168371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3518227.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kittyhawk09",
                "username": "kittyhawk09"
            },
            "url": "https://myanimelist.net/reviews.php?id=168371"
        }
    ],
    [
        {
            "content": "I guess there's a bit more to Free than 'shirtless bishounens jump in water'. \r\nFor a series that began with a crescendo of confusion, Free has come a long way in carving its identity as a genuinely decent, though largely forgettable sports anime. While I don't think it will convert anyone who detested the first season (and there were indubitably more than a few of them), those who enjoyed or were indifferent towards Free's first offering will find a large improvement in quality. And yes, heterosexual dudes can now watch it without feeling uncomfortable.\r\nThat's not to say that Free has forgotten its primary audience (teenagegirls and Tumblr fujoshi who squeal at the slightest homoerotic undertone), but at least now KyoAni has tried to justify the anime's existence by creating a story of value. It is less about clothes being thrown around and close-up butt shots and more about the boys growing up and finding their place through the love of sport. And each other... just, no, not in that way. \\n\\n\r\nFree's second season shines largely due to its focus on Rin and his close friend and rival, Sousuke. Rin's character development continues throughout the second season with much more detail than previously, taking him from 'antagonistic jackass' to a genuinely believable and complex person. His goals and reasons for swimming swimming are clear and sensible, and so it is easy empathise with him when things take a turn for the dramatic. On the other hand, Sousuke's motivations are purposely made unclear until his secret is revealed in the final episodes. There's nothing complex or excessively grim about his secret-- just that he makes mistakes as all teenagers do and wants to alleviate his regret by competing against his friend. Sousuke's goals are nothing so grand and cliché as being the best in the world, and that's precisely what makes it feel authentic. \\n\\n\r\nFurthermore, the two interact with each other as friends in the real world would in their situation. They aren't characterised by archetypes, catchphrases or 'moe' appeal as many of the others are, and the purity of their friendship is not dragged down by cheap fanservice and fujoshi appeal. They fight, disagree and have each other's back just as real friends do. I just can't say the same for the Iwatobi four.\\n\\n\r\nThe Iwatobi four are far less interesting. Haru represents one of my largest issues with the series; by the end of the story, I did not understand him any more than I did at the very beginning. He swims and sweats for himself and then casts aside years of effort for absolutely no reason at all (unless you consider \"I'm bored\" to be valid characterisation), only to be fired up again when Rin pats him on the shoulder. Uh-huh. Much like the first season, he is blander than a piece of cardboard.\\n\\n\r\nNagisa continues to exist largely as a vehicle for shota appeal and yaoi doujins, behaving so effeminately that even girls would find themselves feeling boyish in comparison. Rei on the other hand is much more interesting, fulfilling a sort of outsider role that the other three do not, but his presence feels a little bit on the uncanny side when you consider that he is a gender-swapped clone of Azusa from K-ON, right down to the inflections in his voice. And then there's Makoto who is just... there, neither offensive nor any great asset to the story. He's characterised more by his friendship with Haru than he is as his own person. \\n\\n\r\nSome of the side characters, like Rin's sister, Gou, add plenty of colour to the cast... but then you have Nitori who exists only to remind us what the show was originally created for. Nitori (who I have personally dubbed as 'That Fucking Guy' and found myself rushing towards the mute button whenever he appeared) is pure, shameless pandering for the fujoshi crowd. There is no reason for him to exist in the story. All he does throughout the series is follow Rin around like a stray kitten, blush and cry repeatedly, and ruin important moments by jumping into arguments that have nothing to do with him. He destroys half of Rin's scenes with his \"d-don't fight!\" and \"y-you can do it!\" and for that I despise him. \\n\\n\r\nThe ending of Free certainly carries its share of emotional weight, and those who like the Iwatobi four more than I do will probably find themselves tearing up once or twice in the final episode. I just wish there was a bit more to it, something with more complexity than the typical \"power of friendship\" fare. It feels like that's all we ever see in sports anime these days.\\n\\n\r\nIt's also worth nothing that the penultimate episode, set in Australia, actually has western people speaking proper English instead of the incomprehensible Engrish common in anime. Wow! There's still the \"all foreigners are blonde\" stereotype, but at least KyoAni shows they're willing to put effort into the smaller things.  \\n\\n\r\nIt should not come as any surprise given KyoAni's seemingly infinite budget, but Free looks amazing. The swimming matches are rendered with finesse and the backgrounds with incredible detail, resulting in a predominant feeling of awe when the characters find themselves in the massive national stadium for the first time. I also wouldn't be surprised if members of KyoAni travelled to Australia to gather research for the episode, given how alive and real the scenery feels. It certainly does more than just look nice. Had Free been drawn by almost any other studio, I'm not sure the characters and story would be anywhere near as effective. \\n\\n\r\nThe music of Free is so great that it does not even need good writing in order to draw emotion from its audience. All that's needed is to listen and the scene will come alive. Even when it was a situation I would not normally give a rat's ass about, the background music grabbed and held my interest in what was going on. To be fair, though, there's no big, memorable track that defines a moment in the story and the ending theme does kinda ruin the moment in the later episodes as it transitions from drama to some upbeat pop song. \\n\\n\r\nIs Free a worthy sequel? It sure is, and I don't think there's any sane individual who could possibly think that the second season is a step back from the first. It improves upon its predecessor in virtually every regard, elevating itself from \"fun garbage\" into something that's consistently decent, occasionally even verging on the point of being 'good'. \\n\\n\r\nBut that doesn't change the fact that it's Free and that Free has a very specific audience in mind. It certainly tries to increase its appeal by toning down the fanservice, but with Nitori's increased screen-time and various questionable scenes (like Rin and Haru sharing a bed in one episode), I still don't think KyoAni has any qualms about alienating those outside its primary demographic. And I guess that's how it's always been and always will be. \\n\\n\r\nKyoAni still has a long ways to go in order to redeem themselves, but the second season of Free is at least a step in the right direction.",
            "date": "2014-09-29T01:27:00+00:00",
            "helpful_count": 260,
            "mal_id": 162839,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=162839"
        },
        {
            "content": "The swimming boys are back! Free! kept its promise from season one (\"See you next summer...\") and returned for another season of swimming, slice of life and manservice. After the first season of five guys swimming competitively and their daily (mis)adventures turned out to be a huge success, it was no surprise that it would get a continuation. And now that the second season finished, how does it compete with its prequel?\r\nFollowing the story of season one, Free!: Eternal Summer starts off with a new high school term. Makoto and Haruka are now third years, while Rei and Nagisa are now second years at Iwatobi.And how else would they start off a new year if not with swimming? They return to the swim club and begin with the search for new members - failing in the process, participating in a friendly competition against the team of Samezuka, dealing with their individual struggles, and much more. All that while they practice and try to improve their swimming even more to participate in the regionals - in hope of success this time.\\n\r\nSpeaking of Samezuka, in the meantime Eternal Summer gives us an insight on the swimming team of Samezuka as well - with Rin as the new team captain and a couple of new members the Samazuka swimmers are up for a fresh start and ready for more challenges. A huge focus here is the addition of Sousuke - an old childhood friend of Rin's, who transfers from another school for certain reasons.\\n\\n\r\nBut swimming is of course not the entire focus of the show. Just like season one, Eternal Summer is filled with lots of slice of life moments, because as we are all aware, Free! is not all about sports. It is not trying to be, anyways. Unlike other sports-themed series, the focus on seemingly \"plotless\" scenes is a huge one, and Eternal Summer is continuing to deliver great slice of life moments that evoke all sorts of emotions. If Iwatobi's hopeless yet funny search for new members, the heartwarming Nagisa-centered episode or the stunning trip to Australia - in the slice of life aspect, Free! is undoubtedly convincing.\\n\r\nAnother central theme of the second season is future. As Haruka, Makoto and Rin are in their last year of high school, it is an unavoidable question of what they will do after graduating. Definitely an interesting topic, and a good set-up for drama. Now, the drama - and the resolution - in Free! is often cheesy and overdramatic - and in the case of this season it is the case too, but still an improvement from season one. Especially episode nine shows how good drama in Free! can be - in this episode it was very well executed. \\n\r\nStory-wise, if you enjoyed season one for its story (or the lack of it in most parts) then you will like it in season two just as much. Lots of friendship, drama, slice of life, swimming is just as present here and just as enjoyable.\\n\\n\r\nCharacter development is very much noticeable in season two. And this even though the cast has not changed much - the main group of five is still the same. The only important additions to the characters are Sousuke, whom I mentioned before, and Momotarou, Seijuurous younger brother, who joins the Samezuka swim team as well. And even though the change is small, the characters go through crucial developments, making them even more interesting than in season one.\\n\r\nStarting off with Haru, who already opened himself a little more compared to season one - while in latter he did not really take interest in swimming competitively (\"I only swim free.\") the final of season one showed its effect. Haru now likes swimming together with his friends, and competing against them. And over the course of Eternal Summer he goes through development too - his struggle with the question if he wants to swim professionally or not makes for some really good drama.\\n\r\nRin's character is also a very interesting one in this season. From the angry and frustrated guy he was in season one he appears now as an easygoing character. It really shows how swimming with his old friends again returned him the joy of the sport. And as the new captain of the swimming team it shows even more.\\n\r\nMakoto, Nagisa and Rei do not get as much focus as Haruka and Rin, though go through some development too. Makoto decides how he wants to continue after high school and continues to support his friends with all his might. Nagisa gets an episode dedicated to him that gives us more insight in his character and is the usual moodmaker of the group. Rei continues to improve his swimming and strengthens his bonds with the group.\\n\\n\r\nJust like season one, Free!: Eternal Summer stands out in the art aspect. The character designs look great as always and the animation is fluid. Especially the scenes where swimming is involved have spectacular animation. One other thing I noticed is how the background drawings are very detailed and beautiful too. It is especially noticeable in episode 12, which has a different setting from the other episodes. The scenery is stunning. Besides that, the series is as colorful as ever, fitting the mood of the show nicely. A thing I could criticize here is that some scenes were not as well animated as others, but this does not disturb the overall performance.\\n\\n\r\nIn terms of music, season two continues with the same old recipe for success. For the opening, we get a new catchy J-Rock song by the band OLDCODEX, that holds well up with season one's opening. The ending song is another fun song by the main cast of the show, accompanied by a hilarious ending animation. The background music continues to be nice, too.\\n\\n\r\nOverall, Free!: Eternal Summer continues to be a fun series with great character development and nice music and art. Thus, I give it an overall rating of 9/10.",
            "date": "2014-09-24T09:51:00+00:00",
            "helpful_count": 114,
            "mal_id": 161911,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1773935.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/silverwalls",
                "username": "silverwalls"
            },
            "url": "https://myanimelist.net/reviews.php?id=161911"
        },
        {
            "content": "There is a limit to how much weight can a single shark lift.\r\nFree!: Eternal Summer is a sports comedy slice of life show and a direct sequel to the first season, Free!. It is a reverse moe trope anime, with moe tropes found in girls given to the guys instead. Usually dubbed as a fanservice show for girls with swimming as a backdrop, does it have anything more in it? The answer is yes, it does, but not so much.\r\nPlot:\r\nAnother summer comes and the swimmers of Iwatobi and Samezuka High School swimming clubs are once again in a rivalry. It is the last school yearfor Haruka, Makoto and Rin, and they have to make their career decisions and find out how much the passion of swimming can help them in the future, all in meanwhile an old childhood friend of Rin's appear to spice up the situation.\\n\\n\r\nThe plot is pretty simple: the characters start swimming and battling each other again while some of them sort out their personal problems and look forward to the future. The problem is though that KyoAni forgot how to make good drama. We witnessed that in Chuunibyo, we now witness that here. The anime fails to have a clear indication of what it wants to be, hovering around fanservice, sports and drama, and does neither well. The main plot element of the story, swimming, is not of much relevance, since the only thing driving it are characters wanting to swim a relay (which by definition is stupid and more on that later on), and is done horribly wrong, and as a sports anime it fails to create a climax and general hype.\\n\\n\r\nCharacters:\\n\\n\r\nThe cast from the first season returns with some new additions and a little bit more development on some, so I'll introduce them shortly: Nagisa, Makoto, Rei, Gou (Kou), Miho on the Iwatobi side, Aiichirou, Momotarou on the Samezuka side are the basic one dimensional characters that can be described by a pair of personality/motivation traits, and are used mainly as plot devices, comic reliefs or assumes a cliched position (like teachers/mentors in Gou and Miho). That's a lot of characters. That's 6 characters in a show that has like 10 total characters that are atleast relevant of some sort. Excluding Makoto, none of these characters get any development apart from simply getting better at swimming (but there's no perspective provided, so that point is irrelevant).\\n\\n\r\nNext on the list is Sousuke, a new (old) Rin's friend. His personal drama was the best in the show, and he is the only character where I could understand why he wants to swim the relay so much. Sousuke is a nice addition to the anime, helping the 2 mains develop and having enough characterization for the audience to care about him aswell.\\n\\n\r\nMoving forward we have Haru. Oh, I personally hate him so much. As the main protagonist he is extremely shallow and unimportant to the story for the most part. The problem with all silent protagonists is that usually they don't show any emotions, meaning that there's no room for characterization from their perspective. You just don't who they are exactly, you can't relate, you can't care for them. \"I like swimming because I don't know exactly\" doesn't give me enough information to care for you. However, Haru's lack of emotions did not go unnoticed by the rest of the cast and ended up being a prrety decent plot point to spark things up. Fortunately, Rin saved him by dragging him to Australia and telling to develop the f*ck up, and he did. And it was actually believable. It doesn't change the fact that he was the worst character for 20 episodes, but he got a legit ending for him and is one of the rare cases where the silent protagonist turns out okay.\\n\\n\r\nAnd here we have Rin, by far the best character in the show. He gets a huge amount of characterization, development, and backstory. In contrast to the other one (or at max two) dimensional characters of the show, he is miles ahead of them. There's nothing so much to talk about him, other than everything makes sense in regards to his character and personalization. All of his actions are completely reasonable and reflect on who he was, who he is now and what he wants in the future. However, he can only do so much alone, and he's not even the main protagonist, only a deuteragonist and even an anti-hero in the first season. If the anime was centered around him, boy that would have ended up so much better.\\n\\n\r\nThe problem with most of the characters again is the lack of characterization. The members on each team exist solely to form a relay, and otherwise are irrelevant. Motivation alone is not proper characterization, that's just a personality quirk. Some of them are so shallow, like Rei and Momo, that it is safe to say that they are just plot devices. Also, their girlish behaviour to reflect on the reverse moe nature of the show just doesn't work. All those blushes and cute moments should be left to girls, as it ruins other aspects of the show that are rather serious, like coming out of age. Furthermore, there's only like 10 characters in the show, the rest are 0 dimensional people that are there for the realism. Where are the other swimmers? Why is it only focused on 8 people when there are thousands of different kind of athletes? Global perspective? The perspective of the best? Nah, those don't exist. Sadly.\\n\\n\r\nWriting:\\n\\n\r\nAnd the swimming is as bullshit as ever. KyoAni, if you wanted to make a sports anime about swimming, please research on what the hell you are trying to create, because swimming does not work that way at all. It reminds me of NASA using the \"Armageddon\" movie as a training program, where they asked the trainees to present all the scientific inaccuracies in a 150 minute film. A total number was 168. In this anime, I counted atleast 60, and with the first season combined that would be well over 100 swimming inaccuracies. That is, ladies and gentlemen, a lot. It's so much that you can safely say that the swimming is executed poorly and without any logic. Having a 12 year (and counting) swimming career experience, this completely destroys any enjoyment I could possibly have had from the races and swimming bits in general, and it saddens me that this anime disgraces swimming so much with its inaccuracy. I will tell you right now, don't get the idea that this sport works like that because it definitely doesn't. It's not K-On where everyone can just take a guitar and form a band, it takes years and years of proper practice and only the select few are successful, something that this anime failed to show us.\\n\\n\r\nMoving on, the comedy is pretty simple. We have two comic reliefs on each side, Momo and Nagisa (Nagi is more of a pseudo). The jokes are mostly reactional, like Gou glancing over muscles, the teacher giving her literacy analogies, Nagisa's playful personality induced character interactions, basic stuff that can be assigned to be a specific character trait (sadly some of the characters are only defined by that single trait). It is not distracting, and it is funny and nice at times, so the comedy's fine. The drama is sometimes mishandled by a long shot (Nagisa runs away from home), or sometimes hits right on the spot (Sousuke's struggles), but the biggest problem is that it is not focused enough, and the anime is not long enough to cover and expand on every plot element. They did have 25 episodes over two seasons but only Rin is the one that got enough focus as an actual character. \\n\\n\r\nThere are a couple of illogical things in the show not regarding swimming (as much as I loved episode 12, them going to Australia was just whaaaat in terms of logic), but for the most part it's okay, since the anime doesn't try to have deep and complex situations and instead restricts itself to simple problems. There are no parents in this show (again), apart for them being mentioned, and I already wrote once that parents are an important piece to developing the personality of the characters, as they are typically the ones that influence children the most, and that especially applies in a coming out of age anime such as this one, where our characters face a dillema of what the future holds for them. As for the actual competition, they overuse the \"power of friendship\" way too much and that symbolism sometimes destroys immersion (like the last episode.... yes, I came to see them swimming with the dolphins, totally)\\n\\n\r\nAnimation and Sound:\\n\\n\r\nOnce again, KyoAni gets the animation done right. It's always a pleasure for the eyes to watch works animated by this company. I have a slight problem with how swimming is animated though, as everyone swims exactly the same and there's no variety at all, and on top of that the hand movements do not look like how it is presented in the show. It doesn't have much of an effect of those who don't know swimming that much, but it is a problem for those who have been a part of competitive swimming or follow the competitive scene.\\n\\n\r\nThe character designs are okay, except the fact that they made Rin's teeth like that to show us that he's kind of an antagonist in the first season, and that totally goes out of character in the second one. The blushes and cute boys doing cute stuff is well, reverse moe thing, you can't say much against it but they don't do anything to serve the narrative.\\n\\n\r\nThe soundtrack is unmemorable, the sound itself is pretty okay. The swimming sounds well and that's about it, nothing much to talk about here. What I could talk about though is the amazing decision to hire Aussie voice actors that speak with an Australian accent instead of getting some local japs to do their bad English gibberish impersonations. That was one of the highlights of the show for me and I was just stunned at the amazing English that was spoken here, something that is very rare. That bit alone made the Australia episode so much better (and one of the reasons why I liked that episode in particular so much)\\n\\n\r\nThe first OP for the show is very manly but otherwise forgettable, same with the second ED where instead of that you get fanservice pondering, cool but uninteresting. They made it better in the first season.\\n\\n\r\nSummary:\\n\\n\r\nFree!: Eternal Summer is a rare case of a show which not only does the first season justice, but actually surpasses it (well, the first season was below average anyways). If the swimming was executed well it would have been a really good anime, sadly that wasn't the case. Apart from the KyoAni visuals style and fanservice for girls, there's really no reason to watch this series. Everything has been done elsewhere and better. Still, this might be your average jack-of-all trades anime where nothing stands out (and some elements stand out as bad), but overall you find it enjoyable enough to follow.\\n\\n\r\nFinal Verdict: 5.2/10\\n\\n\\n\\n",
            "date": "2014-09-25T05:06:00+00:00",
            "helpful_count": 72,
            "mal_id": 162071,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4007477.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Manumento",
                "username": "Manumento"
            },
            "url": "https://myanimelist.net/reviews.php?id=162071"
        },
        {
            "content": "Although sequels can be a hit or miss, Free: Eternal Summer extends on the organic setup of the first season. From shirtless guys to competitive swimming, this show brings the reincarnation of the swimming genre, a sports series that revolutionizes itself with what it has already accomplished from season 1. A good impression for a sequel usually require the essence of the original. While Eternal Summer doesn’t blow the original out the water, neither does it sink beyond salvation.\r\nFrom what’s shown, Free builds on the foundation of its characters and virtues with connections. Characters connect with one another for a common interest and passion. Inthis case, it would be swimming. The first season gave the audience a well-rounded introduction of the characters ranging with a variety of personalities. The sequel expands on this by forging connections and relationships. \\n\\n\r\nA prominent example is Rin, a character who used to share a rivalry with Iwatobi High School’s Haruka Nanase. Rather than putting on a ‘who the hell do you think you are?” attitude, his character becomes more blooming as he builds his own team. His new position as a coach of Samezuka Academy is a testament of this development as Rin becomes a role model for his teammates. These include returning member Aiichiro Nitori but also new members such as Momotaro Mikoshiba and Sousuke Yamazaki. Perhaps the most other prominent character of this team is Sousuke, a childhood of Rin. His personality is interesting to notice because he is almost similar to Rin from the first season. Tough, relentless, and intimidating, the sequel expands on his character through his relationship with both teammates and rivals. \\n\\n\r\nOf course, Samezuka’s rivals are members of the Iwatobi High School. All the members return from the first season with little change to their personalities. One noticeable aspect though is how some of the members begin to seek their potential futures. Because even though swimming is a big part of their lives, their future careers also requires focus to what they’ve learned. The never ending waters still follow the swim members though. The second season titled as “Eternal Summer” follows perhaps all of our characters’ development as that itself is never ending. It’s a rare sequel with significance because it expands on the story without recycling with material it has to work with. Characters such as Nagisa, Makoto, Rei learns through more experience and to work with others. Perhaps what might drag the show down though could be a lack of interest on some of these interests such as the diehard attempts during competitions. But let’s face it, this is swimming and competitions breeds rivalries. Rivalries breeds a dedication to achieve, a will to accomplish.\\n\\n\r\nSwimming doesn’t ride far from the sequel’s objective either. We see how characters improve as well as the impressions new players enter such as Sousuke. But what really stands out is the hidden development with some of the characters on technical terms. Haruka and Sousuke become a part of this formula through their rivalry both in and out the waters. What’s even more important is how it affects them physically and mentally. The sequel preys on this concept with a clever motive as the latter half of the show fleshes out their struggles. Rin too becomes part of the angle as lines of friendship and rivalries are drawn out when it comes to swimming competitions. \\n\\n\r\nHumorous and lighthearted, the show is a feast for the ladies. As the sport requires guys to take off their shirts and dive into their water, you can expect washed out abs flowing smoothly in the pools. You want muscles? You will get muscles. Gestures and movements are also brilliantly rendered with a degree of both realism and imagination. We see how characters move in the waters that captures their dynamic improvements. The whole thing could feel sappy at cases though as some of the swimming competitions zooms lightning fast without much thrilling moments. In retrospect, shirtless guys are delicious to look with its ebullience. However, it still takes its easy path without digging too far or make surprises; except on a few possible occasions. \\n\\n\r\nThe visual front still retains its phenomenal quality thanks to Kyoto Animation’s high class production. Waters are smooth with delicacy while the guys are drawn with well toned muscles. There’s a less emphasis on fashion though with characters like Rei from season 1. Most of it is replaced with lighthearted comedy on various degrees of successes. What I do give praise for is the visual expressions of the characters in this sequel. This is especially shown in the latter half as characters show a variety of emotions such as in the case of Haruka. Nonetheless, the artwork enhances their expressions with opportunistic camera angles and face features. But taking a simple look at the visuals, the series is aim to please, especially for the ladies.\\n\\n\r\nSoundtrack doesn’t change much from the first season with pop tunes and light-toned OST. Character voice mannerisms also retain their way of speaking. Sousuke’s stoic voice stands as a sharp contrast to most of the other members of his team though. In essence, it’s a contrast to the show itself because Free has all this energy while Sousuke seems to hold it back. Similarly, emotional scenarios has fitting music and credibility. I do also give credit for the creative attention of the ED song. Seriously, that song is more than just firemen, merman, or a male stripper. It’s a free style of art!\\n\\n\r\nFree Eternal Summer isn’t by any means an improvement of the first season. I should say it’s probably more or less equivalent but different with its execution. Character relationships are developed with all building up to a climax through initial processes. Its light toned atmosphere combining with a diverse cast of characters will definitely catch your attention. In fact, the sequel is similar like most of Kyoto Animation’s projects with an ability to lift your spirit. Had a bad day? No problem. Free Eternal Summer will bring back the liveliness of what Summer feels like beyond just the naked bodies and swimming movements. For people who love Summer, people who love swimming, and people who love hot guys being wet, this sequel won’t be a disappointment to you.\\n",
            "date": "2014-09-24T09:17:00+00:00",
            "helpful_count": 67,
            "mal_id": 161895,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=161895"
        },
        {
            "content": "The first and start of the second season to this anime was AMAZING.  It was 6th on my top fave anime list.  But as it progressed through the second season it just became really, really, really cheesy.  I expected Rin and Sousuke to start kissing or something, which totally ruined the story for me.  I enjoyed the rush it gave when they were partaking in tournaments  etc, but once that side was over it just became a gay romance anime (not to be taken in offence, this was actually how the characters began to act towards each other)\r\n  Thefirst series was SO GOOD though, like I was literally addicted to it and I was impatient for the second season.  I recommend watching Free!: Iwatobi Swim Club, but if you watch this season you will understand what I mean, hopefully.  I'm sorry if you were offended by my opinion, I have nothing against homosexual romance animes.  I've actually enjoyed many in the past, my favourite being junjou romantica, but it just didn't suit this storyline.  It pretty much killed my attraction to the makoto and haru friendship.  (If you're a fangirl/boy of this \"shipping\" stuff, you will probably ship haruxmako or haruxrin)  \\n\\n\r\n  Anyways, I have it a 5 overall.  It would've been a hell of a lot better if it wasn't for the cheap ending and the weird character friendships that were taking place etc.  I enjoyed the first series though.\\n\\n\r\n[THIS IS MY FIRST EVER REVIEW]",
            "date": "2014-09-27T14:42:00+00:00",
            "helpful_count": 45,
            "mal_id": 162499,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4130121.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/bilbofaggins",
                "username": "bilbofaggins"
            },
            "url": "https://myanimelist.net/reviews.php?id=162499"
        },
        {
            "content": "this got really bad.\r\nthe torturted animista can only suspect who actually were the culprits pressed the studio in this way to deliver a sequel, but do in no way anything like the first run. whoever it seems it was someone pritty fat and humourless but with a lot of influence to actually insist in the second season, for contract reasons only of course (!), but could force the makers to iron the whole thing flat. as flat they just could get it. really flat i mean. \r\nthey removed all elements which created not a spectacular but still entertaining anime in season one, as the senseof humour, the artwork and flawless animation suited the topic, and replace them with more of the dreadful \"ganbanakya, ganbanakya\" singing of morally indisputable, rather square looking crybabies. Was surprised they actually could swim.\\n\\n\r\nholy bukatsu! Now this will propably give president putin some well deserved tears of moral enjoyment. \\n\\n\r\nmaa ii, 3 points because it had some colour and sound! thats quite generous.\\n\\n",
            "date": "2014-10-23T14:45:00+00:00",
            "helpful_count": 19,
            "mal_id": 165941,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/758073.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/animimosa",
                "username": "animimosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=165941"
        },
        {
            "content": "Free! Eternal Summer is the season 2 installation of Free! Iwatobi Swim Club. It continues on where the season 1 had ended. At the start of the series, Captain of the Samezuka Swim Team, Seijuurou Mikoshiba, retired and assigned Matsuoka Rin as the new captain. As the anime continued on, it displayed the powerful bond of Haruka Nanase towards his team and his friends. The main focal point of the season 2 is the Iwatobi Swim Club's dream of competing in the national tournament. \r\nThe anime also introduced a new character namely, Yamazaki Sousuke. Even though character was a supporting one, he played a bigrole in the lives of the main characters. Sousuke became Rin's right hand man and Haru's main driver. Without Sousuke, Rin will never have someone who can protect him and give him advice and hope, while in the Haru's case, no one will remind Haru that Rin needed him badly and drived Haru to find his dream.\\n\\n\r\nThe anime displayed the strong bond of friendship between the characters. One example of this was how Haru's deeply cared about his friends when he revealed to Rin when they were in Australia that it's a big deal for Haru when he fought Makoto because of being stubborn of finding his own dream.  \\n\\n\r\nIt also showed the essence of having a dream,  being a leader, and having a hope to continue for your own future. What's good about the anime was that it not only focused on the main characters but also the supporting characters, like Nitori Aiichirou's struggle of improving his time record, Yamazaki Sousuke's shoulder injury that caused him to unable to swim anymore, and Shigino Hayato's overcoming his fear of water. \\n\\n\r\nOverall, the characters were equally given attention whether main or not, and have each own dreams. The anime taught on how to achieve your dream without giving up and how to look for your own dream by simply looking what's around in you. The music was also good for the moods of each scene and the character songs for each characters. I highly recommended this anime to watch because of the good life lessons it relayed on it's viewers.",
            "date": "2014-10-05T21:50:00+00:00",
            "helpful_count": 14,
            "mal_id": 163821,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4068291.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tachibanahotarou",
                "username": "tachibanahotarou"
            },
            "url": "https://myanimelist.net/reviews.php?id=163821"
        },
        {
            "content": "A little history lesson first:\r\nKyoAni is a very popular Japanese animation studio. KyoAni produced some of the most well-known \"moe\"shows in the industry, and animes like Haruhi, K! On and Clannad were household names in Japan. In retrospect, the popularity of these shows were mainly because of the popularity of the source material, but boy (!), KyoAni made them 10x more popular. On the other hand, KyoAni were not the only one producing those aforementioned shows, rather, they are part of a production committee (together with Kadokawa Shoten etc.), so got only a fraction of financial successes that those anime made (my assumption).\r\n In 2010,KyoAni made the Kyoto Animation Award which seeks (in my opinion) source material for adaptation. No winners were announced but one work received an honorable mention: Chūnibyō demo Koi ga Shitai!. Chunibyu got an animated adaptation in 2012, and even though it is not as popular as the previous franchises, its DVD sales were very good (15,466 average)  and the total combined sales from all other media, made this a financially rewarding production to KyoAni (they got practically all the money). Chunibyu was followed by Tamako Market (an anime original from the creators of K!On), Free! and Kyoukai no Kanata in 2013. Tamako Market and KnK were not financially successful in DVD sales (3,684 and 4,329 respectively), but they showed that KyoAni could create a franchise. But speaking of Free.. KyoAni hit a jackpot and Free! became a blockbuster with 28k+ DVD sales and lots of merchandise sold. It is the most financially rewarding KyoAni production in years buoyed by (probably) its large fujoshi fanbase. In my other review, I called \"KyoAni swimming in money\" because of Free!. Now, buoyed by success by the first season, KyoAni made the obvious sequel, and its Free! Eternal Summer. \\n\\n\r\nMy review:\\n\\n\r\nEternal Summer is a MUCH superior production than its predecessor. \\n\\n\r\nHere are some of its better points than the season 1:\\n\\n\r\n1. It actually featured more swimming than the first season. More sports = More Win. The first season was criticized for being a fanservice show first and a sport anime second. The second season balanced the two, and in my opinion, featured some of the most highly slicked swimming material.\\n\\n\r\n2. The drama is more stable, not contrived than the first season. I like the first season, but one character 'bitchiness ( Rin) does not make a compelling dramatic material. In Eternal Summer, the drama came from the character's choices and conflicts. It present a more realistic world where expectations become the source of stress from a main character. It showed that expectation from other people can break you.\\n\\n\r\n3. KyoAni is a  master at scenery porn. They were famed for creating fluid and solid animation that will make your eyes melt. Season 1 is a very solid entry animation-wise, but in Season 2, the animation stakes are much improved. It seems that KyoAni had an endless budget. Take for example, the swimming scenes in Episode 6 of S2. The fluid is alive and it is breathtaking. Props for KyoAni for bringing their A-game in this one.\\n\\n\r\n4. Much better soundtrack. There is a rap-theme in S2 and I like it. Some of the sounds were recycled from Season 1 but the other soundtrack is much better. \\n\\n\r\n5. Characters that grow and have a development. One of the main criticisms that Free! had received is that most characters were pretty one-dimensional. I have to agree with that. But in Season 2, some of them have their fair share of character development. Haru is not just some water-freak dude. Rin is not just a bitchy-whiny friend. And I like it. It showed that the production team cared for their characters. One new character were introduced, Sousuke, and though I  am initially turned off by his introduction, he grew in me by the reveal of his back story and motives.\\n\\n\r\nSo, I made my case that Eternal Summer is a much superior than Season 1. But I still have some sore points from Eternal Summer.\\n\\n\r\n1. I did not like how the main conflict was addressed. The sticking point is that the built-up stress and breakdown of one of the characters were just magically disappeared upon his visit in a foreign country. It made the \"darker and edgier\" points of the show pretty pointless. I wish the director  fleshly constructed the conflict  more and not some shortcut in its development.\\n\\n\r\n2. In relation to point no. 1 , I wish they did not add the some of the fillers in earlier episodes rather focused more so, in developing the conflict from its characters. I think a more capable screenwriter would create a much more satisfying pay-off by focusing on the main characters. I admit, even though my inner fudanshi is happy with the ending, it leave me cold.\\n\\n\r\nI will rate this show a 9 because I am biased and I want to raise its score in MAL. But objectively, this will score 7.5 for me, but because I love Free!, it is a solid 8.\\n\\n\r\nFree Eternal Summer is a solid effort from KyoAni and I am happy that they are now venturing out of their comfort zone. \\n\\n\r\nRecommended.\\n",
            "date": "2014-11-14T22:02:00+00:00",
            "helpful_count": 13,
            "mal_id": 168631,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3533699.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/peeyaj",
                "username": "peeyaj"
            },
            "url": "https://myanimelist.net/reviews.php?id=168631"
        },
        {
            "content": "Free! Eternal Summer took me for a ride starting from episode 3 till episode 13. Albeit very confusing at first (and last), I eventually learned the hottest guy's name and was satisfied with that. I'm fairly confident that most people watching Free! Eternal Summer will be able to learn at least one of the character's names before the abrupt ending.\r\nThe ending was, Lacking. It was rather unbelievable that the last episode hyped up the nationals swimming competition with a 20 minute intro (without an opening) about their pasts and reminiscing about their stories together, but the team ended up getting *th place. (no spoilers inthe guidelines).",
            "date": "2017-12-23T01:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 266075,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6825063.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ekal",
                "username": "ekal"
            },
            "url": "https://myanimelist.net/reviews.php?id=266075"
        },
        {
            "content": "I never expected myself to cry after watching, especially not a show like Free. But I did. Why? \r\nStory 8/10\r\nAt first I wonder, after competing for the swimming competition for the first season, will they compete again this season? The answer is undoubtedly YES. However, not only preparing for swimming competition, the main characters especially Haruka, Makoto and Rin since they are in the third grade, have to start thinking what they want to do after they graduate. \r\nThis is where I don't expect Free: Eternal Summer to be good. Although it is mostly about Haru finding his dreams, it is very relatable especially toteenagers nowadays who are wondering what to do after high school. While the first season was cute guys doing swimming club (something like K-On but the main casts are males), the second season is about self realization, coming of age and growing up.\\n\\n\r\nArt 9/10\\n\r\nKyoto Animation has gone all out for Free productions... It is really an eye candy. \\n\r\nThe water animation is even better and more fluid than the first season.. feels as it is alive and realistic. We still have the same casts with exact same character designs (thank goodness) with some new ones. I love how they animate the swimming scene and some scenes like crying (basically activities that involve water) but unfortunately animation is not as good in other scenes.\\n\\n\r\nBackground art is another plausible element, it is so beautiful even I screen captured some of them and made them into my computer wallpaper.\\n\\n\r\nSound 7/10\\n\r\nNew season means new opening and ending songs. I don't particularly heart them although they are still catchy (and funny for the ending). Soundtrack is more or less feel the same like the last season, those sonar-like electro and synth sounds. \\n\\n\r\nOne good thing, this season brings out more of the seiyuu's abilities to convey wider range of emotions like anger and frustration, and it was acted well. \\n\\n\r\nCharacter 8/10\\n\r\nWith our third graders graduating, we got to see more character developments between them. \\n\r\nOur Haruka or Haru has always lack the motivation and goal even though he has great talent and potential in swimming. In Eternal Summer his feelings and emotions towards swimming are challenged and explored. We will also see how his friends Makoto, Rin, Nagisa, Rei brings their perspective and insight, in a way helping and shaping Haru in finding his dream. They are more to them than what we saw in the first episode.. each of them have their moments and we learn more about their other side and secrets.\\n\\n\r\nThere are new characters Sousuke and Momo in Samezuka team, it means new friends and rivals. Sousuke is quite deep as a character while Momo is your happy-go-lucky boy, another comic relief.\\n\\n\r\nI wish to see more of Gou and the sensei though.. They barely get any spotlight and exploration, I feel they are just there for the sake of being there even though there are room for improvement.\\n\\n\r\nEnjoyment 8/10\\n\r\nFree: Eternal Summer really exceeds my expectation. I used to think Free as a light and shallow show where you can just watch without thinking and to pass by time. But this season proves me wrong. This time it is more on slice of life than just swimming, there are values we can take away  from the boys.\\n\\n\r\nIt is bad to say this but, this is season is also where we say good bye to our lovely boys. Now they have grown and matured, going their own paths in life.. but as Haru said, \"we will always be connected to each other.\" \\n\r\nThe last episode wraps the show well, the ending was satisfactory I cried in a mixture of sadness and happiness as this show ends. It is a nice way to end summer.\\n",
            "date": "2014-10-12T09:02:00+00:00",
            "helpful_count": 11,
            "mal_id": 164537,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2086837.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aikojazz",
                "username": "aikojazz"
            },
            "url": "https://myanimelist.net/reviews.php?id=164537"
        },
        {
            "content": "My expectations weren't so high... but after I got through the 2nd season I just can say: I did enjoy the show very much!\r\nOf course there actually is a slight homoerotic undertone but this does not mean guys should stay away from it or it's only a show for girls and Yaoi Fans. I think for guys it's quite amusing to see those guys swimming, chatting, ... whatever..., with each other. \r\nHowever, during the show, there is not so much attention on the swimming; rather, how they interact with each other, how they come and work together as a team and how they keep pushingeach other to raise the bar higher and - finally - for achieving their goals and dreams.\\n\\n\r\nFurthermore, Free absolutely stands out for being an Anime with a great character development. It was beautiful to see how the boys - literally - went through the episodes, with their own personal ups and downs (and sometimes something in between).\\n\\n\r\nThe art and the sound work beautifully together. I absolutely love the OST because it does suit in the setting perfectly and gives the anime this unique, pecial Flair.\\n\\n\r\nSo, this is an anime I can highly recommend to everyone! It's anime about swimming, about friendship, about being a part of a Team, about loyalty and about dreams!",
            "date": "2014-12-09T06:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 171545,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4269669.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MestariYN",
                "username": "MestariYN"
            },
            "url": "https://myanimelist.net/reviews.php?id=171545"
        },
        {
            "content": "STORY: 9 \r\nI liked it even more than the first one. Swimming and sweating and more RIN, oh thanks God about that character. \r\nART: 8 \r\nStill very good but nothing special. \r\nSOUND: 9 \r\nI LOVED EVERYTHING AND I REGRET NOTHING. The opening is one of my personal favorites and the ending is really catchy. \r\nCHARACTER: 10 \r\nI liked the characters more than the first season they had a big character development for me. \r\nENJOYMENT: 10 \r\nahhh i really didn't want it to end!! \r\nOVERALL: 9\r\nthanks for reading!",
            "date": "2014-11-28T01:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 170171,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3623895.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pazuhira",
                "username": "pazuhira"
            },
            "url": "https://myanimelist.net/reviews.php?id=170171"
        },
        {
            "content": "Watching this out of curiosity due to the hype and also for some time killing during holiday, Free!Eternal Summer is although might not be the best anime out there, it without a doubt is a very enjoyable series that worth your time.\r\nFollowing its previous season, I must say that Free!ES stepped up their game in its story and characters. \r\nStory: 7/10\r\nWhile I finished Free! in average impression, Free!ES although still maintained its common theme about friendship, passion, ambition etc certainly had improved its plot with more relatable events and less complicated, messy childhood flashbacks unlike Free! Although with the theme is pretty much light andnaive imo, some of the highlighted events were delivered in a very satisfying manner that I found very endearing. Also most importantly it was less angsty and less annoying compared to the first season which I found really boring due to the dragging drama that could have be solved in mere 2 or 3 episode.\\n\\n\r\nNotably, Makoto/Haru friendship ( the best thing in Free! series tbh), Rin/Samezuka team bonding and the overall relationship of the Iwatobi members although the latter only got me all the FEELS at the last minutes of  the last episode. \\n\\n\r\nMy only complaint may be that the plot all in all was quite underwhelmed and as a sports anime, I didnt really get pumped up for the sports but rather to fall for the friendship between Free! characters instead. Not necessarily a bad thing but I wish to see more of the  spirits in these athletes instead of shouting about friendship in each episode.\\n\\n\r\nAlso the new characters introduced in this season were quite random and underdeveloped imo. Their presences seemed to be an awkward addition to the original cast that I couldnt fit them in the old cast dynamic.\\n\\n\r\nArt: 10/10 \\n\\n\r\nBeautiful art as expected from KyoAni production. The characters were drawn in very flashy animation and I got no complaint for all the eye candies in this show. I absolutely love how they animated the water and gave a very detailed touch to its movement and I almost could feel what it is like to the characters  while being in water. \\n\\n\r\nSpecial mention to the emphasis on the eyes that were well used in conveying subtle emotions from the characters without having to blurt any word.\\n\\n\r\nSound: 7/10\\n\\n\r\nI could not give higher rating for the OSTs as I prefer the previous OST more. But it was still good and I got no problem with it aside from my preference of the last season. The voice acting was top notch and they really delivered their character well throughout the show.\\n\\n\r\nCharacters : 8/10 //////MILD SPOILER AHEAD//////\\n\\n\r\nNow move on to the strongest point of this show, the characters. Starting from our stoic, cool protagonist, Nanase Haruka, I must say that I am not entirely satisfied with his character. A man with little words, harboring vast love for water and swimming, didnt feel the need to acknowledge or to be acknowledged, I was baffled as to why majority of the cast were attracted to him. I love Haru but at the same time, I am not really fond of his overall manner in the series. Apart from being deeply bonded with water, his character so far were driven forward by his friends and his passion for swimming.\\n\\n\r\nBut I guess that's a part of his charms, having indifferent attitude made people riled up over him.  Also I kinda wished his conflict ed mind was properly confronted with his own realization instead being dragged around by other people. I wanted to see Haru putting more effort into what he treasures in his life and find a proper meaning of his existence to other people. But despite that, Haru is still a entertaining character that I really enjoy watching him.\\n\\n\r\nNext should be the other protagonist, Matsuoka Rin. Although I was totally annoyed by his angsty appearance in Free! Rin surprisingly amazed me with his development in this season. Moving on from his troubled past, he actually keeps on moving forward and with him being the leader of his team, it totally brings the best out his character. But letting go of your past doesnt mean you can forget your dream, with Sousuke's interference , Rin once again decided to pursue his childhood dream without looking back now. I am glad that they didnt take Rin into Iwatobi team but started anew with new people of Samezuka folks.\\n\\n\r\nI was pretty contented with Rin in this sequel except that he should keep his temper low while confronting with people especially his friends and I kinda want to see more of his relationship with Gou. \\n\\n\r\nMoving on to Tachibana Makoto, easily my favorite character in this series. I always has soft spot for caring, warm hearted character and Makoto is portrayed as a very realistic person. A genuinely kind friend that you wish to have for the rest of your life, he gave me the most impact in this series from his role as Haru's long best friend. Also I love how the anime keeping the subtle-ness in Makoto ways of taking care of his friends especially Haru.\\n\\n\r\nand although being less vocal in his passion in swimming, he actually showed the most development in this sports. Overcoming his fear of water and aspired to be the one who teach others in confronting the shared trauma. He knew what he wanted to do and while sharing the strongest bond with Haru, Makoto truly stands out the most for me as a very gentle and yet assertive friend who pushed Haru forward but at the same time without letting his hands off him.\\n\\n\r\nNagisa and Rei, I was bit disappointed with them having less significant role in this season. Also with Gou... ohh myy I wish they would be more appreciative of her by honoring her job as their manager but it was again solely focused the boys instead.\\n\\n\r\nFor some other characters, I am ashamed to say that I got nothing to say as I didnt really attached to them to get insight of their character. But I did have lil problem with the new character especially, Sousuke. His character was okay and it could've been less awkward if his appearance was foreshadowed in the first season. His presence while it was necessary, he stuck up like a sore thumb in Iwatobi and Rin's relationship he appeared to be very random in some scenes.\\n\\n\r\nwell, that's all I've got to say about the characters with main focus ended up on the main characters lol but Makoto is love!!\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nWhat can I say, with this long ass review you can totally see how much I enjoyed this series lol With the all half naked boys fanservice, I contained my laugh and giggle from all the teasings \\n\\n\r\nOverall: 8/10\\n\\n\r\nI actually wanted to give this a lower rating but then I remember all the fun times watching this anime, it deserves the 8. Not a 'OH WOW masterpiece!' type of anime but it still gave me a real good times following the journey of these passionate swimmers. Also with Makoto the bae in this, I was being kind with the score XD\\n\\n\r\nsooo if you want an anime with eye candy bishounen flashing off their muscles in every second of it but at the same time experiences the joy being under water with the boys, sharing their cries and laughs, follow the dream and journey of their genuine friendship, Free!Eternal Summer wont disappoint you!\\n\\n",
            "date": "2015-01-20T07:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 178645,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1071119.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lilymul",
                "username": "lilymul"
            },
            "url": "https://myanimelist.net/reviews.php?id=178645"
        },
        {
            "content": "I realize this series is more of a fan service anime for girls.  I would recommend any girls to watch this anime, but if you're a guy you probably won't get as much enjoyment out of this anime. I gave this anime a 5 because the anime didn't show much competitive swimming. The show focused a lot on fan service. For me, the first season was much better and this season was more of just a copy of the first, they just got better at swimming. Although the characters did evolve throughout this season.\r\nThe good points of this series for me was the soundtrackwas a 10/10. All the songs blended well with the anime. The art was also another one of its strong points. The story was good, but I think it could've been more entertaining at some points. It was a very relaxing anime, but it was mostly do to its soundtrack.\\n\\n\r\nFor girls I would definitely recommend this anime!!!",
            "date": "2016-05-24T10:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 219231,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4751347.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Chiaki__Nanami",
                "username": "Chiaki__Nanami"
            },
            "url": "https://myanimelist.net/reviews.php?id=219231"
        },
        {
            "content": "When I watched Free season one  I honestly thought it was average at best, not even finishing it untill season two was about to begin. I watched up until episode 8 and dropped it. However coming back to it was the best decison I've made when its come to watching some shows. The last 3 episodes saved the show, making me give it an overall of mark 7 out of 10 for season one! NOW Season two \r\nStory: Much better than season one, there was no awkward rivalry between old friends, as it was resolved at the end of season one and they allgot on very well, you could tell that they had matured and it was a mature enviroment. There was friendly competition and they all looked to the future making it all the more enjoyable to watch, however there was some character arcs that really pushed the show to much better than a simple slice of life of a bunch of \"friends\".\\n\\n\r\nArt: I think everyone knows the art in this show is AMAZING! And I'm not just talking about the man-service. The water and animation of when they are swimming has soo much detail. \\n\\n\r\nSound: Opening was pretty good, and soo was the soundtrack, But the Ending song is what seals it. It's catchy and fun, you will find yourself bouncing around singing to it, it has soo much energy. \\n\\n\r\nCharcters: All the characters grow in their own way through the series. However as Haru is the main character the show revolves around him. This is much different to season one, where it mainly centered around Haru and Rin. However the evolution of Rin is by far the best thin about this show, aswell as the growth of many of the returning cast. Haru deals with his future as well as showing a different side to him. Sosuke is a new character that comes across as a rival but however does give a different perspective throughout the series \\n\\n\r\nEnjoyment: I will start by saying that I LOVE THIS SHOW! Season one was good at best, with the last episodes of the season saving it, but this exceed all of my expectations and made me soo attched and involved with the characters, making me kinda obsessed with it now. \\n\\n\r\nOverall, if you were like me that didnt really get season one, dont worry, season two is excellent!",
            "date": "2015-01-07T20:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 176749,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3570111.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlackOpps_",
                "username": "BlackOpps_"
            },
            "url": "https://myanimelist.net/reviews.php?id=176749"
        },
        {
            "content": "Art (7): This is the only truly good thing about this show. The animation is gorgeous. I've always love Kyoto Animation's aesthetic and they way they animate faces and emotions and the subtleties in the character's expressions. But, I have to say that the characters aren't even really deep enough to animate truly subtle emotions on their faces, one of the things that makes the Haruhi Suzumiya character animations amazing as well as the Lucky Star animation, or what I've watched of the Nichijou adaptation. Granted all the characters in those stories are far more interesting and compelling just as people who have lives outsideof what the central theme of the show is, but now I'm off point. My point is that the animation is amazing. The show is very pretty. And that's its biggest plus. \\n\\n\r\nSound (3): The only music I remember even remotely liking is the ending theme. Which wasn't as good as the first season's ending theme. The OP was as annoying as the first season's and just as unfitting. And I don't remember any other music at all. The dub is okay. I still think that J Michael Tatum was miscast as Rei, though he can be good at times. And Nagisa's voice got annoying after a while of hearing him WHINE AND WHINE AND WHINE!\\n\\n\r\nStory (4): Admittedly, the pacing is better than the first season. Probably because this one has a lot less to establish before just jumping in. The last season had to establish everyone's relationships with each other, then the swim club, then the whole thing with Rin, then get Rei into the club, then have Mako's fear of the ocean (which wasn't necessary, just random fluff), before the regionals. This one just has to establish Sousuke and Momo. Momo is fine. I don't really have any problems with Momo. He was a fine addition and he had good chemistry with the other Samazuka swimmers. We'll get to my problem with Sousuke. Anyway, yeah. The pacing and story was better than the last season (which isn't saying too much, the story was the weakest part of season 1)\\n\\n\r\nCharacters (2): A lot of people love these characters. And I don't give this category such a low score because I hate them. I don't hate all of them. I liked Haru in the first season. I liked Rei in the first season. He was a legitimately entertaining character in the first season, and he still is in this one. I rank this category so low because of a few things. \\n\\n\r\nFirst: I assume that Rin, Mako, Haru, and Nagisa all met when they joined their kid swim league (if not, they knew each other even longer), which means they've all known each other for at least like... 10 years? 12? And SOMEHOW when Mako tells Haru he's already decided his future and Haru gets pissed that's somehow their FIRST FIGHT EVER? ARE YOU FREAKING SERIOUS? Alright, why this is ridiculous, okay. So, I have this friend who I've known for literally the same amount of time. 12 years. We've been best friends for 12 years. And we fight ALL THE TIME! I consider this person my honorary sibling, and we have pretty much all the same interests and incredibly similar opinions on a lot of these things and WE FIGHT ALL THE TIME! It's ridiculous. If it was Nagisa and Rei's first fight, that would make sense. They haven't known each other that long. Only like a year or two. But knowing someone for like 12 years to the point where you see them everyday and have NEVER had a fight is completely ridiculous. \\n\\n\r\nSecond: Everyone assumes that Rei is gonna quit the swim club JUST because his former coach offers him a place on the track team and he's busy after school. Which is dumb. If he came up to them and said that he was gonna quit THEN you can freak out. Don't jump to conclusions.\\n\\n\r\nThird: Nagisa runs away from home just because his parents want him to quit the swim club because he's getting terrible grades. Any reasonable parent would do this. I WOULD DO THIS if my kids were getting bad grades. It doesn't mean \"WE DON'T WANT YOU TO HAVE FUN!\" It means \"Hey, you need to get your grades up, and if you do you can go back to your club.\" It's the one part of the E Class system from Assassination Classroom that makes sense. Kids who don't do well shouldn't have the ability to participate in sports or clubs. That's also how schools work. At my school, if you got bad enough grades they wouldn't LET you join a sports team. This is how motivation works. It's not bad parenting. And all the teachers and club members treat it like it's ABUSIVE! If that's abusive, then almost every American high school is an abusive institution, as are many parents who are loving and caring and just want their kids to do well in school. My point is that this is ridiculous. \\n\\n\r\nFourth: Since Rin, Mako, and Haru are about to graduate they choose to have these super 'emotional' and 'dramatic' conversations about future and dreams and being scouted literally every five minutes and it get so boring and cringey. At least the cringe in the first season wasn't this freaking constant. WE GET IT THEY'RE GRADUATING! I DON'T EVEN FREAKING CARE ANYMORE! GOD! SHUT UP! PLEASE!\\n\\n\r\nFifth: And this is the worst one. Sousuke. Sousuke starts off likable and a reasonable character with realistic goal. Then, the main plot point surrounding him is that his shoulder is seriously injured because he neglected to take care of it when training. THIS IS FREAKING RIDICULOUS AND ILLOGICAL! ARE YOU SERIOUS? YOU REALLY WANT ME TO BUY THIS? Okay, maybe this is harder for me to swallow because I used to be a swimmer myself and I didn't take it anywhere near half as seriously as Sousuke takes it. Any time I had any pain, even minor, I would immediately report it to my coach. Even if I wasn't sure it was swimming related. ANY SENSIBLE HUMAN BEING WOULD IMMEDIATELY TELL THEIR COACH AS SOON AS THEIR SHOULDER STARTED BOTHERING THEM! And then GET A DOCTOR! No one as strongly into being a professional swimmer as Sousuke would allow an injury to get to the point that it hinders him FROM SWIMMING! Seriously. I once sprained my wrist outside of swimming, and while it didn't prevent me from swimming, my coach literally PULLED ME OUT OF THE POOL AND WRAPPED IT FOR ME when I told her about it. This is the responsible thing to do. Sousuke is an idiot. \\n\\n\r\nOverall (3): Watch any other better Kyoto Animation Show or sports anime rather than this series. Please.",
            "date": "2016-08-12T13:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 226578,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4978611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Suzu-kun22",
                "username": "Suzu-kun22"
            },
            "url": "https://myanimelist.net/reviews.php?id=226578"
        },
        {
            "content": "Anime covers just about every genre there is and there is always something for everyone, no matter what your preference might be. That's the beauty of anime. It is all inclusive, yet still unique, still unlike anything else in this world. That doesn't mean that every anime that has ever been made is something to be cherished, but every once in a blue moon, a special cherry blossom appears. The brightest star amongst the dark night sky. Free!: Eternal Summer is that bright star.\r\nI went into this series expecting a simple, fun anime. But what I discovered, was something far deeper than I could haveever imagined. The first season was emotional, but it was more about the fun, the joy of swimming. Eternal Summer goes above and beyond that, focusing on the future and our dreams. Deciding what we want from our future, what it is we long for in life, is crucial to succeeding in this world. Without a dream, we have no future. And without a future, we have nothing.\\n\\n\r\nThis overarching theme weighs heavy on our cast of characters. It is their third and final year of High School. Their third and final Summer together. The Seniors are posed with the same question that every Senior before them has been asked: Where do you plan to go after graduating? This weighs heavily on our band of joyous friends as they release the importance of their futures. The lives they've come to enjoy are beginning to change, and soon their lives will never be the same. This line of though leads to surprising confrontations, surprising revelations, and new determinations. Things that I have never seen so perfectly depicted in ANY form of media before.\\n\\n\r\nKyoto Animation pulled out all the stops for Eternal Summer. There was no holding back, and no looking back. The art is the greatest I have ever seen. It was at many times on par with the work of Ufotable. So beautiful and full of life and depth. And it also further proves that KyoAni is the undisputed king of water animation. Ever wave, every ripple, every drop of water looks so natural that it is hard to believe that it was drawn and animated. The beauty of the water is further emphasized when placed against the early morning sunrise and cherry blossom petals littering the surface of the water. Eternal Summer is a visual spectacle that is rivaled only by the infamous Kara no Kyoukai. And that in and of itself is an honor that very few are granted.\\n\\n\r\nTo top all of this off, the soundtrack tugs at all of your heartstrings, striking all the right chords. I almost cried on numerous occasions. It was unbelievable at first, but as the series went on I feel deeper and deeper into the rabbit hole. It drew me in with the sounds of the rushing water, the gasps of the characters, the raw emotion of the voiceovers, the authentic Australian English, and wonderful orchestra's. It was a feast for the ears, the mind, and the soul.\\n\\n\r\nAnd yet, I'm sad that there will likely never be a Season 3, as the title Eternal Summer even suggests. This is the end of the adventures of the Iwatobi Swim Club gang. But... that for once isn't such a bad thing. As much as I want to see more of them, their story has already been told. And it would probably be next to impossible to top such a masterpiece as Eternal Summer.\\n\\n\r\nFree!: Eternal Summer has accomplished something that only two anime, Clannad and Welcome to the NHK, have done before it: It left me in a state of catharsis. I sat in my chair and thought for a good while. Clannad made me question my life. Questions that I thought I had answered, were suddenly left unanswered. And so I strived to answer them once more, and I thought I had. Then Welcome to the NHK led me to the realization of just what I had become in my ignorance of the world, and I began to see things I had never seen before. And now Eternal Summer has taught me something that I will try my very best to never forget  That I have to find my dream. It just won't find its way to me. I have to go looking for that dream myself, so that I can have a future. Nothing communicated that to me more than Eternal Summer. I have nothing, but praise for this season of Free! and I will never regret deciding to watch it. And so it is with that, that I can wholeheartedly recommend this series to everyone, anime fan and non-anime fan alike. This is a series that should be on everyone's anime Bucket List.",
            "date": "2015-01-18T13:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 178391,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3837703.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nyren",
                "username": "Nyren"
            },
            "url": "https://myanimelist.net/reviews.php?id=178391"
        },
        {
            "content": "I'm going to say it: Free! ES was one of the best shows of the summer. Read into it however you will, but the second season of Free! improves beyond the original in nearly every way.\r\nI remember when Free! first burst onto the scene last year. Personally, I was surprised at how a show about swimming (with some potentially homosexual undertones) developed such a large following so quickly. I was even more surprised when I found that I myself had become part of that following. The first season of Free! was incredibly satisfactory and I found myself looking forward to season 2 almost immediately. Andit doesn't disappoint. Free! Eternal Summer lived up to my expectations and more. \\n\\n\r\nSeason 2 of Free! finds that Rin and the Iwatobi Swim Club have reconciled and are now friendly rivals (thank god). However, Haru, Makoto, and Rin, now third-years, are facing graduation and their last year on their respective teams. This becomes a central focus--what will they do after they graduate? The show explores this question very well and uses it to really get into how the characters are feeling at this turning point in their lives. Rin is dead-set on becoming an internationally-recognized swimmer. Makoto is unsure of what lies ahead, be it swimming on a university team or attending the local college. And Haru, perhaps for the first time in his life, is dealing with genuine pressure. Scouted by universities and without any post-graduation plans, Haru is ill-equipped to handle all of the sudden complications in his life. And we finally get to see what's going on inside Haru's head. He's more than just the quiet kid who likes water a little bit too much. Season 2 really defines Haru as a person and his character makes great strides. Don't worry, Nagisa and Rei are still very much here too. Both get their respective attention in the storyline and also become more than what we originally thought they were. Nagisa isn't always cheerful and carefree and his facade is somewhat broken down. Rei reveals himself as deserving of more credit than we perhaps give him, and really cements himself as an integral member of the team.\\n\\n\r\nJoining the mix are a couple newcomers: Yamazaki Sousuke and Mikoshiba Momotarou. Sousuke is Rin's childhood friend and an elite swimmer; Momotarou is the younger brother of the previous Samezuka team captain and shares his brother's attraction to Gou, much to Rin's chagrin. Sousuke becomes a central character as he is quickly at odds with Haru, while Momotarou provides some comic relief and occasional insights. Both are welcome additions.\\n\\n\r\nOverall, season 2 of Free! focuses largely on the interactions between the main characters. Supporting characters such as Gou and Ama-chan-sensei are kind of put on the back burner as a result, but there really is nothing lost. By shifting the focus from plotline to character, Free! really gets to the root of what drives each one of them, and the show pulls out its fair share of surprises along the way. This is an excellent example of a show that successfully shakes things up while still maintaining a tested formula.\\n\\n\r\nFree! remains a visual pleasure. Iwatobi looks as picturesque as ever and I never tire of the swimming scenes. Credit must be given to this show for making the swimming sequences dynamic and captivating. Free! likes to do this thing where it gets into the mind of each character as they're swimming and it really draws the viewer in during these scenes. Same good stuff we saw in season 1. No complaints here.\\n\\n\r\nA particular little highlight I have to mention is the OP. WOW, it is leaps and bounds ahead of the season 1 OP. From the song to the animation, everything about this OP is just on point. I actually didn't mind watching the OP each week without skipping it. Just a little thing that helps to make the show that much better.\\n\\n\r\nFree! Eternal Summer goes beyond what was accomplished in season 1. They wanted to shake things up a bit and the end product came out beautifully. At the end of the day, Free! is about a group of guys who have a passion for the sport and want to see each other succeed. It's as pure as storytelling gets. And in a summer surrounded by action thrillers and numerous mediocre fanservice shows, Free! provides a welcome breath of fresh air.",
            "date": "2014-09-25T20:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 162215,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1881912.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jambol",
                "username": "jambol"
            },
            "url": "https://myanimelist.net/reviews.php?id=162215"
        },
        {
            "content": "Initially I had no intention of writing about “Free!” again, mainly because I thought it couldn’t offer me anything new… but I was wrong.\r\nThe characteristic trait of “Free!”, and what I loved the most about the first season, was the always present factor of the friendship and camaraderie the swim team shared, it wasn’t the most special or unique one (might say), but it got to me in every sense of the way, thanks to the classic connection felt with teenage characters, that being the struggles of growing up, all accompanied by this, for some people risky, sense of male bonding that made the wholething special.\\n\\n\r\nTake it as you like, I can’t stop anyone from seeing the series as they want to see it… yeah I’m talking to those kind of watchers. Yet to me it was a marvelous display of teenage friendship and “soul searching” (in the cheesiest of ways).\\n\\n\r\nSo when the second season was announced I just expected another adventure for the gang, just another stepping stone towards the same goal, a slightly different display of just about the same thing… but I was wrong, again.\\n\\n\r\n “Eternal Summer” took it a step further, and all in the right directions, straying away from the first season the focus moved away from all the high school drama towards adulthood and the natural evolution of the characters, not as characters in a fictional world, but as people (felt the connection yet again), which was awesome. This season switched focus towards a more personal character focused approach, leaving the “teenage issues” deals behind as they got all changed and transformed by age, and trying to make the transition to adulthood for the characters so real and approachable that anyone who had the misfortune of feeling lost during this time of their life is definitely gonna feel the spark.\\n\\n\r\nAnd that’s the main beauty of “Eternal Summer”, unlike other second parts, it really took the concept a step forward, that concept being common “real” life problems. You might wonder what’s the point of getting too close to home, or what’s so special about it, but you see that’s the key of a good sequel, the interests are already at play and the characters are already developed (so is your care for them), so the stories and personalities don’t dwell in the same topics needlessly, they move beyond their previous state and get their necessary refreshment.\\n\\n\r\nYet not all is good in “Eternal Summer”, the drawback of the plot choices it that they leave the series too focused on the main characters conflicts, and more sooner than later even the main characters became subdivided and the swim team gets prioritized for the sake of making some of their stories more layered towards the end, I don’t need to say which characters get the spotlight… right?\\n\\n\r\nIn the end “Eternal Summer” is as good as a sequel can be, and as they should be, expanding the characters in a natural consistent (yet not equal) way that makes them feel evolved, matured, “grown up”, not forgetting the things that made the original great in the first place, the friendship is there, evolving with them, and the oh so loved camaraderie makes its “grown up” appearance as well, making this second season a full circle, as far as refreshing and improving its contents.\\n\\n\r\nIn conclusion, it a great series, obviously conditioned by how much you loved the first season, but overall a great experience whose message really is to be kept with you like the eternal summer… ok maybe not, but certainly for a long time. \\n",
            "date": "2014-10-29T11:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 166683,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3911503.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Carlzdachu",
                "username": "Carlzdachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=166683"
        },
        {
            "content": "Free! Eternal Summer was not as dramatic as the theme song made it out to be. It had a lot more comedy and somewhat corny scenes than I thought. However, sandwiched between those is an internal battle that is slowly building in Nanase Haru, is swimming because he loves the water really enough? For a fan of Free!, the previous season, it's satisfying to watch the swim team train harder, watch Rei improve, and reaffirm why they swim. As a motivational message, it's almost convincing to make someone want to swim. Still, if you feel the slice of life is being laid on thick, holdout for when they reach regionals (sorry for the spoilers). Everything after that, is rising towards a climax. We start to see the characters stand on their feet. For me, that was the most satisfying. In character development, Free! Eternal Summer is one of the best. It's similar to Houtarou' s situation in Hyouka. I digress. I highly recommend Free! Eternal Summer!",
            "date": "2014-11-12T18:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 168371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3518227.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kittyhawk09",
                "username": "kittyhawk09"
            },
            "url": "https://myanimelist.net/reviews.php?id=168371"
        }
    ],
    [
        {
            "content": "After watching the first season of Free!, without a second thought, I got the second season and started to binge watch it. I'm writing this immediately after watching the second season. I rated this one the same overall as I gave the first season: 8!\r\nThis is a direct continuation of the first season, and I personally thought it was really good. Like I said before, I am into slice-of-life anime, and this is my first venture into the sports sub-genre. If there is one thing I have a weakness for is for male friendships. Especially the kind, as in this anime, that are gentle andkind and share dreams and ambitions.\\n\\n\r\nAs with many slice-of-life anime, it is about growing up and learning and moving forward. This anime was no exception. Many people argue that the show has homosexual undertones, but honestly I fail to see it. What's wrong with friends crying or speaking their feelings to each other? What;s wrong with them caring for each other, relying on each other and being there for each other, helping each other out? I don;t see very many male friendships like this where I love and it's sad. This is why I really like this anime. No one in here is pretentious and too manly for their friends. \\n\\n\r\nAs the story continues to grow after the first season, so do the characters and their bonds. I loved the excitement of the competition whether in their victory or defeat! I would definitely like to have friends like those I see in this anime. Maybe I will, one day...",
            "date": "2015-12-04T00:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 204748,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/For_Reign",
                "username": "For_Reign"
            },
            "url": "https://myanimelist.net/reviews.php?id=204748"
        },
        {
            "content": "As the all-awaited sequel to the original manservice anime, this sequel proved to be one of the biggest surprises since first watching the Love Live! series. Although the first season had a rather cliched writing that justified its fanservice-heavy tones, the second season had definitely stripped off at least half of the fanservice moments from before and brought a truly remarkable continuation to the series with an conclusive ending.\r\nStory:\r\nWithout referring too much to the first season, it is still not perfect but definitely improved from the first. The stakes have been raised, the final year of Haruka, Makoto, and Rin is ending, post-graduation choices haveto be made. While in content it might sound generic like many high-school themed shows, its execution was more raw than the first. We get to relate with the characters more easily through their stories, their talents are being scrutinised by a larger audience than their peers, and we are constantly reminded of their progress up to the ending. There were enough twists to spice up the continuity. One could say that this formula is just enough to keep the audience interested\\n\\n\r\nSome critical aspects need to be mentioned, however. There was no escaping the fact that the story's \"friendship\" trope is omnipresent throughout the series, sometimes making it hard to take the show seriously. This is somewhat remedied by the longer interactions between Rin and Haruka, and the reminders of their graduation towards the end. The constant transitions to flashbacks is sometimes rather overused to flesh out the story, but personally it didn't make the show too choppy. In fact, despite these flaws, the story's simplicity and improved development made the show an easy watch without the feeling of bingeing.\\n\\n\r\nArt:\\n\r\nWhat can I say? I'm such a fan of Kyoto Animation's art style. They have produced arguably the most precise and fluid animation I've laid witness to, while rivals might include Madhouse or ComixWave (Shinkai Makoto's works). Although the highlights of the show were its swimming scenes, I even noticed how the small conversations between characters were so minutely animated, with the tiniest wave of hair to the little movements of the hand when they are supposed to be stationary. Very few studios can deliver such detail to the TV screen, let alone with such consistency from start to finish.\\n\\n\r\nEven with the scenery, the accuracy of the fictitious Iwatobi town (based off Iwami in Tottori prefecture) and Sydney pops up very well, with the credits even thanking authorities from Tottori and Australia for contributing to the background design. I believe Kyoto Animation just gets better at animating as the years go by, while Free!  and Free! Eternal Summer are one of the studio's fine works, at least visually.\\n\\n\r\nSound:\\n\r\nI can't speak too much about the background music other than that it didn't ruin the watching experience. What I can say is that the opening and ending themes (with the same singers from season one) have a sense of juxtaposition: the opening was rough and energetic to set the mood of a sports anime, while the ending cooled down the mood. I have disagreements on the ending theme when the episode ends on a dramatic note, as it sometimes killed the mood; the studio could have just ended it with a string of credits over the episode without music.\\n\\n\r\nCharacter:\\n\r\nWe are presented with the same characters Haruka, Makoto, Nagisa, Rei in Iwatobi swim club, and Rin from Samezuka. Side characters are present and add spice to the story-telling with their individual perks. New often-present side characters include Momotaro who's the comedy relief throughout the show, and finally Sousuke as the childhood friend of Rin before he met Haruka. Although most of these characters didn't feel out of place, their character development felt rather slow and stiff throughout the series; in other words their \"tropeyness\" was not shed in the end.\\n\\n\r\nThe only character whom I have issues with is Sousuke, who in my opinion felt like an afterthought when the source material was written. The back-story of Sousuke was revealed a tad bit later than I'd like, and even so it felt rather rushed and plugged in to add twist. Even his alleged friendship with Rin was not as convincing as Rin with Haruka and the others from Iwatobi. The addition of an extra character is not bad per se, but I would have liked if he had a more convincing relationship with the other members of Samezuka and Rin.\\n\\n\r\nEnjoyment:\\n\r\nNot knowing what to expect after finishing the first season, the show was one hell of a ride. It was DEFINITELY easier to digest given the reduced fanservice moments. The entire experience combined (story, art, sound, character) was a package deal of very emotional moments by the final episode; I admit I was close to shedding a tear (but didn't, hah!) during their farewell. What this means is that the second season to the #swimminganime franchise and hype was a surprising but satisfying experience.\\n\\n\r\nOverall:\\n\r\nif I had to consider the critical points I've noted throughout my watching experience, I must admit that I am still hesitant to call this a masterpiece, let alone something along the lines of something that breaks my thought paradigm. While the first season felt lacklustre story-wise, it is still worth bingeing through so that one can witness the much-improved second season. I'd rate it 8/10 for breaking my expectations as a rather memorable show, but shy of my hall of fame.",
            "date": "2016-12-19T05:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 235807,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5116899.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/takoShinji",
                "username": "takoShinji"
            },
            "url": "https://myanimelist.net/reviews.php?id=235807"
        },
        {
            "content": "Story: Well, I don't know how much I should write about this because this is the second season, and I already said that the show was great all together. The second season wasn't as fun as the first one, but it still had great elements. I guess it got a little dull because the four friends reunited after so long. However, it has new drama since Haruka, Makoto, and Rin are going to college in the next spring. It's still a 9 out of 10.\r\nArt: I'm not going to repeat myself because I explained it in the first season review. 10/10.\r\nSound: The opening and endingthemes are different in this anime. I prefer season 2's opening than the first season's to be honest with you. I can imagine listening to it whenever I'm bored than the other one. The ending theme is very weird. I guess the creators were trying to go for more of a humorous theme than a sweet one in season two, but I can't even take it serious. From what I can understand, it's titled, \"Future Fish.\" Anything with that title you see, you would have to prepare for the weirdness that comes right afterwards. I guess what I can say about scoring is 8 out of 10.\\n\\n\r\nCharacter: The main characters are still the same to me, and Rin has gotten better since the last season. Still going for 10 for 10.\\n\\n\r\nEnjoyment: Again, I'm not saying that it wasn't enjoyable, but I wasn't crazy about the second season. I would watch the entire series again without complaints, but I just won't get super excited over it. 8 out of 10 for me here.\\n\\n\r\nOverall: I do recommend watching both seasons. You would have an incomplete experience if you don't watch the second one. However, I won't torture you if you decide to stop if you don't like it. According to this here, the overall score is 9 out of 10 exactly.",
            "date": "2015-01-22T13:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 178765,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4102067.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ashketch95",
                "username": "ashketch95"
            },
            "url": "https://myanimelist.net/reviews.php?id=178765"
        },
        {
            "content": "Since I recently wrote a review on Free!, I'll now write one on the second season. \r\nI really enjoyed Free!, but Free!: Eternal Summer is even better.\r\nStory (9):\r\nAs with the first series, the show focuses on the main school's swim team participating in events. However, this time the group is now on good terms with Rin and the opposing team.\r\nIn addition to the drama inside the pool, I like the added drama in the characters' individual lives. For some of the characters, this is their last year in high school and they are all expected to choose what they want to do with their lives.In addition the main character Haruka questioning his reasons for wanting to swim.\\n\\n\r\nThere are some intense moments of conflict between the characters. I was hooked, wanting to find out what would happen next.\\n\\n\r\nCharacters (9): \\n\\n\r\nThe characters is a big praise I have for this show. There is not a single character I dislike in this show. Some new characters are added, some for the purpose of conflict.  Each of them have something likable and relatable about them.\\n\\n\r\nSomething else I wanted to point out. I actually did like the development of Haruka in this series. That was one of my complaints in the first one, that I felt he was bland compared to the rest of the characters, but I actually feel more connected to him in this one.\\n\\n\r\nMany of the characters get more development and more information surrounding their backstories. This is especially true of Rin (especially seen in the episode where they go to Australia and meet the family who hosted him when he was younger), and a new character Sousuke-who is a well developed character. \\n\\n\r\nArt (9):\\n\\n\r\nThe art is beautiful. The water is lovely and I like the animation of the swimming. The settings are pretty to look at.\\n\\n\r\nAs in the first season, the animation is great. Nothing ever looks choppy or rushed, but very fluid.\\n\\n\r\nSound (7): \\n\\n\r\nThe sound is good. I watched some episodes in English and some in the original Japanese. I think that in both cases the voice acting is good.\\n\\n\r\nThe ending song is catchy.\\n\\n\r\nEnjoyment (9):\\n\\n\r\nI found this series to be highly enjoyable. I was intrigued in the story and invested in the characters. I would definitely watch it again.\\n\\n\r\nOverall (9):\\n\\n\r\nI think this anime is worth watching. It has a good story, good drama, good characters, and lovely animation.\\n\\n\r\n9/10",
            "date": "2016-07-11T19:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 223780,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3897697.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AmberAmethyst",
                "username": "AmberAmethyst"
            },
            "url": "https://myanimelist.net/reviews.php?id=223780"
        },
        {
            "content": "!!! Maybe contains spoiler!!!\r\nAt first I just want to mention that in this review I'll also talk about the first season of Free! (Iwatobi Swim Club), because I gave both seasons the same score and I'm too lazy to write two reviews! :D Sorry about that!\r\nStory (8):\r\nSeason 1:\r\nThe story revolves around Haruka Nanase, a boy who has always loved to be immersed in water, and to swim in it. Before graduating from elementary school, he participated in a swimming tournament along with his fellow swimming club members, Makoto Tachibana, Nagisa Hazuki, and Rin Matsuoka. After achieving victory, each of the boys went their separate ways.\r\nTimepassed, and in the middle of their uneventful high school lives Rin appears and challenges Haruka to a match, showing Haruka his overwhelming power. Not wanting it to end like this, Haruka, gathers together Makoto and Nagisa once again and brings a new member named Rei Ryugazaki to create the Iwatobi High School Swimming Club in order to defeat Rin.\\n\\n\r\nSeason 2: \\n\r\nThe Iwatobi Swim Club returns! As their third year begins, Haruka, Makoto and Rin are still swimming strong, but choosing plans for their futures loom, and as friends both new and old make their way into the picture, rivalries will take root once again. Will the team make it out stronger than before or sink under pressure?\\n\\n\r\n--> I took this from the MyAnimeList Description of Free!\\n\\n\r\nTo conclude the first series is mainly about the relationship between Haru and Rin, who were very good friends in elementary school (they were both at the Iwatobi Swim club). Because of some incidents (I dont want to spoiler too much) they seperated from each other... when they advanced to the upper classes, they both swam again in swimming clubs and were rivals.  But because of some very nice/lovely scenes or incidents they finally swim together again having a lot of fun!!! (Especially one scene in the 12. episode had some \"magic\" and made me cry)\\n\\n\r\nIn the second season the pupils are going to finish school and try to find their dreams/jobs. The relationship between Haru and Rin is lovely and they have a few swimming competitions, solo and relays with friends as well. Also some new characters will be introduced, who make the second season even better! All in all I really liked the whole story!\\n\\n\\n\r\n!! I'll not write so many about the other parts, because the story-part has been long enough !! ;D\\n\\n\\n\r\nArt(8):\\n\r\nThe animations, especially during the swimming scences is very well done! It is also colorful and has quite good contrasts. I really liked it!\\n\\n\\n\r\nSound(10):\\n\r\nAnd that's the \"real shit\" in this anime in a  positive way!!! There are so many epic, funny and simply amazing soundtracks! I had a lots of earworms while watching this. In the most important scences of the story the music fits always! No metter whether it is a sad or an epic part! I made also a YT-Playlist of the soundtracks. Just fuckin' AWESOME! ;)\\n\\n\r\nCharacters(9):\\n\r\nEspecially Haru, the main character is special, not a typical main character (in my opinion) because of his behavior and actions. The most important secondary character, Rin (you can also say the second main character), brings a lot of emotions with him and makes the spectator feel what he feels! In general you can say Free! contains many differnt but also important characters, who can be funny, serious and just cool. Sometimes a few actions are unnessecary , but this doesn't make the anime worse. \\n\r\nSome of my Favorites: Sousuke, Makoto, Rei\\n\\n\r\nEnjoyment(9):\\n\r\nAs you can read above I really enjoyed the show! Maybe for me this anime is also quite perfect because I do track and field, which is comparable  with swimming. In the series the relay races take a very huge role, and I ran many track relays (with very good friends) by myself. So I can create a connection and enjoy the anime even more ;) It's also spreading emotions, sometimes you feel sad with the characters and sometimes it's just epic!!! \\n\\n\r\nI can really recommend this anime for those who like sports, love great soundtracks/good animations and want to feel FREE! :DDD\\n\\n\\n\r\n~ Nicoto <--- The guy with the bad english skills xD\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-07-04T14:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 223119,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5426791.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nicoto",
                "username": "Nicoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=223119"
        },
        {
            "content": "I will be writing reviews as soon as i finish a series, and so they will be totally based on my enjoyment of it and the ending will hugely impact it.They will also mostly just be my ramblings, without a linear thought process.\r\nI loved the first season of Free!.I was pretty new to anime then and was hugely impressed with the animation and bromance in it.I liked this season even more, but gave it an 8 whereas the 1st season got a 9.\r\nA large part of this is because i am strictly against changing my rating except in the rarest of rare cases.As i wasrelatively new to anime then, i was perhaps easily impressed.\\n\\n\r\nMost of the issues i had with this season were related to pacing.The first half (6-7 episodes) were way inferior compared to the second half.I must have teared up atleast 3 times, and i am not one to be easily moved, having seen a lot of anime.\\n\\n\r\nMany reviews say that Sousuke was the most fleshed out character in this season and that others did not see as much development.*SPOILERS*I disagree with it as i felt Haruka and Makoto developed by leaps and bounds in the last 5 episodes or so.The 9th episode was the best of the bunch as Haru's internal struggles were shown very well.*SPOILERS*\\n\\n\r\nI did think *SPOILERS* that Nagisa and Rei bawling their eyes out in the last ep was unsightly, as the drama was slightly overboard there, but its not that big of a deal *SPOILERS*.\\n\\n\r\nRin had already sorted out most, if not all, of his issues in the 1st season, so he was mostly there for the other guys to depend on.But his sister Gou and other side characters (their adviser and coach) received far less attention this time around.\\n\\n\r\nThe last episode was nearly perfect, though the middle was drawn out a bit and it would have been better if more emphasis was placed on other things in that time.\\n\\n\r\nThough some of you may not consider watching Free! because it might seem to be obviously pandering to women (whatever that means), i urge you to give this a chance, as though some parts may seem overtly cheesy and the beginning of this season may contain homosexual overtones, it really picks up at the end and goes out with a bang.If only all the episodes were as strong as the last 5-6 episodes.",
            "date": "2015-06-03T08:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 189457,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3644167.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Maggot_Brain",
                "username": "Maggot_Brain"
            },
            "url": "https://myanimelist.net/reviews.php?id=189457"
        },
        {
            "content": "Review em ingles:\r\nThe anime can be very cool for both those who do not enjoy swimming and those who enjoy swimming, the plot is pretty cool, but it bothers me the characters appear by chance, the guy who lives on Mars meets the face of the land in Jupiter, the two swim, they meet again on earth ... WTF type, but the water animation, it's beautiful, it's incredible, it's ... INCREDIBLE, the characters are cool, but we knowalmost nothing of their past, they're cool just for the personality, why they are not well worked, the 2 friends of Nanase are CRUCIFIEDLY DESPISED, little anime if fuck for them. Some competitions in the water could be better, like the last one, and some could be worse, like there is a useless thing that is all well done, there in the competition we only see them giving the turn and if they look, they swim head HIGH, their coach? They look in the middle of the WTF type competition.\\n\r\nBut outside these mistakes the anime is well built, you probably will not get sick watching this anime, you can learn enough about this sport, but not much ... The service is well ... all anime (almost all) has a fan service, but with WOMEN, the one with men, you man who felt \"strange\" with this anime, know what women spend with practically ALL THE ANIMES\\n\\n\r\n                           Review em portugues:\\n\r\nO anime consegue ser muito legal tanto para quem não curte natação e quanto para quem curte natação, o plot é bastante legal, porem me incomoda os personagens aparecem por acaso, o caro que mora em marte encontra o cara da terra em jupiter, os dois nadam, eles se encontram novamente na terra...tipo  WTF, mas a animação da agua, é linda, é incrivel, é...INCRIVEL, os personagens são legais, porem não sabemos quase nada do passado deles, são legais só pela personalidade, por que não são bem trabalhados, os 2 amigos do Nanase são DESPREZADOS CRUELMENTE, anime pouco se fode para eles. Algumas competições na água poderiam ser melhor, como a ultima, e algumas poderiam ser pior, tipo tem uma inutil que é tudo bem feita, ai na competição nós so vemos eles dando a virada e se olhando, eles nadam de cabeça ALTA, cade o treinador deles? Eles se olham no meio da competição tipo WTF.\\n\r\nMas fora esses erros o anime é bem construido, voce provavelmente nào vai se enjoar vendo esse anime, dá para aprender bastaste sobre esse esporte, mas não muito...O Fã-service é bemm...todos os animes(quase todos) tem fã service, mas com MULHERES, esse tem com homens, vc homem que se sentiu \"estranho\" com esse anime, saiba oque as mulheres passam com praticamente TODOS OS ANIMES\\n",
            "date": "2018-09-06T08:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 288309,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6350728.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Brondi",
                "username": "Brondi"
            },
            "url": "https://myanimelist.net/reviews.php?id=288309"
        },
        {
            "content": "Free! While I didn't write a review for the first season yet, I can say I enjoyed the second more and it was overall better.\r\nThe characters which were lacking in the first season now got the love they deserve and got some motivations for what they are doing.\r\nThe art style remained the same, which is good news, being top notch from the start. The songs were good but not near as engaging as the first season.\r\nThe plot was better spaced out and more intriguing.\r\nI overall enjoyed the show more than the first season, which is a great thing considering the first season was also entertaining.The fan service is still there <3.\\n\r\nWatch it for a good laugh, pretty boys and if you are into Sports anime, or swimming especially.",
            "date": "2018-07-24T14:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 284691,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6895746.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zero-2",
                "username": "Zero-2"
            },
            "url": "https://myanimelist.net/reviews.php?id=284691"
        },
        {
            "content": "Personally, I prefer the first season. In S2, besides having a pretty lackluster beginning, they created a new character (Sousuke) and gave him SO MUCH SCREENTIME. I H A T E D Sousuke, I couldn't bring myself to like or care about this character, and when he was in the center of the episode I felt so lazy that I didn't even feel like keep watching...\r\nI think this character was made ONLY so Rin could \"have someone\" the same way Haru has Makoto. But then, Rin already had Nitori (in a way), so... ??????????????\r\nAfter the anime stopped force-feeding us Sousuke and turns the focus backon the main characters, it starts to get good.Haru's character development was great (maybe even better than Rin's in S1), as well as Rin's and all the boys.\\n\\n\r\nA thing that I hated as well was that at the end of S1, it's clear that Rin transfers back to Iwatobi and joins the boys' club. But then in the beginning of S2, he's somehow back at Samezuka, as if he never left! WHAT? Did they just change the ending of season 1 (or just ignored it) or did I interpret it wrong? Anyway...\\n\\n\\n\r\nEternal Summer had a thrilling and feels-y finale, perhaps not so good as a SERIES finale but it was a great SEASON finale! I'm really glad to know that this anime was finally renewed and this year we'll finally have the long-awaited season 3! <3",
            "date": "2018-01-14T11:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 268556,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2804239.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/isahbellah",
                "username": "isahbellah"
            },
            "url": "https://myanimelist.net/reviews.php?id=268556"
        },
        {
            "content": "Story - 4\r\nArt/Animation - 8\r\nSound - 4\r\nCharacter - 4\r\nEnjoyment - 4\r\nOverall - 4\r\nIt's a nice anime, something to watch when you're waiting for the next episode of some other anime to come out. It's nothing special, though. There is character development, but it's not really significant. Although this is meant to be about swimming, the anime gets too tied up with all sorts of friendships and problems that aren't really problems, and I feel like that takes away from the magic of swimming. \r\nThe animation is stunning, and the soundtrack is pretty nice. But I feel like this anime gets way too overhyped when itreally isn't anything that special. I found myself quite bored while watching this, although I watched both seasons in the hope that it would start to pull me in. I just... I wasn't that entertained. For example, there's Haru with his \"I only swim free\" and it kind of just gets annoying after a while? and then how he always wears his swimming shorts underneath his clothes. It didn't really amuse me. I just... I was bored. However, there IS one scene in particular where Haru is trying on swimming shorts that look identical and Nagisa's like \"I don't see the difference\". That was pretty funny.\\n\\n\r\nThat aside, this anime does have some pretty good moments. I wouldn't rush to watch it though. The characters are sweet, but they're not memorable. Like, this isn't an anime I would dub \"iconic\" or \"monumental\". It's nice. That's it.",
            "date": "2017-12-10T21:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 264944,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6492265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/volleydorks",
                "username": "volleydorks"
            },
            "url": "https://myanimelist.net/reviews.php?id=264944"
        },
        {
            "content": "Most people think that Free! is just all about half-naked boys swimming and is filled with fan-service. They're not wrong, but they're not right either. This anime actually has a pretty good plot-line. The characters' emotions are captured really well in this anime. The art is great. I especially love how they drew/animated the eyes and movements of the bodies. \r\nThe voice acting is also a strong point in this animation. Character development is also good. As a girl who enjoys both boys and girls, I thoroughly enjoyed this. This may not be a thing for everyone, but for those who like some feels withshirtless boys, this is your type of show!...probably.\\n\r\nOverall, I would give this anime a 9, its very enjoyable and captures many things really well.\\n\r\n:)",
            "date": "2016-01-16T23:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 208716,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5000355.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/japanties-202",
                "username": "japanties-202"
            },
            "url": "https://myanimelist.net/reviews.php?id=208716"
        },
        {
            "content": "Admittedly, I watched this series because I was interested in seeing hot shirtless boys, but that's not the point here. Free! Eternal Summer was certainly a much bigger improvement than its predecessor for the following reasons.\r\nStory (7/10)\r\nI'd give this story a 7 because I feel that this season's pacing was a lot better than the first and more things were explained and elaborated, like Sousuke's shoulder. His pain and anguish can be seen quite constantly throughout the series and it wasn't thrown in or cast out so quickly just for plot convenience. \r\nArt (9/10)\r\nThe art is certainly one of the best things out of theshow. The character designs, especially, was able to encompass each of the characters' individual personalities and traits, making them easy to identify and remember.\\n\\n\r\nSound (8/10)\\n\r\nThe opening of this season may not have been as recognisable as the first season's, but it is still enjoyable to listen to. The ending is extremely catchy.\\n\\n\r\nCharacter (7/10)\\n\r\nI feel that there have been quite a character developments in this season. For example:\\n\\n\r\nRin: Most character development among all of them. From a whiny kid in season 1 who only cared about how he was affected, he became A LOT more mature and cared about issues worth caring about. \\n\\n\r\nHaru and Makoto: Their fight in this season serves as a reminder that all perfect friendships aren't always perfect and mishaps are bound to happen. But Haru taking time to think things through and actually apologising to Makoto shows how he is beginning to take more initiative to fix things. \\n\\n\r\nEnjoyment (8/10)\\n\r\nThere have been many hilarious and serious moments, but thankfully, there have been no inappropriate comedy jokes forced in during the times where it needs to be serious. This season has also been a lot more relatable in the aspect of having to make life-changing decisions and how intimidating that can be. So it is an improvement from the first season where all the boys cared about was what happened to Rin and the medley relay. \\n\\n\\n\r\nOverall, I'd give this series an 8. Despite how it can still be improved, it is a lot more enjoyable than the first season.",
            "date": "2017-06-14T02:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 249871,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6314283.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tachibanananase",
                "username": "tachibanananase"
            },
            "url": "https://myanimelist.net/reviews.php?id=249871"
        },
        {
            "content": "Before I get into the juicy stuff, let me just summarize the anime real quick w/o spoilers.. Free! Iwatobi Swim Club is about a group of four or so teenage boys, Haruka, Makoto, Nagisa, and Rei, who all possess pretty top notch swimming skills (with an exception for Rei), starting a swim club. Of Course there is a lot more to the premise of the story than that, but I unfortunately can’t say anymore without spoiling the fun of the series. However, this anime isn’t  just about swimming, it also focuses on the hardships of friendship and childhood drama/trauma...\r\n I really enjoyed this lightheartedanime, it had me giggling, smiling, and falling off the edge of my seat the WHOLE TIME! The animation is simply astonishing, the quality really brought the anime to life! Which is why I gave the art rating a 10/10.\\n\\n\r\nI’d give this anime a 7/10, simply because it was really good but didn’t possess the breathtaking qualities of an anime like Death Note or Zankyou No Terror, yet it was very enjoyable. I’m not gonna lie, the main reason I started this anime was because of the chiseled abs and the speedos. I wasn’t expecting to fall in love with the anime for reasons completely unrelated to the speedos. This anime can be a bit ridiculous and silly at times, which is what makes it so lovable. I definitely recommend this anime because it contains a simple premise, it’s really easy to watch, and you honestly don’t need to use your brain the whole time you’re watching it.",
            "date": "2016-12-30T20:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 237025,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863345.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/nyuupaii",
                "username": "nyuupaii"
            },
            "url": "https://myanimelist.net/reviews.php?id=237025"
        },
        {
            "content": "The second season of Free! improves upon the first in almost every way. Let’s go through the list, shall we?\r\nStory\r\nThe groundbreaking story of the second season of Free! is that Haru, Makoto, Nagisa, and Rei of Iwatobi as well as Rin of Samezuka are training so that they can enter swimming competitions, as well as dealing with life problems in between conflicts related to sports, and- …Oh. I suppose the story is not that different between seasons. Also, similarly to season one, swimming and other activities related to the clubs are only half of the story. The plot is driven by the personal struggles ofthe characters and their conflicts with each other. How does this aspect of the story compare to season one? See the Character section below.\\n\\n\r\nArt\\n\\n\r\nThis is probably the only area in which the anime didn’t improve. Of course, it’s a bit difficult to reach new heights when you are already at the top. In other words, the animation, especially in regards to the water, is just as beautiful as ever.\\n\\n\r\nSound\\n\\n\r\nThe soundtrack of the first season of Free! was pleasant, but not exceptional, and my opinion remains the same in the second season. The exception is in regards to the opening and ending themes, both of which were catchier in season two than in season one.\\n\\n\r\nCharacters\\n\\n\r\nThis is the area in which the anime improved the most. My favorite characters from season one became even more likeable, characters that I felt indifferent to became much more relatable, and boring minor characters were either made slightly more compelling or delegated to the background in favor of new and far more interesting main characters.\\n\\n\r\nHaru and Rin change from being punchlines in season one to genuine characters with relatable issues in season two. Since the end of season one, Haru and Rin have reclaimed their former relationship as friendly rivals, so there is far less of the overly dramatic angst that accompanied their falling out in season one. Haru primarily deals with his indecision upon what to do when he graduates. His reactions to the issue felt much more realistic than they were in season one, making him a much more likeable and relatable character. \\n\\n\r\nMeanwhile, Rin addresses the obvious issue that, even though he has reconciled with the members of the Iwatobi team and decided that he wants to swim for the sake of a team and not just himself, he still goes to a different school at which he has not formed strong enough bonds with his classmates to form this team. This is a legitimate issue that was interesting to see the result of. Rin transforms from a cruel antagonist in season one to a total sweetheart in season two. I will say that Rin does still occasionally overreact with a liberal amount of tears, but, in the very least, he seems to only react this way when he is concerned about a genuine issue that one of his friends is going through.\\n\\n\r\nMakoto, similarly to Haru, also struggles with the decision of what to do upon graduation. Not only does this issue lend itself to intriguing character development for Makoto, but it also leads to a particular focus upon the relationship between him and Haru, moreso than in the first season. Similarly to season one, this proved to be rather interesting whether one is a fan of yaoi or not.\\n\\n\r\nSome complained that Nagisa and Rei were put to the side in favor of the development of other characters. In the case of Nagisa, I strongly disagree. He may not have been onscreen quite as much as he was in the first season, but, unlike the first season, Nagisa actually recieves a backstory during the second season. As for Rei, he received so much focus in season one that I honestly couldn’t feel too bad about his treatment in season two, and it isn’t as though he’s completely ignored during this season. He still achieved development during this season, both in his physical swimming skills and his relationship with other characters, especially Nagisa and Rin.\\n\\n\r\nAlthough my feelings towards the two new characters introduced were a bit mixed, I at least have to give them credit for being more entertaining than the minor characters that appeared so frequently in season one. Althought Momo did not receive much character development, he was still a rather fun conveyor of comic relief. Meanwhile, Sousuke… oh, how do I put this? I wanted to like Sousuke. I get the impression that the creators wanted me to like Sousuke. However, for the life of me, I still have difficulty reconciling Sousuke in my mind, and it all boils down to a single scene towards the beginning of the season. Just one scene. After that, the creators go out of their way to endear the audience to Sousuke, giving him a tragic backstory that he continues to deal with the effects of, as well as showing adorable interactions between himself and Rin. However, I suppose what people say about first impressions being important must be correct, as this one morally ambiguous action on Sousuke’s part at the beginning of the season makes every following scene intended to endear the audience to Sousuke feel like manipulation on the part of the creators on behalf of a character who does not deserve it.\\n\\n\r\nGou, Coach Sasabe, and Miss Amakata continue to be boring during this season, but, in the very least, they appear far less frequently than they did in season one. Unfortunately, Nitori does receive a larger role in this season, and he is still rather annoying. All of his motivation is still based upon his rather pathetic desire to impress Rin, but at least he doesn’t seem to follow Rin quite as closely or help to aggravate him into a rage.\\n\\n\r\nEnjoyment\\n\\n\r\nI’m not sure what to talk about in this category…um…oh! Yes, there’s still plenty of fanservice. Was it better than it was in the first season? I would say so, but I’m pretty much basing my entire assessment upon the scene in which Makoto was taking a shower. I suppose that’s a matter of opinion.\\n\\n\r\nOverall, I enjoyed Free! Eternal Summer far more than the first season of Free! However, I enjoyed both of them very much. Even if you watched the first season of Free! and thought that it was just OK, I would still recommend watching the second season, because if you thought that the first season was at least OK, I can almost guarantee that you will find the second season to be awesome.\\n",
            "date": "2016-01-05T18:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 207840,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5099069.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AngelRosemary",
                "username": "AngelRosemary"
            },
            "url": "https://myanimelist.net/reviews.php?id=207840"
        },
        {
            "content": "This anime is just guaranteed to make me cry, huh? \r\nI am seriously so in love with the characters in Free! They are all so dynamic and loving and beautiful. Beyond Nagisa, Rei, Makoto, Haru, and Rin, I've found new characters to love in this second season. It was also a wonderful continuation of the first season's conclusion.\r\nAnother point I adore about this anime is the lessons it has to teach with it's story. It deals with the very rough issue of the future and what to do with it. I think this anime would be a particularly good watch for an audience in theirlate teens to early twenties (which happens to be my age group). Free! really spoke to me, especially in this season. \\n\\n\r\nI could go on and on about how touched I was by this anime, but I will leave that for you to experience on your own. I really do think this anime is something special. Here's to the future!",
            "date": "2018-07-06T00:35:00+00:00",
            "helpful_count": 0,
            "mal_id": 283101,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=283101"
        },
        {
            "content": "Oh well… I’m actually writing a review for this series, considering how hard I was dissing its first season a year or two ago….\r\nNow for those of you who are considering watching this without the first season (I doubt there is any of you), let me say that – you’re doing the right thing. Free first season wasn’t a disaster, but it was distasteful and irritating to watch. It tried so hard to showcase the nonexistent drama that was going absolutely nowhere. \r\nAs for this second season, I will say that if you know what you’re watching, then you will enjoy it. \r\n“Hmm… what?”\r\nThat mighthave been a very silly statement, so let me phrase it another way. \\n\\n\r\nIf you are here for a sport anime, you are doing it wrong. If you are here to be mind-blown about some teamplay/team-spirit or some convoluted dramas, you are also doing it wrong. If you are here for the “feel-trip” through some inspiring, wonderfully touching friendship stories, you are still doing it wrong.\\n\\n\r\nSo, what should you be here for? \\n\\n\r\nYou could be here and watch it, KNOWING that this is *mostly* intended for a female audience, that it DEFINITELY has that boylove/”yaoi” vibe. But above all, it is a light-hearted slice-of-life story focusing on a talented “swimmer” who does not see swimming as a sport. \\n\\n\r\n-Story- 6/10 “Fine”\\n\\n\r\nMay I remind you again not to be confused that this story is about swimming as a sport. In fact, if you’re here looking for the competition, you will be mind-blown with how many plot holes there are in this show (for example, Rei didn’t know how to swim a few months prior, and is now competing with competitive swimmers in the nationals). \\n\\n\r\nRather, Free! Eternal Summer has a simple, straightforward plot: it is about a bunch of high schoolers who enjoy swimming, just for the sake of it (well, not all of them). And so “swimming” here is more of a medium or a lens through which the characters, their stories, and personalities unfolds. \\n\\n\r\n-Art/Visual- (9/10) “Great”\\n\\n\r\nIf someone tells you there is anything wrong with Free! Eternal Summer animation, they are fooling themselves, full stop.\\n\\n\r\n-Sound- (7/10) “Good”\\n\\n\r\nNot bad, but nothing memorable. I will say that I was surprised that Kyoto Animation actually hire English speakers to speak the English lines. Good for them! \\n\\n\r\n-Characters- (6/10) “Fine”\\n\\n\r\nIn the first season, calling the characters “one-dimensional” would be an understatement. With Eternal Summer, the change isn’t exactly phenomenal, but this time around, their stories and personalities are somewhat more realistic and relatable. The dramas and how the characters overcome their struggles, however, can be over the top at times. \\n\\n\r\nNagisa and Rei has somewhat of their own identities, but a critical glance and you could tell they are there to fill the plot. They aren’t bad characters, but with 13 episodes, there isn’t enough screen time to showcase any particular highlights about these two. Makoto is …well, still unfortunately known more as “the mama of the group” and “Haru’s friend” than as Makoto Tachibana himself. Although I must say that I sincerely respect him as his tolerance of Haru (and everyone else) is seriously top-notch. \\n\\n\r\nSousuke – a new character introduced in this season – is probably the closest to a decent character if not for the fact that the whole revelation about him comes very late in the show. I also personally feel that Sousuke serves more as a plot device to complicate the drama and boost the character development of Rin and Haru. \\n\\n\r\nRin - surprisingly - is the one to save the whole cast this time around. He is much more well-written this season, as his logic seems the most reasonable and relatable.\\n\\n\r\nIf there is one character I’m most frustrated with, it most definitely is Haru the protagonist. It’s not about the fact that he’s uncertain of what he wants in life and not moving forward that frustrates me. And quite honestly, I find all his worries about the future, dream, being bound by expectation completely relatable. However, it is his attitude toward said matters and his friends that bothers me to the extreme. Until probably the very last few minutes, all Haru says to everyone around him on every matter is “I don’t care, I just swim.” I understand the intended portrait of his character, as well as how he just wants to swim “freely” (in all its literal and figurative sense). But here, the drama about Haru is way over the top: Haru struggles for 12 episodes about his \"inner world\" and makes little to zero effort of trying to be at least appreciative of what people around him do for him. But at the very last moment in the very last episode, he goes \"Yes, I have found it (my path)\" Wow, just wow. \\n\r\nSo either I'm too slow in understanding this thing or Kyoto Animation is doing a really, really bad job of writing and the execution of this protagonist. \\n\\n\r\nThe rest of the cast is... unsurprisingly forgettable. They are there so fangirls could write some more fanfics and draw some more fanarts I suppose, not that I mind it.\\n\\n\r\n-Overall- (7/10) “Good”\\n\\n\r\nThis show is a solid 6 (“fine”) for the first 10 episodes; the last few are much stronger and I think a 7 (“good”) would not be an exaggeration. I was also pleasantly surprised as I watched this series and enjoyed it more than I ever thought I would be. I must say though - if you absolutely dreaded the first season and are looking to have that perspective completely flipped around, you probably won’t be. But if you keep your mind open and watch the show for what it’s worth, I’m certain it won’t be a disappointment.\\n\\n\\n",
            "date": "2016-11-05T21:00:00+00:00",
            "helpful_count": 0,
            "mal_id": 233302,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3004197.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jan12",
                "username": "Jan12"
            },
            "url": "https://myanimelist.net/reviews.php?id=233302"
        },
        {
            "content": "Free! Eternal Summer restored my faith in sports anime. After a good yet extremely cringe-worthy first season, the second season comes with the thunder the show should have. Granted the corny moments are still there but nowhere near as much as the first season. I fought the story was a big improvement this time and gave detail in why the circumstances came to be. I liked the artwork once more and it's nothing different this time. The sound is still great, we get even more characters to love, and is more enjoyable this time around. Overall, if you already loved the cringe-inducing Free! Iwatobi SwimClub, you will definitely be in for a big treat with Free! Eternal Summer.\\n\\n\r\nP.S. The feels on the final episodes. Doesn't help that I watched the final episodes of Code Geass R2 and Free! on the same day. XC",
            "date": "2016-06-08T17:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 220311,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5461606.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FateGeass",
                "username": "FateGeass"
            },
            "url": "https://myanimelist.net/reviews.php?id=220311"
        },
        {
            "content": "It really is something special when you are emotionally invested in something. Foe me Eternal Summer made me do something I have not done in months and that is shed tears when watching an anime.\r\nFree eternal summer follows Haru, Nagisa, Rei, Makoto and Rin one year after the first season as they attempt to enter the national tournament, and also, dealing with the fact that it is the last year of high school for Haru. Makoto and Rin.\r\nI really enjoyed the story of free and the characters as well. One of the best episodes was episode 5 where Nagisa runs away from home and welearn how much swimming means to him, and that entire episode was phenomenal. I also, enjoyed the new members to the Samezuka team Souske and Momo. The scenes in which the characters are interacting with each other and just talking are the best scenes of the anime especially the interactions between Haru and Makoto and the interactions between Souske and Rin. Nagisa and Rei are also fantastic here as they were in the previous season.The comedy and drama in the show work really well together in this season as well complementing each other.\\n\\n\r\nRegarding the art Kyoto Animation again does a wonderful job as the swimming scenes were terrific and some scenes were an absolute thing of beauty. The opening song is good but not as good as the opening of the first season and the ending theme was serviceable at best.\\n\\n\r\nI also really enjoyed the ending of the show in that it felt like an actual ending and the last episode was one of the best finales I have ever seen in anime.\\n\\n\r\nAs some one who just finished high school five months ago I related to the struggle of not knowing what to do next and knowing what my dream really was like Haru so relating to that and watching him realizing what he wants to do helped me open my eyes a bit.\\n\\n\r\nTo conclude, I would like to state that Free is more than just fan service. It is a truly incredible show and this season is one of the best anime I have seen.",
            "date": "2017-11-15T11:00:00+00:00",
            "helpful_count": 0,
            "mal_id": 263275,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6666889.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/saeid_2k",
                "username": "saeid_2k"
            },
            "url": "https://myanimelist.net/reviews.php?id=263275"
        }
    ]
]