[
    [
        {
            "content": "My review will be different.  I might save you some time:\r\nThe first half of the show (up through episode 12) was simply wonderful, hovering between 8/10 and 9/10 for me.  I don't even mind what happened on episode 12 — I thought they were both right and both acted right.\r\nBut.\r\nBetween episode 13 and the end, it kept drawing out, and out... and out.  It became a true shoujo soap drama where one character picks on the tiniest little things and makes the relationship unnecessarily difficult, while the other character can't get away from the past.  It was slow and tiresome.I just didn't enjoy this second half very much, but it was still watchable, and you will probably be able to stick through it.  Unfortunately, the ending is nothing really worth waiting for anyway.\\n\\n\r\nThe main girl, Nanami, plays it so perfectly in the first half though.  The way she talks... if I hadn't seen the second half, she'd easily be one of my favorite characters.  Animation: low-budget mediocrity galore with mostly static frames, but they do try to be artistic with it (e.g. all the bubbly framing around key scenes, or how they occasionally blank out one eye for effect).  Pacing: slower than average.  Music: gently compliments every mood, insert songs never feel unwanted or out of place, and they cycle through a remarkable number of ending themes (9!).  \\n\\n\r\nAll in all, I definitely recommend at least starting Bokura ga Ita, and if the front half leaves enough of an impact, perhaps try a bit of the back half for yourself.  It's certainly not awful, but just nowhere near as alluring as the front's wonderfully carefree slice of life, and far more irritating.  And it may leave a bad aftertaste.\\n\\n\r\nP.S. — If you do watch the entire thing, be sure to check the manga for the last episode since they leave out a key line after the anime's final scene. (It's in the last few pages of Chapter 31. You'll know it when you see it, but feel free to ask me if you're uncertain.)  And if you're up for it, there are 39 more chapters to Bokura ga Ita after this.",
            "date": "2010-11-06T05:27:00+00:00",
            "helpful_count": 442,
            "mal_id": 31855,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61720.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FauxAzn",
                "username": "FauxAzn"
            },
            "url": "https://myanimelist.net/reviews.php?id=31855"
        },
        {
            "content": "Bokura ga Ita is an anime for romance and drama lovers. I, personally love the genre so I enjoyed BgI to its fullest (mind you, not as much as something like Kanon), however, BgI really leaves you with overwhelming emotions. \r\nThe story revolves around Takahashi Nanami and Motoharu Yano, two high schoolers who unexpectedly fall in love. As the series moves on, we get to see the ups and downs of their relationship that eventually climaxes when both of them must truly mature or move on - the choice being particularly difficult for Takahashi. Throughout the story, the viewer is introduced to various problems everycouple faces from past influences to jealousy -in the end it's quite a simple plot outline with very gripping dialog (for a drama, that is).\\n\\n\r\nAnimation is taken care of very well - there's a water color-esque feel  akin to Honey & Clove mixed with standard inked anime. The animation won't wow you but it's still nice to for the eyes. \\n\\n\r\nInsert songs create a perfect scene where emotion must strike a chord. Music can make or break a scene and although the songs are prevalent during climaxes, they always seem to get the job done.\\n\\n\r\nThere's about 4-5 main characters that truly effect the plot - a couple of them are boring and static however the three main ones are the ones you'll come to love or hate. BgI is the type of anime that makes you feel for the character and sympathize with them; although you may not be in Takahahi's shoes, she'll often narrate her thoughts and feelings to you.  \\n\\n\r\nOverall, I'd suggest this for romance/drama lovers -  I truly enjoyed every second of this anime and I'm searching for the manga right now. The plot, while simple provides a lot of entertainment for the viewer - whether you cry or laugh, Bokura ga Ita delivers what it's good at.",
            "date": "2007-01-10T17:48:00+00:00",
            "helpful_count": 247,
            "mal_id": 57,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hiromi",
                "username": "Hiromi"
            },
            "url": "https://myanimelist.net/reviews.php?id=57"
        },
        {
            "content": "Let me try my best to make this review short and to the point.\r\nFirst, Bokura ga Ita is drama. Drama, drama, drama. If you don't want to watch a couple go over countless drama scenarios over and over and over, then don't bother with this show. \r\nSecond, and this might be a slight spoiler, but if you like one of the male leads more than the other, this will make or break the series for you. The male lead that I liked a lot didn't win out in the end, so naturally, I'm a little bitter (okay, more than a little). \r\nThird, don't expect reallife situations or problems. I don't believe Nanami or Yano handled a lot of their situations like a normal couple would. I'm definitely no expert on relationships, but sometimes you know how things would have happen. It's TV folks, expect some \"Ooooookay\" scenes.\\n\\n\r\nAnd as for my last point. The series was good enough to watch, but not good enough to warrant a \"go see it now\" from me. As I said, I was dissatisfied with the Anime ending, so I will most likely pick up the manga to see where it leads. Judging by my desire to read the manga after watching of the Anime, I should think that says it did well enough to see. á",
            "date": "2007-03-20T14:41:00+00:00",
            "helpful_count": 142,
            "mal_id": 206,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xinil",
                "username": "Xinil"
            },
            "url": "https://myanimelist.net/reviews.php?id=206"
        },
        {
            "content": "Story: \r\nA girl falls in love with a popular guy through which the guy falls in love with her as well and then they started going out. Then things start to take a turn for the worse as the girl begins to question the guy's past which shakes their relationship. A story of love, heartaches, sercrets, dreams, etc. This is a show which couples can relate..or even those who still couldn't find love...you'll know the hardships of being in a relationship as well as the things that make it so wonderful. The series also has a bit of slapstick comedy to lighten up the mood.Quite a nice touch in my opinion.\\n\\n\\n\r\nArt: \\n\r\nWell, I couldn't say much about the art..it's simple. The characters don't look that cool or awesome as other animes, but they are characters which will be remembered. The bakcgrounds are simple, almost like they were just watercolored. \\n\r\nBut despite the simplicity of the art, it's realistic. The characters clothing is a big example. They change clothes every episode or even during an episode. and the designs for the clothes are nice too.\\n\\n\r\nSound: \\n\r\nSince this is a romance series, expect that there'll be a lot of drama and sad moments just as much as happy ones. The background music really goes well with the mood of each situation and just at the right time. I almost shed a tear at one point in the series coz of the situation and the music was just sad...I give the music team a thubs up! no two! XD\\n\\n\r\nCharacter: \\n\r\nThe reason why this anime is great. The plot alone isn't enough to make you interested in watching a series, the characters do. And here the characters make you hate them at some point, or feel sorry for them at other times. There is no real antagonist in this story coz all of the characters are acting out of their feelings, and when you're in love, sometimes it's hard to see if what you did or said is wrong until you see the result..and there's also character development especially in the two main characters (Yano and Nanami).\\n\\n\r\nOverall: \\n\r\nIf you love romance, or romance anime to be particular, this is a definite must watch!",
            "date": "2007-11-01T18:17:00+00:00",
            "helpful_count": 87,
            "mal_id": 1191,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/17052.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Two-Hands",
                "username": "Two-Hands"
            },
            "url": "https://myanimelist.net/reviews.php?id=1191"
        },
        {
            "content": "Quick Review:\r\nStory: 9 (Manages to suck me in to this story from the very beginning and somehow forces me to find out whats next)\r\nArt: 4 (its just damn awkward staring at characters for long periods of time without eyes.)\r\nSound: 5 (Not every scene when the on screen characters, gasp, gulp, groan, or preforming an act of moe, needs to buzzed in.)\r\nCharacter: 6 (The fantasy slowly and effortlessly turned into reality.)\r\nEnjoyment: 6 (No matter if you're a drama buff or feeling nostalgic of that love lost, this is indeed a drama roller coaster.)\r\nOverall: 30/50 = 6.0 (...What is happiness to YOU?)\r\nFull Review:\r\n___Story___\r\n    Thisreview is coming from a person who is not entirely into the Romantic Drama genre (prefer romantic comedies). So lets get to the brass tacks of this heart wrenching tale of an 'ordinary' girl and her boyfriend. Clearly the most important part of any deep seeded, plot twist driven, emotional roller coaster is the story. If you have watched any soap opera, telenovela, or romance anime/manga, you know how they normally go, Point A, plot twist, point b, repeat. This works perfectly fine in this show. And it even manages to suck me in to this story from the very beginning. \\n\r\n    They perfectly sugar coat a taste of things to come, when you realize that such an important thing happens very early in the anime. I laughed a lot and cried a lot and even got pissed alot, but the story story still kept me wanting to know, 'whats going to happen next?' Behold, the power of the 'next episode' previews and skillfully placed teasers throughout the ending credits. Never have I experienced such a perfect mix of ending credits, cliffhangers, and music mold into such a unique experience, that I realized that i had spent over 10 hours watching this show. \\n\\n\r\n___Art___\\n\r\n    Aside the standard 'shoujo style' of drawing, the art direction is actually very 'unique' to say the least. It's sort of hard to describe the awkwardness I kept feeling when ever I tried to determine the feelings of the characters on screen. The first thing that will stick out the most is that 90% of the time, you will see all the characters with either one eye or no eyes. Now I don't know if this is to avoid \"watching\" their emotions like we normally do and instead, watch their emotions through sounds via the voice acting and chance flags. Whatever the reason, its just damn awkward staring at characters for long periods of time without eyes. Sometimes its just downright scary. And a large amount of the time, its not even necessary. \\n\r\n    Sometimes I thought this was just a move to save time and money since you will also realize that they do A LOT of flashback inserts, especially during the later episodes. If you take a technical standpoint to that issue, from episodes 15 through 26, a full 8 minutes is wasted to the last episode recap, opening theme, and flashbacks to previous episodes. That is disappointing to say the least. But in their defense, each episode is riddled with so many plot and emotional twists that most viewers would easily forget why they are acting 'that way.' \\n\r\n    Another useful 'cost cutting' technique that they seem to over use would be the pan and scan shots. Which means they draw an 'elaborate' drawing, then they pan and/or zoom the camera up, down, left, right, in and/or out to get the most effect of the drawing. In small doses, this is perfectly fine like in very important (emotional) scenes. But they do take this technique to the Nth degree. Do we really need to see a pan-shot of Nanami's face with no eyes for a full 8 seconds? There are many artistic flaws like that. \\n\r\n    A little bit off topic but, this series does lend itself to very beautiful still shots worthy of any picture frame. Just google search the images for this show and you will understand what I am saying. Ironically, that is the reason why I started watching this show is because of all the artwork depicting this show.\\n\\n\r\n___Sound___\\n\r\n    As with any drama, there is a wide range of emotions being displayed through all the characters. Some of them play it out very well, some of them not so much. But any show that manages to get the audience to relate or feel the same way as the characters on screen, should be commended. They did a great job in creating such a wide range of emotions by not only voice acting, but the music and sound effects played a large part into pushing that emotional envelope. \\n\r\n    The various songs portrayed in this show all came in at perfect times and never felt like it was awkward or forced. The lyrics to all 9+ songs are sure to bring tears to any drama lovers eyes. As it did with me numerous times. There is nothing really wrong I can say about the music in this show. Its all very appropriate and at times, too appropriate. \\n\r\n    Again, with such a great execution of song usage, they manage to screw things up with using the same sound effects over way, way, WAY too much. As seasoned, anime fans would know, when a chance time (or flag) occurs, a 'pleasant' beep would go off. It sounds harmless at first, until you realize they are going to use the same sound effect 10-15 times in every episode. \\n\r\n    Not every scene when the on screen characters, gasp, gulp, groan, or preform an act of moe, needs to buzzed in. Granted, half of the time the characters don't have eyes (the most predominant  way to read their emotions), but at least let the audience realize these flags on their own instead of literally chiming in for us. \\n\\n\r\n___Characters____\\n\r\n   Love them, hate them, or both, they do pull off their lines with ease. They can pull of their personalities with perfection, but for some reason, I had no connection to the characters after watching for a while. I grew to love Nanami and the other cast of characters early on (remember sugar coating), but the plot twists weren't living up to my expectations later in the series that I just gave up cheering for them. The fantasy slowly and effortlessly turned into reality. That's when I started to become disappointed with it as it started feeling like high school all over again. Take that however you may (good or bad) I'm sure you're like me and just end up wanting to watch what happens next 'just because' \\n\\n\r\nIt's also a little hard for me to feel an attachment to the characters when they appear not to have any eyes for no apparent reason. I feel like this show would feel much more complete if they completed drawing their eyes, no matter how ugly they are. Kudos to the main cast though as they did manage to just keep it somewhat interesting from beginning to end. Hell, I even caught myself yelling at the screen from time to time at how irrational this drama can be. But hey, that's life right?\\n\\n\r\n___Enjoyment___\\n\r\nNo matter if you're a drama buff or feeling nostalgic of that love lost in your past, this is indeed an emotional roller coaster for the soul. Be prepared to cry tears of joy and sadness, and reflect on things that could have been that never were. You will most likely experience all of those things. But sadly the production value and direction they took this show is what ultimately gave me this score. I really wanted to give this show a 9 or even a 10, but the excessive nuances are just too much bear for this poor soul. Maybe they might do a re-release down the line. I'm sure that's just wishful thinking on my part. And on that note...\\n\\n\r\n...What is happiness to you?",
            "date": "2009-06-24T03:38:00+00:00",
            "helpful_count": 62,
            "mal_id": 16058,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=16058"
        },
        {
            "content": "\"I always begin to inspect the anime, even if I did not like\" this proposal is\r\nanime Bokura ga ita\r\nIn other words a waste of time on useless characters - children and their inclinations emovskih\r\n(All bad, he does not love me, etc.)\r\nStart honestly intrigued me, because I have always liked romance, do not know if the creators\r\nconfused her, instead of romantic melodrama, they have done \"a la Santa Barbara\", whether it is anime constructed\r\nonly for girls who love this genre and from that strange and appreciation of the anime ...\r\nStory: 1 (boy, girl meet, then parted, then again there are - for mneya is quiet\r\n horrorof snot and confusing emotions)\\n\r\nArt: 1 (The most terrible show-off that I've seen, although I do not care for showing off extreme, but constantly\\n\r\n closed bangs when they have problems and not middle of painting the characters of the second plan, it is my vyvorazhivaet)\\n\r\nSound: 1 (tedious music, all I can say)\\n\r\nCharacter: 1 (I do not understand the nature of these characters, I can kind of person who over trifles\\n\r\ndo not survive, and if there was love, you can find another, but probably not destiny)\\n\r\nEnjoyment: 1 (It was a feeling of \"When will it end, and when finally one of the protagonist'll bet\\n\r\ngirl and make her truly happy? ! !)\\n\r\nOverall: 1 No comment \\n",
            "date": "2010-05-09T11:44:00+00:00",
            "helpful_count": 33,
            "mal_id": 25896,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207528.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ZeDesu",
                "username": "ZeDesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=25896"
        },
        {
            "content": "Beginning off with the horrid graphics, Bokura Ga Ita makes for one of the worst animes I have ever seen. True, this might be because I have very high standards and judge from the quality of art and sound. Honestly, I only forced myself to watch a couple of episodes until I finally dropped it for good. Basically, it's a story about a girl who falls in love with this controlling guy who sees his dead girlfriend in the girl. The main guy's best friend also falls in love with the new girl, and it's all screwed up, but not in an interesting way.\r\nThe storyline,I will give 4/10. The idea is somewhat original and is pretty realistic, a characteristic that you don't find in many animes.\\n\\n\r\nAs for art, 1/10. Watch 5 minutes and you'll know what I mean.\\n\\n\r\nThe sound is decent, though it could have been a lot better.\\n\\n\r\nThe characters are pretty interesting, despite the poor quality of this show.\\n\\n\r\nAs for enjoyment of watching this, it might make you depressed. There is not much of a plot in this romance story, and the guy's controlling behavior makes you want to punch him half the time. Overall, I give this anime a 2/10.",
            "date": "2010-05-18T23:28:00+00:00",
            "helpful_count": 29,
            "mal_id": 26189,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/325146.jpg",
                "scores": {
                    "animation": 1,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KatelynKaraway",
                "username": "KatelynKaraway"
            },
            "url": "https://myanimelist.net/reviews.php?id=26189"
        },
        {
            "content": "Alrighty, for each anime I do the 3 episode testing before I judge it. For this anime it was especially hard just to watch one episode but I sat through two out of the supposed 3 I was planning to watch no matter how painful it was. By golly was it ever so painful. \r\nLet's start with the problem of the plot itself. Why is it that it's always a popular boy with a problem who is admired by some timid girl? Yes I understand that the popular boys are the ones with the traits us girls like but it's not like we strive todate a popular guy. I can almost guess that the friend of the popular Yano, Take will most likely fall in love with Nana at some point in the story. Maybe it was suppose to be that obvious within the first episode already but I seriously doubt they wanted the plot to be exposed before we've gotten a grasp of the characters.\\n\\n\r\nThe characters are just so cliché that I count even count how many animes have the exact personalities of Nana and Yano. Nana, the girl who just about fits in with the crowd, doesn't really stand out and is a total pushover when it comes to class related situations. The common \"Nana\" always depends on the \"Yano\" to come to her rescue like some prince charming. Corresponding to that, the \"Yano\" of the galaxy must always come save the damsel in distress \"Nana\" even though he finds it rather needy. But the \"Yano\" type of character must always help out the dependent \"Nana\" because he's just the type of guy every girl wants, helpful, charming and kind. \\n\\n\r\nThe art was another story. If I really wanted to see this kind of art, I’d re-watch Lovely Complex because the art is pretty much just a better version of the art in Bokura Ga Ita. The character designs are rather simple and bland for my liking and the colors aren't bold enough to be eye catching and comfortable. It's pretty much like looking at a canvas painted a beige so light it looks like nothing but white.\\n\\n\r\nAll in all if there was a sequel I’d say \"didn't like the first, don't plan on watching the second.\"\\n",
            "date": "2010-07-02T12:21:00+00:00",
            "helpful_count": 25,
            "mal_id": 27879,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/349536.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HelloImUnique",
                "username": "HelloImUnique"
            },
            "url": "https://myanimelist.net/reviews.php?id=27879"
        },
        {
            "content": "what others fail to write is that this show is a bit explicit, and pretty much intended for mature audiences. If that's not your thing, stay away...",
            "date": "2009-07-27T23:25:00+00:00",
            "helpful_count": 15,
            "mal_id": 17193,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/213710.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/iluvnatsume",
                "username": "iluvnatsume"
            },
            "url": "https://myanimelist.net/reviews.php?id=17193"
        },
        {
            "content": "I found this anime through Ao Haru Ride \"recommendations.\" It was the 4th one on the list and I had seen all the previous 3 anime recommendations above it (Kimi ni Todoke, Wolf Girl and Black Prince,  Say I love you), so I thought, \"Hey, why not? I'll give it a shot and watch it.\" I'm a sucker for romance/shoujo. So let me give you a break down of this anime. Maybe I will help you not waste your time on it.... *note: screw you those that recommended this anime on Ao Haru Ride*\r\n[no spoilers]\r\nStory: Scored 6 - Fair\r\nMaybe I should give this animemore credit for it's story? I'm not sure, but 6 was \"fair\". I didn't think it was the most amazing, yet it showed the struggles of a couple and the reality that everything isn't all peaches. I felt like it was a really messed up anime also. The story was down-right depressing.\\n\\n\r\nArt: Score 6 - Fair\\n\r\nI felt like it was very old-school styled and the whole time I kept thinking \"Where's their other eye? Oh great, they have no face this time lol. Could they have just added another eye for crying out loud?!\" It really bugged me and anyone that watched this anime can not say they didn't think that also lol. Also, the art style was very childish. Characters almost looked chibi like/lovely complex art style (anime I have not seen but seen art of). I was also put off by the art style and almost didn't begin the anime.\\n\\n\r\nSound: 5 - Mediocre\\n\r\nI felt like when the songs would pop up, that it was time for a sing a long. I felt like they could've opted out all the singing and put instrumental music or anything else.\\n\\n\r\nCharacter: 3 - Poor\\n\r\nTakahashi - I quickly became annoyed with her because she became so wishy-washy and couldn't speak her mind. Someone needed to slap her. Yano - Baka. Yamamoto - someone needed to punch this girl.\\n\\n\r\nEnjoyment: 2 - Dreadful\\n\r\nI was enjoying this anime in the beginning and then forced my way through to episode 23. At episode 23 I almost couldn't continue and had to google it. On wikipedia I got the summery and of the manga. After reading that, my thought's were \"this anime is really messed up\" (more than it already was). I continued the anime in pain, but I needed to finish it. Will I read the manga? I don't know. Maybe it will give me better feelings than where the anime left off. \\n\\n\r\nOverall: 4 - Decent\\n\r\nThis anime just made me sad. The whole relationship in the beginning seemed nice (if only the flow of the beginning of this anime had gone the same throughout the show or picked off where it disappointed the audience), but nothing is ever pretty. If this anime wanted to paint a picture of a messed up world then it did the job. Don't watch this if you don't want to get depressed. And I mean, there are a lot of good \"sad\" animes' out there that executed this type of genre beautifully like: Anohana, Honey and Clover, Clannad, Nana, Wolf Children, etc . But this one is just f*d up. But hey I will say this, I did enjoy some of the quotes and the things the characters did say to each other at times. \"Ever since I met you, I feel like... I’ve lived to meet you.\" - Yano\\n\\n",
            "date": "2014-12-02T22:13:00+00:00",
            "helpful_count": 15,
            "mal_id": 170859,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1706131.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kittystarburst",
                "username": "kittystarburst"
            },
            "url": "https://myanimelist.net/reviews.php?id=170859"
        },
        {
            "content": "Bokura Ga Ita is pretty much your regular high school romance show, the clich&Atilde;&copy;s are there, the characters don't vary much either,  A boy and a girl meet each other and fall in love, being young and inexperienced their relation has many flaws and they keep running into troubles affecting their daily life. Being an average show who doesn't  stand out from the others who really shine in this genre although it has enough to create a little corner for itself. There's plenty of happiness and sadness, way too balanced actually not favoring each despite the sad scenes show a bit more ofan effort in characterization, its quite dramatic but doesn't go as far as shocking the viewer, I personally prefer heavier emotions, scenes that make you cry a river over a tragic event and then rejoice when the storm has gone and everything ends better. It lacks the shocking developments that made other shows famous and so its somewhat mild and plain in comparison. \\n\\n\r\nThe characters are the usual clueless filled with uncertainty, fighting over small things and dwelling too deep, trying to attach meaning to things that are much simple, dragging the show into an overextended carrousel that could be done in much lesser episodes, theres the usual love triangles and lots of unrequited love but their just treated as secondary characters mostly. The drawings seem way too simple at the beggining but their more detailed on the crucial scenes and on the closeups, I'm not sure if its an artistic choice or just a way to produce faster but it looks decent enough and in this genre its not really the main concern anyway, it does a good job conveying the feelings of the characters and portraying them to the viewer and thats what matters here. One of my favorite details on the characters is definitely the cuteness in the girls, the clothes, the expressions and even the weird hairstyles of the lead female.\\n\\n\r\nThe plot evolves into countless break ups and getting back together, it prolly was meant like that but their always contradicting themselves and falling in the same mistakes not learning but also not giving up, it portrays how clueless a teenager can be and how the events in his life make him grow into a stronger adult, but its far from a reality scenario, I personally didn't like it, I don't mind fantasy but when your revolving around human emotions there should be some reality basis there and the show just seems to twist them as they want and in the end their feelings don't evolve much, definitely the weak point here, not so much the story but the development is flawed turning into a loop trying to better explain things and dragging out for too long.\\n\\n\r\nThe music is one of the good parts, calm and tender, well placed in the emotional moments soothing the mood. The voice actors sound just right on the characters in all the moments.\\n\\n\r\nOverall Its a decent show but mostly for fans of the style, it doesn't shine as a great anime, its not original and has some considerable flaws. The art is.. diferent but like-able and the sound is good so technically its good raising its ratings, but the development is way too slow and I feel it wasted allot of time going over and over where it could have been resumed without hurting the context, it also has plenty of repeated flashbacks wich might be acceptable for someone who watches the episodes spaced out but for someone who devours it quickly will make you feel like skipping some parts specially in the second half of the show.\\n\\n",
            "date": "2007-10-14T18:31:00+00:00",
            "helpful_count": 14,
            "mal_id": 1032,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3104.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/acceleratum",
                "username": "acceleratum"
            },
            "url": "https://myanimelist.net/reviews.php?id=1032"
        },
        {
            "content": "Characters in any good story make mistakes and learn from them. That is a fair statement, in my opinion; however in \"Bokura ga Ita\" I felt like I was watching the characters make the same mistakes countless times. In the beginning (let's say about 5-6 episodes) the story seemed fine, but as the story went on, the characters kept arguing and fighting over the same things: distrust, past relationships, lack of ability to convey feelings correctly. I kept going to the next episode in hopes that they would finally learn from their mistakes, yet it never happened.\r\n  After each fight, they would makeup and the same thing would happen again. Neither one seemed to try harder to make it work. They just wouldn't get it into their heads what they needed to do. Both Yano and Nanami were making me frustrated throughout the whole anime. Yano wouldn't let go of the past and Nanami had major trust issues. In order for their relationship to go farther, they needed to fix these flaws and it was quite obvious.\\n\\n\r\n  Anyway, you get the point that they had problems. It was majorly disappointing to see their pitiful relationship. I just could not enjoy the story and I did not have feelings for either of the characters. Rather than enjoying the anime, it was as if I was being socked in the face over and over with the painful drama cycle. It would have just been easier and a lot less miserable if they broke up and never got back together if they're just going to contiue fighting.  Nanami and Yano didn't seem to have true feelings for each other, because if they did, they would want each other's happiness. This was no romance anime, it was a war zone. \\n\\n\r\n  I would be lying if I said that I didn't like anything from it, though. It had nice music and the art wasn't too bad. There was some good comedy in there as well. But if I knew of all the craziness I was getting myself into before watching this, I wouldn't have touched it. It's probably a more realistic view of high school relationships, but I think I prefer ones that I would enjoy. If you like drawn-out drama and heartbreaking romances, then you may like it.",
            "date": "2014-06-17T15:48:00+00:00",
            "helpful_count": 13,
            "mal_id": 147373,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3665003.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ChibiStarChan",
                "username": "ChibiStarChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=147373"
        },
        {
            "content": "I really regret watching this anime. But for good reasons. If you get easily affected by a little drama (like me) this anime will haunt you for a long time after. The anime left me dumbstruck. And increadibly bitter becasue Yano and Nana just never seem to get what they want. I think this is one of the saddest anime's I've watched, and I actually cried once. Ahem, yes. \r\nThe story is pretty good (9), its very entrancing and you just need to know what happens next. Overall it was really depressing at times, but there was comedy used at the exactly right time soit kinda balanced it out.\\n\r\nThe art...was a little weird so I gave it 6. But you do get used to it.\\n\r\nThe sound -in the anime- made it all the more enjoyable. Props to the composer. Gave it a 9.\\n\r\nThe charcters were the best. I gave 'em a 10. They're all increadibly likable (except one purple haired person) and you can get really attached.\\n\r\nFor enjoyment I gave a 9 - because although this anime will stay with me for a long time, and is one of my favourites, it left me increadibly overwhelmed. I was honestly depressed for a whole day after I finished because ...well *sniff* its just that powerful. Although it probably is just me.\\n\\n\r\nBut really, I totally recommend eveyone who enjoys shojou to watch this. Because its brilliant.",
            "date": "2010-03-09T10:14:00+00:00",
            "helpful_count": 11,
            "mal_id": 23837,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/270045.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pillock",
                "username": "pillock"
            },
            "url": "https://myanimelist.net/reviews.php?id=23837"
        },
        {
            "content": "Bokura ga Ita is one of my favorite animes in the direction of romance.\r\nThe story was really good, very interesting and it was realistic. This story in Bokura ga Ita can really happen, so I found the anime really great. It was really well imagine how you would act itself.\r\nThe character was really great. There were what you did not like, but otherwise it was great. About some people have much to learn about some not, but it was good.\r\nEspecially the two main people liked it, the two are really sweet.\r\nThe drawing style is perhaps a bit of getting used to, but if you lookat it appeared then that is no problem, because you become accustomed to it, the story is really good and realistic. It's just not as a style as today's animes but good.\\n\\n\r\nThe music in the anime was also great, there were always beautiful music to the relevant scenes. I very much liked.\\n\\n\r\nWho likes romances and dramas can only recommend it, it is realistic and well done. A must for those of the romances and dramas like.",
            "date": "2008-10-28T09:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 9046,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24314.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Foxygirl05",
                "username": "Foxygirl05"
            },
            "url": "https://myanimelist.net/reviews.php?id=9046"
        },
        {
            "content": "\"...timing in love, is everything...\"\r\nWe Were There, what can I say. It made me happy, sad, angry, laugh(a bit) and at the end it made me feel...a little empty. I know it sounds bad but it isn't not really. Read on>\r\nShort Summary:\r\nNanami is starting her high school life. Her first day there isn't going as smoothly as she would want; she forgot a classmates name and was given the wrong name by a guy she met, she also happens to start liking the same boy who caused trouble for her. She knows it's a bad idea.  Can she win the heart of Yano andmake him forget his past love?\\n\\n\r\nNanami, the lead girl who just wants to make the boy she likes happy and make him look at her, see her, for who she is instead of always comparing or living in the past. She's proof that you can't control who you start liking. she is honest about her feeling from the start. You'll feel sorry for her and at the same time a bit angry that she takes so much crap. I mean, come on!\\n\\n\r\nTake who's only fault is that he fell inlove with his best friends girl friend. But, does he do anything about it? No, not really, not while they're together. He is there for her to talk to her when she feels lost and doesn't know what to do. He was probably one of my first friend-zoned characters in anime for me, and it's a shame really..not gonna say anything more on that.  \\n\\n\r\nYano is unbelievably sweet (sometimes) but he is so dense. He's the type of person that if he's good, he's so good, but if he's bad, he should get kicked in the balls for what an insensitive ass he is. You just want to scream at him, \"Move on Yano!\" Gonna be honest, he just made me angry, maybe I need to drink more tea or something.\\n\r\nSometimes you have to lose something to notice it's true value, but do you have to lose something multiple times? Come on!\\n\\n\r\nThe video quality wasn't bad, to put in in one word would be mellow. Like the soundtrack, and their voices were genuine to their character and not annoying. The art is different, and a little old fashioned but pleasant. It wasn't like regular bubbly anime that focuses on girls boobs or really huge eyes and I thought that was nice. Reminded me a little of \"Lovely Complex\"\\n\\n\r\nThe beginning it's better then the end. Maybe better isn't the right word. It's sweet. You expect it to end differently. I wasn't happy when I finished it but now that it's had time to settle, it ended just as it should have. Bittersweet.\\n\\n\r\nNow why did it left me feeling empty/a little depressed? Because they don't give themselves a break. They have the worst timing and even though they love each other it's just never ends happy. They expect for it to be 100% ok and life isn't 100% ok. You have to know some things are messed up and you have to move on! Me frustrated? Pfft\\n\\n\r\nWhy an 8 if I sound so unhappy with it, heck if I know, the anime is like a worm that crawls into your brain and cleans up so that it can be the one to mess things up. cooks for you and things. When it leaves it makes you a little sad that it did, just proving that it wasn't so bad. I just gave a worm analogy that I'm not even sure of. I need to reduce my caffeine...\\n\\n\r\nBut then again, when she said at the beginning the lline, \"..this is definitely going to be the worst mistake of my life...\" you can't really expect for it to be sunflowers and chocolates.Yum chocolates. \\n",
            "date": "2010-11-24T15:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 32281,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400973.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Moon_Light",
                "username": "Moon_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=32281"
        },
        {
            "content": "I guess i may be quite lenient in my grading of this anime,but i really think it deserves it.The anime is a high school romance focusing on the ups and downs of a relationship between the two main characters.\r\nThe story may be a bit cliche, but i think it was portrayed quite well. and if you are a romance-drama fan like myself then you would not mind. I think that the story is quite realistic and this is something i look at because then you can empathize with the character, even if you don't it grips you because you cannot really tell what will happenbecause reality is harsh and thats a fact. The complications that arise from the supporting characters makes the story interesting and the twists kee p you on the edge of your seat.\\n\\n\r\nThe Art was great i guess, im not so particular about the art but i think they were able to bring out the mood of the story quite well, and the scenic drawings are quite nice\\n\\n\r\nThe songs were great. They definitely suit this anime, being sentimental. The drama is brought out thanks to the songs and the insert songs are done up very nicely, you may even like some of the songs as you go along especially since there are like 8 different songs to end the episodes, and they are not in consecutive order,they are selectively used to suit the ending of the episode,which is quite rare in an anime so the sound was astounding.\\n\\n\r\nThe characters are of course important in the story with the supporting characters playing fairly big roles and are not left out at all like some other animes, they get a good deal of showtime. I myself found that i preferred one of the support chracters to the main chracter and it had me going like how sad it was for him...well i won't spoil it so go found out yourself...the main chracter Nanami is the narrator of the story and it is important as we get inside  the mind of the chracter and see things from her point of view mostly, but its interesting too.\\n\\n\r\nI thoroughly enjoyed the show being a drama-romance addict. The show also had its fair share of comic relief from time to time so its not serious everybit of the way. Its one of those shows where every episode leads to the next so your constantly watching non-stop(caution:once you start make you sure you have several hours ahead of you free).\\n\\n\r\nThe show really pull at your heartstrings. It is a very touching and meaningful story, you will definitely regret it if you don't watch it, its not everyday that you can find an anime like this. A second season will be out in june 2008 so i'm really looking foward to it, you will be too when you finish watching it. :)",
            "date": "2008-06-05T05:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 5247,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=5247"
        },
        {
            "content": "Okay so let me explain you a thing here. \r\nI'm very close to dropping this show. VERY close. And there's a lot of reason's. \r\nStory: 7\r\nAt first it seems like your typical high school romance, until they drop a bombshell on you. And I love that, it makes things interesting and entertaining. BUT. BUUUUUT. There are a few things that urked me. I can't spoil anything so I can't exactly tell you what but trust me if you're sane you will understand what I mean. Around episode 16 things just kinda get grueling and unless you're team Yano you're going to be so very angrywith Nanami your head may explode.\\n\\n\r\nArt: 4\\n\\n\r\nTo be blunt, it kinda sucks. The animation is choppy, majority of the time characters only have one eye or no eyes (Which is very lazy) and the ears.... oh god the ears. It's like Yaoi fingers but on a head. Typically I can get passed this and enjoy the show but there will be times when I just kinda sigh at the very lazy attempt at drawing. \\n\\n\r\nSound: 7\\n\\n\r\nYour atypical cheesy romance songs. Nothing too special, but it does fit the show. Might have been rated higher if they didn't overuse a very annoying \"lalalalalalalala\" track whenever I'm trying to enjoy a cute scene. \\n\\n\r\nCharacter: 10\\n\\n\r\nNow let me tell you a thing. Let me tell you a big thing. This show isn't just some silly romance. It is very much a journey into the mind of a young teenage boy who has to deal with a lot. Okay. This show may SEEM like it's about some silly little high school romance, but let me tell you a thing, NOTHING in this show is okay. Once you realize the main characters name is the same as another characters, things will click and you will realize just how bad things are. Again, don't want to spoil anything, but just know that these characters are VERY  real and VERY understandable. You WILL get attached to them and feel for them. \\n\\n\r\nEnjoyment: 6\\n\\n\r\nIt's be a spoiler to explain this. But I was enjoying the show until a certain point where things just get dumb and then I decided to read the comment section and I realized just how much I hate fangirls ignorant, blind, prepubescent hormonal raging lady boners for characters. I found myself getting more angry with the characters and their choices rather than actually being happy for them. I started to ship something other than the main ship which is always an issue with these types of shows because you begin to understand how horrible the main relationship ACTUALLY is. By episode 16 I stopped enjoying myself and rather I began hating the show and coonsidering just stop watching it all together because I knew EXACTLY what was going to happen and I didn't like it. \\n\\n\r\nOverall: 7\\n\\n\r\nTo anyone who thinks logically, I recommend watching this show until around episode 15. Anything after that will cause rage and have you take out that rage on a myanimelist review. I wanted to love this show but it was really hard in the later episodes. My hated for Yano just pilled up until I couldn't take it anymore and when I went to go discuss and confirm my rage it only made me angrier. \\n\\n\r\nIf you're just looking for a mind numbing romance and you're not looking into plot, then I invite you to dive right in.",
            "date": "2015-04-26T17:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 186543,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1421751.jpg",
                "scores": {
                    "animation": 2,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DellaDellsies",
                "username": "DellaDellsies"
            },
            "url": "https://myanimelist.net/reviews.php?id=186543"
        },
        {
            "content": "Okay, this might be more of a rant than a review since my feelings are fresh and raw. \r\nLet’s begin with the horrid artwork/animation. The characters had one eye missing throughout the show. I tried overlooking it but it was extremely distracting. I don’t know whether that was an artistic signature or pure laziness. Artwork team, maybe get your shit together?  \r\nBut what made the entire anime more hard to watch was *drum roll*: the characters. One of the most important elements of the show was the biggest downfall here. The main protagonists were plain dumb and annoying. I tried overlooking the fact thatthey were still fresh in high school (although age doesn’t have much to do with it) but man they were constantly getting on my nerves. One small problem was being dragged for so many episodes simply because of a miscommunication and lack of trust? Also, why does every rom-com/shōjou anime glorify the main male lead to be your alpha dominant, arrogant and aggressive type? Being physically/verbally abusive isn’t something you should be displaying in shōjou anime, where the main audience will be young girls, who will grow up thinking it’s okay having someone slapping/pushing/dragging you by your hands? It's not something unique in this show but it's a common trend amongst the genre itself, sadly. It’s unhealthy and it needs to be stopped. And it definitely doesn’t need any more glorification by having the female lead fall for that nonsense, for heaven’s sake. \\n\r\nBasically, most of the episode consists of: misunderstanding, lots of crying from the main female lead and unnecessary drama. The entire series was stretched out thin, there was no substance to the show, and nothing could make up for the terrible artwork & even more terrible plot/character development (because there wasn’t ANY to begin with).\\n\r\nAlso, I watched this on a whim because someone recommended/suggested this alongside Nana? Like, I saw NOTHING in resemblance, not even close. As a huge Nana fan, I’m offended that they were even compared to begin with. \\n\\n\r\nPS - Excuse the typos & grammatical errors in advance!",
            "date": "2016-03-22T16:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 213646,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4125167.jpg",
                "scores": {
                    "animation": 1,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/marmaladethot",
                "username": "marmaladethot"
            },
            "url": "https://myanimelist.net/reviews.php?id=213646"
        },
        {
            "content": "Please read this review if you are a fan of good, well thought out storylines and character.\r\nThis anime is the only show I've ever ranked a 1- even lower than umaru. The plot starts off as your general girl likes guy story, but the character development of the main girl is next to nothing in the first half of the season, and we are given no insight into what is so great about the main guy too. \r\nAs characters go, she is naiive, gullible, and dependant on others throughout. \r\nHe is hypocritical, arrogant, and has vague stalker tendencies along with a possessiveness which would wantto make you vomit. After watching the first half, I simply could not take any more of the crap that is this show and read the summary to see how the story would end up (it does not get any better)\\n\\n\r\nSPOILER BIT\\n\r\nThe hypocrisy I was referring to earlier is him telling her never to betray him, then him going on to sleep with his ex-girlfriend's (who is dead) little sister. The main girl then forgives him for this with no repercussions. This is why I found both characters retarded \\n\r\nSPOILER OVER\\n\\n\r\nOverall, the art was terrible (it seemed they couldn't decide how to animate the main guy's face most of the time), the music was nothing special and it didn't add to the show for me, and the characters themselves were the most idiotic ones ever to have been created.\\n\r\nPlease don't watch this show- there are way better things to enjoy your time with, and the SoL/romance genre is better than this.\\n",
            "date": "2018-03-11T06:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 273558,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Husbug",
                "username": "Husbug"
            },
            "url": "https://myanimelist.net/reviews.php?id=273558"
        },
        {
            "content": "This anime somehow expresses romance/drama in a cute and subtle way. Bokura Ga Ita portrays the common obstacles in relationships and the process of overcoming them. It takes place in high school, where a girl named Takahashi Nanami and Yano Motoharu unexpectedy fall in love. The two lovers are often on the verge of breaking and learn to understand each other .\r\nStory (8): The beginning of BgI has a good pace and draws you into the story. It's pretty straight to the point and focuses on important events. The middle to around the end drags a bit and might frustrate you, but it didn't keepme from continuing. Around the end, it picks up pace again (which I really appreciated). You might not like the ending, but I thought the emotions it expressed were worthy of watching (yeah I cried).\\n\\n\r\nArt (7): The art isn't amazing, and it distracted me a bit in the beginning, but throughout the anime I got used to it. It has a slight pastel/water-color feeling to it, which I thought was cute. \\n\\n\r\nSound (10): I personally felt that the sound was what kept me watching. The girl's voice was cute and soft, and had a relaxing aura. The music was cute and soft as well, and I thought that it helped establish the mood very well. It was soothing and drew me into the story. The music also left a big impression on me after I finished the series and I kept remembering it when I wasn't watching it.\\n\\n\r\nCharacter (9): In the beginning, I really loved the girl's personality. The way she thinks, the way she talks; it's very realistic. Toward the climax she was a bit frustrating, but that didn't stop me from watching. The main guy's personality might come off as weird, but I thought that it was understandable, judging from what he's been through. Overall, the characters are realistic and the way they develop is understandable.\\n\\n\r\nEnjoyment (8): Overall, I enjoyed BgI. Some parts dragged a bit, making it difficult to focus, but it wasn't unbearable. The ending left me hanging, but it was satisfying enough.\\n\\n\r\nOverall (8): I loved the soothing feeling in BgI and it kept me watching. As I keep repeating, some parts dragged, but it didn't stop me from continuing. It's very worthy of watching.\\n",
            "date": "2013-12-01T13:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 122243,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3374411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Raicheul",
                "username": "Raicheul"
            },
            "url": "https://myanimelist.net/reviews.php?id=122243"
        }
    ],
    [
        {
            "content": "My review will be different.  I might save you some time:\r\nThe first half of the show (up through episode 12) was simply wonderful, hovering between 8/10 and 9/10 for me.  I don't even mind what happened on episode 12 — I thought they were both right and both acted right.\r\nBut.\r\nBetween episode 13 and the end, it kept drawing out, and out... and out.  It became a true shoujo soap drama where one character picks on the tiniest little things and makes the relationship unnecessarily difficult, while the other character can't get away from the past.  It was slow and tiresome.I just didn't enjoy this second half very much, but it was still watchable, and you will probably be able to stick through it.  Unfortunately, the ending is nothing really worth waiting for anyway.\\n\\n\r\nThe main girl, Nanami, plays it so perfectly in the first half though.  The way she talks... if I hadn't seen the second half, she'd easily be one of my favorite characters.  Animation: low-budget mediocrity galore with mostly static frames, but they do try to be artistic with it (e.g. all the bubbly framing around key scenes, or how they occasionally blank out one eye for effect).  Pacing: slower than average.  Music: gently compliments every mood, insert songs never feel unwanted or out of place, and they cycle through a remarkable number of ending themes (9!).  \\n\\n\r\nAll in all, I definitely recommend at least starting Bokura ga Ita, and if the front half leaves enough of an impact, perhaps try a bit of the back half for yourself.  It's certainly not awful, but just nowhere near as alluring as the front's wonderfully carefree slice of life, and far more irritating.  And it may leave a bad aftertaste.\\n\\n\r\nP.S. — If you do watch the entire thing, be sure to check the manga for the last episode since they leave out a key line after the anime's final scene. (It's in the last few pages of Chapter 31. You'll know it when you see it, but feel free to ask me if you're uncertain.)  And if you're up for it, there are 39 more chapters to Bokura ga Ita after this.",
            "date": "2010-11-06T05:27:00+00:00",
            "helpful_count": 442,
            "mal_id": 31855,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61720.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FauxAzn",
                "username": "FauxAzn"
            },
            "url": "https://myanimelist.net/reviews.php?id=31855"
        },
        {
            "content": "Bokura ga Ita is an anime for romance and drama lovers. I, personally love the genre so I enjoyed BgI to its fullest (mind you, not as much as something like Kanon), however, BgI really leaves you with overwhelming emotions. \r\nThe story revolves around Takahashi Nanami and Motoharu Yano, two high schoolers who unexpectedly fall in love. As the series moves on, we get to see the ups and downs of their relationship that eventually climaxes when both of them must truly mature or move on - the choice being particularly difficult for Takahashi. Throughout the story, the viewer is introduced to various problems everycouple faces from past influences to jealousy -in the end it's quite a simple plot outline with very gripping dialog (for a drama, that is).\\n\\n\r\nAnimation is taken care of very well - there's a water color-esque feel  akin to Honey & Clove mixed with standard inked anime. The animation won't wow you but it's still nice to for the eyes. \\n\\n\r\nInsert songs create a perfect scene where emotion must strike a chord. Music can make or break a scene and although the songs are prevalent during climaxes, they always seem to get the job done.\\n\\n\r\nThere's about 4-5 main characters that truly effect the plot - a couple of them are boring and static however the three main ones are the ones you'll come to love or hate. BgI is the type of anime that makes you feel for the character and sympathize with them; although you may not be in Takahahi's shoes, she'll often narrate her thoughts and feelings to you.  \\n\\n\r\nOverall, I'd suggest this for romance/drama lovers -  I truly enjoyed every second of this anime and I'm searching for the manga right now. The plot, while simple provides a lot of entertainment for the viewer - whether you cry or laugh, Bokura ga Ita delivers what it's good at.",
            "date": "2007-01-10T17:48:00+00:00",
            "helpful_count": 247,
            "mal_id": 57,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hiromi",
                "username": "Hiromi"
            },
            "url": "https://myanimelist.net/reviews.php?id=57"
        },
        {
            "content": "Let me try my best to make this review short and to the point.\r\nFirst, Bokura ga Ita is drama. Drama, drama, drama. If you don't want to watch a couple go over countless drama scenarios over and over and over, then don't bother with this show. \r\nSecond, and this might be a slight spoiler, but if you like one of the male leads more than the other, this will make or break the series for you. The male lead that I liked a lot didn't win out in the end, so naturally, I'm a little bitter (okay, more than a little). \r\nThird, don't expect reallife situations or problems. I don't believe Nanami or Yano handled a lot of their situations like a normal couple would. I'm definitely no expert on relationships, but sometimes you know how things would have happen. It's TV folks, expect some \"Ooooookay\" scenes.\\n\\n\r\nAnd as for my last point. The series was good enough to watch, but not good enough to warrant a \"go see it now\" from me. As I said, I was dissatisfied with the Anime ending, so I will most likely pick up the manga to see where it leads. Judging by my desire to read the manga after watching of the Anime, I should think that says it did well enough to see. á",
            "date": "2007-03-20T14:41:00+00:00",
            "helpful_count": 142,
            "mal_id": 206,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xinil",
                "username": "Xinil"
            },
            "url": "https://myanimelist.net/reviews.php?id=206"
        },
        {
            "content": "Story: \r\nA girl falls in love with a popular guy through which the guy falls in love with her as well and then they started going out. Then things start to take a turn for the worse as the girl begins to question the guy's past which shakes their relationship. A story of love, heartaches, sercrets, dreams, etc. This is a show which couples can relate..or even those who still couldn't find love...you'll know the hardships of being in a relationship as well as the things that make it so wonderful. The series also has a bit of slapstick comedy to lighten up the mood.Quite a nice touch in my opinion.\\n\\n\\n\r\nArt: \\n\r\nWell, I couldn't say much about the art..it's simple. The characters don't look that cool or awesome as other animes, but they are characters which will be remembered. The bakcgrounds are simple, almost like they were just watercolored. \\n\r\nBut despite the simplicity of the art, it's realistic. The characters clothing is a big example. They change clothes every episode or even during an episode. and the designs for the clothes are nice too.\\n\\n\r\nSound: \\n\r\nSince this is a romance series, expect that there'll be a lot of drama and sad moments just as much as happy ones. The background music really goes well with the mood of each situation and just at the right time. I almost shed a tear at one point in the series coz of the situation and the music was just sad...I give the music team a thubs up! no two! XD\\n\\n\r\nCharacter: \\n\r\nThe reason why this anime is great. The plot alone isn't enough to make you interested in watching a series, the characters do. And here the characters make you hate them at some point, or feel sorry for them at other times. There is no real antagonist in this story coz all of the characters are acting out of their feelings, and when you're in love, sometimes it's hard to see if what you did or said is wrong until you see the result..and there's also character development especially in the two main characters (Yano and Nanami).\\n\\n\r\nOverall: \\n\r\nIf you love romance, or romance anime to be particular, this is a definite must watch!",
            "date": "2007-11-01T18:17:00+00:00",
            "helpful_count": 87,
            "mal_id": 1191,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/17052.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Two-Hands",
                "username": "Two-Hands"
            },
            "url": "https://myanimelist.net/reviews.php?id=1191"
        },
        {
            "content": "Quick Review:\r\nStory: 9 (Manages to suck me in to this story from the very beginning and somehow forces me to find out whats next)\r\nArt: 4 (its just damn awkward staring at characters for long periods of time without eyes.)\r\nSound: 5 (Not every scene when the on screen characters, gasp, gulp, groan, or preforming an act of moe, needs to buzzed in.)\r\nCharacter: 6 (The fantasy slowly and effortlessly turned into reality.)\r\nEnjoyment: 6 (No matter if you're a drama buff or feeling nostalgic of that love lost, this is indeed a drama roller coaster.)\r\nOverall: 30/50 = 6.0 (...What is happiness to YOU?)\r\nFull Review:\r\n___Story___\r\n    Thisreview is coming from a person who is not entirely into the Romantic Drama genre (prefer romantic comedies). So lets get to the brass tacks of this heart wrenching tale of an 'ordinary' girl and her boyfriend. Clearly the most important part of any deep seeded, plot twist driven, emotional roller coaster is the story. If you have watched any soap opera, telenovela, or romance anime/manga, you know how they normally go, Point A, plot twist, point b, repeat. This works perfectly fine in this show. And it even manages to suck me in to this story from the very beginning. \\n\r\n    They perfectly sugar coat a taste of things to come, when you realize that such an important thing happens very early in the anime. I laughed a lot and cried a lot and even got pissed alot, but the story story still kept me wanting to know, 'whats going to happen next?' Behold, the power of the 'next episode' previews and skillfully placed teasers throughout the ending credits. Never have I experienced such a perfect mix of ending credits, cliffhangers, and music mold into such a unique experience, that I realized that i had spent over 10 hours watching this show. \\n\\n\r\n___Art___\\n\r\n    Aside the standard 'shoujo style' of drawing, the art direction is actually very 'unique' to say the least. It's sort of hard to describe the awkwardness I kept feeling when ever I tried to determine the feelings of the characters on screen. The first thing that will stick out the most is that 90% of the time, you will see all the characters with either one eye or no eyes. Now I don't know if this is to avoid \"watching\" their emotions like we normally do and instead, watch their emotions through sounds via the voice acting and chance flags. Whatever the reason, its just damn awkward staring at characters for long periods of time without eyes. Sometimes its just downright scary. And a large amount of the time, its not even necessary. \\n\r\n    Sometimes I thought this was just a move to save time and money since you will also realize that they do A LOT of flashback inserts, especially during the later episodes. If you take a technical standpoint to that issue, from episodes 15 through 26, a full 8 minutes is wasted to the last episode recap, opening theme, and flashbacks to previous episodes. That is disappointing to say the least. But in their defense, each episode is riddled with so many plot and emotional twists that most viewers would easily forget why they are acting 'that way.' \\n\r\n    Another useful 'cost cutting' technique that they seem to over use would be the pan and scan shots. Which means they draw an 'elaborate' drawing, then they pan and/or zoom the camera up, down, left, right, in and/or out to get the most effect of the drawing. In small doses, this is perfectly fine like in very important (emotional) scenes. But they do take this technique to the Nth degree. Do we really need to see a pan-shot of Nanami's face with no eyes for a full 8 seconds? There are many artistic flaws like that. \\n\r\n    A little bit off topic but, this series does lend itself to very beautiful still shots worthy of any picture frame. Just google search the images for this show and you will understand what I am saying. Ironically, that is the reason why I started watching this show is because of all the artwork depicting this show.\\n\\n\r\n___Sound___\\n\r\n    As with any drama, there is a wide range of emotions being displayed through all the characters. Some of them play it out very well, some of them not so much. But any show that manages to get the audience to relate or feel the same way as the characters on screen, should be commended. They did a great job in creating such a wide range of emotions by not only voice acting, but the music and sound effects played a large part into pushing that emotional envelope. \\n\r\n    The various songs portrayed in this show all came in at perfect times and never felt like it was awkward or forced. The lyrics to all 9+ songs are sure to bring tears to any drama lovers eyes. As it did with me numerous times. There is nothing really wrong I can say about the music in this show. Its all very appropriate and at times, too appropriate. \\n\r\n    Again, with such a great execution of song usage, they manage to screw things up with using the same sound effects over way, way, WAY too much. As seasoned, anime fans would know, when a chance time (or flag) occurs, a 'pleasant' beep would go off. It sounds harmless at first, until you realize they are going to use the same sound effect 10-15 times in every episode. \\n\r\n    Not every scene when the on screen characters, gasp, gulp, groan, or preform an act of moe, needs to buzzed in. Granted, half of the time the characters don't have eyes (the most predominant  way to read their emotions), but at least let the audience realize these flags on their own instead of literally chiming in for us. \\n\\n\r\n___Characters____\\n\r\n   Love them, hate them, or both, they do pull off their lines with ease. They can pull of their personalities with perfection, but for some reason, I had no connection to the characters after watching for a while. I grew to love Nanami and the other cast of characters early on (remember sugar coating), but the plot twists weren't living up to my expectations later in the series that I just gave up cheering for them. The fantasy slowly and effortlessly turned into reality. That's when I started to become disappointed with it as it started feeling like high school all over again. Take that however you may (good or bad) I'm sure you're like me and just end up wanting to watch what happens next 'just because' \\n\\n\r\nIt's also a little hard for me to feel an attachment to the characters when they appear not to have any eyes for no apparent reason. I feel like this show would feel much more complete if they completed drawing their eyes, no matter how ugly they are. Kudos to the main cast though as they did manage to just keep it somewhat interesting from beginning to end. Hell, I even caught myself yelling at the screen from time to time at how irrational this drama can be. But hey, that's life right?\\n\\n\r\n___Enjoyment___\\n\r\nNo matter if you're a drama buff or feeling nostalgic of that love lost in your past, this is indeed an emotional roller coaster for the soul. Be prepared to cry tears of joy and sadness, and reflect on things that could have been that never were. You will most likely experience all of those things. But sadly the production value and direction they took this show is what ultimately gave me this score. I really wanted to give this show a 9 or even a 10, but the excessive nuances are just too much bear for this poor soul. Maybe they might do a re-release down the line. I'm sure that's just wishful thinking on my part. And on that note...\\n\\n\r\n...What is happiness to you?",
            "date": "2009-06-24T03:38:00+00:00",
            "helpful_count": 62,
            "mal_id": 16058,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=16058"
        },
        {
            "content": "\"I always begin to inspect the anime, even if I did not like\" this proposal is\r\nanime Bokura ga ita\r\nIn other words a waste of time on useless characters - children and their inclinations emovskih\r\n(All bad, he does not love me, etc.)\r\nStart honestly intrigued me, because I have always liked romance, do not know if the creators\r\nconfused her, instead of romantic melodrama, they have done \"a la Santa Barbara\", whether it is anime constructed\r\nonly for girls who love this genre and from that strange and appreciation of the anime ...\r\nStory: 1 (boy, girl meet, then parted, then again there are - for mneya is quiet\r\n horrorof snot and confusing emotions)\\n\r\nArt: 1 (The most terrible show-off that I've seen, although I do not care for showing off extreme, but constantly\\n\r\n closed bangs when they have problems and not middle of painting the characters of the second plan, it is my vyvorazhivaet)\\n\r\nSound: 1 (tedious music, all I can say)\\n\r\nCharacter: 1 (I do not understand the nature of these characters, I can kind of person who over trifles\\n\r\ndo not survive, and if there was love, you can find another, but probably not destiny)\\n\r\nEnjoyment: 1 (It was a feeling of \"When will it end, and when finally one of the protagonist'll bet\\n\r\ngirl and make her truly happy? ! !)\\n\r\nOverall: 1 No comment \\n",
            "date": "2010-05-09T11:44:00+00:00",
            "helpful_count": 33,
            "mal_id": 25896,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207528.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ZeDesu",
                "username": "ZeDesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=25896"
        },
        {
            "content": "Beginning off with the horrid graphics, Bokura Ga Ita makes for one of the worst animes I have ever seen. True, this might be because I have very high standards and judge from the quality of art and sound. Honestly, I only forced myself to watch a couple of episodes until I finally dropped it for good. Basically, it's a story about a girl who falls in love with this controlling guy who sees his dead girlfriend in the girl. The main guy's best friend also falls in love with the new girl, and it's all screwed up, but not in an interesting way.\r\nThe storyline,I will give 4/10. The idea is somewhat original and is pretty realistic, a characteristic that you don't find in many animes.\\n\\n\r\nAs for art, 1/10. Watch 5 minutes and you'll know what I mean.\\n\\n\r\nThe sound is decent, though it could have been a lot better.\\n\\n\r\nThe characters are pretty interesting, despite the poor quality of this show.\\n\\n\r\nAs for enjoyment of watching this, it might make you depressed. There is not much of a plot in this romance story, and the guy's controlling behavior makes you want to punch him half the time. Overall, I give this anime a 2/10.",
            "date": "2010-05-18T23:28:00+00:00",
            "helpful_count": 29,
            "mal_id": 26189,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/325146.jpg",
                "scores": {
                    "animation": 1,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KatelynKaraway",
                "username": "KatelynKaraway"
            },
            "url": "https://myanimelist.net/reviews.php?id=26189"
        },
        {
            "content": "Alrighty, for each anime I do the 3 episode testing before I judge it. For this anime it was especially hard just to watch one episode but I sat through two out of the supposed 3 I was planning to watch no matter how painful it was. By golly was it ever so painful. \r\nLet's start with the problem of the plot itself. Why is it that it's always a popular boy with a problem who is admired by some timid girl? Yes I understand that the popular boys are the ones with the traits us girls like but it's not like we strive todate a popular guy. I can almost guess that the friend of the popular Yano, Take will most likely fall in love with Nana at some point in the story. Maybe it was suppose to be that obvious within the first episode already but I seriously doubt they wanted the plot to be exposed before we've gotten a grasp of the characters.\\n\\n\r\nThe characters are just so cliché that I count even count how many animes have the exact personalities of Nana and Yano. Nana, the girl who just about fits in with the crowd, doesn't really stand out and is a total pushover when it comes to class related situations. The common \"Nana\" always depends on the \"Yano\" to come to her rescue like some prince charming. Corresponding to that, the \"Yano\" of the galaxy must always come save the damsel in distress \"Nana\" even though he finds it rather needy. But the \"Yano\" type of character must always help out the dependent \"Nana\" because he's just the type of guy every girl wants, helpful, charming and kind. \\n\\n\r\nThe art was another story. If I really wanted to see this kind of art, I’d re-watch Lovely Complex because the art is pretty much just a better version of the art in Bokura Ga Ita. The character designs are rather simple and bland for my liking and the colors aren't bold enough to be eye catching and comfortable. It's pretty much like looking at a canvas painted a beige so light it looks like nothing but white.\\n\\n\r\nAll in all if there was a sequel I’d say \"didn't like the first, don't plan on watching the second.\"\\n",
            "date": "2010-07-02T12:21:00+00:00",
            "helpful_count": 25,
            "mal_id": 27879,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/349536.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HelloImUnique",
                "username": "HelloImUnique"
            },
            "url": "https://myanimelist.net/reviews.php?id=27879"
        },
        {
            "content": "what others fail to write is that this show is a bit explicit, and pretty much intended for mature audiences. If that's not your thing, stay away...",
            "date": "2009-07-27T23:25:00+00:00",
            "helpful_count": 15,
            "mal_id": 17193,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/213710.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/iluvnatsume",
                "username": "iluvnatsume"
            },
            "url": "https://myanimelist.net/reviews.php?id=17193"
        },
        {
            "content": "I found this anime through Ao Haru Ride \"recommendations.\" It was the 4th one on the list and I had seen all the previous 3 anime recommendations above it (Kimi ni Todoke, Wolf Girl and Black Prince,  Say I love you), so I thought, \"Hey, why not? I'll give it a shot and watch it.\" I'm a sucker for romance/shoujo. So let me give you a break down of this anime. Maybe I will help you not waste your time on it.... *note: screw you those that recommended this anime on Ao Haru Ride*\r\n[no spoilers]\r\nStory: Scored 6 - Fair\r\nMaybe I should give this animemore credit for it's story? I'm not sure, but 6 was \"fair\". I didn't think it was the most amazing, yet it showed the struggles of a couple and the reality that everything isn't all peaches. I felt like it was a really messed up anime also. The story was down-right depressing.\\n\\n\r\nArt: Score 6 - Fair\\n\r\nI felt like it was very old-school styled and the whole time I kept thinking \"Where's their other eye? Oh great, they have no face this time lol. Could they have just added another eye for crying out loud?!\" It really bugged me and anyone that watched this anime can not say they didn't think that also lol. Also, the art style was very childish. Characters almost looked chibi like/lovely complex art style (anime I have not seen but seen art of). I was also put off by the art style and almost didn't begin the anime.\\n\\n\r\nSound: 5 - Mediocre\\n\r\nI felt like when the songs would pop up, that it was time for a sing a long. I felt like they could've opted out all the singing and put instrumental music or anything else.\\n\\n\r\nCharacter: 3 - Poor\\n\r\nTakahashi - I quickly became annoyed with her because she became so wishy-washy and couldn't speak her mind. Someone needed to slap her. Yano - Baka. Yamamoto - someone needed to punch this girl.\\n\\n\r\nEnjoyment: 2 - Dreadful\\n\r\nI was enjoying this anime in the beginning and then forced my way through to episode 23. At episode 23 I almost couldn't continue and had to google it. On wikipedia I got the summery and of the manga. After reading that, my thought's were \"this anime is really messed up\" (more than it already was). I continued the anime in pain, but I needed to finish it. Will I read the manga? I don't know. Maybe it will give me better feelings than where the anime left off. \\n\\n\r\nOverall: 4 - Decent\\n\r\nThis anime just made me sad. The whole relationship in the beginning seemed nice (if only the flow of the beginning of this anime had gone the same throughout the show or picked off where it disappointed the audience), but nothing is ever pretty. If this anime wanted to paint a picture of a messed up world then it did the job. Don't watch this if you don't want to get depressed. And I mean, there are a lot of good \"sad\" animes' out there that executed this type of genre beautifully like: Anohana, Honey and Clover, Clannad, Nana, Wolf Children, etc . But this one is just f*d up. But hey I will say this, I did enjoy some of the quotes and the things the characters did say to each other at times. \"Ever since I met you, I feel like... I’ve lived to meet you.\" - Yano\\n\\n",
            "date": "2014-12-02T22:13:00+00:00",
            "helpful_count": 15,
            "mal_id": 170859,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1706131.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kittystarburst",
                "username": "kittystarburst"
            },
            "url": "https://myanimelist.net/reviews.php?id=170859"
        },
        {
            "content": "Bokura Ga Ita is pretty much your regular high school romance show, the clich&Atilde;&copy;s are there, the characters don't vary much either,  A boy and a girl meet each other and fall in love, being young and inexperienced their relation has many flaws and they keep running into troubles affecting their daily life. Being an average show who doesn't  stand out from the others who really shine in this genre although it has enough to create a little corner for itself. There's plenty of happiness and sadness, way too balanced actually not favoring each despite the sad scenes show a bit more ofan effort in characterization, its quite dramatic but doesn't go as far as shocking the viewer, I personally prefer heavier emotions, scenes that make you cry a river over a tragic event and then rejoice when the storm has gone and everything ends better. It lacks the shocking developments that made other shows famous and so its somewhat mild and plain in comparison. \\n\\n\r\nThe characters are the usual clueless filled with uncertainty, fighting over small things and dwelling too deep, trying to attach meaning to things that are much simple, dragging the show into an overextended carrousel that could be done in much lesser episodes, theres the usual love triangles and lots of unrequited love but their just treated as secondary characters mostly. The drawings seem way too simple at the beggining but their more detailed on the crucial scenes and on the closeups, I'm not sure if its an artistic choice or just a way to produce faster but it looks decent enough and in this genre its not really the main concern anyway, it does a good job conveying the feelings of the characters and portraying them to the viewer and thats what matters here. One of my favorite details on the characters is definitely the cuteness in the girls, the clothes, the expressions and even the weird hairstyles of the lead female.\\n\\n\r\nThe plot evolves into countless break ups and getting back together, it prolly was meant like that but their always contradicting themselves and falling in the same mistakes not learning but also not giving up, it portrays how clueless a teenager can be and how the events in his life make him grow into a stronger adult, but its far from a reality scenario, I personally didn't like it, I don't mind fantasy but when your revolving around human emotions there should be some reality basis there and the show just seems to twist them as they want and in the end their feelings don't evolve much, definitely the weak point here, not so much the story but the development is flawed turning into a loop trying to better explain things and dragging out for too long.\\n\\n\r\nThe music is one of the good parts, calm and tender, well placed in the emotional moments soothing the mood. The voice actors sound just right on the characters in all the moments.\\n\\n\r\nOverall Its a decent show but mostly for fans of the style, it doesn't shine as a great anime, its not original and has some considerable flaws. The art is.. diferent but like-able and the sound is good so technically its good raising its ratings, but the development is way too slow and I feel it wasted allot of time going over and over where it could have been resumed without hurting the context, it also has plenty of repeated flashbacks wich might be acceptable for someone who watches the episodes spaced out but for someone who devours it quickly will make you feel like skipping some parts specially in the second half of the show.\\n\\n",
            "date": "2007-10-14T18:31:00+00:00",
            "helpful_count": 14,
            "mal_id": 1032,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3104.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/acceleratum",
                "username": "acceleratum"
            },
            "url": "https://myanimelist.net/reviews.php?id=1032"
        },
        {
            "content": "Characters in any good story make mistakes and learn from them. That is a fair statement, in my opinion; however in \"Bokura ga Ita\" I felt like I was watching the characters make the same mistakes countless times. In the beginning (let's say about 5-6 episodes) the story seemed fine, but as the story went on, the characters kept arguing and fighting over the same things: distrust, past relationships, lack of ability to convey feelings correctly. I kept going to the next episode in hopes that they would finally learn from their mistakes, yet it never happened.\r\n  After each fight, they would makeup and the same thing would happen again. Neither one seemed to try harder to make it work. They just wouldn't get it into their heads what they needed to do. Both Yano and Nanami were making me frustrated throughout the whole anime. Yano wouldn't let go of the past and Nanami had major trust issues. In order for their relationship to go farther, they needed to fix these flaws and it was quite obvious.\\n\\n\r\n  Anyway, you get the point that they had problems. It was majorly disappointing to see their pitiful relationship. I just could not enjoy the story and I did not have feelings for either of the characters. Rather than enjoying the anime, it was as if I was being socked in the face over and over with the painful drama cycle. It would have just been easier and a lot less miserable if they broke up and never got back together if they're just going to contiue fighting.  Nanami and Yano didn't seem to have true feelings for each other, because if they did, they would want each other's happiness. This was no romance anime, it was a war zone. \\n\\n\r\n  I would be lying if I said that I didn't like anything from it, though. It had nice music and the art wasn't too bad. There was some good comedy in there as well. But if I knew of all the craziness I was getting myself into before watching this, I wouldn't have touched it. It's probably a more realistic view of high school relationships, but I think I prefer ones that I would enjoy. If you like drawn-out drama and heartbreaking romances, then you may like it.",
            "date": "2014-06-17T15:48:00+00:00",
            "helpful_count": 13,
            "mal_id": 147373,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3665003.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ChibiStarChan",
                "username": "ChibiStarChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=147373"
        },
        {
            "content": "I really regret watching this anime. But for good reasons. If you get easily affected by a little drama (like me) this anime will haunt you for a long time after. The anime left me dumbstruck. And increadibly bitter becasue Yano and Nana just never seem to get what they want. I think this is one of the saddest anime's I've watched, and I actually cried once. Ahem, yes. \r\nThe story is pretty good (9), its very entrancing and you just need to know what happens next. Overall it was really depressing at times, but there was comedy used at the exactly right time soit kinda balanced it out.\\n\r\nThe art...was a little weird so I gave it 6. But you do get used to it.\\n\r\nThe sound -in the anime- made it all the more enjoyable. Props to the composer. Gave it a 9.\\n\r\nThe charcters were the best. I gave 'em a 10. They're all increadibly likable (except one purple haired person) and you can get really attached.\\n\r\nFor enjoyment I gave a 9 - because although this anime will stay with me for a long time, and is one of my favourites, it left me increadibly overwhelmed. I was honestly depressed for a whole day after I finished because ...well *sniff* its just that powerful. Although it probably is just me.\\n\\n\r\nBut really, I totally recommend eveyone who enjoys shojou to watch this. Because its brilliant.",
            "date": "2010-03-09T10:14:00+00:00",
            "helpful_count": 11,
            "mal_id": 23837,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/270045.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pillock",
                "username": "pillock"
            },
            "url": "https://myanimelist.net/reviews.php?id=23837"
        },
        {
            "content": "Bokura ga Ita is one of my favorite animes in the direction of romance.\r\nThe story was really good, very interesting and it was realistic. This story in Bokura ga Ita can really happen, so I found the anime really great. It was really well imagine how you would act itself.\r\nThe character was really great. There were what you did not like, but otherwise it was great. About some people have much to learn about some not, but it was good.\r\nEspecially the two main people liked it, the two are really sweet.\r\nThe drawing style is perhaps a bit of getting used to, but if you lookat it appeared then that is no problem, because you become accustomed to it, the story is really good and realistic. It's just not as a style as today's animes but good.\\n\\n\r\nThe music in the anime was also great, there were always beautiful music to the relevant scenes. I very much liked.\\n\\n\r\nWho likes romances and dramas can only recommend it, it is realistic and well done. A must for those of the romances and dramas like.",
            "date": "2008-10-28T09:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 9046,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24314.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Foxygirl05",
                "username": "Foxygirl05"
            },
            "url": "https://myanimelist.net/reviews.php?id=9046"
        },
        {
            "content": "\"...timing in love, is everything...\"\r\nWe Were There, what can I say. It made me happy, sad, angry, laugh(a bit) and at the end it made me feel...a little empty. I know it sounds bad but it isn't not really. Read on>\r\nShort Summary:\r\nNanami is starting her high school life. Her first day there isn't going as smoothly as she would want; she forgot a classmates name and was given the wrong name by a guy she met, she also happens to start liking the same boy who caused trouble for her. She knows it's a bad idea.  Can she win the heart of Yano andmake him forget his past love?\\n\\n\r\nNanami, the lead girl who just wants to make the boy she likes happy and make him look at her, see her, for who she is instead of always comparing or living in the past. She's proof that you can't control who you start liking. she is honest about her feeling from the start. You'll feel sorry for her and at the same time a bit angry that she takes so much crap. I mean, come on!\\n\\n\r\nTake who's only fault is that he fell inlove with his best friends girl friend. But, does he do anything about it? No, not really, not while they're together. He is there for her to talk to her when she feels lost and doesn't know what to do. He was probably one of my first friend-zoned characters in anime for me, and it's a shame really..not gonna say anything more on that.  \\n\\n\r\nYano is unbelievably sweet (sometimes) but he is so dense. He's the type of person that if he's good, he's so good, but if he's bad, he should get kicked in the balls for what an insensitive ass he is. You just want to scream at him, \"Move on Yano!\" Gonna be honest, he just made me angry, maybe I need to drink more tea or something.\\n\r\nSometimes you have to lose something to notice it's true value, but do you have to lose something multiple times? Come on!\\n\\n\r\nThe video quality wasn't bad, to put in in one word would be mellow. Like the soundtrack, and their voices were genuine to their character and not annoying. The art is different, and a little old fashioned but pleasant. It wasn't like regular bubbly anime that focuses on girls boobs or really huge eyes and I thought that was nice. Reminded me a little of \"Lovely Complex\"\\n\\n\r\nThe beginning it's better then the end. Maybe better isn't the right word. It's sweet. You expect it to end differently. I wasn't happy when I finished it but now that it's had time to settle, it ended just as it should have. Bittersweet.\\n\\n\r\nNow why did it left me feeling empty/a little depressed? Because they don't give themselves a break. They have the worst timing and even though they love each other it's just never ends happy. They expect for it to be 100% ok and life isn't 100% ok. You have to know some things are messed up and you have to move on! Me frustrated? Pfft\\n\\n\r\nWhy an 8 if I sound so unhappy with it, heck if I know, the anime is like a worm that crawls into your brain and cleans up so that it can be the one to mess things up. cooks for you and things. When it leaves it makes you a little sad that it did, just proving that it wasn't so bad. I just gave a worm analogy that I'm not even sure of. I need to reduce my caffeine...\\n\\n\r\nBut then again, when she said at the beginning the lline, \"..this is definitely going to be the worst mistake of my life...\" you can't really expect for it to be sunflowers and chocolates.Yum chocolates. \\n",
            "date": "2010-11-24T15:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 32281,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400973.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Moon_Light",
                "username": "Moon_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=32281"
        },
        {
            "content": "I guess i may be quite lenient in my grading of this anime,but i really think it deserves it.The anime is a high school romance focusing on the ups and downs of a relationship between the two main characters.\r\nThe story may be a bit cliche, but i think it was portrayed quite well. and if you are a romance-drama fan like myself then you would not mind. I think that the story is quite realistic and this is something i look at because then you can empathize with the character, even if you don't it grips you because you cannot really tell what will happenbecause reality is harsh and thats a fact. The complications that arise from the supporting characters makes the story interesting and the twists kee p you on the edge of your seat.\\n\\n\r\nThe Art was great i guess, im not so particular about the art but i think they were able to bring out the mood of the story quite well, and the scenic drawings are quite nice\\n\\n\r\nThe songs were great. They definitely suit this anime, being sentimental. The drama is brought out thanks to the songs and the insert songs are done up very nicely, you may even like some of the songs as you go along especially since there are like 8 different songs to end the episodes, and they are not in consecutive order,they are selectively used to suit the ending of the episode,which is quite rare in an anime so the sound was astounding.\\n\\n\r\nThe characters are of course important in the story with the supporting characters playing fairly big roles and are not left out at all like some other animes, they get a good deal of showtime. I myself found that i preferred one of the support chracters to the main chracter and it had me going like how sad it was for him...well i won't spoil it so go found out yourself...the main chracter Nanami is the narrator of the story and it is important as we get inside  the mind of the chracter and see things from her point of view mostly, but its interesting too.\\n\\n\r\nI thoroughly enjoyed the show being a drama-romance addict. The show also had its fair share of comic relief from time to time so its not serious everybit of the way. Its one of those shows where every episode leads to the next so your constantly watching non-stop(caution:once you start make you sure you have several hours ahead of you free).\\n\\n\r\nThe show really pull at your heartstrings. It is a very touching and meaningful story, you will definitely regret it if you don't watch it, its not everyday that you can find an anime like this. A second season will be out in june 2008 so i'm really looking foward to it, you will be too when you finish watching it. :)",
            "date": "2008-06-05T05:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 5247,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=5247"
        },
        {
            "content": "Okay so let me explain you a thing here. \r\nI'm very close to dropping this show. VERY close. And there's a lot of reason's. \r\nStory: 7\r\nAt first it seems like your typical high school romance, until they drop a bombshell on you. And I love that, it makes things interesting and entertaining. BUT. BUUUUUT. There are a few things that urked me. I can't spoil anything so I can't exactly tell you what but trust me if you're sane you will understand what I mean. Around episode 16 things just kinda get grueling and unless you're team Yano you're going to be so very angrywith Nanami your head may explode.\\n\\n\r\nArt: 4\\n\\n\r\nTo be blunt, it kinda sucks. The animation is choppy, majority of the time characters only have one eye or no eyes (Which is very lazy) and the ears.... oh god the ears. It's like Yaoi fingers but on a head. Typically I can get passed this and enjoy the show but there will be times when I just kinda sigh at the very lazy attempt at drawing. \\n\\n\r\nSound: 7\\n\\n\r\nYour atypical cheesy romance songs. Nothing too special, but it does fit the show. Might have been rated higher if they didn't overuse a very annoying \"lalalalalalalala\" track whenever I'm trying to enjoy a cute scene. \\n\\n\r\nCharacter: 10\\n\\n\r\nNow let me tell you a thing. Let me tell you a big thing. This show isn't just some silly romance. It is very much a journey into the mind of a young teenage boy who has to deal with a lot. Okay. This show may SEEM like it's about some silly little high school romance, but let me tell you a thing, NOTHING in this show is okay. Once you realize the main characters name is the same as another characters, things will click and you will realize just how bad things are. Again, don't want to spoil anything, but just know that these characters are VERY  real and VERY understandable. You WILL get attached to them and feel for them. \\n\\n\r\nEnjoyment: 6\\n\\n\r\nIt's be a spoiler to explain this. But I was enjoying the show until a certain point where things just get dumb and then I decided to read the comment section and I realized just how much I hate fangirls ignorant, blind, prepubescent hormonal raging lady boners for characters. I found myself getting more angry with the characters and their choices rather than actually being happy for them. I started to ship something other than the main ship which is always an issue with these types of shows because you begin to understand how horrible the main relationship ACTUALLY is. By episode 16 I stopped enjoying myself and rather I began hating the show and coonsidering just stop watching it all together because I knew EXACTLY what was going to happen and I didn't like it. \\n\\n\r\nOverall: 7\\n\\n\r\nTo anyone who thinks logically, I recommend watching this show until around episode 15. Anything after that will cause rage and have you take out that rage on a myanimelist review. I wanted to love this show but it was really hard in the later episodes. My hated for Yano just pilled up until I couldn't take it anymore and when I went to go discuss and confirm my rage it only made me angrier. \\n\\n\r\nIf you're just looking for a mind numbing romance and you're not looking into plot, then I invite you to dive right in.",
            "date": "2015-04-26T17:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 186543,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1421751.jpg",
                "scores": {
                    "animation": 2,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DellaDellsies",
                "username": "DellaDellsies"
            },
            "url": "https://myanimelist.net/reviews.php?id=186543"
        },
        {
            "content": "Okay, this might be more of a rant than a review since my feelings are fresh and raw. \r\nLet’s begin with the horrid artwork/animation. The characters had one eye missing throughout the show. I tried overlooking it but it was extremely distracting. I don’t know whether that was an artistic signature or pure laziness. Artwork team, maybe get your shit together?  \r\nBut what made the entire anime more hard to watch was *drum roll*: the characters. One of the most important elements of the show was the biggest downfall here. The main protagonists were plain dumb and annoying. I tried overlooking the fact thatthey were still fresh in high school (although age doesn’t have much to do with it) but man they were constantly getting on my nerves. One small problem was being dragged for so many episodes simply because of a miscommunication and lack of trust? Also, why does every rom-com/shōjou anime glorify the main male lead to be your alpha dominant, arrogant and aggressive type? Being physically/verbally abusive isn’t something you should be displaying in shōjou anime, where the main audience will be young girls, who will grow up thinking it’s okay having someone slapping/pushing/dragging you by your hands? It's not something unique in this show but it's a common trend amongst the genre itself, sadly. It’s unhealthy and it needs to be stopped. And it definitely doesn’t need any more glorification by having the female lead fall for that nonsense, for heaven’s sake. \\n\r\nBasically, most of the episode consists of: misunderstanding, lots of crying from the main female lead and unnecessary drama. The entire series was stretched out thin, there was no substance to the show, and nothing could make up for the terrible artwork & even more terrible plot/character development (because there wasn’t ANY to begin with).\\n\r\nAlso, I watched this on a whim because someone recommended/suggested this alongside Nana? Like, I saw NOTHING in resemblance, not even close. As a huge Nana fan, I’m offended that they were even compared to begin with. \\n\\n\r\nPS - Excuse the typos & grammatical errors in advance!",
            "date": "2016-03-22T16:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 213646,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4125167.jpg",
                "scores": {
                    "animation": 1,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/marmaladethot",
                "username": "marmaladethot"
            },
            "url": "https://myanimelist.net/reviews.php?id=213646"
        },
        {
            "content": "Please read this review if you are a fan of good, well thought out storylines and character.\r\nThis anime is the only show I've ever ranked a 1- even lower than umaru. The plot starts off as your general girl likes guy story, but the character development of the main girl is next to nothing in the first half of the season, and we are given no insight into what is so great about the main guy too. \r\nAs characters go, she is naiive, gullible, and dependant on others throughout. \r\nHe is hypocritical, arrogant, and has vague stalker tendencies along with a possessiveness which would wantto make you vomit. After watching the first half, I simply could not take any more of the crap that is this show and read the summary to see how the story would end up (it does not get any better)\\n\\n\r\nSPOILER BIT\\n\r\nThe hypocrisy I was referring to earlier is him telling her never to betray him, then him going on to sleep with his ex-girlfriend's (who is dead) little sister. The main girl then forgives him for this with no repercussions. This is why I found both characters retarded \\n\r\nSPOILER OVER\\n\\n\r\nOverall, the art was terrible (it seemed they couldn't decide how to animate the main guy's face most of the time), the music was nothing special and it didn't add to the show for me, and the characters themselves were the most idiotic ones ever to have been created.\\n\r\nPlease don't watch this show- there are way better things to enjoy your time with, and the SoL/romance genre is better than this.\\n",
            "date": "2018-03-11T06:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 273558,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Husbug",
                "username": "Husbug"
            },
            "url": "https://myanimelist.net/reviews.php?id=273558"
        },
        {
            "content": "This anime somehow expresses romance/drama in a cute and subtle way. Bokura Ga Ita portrays the common obstacles in relationships and the process of overcoming them. It takes place in high school, where a girl named Takahashi Nanami and Yano Motoharu unexpectedy fall in love. The two lovers are often on the verge of breaking and learn to understand each other .\r\nStory (8): The beginning of BgI has a good pace and draws you into the story. It's pretty straight to the point and focuses on important events. The middle to around the end drags a bit and might frustrate you, but it didn't keepme from continuing. Around the end, it picks up pace again (which I really appreciated). You might not like the ending, but I thought the emotions it expressed were worthy of watching (yeah I cried).\\n\\n\r\nArt (7): The art isn't amazing, and it distracted me a bit in the beginning, but throughout the anime I got used to it. It has a slight pastel/water-color feeling to it, which I thought was cute. \\n\\n\r\nSound (10): I personally felt that the sound was what kept me watching. The girl's voice was cute and soft, and had a relaxing aura. The music was cute and soft as well, and I thought that it helped establish the mood very well. It was soothing and drew me into the story. The music also left a big impression on me after I finished the series and I kept remembering it when I wasn't watching it.\\n\\n\r\nCharacter (9): In the beginning, I really loved the girl's personality. The way she thinks, the way she talks; it's very realistic. Toward the climax she was a bit frustrating, but that didn't stop me from watching. The main guy's personality might come off as weird, but I thought that it was understandable, judging from what he's been through. Overall, the characters are realistic and the way they develop is understandable.\\n\\n\r\nEnjoyment (8): Overall, I enjoyed BgI. Some parts dragged a bit, making it difficult to focus, but it wasn't unbearable. The ending left me hanging, but it was satisfying enough.\\n\\n\r\nOverall (8): I loved the soothing feeling in BgI and it kept me watching. As I keep repeating, some parts dragged, but it didn't stop me from continuing. It's very worthy of watching.\\n",
            "date": "2013-12-01T13:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 122243,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3374411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Raicheul",
                "username": "Raicheul"
            },
            "url": "https://myanimelist.net/reviews.php?id=122243"
        }
    ],
    [
        {
            "content": "If you are going to watch this anime because you think you are going to travel the romantic roller coaster of anime love, think again. This is probably the worst romance anime series I have ever seen. Now the question is, were to begin with this atrocity?\r\n   Let's start with shitty character development. You know how when you are watching this genre of anime, it is common to root for the main character while they go through the obstacles keeping them from their love. Good luck rooting for the main character in this story because she is such a whinylittle bitch. I just wanted to choke Nanami out; making mistake after mistake. The male love interest, Yano, has such a fucked up past love life, it makes no sense why he would want to be in a relationship with Nanami in the first place especially since she has no real appeal anyway. The most likable person in this show is the side character dude with a damn dog. It's pathetic. Character development is suppose to be one of the strongest points in this genre and I feel this show lacked the most in the character development department.\\n\r\n   The story was extremely bland and predictable. It is also soooooooo drug out. At one point you could skip like 3 episodes and they would still be hung up on the same shit or be mad about something else dumb and blown out of proportion.\\n\r\n   Art was okay; nothing balls of the wall amazing and I kinda liked the opening so that part was okay.\\n\r\n   On the note of enjoyment........., do you honest even have to ask? \\n\r\n   I would only suggest this anime if you have seen EVERY SINGLE romance anime out there and had nothing else to watch. Put this one at the bottom of your watch list or not on any list to watch ever.\\n\\n\\n\\n\\n\\n",
            "date": "2015-12-16T23:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 205737,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050765.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BadAssPanda98",
                "username": "BadAssPanda98"
            },
            "url": "https://myanimelist.net/reviews.php?id=205737"
        },
        {
            "content": "SPOILER FREE REVIEW\r\nDespite the technical flaws with the show, Bokura ga Ita is a very enjoyable series. It has a lot of the cute, \"aww\" worthy moments that fans of the genre know and love. It answers the question of \"how to keep a relationship alive\". However, if you are expecting high quality animation or intense character development and plot, then don't waste your time. If you accept the issues and see the show for what it is, you will find that it is a great romance series. Bokura ga Ita is a must watch for fans of romance/drama and here is why:\r\nWhat I likeabout Bokura ga Ita is that it explores relationships.Unlike a lot of anime where the majority of the story revolves around \"how\" and \"if\" the two characters end up together, Bokura ga Ita focuses on \"when\" and \"after\" they decide  to start a relationship. This anime shows the delightful moments as well as the obstacles that Motoharu Yano and Nanami Takahashi come across in their relationship. Although some of the simple problems they face are blown out of proportion,remember this is a DRAMA, so it is to be expected. The interactions between Yano and Nana is what really shines through in this anime. You can't help but feel bad when they are fighting and when they aren't at each others throats, you will find they are the sweetest thing on earth.  That being said,I did enjoy this anime however like any other show it has its flaws.Some may be able to accept its flaws while others may have a harder time. Whether you decide to look past this show's problems and start watching or to skip it because of them is entirely up to you.\\n\\n\r\nAn issue that many people have with this show, even before watching it is the animation.The animation is average for its time with some scenes appearing lazily done. For example, background characters would be gray blobs in some scenes. However, the show is very bright, colourful and appealing to the eye especially in the major scenes. I believe that it's possible for most to look past the (sometimes) iffy animation because it is not the main focus of this show. The animation isn't AMAZING but for a show of its genre, it doesn't have to be. Bokura ga Ita's simplistic yet artsy visuals get the job done. Like the animation, the sound also fits the show well, complimenting the art style. There aren't any outstanding tracks which you would want to download to your iPod, but none of the songs felt out of place, and the music in each scene sets the mood almost perfectly.\\n\\n\r\nThe story circles around four main characters and through this series you will learn the back stories of certain characters which are rather interesting. The development between Yano and Nana is really the main focus of this show. Their love for one another is put to the test when things like jealousy, past experiences, broken promises, and secrets get in the way of their relationship Their interactions are cute and endearing  and will legit make you envy the bond that they have. One problem is that certain characters will sometimes act out of character (if that makes sense) doing things that seem like they wouldn't do just to add more drama into the mix. This is a minor issue though, as this is easily overshadowed by the cute and funny interactions between all characters.\\n\\n\r\nBokura ga Ita is a bit unnecessarily lengthy, as it gets drawn out a bit towards the end. It could have been a few episodes shorter, but nevertheless fans of this genre will surely enjoy the long ride. If you are wondering whether or not you should watch the show because you are not particularly a fan of the romance shojou genre, I recommend watching the first 3 or 4 episodes as it gives you a general idea of how the series will be like.\\n",
            "date": "2014-08-05T16:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 155413,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1972494.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kelvinjay",
                "username": "kelvinjay"
            },
            "url": "https://myanimelist.net/reviews.php?id=155413"
        },
        {
            "content": "Watching nothing but anime, you would think that romance is a fairly simple concept. You’d flirt around as awkwardly as possible for a bit, help the poor boy/girl get over their traumatic back story with minimal effort, and finally kiss to become the OTP forevermore. For most anime couples, everything turns out honky-dory once their ship is confirmed. This is not the case in the anime I’m writing about today, though. Bokura ga Ita is a story of a struggling couple. It is full of doubt, drama, depression, and just enough laughter to keep the viewer invested in its romance. Though the show has afew noticeable blemishes that keep it from truly shining as one of the finest examples of the genre, the story it puts forth is interesting enough to warrant a view from anyone who enjoys tales of romance in anime high school.\\n\\n\r\nStory:\\n\\n\r\n\tThis story begins as our female lead Nanami Takahashi begins her life in a brand new high school. After making some quick friends, she starts hearing rumors about a boy in her class that just happens to be very popular with the girls. Upon meeting Motoharu Yano, the boy in question, Nana blows him off as nothing more than a goofball and a jerk. Circumstances, however, keep bringing them together and, as they get to know each other’s pasts and feelings, they eventually confess their affections and become a couple. Unlike many shows, this all transpires over the course of 5 episodes as opposed to the more common 12-24. For as quickly as the show moves through the early stage of their relationship, the rest of the show has a tendency to plod through the drama at a snail’s pace.\\n\r\n\tBokura ga Ita has a lot more to say than it does to show and this little quirk has the tendency to slow down the pace of an otherwise fascinating story. You will find the characters frequently staring at each other or into space as they slowly monologue about every thought that runs through their brains. When engaging with other characters, the dialogue is filled with so many pauses that you’d think half the script was written with ellipses. While this is very easy to forgive in the early parts of the show, because of its often fun and humorous nature, it does make the show very taxing to watch once the heavier emphasis on drama becomes the focus of the narrative. This isn’t helped by my belief that a lot of the events that take place in this story feel rote and mundane, making it hard to recall much of what happens in this series.\\n\r\n\tDespite the little hiccups, however, the show manages to make its way to a satisfying, bittersweet conclusion that I couldn’t help but admire. Without spoiling anything, I’d have to describe it as simple, but elegant (Perhaps a fair description of the show as a whole). And, as much as I’d hate to admit it, this ending may not have had quite the same punch if it wasn’t for some of the more tiring and taxing parts of the show. If the slow drip-feed of drama is what it took to wrap this show up in a nice, little bow, then I feel that it was worth the patience. Let’s be real though, none of this would work without the right cast of characters.\\n\\n\r\nCharacters:\\n\\n\r\n\t I absolutely loved Nanami Takehashi as the main character. For me, she is the centerpiece of this series and the main driving force for why I wanted to see this story through to the end. Nanami is the textbook definition of sweetness and nowhere is that more evident than in her voice.  Nozomi Sasaki did an incredible job of bringing this character to life with the most adorable line delivery I’ve heard in anime in a long time. Add to that her cartoonish/exaggerated faces and animations, her kindness towards her friends, and her exceptional penchant for second chances, and you get a rather likeable, if naïve character. To keep her from being to boilerplate, the show introduces an interesting dichotomy between that and her more jealous, selfish side that makes her have to work for her relationship, but also keeps her from feeling like a complete doormat like some other female leads. \\n\r\n\tIf only I felt a similar level of passion for Motaharu, then I may have been able to give this show more praise than I have been. It’s difficult for me to really nail down my feelings on this character. Motaharu is a very troubled young man. He is selfish, chauvinistic, possessive, rude, and doesn’t seem capable of taking anything seriously. Despite the fact that his “tragic” backstory gives reason as to why he behaves the way he does, it still doesn’t justify it. He isn’t a completely awful character, but for much of the show he kept the romance from really making sense to me, and that doesn’t bode well for most love stories.\\n\r\n\tThe other characters mostly feel like background scenery. Sadly, this is true for even important ones like Takeuchi and Yuri. Takeuchi is Yano’s best friend and the designated third wheel for this series. It’s hard to have an effective love triangle when the main competition is the nicest “nice guy” you could possibly write. In fact, Takeuchi is so nice that it borders on parody of such types of guys. Yuri is the sister of Yano’s ex-girlfriend and is supposed to turn this whole mess into a weird love quadrilateral, but her part in the story is so sparse and half-baked that her main purpose seems to be causing needless drama. This is especially telling by how her plotline never feels truly resolved.\\n\\n\r\nPresentation:\\n\\n\r\n\tThe art for this show is absolutely beautiful. While it isn’t anything high-budget and eye watering, the simplistic and minimalist approach to it adds a lot of style and charm to this show that you would be hard-pressed to find anywhere else. Sure there’s the occasional missing eye or weird facial structures when viewed from an awkward angle, but it’s never bad enough to ruin the piece. This strength in style is very important in making up for the show’s lack of animation. As stated previously, the characters spend a whole lot of time staring at each other and maybe talking a bit. It’s hard not to sometimes feel like you’re watching a power point presentation on awkward anime high school romances.\\n\r\n\tThe music I also found enjoyable. Even though it’s not something I’d want to listen to regularly, the OP and multiple ED’s were a pleasure to experience alongside each episode. What will likely burrow in your mind, however, is the indescribably adorable and cheesy song that plays at least once in every episode. Here’s a hint: there are a lot of “la la la”s in it. \\n\\n\r\nConclusion:\\n\\n\r\n\tGoing into this show with knowing nothing but a few funny clips that I’d previously seen on YouTube, I wanted to really fall in love with this show, but that ended up being a bit of a tall order. Though I really loved it in the beginning, the drama soon began to weigh the show down to the point that it actually became taxing just to sit through. Though Bokura Ga Ita has a lot going for it, it is a hard one to recommend to someone new to the romance genre of anime. For anyone who is a veteran though, this is definitely a series that is worthy of your time, whether you end up enjoying it or not.\\n\\n",
            "date": "2017-03-14T16:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 242575,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4682676.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Dr_Sephiroth",
                "username": "Dr_Sephiroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=242575"
        },
        {
            "content": "Okay, to start this review off, I'll just say that when it comes to anime in general, my preferences typically lie with either psychological/supernatural-thrillers, or slice-of-life romances. Bokura ga Ita I only noticed through user recommendations for Lovely Complex, Kimi ni Todoke and Toki wo Kakeru Shoujo. I wish I hadn't even wasted the time enduring this series in order to pass fair judgement on it, but I'm just that bored by this series. \r\nART – 1/10\r\nBokura ga Ita is largely, in my opinion anyway, a bland series. The actual animation itself is lazy. Aesthetically, it follows the shoujou conventions of a pastel colour palette,but the fluidity of the character's motions and the ways in which they are rendered leaves much to be desired. I wonder if the production team even *had* a budget to work with, seriously. You can tell when a series is loved by the effort that is put into its animation, and really, the art for this series isn't anything memorable.\\n\r\nSometimes, during particular scenes, you will notice a shift in quality where the characters are rendered in full detail... but this only seems to apply to the scenes where the protagonist and her love interest stare into eachothers' eyes for prolonged amounts of time. Even then, it's not even really a scene. It's just a picture that the camera slowly pans towards/away from while typical shoujou music plays in the background. Animation is minimal at best throughout Bokura ga Ita, so don't expect anything amazing from it.\\n\\n\r\nSOUND – 3/10\\n\r\nI never place much important on the soundtrack when it comes to shoujou anime, since that is usually so painfully far down on the priority scale that I sometimes wonder why they even bother. I barely even noticed the soundtrack for Bokura ga Ita. Maybe they were going for a minamilist style. Either way, when I noticed it, I found it hard to discern from track to track. Everything sounded more or less the same.\\n\\n\r\nCHARACTER – 3/10\\n\r\nI found it hard to empathize with the characters. The protagonist, Nanami, didn't strike me as a particularly interesting heroine. I found it difficult to pinpoint any part of her character that I could identify with, which in turn, made her a hard character for me to attempt to understand. As Bokura ga Ita progresses however, I started to decide this fault had more to lay with the character than me. Nanami really doesn't strike me as... commendable. She's your typical shoujou heroine. She perseveres to make her relationship with her love interest work. She's also striking me as teetering on the Love Martyr trope. Yano, the love interest, on the other hand, is basically portrayed as the Jerk With a Heart of Gold. It's so tested and tried, and oft-repeated, that any shoddy incarnation of this trope is doomed to bore, and sadly Nanami and Yano both suffer this.\\n\r\nEven with all the drama going on and the ~dark secrets~ and ~troubled pasts~ certain characters have, this does not do anything to deepen my empathy (or lack there-of) for them.\\n\\n\r\nENJOYMENT – 2/10\\n\r\nI tried.\\n\\n\r\nOVERALL – 3/10\\n\r\nLacklustre animation efforts, a bland and barely identifiable soundtrack, with equally bland characters who neither compel me to continue onwards with their story or inspire empathy within me to, for one second, take their individual plights seriously. I gave up with episode 8. I honestly felt like Nanami and Yano's sexual encounters were the only realistically portrayed scenario in the series. The voice actors sounded bored with the characters they were depicting, the animators looked bored with what they were animating, hell even the composer was bored judging by the lazy compositions they tried passing off for a *soundtrack*.\\n\\n\r\nGive Bokura ga Ita a go if you like romantic dramas where things don't always go right, but just don't expect anything groundbreaking or particularly thought-provoking from it, that's my advice.",
            "date": "2012-07-16T14:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 66759,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jessilestrange",
                "username": "jessilestrange"
            },
            "url": "https://myanimelist.net/reviews.php?id=66759"
        },
        {
            "content": "Bokura ga ita was a story about a high school romance between a popular guy and a cute girl. Blah, so boring right? Well, this anime actually exceeded my expectations and showed me a story I will never forget. Yup, I have to admit, there was nothing super exceptional about Bokura Ga Ita, and yet there was. It was a drama that kept me spinning through a million emotions. There were happy scenes and sad ones and some were so cute that I re watched them over and over again. There was also suspense that made my heart beat in anticipation.\r\nTo top it off, theinsert songs were amazing. Yes, they were AMAZING. The insert songs fit the scene they were played in. The animation quality was not amazing though and Takahashi's voice was not that great. On the other hand, Yano's voice was super sexy. This anime is a must.",
            "date": "2015-01-19T14:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 178543,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429719.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/codegeassxoxo",
                "username": "codegeassxoxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=178543"
        },
        {
            "content": "Bokura Ga Ita is a series with a simple plot. However, it’s simplicity is what makes it so attractive. It got me hooked immediately with the slightest essences of fate and love and obvious heartbreak that is shown in the first few minutes of the series. \r\nIt is about the relationship of Yano and Takahashi, the two main characters, and that may sound a little plain and possibly predictable. But the characters are so loveable that you can’t help but get even a little attached and that alone will blind you from any predictability in the series. It is relatable to everyone who has beenin or out of love and this series almost perfectly depicts how astounding first love can really be. And that’s my favourite part of the series: how amazing the love was between the two characters. The series also adds some mysterious elements to it as Takahashi tries to dig up Yano’s past. (So their relationship isn't all sunshine and daisies because Yano's past wasn't either.)\\n\\n\r\nThe only downside to this may be the art. I find that the art isn’t as colourful or detailed as something as Clannad, for example. There are some funny times when the characters have only one eye. =P\\n\\n\r\nI love the music in the series and it was nice how they inserted music over certain moments in every episode. It really helped to emphasize the meaningfulness.\\n\\n\r\nOverall, I feel that it is an amazing series and I recommend it to anyone who loves romance with a little bit of comedy. I can even slightly compare this to Twilight (only a little bit) so if you liked Twilight I guess you'll love this series(?)\\n",
            "date": "2009-07-11T13:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 16655,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/164059.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lovelier",
                "username": "lovelier"
            },
            "url": "https://myanimelist.net/reviews.php?id=16655"
        },
        {
            "content": "I actually wanted to give this anime a complete 10, just because of the feelings i have for this anime series now, in my heart i already gave it a 10, and that's all i need, and here is why i like this anime so much now:\r\nStory: 10/10\r\nFirst of all I have to say that this is a bit of a cliche story, but it's hard to find a drama/romance anime that isn't about love, breaking up, sadness and happiness, so i can't judge the story for that.\r\nIn this story is so much there, so many things you can see, so many things you canfeel and so many things you can learn. Some people will say that this anime is kinda boring, or had some annoying parts, or they will say that the love story was stupid and annoying, but I think that's because many people were watching this from the wrong perspective. You have to put yourself into the story, try to see the things that happened like it happened to you, and then you will understand it. After that you will realize how much this anime gives to you, so much you can learn.\\n\r\nThere aren't many things in life that can teach you, but this is surely something that can teach you of some things, how to act to others, how to care about others, how to feel, how to think about some things,not to judge everyone on a instant, about memories that never really fade away and many many other things even I maybe didn't realized, but there is surely so much here to see and I wish many people will see that like i did, because then they will really learn much about HOW TO LIVE, just like i have, just by watching this Anime.\\n\\n\r\nCharacters: 9/10\\n\\n\r\nGod damn it. This anime is showing people like they really are, not just some random perfect ones, because no one is perfect, but they show people how they can be different, how they can think different and how they can easily misunderstand each other, just like it really is, just the TRUTH. \\n\r\nSo many emotional characters, wise ones, the ones that are closed to everyone, the ones that have an open heart and also the ones who don't really want to get hurt, but want someone to take care of them.\\n\r\nAll these characters together made an atmosphere which made this anime and its story so damn good.\\n\\n\r\nAnimation: 8/10\\n\\n\r\nI really got used to this animation, even if I had some problems with it at the beginning.\\n\r\nI loved the colors and the warm and beautiful drawings of the characters, where you can see how they really feel. The moments when you can see only \"one eye\" of the character, you can tell how they really feel, on a instant, and i think that's a great job they made, I mean i can tell how someone feels or thinks just by looking at the face, and you have to think that this is sometimes really hard in real life, so it is even harder in a animated version.\\n\\n\r\nMusic: 9/10\\n\\n\r\nThe beautiful, peaceful, quite music in this anime made my heart so soft, it always made a really great atmosphere that makes you want to cry. A really beautiful opening also, that shows that there is happiness in this anime too, and a really beautiful ending theme that also goes as the background music and fits perfectly to the moments in the anime.\\n\r\nJust beautiful.\\n\\n\r\nClosing words:\\n\\n\r\nAll i have to say is, THANK YOU Bokura ga Ita, thank you for teaching me so many things, and thank you for all these emotions i felt while watching you.\\n\r\nThank you for everything...",
            "date": "2015-04-19T10:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 185960,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3182933.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GenesisCore93",
                "username": "GenesisCore93"
            },
            "url": "https://myanimelist.net/reviews.php?id=185960"
        },
        {
            "content": "Some people judge shows just by looking at the art. Yes, this one has a horrible art which gives off a cartoonish vibe and the voice acting is also bad. I was thinking twice whether to drop it or just continue. \r\nBut in the end, I gave this anime a chance and to be honest I enjoyed it.\r\nStory: \r\nOne word. Realistic. There will seldom be anime with stories that mirrors what really happens when two young people get into a romantic relationship. Bokura ga Ita gave me that kind of experience in love. There are a lot of emotional torture, heartaches and break ups whichmay throw you off or make you drop the series several times. For me, the more realistic the anime is, the better I enjoy it. Those who have never experienced young love will definitely want to stay away from this series. They would want to preserve their dream romance and never get those dreams tainted. \\n\\n\r\nArt:\\n\r\nBokura ga Ita has a mediocre art. I won't say this is the worst I've seen but taking in consideration the year this was made, I would say it just lacks a lot in most areas, not all. People who care about the story can get through each episode without even complaining about the art. \\n\\n\r\nSound/Voice Acting:\\n\r\nThe voice acting was horrible but after much understanding, I realize that they use some Hokkaido accent throughout the series which make it seem like the voice acting sound so bad. \\n\\n\r\nCharacter:\\n\r\nThe main characters are so real. A controlling a guy and an insecure girl reflects what most youngsters in real life are. Pretty much we see some fragments of ourselves to them in some situations.\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed this series. I overlooked the bad art and the horrible voice acting and just focus on the whole story. I'm the kind of person to judge the anime base on my own enjoyment. Even if some say this is one of the worst anime, I would care less about their own preference. As long as I'm satisfied with the progress and the ending, it's a good anime for me. \\n\\n\r\nOverall:\\n\r\nBokura ga Ita will take you to the real world of high school romance. It may not have the HAPPY EVER AFTER ending but surely, it's not a sad one. If you are the kind of person who loves romance and not as shallow as to just drop the series because the art and voice acting is bad, go ahead and enjoy the story. If you let bad reviews get to you, you can always come back and give this series a shot. \\n\\n",
            "date": "2018-03-08T22:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 273386,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7037678.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lazyrinth",
                "username": "Lazyrinth"
            },
            "url": "https://myanimelist.net/reviews.php?id=273386"
        },
        {
            "content": "I was absolutely in love with this show at the start. Im a total sucker for romances. It was really well written from my perspective. It was like a true to life high school romance. I was unsure about the animation too but it grew on me after a bit.\r\nTowards the end though it got very repetitive and dragged out a lot. I ended up looking up the ending and skipping after episode 22 to get straight to the finish just to see it. Its also disappointing that theres no season 2 as in the manga the story continues far more to a proper ending.\\n\\n\r\nIf it had been about 6 or 7 episodes shorted I would have enjoyed it much more as it had great potential. I wont say its time wasted watching, cause I really enjoyed the start. But the ending could have been done a lot better.",
            "date": "2016-02-04T14:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 210115,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4917421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LostBeyond",
                "username": "LostBeyond"
            },
            "url": "https://myanimelist.net/reviews.php?id=210115"
        },
        {
            "content": "The story itself was moving and amazing. There was a lot of drama in it but the humor in the story helped when the mood got to dark every once in awhle. It wasn't perfect though. The humor helped, but when I got near the end I had to put the anime to the side for a week because I couldn't take the drama anymore. Partly my fault because I was watching the whole thing all at once I guess. The anime was good but if you're looking for something to make you crack up this isn't it. If you want something thats going tomake you cry at times then this is the way to go. \\n\r\nThe art wasn't anything to be shocked about. I thought it needed a little work. The art wasn't bad, but the faces were missing sometimes. In the beginning I respected that because I thought it made you more aware of what the characters were feeling through facial expressions, but in the end it was done to such an extent that I just think that it was a short cut. Half of the time the characters only had one eye and sometimes they just didn't have eyes. I think that it was a good idea at one point, but it was done way to often.\\n\r\nThe sound was average. They're really isn't anything to say about the sound. I could hear what was going on and it was clear. Good enough for me. \\n\r\nThe characters were well rounded. Maybe I didn't always like what the main characters were doing or thinking, but no one is perfect and the fact that they were flawed made them outstanding.\\n\r\nThe enjoyment was pretty good. Sometimes I got depressed or annoyed with what was going on but that's a good thing and a bad thing. My feeling something for the anime meant that I was really into the plot and cared about the characters, but I wasn't always enjoying myself. I got a little fed up in the end. I came back and watched the rest but the drama was a little bit much sometimes and I had to take a breather. \\n\r\nOverall, this isn't something that I'm going to forget any time soon. It was an amazing story and I'm glad that I stuck to it and finished it in the end. It was worth the time and I would recommend it to anyone who's looking to watch a good romance. It may not always leave you smiling but it's a moving story and enjoyable to watch.",
            "date": "2008-04-29T01:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 4402,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/53860.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/angelofutopia",
                "username": "angelofutopia"
            },
            "url": "https://myanimelist.net/reviews.php?id=4402"
        },
        {
            "content": "I think what's really sad is that the art and sound for this anime was really good, but the characters are so horrible, that the story is affected too much.\r\nThe main character, Takahashi Nanami, is one of the stupidest anime characters I have ever watched. She has a sweet baby face, so I could accept blind innocence, but her plain stupidity just shines through like a harsh beam.\r\nShe confesses to the main male character early in the show without really knowing him that well; how am I as a viewer supposed to honestly believe she's in love with him and not just another typical fangirl of a good-looking guy?\\n\r\nOf course, as a typical fanservice, the main male character's best friend falls in love with her so that we can see a typical \"jealous male complex\". Unfortunately, this part of the story is so exasperating, since the main male character gradually grows to accept the fact that his best friend is in love with his girlfriend, while Nanami on the other hand decides to pick at EVERY little thing her boyfriend does. She reads into every single action he does and gets easily upset at everything.\\n\r\nI think one of the main reasons I can't stand this anime is because it's one of those that try to teach you lessons of life. One of the lessons in this anime is \"The important thing and the right thing are different\". You should ALWAYS choose the important thing, apparently, which is to make sure you never hurt your girlfriend's feelings, rather than actually help someone who has been physically hurt.\\n\r\nThis anime tries too hard to make Takahashi Nanami seem like the good girl, while the main male character is some horrible bad boy who breaks her heart too many times. This anime is a comedy for the wrong reason: the stupidity of it is laughable.",
            "date": "2013-06-09T18:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 100509,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LynnHae",
                "username": "LynnHae"
            },
            "url": "https://myanimelist.net/reviews.php?id=100509"
        },
        {
            "content": "Overall\t\r\nThis one is up there with Kimi ga nozomu eien as the best romantic drama anime I have seen this far. It is funny, cute, heartwarming, emotional and, best of all, realistic.\r\nAnimation\t\r\nPretty average animation, but with gorgeous character design. Every single facial expression is thick with emotions and most people look great. There are also plenty of nice lighting effects.\r\nSound\t\r\nThe weakest point of this anime. Voicer acting is not top notch, especially Nana, but after a while you get to appreciate her voice as a natural part of her.\r\nMusic is not great. The opening theme is alright, despite a bad vocalist and a badly tunedlead guitar, but none of the many ending songs were memorable. Background music is decent, but repetative (la la la la la...).\\n\\n\r\nStory\t\\n\r\nA truly realistic love story with lots of ups and downs. Not too original, but VERY well directed and paced. There is so much being told every episode that I often thought it was time for the ending song when really only half of the episode had passed.\\n\\n\r\nThe story focusses on the main couple, with not much attention elsewhere. This usually means lots of fillers and a slow pace. Not so with Bokura ga ita; I was hooked all the way through it. \\n\\n\r\nVastly contributing to the enjoyment is the realism; I felt like a high school student again while watching.\\n\\n\r\nCharacter\t\\n\r\nWonderful human portraits with personalities and behaviour that you can understand. I won't call it logical (love isn't logical after all), but the psychology behind the characters' behaviour feels solid and real. I often thought \"no! don't do that! what's wrong with you?\". but never \"argh, what is this? that's not human behaviour!\".",
            "date": "2015-02-06T08:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 179784,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1146571.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/brynolf",
                "username": "brynolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=179784"
        },
        {
            "content": "Story-9/10.  A story of a girl who starts out absolutely hating a guy who is the womanizer of a lifetime but falls for him because of his kiddish charm. Not the most unique storyline, but one that can lead to tears of joy, sadness, and everything in between. Because of Yano's past, Takahashi is forced to go through many realistic things in her new-found relationship. To be frank, i was frustrated at every character is this show by the ending. Not that it was a bad ending though.\r\nArt-7/10, Within the first 5 minutes of watching this series i was ready to give it upbecause i didn't like how the art was done, but i stuck to it because of the storyline. I mean honestly, half the people had no face drawn in or were missing eyes. I dnt know if the artist was lazy or if thats just how he wanted to draw it. By the 3rd episode i was used to it and jus paid more attention to the story.\\n\\n\r\nSound-8/10. I didnt care for the ending but the opening was good along with songs slotted in between.\\n\\n\r\nCharacter-8/10. The characters did grow on me after a while and at the end i wanted more. Each one progressed in their own way but not as much as i had hoped.\\n\\n\r\nEnjoyment-9/10. I really enjoyed the ups and downs in this realistic relationship. The only thing that brought it down was the question i had in my mind the whole time. \"Since when does a 14 year old boy start having sex while at school and wit multiple girls?\" Besides this, i liked the emotional rollercoaster and tearjerking moments because i really enjoy this genre\\n\\n\r\nOverall=9/10",
            "date": "2010-08-08T17:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 29433,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/303517.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/otaku1793",
                "username": "otaku1793"
            },
            "url": "https://myanimelist.net/reviews.php?id=29433"
        },
        {
            "content": "I'm not someone who drops an anime after just one episode but this one I'll have to make an exception for. \r\nStory: 7\r\nAlright so the story seems good from the first episode. Girl likes a boy and they'll most likely end up together in the end. This is easily the best part of the show.\r\nSound: 5\r\nThe opening and ending was ehh and so was the background music.\r\nCharacter: 6\r\nThe main girl character seems good and the main boy character seems ok but the side characters I remember nothing about.\r\nArt: 1\r\nOk. This is what destroys the show and makes it pretty much unwatchable. This animation is theUGLIEST, not the worst, but the most disgusting anime my eyes have feasted upon. I find it hard to believe that a mentally well human being said this show looks good. \\n\r\nIt looks like a flamingo took a shit, alright, then the shit was consumed by a squirrel who died the next day from the feces. This show looks like an aborted giraffe. As I'm writing this review I'm cooking some delicious chicken that I will soon test to see if the feces looks better than this abomination of as show. This show makes me want to puke out of my dick hole. This sperm infested diarrhea liquid atrocity is inexcusable to be passed as \"animation\". This is a test of insanity. This looks more cringey than Hillary doing the dab. I'm going to cut off my lubes and burn them into the microwave just to prove that would look better than this anal release. This looks like Barack Obama has sexually intercourse with a seahorse with Down syndrome, in Colorado. This makes Mars of Destruction's animation look like Angel Beats. But seriously if you want your eyes to be scarred for life by this dead fetus of a show that go right ahead.\\n\r\nEnjoyment: 1\\n\r\nBecause I can't stand this poopy sniffing animation. \\n\r\nOverall: 2",
            "date": "2016-08-14T16:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 226744,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4883000.jpg",
                "scores": {
                    "animation": 1,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Astraea_",
                "username": "Astraea_"
            },
            "url": "https://myanimelist.net/reviews.php?id=226744"
        },
        {
            "content": "***** May contain spoilers*****\r\n***** And spelling errors*****\r\nOk, wont say anything about the ending (but long distance relationships dont work! SORRY could not resist)\r\nCharacters are petty, lame and poorly detailed.\r\nNanami)\r\nMaby shes cute but what a whiny girl. Her voice is so irritating i cant find that attractive.\r\nAlso havent had a moment where she is funny or whatever. \r\nCan u immagen beeing married to such a girl. that = devorce in less then 2 years!\r\nAnd maby it was the art, but i felt that every smile Nanami or Yano made where forced.\r\nYano) \r\nWhat a little mama's boy. He has more emotions that a girl whos pregnant. (andi feel most of them are about sex) Everything he says (besides about the dead girlfriend doesnt make any sence.)\\n\\n\r\nDead Nana's sister) \\n\r\nIs the type that eithers gets killed later in live or leaves a suicide note. What a petty character.\\n\\n\r\nTakahasi (or something) likes Nanami but lacks any testosteron or commen sence\\n\\n\r\nAnd dead Nana could recieve free mental consultation from a doctor in every western country+ pills! And if i where her parents id lock her up untill she was 30!\\n\\n\r\nWhat a awfull anime.\\n\r\nI get that it isnt a comedy or something but man dont they have teachers/parents/friends/neibors/familie that teach those students commen sence.\\n\r\nThis sorta anime makes me wonder how the ppl in Japan realy are.  Cuz at least 2 people had to aprove of the script and 1 had to write it.",
            "date": "2016-06-21T12:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 221410,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4878543.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Chizin",
                "username": "Chizin"
            },
            "url": "https://myanimelist.net/reviews.php?id=221410"
        },
        {
            "content": "Soooooooo....Bokura ga ita huh? What can i say? I like punishing my self for my past mistakes and all the things i did to people...Or maybe i just practice for the day i die and go straight to hell..Now fair warning there's gonna be too much swearing from this point on so if you're one of those fruitcakes who get offended over bad words, may i suggest you get the hell away from here and into your bubble.\r\nBut we are not here to discuss my issues or my afterlife vacation plans, no..We have gathered here to talk about anime, so buckle up my beauties weare goin' for a ride.\\n\\n\r\nAnd we start with NOT the story but strangely enough with the animation. Why? Cause it would scar my soul (if i had one) less if some maniac strapped me to a chair and bit my loved ones to death, shorthly after fucking them in the arse with a steel dildo. I don't mean to be rude to the animators.....Who the hell am i kidding, i hope they die a painful death for inflicting this civil war wound onto me. Honest to Mithra this is way more painful to watch than 80's era anime.\\n\\n\r\nOk let me give you some examples..The characters are drawn like apes, with huge ears and weird body structure and what's even worse is that they look like I drew them instead of pro animators..And some legends say that my drawings are being used to summon ancient demons from other dimensions. But that isn't the only thing that's keeping me awake at nights.....It's their damn eyes. Every 2 seconds there's bound to be a scene where either the characters will litterally have no face at all or even worse they only have one eye drawn or even one eyebrow and no fucking eyes. EVERY 2 FUCKING SECONDS. How low was the damn budget for them to not being able to draw 2 eyes and eyebrows in every scene? Or where they bored and didn't even bother?\\n\\n\r\nAnyways the animation is so horrid it can make you sick in your stomach.\\n\\n\r\nSo..What about the story Dion?\\n\\n\r\nOh yes the story..Now here is my second biggest problem with this one, cause the story, while on paper seems quite ok and interesting, on screen not so much.\\n\\n\r\nIt starts out as your daily slice of life-romance-high school anime where the female main doesn't like the handsome brute of a male main but because she is a woman she doesn't know what she wants so she decides she wants him after all..That's called being stable kids and staying true to your opinions. After this they start dating or something but they always seem to stumble upon many troubles, one of them troubles being their parents who cock block the couple each time they try to get some action going, which to me is buffling cause for the life of me i can't understand why Takahashi would want to fuck Yano in the first place.\\n\\n\r\nTo put it into perspective, the guy is a huge douche from top to bottom towards her and her being a small minded idiot that she is finds his whole persona cute?! He doesn't hit her or anything but apart from getting physical everything goes....To bring some justification to the mix, the writer thought it was a good idea to put a harsh backstory for Yano.\\n\\n\r\nPoor poor Yano as we find out, had a girlfriend who was...Let's say the equivelant of a male slut(see bitches,i'm all for equality) and not only that but she was also in an abusive relationship before hooking up with Yano..But the hands of fate had other plans for her and the abusive bf cause they both died in a car accident which left our little lad broken cause he couldn't fit in his small head that she would go anywhere with her ex....Poor bastard i really felt sorry for him, you know..Learning at such an innocent time in his life that people are lying scumbags who ought to be stabbed and left bleeding in the moonlight.\\n\\n\r\nSo what did Yano do after that? He actually went and fucked her little sister!!!!\\n\\n\r\nLet that sink in for a while...Ok?....Shall i go on?\\n\\n\r\nSo Yano not only is an asshole but also doesn't know where not to stick his sausage and he now can't trust women as a result so he makes Takahashi's life miserable...At this point you might expect me to say that all goes well, she comes to understand how toxic this thing is and leaves him...Nope, she keeps on staying with him even when she dumps him...How's that possible? Well even i can't tell..Seriously i'm one of those people who have a hard time ending a relationship but if someone is being a total bitch to me i'll kick her in the abdomen and go for some drinks.\\n\\n\r\nAt this point the writer also thought it would be a good idea to put some love triangle in there too in the form of his best friend liking Takahashi and slugging it out with Yano for her eyes..How poetic....And how idiotic is that? Honestly what is this? Some teenager's fantasy about what the ideal knight romance should be?\\n\\n\r\nLong story short Takahashi develops an obssession with his ex and won't go back to being with him unless they talk about her...I'm sorry but when was the last time a woman wanted to hear all about your ex? I get it being curious what with the situation being as fucked up as it is, but who would dwell on it for months? Well i would for one, but that would be for my personal gain.. I'm always on the look for sick stories to laugh about with my mates.\\n\\n\r\nI think you get the picture at this point..It's like watching the chronicles of someone who could never let go of her teenage fantasies about the ideal romance and decided to mash them into a green and blue and beige slime.\\n\\n\r\nI've said in the past that when writers have many ideas and try to cram them all in there it almost always ends up in the shitter and this anime is a prime example of that. I liked how she tried to implement real life situations and even ones that aren't being presented in most anime and hooray and all that shit but the way they were thrown in there was less than ideal.\\n\\n\r\nThe way the story was divided was atrocious. 26 eps that were so drawn out they felt like 103 eps, characters that were supposed to rock this place to the ground but ended up being as boring as a clown in a kids party despite the somewhat fucked up background. There were times were the whole thing was going nowhere and just sat there idly showing irrelevant things or even nothing at all..\\n\\n\r\nAnd to add insult to injury the voice acting was subpar and i'm being very generous here. What i think happened here was that they went outside, picked up some strangers of the street and brought them in to deliver the acting..I cannot find another explanation for such empty performance on their part. No emotion whatsoever and no volume...When i say no volume i mean i had to crank up the speakers all the way up to 11 to hear what they were saying. 26 eps of actors whispering their lines.\\n\\n\r\nI really wish i could have liked it cause if nothing else, it had some promise. But if failed to deliver in every way possible. Now if you want to watch this go ahead and do so, just don't say i didn't warn you.\\n",
            "date": "2019-01-08T07:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 298424,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339890.jpg",
                "scores": {
                    "animation": 1,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Dionkeykong",
                "username": "Dionkeykong"
            },
            "url": "https://myanimelist.net/reviews.php?id=298424"
        },
        {
            "content": "When I started Bokura Ga Ita I already knew from the synopsis and a few reviews some of what the story entailed.\r\nStory & Characters: The story follows Takahashi Nanami and Motoharu Yano, two teenagers in highschool who falls in love, and some of the people around them. The problem is that Yano comes with a ton of baggage and has a lot of issues, and Nanami starts developing trust issues, as she feels Yano isn't being honest with her. Add in a few love triangles, and bam, there you go. The problem with the plot is that the characters never seem to learn and keepgoing in cycles of quarreling and then making up, over and over. The characters are done well enough, but start getting on my nerves after a while (like the fact that Yano keeps mixing his current girlfriend with his dead ex).\\n\r\nArt & Sound: The art isn't very good, and uses a lot of weird effects to seem more stylish or something. The sound was nice and complimented the mood well.\\n\r\nOverall: Maybe it was because of my mood at the time, but I personally couldn't finish the show. I though the first 8-10 or so episodes were pretty good, despite the art, but after that the repetitions got to much. It certainly is a story of some depth and is kinda realistic, but far from as much as I've seen many credit it with in other reviews. Maybe it's for you, maybe it isn't.\\n\r\nEnjoy!",
            "date": "2018-12-19T19:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 296216,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=296216"
        },
        {
            "content": "Bokura Ga Ita is a very touching story that can reach to the hearts of all of us who have gone through the hardships of growing up and getting into relationships. I first found that 26 episodes was way too much for this anime, but the progress was amazing, and they could add in more plot while still leaving the anime to be incredible.\r\nThere isn't anything to dislike about this anime of true love, true friendship, and true pain that we all go through at some point in our lives. I highly recommend this to anyone who has found those things affecting them. It'll reachyou, and you'll find yourself shedding tears of happiness and laughter that'll make you want even more.\\n\\n",
            "date": "2010-11-06T17:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 31874,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400119.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Johnforester15",
                "username": "Johnforester15"
            },
            "url": "https://myanimelist.net/reviews.php?id=31874"
        },
        {
            "content": "*SIGH* I had JUST finished my first review when my internet fails!\r\nI usually don't get an urge to write reviews, but for this one I did!\r\nFirst of, the story.\r\nIt's great! A real chick-anime! It's somewhere near as romantic as can get. The way it teases; it's a bit like a rollercoaster.\r\nI really got caught up with it; so much that I needed to watch 20 episodes in one day! It's very, very funny too. I usually don't laugh out loud, but with this one, I did - more than once.\r\nThere's something for all of your feelings. Harm, anger, jealousy, happiness, sadness - you name it!Simply great!\\n\\n\r\nThe art is typical anime. It's not super glossy and sparkling, which I very much appreciate. It's not as simply drawn as Mushishi (just to mention one), but neither an anime with big, thick eyelashes and eyes soaking in gloss, and hair in weird purple, green or blue colors. It's pretty average (= good thing!).\\n\\n\r\nI really liked the music - especially the opening theme! The melody in the beginning of every episode also reminds you of Kotoko, almost instantly making you smile. I didn't pay too much attention to other music, I'll admit.\\n\r\nOh yeah, I never got the beat of the outtro song, lol! \\n\r\nNeither art or music drags the overall score down.\\n\\n\r\nThe characters are FANTASTIC and are really carried through the entire show! I won't say too much about them as I think it could be a spoiler, so I'll just stop here ^___^ - GREAT!\\n\\n\r\nEnjoyment, need I say it? I loved it! There are only a few downsides to it. I thought the ending was a bit weird, but it's not something that really bothers me. The only stopping me from giving it a 10... I'm not sure. I even forgot the bad things now that I listen to the opening song, but I know there are a few minor things - but I may change my mind, you know ^___^\\n\\n\r\nOverall - perhaps the sweetest anime I've seen so far! (Not that I've watched many, but I think it tops Bokura ga Ita juuuuust a little.)\\n\\n\r\nMy advice: Watch it if you like a good portion of comedy and romance - or just a good story ^___^",
            "date": "2009-06-22T09:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 15989,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107605.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Bissen",
                "username": "Bissen"
            },
            "url": "https://myanimelist.net/reviews.php?id=15989"
        },
        {
            "content": "Alright --\r\nLet me just start off by saying: This anime is just great for any person who likes  romance, a bit of a laugh, and a slice of life (and the hardship, effort, and the greatness of honesty put into a serious relationship). I recommend this anime.\r\nThe beginning is so well thought out that you start doubting whether the characters actually have any defects. The lines, their thoughts, all perfect. But as you go along through the anime you see and realize that they're not that perfect, really. Each character starts to become more clear as you go along. You start to see theirweaknesses and their faults/defects, as well as their strengths. Also there's a great deal of mixed/confused feelings which adds a twist.\\n\\n\r\n It really shows what a true relationship and what true love is, as well as the mistakes people make, and the trust and belief they have and put in each other. It shows you really what it means to put effort into a relationship and be honest with one another. I'll be honest in my opinion; as you enter a relation, everything seems happy and exciting, and you feel like nothing can go wrong, thinking mainly about the present; but as the relation/anime progresses all sorts of problems arise between the characters, all of them being problems you find in reality. And that's what I really liked about the anime. The emotions expressed by the characters are very touching, realistic and sensational, a lot of the time refreshing/happy/loving/soothing/exciting, and a lot of the time saddening and depressing, but that's what makes it so real.\\n\\n\r\nIT FELT SO REAL!!!!\\n\\n\r\nThroughout the anime, you get closer to the characters and actually feel like you're with them from how much you learn about their personalities (Main characters). You learn about their insecurities and fears, which is a great part of the anime, and contributes the emotions expressed by the characters directed toward the viewer (YOU).\\n\\n\r\nI was very touched by the characters and the story, especially the last few episodes/second half of the anime. Probably the most emotional anime I've seen, especially the ending. I liked the art, especially the smiling faces (I found them very cute), the music was grrreat (added a lot of emotion and feel to the plot), The story was stunning, as I mentioned before, it was realistic and just incredible, with a twist,  and the enjoyment... Well, that was the best part of it. There were many times where I'd just laugh out loud at funny moments/comedy scenes. In the emotional scenes I felt really captured and sucked into the scene. \\n\\n\r\nThere were times where it would get a bit boring, but that's nothing to think about or bother me.\\n\\n\r\nOverall it was a really great, nice, romantic, and amazing anime !\\n\\n\r\nI REALLY loved it!! I think I'll now read the remaining manga chapters!! Again, I recommend this.\\n\\n\r\nThank you very much",
            "date": "2012-09-05T21:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 71653,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Abdalla22",
                "username": "Abdalla22"
            },
            "url": "https://myanimelist.net/reviews.php?id=71653"
        }
    ],
    [
        {
            "content": "For me, this Anime was really dramatic as you watch all the episodes or read the manga by yourself. The story was not limited for what we called “Love” but it shows all the learning’s you can get from it being “in a relationship” or not.\r\nIt was really impressive at all, as you realize what each episodes/chapters really mean in reality as you compare. Yeah, there’s something in this Anime that actually gave me an impact as I discovered deeply about loving someone while you protect and fight for him/her.\r\nThe two main characters, Motoharu \"Moto\" Yano & Nanami \"Nana\" Takahashi was really great how thewriter Yuki Obata put emotions into them. You will truly feel the sentiment and began to think more, in a mature way. In fact, the intensity of the story gave me a lot of insight about Love.\\n\\n\r\nIt was worth watching. After all the episodes (or even the Manga) the impression that I have indeed was awesome. It surely makes sense. I also like the soundtracks played in the entire Anime. Even the art, just plain and simple yet you can still see the good looking appearance of the character that being portrayed.\\n\\n\r\n*Personal Implication*\\n\\n\r\nI find out many things while sincerely watching all the anime episodes. Love really make are life worthy. It gives us happiness to be with someone we treasure most in our life.\\n\\n\r\nAnd sometimes, Love is not just as easy to be with them. You will need to pass all the testing that will come along; issues need to be settled and arguments that need to be ended.\\n\\n\r\nI also greatly understood several things how our past can enormously affect our present life. As we don’t let go of them, they will still imprison us. Just like what Yano was, He can’t forget what happened in his previous relationship that causes so much conflict with Takahashi.\\n\\n\r\nThen TRUST is required in all relationship that we will encounter. Because love cannot go on without faith, it was the main key to keep going and continue believing each other words.\\n\\n\r\nBut, you know the remarkable thing about being loved and being in loved, are the affections that inspire us to be better, grow and mature in every way of our life. It provides gladness while our heart is full of thankfulness that we are able to experience feelings that is priceless.\\n\\n\r\nSo, don’t be afraid to fall in love but make sure He or She can bring out the best in you. Never settle for something that you will regret at the end.\\n\\n\r\nMake your life wonderful! As you value what you have and create amazing journey with the person dearest to you.\\n\\n\r\nI’ll definitely remember what I learned in this Anime. If you still don’t watch it, then you must. Arigatou!\\n",
            "date": "2012-11-19T10:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 77917,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1352265.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dai-iane-otaku",
                "username": "dai-iane-otaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=77917"
        },
        {
            "content": "Before I start my review, please, pay attention to the fact I'm not from an English-speaking country, so I'm very sorry for my mistakes. \r\nAlso, this is my first review, so please check it out.\r\nStory: 6/10\r\nThe story is really interesting, but there are some main problems : In this anime everything is about a girl's crush and his past girlfriends. They see neither the present, nor the past and the only thing that happens is that the girl is hurted. There aren't any other couples' stories. Also, The first series of the anime are dinamic - especially the 1st one - then, untill the middleof the anime, the plot gets slower and slower and in the last series of the anime you're like \"It's so boring, let me finish it faster so I could start another one\".\\n\\n\r\nArt:5/10\\n\r\nThe art of the anime is special by itself, it's different and some scenes (usually scenes are not fully drawn and there are some kind of pink baloons surrounding the characters) show how does the main character feels.\\n\r\nThats what the bad thing about art is, too. It's really driving you crazy when there are people with one eye or with no eyes. And these baloons are usually made to miss parts of scenes which makes the anime less real.\\n\\n\r\nSound: 7/10\\n\r\nAbout music: Music was fitiing well, theme songs and openings were really good as well, but in the second half of the anime, as lots of boring and filler episodes start to appear, sound changed a lot, too. For example, Nana's (she's a main character) voice couldn't be compared with what it was in the first series.\\n\\n\r\nCharacters:7/10\\n\r\nThe whole plot is about 3-4 characters only. The good thing about them: They are little as a number, but they are done very well. Their nature is very good and each of their stories is exciting.\\n\\n\r\nEnjoyment: 7/10\\n\r\nBokura ga Ita starts very well but it continues like a long soap drama. Music is good, but bad art makes enjoyment less.\\n\\n\r\nOverall:7/10\\n\r\nBokura ga Ita isn't as good as it is supposed to be.Sometimes it is too cliched and predictable. It's good for people who like good romantic soap dramas, but for these who's searching for exciting animes, it's really a waiste of time, especially in the end. The plot of the story is pretty interesting, but it would fit better in 12-13 episodes than in 26. Sound was good and enjoyment is different about each one.\\n\\n\r\nI hope I helped! Sorry for my mistakes, again!",
            "date": "2013-07-28T02:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 107185,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1962280.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/aninceto",
                "username": "aninceto"
            },
            "url": "https://myanimelist.net/reviews.php?id=107185"
        },
        {
            "content": "Bokura ga ita is my favorite ... if i am takahashi... i think i am the luckiest girl...\r\nIf we always watch and read bokura ga ita you will\r\nunderstand me....\r\n...:D",
            "date": "2008-04-15T06:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 4078,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51544.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kandaisle_15",
                "username": "Kandaisle_15"
            },
            "url": "https://myanimelist.net/reviews.php?id=4078"
        },
        {
            "content": "Note:  This review contains one spoiler for the manga reader only.  Otherwise, no spoiler.  And if you don't want to read the manga which continues on after the anime ends, then no spoilers, only gems :)\r\nI love love.  And I love drama.  And this anime gave me both.  To be fair, the art annoyed me at first.  Why are there no backgrounds and only one eye?  Probably because the characters are so wrapped up in one another that they can't notice anything else.  And that's also my biggest problem with the show.  There could havebeen a zombie apocalypse happening and the characters wouldn't have noticed because they are so wrapped up in their own problems.  Which really aren't that big, however, we all remember that such problems seemed huge when we were in high school so it becomes part of the show's charm.\\n\\n\r\nThe plot of this show is all about beating a dead horse.  Let me rephrase that.  Beating a dead girlfriend.  The characters cannot let the past go, even if they weren't the ones to live through it.  The main guy is too conflicted to see past himself, the main girl is too naive to know anything, and the best friend who would be the perfect soul mate for anyone is too nice to ever get anywhere.  It is aggravating, it is annoying, it is irritating, it is...this genre.  It is what one expects.  Don't watch high school romance drama without expecting the irritating and expected.\\n\\n\r\nHere's where this show gets good and I'm going to give you a SPOILER, so stop reading here if you don't want to know anything about the story past the anime.\\n\\n\r\nThe anime  stops at chapter 31 in the manga but the manga ends at chapter 70, and the manga takes us 5 years into the future and really shows what the characters are thinking and feeling as well as past experiences well beyond the dead girlfriend.  The characters become more dynamic and show more background and their relationships become more real and complex.  The rating I gave this show is based on the manga and not the anime. \\n\\n\r\nSo should you watch this? Answer these questions:\\n\r\n1.  Do you love pointless romance dramas?\\n\r\n2.  Do you mind teenage problems that are blown out of proportion?\\n\r\n3.  Would you read the manga past the anime?\\n\\n\r\nIf you answered yes, no, yes to the above, watch this show!  It really doesn't take that long and let's face it:  we have all watched much, much worse.  And if you don't love romance, why are you reading this review?",
            "date": "2016-01-05T21:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 207853,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WineDrunkAniChik",
                "username": "WineDrunkAniChik"
            },
            "url": "https://myanimelist.net/reviews.php?id=207853"
        },
        {
            "content": "This anime is probably one of the greatest romance Animes, I've seen because is too soft, calm and makes your heart melt like a chocolate. It involves in High School. The two lovers are Yano and Nanami . \r\nIs about a girl who fell in Love on this boy call Yano,  which this boy; ex girl died in accident. He \r\nhate people who betrayed him & he had many bad feelings in date because of his ex-girl died in the accident after that a cute girl call Nanami which attract him and fall in love with her. \r\nThis anime will learn you moreabout love.\\n\\n\r\nGenre: Drama, Romance, Shoujo And Slice of Life.",
            "date": "2013-07-30T13:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 107531,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2891921.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NoreoBx",
                "username": "NoreoBx"
            },
            "url": "https://myanimelist.net/reviews.php?id=107531"
        },
        {
            "content": "the person who made this did this with heart in \r\ni love it there is a lot of love drama sadness in it \r\nnever seen something with more heart in than \r\nbokura ga ita",
            "date": "2009-01-02T18:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 10973,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/55435.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/eraki",
                "username": "eraki"
            },
            "url": "https://myanimelist.net/reviews.php?id=10973"
        },
        {
            "content": "First off - WARNING this anime is not properly rated there is sexual content!\r\nI really feel bad about giving a negative review but honestly I didn't like this anime. Yeah some parts were funny and cute but mostly it was unoriginal and annoying. Yano a popular guy with a troubled past goes out with Nanami, the stories timid protagonist (a typical plot to a high school drama). However, it gets complicated, Yano is still not over his last girlfriend who died and his best friend is in love with Nanami. Sounds like an interesting plot but it's not very well put together and Igrew to hate Yano's selfish nature.\\n\\n\\n\\n",
            "date": "2010-08-26T11:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 29975,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373958.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HotaruMiyu",
                "username": "HotaruMiyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=29975"
        },
        {
            "content": "The art may not please everyone enough but the story is really interesting. It's a very touching love story of Nana & Yano. It also includes some \"PG\" scenes.\r\nIt's main plot is having a relationship during school life but what keeps you clinging in this anime is the \"antagonist\" between them. An \"antagonist\" that never did anything to make the main character(Nana)  suffer or even didn't try to steal Yano away from her. For Yano, it's all about knowing when to move on & let go... For Nana, it's all about trusting Yano when he says he love her..\r\nVery dramatic with few hilarious scenes.All in all, i can say this anime has a mature genre. ^^",
            "date": "2010-10-26T10:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 31624,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91674.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/red_888",
                "username": "red_888"
            },
            "url": "https://myanimelist.net/reviews.php?id=31624"
        },
        {
            "content": "I have loved this anime from the beginning. There is no dull episodes and there is always a twist or a conflict. The reaction of the characters or rather their voice is very natural and funny.\r\nUnlike other romance anime, the boy is somewhat acting always like cool. But here,Yano/Male character is not acting cool or somehow. He has many weakness and keep his problems with him. He is very strange and funny person. \r\nAnd I like the start of their love when Takahashi/Female character used to hate Yano because she thinks that he is like an arrogant or cocky person. But she is wrong, shefell inlove with a person she used to hate.\\n\\n\r\nThe ending of the anime is sad. But surely you will be forced to read the manga beacause the sequel continues in it.\\n\\n\r\nFYI the anime ended in manga at chapter 31\\n\r\nSo the sequel will start at chapter 32, the manga has 70 chapters meaning the anime is only the half of the story.\\n\\n\r\nI recommend this the most for romance and drama. I don't know why it is underrated maybe because they were disappointed in the ending.\\n\\n\r\nOverall rating: 10/10\\n",
            "date": "2016-11-02T20:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 233115,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5412155.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jeremydevera",
                "username": "jeremydevera"
            },
            "url": "https://myanimelist.net/reviews.php?id=233115"
        },
        {
            "content": "Besides slice-of-life, I'm also into shoujo, so if there's no slice-of-life, shoujo anime will definitely be my second choice. Yeah and on some day (I cannot remember), while I was looking for some good animes (according to others' opinion), I caught a glimpse of this. After spending quite A LOT OF times watching, I finally came to the conclusion this one is totally a waste of time.\r\nTo be honest, I don't really have a high requirement on the art and I even don't pay any attention to it as long as the plot is great, beacause the plot will make up for it, anyway. Hence,before watching this, I hoped that this anime would live up my expectation (as you can see the score is pretty high). But it seems like \"the art makes up for the plot\" is the truth. It was obviously a LET-DOWN.\\n\\n\r\nLet me tell you something about the plot so that you van have a general look about this one. This anime, for me, is just like a typical shoujo anime: a normal, nothing out of ordinary high-school girl falls in love with a handsome, famous, ka-koi-i boy and the girl confesses her love and the boy's gradually into her and then the two falls for each other and then some unexpected troubles come and so on. You can get the picture somehow.\\n\\n\r\nWell, as you can see there's nothing extraordinary about this so I consider this a normal and safe one. Personally this would be a nice one if the troubles between them weren't all craps. There are two problems that I want to talk about:\\n\\n\r\nFirst is our first main character: Nanami Takahashi. Well I see her 100% normal and kinda disappointed because she's ..... so normal :(. Anyway I could ignore that. But but but, \"What's happening with the voice actor\"- that was what I was thinking when Nanami started to talk. I don't mean to be rude but her voice really DID annoy me, it made my skin crawl all the time. But that's not the only problem, unfortunately, she's the kind of girl that I hate most. She's so easy to cry and her tears weren't worth it at all (she needs to be stronger), she's arrogant because she always wants her boyfriend to treat her like a queen, she's a jealousy girl and doesn't have any empathy (why are you  so mean, girl?) and she just acts like she's the only one who deserves to be loved.\\n\\n\r\nNext is our second main character: Motoharu Yano. Well, he's hot so before dating Nanami, he was in a relationship with a girl,who is Yuri Yamato's big sister, Nana Yamato. Their relationship seemed quite nice (not until Nana died from a car accident), Yano truly loved this girl (I think this girl and Nanami should've been sisters because they're just the same kind of girl) and even though she was dead, he still had feeling for her and he confessed this on the beach, with Nanami (she was the one who told him to). Of course, after that they ALMOST broke up (but they didn't) because Yano'd tried to saved their relationship, which has been the biggest question for me up to now, WHY??? Didn't you say that you loved Nana??? OMG I cannot get this.\\n\\n\r\nIn this anime, I think I like the supporting more because they're the ones who really understand their feelings and act like adults. OP and END is normal, too, nothing special. \\n\\n\r\nTHANKS FOR READING :))))",
            "date": "2016-07-07T07:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 223390,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3838513.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PuPeace20",
                "username": "PuPeace20"
            },
            "url": "https://myanimelist.net/reviews.php?id=223390"
        },
        {
            "content": "As a huge fan of Love/romance anime, I have to say that this one takes the cake. This show shook me to tears, made me laugh, then punched me in the gut and shook me to tears once more. This is my absolute favorite anime, and that this is what turned me onto the Love/romance genre. So for you viewers, whip out the tissue box and prepare to laugh and cry.\r\n11/10, yes it's that good!",
            "date": "2009-03-31T22:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 13673,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13673"
        },
        {
            "content": "hey you guys....that`s just one of the best animes i`ve ever ever watched and i just...when it ended i couldn`t stop crying...tears went down my face all over again just when i thought i was done ... so ... if you`re a romantic GIRL it`ll definitely be your type of anime...believe me at first when i saw the art i tought it was bulls but now...watch it!!!",
            "date": "2009-06-12T02:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 15689,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160207.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/cool_oh_oh",
                "username": "cool_oh_oh"
            },
            "url": "https://myanimelist.net/reviews.php?id=15689"
        },
        {
            "content": "I probably just expected too much from this anime or was merely looking for something enjoyable to watch over the spring break; either way, I was disappointed. It was a total waste of time. \r\nFirst of all, the story was hardly exceptional and very predictable.\r\nAlso, the way Takahashi speaks was intolerable. But that's just me.\r\nAdding to that, the art was quite aggravating, especially when the characters are on sideway view. I'd say it was the worst disturbance in terms of artwork that had been bothering me since Barefoot Gen. Worst part was that I was anticipating that something pretty much spectacular would come around aroundthe bend that I opted to just grin and bear, and in the end it dissatisfied me.\\n\r\nSetting those points aside, the overall impression I was left with is that it was completely, simply put, downright soporific.",
            "date": "2011-03-31T21:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 35527,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/colorsplashx",
                "username": "colorsplashx"
            },
            "url": "https://myanimelist.net/reviews.php?id=35527"
        },
        {
            "content": "I usually try not to go for romance slice of life type animes, and what honestly caught my eye was the interesting art work, of the titles I have seen I have not seen anything quite like it.\r\nAt first the simplicity and lack of background was weird, but then somehow it only adds more to the characters.\r\nI hate the male lead, but that only means he was a strong character am I right?\r\nNever the less although I could not put this down, it was still a slice of life an not the best one I have ever seen, but thus far the most unique asthe story and the ignorance of youngins in love.\\n\\n",
            "date": "2012-10-02T15:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 73925,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1388753.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/qichiro",
                "username": "qichiro"
            },
            "url": "https://myanimelist.net/reviews.php?id=73925"
        },
        {
            "content": "I really liked Bokura Ga Ita, because it had such creative story and the way they planned the story out I really liked it ...\r\nStory - I really liked the story of this anime because it had comedy and romance in it but it had so much drama in there that I did not know what to do if I should smile or not but after sometime this was balanced because the story is like a real life story and it made me cry so much like I cryed alot this also has a movie part 1 and 2 I highly recommend amazing ^.^\r\nArt -The art is accutually alright but no too great and I am sure everyone wil understand as they watch they did not get into too much detail in the art but like all the other animes every anime has their own style of drawing not all of them has to be the same !! :D\\n\\n\r\nSound - I liked the sound in the anime I think it fitted really well with the characters and I thing the voice acterss have done a good job and also the way they talk goes so well with the drawing ...\\n\\n\r\nCharacter - There is the main character who is a girl her name is Nanami and there is the boy main character who is called Yano. Yano is the popular boy in the school and is in the same class as Nanami and Nanami is the class president. After some time they fall in love with each other ... I dont want to go into too much detail because that would just ruin it all ^.^\\n\\n\r\nEnjoyment - I really enjoyed this anime and with that enjoyment it made me cry alot like I said it is an anime that is like  real story that would happen... and I highly recommend if you like romance comedy and drama animes ...\\n\\n\r\nOverall - overall I rate this anime 9 because they could have gone in to a bit more detail in drawing because i like animes with detailed drawings and this was my turn off but because i fell in love with the story I gave it a 9 :DDDD",
            "date": "2012-11-01T08:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 76407,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1700143.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MavisVermillion",
                "username": "MavisVermillion"
            },
            "url": "https://myanimelist.net/reviews.php?id=76407"
        },
        {
            "content": "At first you would think this was a typical sweet high school love drama but it has a strong touch of the genre “Slice of life” that gave more of the realistic side of love life which was interesting enough if you’re bored with the typical love story. After all, life is not a fairy tale. It is more unfair and cruel that’s why it is called reality.\r\nFalling in love for the first time, the female lead thought that things would be as sweet as she imagined it would be. Founding out the sad and dark past of her new love, Nanami struggled to understandMotoharu’s situation at the same time accepting his past. This just showed how strongly the past influences the present of two people in love. And as if Motoharu’s dead ex-girlfriend story wasn’t enough, Nanami also has to deal with Motoharu’s past with his ex-girlfriend sister. To add it up, Motoharu had a hard time accepting his past and so his present almost didn’t work. Men can really be a lot work when it comes to their pasts especially if it’s about another girl. Anyways, Nanami and Motoharu still managed to make the relationship worked. You will have that romantic feeling from their sweet moments and cool dialogues which was the strong point of the series. You will absolutely be swayed by the dialogues because it has the sincerity from a real person’s feelings. What’s great about the story was that it showed the more realistic side of love life. But then again some people watch animes so that even for a short time they can walk away from the cruelty of reality. As much as possible they want to rest their minds and experience a little bit of fairy tale. Though I would say the ending was too much of a cliffhanger which was irritating because endings are very important for any type of stories. Everybody wants an appropriate ending in their lives. It doesn’t have to be perfect or so nice but at least a proper closure. Too bad, if it wasn’t for the ending this series would’ve been one of the best because the series was beautifully made for the most important parts.\\n",
            "date": "2012-12-09T00:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 79550,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79550"
        },
        {
            "content": "''They say that a memory.. is something you reconstruct depending on small fragments of recollections in your mind. They say that remembering is the same as seeing an illusion. What is existence? What if.. we had stopped there, or if we'd turned the corner... What if we hadn't stumbled over pebbles, or ever gotten lost, what if we'd never stopped.. What if back then.. what if.. what if.. Innumberable small choices led me onto the road I'm on now. When I was right, and when I was wrong. I was always me. You, him, anyone, everyone.. we're all right now. It's alright now. The sadtimes, the happy times, all of them are precious memories. So I pray.. please, let these forever be precious memories.. for you as well.''\\n\r\nBokura ga ita is a story that makes you happy, sad, etc. It's a train wreck of emotions as you watch the characters overcome life's hardships. Which is what makes it so amazing.\\n\r\nThe characters are lovable depending on how you view them. Personally, I liked Yano and Nanami. A lot of people think that Nanami is a sensitive crybaby but it really isn't that way lol. I never once hated Yano. I felt as if there was a reason behind all the sides he shows. He definitely proved that. Although I sometimes got frustrated at their actions, I kept reading. The characters were growing and learning, I didn't expect them to not make any mistakes. Because that's what their love story is. It portrays real ones. It shows that it isn't all about the romantic shit but that love also brings pain. I suggest reading the manga instead of watching the anime, since the anime isn't that good.",
            "date": "2015-11-03T19:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 202619,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4973696.jpg",
                "scores": {
                    "animation": 4,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LuchanHeartfilia",
                "username": "LuchanHeartfilia"
            },
            "url": "https://myanimelist.net/reviews.php?id=202619"
        },
        {
            "content": "LOL. Im sorry, but this entire anime PISSED ME OFF. I finished it, but i ended up getting so mad. They both are so ridiculous and annoying. You can watching this, but its not greaat..",
            "date": "2012-09-04T20:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 71597,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/versaceclaire",
                "username": "versaceclaire"
            },
            "url": "https://myanimelist.net/reviews.php?id=71597"
        },
        {
            "content": "If you want to dive into this anime, be prepared to flip a table. I am a person who quite enjoys romance and such, but this anime made me so frustrated I had to take breaks from watching it time to time. \r\nNot all of it was bad frustration, using a pretty well thought out character backstory and relationship complications made it enjoyable. However, towards the end of the anime I was getting ready to rip my hair out at the constant soap-opera feel to the entire show. Not only this, but the ending was extremely dissatisfying to me (which led me to pick itup with the manga). \\n\\n\r\nI guess another disappointment of the show was the fact that the ultimate ending of the show was highly predictable. I will have to say that many scenes and problems took me completely off guard, but the ending was going to be the same either way. \\n\\n\r\nOverall the art was good, but the animation in places was a bit off to me. Especially when a character was to turn sideways, it jut kind of creeped me out. That might be an art preference on my own, but it still plays a factor in the animation effect to me. \\n\\n\r\nI would recommend watching it as a good frustration romance manga, but as far as fantastic? Not quite.",
            "date": "2012-07-05T13:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 65411,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1377255.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/amykinsxoxo",
                "username": "amykinsxoxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=65411"
        },
        {
            "content": "Honestly I disliked this anime very much. Yes people say \"OMG I TOTALLY LUV THIS ANIME ITS LIKE THE BEST THIG EVER!! HEHE\" NO!! this anime was boring anime. I thought it was good at first but then it just got perdictabel. Yes there was a little \"Whats Going to happen\" but that was for like 3 eps. Over all im not saying you should not gudge it before seeing it but its also not worth seeing 1st thig. I just didnt like it thats my oppinone but you could like.",
            "date": "2012-09-01T16:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 71363,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1457225.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jnonymous",
                "username": "Jnonymous"
            },
            "url": "https://myanimelist.net/reviews.php?id=71363"
        }
    ],
    [
        {
            "content": "As of now, I've watched 18/26 episodes and at this point I needed to write something about it.  You may think, wow! This show is so great that I had to write something to praise it while in the middle of watching it! \r\nWell, sorry to disappoint but it's quite the opposite. I needed to write this because of my frustration levels were reaching their limit and my dumbass meter are off the charts.\r\nHold it! That doesn't mean I'm gonna drop the show. That would mean all the time that I've spent watching this total shitfest was a waste of time. All that timeI could've spent doing absolutely nothing wouldn't have been any better, so why not continue. \\n\\n\r\nHonestly the show isn't bad; 6 = fair which rightly so summarizes my experiences so far. Yet there are certain aspects of this show that really rustles my jimmies to an extent until I have to let these emotions loose.\\n\\n\r\nSTORY: 5 \\n\r\nJesus, I should've properly read the tags before watching this one. Yes there is romance and a whole deal of it; the primetime of inexplicable romances are centered around high school, as this one is. The characters: Nanami and Yano are what you would say, the classic, the stereotypical romance couple. The story is told in the perspective of Nanami and without spoiling too much, it was a total shitfest by the end of episode 18. I've never felt so frustrated by how it turned out and by how the characters interacted, which I'm sure you will or have felt watching this show. Holy jesus ballsack it is just an utter crappy concoction of drama, romance, crying, drama, comedy, and did I mention drama? I like relatable characters and genuine relationship and I can't find such things in this story between the two main characters or just in general.\\n\\n\r\nART: 8\\n\r\nI don't know, I think there's a certain charm to this kind of artstyle that is very representative of the time it was produced. It's not very detailed, the eyes are huge, facial expressions can't really be expressed by such a limited style, but there is a charm to it, I'll give it that. \\n\\n\r\nSOUND: 8\\n\r\nThere is a plethora of inserted songs throughout the 18 episodes that I've watched and I'm sure this will continue til the end and while these songs are very generic in their message about romance, the tracks are good and fit the theme. While some songs are repeated heavily, they merely add to the atmosphere and don't generally take away anything from it. \\n\\n\r\nCHARACTERS: 3\\n\r\nOh boy, here we go. If I had to give an award for the dumbest cast of characters in a show, this would win it 100%, let me tell you my reasons. \\n\\n\r\nNanami: a sweet girl who is infatuated with Yano, the hottie of the school. Described as plain and generic, I find her lack of willpower and convictions pretty disturbing. Constantly going back on her words in order to benefit this son of a bitch, Yano, (I'll get to him later) she seems to blame herself for these mistakes, which are clearly not her fault. She has literally done nothing wrong besides getting involved with Yano. Sometimes, people have to stick to their word and not give in to manipulating mfkers, which i something that Nanami seems to lack.\\n\\n\r\nYano: Jesus H. Christ never have I seen a more despicable character. Fuck, just thinking that someone out there in the world inspired the author to make such a fucktard character blows my mind. I'm just venting, but not only is this character manipulative, he clearly doesn't respect fuck all and in turn doesn't deserve anything at all. [SPOILERS AHEAD] Oh you had a childhood without knowing who your father was? Tough luck, that doesn't mean you get to disrespect the people around you. Nigga, get off your high horse and open yo damn eyes. Literally the problem to everything in this story. You can't trust him cause he'll just lie to your fucking face and while you blame his ass, nigga always turns it around on everyone else around. I try to sympathize with his problems, but just because you have issues doesn't give you the right to act like a total bitch. May god save my soul. You may empathize with me, maybe you won't but dear god if you don't, I hope you realize the magnitude of this dude's bitchiness and zero responsibility for anything he did. I honestly detest people who have no sense of accountability. /endrant\\n\\n\r\nNana: [SPOILER ALART] The late girlfriend of Yano, I guess the saying that similar people attract each other makes sense in this situation cause of both of these characters are fucking dumbasses. There is the concept that love can persevere through hardships and mistakes that is constantly driven up your ass throughout the story, but some mistakes can't be fixed, no matter how much you love the person. The epitome of a bitch, not only is she constantly said to be a stupid character even in the show, she feels no remorse for cheating on Yano, fk even I understand this frustrations despite not having had a single girlfriend. The theme of forgiving this person is nailed into your skull and that she was truly a good person capable of being forgiven  is something I can't accept nor will I accept.\\n\\n\r\nYamamoto: The stupidest fking character out of the whole cast. Literally no substance or character, I don't even know why this person exists or continues to exist. A character that I dear hope to god no one sympathizes with and holds in their hearts as the dumbest and most hated person out of the cast. Her character makes me want to peel my skin off and burn it. \\n\\n\r\nTakeuchi: The only sympathizable character and really the only relatable person in this situation. The good bro, best bro Takeuchi. While he may never get the girl of his dreams, may his broness continue to live on.\\n\\n\r\nENJOYMENT: 4\\n\r\nAll the reasons are above.\\n\\n\r\nOVERALL: 5 \\n\r\nNot sure if \"mediocre\" really exemplifies my feelings for this show, but I'll take it. \\n\\n\\n",
            "date": "2016-01-30T19:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 209743,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2098553.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/typicalchicken",
                "username": "typicalchicken"
            },
            "url": "https://myanimelist.net/reviews.php?id=209743"
        },
        {
            "content": "Ok, so overall I would rate this as a \"good\" watch.  I will add however, that there were about 5 or 6 episodes out of the 26 (started around episode 18 maybe...), where the story annoyed me so much it made me feel physically disgusted.  I LITERALLY had to fast forward through the episodes quickly reading the subtitles only, just so I didn't get lost, but I could not force myself to watch them fully.\r\nThe characters at this point were soooo frigging annoying, the main girl was acting so ridiculous I was actually hoping they killed her off during these episodes...it literally mademe hate her.  The \"friend\" was near the same boat too...friend my butt.  They could have condensed those miserable episodes into ONE just to tell the story and skipped the annoyance.  Had they did that, this anime could have received a higher rating from me.\\n\\n\r\nThe art is so-so, but having them deliberately not draw an eyeball and having very generalized sketches of the characters (lack in detail, etc...) could be annoying at times.  Some may love the \"art-style\", I just felt it was a bit sloppy instead though.  Sound on several episodes was a bit nuts too.\\n\\n\r\nStory overall was interesting this is definitely a DRAMA romance, but be prepared to want to kill off half the main cast during certain portions of this show.  They took their annoyances a bit too far in my opinion, but even still...if you like drama/romance this is still an enjoyable watch....just be prepared to be agitated. :D",
            "date": "2017-05-26T21:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 248603,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6256102.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 4,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stacycmc",
                "username": "Stacycmc"
            },
            "url": "https://myanimelist.net/reviews.php?id=248603"
        },
        {
            "content": "Story: 8/10\r\nThe detailed story was much more than I had expected. I thought it would just be a classic tale of boy meets girl, and they live happily ever after, however, it was a bit more complex than that. Yano's past was rather unexpected and added a lot of drama to the plot line. Unfortunately, Yano's connection to Yuri Yamamoto was very predictable. I thought the love triangle between the two boys and Takahashi was done in a very clever way, that not even I could decide which boy I preferred.\r\nArt: 4/10\r\nHonestly, I really didn't like the art in this anime. The close ups madethe characters appear worse than they were, and the fading at the edges made it very hard to concentrate on what was happening. It was almost as if it made everything fuzzy and faded in your mind. It also wasn't very memorable. I'm writing this review a couple of days after I've finished the show, however, I barely even remember hat anything, or anyone, look like. I did, however, love the characters smiles. That was great!\\n\\n\r\nSound: 8/10\\n\r\nThe music was great! I loved it! I liked the fact that even when nothing was happening, (eg. no mood), there was background music. It suited well to the moments and set a great scene. I don't remember many sound effects though. I didn't, however, like the voice actress chosen for Takahashi. I didn't think it suited her, and it rather irritated me.\\n\\n\r\nCharacter: 7/10\\n\r\nThe character stories were very clever. Everyone had a past and background that intertwined with someone else's. It very much helped with the character development.\\n\\n\r\nEnjoyment: 4/10\\n\r\nI didn't actually enjoy this anime very much. I enjoyed the surprises when they happened, but most of it was rather predictable. The art irritated me a lot, as I said before, and made it difficult to continue. I found it was an anime I could only watch when I was in a specific mood.\\n\\n\r\nOverall: 6/10\\n\r\nI thought this anime was good enough to watch, but not enough to get worked up over. It was a very good plot line, but I think it was let down by several factors. Overall, not a very memorable anime.",
            "date": "2013-08-30T00:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 111605,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2710255.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IslaMBM",
                "username": "IslaMBM"
            },
            "url": "https://myanimelist.net/reviews.php?id=111605"
        },
        {
            "content": "okay.. bokura ga ita.\r\ni found this anime accidentally when i stumbled upon some site. i thought the art was interesting, and it is! at least for me but i don't think everyone would agree. haha. the anime is low-budget so don't expect much but i'd say it was optimized.\r\nthis drama-filled love story is heart touching (or so i say) at first, i got hooked because of the dialogue and events (despite my fickle nature) but i got oh-so bored and irritated because of the girl. (okay, i was reminded, no spoilers) but really! UGH. i hate her. DX\r\nif you like drama, i think you'll likethis. i don't think it is one that would move you to tears but that's just the way it is. my tear duct is busted anyway so i'm not in the position to say so. haha.\\n\\n\r\nowari :)",
            "date": "2010-05-27T08:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 26476,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/333338.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yuudaiikanata",
                "username": "yuudaiikanata"
            },
            "url": "https://myanimelist.net/reviews.php?id=26476"
        },
        {
            "content": "WHAT HAPPENED!?!?!? \r\nOne second the anime is great and then all of a sudden it goes to hell in a handbag, and why? Well that's the big question now isn't. My heart broke when the characters started being stupid, my teacher always had two sayings:\r\n\"Don't kick a dead cow\"\r\n\"shit or get off the pot\"\r\nboth of these sayings mean the same thing. It means that you can't waste your time doing something that won't get you anywhere or hoping that something will happen when obviously it won't.\r\n***MAY CONTAIN SPOILERS***\r\nI liked the two of them together I really did and I love the drama but there isa point when you need to try something new because obviously this method isn't working. \\n\r\nI feel like the characters went from intresting to boring in a snap and the characters that I thought would grow some balls didn't eventually it got to the point where I couldn't even finish the series (with 2 episodes left no doubt) because the characters had lost all their spunk. Suddenly what was once a romance (including one sexy scene) became nothing more then a pre-teen drama with over-done lines and romance-less characters.\\n\r\nI am sorry Bokura Ga Ita but you should have stopped at episode 13...\\n\r\nNow the reason for the high review (being a 7) is because the begining (first 13 episodes) I will so totally watch again. But basically after that ... yea good luck.",
            "date": "2014-01-24T16:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 130093,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2991133.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/beccabear94",
                "username": "beccabear94"
            },
            "url": "https://myanimelist.net/reviews.php?id=130093"
        },
        {
            "content": "Bokura ga Ita is an anime that you wouldn't expect to be much, but you can't read a book by its covers.\r\n**STORY**:\r\nThe story is really good.  Patchy in some parts, but otherwise, consistent, excitable and really sad/emotional. :')\r\n9/10\r\n**ART**:\r\nThe art wasn't the best, I'll admit, and I wish they had used the art in some other animes, because, even though the head on shots were amazingly artistic, they had an awful lot of side shots, which, to be fair, were so bad, they annoyed me.\r\nThere were some beautiful scenes though, whenever romance occurred, they made it so dramatic and the colours were stupendous :D\r\nBut I'mgiving it a seven because the side shots annoyed me.\\n\\n\r\n7/10\\n\\n\r\n**SOUND**:\\n\\n\r\nThe sound is pretty good, and the voices for the characters were well plotted.  But Nana's was just awful :(\\n\\n\r\nI'll give them credit for choosing the correct voice for her character, but the emotion put into the voice-acting was zero!\\n\r\nIt was such a weak, empty voice, that, seriously sounded like a five year old just had her tonsils pulled out.\\n\r\nYano's voice was great, but I took off 2 points because of Nana's voice. \\n\\n\r\n8/10\\n\\n\r\n**CHARACTER**:\\n\\n\r\nThe characters were fun and enjoyable, even Yano from his cold heartedness to his sweet and fun side :)\\n\\n\r\nSorry, but again, Nana killed it for me.\\n\r\nShe just can't do anything on her own, can she?\\n\r\nShe is so weak willed!  And whenever they said to run after her man, she stood there at the window! >:[\\n\\n\r\nAnd Yuri Yamamoto.  Talk about STALKER\\n\\n\r\nGosh, they both annoyed me.\\n\\n\r\nSorry, I'm a strong person, and I don't understand why people are shy.\\n\r\nAnd stalker like.\\n\\n\r\n8/10\\n\\n\r\n**ENJOYMENT**:\\n\\n\r\nDespite all the factors that made me so angry, my enjoyment balanced it all out.  My friend told me about this, and she said I'd be crying my eyes out, but I doubted that I'd be crying for dang Nana.\\n\\n\r\nIf the ending had not ended the way it had, I would not have given this a 10.\\n\\n\r\nI wasn't going to cry - until I saw YANO.\\n\\n\r\nI burst out into tears.\\n\\n\r\nSuch a revelation!\\n\\n\r\nCold hearted Yano, who had such difficulty with showing his emotions.  CRIED.\\n\r\nI'm sorry for spoiler, but he CRIED.\\n\r\nSo I cried.\\n\\n\r\n**OVERALL**:\\n\\n\r\nSo, even though there are some low marks, such as in Art, I loved this anime.  If it makes me cry, give it a nine.\\n\r\nThoroughly recommend, I enjoyed it so much.\\n\\n\r\nPS- Don't give up on 10 episodes like I did, it was my first dropped anime.  CONTINUE, WORK ON IT, it is so worth it.",
            "date": "2010-07-11T17:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 28269,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/251296.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sailorstar",
                "username": "sailorstar"
            },
            "url": "https://myanimelist.net/reviews.php?id=28269"
        },
        {
            "content": "I started this anime maybe a year ago because I saw that it was similar to Kimi Ni Todoke. I wanted a cute little love story in school. What I got was that for the first maybe 5 episodes before it turned into just Yano being awful to Nana resulting in the same events over and over and over. I understand how most of these school romance anime are but after a while it just got so tiring. I literally felt tired after finishing an episode because of how repetitive it became so I just dropped it and had a friend tell me how itended.",
            "date": "2014-01-20T08:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 129533,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3448555.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/purdystar",
                "username": "purdystar"
            },
            "url": "https://myanimelist.net/reviews.php?id=129533"
        },
        {
            "content": "Bokura ga Ita - We were [there]\r\nTo be honest, I dont really understand how the title applies to the story, but despite that I think this anime lands somewhere in my favorite 10\r\nStory 9/10\r\nThere are a whole mess of cookie cutter school life romance anime out there, but this one being older, im inclined to give it more points for originality... as you might read from any summary out there, its your basic, two classmates fall in love and we get to watch it happen and we also get to watch the ups and downs of their relationship... ups and downs meaning, there is somedrama to keep things fresh and entertaining, tho im not a complete fan of ALL the drama, I certainly enjoyed watching\\n\\n\r\nArt 6/10\\n\r\nIf I had to describe the artwork in one word, I would probably choose \"simple\". I mean, given enough time and resources, I could probably produce something at the same level... but even tho it was perhaps low budget, I also think its simplicity adds a certain charm that other anime dont have. I think sometimes we can get so caught up in wanting state of the art graphics quality, we let it affect how we enjoy the anime. its just not the case here... if you give the simple art a chance, you might find you enjoy the anime as much as I do... or maybe not, I understand that drama isnt for everyone, but then again, if you like school romances, you are probably used to it \\n\\n\r\nSound 10/10\\n\r\nAgain, this is a low budget anime, but I particularly like the music... especially Kimi Dake wo, the OP song... its a good tune, the lyrics and the melody fit very well I think, and it genuinely made me look forward to watching episode after episode. No comment on the ED song... I dont remember it\\n\\n\r\nCharacters 8/10\\n\r\nWe all know teenagers will make some bad choices, its just a natural part of the age group, and its reflected well in this anime. that said, there are times we see characters trying to improve upon these mistakes, and in some ways we see a very realistic struggle taking place... we learn about some of these struggles from the past, and we watch some develop and as a result, we see some drama that made some of the middle episodes a chore for me, but I stuck it out and it was well worth it in the end. some of these drama details arent exactly realistic according to average western culture, but having *some* understanding of japanese beliefs, Im able to buy into some of these details more easily\\n\\n\r\nEnjoyment 10/10\\n\r\ndespite the \"construction in the middle of this road trip\" I quite enjoyed where things ended up... it was left a bit open ended, maybe in hopes they could have funds to produce another season, maybe to be addressed in the live action movie [which I havent seen], or maybe just to leave things to the viewers imagination, I have no way of knowing, but I assumed it was the imagination gig, and I was very content with the ending\\n\\n\r\nOverall 8/10\\n\r\nMost probably, this anime isnt for everyone, some people want action, some dont care for school life, and frankly, some people just like to complain about stuff... but if you like romance and you like school life, this anime is well worth giving a fair shot, and above all, just try to enjoy whatever you decide to watch ^.^ thats the most important thing in my opinion",
            "date": "2014-01-19T17:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 129449,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3502113.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/zerrubabbel",
                "username": "zerrubabbel"
            },
            "url": "https://myanimelist.net/reviews.php?id=129449"
        },
        {
            "content": "Bokura ga ita is so good i like many parts in their. I wish Yano could stay longer but he didnt i feel so sad when he left",
            "date": "2010-11-03T17:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 31801,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/yoyogirl99",
                "username": "yoyogirl99"
            },
            "url": "https://myanimelist.net/reviews.php?id=31801"
        },
        {
            "content": "Well the first part of the anime is really good, but starting in about episodes 13-15 it gets really dramatic and you honestly get tired and you feel like every episode is slower and slower. So if you're not into really dramatic anime or if you get tired in the half i recommend you watch the movie it's 10 times better.",
            "date": "2012-10-18T18:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 75269,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Li-chan831",
                "username": "Li-chan831"
            },
            "url": "https://myanimelist.net/reviews.php?id=75269"
        },
        {
            "content": "Oh my god! I felt like I was sitting in a bubble bath and watching this anime for the first few episodes. Okay some comments:\r\nStory [7/10]: Story is nothing special, typical of a shoujo anime or manga. So we have a girl and a guy falling for each other. Its the girl's first love and the guy's 2nd (?) .>  The guys cant still forget about his ex-girlfriend and is stuck in the moment for past 2/3 years (?) The girl now is very very very hurt by all these things doing around her and so she decides to breakup. the guy comes chasingafter her. They get back together again then are again or the verge of breakup and so it continues in the story till its ep 23/24. Then is the climax were the girl will again shed litres of tears and say her goodbyes to the guy (And please dont ask why is that. You all know the answer already- EMOTIONAL PUNCH!!!). END OF STORY. Phew. Boy was I glad that it ended finally. To tell honestly people who have read many shoujo manga may get really bored watching this show. But if you are persistent enough give it a try.\\n\\n\r\nArt [6/10]: Art is Okay I guess. But there have been many series with much better illustrations and background scenery even if they are just of the town places. The excessive bubbles in the first few episodes show to built up the \"shoujo\" mood was too much in my opinion. Animators could have done much better than this surely but oh well.\\n\\n\r\nSound [7/10]: OP and EDs were good, just not to my liking. Voice actor for the girl sounded highly nasal throughout (wonder about the reason -> maybe to show the naiivity ????) Other voice actors have done a decent job.\\n\\n\r\nCharacter [8/10]: Reckless, naiive sometimes, trying to act like others and indulging in unnecessary adult stuff, etc.. all have been protrayed well via the characters. though I doubt I saw any development.\\n\\n\r\nEnjoyment and overall [7/10]: Recommended for one time watch. Far from being special though to have for your collection.",
            "date": "2012-01-10T01:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 51411,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/488078.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/asckj1",
                "username": "asckj1"
            },
            "url": "https://myanimelist.net/reviews.php?id=51411"
        },
        {
            "content": "This romance anime surpasses many in the shoujo genre in terms of its fairly accurate reflection of real relationships, however there are certain elements that prevent it from comparing with others of the same depth such as honey and clover.\r\nI ended up having a very love/hate relationship with this anime, for a few reasons, which are explained in the categories below.\r\nPlot: The first several episodes present background info that interestingly sets up the storyline, but at times the past events seemed so age-inappropriate that it made a couple of the main characters seem less real and credible.  However as the series continues, the dramakeeps ensuing but it is actually fairly realistic and captivating due to its ability to make you relate to the characters.  Overall, expect a large helping of drama, sometimes pointless albeit understandable, from this one and less of the traditional comedic relief moments that many have come to expect from the genre.\\n\\n\r\nArt:  Overall, okay: the general drawing style is pretty standard except for certain stylistic elements that were generally annoying and actually plot distracting until you get used to them.  The anime has a tendency to draw characters with only one eye in moments where only one character's face is visible; I did not like this technique nor understood its purpose.  Also, the profiles of characters always struck me as ugly, the eyes bulge slightly out from the face and they look kind of like fish.  Otherwise the art was nice enough.\\n\\n\r\nMusic: Fine, appropriate for each scene.\\n\\n\r\nCharacters: You either love them or you hate them, but it is hard to argue that the characters are completely stereotyped.  The main ones, Yano, Takeuchi, Takahashi and Yamamoto, are at times very frustruating but all the while are complex enough to merit praise.  They accurately portray the desires, worries, and emotions of teens of their age (with one or two times of exception) and act accordingly.  There are no \"perfectly selfless\" characters that I have seen appear in the genre at times and their are no antagonists for whom you never feel sorry.  One of the strongest points of the anime in terms of believability and complexity, however this doesn't necessarily mean that you will care about them.\\n\\n\r\nEnjoyment:  Although I would have given this anime a 5 at many times, there were others when I could have given it a 9 because it can be so true to life.  It kept me fairly hooked despite its rocky start, yet however much I felt I could relate to some of the experiences, I never felt as attached to the characters as I have in other, more stereotyped and simple romance animes.  Although the plot is at times heartbreaking, it never made me cry once, which makes me think that there is some element lacking considering the gravity of the events.  In the end, I would say that I am glad to have watched this anime because it is thought provoking and also an interesting comparison to its counterparts.",
            "date": "2010-11-14T13:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 32051,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/396687.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ans98",
                "username": "ans98"
            },
            "url": "https://myanimelist.net/reviews.php?id=32051"
        },
        {
            "content": "A teenage love drama with a twist. If you truely like romance and drama then this show is just for you. Its very different from many shows out there becuase of the plot and art but, this is also god becuase with every episode it grabs your attention with the story and plot.\r\nTakahashi Nanami (Nana-chan) is a girl who falls in love too easily she didn't want to but she fell in love with her first (and only) high school crush Yano Motoharu, a guy who had a dark past. These two go on a very emotional rollercoaster ride for there high school expirience, onethey never forget.\\n\\n\r\nTakeuchi \"Take\" and Yamamoto are also a few other characters that make this show a true drama/romance classic thats leaves you with one heck of a love story!",
            "date": "2009-03-05T16:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 12941,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/142954.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NujaGurl",
                "username": "NujaGurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=12941"
        },
        {
            "content": "Bokura ga Ita was a true love story full of hardships that an average relationship has. When you watch the first episodes you think of it as an average anime, but after a few more, it make you realize the truth about love. This is the first anime that truly made me cry, because the situations the characters are put through are things that most people can relate with. This anime was a great balance between comedy, slice of life, drama, and romance. Although it might make you cry until your eyes hurt and feel numb...thats the beauty of it. Its truly one of thebest anime I ever seen, it might only be an anime and although its fiction the impact is real. I truly recommend this anime to all of you!\\n\\n",
            "date": "2013-02-21T22:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 87517,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1781313.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xxXKittyXxx",
                "username": "xxXKittyXxx"
            },
            "url": "https://myanimelist.net/reviews.php?id=87517"
        },
        {
            "content": "Overall this is the best romance anime I have ever watched.. i only wish it continued on to a second season since the manga goes much further.. :( *leh sigh*\r\nAlso, i'd like to add that this is also a very different style anime than i am used to.. the way the characters are drawn are as if you are actually watching a manga!! Its an amazing anime to watch. If you are into romance/drama, this is a must see!!",
            "date": "2008-06-21T23:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 5687,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7460.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/darkwhisper",
                "username": "darkwhisper"
            },
            "url": "https://myanimelist.net/reviews.php?id=5687"
        },
        {
            "content": "I enjoy this anime very much and I think it would be because I found it to have a very real atmosphere. The lead male character Motoharu Yano was deeply flawed and for Nanami Takahashi it made loving him difficult but I think the complexity of their relationship made it all the more powerful because it shows what people in love can work through. I felt as though the artwork of the anime was very good at showing the depth of emotion and the intensity of a moment.",
            "date": "2013-03-22T13:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 90511,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2336089.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rokulydian",
                "username": "Rokulydian"
            },
            "url": "https://myanimelist.net/reviews.php?id=90511"
        },
        {
            "content": "YANO! im so pist at you for what you did in chapter 52 of BGI!! you're so mean to her ... but I kinda understand why you did it. You couldve talked to her a lil longer tho.",
            "date": "2009-06-22T10:13:00+00:00",
            "helpful_count": 0,
            "mal_id": 15991,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/196862.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kurancest",
                "username": "Kurancest"
            },
            "url": "https://myanimelist.net/reviews.php?id=15991"
        },
        {
            "content": "Bokura Ga Ita was a wonderful anime with such a good intro song and the plot was amazing. It never bored me because of the constant struggles between Yano, his past ex, yuri, and Takahashi.\r\nReasons why i liked this anime:\r\nI liked this anime because the songs played i this anime were soo good, it had a pretty goood art, story was well written, and the character role development were outstanding.\r\nReasons why i hated this anime: \r\nnone really.",
            "date": "2012-09-17T00:25:00+00:00",
            "helpful_count": 0,
            "mal_id": 72533,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/imnottan",
                "username": "imnottan"
            },
            "url": "https://myanimelist.net/reviews.php?id=72533"
        },
        {
            "content": "Well it's your typical shoujo--popular boy and plain girl falls in love. But what separates Bokura Ga Ita from the rest is that the situations are very realistic that you might think that the author is narrating from experience.Main protagonists are well-crafted, especially Yano, who is exactly what a naughty, hormone-driven highschooler should be, though some characters (especially the friends of Nanami) are pitiful, because well, their only role was to sympathize with Nanami, but other than that, they just blend in with the background.\r\nThe story is beautiful; anyone who has their fair share of happiness and betrayal in a relationship can relate.The art issimple, I can say it was somehow low-budgeted the way the backgrounds are washed out. The anime just covered the first 30 chapters of the manga (40 chapters were left). And  obviously the story did not end on the last episode and you have to read the rest of the manga, or watch the live-action version.\\n\\n\r\nAll in all it was a good watch and I do recommend it to everyone.\\n\\n\\n",
            "date": "2013-10-10T01:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 116297,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/518069.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jeyore",
                "username": "jeyore"
            },
            "url": "https://myanimelist.net/reviews.php?id=116297"
        },
        {
            "content": "Don't waste your time!\r\nThis anime starts off okay. It's evil! It hooks you in so you'll want to watch it, but then it gets worse... After the 12th-ish episode They save the \"OMG!\" drama for the end of the episode, basically forcing you to watch the rest of the season. There is loads of crying, which is incredibly annoying. Nana-san will cry over basically ever single detail. \r\nThe art is okay. It reminds me a lot of Lovely Complex, so I didn't find it all that original. I had no problems with sound or anything really. \r\nThe story is an okay idea. Only good writercould turn it into a fun anime; which this anime failed to have, sadly. \\n\r\nThe ending made me even regret ever watching this. It ended sort of sadly, but it had to be done. It seems there needs to be second season, but that would mostly likely be torture. It just feels so unending like I wasted all my precious time. Don't be like me. Watch something better like Ouran High School Host Club or something!",
            "date": "2013-07-14T16:09:00+00:00",
            "helpful_count": 0,
            "mal_id": 105341,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/iluvrainydayzz",
                "username": "iluvrainydayzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=105341"
        }
    ],
    [
        {
            "content": "Bokura ga ita is a romance, drama, slice of life anime series. A very touching story of first love, lost love, and family tragedy. Though others may find its drama boring or dragging, I love the drama of this anime series. It made me want to watch for more. I am looking forward for a second season. I do hope that they would make one. I really love this anime series, it's one of my favorite!",
            "date": "2013-02-23T22:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 87721,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/2RR",
                "username": "2RR"
            },
            "url": "https://myanimelist.net/reviews.php?id=87721"
        },
        {
            "content": "*WARNING**DON’T LET THE FIRST EPISODE FOOL YOU, THIS ANIME IS ACTUALLY GREAT*\r\nI absolutely LOVED this anime. At first I thought it would be like every anime where the girl loves the boy but they aren’t a couple until the very end, but that didn’t happen. The story revolves around them as a couple and the conflicts of life that they had to deal with.\r\nThe characters were well developed, some with a tragic backstory and all. You could see who they evolved during the serie, they didn’t stay the same, which made the anime intriguing and something you wanted to see. and problems kept appearing oneafter the other, and it was  like I couldn’t get enough.\\n\r\nThere were moments in which I laughed, moments where I cried, moments wHere I couldn’t stop cursing one of the characters or yelling at the screen. This anie is worth watching because it’s not one of the common romance anime, it had a good story with drama and all, and although I don’t like open endings, this one was just right. So I’m telling you to watch this anime because you’ll love it.\\n",
            "date": "2014-01-21T15:52:00+00:00",
            "helpful_count": 0,
            "mal_id": 129719,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3465169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/scarletgirl",
                "username": "scarletgirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=129719"
        },
        {
            "content": "I love this anime...\r\n       It's funny and romantic together. there love is like  getting deeper and deeper evry episode.. It was very sad at the end.. So when i finished the anime I started reading the manga to figure out what happens next.. I haven't  really finished the manga yet.. but working on it..",
            "date": "2014-02-15T12:38:00+00:00",
            "helpful_count": 0,
            "mal_id": 132667,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3577751.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_AnimeLuverz_",
                "username": "_AnimeLuverz_"
            },
            "url": "https://myanimelist.net/reviews.php?id=132667"
        },
        {
            "content": "This anime is alright somewhat if you are looking for a main character who is a dou*** to the girl. The anime can be touching at times making you wonder what might happen but overall the smallest things set each other off and it honestly wasn't too fun at times watching this. Honestly the art was scrappy at certain times, the enjoyment you get out of watching the kids get angry at each other or pissed off over something so small is priceless sometimes.\r\nOther than that watch this anime but expect it to be mediocre. The drama is too stingy.",
            "date": "2017-05-09T20:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 247324,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6235853.jpg",
                "scores": {
                    "animation": 4,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Reconceptions",
                "username": "Reconceptions"
            },
            "url": "https://myanimelist.net/reviews.php?id=247324"
        },
        {
            "content": "Bokura ga ita is one of my favorite anime shows out of all I watched so far. It made me sad, happy, angry,agitated, nervous. It made me feel different.\r\nEven though I am not quite satisfied with the overall art I focused on the story more, as well as characters in it.\r\nThe story is bursting with emotions. \r\nIt made me watch episode after episode, I had tremendous need to find out what happens next so I ended up watching 15 episodes in one day. \r\nBut that is all I watched.\r\nThe reason I stopped there is because the tension and the constant mood change was just toomuch for me. I like to watch anime similar to this one, but with this one I was just torturing myself. One moment I was sad and crying like a little girl, the other I was happy jumping around singing, laughing. Then I was angry and disappointed, then happy once again, and on and on.\\n\r\nDon't take me wrong, this is one hell of an anime, really really nicely done, of course I recommend this to people all the time, but I cannot bear hundreds of emotions swirling inside of me with each episode.\\n\r\nFor me this is one pretty,but very sad story.\\n\r\nIf you are not quiet emotional person like I am you will  definitely love it.\\n\r\nTry to watch it either way, you will not be sorry.",
            "date": "2014-05-11T08:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 142989,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3768613.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ame_Gasai",
                "username": "Ame_Gasai"
            },
            "url": "https://myanimelist.net/reviews.php?id=142989"
        },
        {
            "content": "Okay first off, if you don't truly like drama you won't like this anime straight off the bat. It's not a romantic comedy and its a kinda slow paced. \r\nIt's a story about a high school boy (Yano) and girl (Nanami).Who's relationship is affected by Yano's past and deep emotional scars. Nanami is a sweet, innocent and naive girl who gets entangled with the the very complicated Yano who just can't seem to get over his past and make healthy decisions. \r\nIn a Nutshell, you can already tell it's gonna be a lot of secrets and miss understandings from them (the lovers) and frustration onyou as the viewer. It's a drama, shoujo, school life story.That makes love more complicated than it really is but we just have fun watching all the Crazy heart thumping drama arise.",
            "date": "2013-01-08T10:59:00+00:00",
            "helpful_count": 0,
            "mal_id": 83068,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2003060.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Luv67",
                "username": "Luv67"
            },
            "url": "https://myanimelist.net/reviews.php?id=83068"
        },
        {
            "content": "It's not that I don't like watching romance series. But this...this was...just like torture.\r\nSeriously, one of the main characters, Takahashi Nanami is crying all the time, literally ALL THE TIME about EVERYTHING and it drove me crazy. It's only natural that some crying involved in romance series, but not that much. That amount of crying is really annoying.\r\nAnd what about the art of this anime? Why didn't they draw both eyes in ''dramatic'' moments? Let me tell you something, it's not artistic, not dramatic, and it made the whole anime look like crap...actually, it really is crap.\r\nAnyway, Bokura ga Ita is really a bad anime,but I was patient. I wish I weren't. I feel like I spent my time for nothing. Absolutely nothing.\\n",
            "date": "2013-01-08T09:41:00+00:00",
            "helpful_count": 0,
            "mal_id": 83060,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214162.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LegendaryGirlA",
                "username": "LegendaryGirlA"
            },
            "url": "https://myanimelist.net/reviews.php?id=83060"
        },
        {
            "content": "This anime namely, Bokura ga ita in english, We were there is all about romance. It has lots of drama and I actually liked it. It seems enjoyable and fun to watch. There were a lot sweet moments and a lot carried away moments. I was captivated by the characters the main character namely, Motoharu Yano is very devoted especially to his ex-girlfriend and his current girlfriend. He had a very tough past and also he wanted to completely forget about it. He is a bit similar to a characterin Durarara! which is, Masaomi Kida. He wants to run away from his past but he just can't. In order to forget it they must control their emotions and face their everyday life and if they left something in the past they will surely figure it out and they try to learn from their mistakes.\\n\r\n              The art is a little similar to an anime called \"Lovely Complex\". So I liked it and it's very cute especially when the characters shows their chibi form. i absolutely adore chibi forms ^^.\\n\r\n              The sound his nostalgic and dramatic. Kind of reminds me of Fruits Basket. The opening music has a meaningful lyrics and eventually I was very captivated by the song.\\n\r\n             I enjoyed it a lot but there was something lacking about it. Something very important and that is a GOOD ending. I don't like to be a spoiler but for me the ending needs to be fixed. I wasn't thrilled because it made me realized that watching the whole series was a waste of time but eventually it wasn't because at least i learned a couple of things about life and also it made me realized that life can be harsh. Sometimes there are good and bad endings but to make the best of it we must know that we could still keep up with our future.\\n\r\n       In short... Bokura ga ita is a good anime. So to those Romantic people out there try to watch this anime it will make you cry,happy,laugh, and learn a piece of life.",
            "date": "2011-05-12T20:38:00+00:00",
            "helpful_count": 0,
            "mal_id": 36946,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/342065.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/connielas",
                "username": "connielas"
            },
            "url": "https://myanimelist.net/reviews.php?id=36946"
        },
        {
            "content": "I liked the anime but I think there could have been something better...maybe a happier ending for instance...i wanted to cry when i saw how it ended. The art isn t of premium quality but it was quite good. A really pleasant but sad story..it could have had more comedy in it in my opinion =/",
            "date": "2010-11-05T11:34:00+00:00",
            "helpful_count": 0,
            "mal_id": 31830,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/402857.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Paula_Misa-chan",
                "username": "Paula_Misa-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=31830"
        },
        {
            "content": "at first I was undecided to watch this series because...well it was said that this one is a drama. Even when I watched the first episode, I kinda think that its boring...but then I continued watching it and suddenly find myself hook in the story as well as to yano's cute smile :)...I was a little impatient in knowing what will be the next twist in the story or what the characters will do next. I finished watching it in just one whole night due to my excitement.\r\nThe art are simple but their attitude fits their look...nana-chan is really cute and yano can be veryannoying and stupid...well, all in all this series is really dramatic but its not boring...fun to watch I can say...^_^",
            "date": "2009-09-27T22:44:00+00:00",
            "helpful_count": 0,
            "mal_id": 19188,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/94273.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yHam",
                "username": "yHam"
            },
            "url": "https://myanimelist.net/reviews.php?id=19188"
        },
        {
            "content": "First I need to say this is my favorite anime (at least my fav love anime). \r\nWhat, to me, makes this anime so great and unique is that the story is very\r\nrealistic. Is what mostly happens in real life. Definitely not your typical anime love story.\r\nThe boy is not perfect, the girl isnt either and despite the problems generated by that they still fight for their love. \r\nContains tons of drama, but also has comedy so it isnt depressing at all.\r\nReeaaally enjoyable, in my opinion.\r\nBtw, the ending for some people was terrible, but to me was enough. Depends on your views about endings, i guess,or what you expect about the story.\\n\r\nOh and about the art, I found the style cute enough and acceptable, yet nothing outstanding. Soundtrack was very decent but nothing too amazing for me.\\n\r\nOverall it is a very good anime, I have watched it twice or maybe thrice hahaha. I just love everything there. It is worth at least checking out :3",
            "date": "2011-12-16T22:09:00+00:00",
            "helpful_count": 0,
            "mal_id": 49377,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1045083.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Annestecia",
                "username": "Annestecia"
            },
            "url": "https://myanimelist.net/reviews.php?id=49377"
        },
        {
            "content": "Bokura ga Ita is a light hearted romance revolving around the two main characters Nanami and Yano. While Bokura ga Ita starts out moderately promising with its enjoyable art style, sound as well as an interesting potential dramatic sub-plot it inevitably falls flat.\r\nThe art style can be best described as dreamy watercolour landscape which is pleasant and pleasing to the eyes. It has a very similar essence of Kimi no Todoke with the colours chosen as well as the character design, however the choice not to draw the eyes of characters at times tended to draw from the experience or moment portrayed. Furthermore, the sounddirection is overall fair, it does not do anything spectacular, yet it does not do anything awful.\\n\\n\r\nThere is obvious potential with the story, early within the first few episodes there are hints towards possible drama between the other side characters to possibly drive the story in an unpredicted path, or to even further develop the main characters' depth as they overcome their challenges. However that opportunity is lost, the story stays on the well beaten path of safety and goes no where interesting. There are shimmering moments which enchant the heart, but even for a light hearted romance the characters are uninspiring; despite the length of the series, the characters' progression is very shallow. \\n\\n\r\nOverall this would be something to skip over, while the artwork may be alluring, it fails to make up for the rest of the elements of the series. If you're looking for something with similar elements, but with better execution, Kimi no Todoke would be a better choice.",
            "date": "2012-01-29T01:55:00+00:00",
            "helpful_count": 0,
            "mal_id": 52787,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/472554.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/fofamit",
                "username": "fofamit"
            },
            "url": "https://myanimelist.net/reviews.php?id=52787"
        },
        {
            "content": "I'm very big on romance animes as I have watched over 20+ animes and they were all great.\r\nSomeone recommended me Bokura Ga Ita and I had no estimation as I thought it would be good.\r\nAt the very first few anime episodes, I loved it all. The relationship between the two so much that I just loved it all.\r\nBut after there was a problem where Yano kinda cheated (as Nana thinks), the story plot began to get repeatitive where Nana kept asking if Yano can talk about Nana-San.\r\nThen after all that's over, more problem is caused where Nana thinks she's not confident and blah blah blahwhere it gets me so mad that I don't tend to recommend this anime. \\n\\n\r\nOverall, I loved the voices of the attacker, I love the art, and the music but I do not much enjoy the personality of Nana and the story plot.",
            "date": "2012-06-27T07:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 64541,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/146457.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Konomi1017",
                "username": "Konomi1017"
            },
            "url": "https://myanimelist.net/reviews.php?id=64541"
        },
        {
            "content": "I cant say i dont like this anime coz i watched it once before and i got curious but the thing is i didnt catch what the title is. It took me three yrs to find this anime, okay enough of that and here's my review:\r\nI love how loveydovy the couple is. Their so fun and cute at the same time. But when it comes to the dramatic part it made me cry!! It came to me that this anime has a dramatic genre and i really dont like dramatic stuff but this one is an exception even though they separate at the end itsstill my favorite drama anime. Its a good thing this anime didnt disappoint me coz it took me 3 damn yrs to look for it!! hehe XD",
            "date": "2012-06-19T05:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 63801,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1069889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sahiko",
                "username": "Sahiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=63801"
        },
        {
            "content": "A nice anime.. and that's its bigger problem it's only nice... \r\nThere is a lot of potential in this one but in the end it's feel a little wasted and it's a shame..\r\nThe story starts in an intersting way when a new student name Yano come to school and become the interest of the girls (of course like in most animes) but one girl, Nanami, doesnt seem to know what's all the fuss about and seem to not care but until the end of the first episode shee also get caught in Yano magic and from here to the last episde it's all about theirrelationship..\\n\r\nAlthought its sounds cliche there is somthing intersting about their relationship that connects to yano ex girlfriend, Nana, who died in a car accident with her ex boyfriend.. This traumatic fact is something Yano doesnt talk about and it makes Nanami to be interested in Yano even more..\\n\r\nThe first half of the anime is great with Nanami trying to understand Yno and his feeling toward her and his ex, Nana.. Until its reaches its climax in the 12 episode.. Unfortunately after this ep the anime starts to lose it's interest and final episodes are very predicted and cliche..\\n\r\nBut overall it's not a bad anime.. It has interesting characters, avrage art and a great music.. The story in the first half is excellent and worth watching..\\n\r\nIt's also a great anime to watch with your girlfriend.. I recommand it",
            "date": "2009-08-23T11:08:00+00:00",
            "helpful_count": 0,
            "mal_id": 18015,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/190446.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LionCub",
                "username": "LionCub"
            },
            "url": "https://myanimelist.net/reviews.php?id=18015"
        }
    ]
]