[
    [
        {
            "content": "If you hate inconsistencies, stupid plot devices, a horribly flawed setting, and poor characterization, Senki Zesshou Symphogear is your worst nightmare.\r\nThe start of the series is deceptively good, we see a concert that's animated brilliantly, and we have a seemingly gritty story; we witness Kanade die in the past, and Miku crying over Hibiki's grave in the future. This image the anime painted itself in the first episode is one of the greatest deceptions I've witnessed in any form of media.\r\nAfter the first episode, the animation quality drops dramatically, at times you wonder how the producers thought they could get away with it. Epitomizing thisis a scene as early as episode 3 where Tsubasa is walking along the corridor with her manager, which looks like a GIF pasted on top of a moving background. It's obvious that they spent most of their budget on the first episode, leaving them to cut back as much as they could throughout the rest of the series. By the end they managed to get a more acceptable level of quality, which was consistent for the rest of the series, so happily it manages to avoid totally failing in the art area.\\n\\n\r\nThe soundtrack is quite enjoyable, and goes some way to make up for the animation. The songs they sing as they fight are relatively good, and it can bring an atmosphere to fights that is otherwise missing. The Opening is fine and fits the series very well, but I personally preferred the ED, \"Meteor Light\" by Takagaki Ayahi. It took a while for it to grow on me, but it's a track that sounds dark and traumatic, which fits the atmosphere the series was originally aiming for.\\n\\n\r\nThe characters are terrible, and the relationships they share change for the most bizarre of reasons. There's an instance where a character hates another one so much she's tried to kill her, but her hate is instantly forgotten when the other character points out her room is messy. Most of the characters are characterized very poorly, and the protagonist is very annoying. However, whilst this is the case, most of the cast is likable, and so you'll find yourself liking most of them, even as they go through the harsh character changes that the plot forced upon them.\\n\\n\r\nUnsurprisingly, the plot is also lacking. It's a very simple plot, the one plot twist the series has is so obvious that you can identify it 5 episode before. It's simplicity works for Symphogear's though, as it manages to avoid being too disastrous throughout most the series. However, in the final few episodes, it gets so ridiculous that you will be amazed. Stupidity like this is something that is rare, and therefore something to be treasured, as it will make you re-evaluate what you consider truly preposterous. \\n\\n\r\nThe setting is also so tremendously flawed that whilst you can happily ignore it if you so wish, even minor probing will expose questions to which there are no answers. For example, with the frequent attacks by the Noise, which you cannot defend yourself against and kill everyone in the areas they attack, why do people go outside so casually? Much as I like the outdoors, I can't hep but think that I like living more. Also, much as I love my current house, if there was constantly the threat of death, I think I'd move.\\n\\n\r\nThe inconsistencies are fairly easy to ignore, but if you think about anything in the series, you're likely to notice some. Take the Swan songs, they used to mean certain death, yet past Kanade's death, it stops being fatal, and towards the very end, there is no visible affect at all. This is of course because it was a plot device, but the unashamed way in which the anime casually allows these is dreadful.\\n\\n\r\nWith this all in mind, this is a very bad anime. However, there is one thing that works in Symphogear's favour that saves it from the worst, and that is that it's earnest in it's stupidity. It isn't trying to be taken seriously, and it isn't pretentious, which means it is very hard to hate. The characters that I hated at the start of the series grew on me, to the point I liked almost all of them. Take the girl who's lines almost solely consist of failed meta-comedy attempts like \"If this were an anime\" which infuriated me at the start, towards the end I almost found her habits endearing.\\n\\n\r\nIt's a strange quality of an anime like Symphogear, which is terrible, but still enjoyable to the extent where I looked forward to the last few episodes, to see if the episodes could outdo themselves in their silliness, but more importantly fun.\\n\\n\r\nSo, if you are happy to ignore all that is wrong with this anime, then you will be able to enjoy it. Despite the amount that is wrong with this, it's all surprisingly easy to ignore. However, if you cannot ignore the technical details in anime, then avoid this like the plague, unless you wish to see how badly executed an anime can be.",
            "date": "2012-04-03T17:26:00+00:00",
            "helpful_count": 314,
            "mal_id": 57849,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465627.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Infinite",
                "username": "Infinite"
            },
            "url": "https://myanimelist.net/reviews.php?id=57849"
        },
        {
            "content": "Since this was in storage for quite sometime I finally decided to watch, and finished this anime. This is pretty much action-y, but at the same time, it has a pretty deep story to it, and is kind of entertaining. For people that love action, I think you guys may or may not like this anime, since the action isn't really the main focus, cuz they focus more on the plot I would say..\r\nStory 8/10\r\nStarted of pretty good on how they kind of went to the future, and then goes back to what happen to get there, like a lot of anime I know. Itmoves at a good pace, and that's good since in my opinion it explained to me more about what's going on. Mostly this anime probably wants the watcher to be sad when they watch it, but it turns out to be a pretty happy story after watching all the episodes. \\n\\n\r\nArt 7/10\\n\r\nThey could make some more improvements on the way the made the characters, since in some scenes, after they got beaten up pretty badly. They came back fighting looking fresh as new in so little time. Of course, they have quick regeneration skills, but still I don't think it's suppose to be that quick. Sometimes, the motion when the character walks seems kinda unrealistic and that's, for me, a disturbing thing. \\n\\n\r\nSound 8/10\\n\r\nNot bad at the sound. The pitch when the characters scream, sweep, or are cheerful is very good. The best part of the sound I liked is the part where they make the crying of some characters pretty short. In some anime they just made the crying very long, which is pretty annoying, maybe because they want to waste time cuz they can't think of anything. \\n\\n\r\nCharacter 8/10\\n\r\nIt's great to find anime were the character doesn't piss you off so much that you just wanna smash your head into your keyboard. The characters are well made. The way they act, and talk to each other seems pretty much like real life. On top of that, a character tries to make this anime sounds like it's really \"not\" an anime, and that it was real life for them.\\n\\n\r\nEnjoyment 9/10\\n\r\nI don't really think I could say much, since I saw the rating on this anime, and it's not that good at all. For me, it was a nice experience watching this, and I don't really think a fan of a serious action would wanna watch this, since the action in this anime is not quite that great, and the moves the characters have are repeated a lot of times, and there a not a lot of new moves.\\n\\n\r\nOverall 8/10\\n\r\nI guess this is my final say on how good the anime was during my time watching it. This is, I think, a pretty girly anime.... I say that cuz of the not so violence parts ( even though there was a lot of blood ) in this anime. Maybe if they increased the intensity of the fights, that might have helped to give it a higher rating..",
            "date": "2012-07-11T21:54:00+00:00",
            "helpful_count": 100,
            "mal_id": 66159,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/128889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pakin",
                "username": "pakin"
            },
            "url": "https://myanimelist.net/reviews.php?id=66159"
        },
        {
            "content": "What a mind-blowing anime. Every bit of goodness packed in about 30 minutes of futuristic action packed visuals, eardrum blowing sound and a story that, so far looks to be heading to the right direction for one of the most viewed, most popular, eyes popping anime of the year. Fanboys rejoice, even though its only the first episode thats currently out I can already tell that this is chuck full with allot of emotions that will make you cry both for tears of joy and sadness (I had water in my eyes throughout the whole episode). The gods of anime have answered my prays anddelivered to us his blessing with Senki Zesshou Symphogear.\\n\\n\r\nNot to give too much away. The story is revolved around Hibiki Tachibana who was to go with her best friend  Miku Kohinata that couldn't make it to their first live concert to witness \"Twei Wing\" (the popular vocal group as written in the description) only to have the concert attacked by creatures called Noise. During the attack the group Twei Wing two members Tsubasa and Kanade transformed into their battle gear called 'Symphogear' to defeat and protect the people from \"Noise\" only to have something go terribly wrong (watch the anime to know what happens).\\n\\n\r\nStory thus far- 8/10 stating a flawless anime right away is just not in me)\\n\r\nArt- 10/10 (the transformations are freaking awesome)\\n\r\nSound- 10/10 (turn those sub-woofers up)\\n\r\nCharacters- 10/10 (it just started and they just lovable) no haters on board this bus\\n\\n\r\nEnd note\\n\r\nIf you love anime allot and don't watch this gtfo (just kidding this is a must see and a great series to open your year with\\n\r\nIf your new to anime I recommend this hands down two thumbs and big toes crossed.\\n\r\nyou'll not regret you picked this up",
            "date": "2012-01-07T00:31:00+00:00",
            "helpful_count": 74,
            "mal_id": 51157,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/498999.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/orbbie",
                "username": "orbbie"
            },
            "url": "https://myanimelist.net/reviews.php?id=51157"
        },
        {
            "content": "I'll be honest, this is probably what I've been most psyched for this season besides Nisemonogatari and I'll tell you why.\r\nMagical Girl meets Gundam meets The World Ends With You.\r\nOkay so maybe the ties to TWEWY are in the enemy designation only, (They're called Noise in case you hadn't guessed) but I stand by Magical Girl Gundam, even if I wasn't sure of the comparison at the beginning of the show, by the end with that 3rd transformation sequence, I was more than convinced as the parts for her suit grew out of her body.\r\nThe show starts off with a flash forward, before coming backinto the present within the first 5 minutes, before skipping time again by I'd say a few months, weeks at the least. It took a while, but at least by this point the pace settles nicely.\\n\\n\r\nI don't want to say too much, because I don't like spoiling stuff, but Symphogear is quite an amazing piece of tv deliciousness even if it isn't even nearly the best thing out there. Its stylistic, almost to the point of Shaftyness without the Shaft, fight scenes are well choreographed, the dubbing is done with an amazing grace (Although there is one point where Hibiki is running and her strained breathing sounds entirely too fake) and the musical jams that pop up every now and then brought a smile to my face.\\n\\n\r\nAt the end of the day this is only an episode 1 impression and by the end of it my tune might have changed almost entirely, but for now I say give Senki Zesshou Symphogear a shot, a this point, you won't be disappointed, except with how much of a cocktease the damn thing is.",
            "date": "2012-01-07T02:06:00+00:00",
            "helpful_count": 61,
            "mal_id": 51165,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1047279.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Maximus-San",
                "username": "Maximus-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=51165"
        },
        {
            "content": "The high hopes I had for this series were dashed after the first few minutes. The storyline felt like someone decided to animate a fanfic for a much better series. There were these honest traces of something better in the storyline. It fell flat because of the cliches within the series and because of how much of a Mary Sue the main character is.\r\nIn the first episode I was left asking why Hibiki was so special compared to all the other people who exist in this world. She's not special because she has any sort of talent, something she constantly admits. Her childhood is blandand uneventful, yet Kanade sings her Swan song in the first episode sacrificing herself just so Hibiki can live despite the fact it doesn't feel as if Kanade needed to sing her Swan song to save Hibiki's life. Instead, Kanade's death is simply a tool the writer used to give Hibiki her amazing powers so that she can be the heroine of the series.\\n\\n\r\nThe theme of sacrifice is another place where this series falls flat. At the beginning of the series it is played up as being a very important theme but by the end it honestly feels like a joke. It is instead replaced by the theme that everyone can get along by everyone talking things out. Everyone else has a mind frame that violence will solve everything, but Hibiki is difference because Hibiki is so innocent and naïve that she honestly believes there is a better way when people are human. In the long run, it is Hibiki's character that destroys the storyline.\\n\\n\r\nOf course, Hibiki does have a few flaws up her sleeves to make the viewers not think she is a Mary Sue. She is at the beginning of the series horribly klutzy and she can't do anything right. This is fine when she first gains her powers because she has problems in her first fight. However, after this she receives no training from the government so she can fight the noise, she is allowed to run around on her own letting her klutziness in the way. \\n\\n\r\nAdded to this, Tsubasa wants nothing to do with her because Hibiki reminds her too much about Kanade, and yet it would make more sense for Tsubasa to protect the one thing of Kanade she has left. Many of the characters don't get fleshed out and the way Hibiki gets over her flaw is just ridiculous. Her naivity also isn't played up as a flaw either, but it is actually her strong point as it allows her an innocent outlook on life that is willing to accept everyone who is human with no qualms what-so-ever.\\n\\n\r\nThe art is really good and the sound is good at points, but they also like to play the main characters songs as being more special then anyone elses, including the other students from a music academy of all things.",
            "date": "2012-04-02T22:36:00+00:00",
            "helpful_count": 40,
            "mal_id": 57763,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66270.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yemi_Hikari",
                "username": "Yemi_Hikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=57763"
        },
        {
            "content": "Have you ever looked forward to something that looks appealing only to be shot down? Have you ever seen a new series not based off anything else where it's simply stand alone and thought it would be good? I had these impressions only to be gunned down at point blank.\r\nOne does not simply fail to execute new.\r\nYes, I took that gag straight out of Mordor but seriously though. How do you fail to execute a rare or new idea? You make something like this, I myself thought this would have been interesting but was found on the wrong end of the spectrum. Essentially what wehave here are robotic hybrids pummeling non existent creatures while singing extremely poorly. The pacing of the story jumps back and forth too often. It's just another one of those hero super power themes that the average fanboy/fangirl can add to their fantasies.\\n\\n\r\nAn approach on the story is pretty poor, you get a glimpse of what happens from the beginning as we hear of misfortune and death. This high-tech organization forces artifacts onto young girls so they can transform into these robotic hybrids and fight the evil known as \"Noise\". That's the rare or new idea but its executed all wrong. The themes from the plot line like friendship and hard times are cooked over done so not even a bit of juice remains. It has a bit of government espionage but that's rubbish and over done as well.\\n\\n\r\nNow the art and music are more on the flashy side and distract quite too often, so much that I'm not really paying attention to whats happening. The art style is definitely flashy with the unique transformations that occur throughout scenes. Another thing that distracts me is the horrible English lines that are spat and literally translated so it makes virtually no sense. Stick to the Japanese guys, sorry if we butcher your Japanese but now we know how you feel. Another poor thing to point out would be the singing. Almost each and every one of these girls cannot sing worth a damn and its ear grinding to hear English verses.\\n\\n\r\nNow the characters are about generic as you come. The main heroines trying to save the world from evil is definitely not new by and aspect, look at things like Sailor Moon. The characters themselves almost have a shoujo-ai feeling to them and the hints are fairly obvious to anyone into the genre. The manly girl archetype isn't executed at all, they're still women even in their ancient suits of destruction. Not really any special characters that stick out in my mind.\\n\\n\r\nRealistically this failed to meet my expectations because I was somewhat looking forward to it. If you like girls beating things to a pulp though you might like it better than I did.",
            "date": "2012-03-16T12:13:00+00:00",
            "helpful_count": 36,
            "mal_id": 56095,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=56095"
        },
        {
            "content": "Ok, nothing personal this is just me, as of episode 3, I've decided to drop this anime. This is because, I find the combination of the following genres; action, fantasy, magical girl, music and sci-fi doesn't seem to be properly combined, in fact the genres seem to cancel out each other, this thing can be compared to a good movie being turned into some sissy musical stage theatrics. Ok, so there other animes that do feature songs and actions in them, true, co'z in those animes the musical is not the main genre, here on the other hand the main genres sci-fi and musical seemto don't mix at all. So for the story, I give it a \"Fair\" number 6, since the sci-fi genre could have made this anime good, but combined with the musical genre and magical girl actually puts the story down.\\n\\n\r\nArt: Mediocre number 5.\\n\r\nDon't ask, I always rate it like that.\\n\\n\r\nSound: Poor number 3.\\n\\n\r\nCo'z I don't like any of the songs and it inculdes both the opening and closing.\\n\\n\r\nCharacter: Decent number 4.\\n\\n\r\nI much rather prefer to see Hibiki and Tsubasa fighting those Noise things, than have them singing while fighting them Noise.\\n\\n\r\nEnjoyment and Overall: Poor number 3.\\n\\n\r\nI just don't like the poorly combined musical and sci-fi things that goes with this anime.\\n\\n\r\nBy the way, in most anime/manga social sites the sci-fi genre is inculded for this anime. So, if any of you have any fuss about me putting the sci-fi thing here, then I suggest that you guys go and deal with those other anime/manga social sites.\\n\\n\r\nPS: This is just me, if you dawgs like this anime, then you like it and that's that.",
            "date": "2012-02-04T11:01:00+00:00",
            "helpful_count": 29,
            "mal_id": 53211,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=53211"
        },
        {
            "content": "Despite a weak start and a weak team of writers, Symphogear still manages to be somewhat enjoyable if just for the absurdity of it all.\r\nUnfortunately it doesn't seem to deliver the type of dark story we are shown in the first episode, rather the show is riddled with Dues Ex Machinas and plot holes. The characters and their backgrounds are written at a barely passable quality, but fortunately this seems to get better as the show goes on (except for the background characters who remain terrible the entire show).\r\nFortunately I found the music, gear design and battle scenes made up for the rest of theweakness - the songs are beautiful (especially in the last episode) and full of energy and the Symphogear units remain fun to watch the entire time.\\n\\n\r\nIf you're willing to let the poor writing slide and enjoy the show for it's good qualities you'll find it enjoyable. On the other hand if plot holes, flat characters and contrived backstories are a pet peeve of yours you will probably want to avoid the show.\\n\\n\r\nThe amazingly ridiculous, absurd battles in the last three episodes made the entire show worth it for me in the end.",
            "date": "2012-04-02T13:54:00+00:00",
            "helpful_count": 25,
            "mal_id": 57713,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1148131.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/YuanMori",
                "username": "YuanMori"
            },
            "url": "https://myanimelist.net/reviews.php?id=57713"
        },
        {
            "content": "Senki Zesshou Symphogear is an odd musical, action anime featuring girls in colorful sci-fi battle suits who must fight against monsters called \"Noise\" in order to save humanity. In order to use the relics that power their Symphogear suits, the girls must sing certain songs. The different songs they sing give them different powers ranging from charging up their suit to unleashing their strongest attack which has a recoil effect on them when used.\r\nDespite a visually promising concert scene in the beginning of the first episode, the story falls to pieces almost immediately. It seems almost as if the organization working with the Symphogear girlsexpected the Noise to attack the concert where the girls were singing in order to revive a powerful relic. So why risk the lives of thousands of eager concert-goers who get caught in the fray when the Noise do show up? This may seem like a minor plot problem (aside from the hundreds of carbonized dead bodies), but similar plot issues like this build up after a while and become difficult to ignore. The two girls, Kanade and Tsubasa, who had been performing then change their songs and begin fighting the Noise in order to save the frantic mass of people who are all scrambling for the exits. However, our main protagonist, Hibiki, gets trapped while trying to get away and ends up getting injured despite the singers' efforts to save her. Since mentioning some things that happen in the first episode would be a spoiler, I'll stop the initial summary there.\\n\\n\r\nThere are many more problems with the story, but most of them occur with several sudden changes in characters' personalities in addition to the nonsensical ending. The characters in this show get over their anger at others in the most illogical ways ranging from having someone clean their room to just deciding out of nowhere that they should be friends again. The Swan Songs (which are the girls' ultimate attacks) also deal less and less of a self-damaging recoil every time they occur in the anime for some unexplained reason.\\n\\n\r\nAs for the characters themselves, they are hardly unique at all. Hibiki is basically a weaker and more annoying version of Kaname Madoka who accepts her power a bit faster (they are also both voiced by Aoi Yuki). As for the other main characters, they are a girl who likes to fight alone and dislikes Hibiki for reasons in their past and a tsuntsun girl who has a hard time understanding other people's perspectives of the world. The villain is just an annoying sadist who enjoys being nude and has no appeal aside from her excellent voice actor (who still couldn't save her from being annoying).\\n\\n\r\nBeing an anime with a heavy focus on music, you would expect a great soundtrack. While this is the strongest category, it's only barely above average. For much of the earlier episodes, the music plays almost non-stop switching from track to track with hardly any break. It got to the point where I was grateful for some of the scenes later on when they finally paused the soundtrack for part of a scene. None of the tracks stood out much either aside from one hard rock track that was used to accompany Yukine's fights. Much of the rest of the music consists of the j-pop/techno combinations used for both the songs sung by the characters' as well as the background music. There were also some problems with the volume of the music/singing when used while characters were speaking at times.\\n\\n\r\nOh, and this anime has some of the worst Engrish I've ever heard to the point where the subbers provided subs for it and even fixed the grammar at some points to make it more understandable.\\n\\n\r\nThe animation is the most inconsistent category. It looks like a quarter of the entire animation budget for this show was used during the two concert scenes. Compared to these scenes (especially around episode 3 and 4) the animation takes a nosedive. That's not to say it's all bad aside from those two scenes, however there are some moments where a single motionless shot will stay for almost twenty seconds or the animation just looks like a couple gifs pasted on top of each other. There is also one scene where a character is looking down out of a library window and sees two characters in a hospital room, but when you see out of the window from the hospital room, there is no library (or any buildings at all) in sight. Similarly to Evangelion, this anime also reuses the same shots of the main organization's headquarters many times.\\n\\n\r\nStory - 3/10\\n\r\nAnimation - 5/10\\n\r\nSound - 6/10\\n\r\nCharacters - 3/10\\n\r\nEnjoyment - 3/10\\n\r\nOverall - 4/10\\n\\n\r\nThe many faults in this series build up over time and prevent it from being very enjoyable. It's uncreative premise of saving the world from mysterious creatures which has been done much better hundreds of times doesn't allow for much right from the start. The bland characters, mediocre soundtrack despite being a music anime, and the inconsistent animation don't do much to save it either. I recommend skipping this anime and watching something like Gurren Lagann, Evangelion, or Madoka Magica if you want something similar but much better.",
            "date": "2013-12-02T20:26:00+00:00",
            "helpful_count": 22,
            "mal_id": 122383,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=122383"
        },
        {
            "content": "Senki Zesshou Symphogear is an anime surrounded by music by Nana Mizuki (not only her, but a large part is). I gave an overall score of 8, which could come from my love for the music of Nana Mizuki, but I do believe there are serious flaws in this anime. \r\nStory:\r\nThe story is the main flaw in Senki Zesshou Symphogear. I actually am impressed that they made an anime of 13 episodes which doesn't feel rushed even though quite some things happen. But the \"why\" in why are things happening is explained but when you hear it, it's kind of lame. Though the concept aroundthe \"true reason\" is actually nice. I believe they should have made is 26 episodes and not 13, this way they could have made the plot better. \\n\\n\r\nArt:\\n\r\nThe art is not especially impressive, but (and I'm trying not to spoil here) the art while fighting is different and I like it =) Though understand that while I'm saying that the art is not especially impressive, it's just that the art is at a level that I've come to expect and hope from anime. The series is well animated.\\n\\n\r\nSound:\\n\r\nWell, you've got me there. Nana Mizuki for the win! But seriously, the music is good and it gives something extra to certain scenes. They re-use songs in the anime, but what I also noticed is that some songs actually represent the growth in the characters. So besides the fact that I just like this kind of music, it was also very well chosen.\\n\\n\r\nCharacters:\\n\r\nSurprisingly for an anime with only 13 episodes, the characters go through quite some growth without feeling rushed. The feelings they portray are also quite understandable and when you think how you would feel in that person's place, you usually come to the conclusion you would probably feel the same (well, at least a part. I will never end up in the situations they end up in). \\n\\n\r\nEnjoyment:\\n\r\nFor some brainless entertainment with good music, I say yes I enjoyed it quite a lot. I found myself craving for the next episode because I just wanted to know how it would go on, but constantly had to wait another week. \\n\\n\r\nOverall:\\n\r\nLike i mentioned before, for some brainless entertainment with good music and without too much going on that you won't understand: it's good. I suppose you have to like this kind of anime, but if you do you will enjoy it. If you want an anime that's very wel thought through, with an in depth story line: this is not your anime. Since I like to have some easier animes once in a while, I enjoyed it quite a lot and perhaps even rewatch it sometime. Even though the rewatch value is quite low, as you will understand after the last episode. ;)\\n\\n\r\nWell that was my opinion on Senki Zesshou Symphogear, hope it helped =)\\n\\n\r\ncheers!",
            "date": "2012-05-01T02:49:00+00:00",
            "helpful_count": 19,
            "mal_id": 60113,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436056.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KelseyWhiteleaf",
                "username": "KelseyWhiteleaf"
            },
            "url": "https://myanimelist.net/reviews.php?id=60113"
        },
        {
            "content": "OK this is my 1st review so it's going to be really short,so let's get started.\r\nRight so you may have looked at the season anime list this year and saw this particular one and though to yourself 'hey cute girls wearing sexy Armour that's pointless cause almost 70% of the body is bare but the sword their holding is awesome' right? So you  wait for the 1st to debut.\r\nSo you watch the 1st episode and if you can tell a crappy anime by from just watching the 1st 5 minutes like me, you high expectations are dropped really low. Basically what you got isGundam meet's magical girls....or so you thought. What really get's under my skin about this anime is that not that's it cliche, but the singing while their fighting. SO instead of Gundam meet;s magical girls, you get K-On meet's Infinte Stratos with a dash of Mega Man Starforce 3.\\n\\n\r\nStory-6- Aliens or some mystical being's called noise (rip off from Mega Man Star force) randomly kill people for no reason and the only way to defend yourself against these monsters is sing, have faith and armor will randomly manifest from your body 0.o.\\n\\n\r\nArt-8- as always the seasonl anime art is very good and i was impressed :).  BUT! that's the only thing good about this anime and that's not even much.\\n\\n\r\nSound-4- sounds like wanting to shove a fork through my eardrums. The singing while fighting is probably the reason why i dropped this (no seriously the have to sing to power up....)\\n\\n\r\nCharacter-4- cliche female protagonist, nothing special, not even bothering.\\n\\n\r\nEnjoyment-1- pathetic, i tried my best to enjoy this piece of crap but couldn't.\\n\\n\r\nSo yeah, this anime at the very least is not what your going to expect period. Whether if ou expected to be good or bad. But when you try to mix moe and action, will singing and fighting you get a epic fail. Dont watch this.... unless your horny.",
            "date": "2012-02-26T13:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 54821,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XBurn",
                "username": "XBurn"
            },
            "url": "https://myanimelist.net/reviews.php?id=54821"
        },
        {
            "content": "It is said that there are seven wonders in this world, but the eighth and most important one that is often forgotten is a series that from start to finish is just a feel-good brain-off hype-fest. I dunno why all the other scores for this show are so low or what kind of no-nonsense all-business attitudes people had while watching this air, but holy crap are you missing out on a fun time if you judge this based on conventional merits.\r\nLet me give you a few tips about watching Symphogear:\r\n1. Get a drink. not a hardcore drink. Nothing with vodka. Just throw some peppermint schnoppsinto a smoothie. Or grab a hard cider. Just make sure it's fruity or sugary and that it tastes good.\\n\\n\r\n2. Set up a BIG SCREEN. Get a projector, or a massive flat-screen TV. Make sure this thing covers an entire wall.\\n\\n\r\n3. Turn UP the volume. Don't worry about your ears, they'll be dead soon anyways with the way our generation listens to music. Within a minute you won't care about the pounding pressure on your eardrums because the singing from the first scene will be like an enchanting siren luring you away from the confines of reality.\\n\\n\r\n4. Don't stop to think about anything unless that thought is incredibly stupid.\\n\\n\r\nSenki Zesshou Symphogear, a title I just shamelessly crl+c'd from the top of this page, is one of the absolutely dumbest shows out there. The show has about 3000 different tones crammed into each episode, the characters spew incomprehensible muddled philosophy and nonsense from long-forgotten action movies, the plot was seemingly written by the same guy who spearheaded Mars of Destruction, and the direction can't decide if this is an idol show or a horror movie. However, in spite of all this, Symphogear is not bad. Yes, you heard me, SYMPHOGEAR IS A GOOD SHOW, because what Symphogear is is fun, and fun is good. There is only one way to watch a show like this: to throw yourself into it completely, to get wildly over-invested in the petty drama and bullshit character turns. You can't half-ass it. I repeat, you CANNOT HALF-ASS THIS SHOW. You cannot wait for it to come to you, to entertain you through your one-in headphone and half-closed eyes. You must cast yourself into the ABYSS, and there you will discover new, nonsensical truths, such as the truth that Hibiki is in fact a Bear Grylls-Ghandi hybrid and a fucking BEAST or the truth that MY GIRL MIKU has all of the chaotic emotional complexity of an especially tormented FAULKNER PROTAGONIST and that she will go down in history as a LEGEND and a TRIUMPH over the darkness of human nature. \\n\\n\r\nIt's actually a very difficult thing to achieve, to hit the 'so stupid and nonsensical that it's hilarious' button while also holding down the 'actually care about the characters' lever, but I believe that the key lies in a couple of rather important choices Symphogear makes. First of all, it's not ALL stupid. It doesn't reinvent itself every episode or try to just spam random for kicks. It tries to stick to a central story and some cohesive character arcs that it takes very seriously, and it's the fact that Symphogear is actually tied together by something earnest and traditional that makes all of its dumb, off-the-wall moments so much more effective. Its shockingly out-of-place side plots ARE actually out of place, which makes them MUCH funnier, and the fact that it doesn't take things to the very extremes of \"wtf\" TOO often means that when it does, it's a golden chocolate treat rather than an overused device. There's an ample amount of petty melodrama in the show that keeps the overarching plot from ever being the backbone the series is resting on, which is very much a good thing. Also, the fact that the show saves all of its biggest cards for the end means that it has a legitimate build with an insane payoff, and you'll likely find yourself cheering and screaming at the screen all at once for the last four episodes straight if you're watching the show properly (as described above.) Finally though, Symphogear's greatest asset is simple and easy: clean, honest positivity. The show never gets nasty or negative, nor does it descend into the world of cheap gimmicks like questionable fan-service or out-of-nowhere dark twists. In an era polluted by cynicism, Symphogear just wants to have a good time with the characters that it loves so dearly, and THAT is invaluable.\\n\\n\r\nSo, yeah. Don't listen to the haters. Don't worry about the details. Just jump around, yell at the screen, and aggressively cheer for Chris. This show has no deep message or profound moments or original plot devices.\\n\\n\r\nIt just wants to see you grinning like an idiot.",
            "date": "2017-09-28T19:02:00+00:00",
            "helpful_count": 7,
            "mal_id": 259031,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489477.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChristopherKClaw",
                "username": "ChristopherKClaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=259031"
        },
        {
            "content": "The key to saving the world is with music and big boobs?? For real?? (͡° ͜ʖ ͡°)(͡° ͜ʖ ͡°)(͡° ͜ʖ ͡°)\r\nAs kid growing up Power Rangers, TMNT, Yu-Gi-OH, Beyblade, Digimon and Cartoon Netowork was on my favorite things in the childhood, but there was like on type of show i dislike but will give a chance in a year from here on...Sailor Moon...magical girls\r\ntransforming gals fighting other villans and magical girls ikr? However, I liket Powerpuff Girls and that was more than enough for me to care (2016 version doesn't count cus that one pissed me off) a decade later and i was still notinvested into anything girly, till 2015 when an episode of Yu-Gi-Oh! ARC-V (75) got interested in a srcrenncap when i saw this anime in 2016 and 2 years in 2018 i finaly watched Symphogear.\\n\\n\r\nUntil up to this point, I really hated the majority of Magical girl series, and I'm one of the handful of people who actually felt displeased or offput by the showings of Sailor Moon and Kill la Kill even Little Witch Academia got me mad. I'm sorry if that personal displeasure I had with such series may anger some people. Frankly there were a good girl series I did enjoy like Kill la Kill and Madoka Magica with Little Witch Academia because of the complex of the plot in those respective series.\\n\r\nNow, after watching just the first episode, the back of my mind tells me that this show called Senki Zesshou Symphogear may be something that'll change my mind about mecha series permanently by just one scene or plot point alone. I used at first think this anime was just too much with the over the top fights and Sailor Moon like transformations, but after rewatching Season 1 2 and 3 up to 3 times i kinda like them more than ever.\\n\\n\r\nSTORY: It's the typical generic girl get's powers from another person cliche just for her to fight monsters called ''Noise'' that can only be beat by Symphogear like gear type of gadget.\\n\\n\r\nART: The 2012 version had horrible animation, but 2013 version got better over time, even at it's worst, this show can be very well made. \\n\\n\r\nSOUND: The soundtracks are breathtaking and can give you the chills at the right timings. Not much else to say here...\\n\\n\r\nCHARACTERS: (BEWARE OF SOME SPOILERS) So far, the characters are pretty solid even if generic. The one character I found interesting in particular is Yukine Chris, who is another person geting her past ruined by a war whom her parents get killed and she is my favorite because of her kindness. I do like Tachibana Hibiki and Action Movie dad with Tsubasa being the only character i call okay, yet she is pretty.\\n\\n\r\nENJOYMENT: From the beginning, I didn't think I'd enjoy anything, given my past experience with previous girl animes series. I slowly grew a interest when it came down to the interactions between Bikky and her friends or enemies., which can probably be the most amusing or interesting moments in the entire series. When it came down to where their shared qualities.\\n\\n\r\nOVERALL: 10/10 for the bittersweet momemnts and well excuted scenes. I give anime a chance because it made start liking magical girl anime more often and gave Little Witch Academia a try\\n",
            "date": "2018-09-09T05:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 288575,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5435146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Helios92",
                "username": "Helios92"
            },
            "url": "https://myanimelist.net/reviews.php?id=288575"
        },
        {
            "content": "Well, Senki Zesshou Symphogear is one of the first anime to begin airing in 2012. A good head-start to gain fans' attention. This anime can combine two different anime fields : shojo with music and shonen with battle and mecha. This makes the whole anime became Divine Intervention\r\nThe story is scored A, thanks to radically different story compared to any other anime. All anime have their unique stories, but this anime featuring music and battle simultaneously instead of mere music competition. This item makes the SZS anime stands out compared to any other anime as an intersection of battle anime and music anime. Whole animethemselves is already radically different from any similar anime.\\n\r\nThe story swings from fighting against enemy (creep in DotA) then internal conflict. After the conflict resolved, encountering the real boss and case closed. All this in 13 episodes, less than adequate for the whole three major arcs while normally three major arcs will require two periods (one period == one season).\\n\\n\r\nArt is rated as A. Nothing much different from any other mecha anime. The design is somewhere a mixture of futuristic and present design. All futuristic anime usually discard the present technology, saving spaces for hi-tech which is included in the far future sub-chapter or even not written in \"Physics of the Future\" book written by Michio Kaku. This balances the penalty given in the fields of character design due to overly standard.\\n\r\nThe armor is quite similar to Infinite Stratos with minimum torso protection and good extremities protection while differs only in size and capability. With this armor, it should be easy to re-draw the characters (excluding the other class of armor which provides extra armor).\\n\r\nOne can easily distinguish the differences between concert scene and street pursuit scene from the side of animation itself. The concert scene (only twice in whole anime) is very well-drawn, almost divine intervention. On other hand, the street pursuit scene is very similar to almost identical to GTA San Andreas-era video game. Those two aspects are offsetting each other with advantage in the concert which is the main theme for the anime.\\n\\n\r\nSound is rated A. Guaranteed by Elements Garden and Nana Mizuki, Synchrogazer stands out a lot for any other anime Opening track. The other songs featured varies in type, from upbeat in 'Gyakkou no Flugel' or something likely to an aria song which is the Zesshou.\\n\r\nOther songs also gained high value because of the interest of those song (proven by high traffic in my blog for those entries). Say like 'FLIGHT FEATHERS' by Nana Mizuki and 'Tsunaida Te Dake ga Tsumugu Mono' by Ayahi Takagaki that is very well-sung.\\n\\n\r\nCharacters is rated A due to the standard design. Play it safe, S.S.D.D.. On the one hand, there is a characters dead early in the anime which can be a severe penalty. This penalty is offset by further development which result in more or less idealistic characters.\\n\\n\r\nEnjoyment is also rated A. Nothing much to be commented except the elegant battle. In some parts, there are yuri scene which can raise the score for enjoyment or reduce, depends on how one sees yuri scene. This enjoyment is also offset by partial nudity and NSFW (for some countries) battle dress.",
            "date": "2012-01-10T21:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 51485,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cruiser",
                "username": "Cruiser"
            },
            "url": "https://myanimelist.net/reviews.php?id=51485"
        },
        {
            "content": "TL;DR version: Not worth watching unless you get enjoyment from girls battling with some good weaponry and/or a huge fan of Nana Mizuki's music.\r\nSymphogear gives us the premise of an alien race that is causing havoc.  The only counter to these strange creatures is the Symphogear weapon system which the female protagonists equip themselves for battle.  While this formula for a battle anime has been done a countless number of times, what really matters is \"how\" it is done, rather than the \"what\".  Unfortunately, Symphogear clearly lacks the direction and the refinement seen in other series such as Madoka.\r\nFirstly, there is thematter of the story which is fairly average on the whole, but is destroyed by a major plot hole and the lack of refinement in the direction.  We are greeted with a significant death in the first episode, which we fully know about from the summary of this anime.  This death is caused by Kanade using \"Zesshou\", the final attack available that uses up all of one's life energy.  Unfortunately, this significance is cheapened in later episodes.  Therefore, Kanade's death becomes a rather forced plot device to get the ball rolling, rather than a necessary and significant event.\\n\\n\r\nThen there's the clear lack of refinement in the direction, as there are occasions where we get bombarded with the most terrible ENGRISH.  I mean absolutely horrific.  While the context of including the English was justified (Japanese dealing with Americans), the catastrophic lack of care in its execution just goes to show a lot.  Surely, Microsoft Word would have come up with a whole load of green wriggly lines in the planning phase of the script.\\n\\n\r\nThen we move onto the art.  Symphogear's characters have a fairly retro look with the use of strong colour shading for the hair, unlike the lighter colour tones that is more prevalent today.  While this is not bad in itself, there are issues with the use of shading, which gives an incorrect perception of a lack of detail.  Mouretsu Pirates, whose character art is far from groundbreaking uses a very simple, but effective style that shows the detailing in the character's hair.  While I am not expecting something crazy on the level of Key/KyoAni collaborations, Symphogear's shading deficiency was clearly evident in the first episode where production values was at their highest.  The fluid animation, combined with the excellent camera angles and background art looked a little odd when it was just hard to notice the character detailing.  Then we have the main character whom we of course spend a long time staring at her.  Her eyes seemed just too narrow and horizontally challenged.  This just makes it a little hard to stare at the screen, because the level of distortion was beyond tolerances that is usually seen.\\n\\n\r\nTo make it all up though, the background scenery was extremely well done with plenty of detailing and shading.  The weapon and attack design and choreography was excellent and fun to watch.  The stills, showing the main attacks of the character was a nice touch, using differing art styles that represented the character in question.\\n\\n\r\nCharacterisation.  We love seeing great characters.  Now, a significant number of teenagers tend to have mood swings and can be unstable due to the sudden rush of hormones during puberty.  Symphogear's representations of teenagers in distress seemed highly plausible.  The way they interacted and reacted were extremely appropriate and on the whole, done fairly well.  While Mary Sues on the one hand are boring, there is also unfortunately the case of annoying naivety which we see with the main character.  This naivety causes grief for the sake of it.  Her thoughts seems to mature though, and her sense of empathy is highly improved after receiving appropriate information.\\n\\n\r\n(Personal Opinion: While I don't mind seeing naive supporting characters giving the slightly more mature main character annoyance, I cannot stand it being the other way around.  Simply because the main character gets most of the screen time.  Having to live with it is just painful.)\\n\\n\r\nThe villain's characterisation unfortunately left much more to be desired.  The behaviour, course of action, and reaction felt highly amateurish, considering the number of years' life experience the villain has had.  Even the highly egotistical and corrupted Gilgamesh from the Fate universe knew when to do Ego and when to do serious battle.  Gender not revealed to prevent spoiling.\\n\\n\r\nThe sounds are the strongest point of Symphogear.  This is especially exaggerated in my case as I click extremely well with Nana Mizuki's music.  The way the music was composed suited Nana's singing style perfectly and was built around the character exceptionally well.  (I seriously believe Symphogear was made solely to make some cash out of Nana's talent).  The ending result was Macross F on steroids with highly enjoyable battles.   Not only that, but Yukine's \"badass rock\" also suited her character and attack mode extremely well.  Battle sounds were generically good, and nothing seemed amiss.  Unfortunately, the main character's music, battles and singing was just weak.  It is rather loli-ish, something which really has its place in Lucky Star, rather than a battle.\\n\\n\r\nAt the end of the day, Symphogear was built on a highly average premise.  While they did a good job with the music and weapon design, the aforementioned plot inconsistency and unpalatable main character destroys much of the viewing experience.\\n\\n\r\nFor those who click with Nana's music, her outstanding performance is more than capable of temporarily taking the viewer's attention away from the glaring flaws.  However, for those of other taste, the sound and enjoyment score would surely be lower and therefore, Symphogear is essentially 3 or 4/10 material.  Which goes back to the TL;DR version of the review - if you don't like Nana's music, don't bother with Symphogear.",
            "date": "2012-06-18T09:52:00+00:00",
            "helpful_count": 10,
            "mal_id": 63739,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91327.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/X10A_Freedom",
                "username": "X10A_Freedom"
            },
            "url": "https://myanimelist.net/reviews.php?id=63739"
        },
        {
            "content": "I am just here trying to balance out the amount of negative reviews of this anime.\r\nSenki Zesshou Symphogear (I am just gonna call it Symphogear) wasn't a very bad anime, if you want sci-fi action based anime, Symphogear is worth trying out.\r\nMy first experience watching the first episode of the anime was like \"Wow, this is the real stuff people needs to watch these days.\" Of course it was quite a let down as animation quality was dropping episode by episode but it was still watch-able to the point that you can still cope with the animation. The art style in some point would changedrastically but I think it was to create visual effects to cope with the music.\\n\\n\r\nSpeaking about music, apparently the characters sing songs when they are fighting, it was quite a hilarious concept where you're with an angry face and still managed to somewhat sing songs while fighting. The naming of the enemy units, Noise, also gave me a good laugh. The first thing in mind was that the human races doesn't like \"noises\" which was quite a pun but of course you'll get what I mean as the anime moves on.\\n\\n\r\nBody proportions in the anime are quite realistic as well each character are able to represent their personality and motive quite well. Colour can be interpreted as a strong theme as it really represents something which I would prefer the watchers to see by themselves. The animation was mind-blasting if any of you watched the 1st episode. Though don't get discouraged by the degrading of animation quality as episodes come by or so. It is still a pretty good anime with its cool moments as well as tragic touching moments.\\n\\n\r\nThe story is quite well-created in my point of view. Although it didn't reveal too much background information but it was enough to allow the story to continue. Though there are moments in the anime where there was too much talking that you pretty much made yourself to skip ahead and see if there's any more mind-blasting battle scenes. Its been hilarious everytime a character uses a special move, its like one of those Fighter games where the gameplay freezes and a banner of the move name comes flying onto the screen.\\n\\n\r\nThe music and songs are quite good. I especially liked the daft punk genre musics used in Symphogear. Generally the music is good to a point its worth downloading the character albums and put them into your iPod.\\n\\n\r\nStory - 6\\n\r\nArt - 7\\n\r\nSound - 9\\n\r\nCharacter - 8\\n\r\nEnjoyment - 8\\n\r\nOverall - 7\\n\\n\r\nThe reason why I gave Symphogear a 7 was really because of its downfall in its animation degradation as well as \"plot-killer\" moments where everything becomes boring that makes you want to skip ahead. Otherwise all other aspects were quite fascinating to watch. Though I would love to give Symphogear a rate of 8/10 due to the fact after finish watching it, it certainly does make you feel like asking \"Is there Season 2?\" (which I don't think there will be) as it left quite an imprint in memory.",
            "date": "2012-09-10T06:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 72025,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1484437.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ExHomura",
                "username": "ExHomura"
            },
            "url": "https://myanimelist.net/reviews.php?id=72025"
        },
        {
            "content": "*Review contains minor spoilers, nothing major, but proceed at your own caution.*\r\nSenki Zesshou Symphogear... I've never been so happy to have accidentally stumbled upon an anime in my life. Also, I will be speaking mainly of this anime, but I will be mentioning the following 2 seasons as well.\r\nNow, before we get going, I'd like to make it clear that this anime is nowhere near perfect. It most definitely has it's flaws, some bad animation here, some poor plot choices there, plot armor galore over yonder, I could go on. But that doesn't change the fact that this anime does one thing, and it doesit incredibly well:\\n\\n\r\nFUN.\\n\\n\r\nWhen a lot of people complain about Symphogear, I always see that they seem to take it too seriously. With that, I tell you, that you should watch this anime for pure, unadulterated, fun, explosions, and a kickass soundtrack that you're probably going to be wanting to locate and download. Which I have. All of it. So good.\\n\\n\r\nAnyways, on to the actual review.\\n\\n\r\nStory:\\n\\n\r\nIt's certainly not a bad story, there are worse ones out there, however you will see that it's rather cliche once you start getting a few episodes in. One of the worst parts about Symphogear, is it's rather cliche story, and this applies to the following seasons as well, since they all follow the same rough format that season 1 does. However, while looking at it by me saying that, it may seem rather uhh... \"meh\". But, I should also mention, that Symphogear KNOWS that it's bad. It knows that it's cliche, and it uses that to it's advantage. Yes, it's a cookie cutter that was built out of the body of season 1, and yes, seasons 2 and 3 were made with that exact same cookie cutter, but DAYUM is that a nice cookie cutter. Normally, if an anime is too cliche, it dies because the audience has seen it before (which admittedly, may very well still apply to some people when they decide to watch this) however, the other aspects of the show are what genuinely carry this anime to glory, the characters, the music, the important animation, all of that combines to patch up those nasty things that the plot just literally can't even. I should also mention that the overlying plot is only affected by this. There are a bunch of sub-plots which are actually quite unique and well thought out, for example, the backstories of the main characters.\\n\\n\r\nOverall, you've seen this plot before, and you'll know it when you see it. But the rest of the anime will more than make up for it, which is impressive considering how important plot tends to be.\\n\\n\r\nArt: 7\\n\\n\r\nI admit, the animation for this anime kinda dies at points. There's a scene where Tsubasa and her Manager are walking down a hall and rather than an animated walking animation, it is merely their unmoving bodies swaying in a small figure 8 pattern. Now, remember what I said about this series being fun? Yeah. It is. \"Bu-but, HOW could it POSSIBLY be fun with animation like THAT!?\" you may ask. Well I'll tell you, the animation for unimportant things like that walking scene, or someone writing something down on a piece of paper, THOSE are animated quite poorly sometimes. HOWEVER. The producers of this anime were smart, and funneled most of what little budget they had into the action scenes, and other important scenes. A lot of anime, even high budget anime that have all-round great animation, tend to have action scenes that are simply just as good as the rest of the anime, and when you're expecting MORE from an action scene, it can be a little underwhelming. Symphogear, with it's poor budget, knocks up the budget big time for their action scenes, making amazing looking scenes that are animated fluidly. I should also add that this anime liked to have it's action scenes on the go. While a lot of anime take a lot of camera cuts and angles in rapid succession to show a fight, which works well don't get me wrong, Symphogear does it itself a whole bunch, but they ALSO love to follow the action as it moves, meaning you'll get panning action sequences at high speed that look simply amazing (not to mention badass as hell) and really gives the viewer an impression of the speed at which the Symphogear users are fighting. While they obviously don't do this all the time, you'll see it used quite a bit, and it's a nice addition. Back to that bad animation for a moment, and also referring to when I said that people always take this anime too seriously if they hate the anime. The bad animation that pops up? It's reaally bad. So bad in fact, that it's laughable. I actually laugh at this animation, it is so bad. Now I can't forgive it for these atrocities of animation, but hey, you can always get a chuckle out of it! I should also mention that while this anime DOES have some very bad animation issues, those absolutely horrendous only pop up around 3 or 4 times in the entire anime, so they don't overly take away from it as a whole. Seasons 2 and 3 undergo a SERIOUS budget boost however, and nearly every issue that season one had in regards to animation was fixed, or improved past that.\\n\\n\r\nOverall, while this anime has some undeniable animation issues, it isn't bad enough to take away from the series enough to ruin the experience.\\n\\n\r\nSound: 10\\n\\n\r\nI'm including the soundtrack in this, it's a must. This anime is one that is in the \"Music\" genre, and normally, when you see \"Music\" tagged on to an anime, with a premise like that of Symphogear, you get frilly cute J-Pop songs, or at least, expect them. That is far from what you'll be getting out of Symphogear. Let's lead in to the  music by starting with the voice actors! Tsubasa is voiced by Nana Mizuki, whom is a very well-off musical artist in Japan. Not only does she do an excellent job of voicing the stoic Tsubasa, she carries that voice into her songs which all have an oriental theme. Nana Mizuki also created and sings the OP of each of the seasons, season 1 being \"Synchrogazer\". Aoi Yuuki voices our main Character, Hibiki Tachibana. Perhaps you've heard Aoi before, she's done quite a few roles. Tornado from One Punch Man, Madoka from Madoka Magica, Victorique from Gosick, the list goes on. Aoi isn't a song artist, however in this series, she sings all of her own songs, which is a rather impressive feat for anyone. This adds to the immersion of the series, since there is no clear difference in voice, unlike when another person sings a song in place of a voice actor. This applies to every single character in the entire Symphogear anime. Each voice actor does all of their own singing, and they do a damn fine job. Each character even has songs that are styled towards them. As mentioned, Tsubasa sings what I call \"Technoriental\"  and Hibiki sings \"Electroceltic\" technobagpipes included. Other characters are introduced later on, one of which sings aggressive rock, and in season 2, another which sings pure electronic, as well as another that sings perhaps a more punk-style of rock. Mentioning the characters further would be too large a spoiler however. Back to the actual music. Every song was crafted FOR the anime, none were taken from elsewhere. The producers made it a priority to make the music as excellent as they possibly could, as the anime revolves around music, and make it well they did indeed. I should now mention that all of these amazing songs are placed in as character songs (songs which are sung by the characters) and of course, since having characters singing all of the time would be stupid, there is regular soundtrack to go alongside it. Nothing too special about it, in all honesty. The background music you hear in scenes without characters singing is just sorta there, nothing too memorable, but not bad either. Just there. As far as voice acting goes... really well done! They got a very solid cast of voice actors, they didn't lose out anywhere there, however I should mention that ONLY the first season... has the most horrendous case of Engrish that I've ever heard. Thank god for subtitles. They gave up on attempting English in the following seasons, for good reason. As for the Japanese voice acting, emotions are portrayed very well, Hibiki always sounds like she should, cheery and upbeat, Tsubasa sounds like a strong \"don't mess with her\" type, the list goes on.\\n\\n\r\nOverall, the character songs make this anime absolutely amazing, and are one of it's biggest selling points. The background music and such isn't so up to par, but the sheer quality of the character songs truly outshine the little problems that the background music brings forth. While there was a bit of laughably bad Engrish, the voice acting was excellently done, especially with how each voice actor sings their own songs.\\n\\n\r\nCharacters: 9\\n\\n\r\nEach character is very well made, and while maybe cliche in a sense, they use cliches that haven't been milked to death. Hibiki is outgoing and cheery, which is the worst offender, however Tsubasa is a strong, stoic type, with more behind her exterior than first meets the eye. Another character may simply be passed off as a bit of a tsundere, but actually isn't, far more complex than that. Each main character has a backstory, not all of which are fully gone into in-depth, but all are at least mentioned at one point or another. Furthermore, these backstories can do a great job of defining why a character acts the way they do, and if this process ins't the one that explains it, you'll simply find out later on. Every character has a unique purpose, and each characters continues to fulfill that unique purpose effectively, without giving too much attention to any singular character. Even the side characters are well thought out, they don't FEEL like complete side characters because they actually get quite a lot of interaction with the true main characters as well as major plot elements. The villain however, is quite cliche. Like mentioned previously though, this hardly counts since the producers did this on purpose. This anime is supposed to be stupid, but handled well.\\n\\n\r\nOverall, the characters are all well thought out, and despite being less-used cliches, they have reasoning to back themselves up. Every characters does exactly what they're supposed to do, with a high degree of effectiveness, no single character could replace another. Even the side characters are given a good amount of attention. The villain is rather cliche, but it doesn't hurt too much.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nAs I have been consistently mentioning, this anime is FUN. Don't go into it for serious plot developments and incredible levels of character development, go and watch it to watch your favourite heroes beat the crap out of a bad guy. With music. I have given this anime a nickname, as have other people. \"Micheal Bay: The Musical\" There isn't a whole lot of down time in this anime, for the most part it splits up action and comedy, however it also has a few much darker elements in store for you to keep you on the edge of your seat. Drama is a thing as well, it may have been kind of forced, but it changes up the pace, so see that as you will. Regardless, the main point of this anime is lots of bright colors, explosions, awesome fight scenes, badass soundtracks, hell, even moments that could make you tear up a little bit.\\n\\n\r\nOverall, watch this for fun! If you go in expecting something serious from an anime about magical girls blowing up monsters with the power of songs and friendship, you're gonna be sad. You'll be happy to know that if you enjoyed this series the first time, it doesn't get boring easily either. So feel free to rewatch it!\\n\\n\r\nOverall: 9\\n\\n\r\nCulminating everything I've mentioned... this anime is just jolly good fun. Over-the-top fight scenes, an incredibly enjoyable soundtrack, equally likeable main characters, which all excel at doing their own thing. It's a giant blob of stupidity and cliches, yes, but it knows that and uses that as a grounds for making itself more awesome. \"Ah well, we've already used this many cliches, let's overcome this insurmountable feat with an attack powered by friendship and unicorn souls!\" and as dumb as that sounds, it doesn't get boring, it is truly something you just have to experience for yourself to understand. This anime is a great watch for practically any age, as it covers a lot of things, however, there's no real nice pretty age to acceptable watch it at. If a kid tries to watch it, there's some pretty bloody stuff that happens, if an adult watches it... it's an anime filled with magical girls! Perhaps teens can get away with it. Disregarding social standards however, this anime IS a great, fun watch, for all ages!\\n\\n\r\nExtra note:\\n\\n\r\nWhile this anime may seem to be the type, it VERY rarely sexualizes it's characters, I can recall a total of 5 scenes throughout all 3 seasons, one of which was a beach episode, another was a bath scene, both of which are anime staples. Even during transformation sequences, season 1 has next to no sexualization at all, the camera doesn't even zoom in on the characters body. Season 2, with their updated budget, opted to have a fancy camera-spinning close-up transformation scene, but even still, the camera never clearly focused on anywhere such as the butt or breasts, it just panned over them as though they were any other body part such as an elbow or a foot. Season 3 starts getting to borderline as it adds in a bit of jiggle to some characters during these sequences, but thinking realistically... I think some jiggle may happen... they certainly didn't blow it out of proportion, and even further, they kept the camera moving with no clear fanservice shots. As for actul in-fight scenes, the rules apply as if it were anime men fighting, nothing is sexualized or focused upon, if you want to see something you can look for it obviously, but it isn't shoved into your face. There are a few instances of blatant fanservice as I previously mentioned, but that count is very low. A good job goes to the producers for that decision as well, the quality of this anime would have dropped big time were it made as an ecchi.",
            "date": "2016-09-12T23:08:00+00:00",
            "helpful_count": 7,
            "mal_id": 228939,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5178511.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/awesomedude20",
                "username": "awesomedude20"
            },
            "url": "https://myanimelist.net/reviews.php?id=228939"
        },
        {
            "content": "Fellow anime connoisseurs,earlier this year we were graced by a torrent of new anime like Aquarion Evol or Guilty Crown\r\nthough the latter had its obvious weaknesses I agree that it was worthwhile watching,However this is not\r\nthe case for all of this season's new anime namely Zesshou Symphogear'whats bad about it wasn't\r\nthe 'Noise' (and no im not talking about the monsters, im talking about the 'Noise' that the characters call singing.)or the fact that the main character \r\nis a mutated pikachu with the depth of a sheet of paper nor the\r\nfact that the best character died a martyr to save this lowly abomination from the apparentlyREAL\"Noise\".\\n\r\nNo no no the problem lies when all of these elements combine into a thirteen episode animation,then eagerly advertised to us,anime enthusiasts\\n\r\nonly to totally annihilate those high expectations we built up for it.I no longer acknowledge Symphogear as anime,for doing so is\\n\r\nan insult to anime itself.\\n\\n\r\nStory:1\\n\r\nThe Story very inconsistent though this normally doesn't matter for the earlier episodes where it usually builds up suspense,\\n\r\nthe problem is that those inconsistencies don't get resolved either, Like why didn't Tsubasa die when she sung her swan song?\\n\r\nthis is probably what the writers were thinking:\"Tsubasa gets the high ratings,Screw the story we can't kill her off\"\\n\r\nim sure everyone else is trying to be politically correct by giving it a three or four out of pity but I'm giving it a one because 'Pathetic'\\n\r\nis the perfect adjective to this story.\\n\\n\r\nArt/Setting:4\\n\r\nI will admit Tsubasas gears (despite the training wheels on the back)is designed well and the cityscape as well,take the concert hall,it looks awesome but on \\n\r\ncloser examination I think the only reason the crowd is getting excited is for the constant Tsubasa Up-skirt throughout the concert...\\n\r\nBut thats ok,so the architecture is bad,the art is still OK right?\\n\r\nN.O. they spent their entire design budget on Tsubasa and the concert hall,just look the commander hes an part Irish part Zimbabwean part Japanese dude,they basically\\n\r\nused 'Paint'(the Application) to draw him.\\n\\n\r\nSound:1\\n\r\nIM TIRED OF LISTENING TO YOUR DAMN SONG!and the transformation sequences - un en iwe an en we tuo...are you sure\\n\r\nthat's still Japanese?Like I think it would make a lot more sense to say:\"I will Digivolve too!\".\\n\\n\r\nCharacter:2\\n\r\nI said before that Hibiki had the depth of a sheet of paper,well if you put the entire cast together, you will have a small stack of printer paper about 2mm\\n\r\nin total depth.\\n\r\nI mean how much do you know about each individual character,Lets take Yukine Chris because we haven't mentioned her yet-\\n\r\nChris's past is a series of unfortunate events,Her parents died so she stole and eventually turned to terrorism.THE END.\\n\r\nwow so complex*cough*.\\n\\n\r\nEnjoyment:1\\n\r\nI was actually forced through this anime,one of my friends forced me to watch this on a weekly basis,im serious he was like-\"I know where you live,so you better \\n\r\nwatch it\"so partly because of that I didn't enjoy this abomination too much.\\n\r\nThat said this anime was an Abomination with or without my friends help,it helped me define the new limits of bad in the anime world.\\n\r\nwhenever my friend gives me anime I would ask:\"is it better than Symphogear?\"\\n\r\nSymphogear is simply that bad.\\n\\n\r\nOverall:I actually want to give this a negative score because I want my 6.5 hours I spent on this anime back, but since I can only give it a one as a minimum\\n\r\nthe anime got off easy.\\n\\n\r\nQuite frankly from an economic students point of view this anime should be classed as a \"demerit good\"in that it is detrimental to society itself,in fact one day\\n\r\nim sure it will replace that atomic bomb as a new weapon of mass destruction.I Loath it ,I Hate it ,I Pity it for becoming so deformed.\\n\r\nTo my patient anime brethren I bid you adieu for I will see to it that 'Senki Zesshou Symphogear' Burns in Hell.",
            "date": "2012-05-09T03:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 60877,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1232373.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Knightmaretiger",
                "username": "Knightmaretiger"
            },
            "url": "https://myanimelist.net/reviews.php?id=60877"
        },
        {
            "content": "Symphogear is literally one of the best anime I've ever watched. The story was laid out amazingly and the characters were awesome.\r\nStarting off with the story, it was truly awesome. So, the story basically starts with ZweiWing performing a concert, but suddenly the Noise attack and nearly kill the protagonist however, Kanade sacrifices herself using her “Zesshou” to save Hibiki’s life. This is, truly, an amazing way to start off the story as it introduces the viewer to the main characters but also creates an uneasy and upsetting atmosphere.\r\n          Then, as the story continues, Hibiki (nowwith Kanade’s power) and Tsubasa encounter Chris Yukine who uses the Nehustan Armor but later the relic Ichaival. (I’m really trying not to give any spoilers) And later (AKA the final episode) they sacrifice themselves to stop the chunk of moon from destroying their town, only to have faked their death in order to protect their friends. This made me cry so much ) ;\\n\\n\r\nNow going to the characters, let’s start off with the main protagonist: Tachibana Hibiki. Hibiki, two years ago, nearly died due to the piece of the Gungnir Relic entering her heart tissue. Hibiki is one of the coolest I have seen in an anime, however, she can be rather annoying. Then we go to the veteran user of the team, Kazanari Tsubasa. Tsubasa, before Kanade’s sacrifice, was originally shy and introverted but usually depended on Kanade to lift up her spirits. Then, after Kanade’s sacrifice; Tsubasa became, how she describes, “like a sword” being cold and independant. I find Tsubasa really cool, and now we go to the most awesome of the team: Yukine Chris! *gives Chris a medal for being the most awesome Symphogear character in existence* Chris is truly pure awesomeness.\\n\\n\r\nAnd then finally: the music The music in this series has no other word to describe it but utter awesomeness. By the way, Chris' songs are the best; no joke",
            "date": "2017-06-18T01:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 250212,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6197970.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cure_Felice",
                "username": "Cure_Felice"
            },
            "url": "https://myanimelist.net/reviews.php?id=250212"
        },
        {
            "content": "My friends deem this unwatchable, and I don't blame them, nor would I anyone else who says it's unwatchable.\r\nHowever I find it somehow enthralling. Something about the combination of the music and the fight scenes generates an exaggerated hype that I love.\r\nThere is lots of edge and qq, which would normally ruin a series, but its done in a way that either the scene can be skipped without missing anything important. Or it's so overdone that it's funny, using tropes like 'They are powered by friendship!'\r\nThe art style heavily reminds me of Megaman, while still being original.\r\nThe nameless villains look like some sort of uglykidsmeal toys that were likely designed by a different artist.\\n\\n\r\nThere is lots wrong with it, especially the angsty character development, but the ultra-flashiness of the fights makes up for it.\\n\r\nThe macro-plot is surprisingly very good, although there is very little of it.\\n\\n\r\nAs long as you don't take it too seriously then it's very enjoyable.",
            "date": "2015-09-03T11:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 197743,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4629474.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khlorghaal",
                "username": "khlorghaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=197743"
        }
    ],
    [
        {
            "content": "If you hate inconsistencies, stupid plot devices, a horribly flawed setting, and poor characterization, Senki Zesshou Symphogear is your worst nightmare.\r\nThe start of the series is deceptively good, we see a concert that's animated brilliantly, and we have a seemingly gritty story; we witness Kanade die in the past, and Miku crying over Hibiki's grave in the future. This image the anime painted itself in the first episode is one of the greatest deceptions I've witnessed in any form of media.\r\nAfter the first episode, the animation quality drops dramatically, at times you wonder how the producers thought they could get away with it. Epitomizing thisis a scene as early as episode 3 where Tsubasa is walking along the corridor with her manager, which looks like a GIF pasted on top of a moving background. It's obvious that they spent most of their budget on the first episode, leaving them to cut back as much as they could throughout the rest of the series. By the end they managed to get a more acceptable level of quality, which was consistent for the rest of the series, so happily it manages to avoid totally failing in the art area.\\n\\n\r\nThe soundtrack is quite enjoyable, and goes some way to make up for the animation. The songs they sing as they fight are relatively good, and it can bring an atmosphere to fights that is otherwise missing. The Opening is fine and fits the series very well, but I personally preferred the ED, \"Meteor Light\" by Takagaki Ayahi. It took a while for it to grow on me, but it's a track that sounds dark and traumatic, which fits the atmosphere the series was originally aiming for.\\n\\n\r\nThe characters are terrible, and the relationships they share change for the most bizarre of reasons. There's an instance where a character hates another one so much she's tried to kill her, but her hate is instantly forgotten when the other character points out her room is messy. Most of the characters are characterized very poorly, and the protagonist is very annoying. However, whilst this is the case, most of the cast is likable, and so you'll find yourself liking most of them, even as they go through the harsh character changes that the plot forced upon them.\\n\\n\r\nUnsurprisingly, the plot is also lacking. It's a very simple plot, the one plot twist the series has is so obvious that you can identify it 5 episode before. It's simplicity works for Symphogear's though, as it manages to avoid being too disastrous throughout most the series. However, in the final few episodes, it gets so ridiculous that you will be amazed. Stupidity like this is something that is rare, and therefore something to be treasured, as it will make you re-evaluate what you consider truly preposterous. \\n\\n\r\nThe setting is also so tremendously flawed that whilst you can happily ignore it if you so wish, even minor probing will expose questions to which there are no answers. For example, with the frequent attacks by the Noise, which you cannot defend yourself against and kill everyone in the areas they attack, why do people go outside so casually? Much as I like the outdoors, I can't hep but think that I like living more. Also, much as I love my current house, if there was constantly the threat of death, I think I'd move.\\n\\n\r\nThe inconsistencies are fairly easy to ignore, but if you think about anything in the series, you're likely to notice some. Take the Swan songs, they used to mean certain death, yet past Kanade's death, it stops being fatal, and towards the very end, there is no visible affect at all. This is of course because it was a plot device, but the unashamed way in which the anime casually allows these is dreadful.\\n\\n\r\nWith this all in mind, this is a very bad anime. However, there is one thing that works in Symphogear's favour that saves it from the worst, and that is that it's earnest in it's stupidity. It isn't trying to be taken seriously, and it isn't pretentious, which means it is very hard to hate. The characters that I hated at the start of the series grew on me, to the point I liked almost all of them. Take the girl who's lines almost solely consist of failed meta-comedy attempts like \"If this were an anime\" which infuriated me at the start, towards the end I almost found her habits endearing.\\n\\n\r\nIt's a strange quality of an anime like Symphogear, which is terrible, but still enjoyable to the extent where I looked forward to the last few episodes, to see if the episodes could outdo themselves in their silliness, but more importantly fun.\\n\\n\r\nSo, if you are happy to ignore all that is wrong with this anime, then you will be able to enjoy it. Despite the amount that is wrong with this, it's all surprisingly easy to ignore. However, if you cannot ignore the technical details in anime, then avoid this like the plague, unless you wish to see how badly executed an anime can be.",
            "date": "2012-04-03T17:26:00+00:00",
            "helpful_count": 314,
            "mal_id": 57849,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465627.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Infinite",
                "username": "Infinite"
            },
            "url": "https://myanimelist.net/reviews.php?id=57849"
        },
        {
            "content": "Since this was in storage for quite sometime I finally decided to watch, and finished this anime. This is pretty much action-y, but at the same time, it has a pretty deep story to it, and is kind of entertaining. For people that love action, I think you guys may or may not like this anime, since the action isn't really the main focus, cuz they focus more on the plot I would say..\r\nStory 8/10\r\nStarted of pretty good on how they kind of went to the future, and then goes back to what happen to get there, like a lot of anime I know. Itmoves at a good pace, and that's good since in my opinion it explained to me more about what's going on. Mostly this anime probably wants the watcher to be sad when they watch it, but it turns out to be a pretty happy story after watching all the episodes. \\n\\n\r\nArt 7/10\\n\r\nThey could make some more improvements on the way the made the characters, since in some scenes, after they got beaten up pretty badly. They came back fighting looking fresh as new in so little time. Of course, they have quick regeneration skills, but still I don't think it's suppose to be that quick. Sometimes, the motion when the character walks seems kinda unrealistic and that's, for me, a disturbing thing. \\n\\n\r\nSound 8/10\\n\r\nNot bad at the sound. The pitch when the characters scream, sweep, or are cheerful is very good. The best part of the sound I liked is the part where they make the crying of some characters pretty short. In some anime they just made the crying very long, which is pretty annoying, maybe because they want to waste time cuz they can't think of anything. \\n\\n\r\nCharacter 8/10\\n\r\nIt's great to find anime were the character doesn't piss you off so much that you just wanna smash your head into your keyboard. The characters are well made. The way they act, and talk to each other seems pretty much like real life. On top of that, a character tries to make this anime sounds like it's really \"not\" an anime, and that it was real life for them.\\n\\n\r\nEnjoyment 9/10\\n\r\nI don't really think I could say much, since I saw the rating on this anime, and it's not that good at all. For me, it was a nice experience watching this, and I don't really think a fan of a serious action would wanna watch this, since the action in this anime is not quite that great, and the moves the characters have are repeated a lot of times, and there a not a lot of new moves.\\n\\n\r\nOverall 8/10\\n\r\nI guess this is my final say on how good the anime was during my time watching it. This is, I think, a pretty girly anime.... I say that cuz of the not so violence parts ( even though there was a lot of blood ) in this anime. Maybe if they increased the intensity of the fights, that might have helped to give it a higher rating..",
            "date": "2012-07-11T21:54:00+00:00",
            "helpful_count": 100,
            "mal_id": 66159,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/128889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pakin",
                "username": "pakin"
            },
            "url": "https://myanimelist.net/reviews.php?id=66159"
        },
        {
            "content": "What a mind-blowing anime. Every bit of goodness packed in about 30 minutes of futuristic action packed visuals, eardrum blowing sound and a story that, so far looks to be heading to the right direction for one of the most viewed, most popular, eyes popping anime of the year. Fanboys rejoice, even though its only the first episode thats currently out I can already tell that this is chuck full with allot of emotions that will make you cry both for tears of joy and sadness (I had water in my eyes throughout the whole episode). The gods of anime have answered my prays anddelivered to us his blessing with Senki Zesshou Symphogear.\\n\\n\r\nNot to give too much away. The story is revolved around Hibiki Tachibana who was to go with her best friend  Miku Kohinata that couldn't make it to their first live concert to witness \"Twei Wing\" (the popular vocal group as written in the description) only to have the concert attacked by creatures called Noise. During the attack the group Twei Wing two members Tsubasa and Kanade transformed into their battle gear called 'Symphogear' to defeat and protect the people from \"Noise\" only to have something go terribly wrong (watch the anime to know what happens).\\n\\n\r\nStory thus far- 8/10 stating a flawless anime right away is just not in me)\\n\r\nArt- 10/10 (the transformations are freaking awesome)\\n\r\nSound- 10/10 (turn those sub-woofers up)\\n\r\nCharacters- 10/10 (it just started and they just lovable) no haters on board this bus\\n\\n\r\nEnd note\\n\r\nIf you love anime allot and don't watch this gtfo (just kidding this is a must see and a great series to open your year with\\n\r\nIf your new to anime I recommend this hands down two thumbs and big toes crossed.\\n\r\nyou'll not regret you picked this up",
            "date": "2012-01-07T00:31:00+00:00",
            "helpful_count": 74,
            "mal_id": 51157,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/498999.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/orbbie",
                "username": "orbbie"
            },
            "url": "https://myanimelist.net/reviews.php?id=51157"
        },
        {
            "content": "I'll be honest, this is probably what I've been most psyched for this season besides Nisemonogatari and I'll tell you why.\r\nMagical Girl meets Gundam meets The World Ends With You.\r\nOkay so maybe the ties to TWEWY are in the enemy designation only, (They're called Noise in case you hadn't guessed) but I stand by Magical Girl Gundam, even if I wasn't sure of the comparison at the beginning of the show, by the end with that 3rd transformation sequence, I was more than convinced as the parts for her suit grew out of her body.\r\nThe show starts off with a flash forward, before coming backinto the present within the first 5 minutes, before skipping time again by I'd say a few months, weeks at the least. It took a while, but at least by this point the pace settles nicely.\\n\\n\r\nI don't want to say too much, because I don't like spoiling stuff, but Symphogear is quite an amazing piece of tv deliciousness even if it isn't even nearly the best thing out there. Its stylistic, almost to the point of Shaftyness without the Shaft, fight scenes are well choreographed, the dubbing is done with an amazing grace (Although there is one point where Hibiki is running and her strained breathing sounds entirely too fake) and the musical jams that pop up every now and then brought a smile to my face.\\n\\n\r\nAt the end of the day this is only an episode 1 impression and by the end of it my tune might have changed almost entirely, but for now I say give Senki Zesshou Symphogear a shot, a this point, you won't be disappointed, except with how much of a cocktease the damn thing is.",
            "date": "2012-01-07T02:06:00+00:00",
            "helpful_count": 61,
            "mal_id": 51165,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1047279.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Maximus-San",
                "username": "Maximus-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=51165"
        },
        {
            "content": "The high hopes I had for this series were dashed after the first few minutes. The storyline felt like someone decided to animate a fanfic for a much better series. There were these honest traces of something better in the storyline. It fell flat because of the cliches within the series and because of how much of a Mary Sue the main character is.\r\nIn the first episode I was left asking why Hibiki was so special compared to all the other people who exist in this world. She's not special because she has any sort of talent, something she constantly admits. Her childhood is blandand uneventful, yet Kanade sings her Swan song in the first episode sacrificing herself just so Hibiki can live despite the fact it doesn't feel as if Kanade needed to sing her Swan song to save Hibiki's life. Instead, Kanade's death is simply a tool the writer used to give Hibiki her amazing powers so that she can be the heroine of the series.\\n\\n\r\nThe theme of sacrifice is another place where this series falls flat. At the beginning of the series it is played up as being a very important theme but by the end it honestly feels like a joke. It is instead replaced by the theme that everyone can get along by everyone talking things out. Everyone else has a mind frame that violence will solve everything, but Hibiki is difference because Hibiki is so innocent and naïve that she honestly believes there is a better way when people are human. In the long run, it is Hibiki's character that destroys the storyline.\\n\\n\r\nOf course, Hibiki does have a few flaws up her sleeves to make the viewers not think she is a Mary Sue. She is at the beginning of the series horribly klutzy and she can't do anything right. This is fine when she first gains her powers because she has problems in her first fight. However, after this she receives no training from the government so she can fight the noise, she is allowed to run around on her own letting her klutziness in the way. \\n\\n\r\nAdded to this, Tsubasa wants nothing to do with her because Hibiki reminds her too much about Kanade, and yet it would make more sense for Tsubasa to protect the one thing of Kanade she has left. Many of the characters don't get fleshed out and the way Hibiki gets over her flaw is just ridiculous. Her naivity also isn't played up as a flaw either, but it is actually her strong point as it allows her an innocent outlook on life that is willing to accept everyone who is human with no qualms what-so-ever.\\n\\n\r\nThe art is really good and the sound is good at points, but they also like to play the main characters songs as being more special then anyone elses, including the other students from a music academy of all things.",
            "date": "2012-04-02T22:36:00+00:00",
            "helpful_count": 40,
            "mal_id": 57763,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66270.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yemi_Hikari",
                "username": "Yemi_Hikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=57763"
        },
        {
            "content": "Have you ever looked forward to something that looks appealing only to be shot down? Have you ever seen a new series not based off anything else where it's simply stand alone and thought it would be good? I had these impressions only to be gunned down at point blank.\r\nOne does not simply fail to execute new.\r\nYes, I took that gag straight out of Mordor but seriously though. How do you fail to execute a rare or new idea? You make something like this, I myself thought this would have been interesting but was found on the wrong end of the spectrum. Essentially what wehave here are robotic hybrids pummeling non existent creatures while singing extremely poorly. The pacing of the story jumps back and forth too often. It's just another one of those hero super power themes that the average fanboy/fangirl can add to their fantasies.\\n\\n\r\nAn approach on the story is pretty poor, you get a glimpse of what happens from the beginning as we hear of misfortune and death. This high-tech organization forces artifacts onto young girls so they can transform into these robotic hybrids and fight the evil known as \"Noise\". That's the rare or new idea but its executed all wrong. The themes from the plot line like friendship and hard times are cooked over done so not even a bit of juice remains. It has a bit of government espionage but that's rubbish and over done as well.\\n\\n\r\nNow the art and music are more on the flashy side and distract quite too often, so much that I'm not really paying attention to whats happening. The art style is definitely flashy with the unique transformations that occur throughout scenes. Another thing that distracts me is the horrible English lines that are spat and literally translated so it makes virtually no sense. Stick to the Japanese guys, sorry if we butcher your Japanese but now we know how you feel. Another poor thing to point out would be the singing. Almost each and every one of these girls cannot sing worth a damn and its ear grinding to hear English verses.\\n\\n\r\nNow the characters are about generic as you come. The main heroines trying to save the world from evil is definitely not new by and aspect, look at things like Sailor Moon. The characters themselves almost have a shoujo-ai feeling to them and the hints are fairly obvious to anyone into the genre. The manly girl archetype isn't executed at all, they're still women even in their ancient suits of destruction. Not really any special characters that stick out in my mind.\\n\\n\r\nRealistically this failed to meet my expectations because I was somewhat looking forward to it. If you like girls beating things to a pulp though you might like it better than I did.",
            "date": "2012-03-16T12:13:00+00:00",
            "helpful_count": 36,
            "mal_id": 56095,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=56095"
        },
        {
            "content": "Ok, nothing personal this is just me, as of episode 3, I've decided to drop this anime. This is because, I find the combination of the following genres; action, fantasy, magical girl, music and sci-fi doesn't seem to be properly combined, in fact the genres seem to cancel out each other, this thing can be compared to a good movie being turned into some sissy musical stage theatrics. Ok, so there other animes that do feature songs and actions in them, true, co'z in those animes the musical is not the main genre, here on the other hand the main genres sci-fi and musical seemto don't mix at all. So for the story, I give it a \"Fair\" number 6, since the sci-fi genre could have made this anime good, but combined with the musical genre and magical girl actually puts the story down.\\n\\n\r\nArt: Mediocre number 5.\\n\r\nDon't ask, I always rate it like that.\\n\\n\r\nSound: Poor number 3.\\n\\n\r\nCo'z I don't like any of the songs and it inculdes both the opening and closing.\\n\\n\r\nCharacter: Decent number 4.\\n\\n\r\nI much rather prefer to see Hibiki and Tsubasa fighting those Noise things, than have them singing while fighting them Noise.\\n\\n\r\nEnjoyment and Overall: Poor number 3.\\n\\n\r\nI just don't like the poorly combined musical and sci-fi things that goes with this anime.\\n\\n\r\nBy the way, in most anime/manga social sites the sci-fi genre is inculded for this anime. So, if any of you have any fuss about me putting the sci-fi thing here, then I suggest that you guys go and deal with those other anime/manga social sites.\\n\\n\r\nPS: This is just me, if you dawgs like this anime, then you like it and that's that.",
            "date": "2012-02-04T11:01:00+00:00",
            "helpful_count": 29,
            "mal_id": 53211,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=53211"
        },
        {
            "content": "Despite a weak start and a weak team of writers, Symphogear still manages to be somewhat enjoyable if just for the absurdity of it all.\r\nUnfortunately it doesn't seem to deliver the type of dark story we are shown in the first episode, rather the show is riddled with Dues Ex Machinas and plot holes. The characters and their backgrounds are written at a barely passable quality, but fortunately this seems to get better as the show goes on (except for the background characters who remain terrible the entire show).\r\nFortunately I found the music, gear design and battle scenes made up for the rest of theweakness - the songs are beautiful (especially in the last episode) and full of energy and the Symphogear units remain fun to watch the entire time.\\n\\n\r\nIf you're willing to let the poor writing slide and enjoy the show for it's good qualities you'll find it enjoyable. On the other hand if plot holes, flat characters and contrived backstories are a pet peeve of yours you will probably want to avoid the show.\\n\\n\r\nThe amazingly ridiculous, absurd battles in the last three episodes made the entire show worth it for me in the end.",
            "date": "2012-04-02T13:54:00+00:00",
            "helpful_count": 25,
            "mal_id": 57713,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1148131.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/YuanMori",
                "username": "YuanMori"
            },
            "url": "https://myanimelist.net/reviews.php?id=57713"
        },
        {
            "content": "Senki Zesshou Symphogear is an odd musical, action anime featuring girls in colorful sci-fi battle suits who must fight against monsters called \"Noise\" in order to save humanity. In order to use the relics that power their Symphogear suits, the girls must sing certain songs. The different songs they sing give them different powers ranging from charging up their suit to unleashing their strongest attack which has a recoil effect on them when used.\r\nDespite a visually promising concert scene in the beginning of the first episode, the story falls to pieces almost immediately. It seems almost as if the organization working with the Symphogear girlsexpected the Noise to attack the concert where the girls were singing in order to revive a powerful relic. So why risk the lives of thousands of eager concert-goers who get caught in the fray when the Noise do show up? This may seem like a minor plot problem (aside from the hundreds of carbonized dead bodies), but similar plot issues like this build up after a while and become difficult to ignore. The two girls, Kanade and Tsubasa, who had been performing then change their songs and begin fighting the Noise in order to save the frantic mass of people who are all scrambling for the exits. However, our main protagonist, Hibiki, gets trapped while trying to get away and ends up getting injured despite the singers' efforts to save her. Since mentioning some things that happen in the first episode would be a spoiler, I'll stop the initial summary there.\\n\\n\r\nThere are many more problems with the story, but most of them occur with several sudden changes in characters' personalities in addition to the nonsensical ending. The characters in this show get over their anger at others in the most illogical ways ranging from having someone clean their room to just deciding out of nowhere that they should be friends again. The Swan Songs (which are the girls' ultimate attacks) also deal less and less of a self-damaging recoil every time they occur in the anime for some unexplained reason.\\n\\n\r\nAs for the characters themselves, they are hardly unique at all. Hibiki is basically a weaker and more annoying version of Kaname Madoka who accepts her power a bit faster (they are also both voiced by Aoi Yuki). As for the other main characters, they are a girl who likes to fight alone and dislikes Hibiki for reasons in their past and a tsuntsun girl who has a hard time understanding other people's perspectives of the world. The villain is just an annoying sadist who enjoys being nude and has no appeal aside from her excellent voice actor (who still couldn't save her from being annoying).\\n\\n\r\nBeing an anime with a heavy focus on music, you would expect a great soundtrack. While this is the strongest category, it's only barely above average. For much of the earlier episodes, the music plays almost non-stop switching from track to track with hardly any break. It got to the point where I was grateful for some of the scenes later on when they finally paused the soundtrack for part of a scene. None of the tracks stood out much either aside from one hard rock track that was used to accompany Yukine's fights. Much of the rest of the music consists of the j-pop/techno combinations used for both the songs sung by the characters' as well as the background music. There were also some problems with the volume of the music/singing when used while characters were speaking at times.\\n\\n\r\nOh, and this anime has some of the worst Engrish I've ever heard to the point where the subbers provided subs for it and even fixed the grammar at some points to make it more understandable.\\n\\n\r\nThe animation is the most inconsistent category. It looks like a quarter of the entire animation budget for this show was used during the two concert scenes. Compared to these scenes (especially around episode 3 and 4) the animation takes a nosedive. That's not to say it's all bad aside from those two scenes, however there are some moments where a single motionless shot will stay for almost twenty seconds or the animation just looks like a couple gifs pasted on top of each other. There is also one scene where a character is looking down out of a library window and sees two characters in a hospital room, but when you see out of the window from the hospital room, there is no library (or any buildings at all) in sight. Similarly to Evangelion, this anime also reuses the same shots of the main organization's headquarters many times.\\n\\n\r\nStory - 3/10\\n\r\nAnimation - 5/10\\n\r\nSound - 6/10\\n\r\nCharacters - 3/10\\n\r\nEnjoyment - 3/10\\n\r\nOverall - 4/10\\n\\n\r\nThe many faults in this series build up over time and prevent it from being very enjoyable. It's uncreative premise of saving the world from mysterious creatures which has been done much better hundreds of times doesn't allow for much right from the start. The bland characters, mediocre soundtrack despite being a music anime, and the inconsistent animation don't do much to save it either. I recommend skipping this anime and watching something like Gurren Lagann, Evangelion, or Madoka Magica if you want something similar but much better.",
            "date": "2013-12-02T20:26:00+00:00",
            "helpful_count": 22,
            "mal_id": 122383,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=122383"
        },
        {
            "content": "Senki Zesshou Symphogear is an anime surrounded by music by Nana Mizuki (not only her, but a large part is). I gave an overall score of 8, which could come from my love for the music of Nana Mizuki, but I do believe there are serious flaws in this anime. \r\nStory:\r\nThe story is the main flaw in Senki Zesshou Symphogear. I actually am impressed that they made an anime of 13 episodes which doesn't feel rushed even though quite some things happen. But the \"why\" in why are things happening is explained but when you hear it, it's kind of lame. Though the concept aroundthe \"true reason\" is actually nice. I believe they should have made is 26 episodes and not 13, this way they could have made the plot better. \\n\\n\r\nArt:\\n\r\nThe art is not especially impressive, but (and I'm trying not to spoil here) the art while fighting is different and I like it =) Though understand that while I'm saying that the art is not especially impressive, it's just that the art is at a level that I've come to expect and hope from anime. The series is well animated.\\n\\n\r\nSound:\\n\r\nWell, you've got me there. Nana Mizuki for the win! But seriously, the music is good and it gives something extra to certain scenes. They re-use songs in the anime, but what I also noticed is that some songs actually represent the growth in the characters. So besides the fact that I just like this kind of music, it was also very well chosen.\\n\\n\r\nCharacters:\\n\r\nSurprisingly for an anime with only 13 episodes, the characters go through quite some growth without feeling rushed. The feelings they portray are also quite understandable and when you think how you would feel in that person's place, you usually come to the conclusion you would probably feel the same (well, at least a part. I will never end up in the situations they end up in). \\n\\n\r\nEnjoyment:\\n\r\nFor some brainless entertainment with good music, I say yes I enjoyed it quite a lot. I found myself craving for the next episode because I just wanted to know how it would go on, but constantly had to wait another week. \\n\\n\r\nOverall:\\n\r\nLike i mentioned before, for some brainless entertainment with good music and without too much going on that you won't understand: it's good. I suppose you have to like this kind of anime, but if you do you will enjoy it. If you want an anime that's very wel thought through, with an in depth story line: this is not your anime. Since I like to have some easier animes once in a while, I enjoyed it quite a lot and perhaps even rewatch it sometime. Even though the rewatch value is quite low, as you will understand after the last episode. ;)\\n\\n\r\nWell that was my opinion on Senki Zesshou Symphogear, hope it helped =)\\n\\n\r\ncheers!",
            "date": "2012-05-01T02:49:00+00:00",
            "helpful_count": 19,
            "mal_id": 60113,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436056.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KelseyWhiteleaf",
                "username": "KelseyWhiteleaf"
            },
            "url": "https://myanimelist.net/reviews.php?id=60113"
        },
        {
            "content": "OK this is my 1st review so it's going to be really short,so let's get started.\r\nRight so you may have looked at the season anime list this year and saw this particular one and though to yourself 'hey cute girls wearing sexy Armour that's pointless cause almost 70% of the body is bare but the sword their holding is awesome' right? So you  wait for the 1st to debut.\r\nSo you watch the 1st episode and if you can tell a crappy anime by from just watching the 1st 5 minutes like me, you high expectations are dropped really low. Basically what you got isGundam meet's magical girls....or so you thought. What really get's under my skin about this anime is that not that's it cliche, but the singing while their fighting. SO instead of Gundam meet;s magical girls, you get K-On meet's Infinte Stratos with a dash of Mega Man Starforce 3.\\n\\n\r\nStory-6- Aliens or some mystical being's called noise (rip off from Mega Man Star force) randomly kill people for no reason and the only way to defend yourself against these monsters is sing, have faith and armor will randomly manifest from your body 0.o.\\n\\n\r\nArt-8- as always the seasonl anime art is very good and i was impressed :).  BUT! that's the only thing good about this anime and that's not even much.\\n\\n\r\nSound-4- sounds like wanting to shove a fork through my eardrums. The singing while fighting is probably the reason why i dropped this (no seriously the have to sing to power up....)\\n\\n\r\nCharacter-4- cliche female protagonist, nothing special, not even bothering.\\n\\n\r\nEnjoyment-1- pathetic, i tried my best to enjoy this piece of crap but couldn't.\\n\\n\r\nSo yeah, this anime at the very least is not what your going to expect period. Whether if ou expected to be good or bad. But when you try to mix moe and action, will singing and fighting you get a epic fail. Dont watch this.... unless your horny.",
            "date": "2012-02-26T13:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 54821,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XBurn",
                "username": "XBurn"
            },
            "url": "https://myanimelist.net/reviews.php?id=54821"
        },
        {
            "content": "It is said that there are seven wonders in this world, but the eighth and most important one that is often forgotten is a series that from start to finish is just a feel-good brain-off hype-fest. I dunno why all the other scores for this show are so low or what kind of no-nonsense all-business attitudes people had while watching this air, but holy crap are you missing out on a fun time if you judge this based on conventional merits.\r\nLet me give you a few tips about watching Symphogear:\r\n1. Get a drink. not a hardcore drink. Nothing with vodka. Just throw some peppermint schnoppsinto a smoothie. Or grab a hard cider. Just make sure it's fruity or sugary and that it tastes good.\\n\\n\r\n2. Set up a BIG SCREEN. Get a projector, or a massive flat-screen TV. Make sure this thing covers an entire wall.\\n\\n\r\n3. Turn UP the volume. Don't worry about your ears, they'll be dead soon anyways with the way our generation listens to music. Within a minute you won't care about the pounding pressure on your eardrums because the singing from the first scene will be like an enchanting siren luring you away from the confines of reality.\\n\\n\r\n4. Don't stop to think about anything unless that thought is incredibly stupid.\\n\\n\r\nSenki Zesshou Symphogear, a title I just shamelessly crl+c'd from the top of this page, is one of the absolutely dumbest shows out there. The show has about 3000 different tones crammed into each episode, the characters spew incomprehensible muddled philosophy and nonsense from long-forgotten action movies, the plot was seemingly written by the same guy who spearheaded Mars of Destruction, and the direction can't decide if this is an idol show or a horror movie. However, in spite of all this, Symphogear is not bad. Yes, you heard me, SYMPHOGEAR IS A GOOD SHOW, because what Symphogear is is fun, and fun is good. There is only one way to watch a show like this: to throw yourself into it completely, to get wildly over-invested in the petty drama and bullshit character turns. You can't half-ass it. I repeat, you CANNOT HALF-ASS THIS SHOW. You cannot wait for it to come to you, to entertain you through your one-in headphone and half-closed eyes. You must cast yourself into the ABYSS, and there you will discover new, nonsensical truths, such as the truth that Hibiki is in fact a Bear Grylls-Ghandi hybrid and a fucking BEAST or the truth that MY GIRL MIKU has all of the chaotic emotional complexity of an especially tormented FAULKNER PROTAGONIST and that she will go down in history as a LEGEND and a TRIUMPH over the darkness of human nature. \\n\\n\r\nIt's actually a very difficult thing to achieve, to hit the 'so stupid and nonsensical that it's hilarious' button while also holding down the 'actually care about the characters' lever, but I believe that the key lies in a couple of rather important choices Symphogear makes. First of all, it's not ALL stupid. It doesn't reinvent itself every episode or try to just spam random for kicks. It tries to stick to a central story and some cohesive character arcs that it takes very seriously, and it's the fact that Symphogear is actually tied together by something earnest and traditional that makes all of its dumb, off-the-wall moments so much more effective. Its shockingly out-of-place side plots ARE actually out of place, which makes them MUCH funnier, and the fact that it doesn't take things to the very extremes of \"wtf\" TOO often means that when it does, it's a golden chocolate treat rather than an overused device. There's an ample amount of petty melodrama in the show that keeps the overarching plot from ever being the backbone the series is resting on, which is very much a good thing. Also, the fact that the show saves all of its biggest cards for the end means that it has a legitimate build with an insane payoff, and you'll likely find yourself cheering and screaming at the screen all at once for the last four episodes straight if you're watching the show properly (as described above.) Finally though, Symphogear's greatest asset is simple and easy: clean, honest positivity. The show never gets nasty or negative, nor does it descend into the world of cheap gimmicks like questionable fan-service or out-of-nowhere dark twists. In an era polluted by cynicism, Symphogear just wants to have a good time with the characters that it loves so dearly, and THAT is invaluable.\\n\\n\r\nSo, yeah. Don't listen to the haters. Don't worry about the details. Just jump around, yell at the screen, and aggressively cheer for Chris. This show has no deep message or profound moments or original plot devices.\\n\\n\r\nIt just wants to see you grinning like an idiot.",
            "date": "2017-09-28T19:02:00+00:00",
            "helpful_count": 7,
            "mal_id": 259031,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489477.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChristopherKClaw",
                "username": "ChristopherKClaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=259031"
        },
        {
            "content": "The key to saving the world is with music and big boobs?? For real?? (͡° ͜ʖ ͡°)(͡° ͜ʖ ͡°)(͡° ͜ʖ ͡°)\r\nAs kid growing up Power Rangers, TMNT, Yu-Gi-OH, Beyblade, Digimon and Cartoon Netowork was on my favorite things in the childhood, but there was like on type of show i dislike but will give a chance in a year from here on...Sailor Moon...magical girls\r\ntransforming gals fighting other villans and magical girls ikr? However, I liket Powerpuff Girls and that was more than enough for me to care (2016 version doesn't count cus that one pissed me off) a decade later and i was still notinvested into anything girly, till 2015 when an episode of Yu-Gi-Oh! ARC-V (75) got interested in a srcrenncap when i saw this anime in 2016 and 2 years in 2018 i finaly watched Symphogear.\\n\\n\r\nUntil up to this point, I really hated the majority of Magical girl series, and I'm one of the handful of people who actually felt displeased or offput by the showings of Sailor Moon and Kill la Kill even Little Witch Academia got me mad. I'm sorry if that personal displeasure I had with such series may anger some people. Frankly there were a good girl series I did enjoy like Kill la Kill and Madoka Magica with Little Witch Academia because of the complex of the plot in those respective series.\\n\r\nNow, after watching just the first episode, the back of my mind tells me that this show called Senki Zesshou Symphogear may be something that'll change my mind about mecha series permanently by just one scene or plot point alone. I used at first think this anime was just too much with the over the top fights and Sailor Moon like transformations, but after rewatching Season 1 2 and 3 up to 3 times i kinda like them more than ever.\\n\\n\r\nSTORY: It's the typical generic girl get's powers from another person cliche just for her to fight monsters called ''Noise'' that can only be beat by Symphogear like gear type of gadget.\\n\\n\r\nART: The 2012 version had horrible animation, but 2013 version got better over time, even at it's worst, this show can be very well made. \\n\\n\r\nSOUND: The soundtracks are breathtaking and can give you the chills at the right timings. Not much else to say here...\\n\\n\r\nCHARACTERS: (BEWARE OF SOME SPOILERS) So far, the characters are pretty solid even if generic. The one character I found interesting in particular is Yukine Chris, who is another person geting her past ruined by a war whom her parents get killed and she is my favorite because of her kindness. I do like Tachibana Hibiki and Action Movie dad with Tsubasa being the only character i call okay, yet she is pretty.\\n\\n\r\nENJOYMENT: From the beginning, I didn't think I'd enjoy anything, given my past experience with previous girl animes series. I slowly grew a interest when it came down to the interactions between Bikky and her friends or enemies., which can probably be the most amusing or interesting moments in the entire series. When it came down to where their shared qualities.\\n\\n\r\nOVERALL: 10/10 for the bittersweet momemnts and well excuted scenes. I give anime a chance because it made start liking magical girl anime more often and gave Little Witch Academia a try\\n",
            "date": "2018-09-09T05:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 288575,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5435146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Helios92",
                "username": "Helios92"
            },
            "url": "https://myanimelist.net/reviews.php?id=288575"
        },
        {
            "content": "Well, Senki Zesshou Symphogear is one of the first anime to begin airing in 2012. A good head-start to gain fans' attention. This anime can combine two different anime fields : shojo with music and shonen with battle and mecha. This makes the whole anime became Divine Intervention\r\nThe story is scored A, thanks to radically different story compared to any other anime. All anime have their unique stories, but this anime featuring music and battle simultaneously instead of mere music competition. This item makes the SZS anime stands out compared to any other anime as an intersection of battle anime and music anime. Whole animethemselves is already radically different from any similar anime.\\n\r\nThe story swings from fighting against enemy (creep in DotA) then internal conflict. After the conflict resolved, encountering the real boss and case closed. All this in 13 episodes, less than adequate for the whole three major arcs while normally three major arcs will require two periods (one period == one season).\\n\\n\r\nArt is rated as A. Nothing much different from any other mecha anime. The design is somewhere a mixture of futuristic and present design. All futuristic anime usually discard the present technology, saving spaces for hi-tech which is included in the far future sub-chapter or even not written in \"Physics of the Future\" book written by Michio Kaku. This balances the penalty given in the fields of character design due to overly standard.\\n\r\nThe armor is quite similar to Infinite Stratos with minimum torso protection and good extremities protection while differs only in size and capability. With this armor, it should be easy to re-draw the characters (excluding the other class of armor which provides extra armor).\\n\r\nOne can easily distinguish the differences between concert scene and street pursuit scene from the side of animation itself. The concert scene (only twice in whole anime) is very well-drawn, almost divine intervention. On other hand, the street pursuit scene is very similar to almost identical to GTA San Andreas-era video game. Those two aspects are offsetting each other with advantage in the concert which is the main theme for the anime.\\n\\n\r\nSound is rated A. Guaranteed by Elements Garden and Nana Mizuki, Synchrogazer stands out a lot for any other anime Opening track. The other songs featured varies in type, from upbeat in 'Gyakkou no Flugel' or something likely to an aria song which is the Zesshou.\\n\r\nOther songs also gained high value because of the interest of those song (proven by high traffic in my blog for those entries). Say like 'FLIGHT FEATHERS' by Nana Mizuki and 'Tsunaida Te Dake ga Tsumugu Mono' by Ayahi Takagaki that is very well-sung.\\n\\n\r\nCharacters is rated A due to the standard design. Play it safe, S.S.D.D.. On the one hand, there is a characters dead early in the anime which can be a severe penalty. This penalty is offset by further development which result in more or less idealistic characters.\\n\\n\r\nEnjoyment is also rated A. Nothing much to be commented except the elegant battle. In some parts, there are yuri scene which can raise the score for enjoyment or reduce, depends on how one sees yuri scene. This enjoyment is also offset by partial nudity and NSFW (for some countries) battle dress.",
            "date": "2012-01-10T21:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 51485,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cruiser",
                "username": "Cruiser"
            },
            "url": "https://myanimelist.net/reviews.php?id=51485"
        },
        {
            "content": "TL;DR version: Not worth watching unless you get enjoyment from girls battling with some good weaponry and/or a huge fan of Nana Mizuki's music.\r\nSymphogear gives us the premise of an alien race that is causing havoc.  The only counter to these strange creatures is the Symphogear weapon system which the female protagonists equip themselves for battle.  While this formula for a battle anime has been done a countless number of times, what really matters is \"how\" it is done, rather than the \"what\".  Unfortunately, Symphogear clearly lacks the direction and the refinement seen in other series such as Madoka.\r\nFirstly, there is thematter of the story which is fairly average on the whole, but is destroyed by a major plot hole and the lack of refinement in the direction.  We are greeted with a significant death in the first episode, which we fully know about from the summary of this anime.  This death is caused by Kanade using \"Zesshou\", the final attack available that uses up all of one's life energy.  Unfortunately, this significance is cheapened in later episodes.  Therefore, Kanade's death becomes a rather forced plot device to get the ball rolling, rather than a necessary and significant event.\\n\\n\r\nThen there's the clear lack of refinement in the direction, as there are occasions where we get bombarded with the most terrible ENGRISH.  I mean absolutely horrific.  While the context of including the English was justified (Japanese dealing with Americans), the catastrophic lack of care in its execution just goes to show a lot.  Surely, Microsoft Word would have come up with a whole load of green wriggly lines in the planning phase of the script.\\n\\n\r\nThen we move onto the art.  Symphogear's characters have a fairly retro look with the use of strong colour shading for the hair, unlike the lighter colour tones that is more prevalent today.  While this is not bad in itself, there are issues with the use of shading, which gives an incorrect perception of a lack of detail.  Mouretsu Pirates, whose character art is far from groundbreaking uses a very simple, but effective style that shows the detailing in the character's hair.  While I am not expecting something crazy on the level of Key/KyoAni collaborations, Symphogear's shading deficiency was clearly evident in the first episode where production values was at their highest.  The fluid animation, combined with the excellent camera angles and background art looked a little odd when it was just hard to notice the character detailing.  Then we have the main character whom we of course spend a long time staring at her.  Her eyes seemed just too narrow and horizontally challenged.  This just makes it a little hard to stare at the screen, because the level of distortion was beyond tolerances that is usually seen.\\n\\n\r\nTo make it all up though, the background scenery was extremely well done with plenty of detailing and shading.  The weapon and attack design and choreography was excellent and fun to watch.  The stills, showing the main attacks of the character was a nice touch, using differing art styles that represented the character in question.\\n\\n\r\nCharacterisation.  We love seeing great characters.  Now, a significant number of teenagers tend to have mood swings and can be unstable due to the sudden rush of hormones during puberty.  Symphogear's representations of teenagers in distress seemed highly plausible.  The way they interacted and reacted were extremely appropriate and on the whole, done fairly well.  While Mary Sues on the one hand are boring, there is also unfortunately the case of annoying naivety which we see with the main character.  This naivety causes grief for the sake of it.  Her thoughts seems to mature though, and her sense of empathy is highly improved after receiving appropriate information.\\n\\n\r\n(Personal Opinion: While I don't mind seeing naive supporting characters giving the slightly more mature main character annoyance, I cannot stand it being the other way around.  Simply because the main character gets most of the screen time.  Having to live with it is just painful.)\\n\\n\r\nThe villain's characterisation unfortunately left much more to be desired.  The behaviour, course of action, and reaction felt highly amateurish, considering the number of years' life experience the villain has had.  Even the highly egotistical and corrupted Gilgamesh from the Fate universe knew when to do Ego and when to do serious battle.  Gender not revealed to prevent spoiling.\\n\\n\r\nThe sounds are the strongest point of Symphogear.  This is especially exaggerated in my case as I click extremely well with Nana Mizuki's music.  The way the music was composed suited Nana's singing style perfectly and was built around the character exceptionally well.  (I seriously believe Symphogear was made solely to make some cash out of Nana's talent).  The ending result was Macross F on steroids with highly enjoyable battles.   Not only that, but Yukine's \"badass rock\" also suited her character and attack mode extremely well.  Battle sounds were generically good, and nothing seemed amiss.  Unfortunately, the main character's music, battles and singing was just weak.  It is rather loli-ish, something which really has its place in Lucky Star, rather than a battle.\\n\\n\r\nAt the end of the day, Symphogear was built on a highly average premise.  While they did a good job with the music and weapon design, the aforementioned plot inconsistency and unpalatable main character destroys much of the viewing experience.\\n\\n\r\nFor those who click with Nana's music, her outstanding performance is more than capable of temporarily taking the viewer's attention away from the glaring flaws.  However, for those of other taste, the sound and enjoyment score would surely be lower and therefore, Symphogear is essentially 3 or 4/10 material.  Which goes back to the TL;DR version of the review - if you don't like Nana's music, don't bother with Symphogear.",
            "date": "2012-06-18T09:52:00+00:00",
            "helpful_count": 10,
            "mal_id": 63739,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91327.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/X10A_Freedom",
                "username": "X10A_Freedom"
            },
            "url": "https://myanimelist.net/reviews.php?id=63739"
        },
        {
            "content": "I am just here trying to balance out the amount of negative reviews of this anime.\r\nSenki Zesshou Symphogear (I am just gonna call it Symphogear) wasn't a very bad anime, if you want sci-fi action based anime, Symphogear is worth trying out.\r\nMy first experience watching the first episode of the anime was like \"Wow, this is the real stuff people needs to watch these days.\" Of course it was quite a let down as animation quality was dropping episode by episode but it was still watch-able to the point that you can still cope with the animation. The art style in some point would changedrastically but I think it was to create visual effects to cope with the music.\\n\\n\r\nSpeaking about music, apparently the characters sing songs when they are fighting, it was quite a hilarious concept where you're with an angry face and still managed to somewhat sing songs while fighting. The naming of the enemy units, Noise, also gave me a good laugh. The first thing in mind was that the human races doesn't like \"noises\" which was quite a pun but of course you'll get what I mean as the anime moves on.\\n\\n\r\nBody proportions in the anime are quite realistic as well each character are able to represent their personality and motive quite well. Colour can be interpreted as a strong theme as it really represents something which I would prefer the watchers to see by themselves. The animation was mind-blasting if any of you watched the 1st episode. Though don't get discouraged by the degrading of animation quality as episodes come by or so. It is still a pretty good anime with its cool moments as well as tragic touching moments.\\n\\n\r\nThe story is quite well-created in my point of view. Although it didn't reveal too much background information but it was enough to allow the story to continue. Though there are moments in the anime where there was too much talking that you pretty much made yourself to skip ahead and see if there's any more mind-blasting battle scenes. Its been hilarious everytime a character uses a special move, its like one of those Fighter games where the gameplay freezes and a banner of the move name comes flying onto the screen.\\n\\n\r\nThe music and songs are quite good. I especially liked the daft punk genre musics used in Symphogear. Generally the music is good to a point its worth downloading the character albums and put them into your iPod.\\n\\n\r\nStory - 6\\n\r\nArt - 7\\n\r\nSound - 9\\n\r\nCharacter - 8\\n\r\nEnjoyment - 8\\n\r\nOverall - 7\\n\\n\r\nThe reason why I gave Symphogear a 7 was really because of its downfall in its animation degradation as well as \"plot-killer\" moments where everything becomes boring that makes you want to skip ahead. Otherwise all other aspects were quite fascinating to watch. Though I would love to give Symphogear a rate of 8/10 due to the fact after finish watching it, it certainly does make you feel like asking \"Is there Season 2?\" (which I don't think there will be) as it left quite an imprint in memory.",
            "date": "2012-09-10T06:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 72025,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1484437.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ExHomura",
                "username": "ExHomura"
            },
            "url": "https://myanimelist.net/reviews.php?id=72025"
        },
        {
            "content": "*Review contains minor spoilers, nothing major, but proceed at your own caution.*\r\nSenki Zesshou Symphogear... I've never been so happy to have accidentally stumbled upon an anime in my life. Also, I will be speaking mainly of this anime, but I will be mentioning the following 2 seasons as well.\r\nNow, before we get going, I'd like to make it clear that this anime is nowhere near perfect. It most definitely has it's flaws, some bad animation here, some poor plot choices there, plot armor galore over yonder, I could go on. But that doesn't change the fact that this anime does one thing, and it doesit incredibly well:\\n\\n\r\nFUN.\\n\\n\r\nWhen a lot of people complain about Symphogear, I always see that they seem to take it too seriously. With that, I tell you, that you should watch this anime for pure, unadulterated, fun, explosions, and a kickass soundtrack that you're probably going to be wanting to locate and download. Which I have. All of it. So good.\\n\\n\r\nAnyways, on to the actual review.\\n\\n\r\nStory:\\n\\n\r\nIt's certainly not a bad story, there are worse ones out there, however you will see that it's rather cliche once you start getting a few episodes in. One of the worst parts about Symphogear, is it's rather cliche story, and this applies to the following seasons as well, since they all follow the same rough format that season 1 does. However, while looking at it by me saying that, it may seem rather uhh... \"meh\". But, I should also mention, that Symphogear KNOWS that it's bad. It knows that it's cliche, and it uses that to it's advantage. Yes, it's a cookie cutter that was built out of the body of season 1, and yes, seasons 2 and 3 were made with that exact same cookie cutter, but DAYUM is that a nice cookie cutter. Normally, if an anime is too cliche, it dies because the audience has seen it before (which admittedly, may very well still apply to some people when they decide to watch this) however, the other aspects of the show are what genuinely carry this anime to glory, the characters, the music, the important animation, all of that combines to patch up those nasty things that the plot just literally can't even. I should also mention that the overlying plot is only affected by this. There are a bunch of sub-plots which are actually quite unique and well thought out, for example, the backstories of the main characters.\\n\\n\r\nOverall, you've seen this plot before, and you'll know it when you see it. But the rest of the anime will more than make up for it, which is impressive considering how important plot tends to be.\\n\\n\r\nArt: 7\\n\\n\r\nI admit, the animation for this anime kinda dies at points. There's a scene where Tsubasa and her Manager are walking down a hall and rather than an animated walking animation, it is merely their unmoving bodies swaying in a small figure 8 pattern. Now, remember what I said about this series being fun? Yeah. It is. \"Bu-but, HOW could it POSSIBLY be fun with animation like THAT!?\" you may ask. Well I'll tell you, the animation for unimportant things like that walking scene, or someone writing something down on a piece of paper, THOSE are animated quite poorly sometimes. HOWEVER. The producers of this anime were smart, and funneled most of what little budget they had into the action scenes, and other important scenes. A lot of anime, even high budget anime that have all-round great animation, tend to have action scenes that are simply just as good as the rest of the anime, and when you're expecting MORE from an action scene, it can be a little underwhelming. Symphogear, with it's poor budget, knocks up the budget big time for their action scenes, making amazing looking scenes that are animated fluidly. I should also add that this anime liked to have it's action scenes on the go. While a lot of anime take a lot of camera cuts and angles in rapid succession to show a fight, which works well don't get me wrong, Symphogear does it itself a whole bunch, but they ALSO love to follow the action as it moves, meaning you'll get panning action sequences at high speed that look simply amazing (not to mention badass as hell) and really gives the viewer an impression of the speed at which the Symphogear users are fighting. While they obviously don't do this all the time, you'll see it used quite a bit, and it's a nice addition. Back to that bad animation for a moment, and also referring to when I said that people always take this anime too seriously if they hate the anime. The bad animation that pops up? It's reaally bad. So bad in fact, that it's laughable. I actually laugh at this animation, it is so bad. Now I can't forgive it for these atrocities of animation, but hey, you can always get a chuckle out of it! I should also mention that while this anime DOES have some very bad animation issues, those absolutely horrendous only pop up around 3 or 4 times in the entire anime, so they don't overly take away from it as a whole. Seasons 2 and 3 undergo a SERIOUS budget boost however, and nearly every issue that season one had in regards to animation was fixed, or improved past that.\\n\\n\r\nOverall, while this anime has some undeniable animation issues, it isn't bad enough to take away from the series enough to ruin the experience.\\n\\n\r\nSound: 10\\n\\n\r\nI'm including the soundtrack in this, it's a must. This anime is one that is in the \"Music\" genre, and normally, when you see \"Music\" tagged on to an anime, with a premise like that of Symphogear, you get frilly cute J-Pop songs, or at least, expect them. That is far from what you'll be getting out of Symphogear. Let's lead in to the  music by starting with the voice actors! Tsubasa is voiced by Nana Mizuki, whom is a very well-off musical artist in Japan. Not only does she do an excellent job of voicing the stoic Tsubasa, she carries that voice into her songs which all have an oriental theme. Nana Mizuki also created and sings the OP of each of the seasons, season 1 being \"Synchrogazer\". Aoi Yuuki voices our main Character, Hibiki Tachibana. Perhaps you've heard Aoi before, she's done quite a few roles. Tornado from One Punch Man, Madoka from Madoka Magica, Victorique from Gosick, the list goes on. Aoi isn't a song artist, however in this series, she sings all of her own songs, which is a rather impressive feat for anyone. This adds to the immersion of the series, since there is no clear difference in voice, unlike when another person sings a song in place of a voice actor. This applies to every single character in the entire Symphogear anime. Each voice actor does all of their own singing, and they do a damn fine job. Each character even has songs that are styled towards them. As mentioned, Tsubasa sings what I call \"Technoriental\"  and Hibiki sings \"Electroceltic\" technobagpipes included. Other characters are introduced later on, one of which sings aggressive rock, and in season 2, another which sings pure electronic, as well as another that sings perhaps a more punk-style of rock. Mentioning the characters further would be too large a spoiler however. Back to the actual music. Every song was crafted FOR the anime, none were taken from elsewhere. The producers made it a priority to make the music as excellent as they possibly could, as the anime revolves around music, and make it well they did indeed. I should now mention that all of these amazing songs are placed in as character songs (songs which are sung by the characters) and of course, since having characters singing all of the time would be stupid, there is regular soundtrack to go alongside it. Nothing too special about it, in all honesty. The background music you hear in scenes without characters singing is just sorta there, nothing too memorable, but not bad either. Just there. As far as voice acting goes... really well done! They got a very solid cast of voice actors, they didn't lose out anywhere there, however I should mention that ONLY the first season... has the most horrendous case of Engrish that I've ever heard. Thank god for subtitles. They gave up on attempting English in the following seasons, for good reason. As for the Japanese voice acting, emotions are portrayed very well, Hibiki always sounds like she should, cheery and upbeat, Tsubasa sounds like a strong \"don't mess with her\" type, the list goes on.\\n\\n\r\nOverall, the character songs make this anime absolutely amazing, and are one of it's biggest selling points. The background music and such isn't so up to par, but the sheer quality of the character songs truly outshine the little problems that the background music brings forth. While there was a bit of laughably bad Engrish, the voice acting was excellently done, especially with how each voice actor sings their own songs.\\n\\n\r\nCharacters: 9\\n\\n\r\nEach character is very well made, and while maybe cliche in a sense, they use cliches that haven't been milked to death. Hibiki is outgoing and cheery, which is the worst offender, however Tsubasa is a strong, stoic type, with more behind her exterior than first meets the eye. Another character may simply be passed off as a bit of a tsundere, but actually isn't, far more complex than that. Each main character has a backstory, not all of which are fully gone into in-depth, but all are at least mentioned at one point or another. Furthermore, these backstories can do a great job of defining why a character acts the way they do, and if this process ins't the one that explains it, you'll simply find out later on. Every character has a unique purpose, and each characters continues to fulfill that unique purpose effectively, without giving too much attention to any singular character. Even the side characters are well thought out, they don't FEEL like complete side characters because they actually get quite a lot of interaction with the true main characters as well as major plot elements. The villain however, is quite cliche. Like mentioned previously though, this hardly counts since the producers did this on purpose. This anime is supposed to be stupid, but handled well.\\n\\n\r\nOverall, the characters are all well thought out, and despite being less-used cliches, they have reasoning to back themselves up. Every characters does exactly what they're supposed to do, with a high degree of effectiveness, no single character could replace another. Even the side characters are given a good amount of attention. The villain is rather cliche, but it doesn't hurt too much.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nAs I have been consistently mentioning, this anime is FUN. Don't go into it for serious plot developments and incredible levels of character development, go and watch it to watch your favourite heroes beat the crap out of a bad guy. With music. I have given this anime a nickname, as have other people. \"Micheal Bay: The Musical\" There isn't a whole lot of down time in this anime, for the most part it splits up action and comedy, however it also has a few much darker elements in store for you to keep you on the edge of your seat. Drama is a thing as well, it may have been kind of forced, but it changes up the pace, so see that as you will. Regardless, the main point of this anime is lots of bright colors, explosions, awesome fight scenes, badass soundtracks, hell, even moments that could make you tear up a little bit.\\n\\n\r\nOverall, watch this for fun! If you go in expecting something serious from an anime about magical girls blowing up monsters with the power of songs and friendship, you're gonna be sad. You'll be happy to know that if you enjoyed this series the first time, it doesn't get boring easily either. So feel free to rewatch it!\\n\\n\r\nOverall: 9\\n\\n\r\nCulminating everything I've mentioned... this anime is just jolly good fun. Over-the-top fight scenes, an incredibly enjoyable soundtrack, equally likeable main characters, which all excel at doing their own thing. It's a giant blob of stupidity and cliches, yes, but it knows that and uses that as a grounds for making itself more awesome. \"Ah well, we've already used this many cliches, let's overcome this insurmountable feat with an attack powered by friendship and unicorn souls!\" and as dumb as that sounds, it doesn't get boring, it is truly something you just have to experience for yourself to understand. This anime is a great watch for practically any age, as it covers a lot of things, however, there's no real nice pretty age to acceptable watch it at. If a kid tries to watch it, there's some pretty bloody stuff that happens, if an adult watches it... it's an anime filled with magical girls! Perhaps teens can get away with it. Disregarding social standards however, this anime IS a great, fun watch, for all ages!\\n\\n\r\nExtra note:\\n\\n\r\nWhile this anime may seem to be the type, it VERY rarely sexualizes it's characters, I can recall a total of 5 scenes throughout all 3 seasons, one of which was a beach episode, another was a bath scene, both of which are anime staples. Even during transformation sequences, season 1 has next to no sexualization at all, the camera doesn't even zoom in on the characters body. Season 2, with their updated budget, opted to have a fancy camera-spinning close-up transformation scene, but even still, the camera never clearly focused on anywhere such as the butt or breasts, it just panned over them as though they were any other body part such as an elbow or a foot. Season 3 starts getting to borderline as it adds in a bit of jiggle to some characters during these sequences, but thinking realistically... I think some jiggle may happen... they certainly didn't blow it out of proportion, and even further, they kept the camera moving with no clear fanservice shots. As for actul in-fight scenes, the rules apply as if it were anime men fighting, nothing is sexualized or focused upon, if you want to see something you can look for it obviously, but it isn't shoved into your face. There are a few instances of blatant fanservice as I previously mentioned, but that count is very low. A good job goes to the producers for that decision as well, the quality of this anime would have dropped big time were it made as an ecchi.",
            "date": "2016-09-12T23:08:00+00:00",
            "helpful_count": 7,
            "mal_id": 228939,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5178511.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/awesomedude20",
                "username": "awesomedude20"
            },
            "url": "https://myanimelist.net/reviews.php?id=228939"
        },
        {
            "content": "Fellow anime connoisseurs,earlier this year we were graced by a torrent of new anime like Aquarion Evol or Guilty Crown\r\nthough the latter had its obvious weaknesses I agree that it was worthwhile watching,However this is not\r\nthe case for all of this season's new anime namely Zesshou Symphogear'whats bad about it wasn't\r\nthe 'Noise' (and no im not talking about the monsters, im talking about the 'Noise' that the characters call singing.)or the fact that the main character \r\nis a mutated pikachu with the depth of a sheet of paper nor the\r\nfact that the best character died a martyr to save this lowly abomination from the apparentlyREAL\"Noise\".\\n\r\nNo no no the problem lies when all of these elements combine into a thirteen episode animation,then eagerly advertised to us,anime enthusiasts\\n\r\nonly to totally annihilate those high expectations we built up for it.I no longer acknowledge Symphogear as anime,for doing so is\\n\r\nan insult to anime itself.\\n\\n\r\nStory:1\\n\r\nThe Story very inconsistent though this normally doesn't matter for the earlier episodes where it usually builds up suspense,\\n\r\nthe problem is that those inconsistencies don't get resolved either, Like why didn't Tsubasa die when she sung her swan song?\\n\r\nthis is probably what the writers were thinking:\"Tsubasa gets the high ratings,Screw the story we can't kill her off\"\\n\r\nim sure everyone else is trying to be politically correct by giving it a three or four out of pity but I'm giving it a one because 'Pathetic'\\n\r\nis the perfect adjective to this story.\\n\\n\r\nArt/Setting:4\\n\r\nI will admit Tsubasas gears (despite the training wheels on the back)is designed well and the cityscape as well,take the concert hall,it looks awesome but on \\n\r\ncloser examination I think the only reason the crowd is getting excited is for the constant Tsubasa Up-skirt throughout the concert...\\n\r\nBut thats ok,so the architecture is bad,the art is still OK right?\\n\r\nN.O. they spent their entire design budget on Tsubasa and the concert hall,just look the commander hes an part Irish part Zimbabwean part Japanese dude,they basically\\n\r\nused 'Paint'(the Application) to draw him.\\n\\n\r\nSound:1\\n\r\nIM TIRED OF LISTENING TO YOUR DAMN SONG!and the transformation sequences - un en iwe an en we tuo...are you sure\\n\r\nthat's still Japanese?Like I think it would make a lot more sense to say:\"I will Digivolve too!\".\\n\\n\r\nCharacter:2\\n\r\nI said before that Hibiki had the depth of a sheet of paper,well if you put the entire cast together, you will have a small stack of printer paper about 2mm\\n\r\nin total depth.\\n\r\nI mean how much do you know about each individual character,Lets take Yukine Chris because we haven't mentioned her yet-\\n\r\nChris's past is a series of unfortunate events,Her parents died so she stole and eventually turned to terrorism.THE END.\\n\r\nwow so complex*cough*.\\n\\n\r\nEnjoyment:1\\n\r\nI was actually forced through this anime,one of my friends forced me to watch this on a weekly basis,im serious he was like-\"I know where you live,so you better \\n\r\nwatch it\"so partly because of that I didn't enjoy this abomination too much.\\n\r\nThat said this anime was an Abomination with or without my friends help,it helped me define the new limits of bad in the anime world.\\n\r\nwhenever my friend gives me anime I would ask:\"is it better than Symphogear?\"\\n\r\nSymphogear is simply that bad.\\n\\n\r\nOverall:I actually want to give this a negative score because I want my 6.5 hours I spent on this anime back, but since I can only give it a one as a minimum\\n\r\nthe anime got off easy.\\n\\n\r\nQuite frankly from an economic students point of view this anime should be classed as a \"demerit good\"in that it is detrimental to society itself,in fact one day\\n\r\nim sure it will replace that atomic bomb as a new weapon of mass destruction.I Loath it ,I Hate it ,I Pity it for becoming so deformed.\\n\r\nTo my patient anime brethren I bid you adieu for I will see to it that 'Senki Zesshou Symphogear' Burns in Hell.",
            "date": "2012-05-09T03:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 60877,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1232373.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Knightmaretiger",
                "username": "Knightmaretiger"
            },
            "url": "https://myanimelist.net/reviews.php?id=60877"
        },
        {
            "content": "Symphogear is literally one of the best anime I've ever watched. The story was laid out amazingly and the characters were awesome.\r\nStarting off with the story, it was truly awesome. So, the story basically starts with ZweiWing performing a concert, but suddenly the Noise attack and nearly kill the protagonist however, Kanade sacrifices herself using her “Zesshou” to save Hibiki’s life. This is, truly, an amazing way to start off the story as it introduces the viewer to the main characters but also creates an uneasy and upsetting atmosphere.\r\n          Then, as the story continues, Hibiki (nowwith Kanade’s power) and Tsubasa encounter Chris Yukine who uses the Nehustan Armor but later the relic Ichaival. (I’m really trying not to give any spoilers) And later (AKA the final episode) they sacrifice themselves to stop the chunk of moon from destroying their town, only to have faked their death in order to protect their friends. This made me cry so much ) ;\\n\\n\r\nNow going to the characters, let’s start off with the main protagonist: Tachibana Hibiki. Hibiki, two years ago, nearly died due to the piece of the Gungnir Relic entering her heart tissue. Hibiki is one of the coolest I have seen in an anime, however, she can be rather annoying. Then we go to the veteran user of the team, Kazanari Tsubasa. Tsubasa, before Kanade’s sacrifice, was originally shy and introverted but usually depended on Kanade to lift up her spirits. Then, after Kanade’s sacrifice; Tsubasa became, how she describes, “like a sword” being cold and independant. I find Tsubasa really cool, and now we go to the most awesome of the team: Yukine Chris! *gives Chris a medal for being the most awesome Symphogear character in existence* Chris is truly pure awesomeness.\\n\\n\r\nAnd then finally: the music The music in this series has no other word to describe it but utter awesomeness. By the way, Chris' songs are the best; no joke",
            "date": "2017-06-18T01:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 250212,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6197970.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cure_Felice",
                "username": "Cure_Felice"
            },
            "url": "https://myanimelist.net/reviews.php?id=250212"
        },
        {
            "content": "My friends deem this unwatchable, and I don't blame them, nor would I anyone else who says it's unwatchable.\r\nHowever I find it somehow enthralling. Something about the combination of the music and the fight scenes generates an exaggerated hype that I love.\r\nThere is lots of edge and qq, which would normally ruin a series, but its done in a way that either the scene can be skipped without missing anything important. Or it's so overdone that it's funny, using tropes like 'They are powered by friendship!'\r\nThe art style heavily reminds me of Megaman, while still being original.\r\nThe nameless villains look like some sort of uglykidsmeal toys that were likely designed by a different artist.\\n\\n\r\nThere is lots wrong with it, especially the angsty character development, but the ultra-flashiness of the fights makes up for it.\\n\r\nThe macro-plot is surprisingly very good, although there is very little of it.\\n\\n\r\nAs long as you don't take it too seriously then it's very enjoyable.",
            "date": "2015-09-03T11:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 197743,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4629474.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khlorghaal",
                "username": "khlorghaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=197743"
        }
    ],
    [
        {
            "content": "Symphogear combines music and action something thats quite unique in the anime industry, drawing ideas from the magical girl, drama and action genre, the story bascially comprises of singers who battle against coal-inducing \"noise\".\r\nStory: 8/10, An creative concept with a clear direction of plot thats understandable and interesting.  \r\nArt: 9/10 top notch fluid animation, with marvel comic style frames at times. \r\nSound: 9/10 As expected of a music heavy anime, the music rather fitting to the events that occur. And let me just say, singing songs halfway during an epic battle is just hands down badass. \r\nCharacters: 8/10 For just the first 30minutes of the show, the characters are surprising likable and tolerable despite looking like female versions of shouma and kamba\\n\\n\r\nEnjoyment: 9/10 the show starts with a bang, a captivating and thrilling start to a new series. Hopefully it shines until the very end of the performance.\\n\\n\\n\r\nThoughts for now: 8/10 an anime worth following, Expectations are set up extremely high in just the first episode, a very promising, action packed, at times very dramatic and sad but still very enjoyable to watch. Be sure to check it out.",
            "date": "2012-01-08T04:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 51247,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1074317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Buttface",
                "username": "Buttface"
            },
            "url": "https://myanimelist.net/reviews.php?id=51247"
        },
        {
            "content": "Senki, while really not the best magical girl show out there, is an interesting bag of tricks. It's interesting in that it seems like the show changed story lanes a couple of times and ultimately failed to hit a perfect medium, while still hitting a nice somewhat-below that. Basically if you just pay attention to the action, you'll enjoy.\r\nStory (6/10): If you break up the show into thirds, you can clearly see that they show's writing changed slightly. The first half was much more 'darker and trying to be realistic', the middle became the 'school drama and getting to know you' stage, while the endingwas the 'free for all battles'. Was this a good idea? ...meh? There are a lot of places where the story falters (especially with no real definition of the relics that we can follow so as not to allow the inevitable Deus Ex Machina), but it does have it's moments. \\n\\n\r\nArt (7/10): The best art is very obviously used on the battles, which all look interesting and are fun and all that, along with giving the Symphogears their awesome appearances (save for Tsubasa's weird leg-blade things). There is some wonky perspectives here and there, but overall the show looks pretty nice.\\n\\n\r\nSound (6/10): For being a show with music as the vehicle...I kinda didn't like the songs. The opening is the best out of the bunch, with the music in the last 3 episodes redeeming the weaker bits that persisted though the whole thing (for sure when we finally get to hear all three main protagonists sing). One thing I noticed is that I liked the actual music of the songs, with the singers voices actually taking away from my enjoyment of the songs. Weird, I know. But like I said, the opening is easily my favorite bit of music in the whole show.\\n\\n\r\nCharacter (7/10): This is slightly hard to talk about. On one hand, the 3 main girls are interesting to watch and have some good development over the course of the show, along with Genjiro and some of the staff that works for him just being some good stable characters. On the other...our main villain is a little confusing, with her having some REALLY weird mood swings throughout her existence. The girls at the school are also pretty flat and have no real connection to the story until, again, the last 2 or so episodes. Miku is also kinda useless as a character, since she just falls flat as the 'magical girls best friend'.\\n\\n\r\nEnjoyment (8/10): Even with all the problems that the show has, it's fairly entertaining to watch. Well...at least all the battles were. Seriously, the last 3 episodes (yes, I've been singling them out as the best parts of the show, even with the weaker story) are just so cool and fun to watch that I rushed through them as fast as I could. To go with the thirds example that I brought up in the Story section, the first third and ending third are the best, with the second just being really weak.\\n\\n\r\nOverall, Senki is a fun little show, though I wouldn't try and follow the story by any stretch of the word. Watch it for the fun fight scenes and the main girls just being interesting. Would I recommend it? I'd say no unless you really like the magical girl genre, and even then that's kinda pushing it. Hopefully the second season will turn out much better, so here's hoping.",
            "date": "2013-06-10T10:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 100601,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1984116.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/platinumSKIES",
                "username": "platinumSKIES"
            },
            "url": "https://myanimelist.net/reviews.php?id=100601"
        },
        {
            "content": "Symphogear is cheesy. It’s a story where at it’s core is about friendship, protecting your loved ones and believing in your own strength. Like I said in my previous post about it, Symphogear is like animated Tokusatsu with music as the main motif. It’s silly, but frankly a lot of shows could learn a lot of things from Symphogear. You know what? I feel like breaking this down in the classic way by categories. Let’s start with the most important/the best part about Symphogear.\r\nThe sound department. You know how music can affect a story greatly? Sad music will make you feel sad, happy music willmake you feel happy, but it can also affect the tone of the story. Spooky music will make the scene/story spooky, intense music will make a battle intense and so on. Well, thanks to one Motoyama Satoshi Symphogear has one of the best music uses I’ve seen in a show my entire life. Everything about the music and it’s execution made this show way better than it could/should be. Because of the music and it’s execution all other elements of the show that are affected by it get this boost of energy and tone which they wouldn’t necessarily achieve solely by themselves. The voice acting is also worth mentioning. The VA’s in this show give some of the best performances I’ve seen them give. It’s easy to forget how important sound can be in a show. Symphogear does well to remember it’s importance.\\n\\n\r\nThe art department. I’m just going to outright say it: The art in this show is beyond superb. Whether it’s the amazing Symphogear designs (shoutout to my favorite desgin: Yukine Chris) or the detailed backgrounds. It’s amazing. Even the simple enemies are unique and stand out on their own. And the animation in this show is downright fantastic especially in battles. For a modern anime this has some of the best fights I have seen. The art department in this show have done an amazing job and barely cut any corners.\\n\\n\r\nThe story. This one here is a mixed bag. On the one hand the story is similar to a cheesy B movie, but because of the important role the music has and how much it supports the story, the story ends up being better than what it actually is, which is a cheesy B movie plot, but in the end of the show the whole story comes together in an enjoyable way and it actually feels like something was accomplished by the end of it. And despite it being so cheesy in it’s way Symphogear ends up being a lot better than quite a few AAA/S titles. A lot of the story elements in Symphogear are just the right enough amount of cheesy to make me smile with joy. I like cheesy/silly stories, they are the ones that end up being the most enjoyable. So, yeah despite being cheesy Symphogear has a very good story, with some slight pacing issues.\\n\\n\r\nThe characters. The characters in Symphogear is another one of my favorite parts. A lot of the ideals that the characters represent are ideals I can get behind. Friendship? I’m all for friendship. Protecting your loved ones? Heck yeah I can get behind protecting one’s loved ones. Believing in your own strength? At this point it could be considered pandering. Sure you might call them cheesy, but these characters are in the end loveable. The main villain is one of the best villains I’ve seen in a B movie esque story. The whole “What is giving you your strength” lack of comprehension on the villains part is so incredible. And of course I can’t go talking about the characters without mentioning the one, the only Kazanari Genjurou!. One of the most likeable side characters I’ve had the pleasure of liking.\\n\\n\r\nSymphogear may not be for everyone. But it is for me. I like, no I love Symphogear a lot, and I love it enough to consider it one of my favorite shows. So, as per usual, do I recommend Symphogear? Absolutely. Go watch it. If it doesn’t click with you completely right away the same thing that was with me, but you still want to give it a try episode 6 is where it finally clicked with me, and it was only uphill from there.",
            "date": "2014-10-17T05:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 165105,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3569305.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dcaspy7",
                "username": "dcaspy7"
            },
            "url": "https://myanimelist.net/reviews.php?id=165105"
        },
        {
            "content": "As me not being a big fan of animes like Senki Zesshou Symphgear I never expected I'll watch it or even like it but it became one of the exeptions that I end up enjoying.  \r\nAt the start I thought this anime was going to be like all of those generic magical/sci-fi fighter girl animes. When I saw the summary I thought \"Hmm they sing and fight this is a silly plot, I may try it though. I don't realy have allot of animes to watch this season .\"  Then I learned that Nana Mizuki(wich is one of my favorite singers) willbe one of the VA's I decided to check it out since it won't be that bad if she is perfectly matched with her character.\\n\\n\r\nIt turned to be better than I originaly expected. The songs were perfectly matched with the fight scenes and characters. It also didn't have those long a*s(couldn't find a better expression) transformantion scenes wich show EVERY SINGLE CURVE(not that I hate it, it's kind of annoying and embarrasing to watch) of the body while transfering to the next piece of clothing they kept them short and relatively fast. They decided to bet more on the songs than fanservice wich magical/sci-fi fighter gril animes have. Aoi Yuuki and Ayahi Takagaki aren't as good singers as Nana Mizuki they still had enjoyable songs for their characters.\\n\\n\r\nThanks to those things the stuff I was able to ignore the generic elements that made up the rest of the anime like monsters and big baddies. Personaly I think they should have concentrated more on the reason they need to be kept secret and the quarrels with America but then they would have needed more episodes. It ended like every other anime like it though with a big monster bad guy.\\n\\n\r\nThe main characters were realy likeable but the personalities are not that unique. Miku felt like the producers were trolling and thinking \"Kekeke! We will make you think that we will develop her more but that won't happen!\" Genjirou was a badass but get's a bit overdramatic and felt like he is here only to add some diversity from the all girl fighter atmosphere. The other supporting characters were realy annoying I'm glad they didn't give a bigger role than they already had.\\n\\n\r\nOverral a realy enjoyable anime despite the major flaws that magical/sci-fi fighter girl types make me ususaly stray from them.\\n\r\nPS: This is my first review and since English isn't my mother's language I may have spelling gramatical mistakes and typos.",
            "date": "2012-04-03T11:40:00+00:00",
            "helpful_count": 7,
            "mal_id": 57823,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/878697.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MartinNik",
                "username": "MartinNik"
            },
            "url": "https://myanimelist.net/reviews.php?id=57823"
        },
        {
            "content": "So after hearing that Symphogear will have a sequel you might be interested if the show is worth watching. I have become interested in writing a review as it was something I didn't really expect to happen. To be completely honest my impression of the show was pretty much just your average mahou shoujo show, but lets take a closer look shall we?\r\nSymphogear was fun to watch: It had high eyecandy value. The action scenes weren't half bad, and the music was decent as it should being an integral part of the show. However, I think the fact of the matter is its lack oforiginality. The members of the cast are part of a secret organization fighting off 'Noise' a creature who randomly appears to rampage and kill. The only way to rid of them of this world is by using symphogear - song powered armor equipment. To be honest it would be an interesting concept if we also didn't have a plethora of other mahou shoujo who are the only hope of saving humanity from oddly named creatures. \\n\\n\r\nThat being said they did attempt to integrate interesting plot devices such as betrayal, or death. However, while a show can be good for having such things just having them isn't enough. The execution is somewhat poorly done, in that you feel as if you should be interested in what is happening, but it doesn't quite affect you as intended. To rephrase, there does exist a story, but it is too hard to emotionally connect to it. I find that as a source of entertainment anime needs to entrap our feelings so we actually care about what is going on in the show. Unfortunately, Symphogear is unable to do so.\\n\\n\r\nThe characters aren't bad. Hibiki after being injured in an accident (in the first few minutes of episode 1) barely escapes death, but instead becomes gifted with powers. She acts the part of the ordinary girl thrown into extraordinary circumstances. Her character is fine for the most part except for her tendency to try and befriend the opposition, although to be honest her rational is sound. One of my favorite characters has to be the section chief Genjurou as he appears to be superhuman, and his manliness was one of the most enjoyable parts of this show. Unfortunately, they don't quite explain why the hell he defies even the laws of this show, but I suppose it will be explained in season two…\\n\\n\r\nOverall, symphogear is an average mahou shoujo show that tries to be more. Now I won't use the word fail, but it just didn't succeed in connecting the viewers and plot. I honestly can't say I would suggest this show to anyone because of that, but of course there can always be exceptions.\\n",
            "date": "2013-02-03T13:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 85739,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=85739"
        },
        {
            "content": "Symphogear is the kind of experience that you'd get if you were watching Futari Wa PreCure and King of Braves GaoGaiGar at the same time while listening to Nana Mizuki music in one ear and Fripside in the other.\r\nIn short, it's AWESOME. But those that are expecting it to make sense will be badly disappointed.\r\nGonna say this up front: The plot is stupid. It's /unbelievably/ stupid.\r\nThis however doesn't matter because it's carried by loveable characters and awesome action scenes.\r\nEvery episode has at least one fight scene, always with fight music, and the action is completely over the top.\r\nBottom line: This is a show you willeither love or hate. There is no in between.\\n\r\nAlso it's VERY GAY. There is only one heterosexual woman in this show, and she doesn't show up until season four.",
            "date": "2018-10-23T13:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 292413,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7498669.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Synchrogayzer",
                "username": "Synchrogayzer"
            },
            "url": "https://myanimelist.net/reviews.php?id=292413"
        },
        {
            "content": "-up to episode 9-\r\nCrying girls fight noise whilst crying and singing. Repeat.\r\nI mean, this show has kept me coming back every week, but it's not the best of the season by far. \r\nTo start clearly. Senki Zesshou Symphogear does what it aimed to do fairly well- but falls apart due to weak characters and, in my opinion, average music. I've scored the music a 7 due to the fact that i know some people will love the whole \"singing while fighting\" thing and that the music will appeal to them in some way; it's not for me though.\r\nOne thing i must praise about this serieshowever- the fight scenes are colourful and well made. it's always nice to see an episode where there is an emphasis on fighting as it's gloriously OTT and frantic and saves this anime from the oblivion of mediocrity. \\n\\n\r\nThe story itself is average and the characters forbid me from getting too interested in it. This anime has failed to really make me feel anything for the characters or the emotional trauma they seem to constantly be faced with; whats left is nothing but forced emotion and melodrama, something which when presented to me usually ends in me giving a show a lower score. \\n\\n\r\nThe story can be summed up as easily as \"girls in mechasuits sing and fight noise\". Everything else is secondary. The reason the noise is there is ambigious and yet to be explained- and perhaps if it gets explained in more detail in the next 4 episodes i'll reconsider giving the story a 6/10. \\n\\n\r\nThe art itself is standard anime fare- the highlights lie in the wonderfully colourful fight scenes and the music concerts. The designs of the mechasuits are quite nice and Hibikis sudden... \"primal\" outburst after a couple episodes of uncertainty was quite nice and i'd like to see more of it. You get a bit of insanohibiki with a black face and bright eyes for a couple minutes but you never really see it again, which is a shame. I'd like to see more of that, Hibiki became slightly more likable when she started fighting the \"noise\", and not simply crying in the corner the whole time. \\n\\n\r\nStory - 6\\n\r\nArt - 6 \\n\r\nSound - 7 (personally, i'd give it a 5)\\n\r\nCharacter - 5\\n\r\nEnjoyment - 6\\n\r\nOverall - 6\\n\\n\r\nThese ratings aren't carved in stone; the show is far from over and i'm expecting something to start happening very soon. I anticipate a clash between the lady with the great engrish skills and our blue and blonde haired heroines very soon. The show at the moment, however, is undisputably average; but still has some potential i hope it uses fully in the final episodes.",
            "date": "2012-03-16T14:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 56107,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503309.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rydia69",
                "username": "Rydia69"
            },
            "url": "https://myanimelist.net/reviews.php?id=56107"
        },
        {
            "content": "This anime will bring you the cringe , fan service and actually good songs/music in a wierd package. \r\nThe story is pretty typical of this kind of anime. Monsters attacking humans and humans having to fight them with special armor. Although i like the twist that music is alot involved in how they fight and that every episode is filled with nice tones. It might get confusing from times but i think most people familiar with these kind of action animes and will know that story isnt always the biggest plot in the world. Specially if they decide to bomb you with boob service orhalf naked girls. This is a common type of things in anime that sounds promising that they make the mistake of packing alot of fan service in it but with no meaning or progress behind it. \\n\\n\r\nWhat drew me into the anime wasnt the story or art it was the music and songs combined with the everything else. The sounds in this anime makes it alot better than what it would be had less of it been in it. \\n\\n\r\nOver to the character there its typical and fairly cliche type of characters. The main or one of them Tachibana hibiki is the typical everyone should be friends you and if you hurt her i will kill you and so on. What im happy about is that when i watched this i didnt have to wait until the final episode until she became usefull there is actuall progress in this character. The second or kinda first you will get to now is Kazanari Tsubasa the cold and beautiful like character. I would say she also share a cliche fault personality about lost love and that she can never get it back and it haunts her. But she isnt overly annoying. \\n\\n\r\nI enjoyed this thanks to the music to a 7 which is in every meaning true because it made the anime alot more fun to watch and listen to. \\n\\n\r\nOverall i would say this anime floats between a 7 and 6 but with my bias music love i chose 7 since i felt that helped bringing the anime a little higher and to a better point. If your fan of nice sounds and like fanservice or can stand it then this anime might be for you.",
            "date": "2017-11-15T16:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 263291,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5327546.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Geddon616",
                "username": "Geddon616"
            },
            "url": "https://myanimelist.net/reviews.php?id=263291"
        },
        {
            "content": "If you are the type of person that likes singing along anime songs, and you know NANA MIZUKI, this is a great anime for you.\r\nI find that symphogear is one of those animes people don't normally see, but as the story goes own you find yourself in a really motivating anime. Which has a lot of music-fight mecha scenes, school scenes where c¡you can ship characters in a yuri way and even have fun with each characters own story, apart from the group one. \r\nI find that this anime, can somehow , like with other animes, motivate me to move ford wars, as the girlsin the anime do so. Fight for my dreams, cause as Hibiki says: \"its alright, keep moving\" . I really think the main character hibiki, is the one that pushes her friends, (rest of characters) to see her reality, how to fight for what you want and how to not give up.",
            "date": "2016-02-05T06:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 210161,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3129211.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Judita_96",
                "username": "Judita_96"
            },
            "url": "https://myanimelist.net/reviews.php?id=210161"
        },
        {
            "content": "People who watch this anime tends to miss some subtle expositions and deems it a plot hole. For example, as to why people still goes outside when noise attacks are so frequent, because it is not suppose to be frequent. Why its so frequent was one of its plot point. I don't blame them because I missed such details the first time I watched it, too, and the dialogues can be quite confusing since they like to use a lot of hard to remember and pronounce names from myths like \"Nehushtan.\" I'm not saying there aren't any plot holes, but not as much people claimsthere to be. The plot was pretty good in my opinion until the last few episode. \\n\\n\r\nThe positive of this show it is total eargasm. They are militarized mechanical magical girls that gain their powers from singing! Also, its not afraid to get bloody. First episode, there was a massacre. The animation quality was good for its time, but later seasons, they became top-notch. However, they seemed to have spent a lot of their budget on the first episode for this season, making the later few episodes a bit lacking in quality, animation wise. However, they fixed that in the blu-ray, so try to watch that version instead. \\n\\n\r\nOverall, its a good watch, especially if you like, sci-fi/mech themes, and good music. However, proceed with caution if you are expecting a oscar winning plot.",
            "date": "2015-12-11T18:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 205277,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zeakchi",
                "username": "zeakchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=205277"
        },
        {
            "content": "Very interesting mix of genres. At first I didn't expect all  the action that was to come and then \"BANG\". It seems like just a drama at first but then it kicks into high gear. I love the characters and it was sad what is happening to the characters. To be as ambiguous as possible there is one unfortunate occurrence and one unfortunate foreshadowing within the first episode. This seems like it's going to take a much darker tone than the introduction may make one believe, with the pop singing duo and all. Great art, the sound quality on the streams i'm using arenot that great but being in the music genre I can only assume the sound to be above par, but mostly I like the charterers and can't wait to see them develop.",
            "date": "2012-01-28T08:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 52725,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1122607.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/velkro16",
                "username": "velkro16"
            },
            "url": "https://myanimelist.net/reviews.php?id=52725"
        },
        {
            "content": "Who doesn't love watching girls with swords and fighting and are equipped with oh-so-awesome robotic, futuristic weapons? That's my kind of genre.\r\nWhen I found about this anime, coming for 2012, I was like 'hey! I'm looking forward for this one' for I was captured by the teasers, plus not to mention Nana Mizuki was one of the dubbers. So I was like really expecting BIG for this one.\r\nOkay, to be honest, I was fascinated by the opening song! The soundtracks were good, and they can bring up a good fighting atmosphere, giving the main characters a 'tough' aura.\r\n Then the first episode showed alot of stuff leaving the audience wanting more. The fighting scenes were awesome, though I find it annoying how they jump from one scene to another without giving much detail how they got up into that scene. Anyway, the flashblacks were a bit helpful to hold their audiences, like in the first episode where we can see Miku crying and the city was ruined by unknown causes, then a flashblack from 2 years before that catastrophe happened. \\n\\n\r\nThe animation wasn't that bad, the characters were not that bad either.And also there are strong hints of shoujo-ai here. The plot was very predictable, or maybe, we can say, the 13 episodes didn't suffice the whole idea of the story. I can say that the idea of using this ancient relics activated by a song, and then used as a powerful weapon through the help technology, is very creative and simply astonishing. But they didn't give an awesome plot for this awesome idea. Too bad.\\n\\n\r\nThe ending. Oh god! twas really horrible. Everything  happened in a very fast manner that they fail to give a splendid and satisfying finale. \\n\\n\r\nBut hey! I'm not saying you should pass on this one, people had diff'rent points and ideas. And if you're fan of fancy girls in a armour kicking alien butts, well, this one's for you:) \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2012-04-09T09:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 58389,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1141163.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/dabitchness",
                "username": "dabitchness"
            },
            "url": "https://myanimelist.net/reviews.php?id=58389"
        },
        {
            "content": "This show is just absolutely incredible. All of the emotions and action that they put into such a small amount of time in each episode (only 1 so far out of a total of 13). I love the two women of Zwei Wing, Tsubasa (blue hair) and Kanade (red hair). They're like the musical version Panty & Stocking (who are both so amazing).\r\nThe story for this show consists of various elements to achieve a sense of loss but then of gain from the viewer. It does seem to be a bit confusing at times with how much it jumps around the time line from presentto past to present to past and so on so forth. Because of this I am forced to give the story an 8.\\n\r\nThe art and animation are pretty good. Everything seems so soft and pretty until you get to the Noise monsters. They are so not kawaii at all and it feels like they don't belong! What were they thinking?! The concert looked okay but I would have preferred something more along the lines of a Glee concert ^_~. Art gets a 6, my favorite number! desu\\n\r\nNow sound, the most important part of this show because it seems to have a huge focus on music! I thought the lyrics in the song that Zwei Wing sang towards the beginning of the first episode were kind of cliche and lame. But then using songs to battle enemies in their robotic suits? Infinite Stratos (yay!) meets Macross (boo!). Sound gets a 5 from me! Too bad they don't do uber kawaii versions of known pop songs that have actual meaning to them! But maybe there will be better songs in the next 12 episodes, but who can say for sure? It's not like waiting to hear them to write my review is going to change anything! Wa ha ha!\\n\r\nCharacters! Like I said before, Tsubasa and Kanade are awesome! Panty & Stocking who can sing and fight monsters are so awesome! But the main character girl, whatever her name is ( I could easily look it up but I'm too lazy teehee), she seems pretty average. Nothing special about her except that she's dead or something. But not. It's so confusing all this jumping around through time! I'd rather watch The Girl Who Leapt Through Time! Characters gets a 9 out of 10!\\n\r\nThis series seems to be chock-full of sorrow and loss and dark humor. Lots of people start dying all the time and cry a lot. A couple of the songs were pretty sad too. So I'd have to say that this show will be a very sad one and not enjoyable at all. Everyone knows that if the first episode of a show is bad, the entire show is bad (Bokurano = PROOF)!. 3/10 for enjoyment!\\n\r\nOverall I will have to give this show a 9! The characters are clearly the best part, and that can be said about any show! That's the most important part! Not the story, and clearly not the art or sound. If you have good characters, anything becomes good! Overall  I shall give Senki Zesshou Symphogear a 7!\\n",
            "date": "2012-01-11T22:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 51595,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1099383.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 3,
                    "overall": 7,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JudgeTheCover",
                "username": "JudgeTheCover"
            },
            "url": "https://myanimelist.net/reviews.php?id=51595"
        },
        {
            "content": "Fight through the power of friendship, rage, hentai or through a never give up attitude.? Fuck all this power ups because through the power of singing you can beat everything and everyone and yes you heard right now we have it all.\r\nThere are two kinds of anime with stupid plotlines, at first we have anime that are stupid but are still good because they are stupid and we have anime that are stupid and you're just thinking what the fuck I watching right now.\r\nSenki Zesshou  Symphogear is one of the second one. It has one of the most stupid plotline I ever seen. Evenif you could possible like the stupid idea of gaining power through singing, the whole story is just bad. They have just throw some words from sagas like gungir and singing and voila you have an anime like Senki Zesshou Symphogear. \\n\\n\r\nEven this review isn't worth my time for a shitty anime like this but because I was clueless how bad it is and how stupid the character's are I don't want people waste their time like I did.\\n\\n",
            "date": "2018-02-22T15:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 272201,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5232502.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Eromanga-sensei",
                "username": "Eromanga-sensei"
            },
            "url": "https://myanimelist.net/reviews.php?id=272201"
        },
        {
            "content": "Story 6.5/10: Like normal, we are thrown into a AU where you are expected to accept what is going on, and there's nothing wrong with that (how else would any anime work off of pseudoscience?). For what they do give us as explanations, I will admit, it is a little shaky, especially the final blurb they try throwing in at the end (watch it and find out). Overall, I give the story a 6.5, but rounded up.\r\nArt & Sound 10/10: Very well drawn and animated; interesting abilities for each of the characters are executed nicely. Very music driven anime with original songs (to the pointwhere each character has their own CD), each character has their own style, so the chances of finding one you like goes up. Almost worth the watch based on these two factors alone. Only comment about the art is the occasional accentuation (you can guess of what), but it's nice that it isn't turned into the focus with excessive bouncing or anything of the sort, it's solely just the art style (except for maybe one scene).\\n\\n\r\nCharacter 7/10: Just your average characters with prescribed roles. Despite any character development that may take place, at least 90% of it is predictable. I won't fault an anime for doing this (since it's tough to be original), I will only find fault with HOW they did it. Of the three main characters, you have: the friendship uguu one (as a friend of mine described her to me); the \"I locked my emotions away after a tragic loss\" character that starts with \"you'll never replace my last partner\"; and the \"I was taken by a villain as a child and lied to my whole life\" character that comes to find out the truth about what she was told.\\n\\n\r\nEnjoyment 8/10: Good fight scenes will always add to the enjoyment factor for me, even if some of the weapons/attacks seem to appear out of nowhere (again, drawn/animated very well). Hibiki and Miku are the purest of unofficial lesbians. The music is a great addition/necessity of the show that aids the fight scenes.\\n\\n\r\nI had heard the name of this show tossed around a bit, so when I expressed interest in it, it came with regards from a friend whose opinions/reviews of anime I respect. I can say I do not regret the decision to watch this show because I did enjoy it, and I do recommend it myself.",
            "date": "2016-06-28T10:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 222258,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5499371.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Prof_Telperion",
                "username": "Prof_Telperion"
            },
            "url": "https://myanimelist.net/reviews.php?id=222258"
        },
        {
            "content": "The biggest reason to watch this show is the action. That and the music if you are so inclined. \r\nFor a show that seems to have an emphasis of music, its really just what the girls use to transform into their gundam-esc power suits to destroy all the enemies in their path. Its really just a theme the show uses as a backdrop, but nothing really gets explored with it.\r\nThe characters are pretty bland overall. Don't go in thinking it'll have too much character development. Its usually just enough to get the characters to work together to destroy the \"noise,\" which are the enemies. \r\nYoucan even see the plot twists coming from miles away too. So yeah, plot isnt too big of a deal. Its a pretty, by-the-numbers, affair.\\n\\n\r\nAs far as the action goes though, it's superb! Even from ep 1, you see alot of great animation throughout the fight scenes. Throughout the show, the fights just get better, as the stakes get bigger and the main girl starts to get better at fighting. Especially in the final ep where it gets as epic as possible for a final battle.\\n\\n\r\nThis show isnt great at anything but action honestly, but if you want to see girl punch through monsters, and have special moves and whatnot, give this show a shot. Otherwise, its just a bland show with bland characters that look pretty cool, or silly, when they are suited up.",
            "date": "2012-04-03T18:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 57853,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/469773.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/linkdude777",
                "username": "linkdude777"
            },
            "url": "https://myanimelist.net/reviews.php?id=57853"
        },
        {
            "content": "A few moments in the first few episodes will convince you that you might in for some Madoka/Evangelion level of genre-subverting writing.  That never happens.  This is a very basic story about friendship between little girls and fighting to save the lives of others.  I think I would have enjoyed this show a bit more if I didn't have any expectations for it.  I do remember there were a couple action scenes that were pretty good, and the characters aren't *horrible*\r\nI don't like that it sucks you in by presenting an epic struggle between these powered up songstresses and an overwhelmingalien force, and then just kind of puts that in the background and focuses on little girls and friendship.  It's that kind of bait-and-switch that has turned me off to several shows.",
            "date": "2012-10-26T10:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 75959,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/K0NR4D",
                "username": "K0NR4D"
            },
            "url": "https://myanimelist.net/reviews.php?id=75959"
        },
        {
            "content": "Symphogear\r\n\tTLDR; it's a techno-magical girl show where the characters derive their strength from myths and relics through the power of music. The animation, while not spectacular, is at least good if not above par in most areas. The music is used skillfully to compliment the show, as well as being the basis for it. The plot is not leakproof and the writing could be better, but there are moments where the writers clearly knew what they were doing, and I feel that it's enough to salvage the show into the “good” category. There are much more poorly written shows out there. It could have beengreat, but they just didn't quite make it there. Ultimately, the setup for season 2 probably hurt the show a bit. The characters are likable for the most part, and not so extreme or overbearing as to be obnoxious. Along the journey, there are even some good laughs.\\n\\n\r\n\tIf you like Macross, mecha and mahou shoujo, give it a go.\\n\\n\r\n\tThe extended version;\\n\r\n\tFirst the honest truth; I dropped the show after one episode. Later, I gave it a second go and found that I had misjudged it, but I still wanted to turn a critical eye to it since it was a show that at two different times, I had totally different reactions to.\\n\\n\r\n\tThe music; the core and its application;\\n\r\n\tIt may seem obvious, but a show about music, had better have good music, right? It does. Don't worry about that. The folks handling the show know how to use that music, too – scores and tracks are cued at the right moment and lend a great impact to what's going on, right from the get-go with the opening sequence. The final scene  of episode one I find very memorable thanks to the use of the opening theme and the sound effects used with the visuals. The MC's debut is handled in a similar fashion, matching up with her music.\\n\\n\r\n\tThe animation;\\n\r\n\t Initially it seems that the quality drops off after episode 1, but after further review I simply don't think that's true. The animation in the opening concert is of a completely different nature – not skill – than the rest of the show. The concert consists of wide-angle views with very little drastic camera motion, in contrast to typical anime camera movements. What you're seeing the characters do (a choreographed performance lacking complicated camera angles/cuts) is too hard to compare to a hectic fight scene. The fighting in episode 1 is pretty well the same quality as the rest of the show, perhaps being more concentrated in a bid for viewers.\\n\r\n\tThe rest of the show, while not animated to Gainax levels of splendor, is not done poorly. Fights have fluidity, good cuts and use of the characters. There are some stills and reuse. Now, I don't necessarily condone re-using animation, but I can't really crucify a series for having some it of – it's pretty common in a lot of older shows that I hold dear and even some newer ones. Attacks are executed with a sort of retro/classic take on things, with stylized themes that are presented relaying the name of the attack. Usually these come mid-way through execution, but it's not like they're a still frame that is being slid around to replace character motion. They're a stylized flourish.\\n\r\n\tThe show flexes its animation muscles several times, and each time it's a little different. For example, a fight between two Attuned (symphogear users) early on is very different from the MC's debut fight. The former is executed with wide-angle shots that the characters move rapidly and fluidly around in, rather than the latter which contained a lot of rapid cuts, impact and extreme camera shots.\\n\r\n\tThe show manages to avoid those weird in-between frames too, where characters look downright wrong as they transition. They also get bonus points for not using CG that stands out like a sore thumb for the Noise – it would have been so easy to do.\\n\\n\r\n\tLet's talk about likability;\\n\r\n\tThe show pays some amusing homage to cultural icons. Using familiar things in this way is a pretty classic way to get people on board, and I had no problems with it. I actually love it when shows reference things like this. (Like Slayers showing up on the magazine cover in Full Metal Panic, or Love, Elections and Chocolate being referenced in Sasami-san@ganbaranai)\\n\r\n\tThis show happens to be one of the rare instances for me where the MC is my favorite. It's also a rare show because I actually like most of the characters, save for one. Hibiki is not exactly original, but she is cute and her design and writing paired with Aoi Yuuki as her voice actress manages to pull off the clumsy, unsure but determined and headstrong character (at least she isn't useless as well, as that archetype can tend to be). Tsubasa does well supporting with her cold, emotionless exterior. The whole second branch crew, from Genjuro to Sakurai and Ogawa are likable and have an air of mystery about them. Especially Genjuro, who has an unexplained strength that the writers manage not to abuse as a convenient plot resolution device.\\n\r\n\tI mentioned earlier that there was only one character I didn't like; that would be Chris. I felt she was the only one that was a bit too much of the typical. She was trying so hard to be that kind of character that it was sort of obnoxious.\\n\\n\r\n\tLet's talk about the writing;\\n\r\n\tSymphogear is guilty of introducing new elements a bit too late into the plot, but I hazard a guess that this is due to their hope for a second season. The writing, while not great, is passable for a fresh franchise. It could have been great, if they had done just a few things differently. But, they managed to salvage it. I can't say how since it's ultra-spoilery, but if you decide to watch the show, just look for the specific events that connect the beginning, middle and end of the show in a symbolic way and you will see what I mean.\\n\r\n\tOne of the great lines of the show has to be, “the heels are in the way!”.  I know other people have noted this particular line, too. It seemed to me like a stab at the impracticality of having what are essentially high heels on your battle armor or mech. How do you solve that problem, anyways? Well, if you're Hibiki, you just break them right the hell off and go about your business. If this is the female writer in charge of the show trying to say something, then it's even more awesome.\\n\r\n\tSymphogear also touches on a few things that I thought were important to its quality as a show. It poses a question that's been asked before; if there was a common enemy, would humanity unite against it, or would they keep fighting each other?\\n\r\n\tThe other topic is survivor's guilt. It's a pretty serious thing to bring up in a show that bounces between the sad and happy, being related to PTSD and all. Thankfully it doesn't weigh too heavy on the show and take the fun out of it, but it is a nice bit of writing/insight into the characters.\\n\\n\r\n\tLet's talk about... fanservice;\\n\r\n\tWell, I'm not really a fan of fanservice, and thankfully it's limited to a small handful of unflattering camera angles of the heroines. I count this as a net positive for the show. If you're looking for that sort of stuff, this show probably isn't for you.\\n\\n\r\n\tLet's talk about the usually ill-conceived romance that plagues a lot of anime;\\n\r\n\tThere is none! (I feel like we dodged a bullet with this one)\\n\r\n\tI'm happy about the total lack of romance, largely because in anime romance tends to be very transparent, poorly done and predictable. You could argue that there's a romance between Hibiki and Miku of the platonic sort, but I'm inclined to just call that a very long friendship. While it can be fun to see your favorite character go through the (often painful and hilarious) trials of love, I think that unless the series is more or less centered around that element, it should be avoided because it will be poorly done.\\n\r\n\tBesides, the Attuned gals of Symphogear don't have time for that shit, to put it frankly.\\n\\n\r\n\tI feel like the show received a lot of harsh criticism that wasn't entirely warranted. Other shows skate by with many more egregious offenses and are still lauded and loved by many. I'm not excusing the things that the show did wrong, but most of them weren't so blatant or in-your-face as some of the crap that the big name shows pull on the viewers. Also, being an anime original with a manga accompaniment, I feel you have to give them some credit – the show was not directionless and the pacing was decent, which is more than you can say for a show like Occult Academy. Plus, for Symphogear, we're talking about a show that has a staff with very little credited to them as far as director, writer and Encourage Films are concerned. Their production was backed up by the veteran Satelite.\\n\\n\r\n\tThe last thing I want to touch on is the absurdity of the show; in both the setting, mythos and design. Yes, they are magical robo-amored girls that fight colorful, amorphous blobs with music and holy relics – when hasn't mahou shoujo and mecha been pretty well ridiculous? Throw in a dash of fight them with music”, and the party is ready to start. Just go with it. Don't start comparing it to down to earth shows, because it's not really a comparison that you can make. It's probably one of those shows that's best left to people already familiar with Anime, because it's pretty far out there.\\n\\n\r\n\tAll things considered, I think it came out well. I'm looking forward to season 2 (which has picked up some veteran staff apparently), and I hope that the franchise expands to give us even more than that. \\n",
            "date": "2013-07-02T02:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 103433,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hanisuave",
                "username": "Hanisuave"
            },
            "url": "https://myanimelist.net/reviews.php?id=103433"
        },
        {
            "content": "If you think this series is about girls with armors fighting while singing, you're absolutely right. Unfortunately, that's all that worth praising (assuming that this idea is original as I'm quite new to anime).\r\n1. Concept - 5\r\nThe near-future setting is quite common for anime these days, but what grabs me to check out this show is the interesting idea as stated above. Despite the unique idea, this show fails by throwing in numerous bad inconsistent ideas such as deforming armors and weapons that beat the shit out of your common sense and of course the retarded logic of a national defense HQ located right belowa local high school. \\n\\n\r\nThe ideas aside, the way this series handle the concept is poor. Although they make time to explain the important rules and bits with pretty much nonsensical bullshits, they are unable to follow them decently throughout the series.\\n\\n\r\n2. Plot - 6\\n\r\nThe plot of this series is somewhat disappointing as it starts with a promising serious tone but ends up as one of those forced nonsense of a plot. basically this series is trying to tell us about the story of high school girls saving the world with their own personal issues in the way. There are also horrible cliched plots and moments that I passionately despise such as the infamous bad guy turns good plot device. Despite the horrible story, pacing and the storytelling aspect is done quite decently. \\n\\n\r\n3. Art - 7\\n\r\nMost of the scenes in this series even the action scenes are hand-drawn without expensive visual effects. Though the semi-CG concert scenes at the start of the series are done well, they are unable to maintain the quality to the rest of the series. The art style used is quite common for anime these days with decent shading despite the inconsistencies. There are not much background detail given though the characters are drawn well with good details.\\n\\n\r\n4. Character - 6\\n\r\nCharacters in this series are visually designed well however their characteristics and actions doesn't resemble that of a human I can empathize. If you think this is a pure sci-fi series like Infinite Stratos or Gundam, you're wrong because there are characters that stomps on physics laws and common sense without any sci-fi reasons or explanations at all. This might be a mistake on the studio for not explaining things or just a poor case of character designs. The relationships between the characters are laughable, an example would be the implied love relationship between the possessed main antagonist and the chief of the organization.\\n\\n\r\n5. Animation - 7\\n\r\nThe first episode is animated surprisingly well with good particle simulations and fine CG animations though that is not the case for the rest of the series. The animation style of this series' action scenes resembles TTGL though with lower quality. As for the non-action scenes animation are done decently bad with inconsistent detailed movements and poorly animated backgrounds. \\n\\n\r\n6. Sound/Music - 8\\n\r\nThis series is about girls fighting while singing so there's bound to be a whole list of songs, some are bad, some are decent, and some are actually good. I am no judge for this particular aspect, so this might be more of an opinion. My favorite would be the OP for some reason that I cannot explain. Music are mostly played on action scenes therefore it brings down the emotional value when played on emotional scenes. Sound effects are quite good in this series as they have a slight variation for every sound effects they use. \\n\\n\r\n7. Enjoyment - 3\\n\r\nI find a bit of a pain while following this series as the main plot twist is as obvious as the nose in Voldemort's face. The only thing that managed to surprise me is the last plot twist, and not in a good way.\\n\\n\r\nfinal score= (5+6+7+6+7+8+3)/7 = 6\\n\\n\r\n8. Others\\n\r\n- Good Directing (+0.25) : There are times that this series managed to impress me by good camera angles, movements, and screen composition.\\n\\n\r\n- Forced End (-0.2) : The ending of a series is the most dominant factor to leave an impression on the viewer. If its done badly, it would be remembered as a bad series overall.\\n\\n\r\n- QUALITY issues (-0.1) : Those who followed series week-to-week and discussed it must have known the corridor scene at episode 3.  \\n\\n\r\nFinal Score = 6 + 0.25 - 0.2 - 0.1 = 5.95 = 6\\n\\n\r\nIf you happen to pick this series, I advise you not to take this series seriously despite the first episode...",
            "date": "2012-04-17T00:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 59021,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EndlessHell",
                "username": "EndlessHell"
            },
            "url": "https://myanimelist.net/reviews.php?id=59021"
        },
        {
            "content": "This show varied wildly from stupid fun to just plain stupid. Every scene they weren't in their super suits was dreadful. The forced drama and over the top reactions clashed wildly with jpop idols in skimpy song-powered mecha suits. Why does this show have a torture scene that comes out of nowhere and is never referred to again? Who thought that was a good idea?\r\nThat being said the fights are over the top BADASS and really capitalize on the silly concept. The jpop is solid, but if thats not your thing then you're missing out on a huge part of this anime. \r\nOverall I'd suggestthis only if you want to shut your mind off and have some braindead fun",
            "date": "2015-09-27T21:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 199933,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1537149.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SuperANON",
                "username": "SuperANON"
            },
            "url": "https://myanimelist.net/reviews.php?id=199933"
        }
    ],
    [
        {
            "content": "The plot loos interesting at first sigh: some creatures named Noise attack people and with the power of songs some selected people can fight them. But then, at the middle of the anime you can say: What is this anime all about? The anime waste too much time in blah blah blah. Is the feeling I have when I saw this anime. the first episode and 12 and 13 are the only one interesting of all the anime.\r\nAbout the art is really simple. Maybe the suits of the main characters are the only interesting. The design of the Noise are attractive but strange.\r\nThe songs arethe only interesting thing of the anime. This anime can consider a magic girl anime. The girls can transform with a song: If they sing a song they can transform and fight. They also sing while battling the noise, but personally if you hear too much times all the songs (including OP and ED) you will get tired of them and maybe hate them. Be honesy: you have a fave song that no matters how many times you hear, you will never get tired of it. This, personally, won't happen with the songs of this anime.\\n\\n\r\nIf you see detailed, you can see stereotypes in the characters. The girl that all people abandoned and in the present because of that hate all. The protagonist, Hibiki can enter the typical magic girl anime: She won't fight the enemy because is immoral, or maybe she want to talk instead of fighting.\\n\\n\r\nSometimes the animation is so lame, horrible. In the battles are good but most of the times you will see that characters walks like robots. Also in the concerts are good. Conclusion about the animation: They put attention to make good animation, sometimes not, if you see at detailed you will notice this.\\n\\n\r\nEnjoyment: If you really like music you will love this. But is the only good point of this anime. To be honest, I don't know why I finish this anime. Is pathetic, the worst anime of 2011 winter season.",
            "date": "2012-04-07T14:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 58185,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11330.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/minimiau",
                "username": "minimiau"
            },
            "url": "https://myanimelist.net/reviews.php?id=58185"
        },
        {
            "content": "What a strange experience. This anime came out in 2012, I was 16 and I think I was just a little bit more of a weeb than I am now. Or, I should say, it was more difficult to be objective and way easier to judge shows by their popularity and cute image. And now, looking back at this show (please, excuse me, I have only seen the first season and at the moment I can't decide whether I should watch the rest or not), I can't help but think of how painfully average it is.\r\nStory: 5/10.\r\nThere is nothing new about alien races trying toconquer or destroy our planet for some reasons. And what does the world need when aliens come and refuse to 'do as the Romans do'? Some heroes that will kick the aliens' butts because my, that is not a way to behave when you're a guest in a new world. And what aces do these heroes have in this show? Songs. Yeah. They sing and fight. And that's it. Plus a bit of angst here and there. For atmosphere. And emotions. Otherwise the audience will get bored, right?\\n\\n\r\nArt: 9/10.\\n\r\nOkay, let's be honest. It's beautiful. Character designs are interesting, I loved their outfits and overall, it was, indeed, a nice sight to behold in terms of art.\\n\\n\r\nSound: 7/10.\\n\r\nOh how I want to make a joke about the musical aspect of this show, saying that their singing is so bad it kills monsters as their ears bleed and they meet their painful end in agony. But nope. The soundtrack is good, we have a great cast of voice actors (Minami Takayama, the voice of Irene from Claymore, yes, please) and the songs, despite being a perfect example of Japanese pop music, are catchy. Please, send help.\\n\\n\r\nCharacter: 6/10.\\n\r\nI started watching this anime because of one character that seemed interesting. This character died in the very first episode and I'm not sure if I should laugh or cry because oh my, what an irony, what a cruel world!\\n\r\nThe rest of the cast (at least in this season) consists of an edgy teenager (Nana Mizuki can't save you, Tsubasa, you're annoying), an overly optimistic girl (now don't get me wrong, I admire optimistic people, but when a character is sooo optimistic and sooo positive, it's too sugary, pardon me) and a tsundere (the character I liked, at least back then, when I was 16 and kinda like her personality-wise).\\n\\n\r\nEnjoyment: 6/10.\\n\r\nIs it bad? Surprisingly enough, not really. It was an interesting, but weird experience. I can't say I hated it or hate it now. I don't. But it's not the kind of show I am going to re-watch. Saw it once and that was more than enough, which is kind of sad because I tend to go back to shows and movies I liked.\\n\\n\r\nSymphogear is not a disaster. It's just okay. It's not outstanding or special, but it is not exactly a catastrophe either. Just an average show that might help you kill some time, but don't set your hopes too high.",
            "date": "2017-06-18T05:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 250229,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5260988.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Waffle_Empress",
                "username": "Waffle_Empress"
            },
            "url": "https://myanimelist.net/reviews.php?id=250229"
        },
        {
            "content": "I literally just finished watching this series, and I knew immediately that I had to write a review for it. \r\nFirst off, if you despise cliches, plot devices, sudden plot twists, and massive inconsistencies, this anime is not for you. Personally, i managed to ignore most of it and make it through the whole anime, and I'm looking forward to season 2. Lemme give a quick opinion of it before i go in depth. \r\nThis is probably the most cliche anime i have ever seen. It has everything: A super suit based on ancient technology that is superior to current technology and can be activatedby singing. A cold character with a tragic loss who hates the main character at first. A useless best friend who somehow manages to appear as important, and is heartbroken that her best friend kept a government secret from her. A evil tsundere character who is first evil and them becomes friends with the protagonist, after being abandoned by the psychotic villain whose motivations and back story don't come into play until the last three episodes, and even then make little to no sense. And best of all, its got clumsy, completely average, not really smart protagonist who got dragged into some major problem by accident, and values friendship above everything else. Couple that with the fact that the cannon fodder villains (the Noise -how is that for a creative name in an anime about singing?) are actually pretty cool looking, and not really all that scary, and you have Senki Zesshou Symphogear. \\n\\n\r\nNow for the real review. \\n\\n\r\nStory: 8\\n\r\nI give it an 8 because it is actually a really good story line, if somewhat horribly executed and cliched. Sure, its been over done, but i like to think of it as a classical anime around which all generalizations are based. There quite a few discontinuitiesbut none of them are really major enough to make think \"the heck?\" Aside from their suit weapons, and their attacks. Basically, Hibiki, protagonist, goes to a concert, where the Noise attack. The concert singers, Kanade and Tsubasa, are users of Symphogear, a government secret, and the only weapon that can defeat the Noise, and its activated by singing. In trying to protect Hibiki, Kanade is killed, and a piece of her Gear is stuck in Hibiki's heart. This is what makes Tsubasa resent Hibiki at first. Now here is the weird part. The school that Hibiki and tsubasa, and everyone attends is for singing, yet the only time Hibiki really ever sings is when she fights. its not like she has a passion for it all or anything. She just can. Anyway, Plot gradually progresses, after several fights with the Noise, the first of which is incredibly dramatic and activates Hibiki's Symphogear embedded in her heart. Eventaully, you meet the thrid Gear user Yukine Chris, and her boss Fine, who is the main evil villain. I am not going to explain anymore for the sake of spoiling, however, from then on it does have some good story. There are detailed explanations of quite a few things, and almost nothing is left to chance. It is pretty good. \\n\\n\r\nArt:10\\n\r\nThe only reason this got a 10 was because i love the Noise and the Symphogear. The designs are very ingenious especially for the way some of the weapons on the suits are used, particularly Hibiki's. The art of the concerts great, especially with the lights. However, the Noise take the cake. Though they all kind of look the same, i love the color schemes and the way they shimmer. The Elevator Shaft lead to Sector 2 is also very artistic. The only thing that bugged me was how big and overused the explosions were and the fact that so many things still survived inside the blast radii. \\n\\n\r\nSound: 9\\n\r\nSound is based on the noise the Noise make and of course, the singing. To be honest, some of the songs, to me, particularly Tsubasa's, are kind of lame. I especially hate the way that even after they activate their gear, they keep singing, their mouths moving and everything. If the song wanted to continue thats fine, but them singing it is a bit too far. However, the theme song, and the gear activation songs are really good. I particularly like Yukine's song. \\n\\n\r\nCharacters:8\\n\r\nThe reason for the eight is in the first over view. They are cliche, and some of them are just plot devices. However, the concept behind them i liked, despite their being overused. My favorite character is Hibiki for her hyper active stupidity. I think her relation with Miku is great, even if somewhat over emotional. I love the way one of their friends keeps yelling \"this isn't an anime\" *sigh* if only you knew. \\n\\n\r\nEnjoyment: 9\\n\r\nDespite all my hates, i really did enjoy watching this. It wouldn't surprise me if most people disagreed, and hated it, but i think it was okay. It definitely wasn't the best, but it was way better than some other anime. The fights were really good, if somewhat over dramatic. And there is some good laughs to be had. \\n\\n\r\nOverall: 9\\n\r\nBut hey, that's just me.",
            "date": "2013-10-24T13:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 118129,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3121995.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mythical_Truth",
                "username": "Mythical_Truth"
            },
            "url": "https://myanimelist.net/reviews.php?id=118129"
        },
        {
            "content": "I'm going to be honest in that I'm writing this after having also watched Symphogear G, so I will admit I am more willing to forgive some of the weaknesses in the plot, as a lot of them were solved. \r\nSymphogear's first episode, like much of the advertising for the show, was misleading. It makes the show out to be a lot darker than it is, the show isn't another Madoka in terms of how dark it is, but the first episode certainly does paint it that way. The show as a whole is about communication, which shows when the only human antagonists we getare characters who refuse to, can't, or find it worthless to communicate with others. If you want to stop reading now I'll say in short that I believe Symphogear is a fun magical girl romp with well written characters, good design and music, with it's main weaknesses being that the art can sometimes falter, and that if you're not paying attention you can lose the plot fairly fast. \\n\\n\r\nSymphogear has a simple enough story when you strip away the specifics of the characters. The cast is what makes the show worth watching, Hibiki on her own is a wonderful protagonist, she's overly kind and fond of food, and is only balanced out by her (girl)best friend Kohinata Miku. Hibiki's history is what makes her overly kind nature work, as other members of the cast say \"A girl who's willing to throw herself into the frontlines just to help others seems twisted\" and she is. Hibiki's happiness and kindness is her shield and her sword, it protects her from the things that scare her most, and allows her to fight to her fullest, or to take the time to talk. Her powers grow and grow to ridiculous levels, and unfortunately in the first season we only get scraps as to why, but that idea is completely fleshed out in the second season, as are many other things that make Hibiki one of my favorite characters. Not only that but her relationships with the other characters helps to make the show what it is. Her interactions with Tsubasa and Miku in particular brings development to all of the characters involved, and helps them flesh out.\\n\\n\r\nTsubasa is our second magical girl, a cold and unfeeling character at first. The first episode shows us what Tsubasa was like before the start of the show, she was sweet and shy, but  after those events Tsubasa considers herself nothing but a sword. She sees herself as a weapon to fight the Noise, and holds with her guilt and feelings of loss that drive her character to grow and change. As she grows she further proves her worth as a mentor to Hibiki, changing from a sword to a warrior, and learning that she's more than just a weapon. Her development is natural, and the change only occurs after a period of introspection.\\n\\n\r\nThe other characters are no less well done, but for the sake of keeping this review at a readable length I'll cut the details and say that any characters who matters is given the development they need. \\n\\n\r\nAs a show that's plot is music heavy Symphogear sports a fantastic sound, with each character getting a unique character song that highlights each characters personality.  They're all unique and good in their own rights, and as the characters change, hearing the songs really relates how far they've come. \\n\\n\r\nThis show really brought a breath of fresh air into my watching schedule, and gave me a female protagonist to point at when people ask me what I think makes a protagonist good. The art wasn't up to snuff when it was broadcasting, and I chalk that up to budget, but with the DVD release those issues have been solved. I leave the art rating relatively low because there was a lot that needed to be fixed after the original broadcast. \\n\\n\r\nOverall I think Symphogear is under appreciated, it has it's issues, but each pitfall is followed by a mountain of reasons to let it slide. It's not perfect, far from it actually, but the shows stands well, and is enjoyable.",
            "date": "2014-10-06T15:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 163887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2552703.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tech-nique",
                "username": "Tech-nique"
            },
            "url": "https://myanimelist.net/reviews.php?id=163887"
        },
        {
            "content": "I had pretty decent hopes for Symphogear, and even stuck it out through some of the sillier episodes in hope that the darker aspects of the show would become more developed.\r\nHowever, unlike Madoka, this show fails to deliver on a deeper level.\r\nBasically, it's a cheaper, less aesthetically and mentally pleasing version of Madoka; if you want entertainment, go with the real deal.",
            "date": "2012-03-09T18:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 55649,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/425068.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SuchADojikko",
                "username": "SuchADojikko"
            },
            "url": "https://myanimelist.net/reviews.php?id=55649"
        },
        {
            "content": "An anime about combat enabled by singing power in a similar fashion as AKB0048 with some drama that worked fine in a short 13 episode series. \r\nStory 8/10\r\nPoints taken off for minor plot holes and a few eye rollers. Every battle had a clear reason as why the Noise is attacking which much more enjoyable then a series forcing a battle every episode ending with the bad guy retreating and attacking the next episode. While the first season wraps up the story line, there are hints for what what to come in season 2.\r\nArt:7/10\r\nI am not a big critic of how an anime looks, butthe use of CG for a mass of people or cars is a distraction. The use of manga art for Hibiki touch battles was a nice touch.\\n\\n\r\nCharacter 8/10\\n\r\nOther then Hibiki's naive look at the world, I enjoyed how she developed a lot. Everyone else suffered in character development because series was limited to 13. \\n\\n\r\nEnjoyment 9/10\\n\r\nI was pleasantly surprised by how much I enjoy this series for how low this series ranks. It dose some things differently then most magic girl series that made the series good. \\n\\n\r\nOverall 8/10\\n\r\nMagical girl, singing, and drama. Don't skip this anime if you enjoy any of these.",
            "date": "2015-09-22T18:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 199267,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1456861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mariox7777",
                "username": "mariox7777"
            },
            "url": "https://myanimelist.net/reviews.php?id=199267"
        },
        {
            "content": "Saving humanity through song!...no seriously this is a thing.\r\nOk, LA knows this anime's premise sounds weird and this anime knows it and embraces it in all it's weirdness and seriousness. Yes this anime does take itself too seriously at times with some over dramatized melodrama at times (mainly through characters lying to some character not liking each other for backstory reasons) and too laxxed at times considering the mood it wants giving us a bit of mood whiplash from time to time. \r\nOk enough about the weirdness of this anime, let's move onto to characters. The characters are your stereotypical characters, we have the passionateone who's also OP as hell, the cold-hearted one but opens up later and ANOTHER cold-hearted one but is an anti-villain but opens up later on. There does seem to be some inconsistency towards some of the characters sudden change in behaviour \"because plot\" this especially goes to Tsubasa. \\n\\n\r\nLA's favourite character would actually go to Chris Yukine voiced by ''Ayahi Takagaki'' as although her backstory is dramatized as hell, once she comes around she's the least annoying. In terms of character development it does bounce from character backstory to character backstory to reinforce the \"bonds\" of the main cast in some way. However on speaking of backstory, the main villain of this season's backstory was rather rushed in an info dump kind of way as the reveal of the villain did come rather late. The \"reveal\" of the villain however is blatantly obvious by the Episode 4 mark though so see the obvious clues!. \\n\\n\r\nThere are deaths in this anime, however beside the only one that mattered to the plot, the rest of the supposed deaths is more for melodramatic purposes and to be frank cop outs especially by the ending. \\n\\n\r\nThe main cast do become extremely badass by the end of series (heck even some of the minor characters like Tsubasa's uncle Genjuurou voiced by ''Hideo Ishikawa'' even gets his shining moment) however most of the cast have A LOT of plot armor (or the obvious there are more seasons of this series thus they CANNOT die). \\n\\n\r\nThis anime has a weird habit of \"fighting to befriend\" tactic which reminds LA of Mahou Shoujo Lyrical Nanoha's first season right down to the plot beats just instead of magical talking mech staves, we have mech suits that activate through singing. The mech suits themselves have some inconsistencies themselves especially in the Swan Song, one time it's fatal then it only mildly hurts you by the end of it...seems like plot convenience than anything else especially for the ending. \\n\\n\r\nIn terms of animation by Satelight and Encourage Films, they did do a decent job at it, especially in the fight scenes however in-between them, it had some janky facial animation to just low quality standards and really as vibrant and flashy the backgrounding and battle scenes are, the janky animation was rather blatant. \\n\\n\r\nNow since this is a singing show, LA will talk about voice acting and singing, Aoi Yuuki, Ayahi Takagaki and Nana Mizuki were actually pretty good as both vocalist for singing as well as for the more dramatized scenes of acting with Nana Mizuki being the most natural, Aoi Yuuki was pretty moe throghout though she has times where she went full berserk with the vocals to match and Ayahi Takagaki was the spunky tsundere one with some dramatic times here and there. The music sung as both battle OST and a part of the plot itself, does help with the battle scenes although if you don't like auto-tune with techno beats you might see this as more of an annoyance than anything else, but with Nana Mizuki singing?..well that's one of the appeals to OST in the first place, not to mention the OP done by her was awesome as hell. \\n\\n\r\nThe ending did get rushed as LA mentioned before however for what the penultimate episode leading to the ending was rather invigorating to watch, the actual ending however had too much plot armor to it as LA mentioned before, it was an ending to watch as to how batshit crazy and badass the three main Symphogear users are, but again the \"melodrama\" does come out to be a cop out with NO explanation whatsoever.\\n\\n\r\nSenki Zesshou Symphogear: Meteoroid-Falling, Burning, and Disappear, Then... is an anime filled with inconsistencies, however with that it does give some character development to the main cast for their love of singing (in order to save humanity...that too), and even though the blatant main villain of this season does take the show away from the main cast. \\n\\n\r\nSenki Zesshou Symphogear you may be a season filled with and built on a foundation of inconsistency, but if anything the appeal to this season and in the future by in large this series' appeal is for it's wacky batshit crazy mech-suited idol battles and of course...it's music.",
            "date": "2016-03-31T17:21:00+00:00",
            "helpful_count": 0,
            "mal_id": 214964,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=214964"
        }
    ]
]