[
    [
        {
            "content": "Watching Hanamonogatari is like reading your favorite book on a weekend afternoon. And essentially, it is adapted from a novel written by NisiOisin. But rather than adapting it as a full TV series, Hanamonogatari debuts as a 5-episode show that offers more than just a sensational appeal to its fans. Hanamongatari (literally translated as Flower Story) is like a flower – beautiful, elegant, and has the pedals that shine like no other. For its creativity and cleverly thought out written story, we witness the story of Suruga Kanbaru and what her life is like after Koyomi Araragi graduates from high school.\r\nSimilar to the style ofthe previous Monogatari series, Hanamonogatari quickly takes command and lures viewers in with its cleverly constructed dialogues. The on-screen text serves as both a practice and testament to get a viewer’s attention because viewers wants to know their meaning. They also want to know their purpose, idea, and in general the message of the show is about. Directed by Tomoyuki Itamura with Akiyuki Shinbo serving as the chief director, Hanamonogatari is aimed at fans who wants to see the continuation of this franchise. It’s rather important to get yourself familiarized with the previous seasons such as Monogatari Second Series so that the experience will be that much better when venturing into this show.\\n\\n\r\nIt’s probably also said often that the show might not be for everyone. The style of Hanamonogatari has that avant- garde feeling with its style. But without jumping on the shark too hard, we also get a thrilling narration with referencing to the devil. Taglines such as “that person is a devilish one” and “the devil just might be me” drills a thrilling thought into a viewer’s mind. It becomes like a puzzle with pieces that fit together. And in Hanamonogatari, those pieces come together with its cleverly crafted story. For starters, the show advertises itself with Suruga Kanbaru as the main event. Sporting an athletic set of clothes and matching personality, viewers will quickly find that she has fragile part of her essence. Perhaps this could be the arm that is bandaged with a story to tell. And this is where exactly Monogatari series shine – the ability to articulate its story and tell it to the viewers with cleverness. \\n\\n\r\nThe show has a narrative-like tone and depicts Kanbaru’s side of the story. Despite taking place after Araragi’s graduation, several key characters make their presence well-known. A tragic example would be Rouka Numachi. Not only do we learn more about her past but also witness her influence in the present. Numachi’s rivalry with Kanbaru is perhaps a highlight in this show as it consists a variety of emotions; fear, anxiety, fiery, just to name a few. On the other hand, Numachi herself experiences pain but tries to ease it away through her own methods by delivering misfortunes. It justifies her own beliefs to make herself feel better despite her injury. After several events that intertwines the story collectively, the show highlights a climatic moments as Kanbaru fights against Numachi in a game of competitive sport. The show takes risks during this by introducing characters in sequence leading up to the moment with the anticipation and built-up. And thanks to Shaft’s extravagant style, the game lives up to its promise with innovative creativity. \\n\\n\r\nCharacter dynamics is a key success with this series’ presentation. Despite the fictional story with Kanbaru, her past is very realistic. From minute one, the show commands attention with Kanbaru’s mother and the cruel words she strikes upon her daughter. The imagery it creates has a spellbound moment as it illustrates the essence of Kanbaru’s life. Not only do we find out about herself as a character but also what she is capable of as a person. This is what exactly makes the show so appealing and attractive. Luckily, there are also characters returning to this series that fans may find most welcoming. Their roles also play both humorous and important parts to enhance the story’s overall direction. It’s also refreshing seeing them like a breath of fresh air. Engineered by the clever writing and dialogues, it’s easy to say that most if not all the characters are thought provoking. \\n\\n\r\nThe reason for provoking thoughts lies in Monogatari’s ability to discuss and break the boundary of supernatural mystery. Like its previous predecessors, the series doesn’t rely on cheap shounen antics but instead on fighting against one’s inner demons. Highlighted in perhaps the basketball game, the show clearly details and provides purpose leading up to the match. There’s a lot on stake but at the same time, the game becomes something of a battle – to not only for the win but also against themselves. Similarly to other installations of the Monogatari series, expect word plays and extensive dialogues. Thanks to the clever writing, you won’t get massive amount of mind indulging info dumps. Instead, what you will expect and receive is stylized dialogues with attractive interactions. The characters react with precision while also detailing their emotional appeal. At the same time, the dialogues themselves have deeper meaning and motifs that breaks the boundary of literature. NisiOisin’s explicit chattiness isn’t something to just take granted but also by the way it tells a story in its unique fashion. \\n\\n\r\nOn the artistic front, Hanamonogatari has a similar feeling as its previous seasons. By that, I mean it as fantastic. Characters are designed artistically with distinctive features. Kanbaru in particular has a tasteful design and reflects her character visually with attentiveness. Fan service also returns of course with high class style. Unlike most ecchi shows that draws their appeal from cliché values, Monogatari applies exactly what’s needed to command attention. If you’re a fan of Kanbaru, this is a must-see for its eye candy. Even if you’re not, that’s okay because the return of two other characters are bound to make you jump from your seat. Ultimately, Shaft gets the job done not only just with its head-tilts but ability to describe and tell what the story is with the characters.\\n\\n\r\nSoundtrack is put up with more of as a supplement appeal. The OST hits home base with its purpose by anticipating certain scenarios while climatic scenes weaves a mystical aura. However, where Monogatari truly shines is the dialogues that are played out. Thankfully, characters portray them well. As an abstract narrative, Hanamonogatari exceeds expectations with conversations by fusing together humor, mystery, and creativity all the same time. Voice mannerism is crucial to make these come to life and I have to say, it does just that. While it does feel occasionally forced or out of space, the way characters deliver their lines and performance is ecstatic and dosed with a level of energy that is hard to forget. Similarly, the OP song ‘Shirushi’ by Marina Kawano achieves its purpose with its symbolism.\\n\\n\r\nHanamonogatari is more or less for fans who have appreciated the series at its core. Familiarization with some of franchise is crucial to gain a full appreciable experience. Otherwise, you may be left stranded and wondering if it’s worth the time. But trust me, Hanamonogatari uses its time wisely. Even though it’s only 5 episodes, each of them play out the story artistically with its characters, themes, and setup that leaves you with memories you won’t forget. The technical aspects can be a hit or miss but for loyal fans, it hits home base again thanks to its style. Still, Hanamonogatari is more than just about style or storytelling. It’s about drawing attention and fantastically delivers what it tries to achieve. It might seem over-the-top-ridiculous but let’s face it, Monogatari is the epitome of that. Why? Because it said so.\\n",
            "date": "2014-08-17T21:50:00+00:00",
            "helpful_count": 319,
            "mal_id": 156973,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=156973"
        },
        {
            "content": "Over and over again Shaft stands and delivers, this time is no exception. Being a fan of the Monogatari Series, you (and I) were probably excited to hear about the adaption of Hanamonogatari. While its release was delayed a bit I have to say that the wait was well worth it.\r\nHanamonogatari is kinda the odd ball in the Monogatari Series Second Season. Released in the middle between Kabukimonogatari and Otorimonogatari, Hanamonogatari is set after all events of the Second Season and is told through the narrative of Suruga Kanbaru. While we are use to most arcs being told through the eyes of Araragi, Hanamonogatari adifferent look and deeper insight into one of the Monogatari Series overlooked characters.\\n\\n\r\nShaft once again creates something that only Shaft can create. Anyone who has seen any of Shaft's titles know what I am talking about. I found Hanamonogatari to be an overall entertaining and enjoyable. The story is above all captivating and compelling and will leave you wanting more. The lack of characters nor non traditional episode setting can take away from it.\\n\\n\r\nAll I can say is it is a must watch for fans of the Monogatari Series and to those who aren't or haven't seen any of the series, I urge you to. A brilliantly beautiful story adapted into a brilliantly beautiful anime adaption.\\n\\n\r\nBravo Shaft... Bravo",
            "date": "2014-08-21T00:00:00+00:00",
            "helpful_count": 42,
            "mal_id": 157357,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3281521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/goshujin_sama241",
                "username": "goshujin_sama241"
            },
            "url": "https://myanimelist.net/reviews.php?id=157357"
        },
        {
            "content": "There are numerous characters and their characteristics that exist in anime community, starting from the most common and arguably the most famous, tsundere, to kuudere, darudere, megadere, yandere, dandere and many more. However, those who have either read or seen any of nisioisin's--the writer of monogatari series and katanagatari above others--work would know that the characters he make are quite something else. They are obviously not normal, thus letting the story progress without boring the viewers/readers, but they are complex. They get angry like a normal person would, they get happy like a normal person would, they cry like a normal person would, and mostimportantly, they think like a normal person would.\\n\\n\r\nOf course, people may argue that some of the characters of monogatari series and nisioisin's characters in general do NOT think like a normal person should, and I agree. However, letting aside the abnormality and the comical setting nisioisin's characters convey, they are the most human characters in perhaps the entire anime world.\\n\\n\r\nThen, without further adieu, let's begin the review to the ninth part of anime adaptation of the monogatari series, hanamonogatari.\\n\\n\r\nStory: 8\\n\\n\r\nAn anime must not bore the viewers.\\n\\n\r\nThis is not just for anime. Movies, TV shows, music, etc. The entire purpose of any entertainment is to entertain the viewers.\\n\\n\r\nThe light novel, hanamonogatari, was actually published before the third arc of the monogatari series: second season, otorimonogatari. By Shaft's airing hanamonogatari after the end of monogatari second season, the viewers' attention was captured before it faded away in the dull and peaceful mood hanamonogatari inevitably created. By putting hanamonogatari after koimonogatari, the last arc of monogatari second season, a not-too-surprising factor became a ground-breaking factor for the hanamonogatari to capture the viewers' attention. (For those who do not understand and have seen the show, scroll to the bottom)\\n\\n\r\nHanamonogatari also successfully captures the attention of the viewers by doing what all stories of monogatari series did: eroticism. Although it is a very controversial issue, eroticism is a powerful tool to draw in viewers. It might give certain age or gender groups displeasure, but as long as the severity of sexual content is not too high, it serves as a strong hook to the readers.\\n\\n\r\nBut most of all, the beauty of hanamonogatari is in its ability to surprise the viewers and prove it can do something in the last 16 minutes.\\n\\n\r\nPlot twist at the last second is something that is not recommended, and naturally not done well, by many anime of all genres. They can give the viewers displeasure by its quickened pace of story and unsatisfying resolution. Hanamonogatari, however, uses this wonderfully. Although the story gave a sense of melancholy and resolution a minute earlier, hanamonogatari managed to quickly, in literally matter of minutes, completely change the mood of the story and resolute it beautifully.\\n\\n\r\nThe reason I gave 8 instead of 10 despite saying all these is the same reason I did not give 10 in any of the monogatari series franchise.\\n\\n\r\nThe talk can be boring.\\n\\n\r\nHanamonogatari contains quite a huge amount of dialogues and monologues rather than action and facial expressions. Because of this, the viewer/reader can get easily bored. Sometimes, by Shaft's bizarre adaptation from the book, and by revealing an important plot point, this is resolved, but a conversational anime definitely is not enjoyed by everyone. It certainly gives boredom to some viewers, and for those who have trouble reading subtitles, it can make the readers miss important details.\\n\\n\r\nDespite the heavy influence of conversation/monologue, however, hanamonogatari manages to re-spice the height of the story by continuously surprising the viewers or by the use of bizarre anime production, this is mostly not noticed or unnoticed, but hanamonogatari's method of story-telling definitely is not for everyone. Plus, because of the eroticism, it adds up to the reason hanamonogatari is not for everyone.\\n\\n\r\nFor that, I gave story eight out of ten.\\n\\n\r\nArt: 9/10\\n\\n\r\nAs mentioned in story, Shaft does a great job of animating.\\n\\n\r\nIt is not that it has remarkably high-quality battle scenes like Bones or ufotable, or that it has an unbelievably fluent movements like Production IG or Kyoto Animation. Shaft covered up the flaws of the original hanamonogatari it was based on. By the use of colors and random shots, shaft again proved that it was able to deliver the message of the anime viewers.\\n\\n\r\nThe only misgivings of Shaft is that there are limits to the number of people the bizarre adaptation can influence. Some people might get distracted by these bizarre adaptations and some people might be confused on what the anime is trying to say. Above all else, the flashing texts that are used to manage air time and also deliver messages are quite distracting and might get the viewers confused.\\n\\n\r\nStill, there is no question that Shaft is the best weapon that can send any of nisioisin's bizarre works to its highest heights. Shaft did the best it could do with the choices that were available that, before the first of monogatari series, bakemonogatari aired, was a risky course of action.\\n\\n\r\nArt itself is also a job well done. The characters and the background, via the help of famous animation studio such as PA works, were done in quite a high quality that is not always present in Shaft's animation.\\n\\n\r\nFor these, I gave a nine out of ten in art.\\n\\n\r\nSound: 6\\n\\n\r\nThe opening and the ending were not too bad, which I would give normally about a seven. They followed the usual catchy and beautiful themes that the past op/ed themes of monogatari series were infamous for. The voice actors were remarkable as well. Sawashiro Miyuki was able to convey Suruga's feelings quite well throughout the anime, which was not easy considering that Suruga's feelings changed from jumpy to serene to serious to so-happy-that-she-could-cry to so-sad-that-she-could-cry. The new character of the series, Numachi Rouka, was also given a well-known voice actor, Asumi Kana, who is famous for method acting--in this case, voicing--that gives her the ability to \"be\" the character she is voicing. I would give nine for the voicing, minus one for araragi koyomi's a-little-too-nonchalant voicing.\\n\\n\r\nThe problem was with the BGM.\\n\\n\r\nThe number one job of the BGM is to do its job. When the anime calls for battle themes, the BGM must give a sense of power and rush to the viewers. When the anime calls for a foreshadowing, the BGM must give a sense of mystery. When the anime calls for happy mood, BGM must do so.\\n\\n\r\nHowever, the music failed to give a sense of foreshadowing.\\n\\n\r\nA huge portion of the anime is based on talking--about 9/10, roughly calculated--and thus, the BGM must do a proper job of keeping the viewers interested while forming a mysterious environment. While the other monogatari series' animations did not require this as much, hanamonogatari did, being that it was a nonstop air from episode 1 to episode 5. The music failed to keep the viewer interested and sharp-minded and in the end made me miss some important details of the storyline.\\n\\n\r\nNormally, this would seem like not a big deal, since it is just factor of BGM's work that was not done well.\\n\\n\r\nHowever, if it is hanamonogatari's BGM, it is a big deal.\\n\\n\r\nIt is almost safe to say that any talk-based animation requires a BGM that does its job wonderfully, and Kousaka Satoru, the composer of most of BGM's of monogatari series animations, does this quite well, but Haneoka Kei, hanamonogatari's BGM's composer, did not reach up to Satoru's works. It is not to say that one is greater than the other, but hanamonogatari, an anime that aired for nearly couple of hours, requires the support of BGM more than others.\\n\\n\r\nFor this, I gave hanamonogatari's BGM a three out of ten.\\n\\n\r\nWith nine in voice-acting, three in BGM and seven in op/ed, I finally gave 6/10 for the sound portion of the anime.\\n\\n\r\nCharacter: 10\\n\\n\r\nKanbaru Suruga was the narrator.\\n\\n\r\nTHE KANBARU SURUGA.\\n\\n\r\nThe infamous pervert of monogatari series.\\n\\n\r\nOne of Nisioisin's finest qualities is his ability to make characters unpredictable. He can make a main character a total pedophile, a villain the final heroine, a heroine a villain, a gag character an important plot character.\\n\\n\r\nKanbaru Suruga is infamous for her voyeurism, constantly making erotic jokes with Araragi Koyomi, the main character of the monogatari series in general. However, when she was the narrator, as opposed to the expectations, she was quite serious-toned and rarely made a joke. Her being a narrator showed what she \"truly\" was inside, and not the character setting she kept on building.\\n\\n\r\nThis characteristic of any character is not easy. Making a complex character is sometimes harder than writing the story itself. However, Kanbaru Suruga, Araragi Koyomi, Numachi Roka, and pretty much all of the characters in hanamonogatari are complex. Trying to understand them as a certain type of one archetype of character is difficult, if not impossible. They are very human-like, as said, except for the inevitable character settings they show.\\n\\n\r\nWhat can I do but give a ten for the character?\\n\\n\r\nEnjoyment: 9\\n\\n\r\nDespite the music's failure, I quite enjoyed this. It has been a while since I clapped to the end of an anime and smiled in content. It had been more than I could have asked for a story with Kanbaru Suruga as the narrator.\\n\\n\r\nHowever, this is definitely not for everyone. For those who does not enjoy eroticism and severe verbal story progression, this is not an anime for you.\\n\\n\r\nFor this, I gave 9 out of 10 for the enjoyment section.\\n\\n\r\nOverall: 8\\n\\n\r\nGreat story, great animation, and a perfect character.\\n\\n\r\nFor those who have not watched this yet, or any of the monogatari series' animation for that matter, I have only two words for you.\\n\\n\r\nWATCH IT/THEM.\\n\\n\r\nAs always, may anime be with you and happy anime-ing.\\n\\n\\n\\n\r\n------------------------------------------------\\n\r\n********************************\\n\r\n000000000      SPOILER     0000000000\\n\r\n********************************\\n\r\n------------------------------------------------\\n\r\nKaiki's alive. Koimonogatari aired after this, we wouldn't have been as surprised.\\n\r\n------------------------------------------------\\n\r\n********************************\\n\r\n0000000      SPOILER END     00000000\\n\r\n********************************\\n\r\n------------------------------------------------",
            "date": "2014-08-19T21:28:00+00:00",
            "helpful_count": 37,
            "mal_id": 157209,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2639689.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MotherOfUltra",
                "username": "MotherOfUltra"
            },
            "url": "https://myanimelist.net/reviews.php?id=157209"
        },
        {
            "content": "I really enjoyed Hanamonogatari and much of the dialogue (and that Kanbaru-service!!) was superb throughout. It was great to finally get a huge focus on Kanbaru Suruga alone and have SHAFT flesh out her character, her past and her continuing issues because I felt as though she never got the treatment that she deserved in her previous arc and episodes. Her rival basketball player and our \"antagonist\" of sorts, Numachi, acted as an incredible foil (or as a mirror if you payed attention more closely later on) to Kanbaru and her naivety and unwillingness to move forward. It was interesting to hear Numachi's philosophical takeson her \"misfortune\" and \"devil\" collecting.\\n\\n\r\nThat being said, Hanamonogatari was a little light on action, variety and progression at least until we got to the last 2 episodes or so. It was probably the most dialogue heavy of all the arcs that we've encountered so far in the Monogatari universe. Also, the \"twist\" at the end wasn't all that big of a shocker for me either. I never got really hit with the major feels at any point like I did during Second Series or Bakemonogatari but the ending dialogue with Araragi was pretty nice and touching. It was a nice journey to see the progression of Kanbaru's character into accepting her decisions, wishes and herself. This was not my favorite arc but it seemed like SHAFT adapted it about as well as they could from the story in the LN.\\n\\n\r\nThe art and animation was beautiful without a doubt with plenty of head turns, delectable fanservice (I pray to God that Kanbaru eventually swings the other way eventually) and spectacular backdrops (the \"sinking\" basketball court for the win). This was definitely some of SHAFT's best work in terms of imagination and variety here just based upon the source. I guess the problem was that there just wasn't much to really animate or really go off of.\\n\\n\r\nStory: 8/10; Art: 10/10; Sound: 8/10; Character: 9/10; Enjoyment: 8/10; Overall: 8.25/10\\n\\n\r\nI'll give this a solid 8.25/10 (maybe a bit higher) and I'd probably put this around the same level or higher than Nekomonogatari: Kuro and obviously better than Nisemonogatari. Doesn't come close to Bake or the perfection of Second Series. Now, bring on Kizu! There are no more excuses left.\\n\\n\\n\r\nI'll leave the end card here as my last memory of Hanamonogatari and Kanbaru's journey. Just beautiful. \\n\\n\r\nhttp://www.monogatari-series.com/2ndseason/special/img/endcard27.jpg",
            "date": "2014-08-19T22:23:00+00:00",
            "helpful_count": 19,
            "mal_id": 157217,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2377155.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dankzel",
                "username": "dankzel"
            },
            "url": "https://myanimelist.net/reviews.php?id=157217"
        },
        {
            "content": "I'm going to talk about Hanamono's story, since every other metric as per a Monogatari production is tip top.\r\nBreaking down the walls and walls of dialogue set up by Nisio Isin, you can ultimately summarize the central idea of this show in 1 sentence: Growing up is to realize that people (in this case herself and her mother) are not perfect and that it is okay to be flawed. This alone is great. It's a great theme and Shaft delivers on its execution. What's the problem here then? Well, it's a rehash of many many other Monogatari stories without bringing out something fresh.\r\nFrom Nadeko Medusato Tsubasa Tiger, Ougi Dark to Koyomi Reverse, all of these stories had a similar main idea of coming-of-age/self-acceptance, but they consistently had something tangible and substantial to sort of serve as the platform to deliver this premise, as well as sort of a plot to develop that into or from. In Hanamonogatari's case, I can't think of anything substantial. If I were to put it frankly, I'd say that the whole dialogue over whether it was okay for Numachi to go around \"helping\" people was space-filling fluff. There's nothing thematic about it, there's no depth to the message. Alright, some basic utilitarianism vs kantianism. That's cool, but that's all it is. I didn't need to see such a long exchange of how one were to meet the devil, what they'd do, etc etc. It felt as if he was beating around the bush prior to going into the true meat of the story. You couldn't even try and posit that Numachi was a real person and that she wasn't just a vector similar to Tiger since then absorbing the hand would contradict what she had previously said about merely knowing about others' suffering and make no sense. Plus, the hand isn't.. just a hand. It's the manifestation of a weakness in character.\\n\\n\r\nWell, meat it is. The good ol' Monogatari symbolism is there when we need it to be. Sure. Numachi, is a lot of people. She is the manifestation - or more literally, the personification - of people's flaws and fears. To elaborate, since one of her candidates was Kanbaru herself, it was her potential weakness when she had a similar sports injury, the whole \"wishing well\" monkey arm of an arm she has that symbolizes rashness and impulsiveness that she developed due to bad parenting (the paw was given to her, figuratively and literally, from her mother), as well as her mother's overall bad influence in the form of the rest of the body parts. [Skip to the last sentence to avoid minor spoilers for Hana] As per how Hanekawa tore her Tiger parts into a separate entity, Kanbaru's right arm got absorbed by Numachi. You guys can see it. It's the same story. Even the ending, where Hanekawa reabsorbs her \"flaws\" which would be the Tiger, coming to terms with being herself, Kanbaru does the same in the last scene with the basketball finale. Along with more symbolism that IS unique to Hana, such as Kaiki telling her to beefen up and not run away from her flaws/herself/her fears, Gaen Tooe entrusting her devil head to Kaiki, a man not prone to act on impulse but instead on monetary gain, and an grown-up Araragi representing maturity leading her back from her escape from herself. That's it. Basically, the general framework for the story and the symbolism within it seems very similar to other arcs.\\n\\n\r\nInterestingly, what I enjoyed most about Hanamonogatari was only made possible because I watched Zoku Owarimonogatari and understood exactly what the Rainy Devil represented, subsequently understanding what the monkey paw, being gifted the monkey paw from her mother, and Numachi represented for Kanbaru. You could say that this was the thing that sets Hanamonogatari apart from the other arcs, but to be able to understand it after watching other arcs is a little too much to ask for. Since Zoku is chronologically right before Hana, I would recommend people watch Zoku first.\\n\\n\r\nIt might seem like I had drastically and exaggeratedly condensed the story, but I'd like to think that I didn't. I respect the avant-garde film direction of Shaft and the unique storytelling style of Nisio Isin, but no amount of those things should be used for the sake of covering up an attempt at mostly regurgitating old content. I hold almost all of Monogatari's works to very high regard, but this feels like one of its weaker ones.",
            "date": "2019-04-07T10:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 305696,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6745088.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/CloudeKr",
                "username": "CloudeKr"
            },
            "url": "https://myanimelist.net/reviews.php?id=305696"
        },
        {
            "content": "(This review has been adapted from my reddit thread. Spoilers ahead!)\r\nThe Monogatari series; famous for its style, dialogue, and humor, this show is held in high regard by many fans of anime (myself included). So it is no surprise that there was considerable hype for the next arc in this lovely story.\r\nSTORY\r\nMonogatari doesn't follow the simple structure of an overall arc that encompasses the rest of what is happening on screen. Instead, the show deliberately lets us know which arc we are on, and each arc is mostly stand-alone with some cross-over occurring depending on the circumstances.\r\nThis is once again the case with Hanamonogatari. Consistingof only five episodes, this arc contains the \"Suruga Devil\" story. It follows Kanbaru, the main protagonist and previous side-character from previous arcs, looking into a person named Rouka Numachi who can seemingly rid anyone of their own misfortunes.\\n\\n\r\nThe story itself is nothing special. However, what does it make special, and what is always the case, was the dialogue. The focus of the show is not so much in the actual plot. Instead, the plot is a device that allows for our characters to talk, mingle, interact, and otherwise converse with one another. It's the writing that separates this show from many others. And once again, Monogatari does it right.\\n\\n\r\nThey explore themes such as what it means to be happy, how one should act based on the situation, and how to solve one's problems. Besides being philosophical, the writing is also witty and quite humorous. And it should be; the majority of the show is dedicated to just talking, and it is this element that attracts many people to not only this arc but the others in the series as well.\\n\\n\r\nANIMATION\\n\\n\r\nWithout being a SHAFT fan-boy, I will say that the actual animation itself was good. Nothing great, but it's not the animation that needs to be paid attention to. Since it's mainly talking, it's the way the locales are presented that matters most. And SHAFT does a fantastic job of conveying multiple symbols, emotions, and ideas based solely on the shots, angles, and scenery. Every shot as a meaning; every shot serves some purpose for the narrative.\\n\\n\r\nIt's not really possible to grasp everything that is being conveyed within in one watch, but after looking at certain still-frames or re-watching certain parts, it becomes apparent that it's not SHAFT trying to be flashy or artsy-fartsy (even though they are), but rather it is their way of demonstrating that the actual locations and environment are just as important in telling a story as is the dialogue that goes with it.\\n\\n\r\nCHARACTERS\\n\\n\r\nBesides the writing, Monogatari is also known for its fantastic characters (Senjougahara, Araragi, Hanekawa, Karen, etc.). This time, the focus was mostly on two characters, Kanbaru and Rouka (a new character), with some intervention from some very familiar characters.\\n\\n\r\nStarting with Kanbaru, she does undergo change. She learns life lessons from people new and old. She comes to understand what it means to live with misfortune and how people should act the way the want to and not being told what to do.\\n\\n\r\nOn this point, one of the most important lines in the show is Kanbaru's mother's mantra, \"If you can't be medicine, then be poison. Otherwise you are just plain water.\" In other words, one should try to be wholly good or wholly evil, otherwise you fall into some gray area that has no real purpose; you neither help nor hurt, your just \"there\". She comes up with an answer to this motto near the end, and it helps to let us know that she, as a character, has also come to understand what it means to be good or evil.\\n\\n\r\nKanbaru learns this almost entirely through Rouka. Being a new character, the show spent the majority of its time letting us into her mind, as most arcs tend to do in Monogatari (focusing on one character and seeing them grow). Once again, they do a nice job. They make her stance/ideals interesting and unique enough so that her perspective on the matter contradicts what most people think. This, probably obviously, makes us think. Making us think is good, because it allows us to see the different side to an argument. Or at least, it provides us with a unique perspective that we probably have not thought of before.\\n\\n\r\nOverall, I liked her character. Not as much as the staple characters of the show, but enough where I consider her to be a part of the gang.\\n\\n\r\nSOUND\\n\\n\r\nSadly, I found the sound to be just average. The OP is used once and is too generic for my liking. The ED, while not to my liking as well, was definitely unique for its tone/beat. The visuals for it were nice as well.\\n\\n\r\nThe rest of the soundtrack was nicely done, but nothing out of the ordinary, except for a certain character's remix.\\n\\n\r\nThe voice-acting is expertly done was again. Kanbaru, Rouka, and the rest of the cast do a fantastic job of portraying their characters personality, and it is more of the same goodness from all of them.\\n\\n\r\nENJOYMENT\\n\\n\r\nSomething that most people will say is that this is a series that is not for the \"anime beginner\". I agree with this statement, not only because of the strange humor and style the show is known for, but also due to the heavy amount of talking. You have to love characters just talking to one another about one topic for a long time. If you need constant action, this is not the show for you. If you need a super-compelling plot with huge twists and turns, this is not the show for you.\\n\\n\r\nPersonally, I love these types of shows. It allows for great interactions and really shows off the writers'/author's prowess in presenting interesting conversations between the many different characters he/she have designed. And again, more so than most shows, these arcs always seem to be a step above. The talking never gets jarring or annoying, and you never feel like they are simply going through the motions. Everything they say is important and has specific meaning.\\n\\n\r\nFurthermore, if you like SHAFT head-tilts, interesting character designs, and stylized directing, then you will enjoy the show even more.\\n\r\nThe only complaint enjoyment-wise is that I wish the show was just slightly longer. But that may just be me wanting more Monogatari. :P\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, less about plot and more about good dialogue\\n\\n\r\nAnimation: Great, every shot counts (even if it is SHAFT being SHAFT)\\n\\n\r\nCharacters: Good, some old and some new, with nice development for everyone\\n\\n\r\nSound: Fine, OP and ED are average but the rest of the soundtrack was nice to hear\\n\\n\r\nEnjoyment: Good, more Monogatari is always a good thing, right?\\n\\n\r\nFinal Score: 7/10",
            "date": "2014-09-19T01:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 160943,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=160943"
        },
        {
            "content": "Hanamonogatari is a relatively average arc from the Monogatari Series. Hanamonogatari was originally supposed to be part of Monogatari Series: Second Season (it is in the light novel), so it fits pretty well with those arcs if you’ve seen them. Hanamonogatari is another monkey arc, but we follow Suruga Kanbaru as she meets up with an old friend. \r\nWhat makes Hanamonogatari stand out is the writing. It has an intricate plot, which is the highlight of the arc. Sadly, I cannot talk about it in too much detail because it’s 5 episodes that depend on a plot twist. What I can say, is that Ireally enjoyed the first three episodes. Hanamonogatari tells you a full, well written, convincing, wholesome story; then, it pulls a big plot twist in episode four. I’m not gonna say the plot twist original, or clever, or particularly unique, but I will say that the preposition of the plot twist was very well done. \\n\\n\r\nHanamonogatari is simply more Monogatari. It’s good and worth watching if you’ve gotten this far. \\n",
            "date": "2019-02-24T22:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 302406,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4169795.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Falco2424",
                "username": "Falco2424"
            },
            "url": "https://myanimelist.net/reviews.php?id=302406"
        },
        {
            "content": "(7.5/10)\r\nHanamonogatari, or \"Flower Story\" as i so expertly managed to google is a story about Kanbaru. Our favorite tomboy who actually managed to stay mostly out of the second season. \r\nApart from a mention in the first arc of the second season, she didn't make much more than a visual appearance throughout, however, she really has a solid story to deliver with Hanamonogatari. \r\nIn a way, Hana is a like an old friend you just recently got a message from. \"Hey, wanna meet up?\" At first you toss it aside and decide to go about your day. Whether that's watching anime, wack the one-eyed wonderweasel, or both at the same time. The day passes and the sun sets, you relax in bed after your tranquil day and decide to browse whatever social media website you prefer on your phone. \\n\\n\r\nHowever, you have another glimpse at this long forgotten friend and you decide, \"eh... why not?\" and message them back. \\n\\n\r\nYou meet up with them, talk a bit at the cafe, reminisce about the past, and move on. There isn't really any emotion to your conversation. There isn't really any spark. Its just a nice little talk you had. You don't regret it, but you don't think think you want to do it again as you have better things to do. \\n\\n\r\n______________________________\\n\\n\r\nThis kind of attitude is a lot like Kanbaru's arc. The entire episode feels a bit slower, a bit more reminiscent, and in a way, it is. Kanbaru meets up with her long forgotten rival, Numachi Rouka, and they don't hit it off, they don't hate each other, they just sorta talk. \\n\\n\r\nThen they part ways... and that's that. \\n\\n\r\n______________________________\\n\\n\r\n[PART 1] : How imagery reflects feeling\\n\\n\r\nOf course that's not all that happens. This is Monogatari after all, but i'm mostly talking about the first twenty or so minutes as I really enjoyed the general distance this show had.\\n\\n\r\nThe imagery reflected this too. We got wide open shots with just about everything. Empty classrooms, vast open white tiles with lonely tree stumps being some of the only decoration. Its a an empty world in Monogatari, but that's nothing new. \\n\\n\r\nHowever, much like a lot of season two, this show is putting us into the world of another character that is specifically not Araragi. \\n\\n\r\nJust like Kaiki's world was full of people, Kanbaru's is distinctly empty. \\n\\n\r\n_______________________________\\n\\n\r\nAs Araragi's cameo appearance drives her home in the dark, desolate land, Kanbaru talks of loneliness. She talks about how after the people who understood her left, she no longer really feels like she has anyone. \\n\\n\r\nThis reflects through her conversation with one of her \"friends\" in the first episode, and throughout the whole episode as well. She lays alone in bed, she wakes up and runs alone to school, and she sits alone in an empty classroom where her old friend Senjougahara sat. \\n\\n\r\nShe graduated a grade, but not emotionally. \\n\\n\r\nBut through this car ride conversation she sees that the world isn't really like that. Things get taken away from you and you feel weak afterwards but the things being taken away aren't unaffected. \\n\\n\r\nAraragi talks about Gahara's loneliness, he talks about his loneliness. And in one of the shows most sobering moments he mentioned of Kanbaru is one of the few people who understands his most personal wants. \\n\\n\r\nI think this is the first time we've actually seen Araragi discuss his definite pedophilia, and the scene wasn't played for laughs. \\n\\n\r\n....\\n\\n\r\nThis was my favorite scene in the arc as i related to it more than I like to admit. I've had close friends move, or even simply leave my school. And much like its obvious that Araragi doesn't actually live miles and miles away, it should have been obvious to me that these friends would just be a phone call away. \\n\\n\r\nBut somehow the stupid idea that if we don't go to the same school anymore festered within me and I no longer see them. I don't know why. Maybe its the lack of things to talk about. Maybe its the fact that I don't see them on a daily basis. \\n\\n\r\nThis is never more prevalent than when someone goes to college for their first year too. \\n\\n\r\nThe show does a great job with explaining that and showing that Araragi too is feeling lonely. \\n\\n\r\n....\\n\\n\r\nNot only did this scene relate and resonate with me, but it also helped the entire theme of the episode. \\n\\n\r\nJust as Rouka heard the misery of that person who visited her in the hospital, Kanbaru heard the loneliness Araragi and Gahara were feeling as well. Just like Rouka, Kanbaru felt better and while this loneliness wasn't perhaps as crippling as Kanbaru's; Kanbaru still found solace in knowing she wasn't the only one going through it. \\n\\n\r\nThis scene played out in-theme with the a lot of the first half of this arc and i loved it. Imagery correlates with emotion and can often effect it. The lonely highway and bright, yet derelict tunnel reflected this. \\n\\n\r\n__________________________________\\n\\n\r\n[PART 2] : The concept of story\\n\\n\\n\r\nBut this isn't really what this arc was. It still had to tell a story and I feel like that's what drags it a bit down in terms of success. \\n\\n\r\nMonogatari was never an overly emotional show, and when it was emotional, it was always sparse. With the highlights being Hachikuji's departure as well as Araragi and Gahara's date in Bake. \\n\\n\r\nI felt like this episode suffered from lack of emotion. Kanbaru struggled with the notion of telling Rouke that she's dead, but that struggle is all we saw. The resolution really had none of that. \\n\\n\r\nI felt like for once, we could've gotten a bit more of a punch, especially since the story was playing more like Season two Monogatari rather than season one. \\n\\n\r\nBy that I mean that the visuals were toned down and the story was on full focus.\\n\\n\r\nThis also meant that we got yet another episode-long exposition scene where Rouke goes on and on about her backstory. This is generally delivered straight and without much emotion either. It had me reminiscing back at the really painfully boring Shinobu backstory we got in season two as well. \\n\\n\r\nIt also had me thinking about Tsukimonogatari's exposition and how that was done significantly better than this. \\n\\n\r\n....\\n\\n\r\nWith that said, the relationship between Kanbaru and Rouke was interesting enough, with a definite romance being hinted at heavily in the intro. \\n\\n\r\nIt has all the building blocks for an emotional story but was much too bogged down by more cliche anime trappings like extended exposition for the sake of understanding.\\n\\n\r\nI may come off as pretentious here but sometimes not everything needs to be understood. Sometimes we can just let shit be if it means we get more calm, introspective car rides and talks with Kaike. \\n\\n\r\n_________________________________\\n\\n\r\n[PART 3] : Hypocrite\\n\\n\\n\r\nI can't help but feel like the show was hypocritical this arc, too. Especially when comparing said car scene and the twenty minute exposition scene. I felt like it was a completely juxtaposition to have both of those scenes in the same arc. \\n\\n\r\nThey felt like something completely different. \\n\\n\r\nThis is never the more prevalent than Kanbaru's talk with Kaike who's inexplicably alive after Hitagi end and is now sporting an absolutely awesome goatee. \\n\\n\r\nI don't know if it was intentional, but they had Kaike looking like a complete villain, what with his menacing goatee and devil-horn haircut. Yet he acted more like a father here. \\n\\n\r\nMuch like the car ride, this other scene served as one of my favorites. Kaike's  monologue on meat and Kanbaru's inability to let go of her petty hatred was a pleasure. While it felt a little cheapening of Hitagi End's absolutely jaw-dropping finale, I was still happy to see him in the show. \\n\\n\r\nThis is where this arc seems to fail the most. Its an passive look at an aggressive story. While the show is aggressive here on occasion, with Kanbaru battling Rouke in basketball... that serving as her return to the sport... its still something I can't really say worked that well.\\n\\n\r\nIt felt a little forced. It felt a little \"meh\", much like your discussion with previously mentioned friend. It was just there. \\n\\n\r\nI guess that fits the tone too, if I think about it. Maybe i'm being the hypocrite here. Maybe I don't understand, or childishly can't accept that when a show is as wholly encapsulated in a theme that that theme has to stretch past simple imagery or certain scenes. \\n\\n\r\nI don't know what I was expecting and as if this show is a pro at doing so, it makes me hard to give an honest rating to this episode. \\n\\n\r\nThe climax was underwhelming with Rouke, but maybe it was supposed to be? \\n\\n\r\n_________________________________\\n\\n\r\nConclusion : \\n\\n\\n\r\nThe arc as a whole was solid. It fits well with the second seasons more dreary and less comedic tone. It also helps finish Kanbaru's monkey arc. \\n\\n\r\nI find that it was a mix of absolutely spectacular dialogue and plodding less interesting rambling. Maybe that's a reflection on the show as a whole though, as the writer has to figure out some way to relay information to the viewer. \\n\\n\r\nMaybe that's one of the trappings of light novels, god knows i've never read one. \\n\\n\r\n....\\n\\n\r\nThis solid arc does a nice job of completely wrapping up the second season and giving us ample reason to be excited for the third and apparently final season. \\n\\n\r\nMuch like a calm talk with an old friend or simply admiring the cliche beauty of a flower, its not the most memorable arc. But its something I don't regret watching, and something I'm happy I got to see. \\n\\n\\n\r\nAll the best",
            "date": "2016-08-08T02:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 226210,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5554102.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Artrill",
                "username": "Artrill"
            },
            "url": "https://myanimelist.net/reviews.php?id=226210"
        },
        {
            "content": "I'm not a fan of Kanbaru Suruga so it took me 6 days just to finish 5 episodes of Hanamonogatari. However, I'm not saying that I hated Hanamonogatari. I just didn't like it as much as the previous Monogatari shows. \r\n[Story]: (7/10)\r\nHanamonogatari is a sequel to Monogatari Series: Second Season and it chronologically takes place after the events of Owarimonogatari. The show features Suruga Kanbaru and is set after Koyomi graduates from high school. \r\nFrom this point on, everything that comes out of my mouth....I mean, everything you read from this point on are just my opinions. So if I say the show bored meto death, that's not going to be the case for everyone. Ok then...\\n\\n\r\nThere's a reason why I found Hanamonogatari to be the most boring out of the Monogatari Series. Firstly, it doesn't feel the same as.....Bakemonogatari and Monogatari Series: Second Season. I mean, there's no more conflict left to resolve here. Everything is done after the \"Hitage End\" arc. So what the show did is build Suruga's character in the most boring way possible. Maybe the problem here is the plot doesn't move forward at all. It's just Suruga dealing with her past and her old rival. If you didn't find this show boring then good for you but I did. Remember, it's my goddamn opinion. \\n\\n\r\nBy skipping Hana, you're not going to miss a lot besides Suruga's character development. Then again, this is the last arc (chronologically) for the Monogatari series and there's no more stories after her arc so I don't see the point in her character development. The Suruga that you will see in this show won't be in Tsuki and Owari because they both take place place during the events of Monogatari Series: Second Season. \\n\\n\r\nWhat you are going to miss is Araragi in college, Ougi's sexual identity and all that minor stuff. \\n\\n\r\nThe pacing is excruciatingly slow. The dialogue scenes dragged out for way too long and Suruga's problem can be solved in about 3 episodes, maybe 2 episodes. I also hate to say this but this is the first Monogatari show that does not have interesting or engaging dialogues. Maybe it's because they talked about stuff like good and evil, selfishness and all that crap and dragged it out for as long as they can. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Art/Animation]: (10/10)\\n\r\nGod, this is the 5th show and I still have to review the animation. I just want to get this out of the way. The animation and visuals looks the same as Monogatari Series: Second Season which got a perfect 10 so I'm also giving it a 10 for this show. The unique animation that SHAFT has (SHAFT head tilt, flashing text, etc.) is still present.\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Sound]: (5/10)\\n\r\nNote that majority of the score for the \"Sound\" category comes from the Opening theme and part of it comes from the Ending theme so it doesn't matter if the soundtrack is crap or the voice acting is crap, it won't affect my sound rating that much. I'm not, however, saying that the soundtrack and the VA is crap because they're not. OST sounds great, the soundtrack sounds great and the VA's did a wonderful job voicing the characters. Now the OP and ED theme song.\\n\\n\r\nThe OP theme song is \"\"the last day of my adolescence\" by Suruga Kanbaru\" and \"Hana Ato: Shirushi\" by Marina Kawano. I am fully aware that the OP and ED theme song is the other way around in the TV Broadcast version but I watched the show in Blu-Ray version. Honestly, they both sound like crap. I ended up skipping the OP after the first episode and this if the first Monogatari OP that I skipped. ED song also sounds like crap. Nothing sounds catchy nor did the singer's voice sound wonderful. \\n\r\n--------------------------------------------------------------------------------------------\\n\r\n[Character]: (8/10)\\n\r\nHanamonogatari focused heavily on Suruga Kanbaru and her old basketball rival named \"Rouka Numachi\" so don't expect the other girls to appear. There are some character from the previous show who made an appearance like Araragi which shouldn't be a surprise and Kaiki who continues to be a bad-ass in this show. Araragi didn't really play that much of a role here. He just appeared to console Kanbaru and talk to her about stuff like college, where he got his car, etc. Kaiki played a minor role in solving Kanbaru's problem. \\n\\n\r\nThe only thing I like about this arc is Kanbaru's character being fleshed out. Ever since her arc in Bakemonogatari, her character was left to dust in Nise and Second Season and wasn't really explored that much. While I do love Kanbaru's character being fleshed out, that doesn't change the fact that Hana is boring show when compared to other Monogatari shows. I'm going to leave Numachi to you because I don't have the energy right now to explain who she is, her motives and why she's even here in the first place. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Enjoyment]: (6/10) \\n\r\nHow many times have I mentioned that I found this show to be boring? 3 times? That's right, I found it boring. I didn't enjoy this show as much as Bake, Nise or Second Season. It's insane that I finished this show in 6 days considering the fact that there's only 5 episodes. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[VERDICT]\\n\r\nHanamonogatari is, by far, the weakest Monogatari show I have ever seen when compared to Bake and Second Season. The dialogue scenes weren't as engaging as the previous shows and it ended up as a dragged out boring dialogue scene. Despite the boring dialogue scenes, it was nice to finally see Kanbaru's character being fleshed out. If you're a Kanbaru fan or you're a big fan of the Monogatari series then I recommend that you watch this show. Otherwise, just don't bring your expectations up. \\n\\n\r\n[OVERALL]: (7.2/10)\\n\\n\\n\r\nPros:\\n\r\n+Good Story\\n\r\n+Second Season's Outstanding Animation is here\\n\r\n+Kanbaru's character is finally being explored\\n\r\n+Fanservice drastically reduced\\n\\n\r\nCons:\\n\r\n-Dialogue scenes are not as engaging as the previous shows\\n\r\n-Dialogue scenes are dragged out\\n\r\n-Pacing is way too slow\\n\r\n-Soundtrack is mediocre compared to previous shows\\n\\n\\n\\n",
            "date": "2015-11-22T12:43:00+00:00",
            "helpful_count": 7,
            "mal_id": 203972,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=203972"
        },
        {
            "content": "I'm going to make this quick. This is NOT gonna be a full-review of the series, but a little overview of the Sugara Devil (Hanamonogatari) arc. It pains me to make this quick because it might just be my favorite Monogatari arc so far. \r\nWe start after everything ended. Araragi and Senjougahara gratuated, Hanekawa left on her trip, you know the whole thing is ended. That's pretty much it. \r\nHanamonogatari stands out among the other arcs like Bake, Nise and Second Season in that it doesn't use a lot of the trademark abstract moments, having little to none of those particularly weird transitions. With that,Sugara Devil feels... empty. Emptyness fills this arc. It basically was only Kanbaru, Rouka (a great character by the way), a little of our home boy Araragi and the glorious return of best girl (Kaiki). It makes the arc even slower than how the originals were... Which is slower than internet fucking explorer. Even though the show is even slower, it doesn't make it worst. I personally really enjoyed how it was the less focused on random bullshitting about stuff like salad dressing or fanservice or demons or any of the original tropes of the Monogatari franchise. It was almost only character development for Suruga which was amazing. For the story, it was not the best because of almost nothing happening (except the collector's plot which almost nobody cared about). As for the art, it's fucking Monogatari! What did you except from Shaft?!\\n\\n\\n\r\nAnyway, tonight was the 5th time I watched it and it really grew on me once again so I decided to write a lil' review about it. Yes it is not in-depth, it's not sophisticated, it's superficial, but it's better than my Code Geass R2 review. As for my real thoughts on the only good harem worth watching (The Monogatari Series), you can expect a very long one in the near future.  \\n",
            "date": "2015-04-30T18:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 186868,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4572747.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DankPeanut420",
                "username": "DankPeanut420"
            },
            "url": "https://myanimelist.net/reviews.php?id=186868"
        },
        {
            "content": "http://www.crunchyroll.com/monogatari-second-season/hanamonogatari-suruga-devil-659521 \r\nthis is the link i used to find it it is just a part of monogatari second season on crunchyroll\r\nI really just wrote this review for the link but apparently it has to be longer so... i mean  me likey the plot i guess and i would recommend it to my friends. shit i ran out of ideas and it isn't long enough. welp.\r\n well i guess i could also put this link\r\nhttp://bakemonogatari.wikia.com/wiki/Monogatari_Series_Timeline_and_Watch_Guide \r\nkiss anime has the series in chronological order as in the story and this has them in the order that they were made. I think it is better to seethe development of the writing and stuff, and most people watched it in that order and other stuff like that. the site explains more.",
            "date": "2017-06-28T20:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 251371,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6296894.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lordofthequacks",
                "username": "lordofthequacks"
            },
            "url": "https://myanimelist.net/reviews.php?id=251371"
        },
        {
            "content": "Hanamonogatari just didn't do it for me as a fan of the Monogatari series.  It's more of a side story focusing on Kanbaru and an old basketball rival of hers, Numachi.  And really, that was a problem for this anime.  Kanbaru is a likable character, but she is not nearly charismatic enough to carry an entire anime as the lead, especially when her foil, Numachi is particularly bland.  \r\nThe entirety of the anime focused entirely on these two characters and only briefly featured cameos from the Araragi family and Kaiki Deshuu.  This was a mistake, as most of the engagingdialogue and mystery was missing from this installment, precisely because most of the cast was either gone, or only involved for a cup of coffee.  \\n\\n\r\nBut what really hurt the anime was the insanely long backstory of Numachi, she spent all of episode 3 and then half of episode 4 explaining her history.  That really sucked me right out of the anime, because I wasn't really invested in her as a character to begin with so having so much time explaining her past wasn't incredibly entertaining.  \\n\\n\r\nThe climax of everything was also kind of lackluster.  Things are settled in this anime with basketball games instead of fights, which was kind of a weird choice.   But, at no point in time was the outcome in any doubt.  The conclusion was just kind of \"meh\".  And that sums up this whole anime for me. \"Meh.\".   I'm looking forward to better installments going forward.  \\n\\n\r\nStory: 5\\n\r\nArt: 10\\n\r\nSound: 7\\n\r\nCharacter: 6\\n\r\nEnjoyment: 5\\n\r\nOverall: 5",
            "date": "2018-07-24T10:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 284677,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=284677"
        },
        {
            "content": "This series is basically just talking. Talking, talking talking and talking. I know the other Monogatari seasons contains a lot of talking and mystery, but this one is the worse yet. It really didn't quite feel like the typical monogatari seasons where Araragi is the Main character, and he walks around to explore the mystery that the viewers also are queries about.\r\nAnyhow.. Ever since I started watching this Monogatari series, I noticed a high frequency sound when sound effects were played. So I guess either the sound wasn't checked through an equalizer, or the people making these sound effects didn't have the possibility to hearthese high frequencies.\\n\\n\r\nOverall I feel like this have been the most boring Monogatari series Yet. But you might like this kind of mystery.",
            "date": "2017-03-20T15:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 243051,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5721558.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/typewar",
                "username": "typewar"
            },
            "url": "https://myanimelist.net/reviews.php?id=243051"
        },
        {
            "content": "Hanamonoagatari is yet another fantastic entry of the Monogatari Series, written by novelist Nisio Isin. Everything that you know and love about the series is back in Hanamonogatari: the comedy, the mind-boggling dialogue, supernatural mumbo-jumbo, the out of this world art style and, best of all, the incredibly well written characters that will win you over in just a few scenes. However, what also makes Hanamonogatari so special is it's emotional attachment to a character that you would never have thought to care so much for in such surprising ways.\r\nNow, the first noticeably different factor of the show is its focus on one of themore minor characters of the series: Kanbaru. Kanbaru has always been a character who, although entertaining, is a bit downplayed in terms of the depth that other characters in the series contain. Fortunately, this entry allows you to connect better with her than before, and if you already loved her before then it's a win-win! \\n\\n\r\nBecause of this focus on Kanbaru, the story has you follow certain days of her life set after the events of Monogatari Series: Second Season. While the story is not as energetic compared to its predecessors, what makes it worth the watch is the terrific dynamic between Kanbaru and the character known as Rouka Numachi, Kanbaru's childhood friend. Rouka's amazingly detailed past including the affliction that she gained from it is told in a way that is both tragically heartbreaking and colorfully written. As interesting as the supernatural lore and topics are, watching Kanbaru's many interactions with this somber friend of hers are truly the standout moments in this show and deserve praise. \\n\\n\r\nSpeaking of interactions, Hanamonogatari still contains the series' usual fair of laugh-out-loud and witty conversations with its many eccentric characters. Many of the major characters of the series appear in the show in various scenes, however, I personally found that most of the characters shown on screen were pretty meaningless and served the purpose of showing up in the show only as cameos for fans. Like I said, these characters do still provide the witty humor and odd interactions, but I felt as though this specific entry in the series did not need most of them because of the fact that some of them had very little to do with the story, thus, causing them to serve as a distraction.\\n\\n\r\nIf you've watched any of the past entries in the series, then you shall already become familiar with Hanamonogatari's art style. The colorful scenes within the show are top-notch and beautiful to look at. What's also beautiful about the art this time around is the incredible scenery and architecture. The series has always contained great architectural scenery, but Hanamonogatari pushes it to a whole now level, containing transforming construction sites, spiral rooftops, and much more. What also makes the scenery so great in the show is how the scenery alone tells you a lot about the two central characters of the show just with art alone, which I found to be very impressive. \\n\\n\r\nHanamonogatari is a chapter of the Monogatari Series where you will find more of the same quirks and tropes of the series as well as many, many new factors. The emotional connection that you gain between Kanbaru and Rouka in just a mere five episodes is worthy of applause and will have you wanting more depth such as this in the future entries to come. While the rest of the supporting cast is a bit underwhelming, they still provide the usual comedic and dialogue-heavy moments that the series is known for. Hanamonogatari is an exceptional show, not just within the series, but as an anime in general because of its unique style used to portray various emotions with its central characters. This show is without a doubt worth watching if you love this series as much as I do!",
            "date": "2014-09-01T15:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 158805,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3235167.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Black_Butterfly",
                "username": "Black_Butterfly"
            },
            "url": "https://myanimelist.net/reviews.php?id=158805"
        },
        {
            "content": "Hanamonogatari is yet another entry in Studio Shaft's ultra offensive anime franchise. It lacks humor, the characters are dull, and the show is just getting worse.\r\nAfter the surprisingly good Hitagi End arc of the Second Season, we're left with this trite piece of...something. I'm loathe to call it art.\r\nHanamonogatari continues the show's long running gag of placing power point slides in the narrative that move too fast for most people to read. There are words there, but you'll never read them. Other times it'll be a black frame or red frame with the words \"black frame\" or \"red frame\" on them. This is just incase the viewer is too stupid to figure out what it really is. Hanamonogatari really stretches it by showing the viewers the elusive pink frame, however. Is that a plus? I'm not sure.\\n\\n\r\nThis show follows the character of Suruga, or something of the sort. I don't know. I forgot her name after she failed to kill Araragi all the way back in Bakemonogatari. Had she succeeded the quality of the show would have increased dramatically. But she didn't so I'm going to hold that against her. She's remiss when her arch-nemesis from jr. high shows up.\\n\\n\r\nIt reminds me of a story that one of my friends told me when I first met him in high school. He previously went to a private Catholic school. However, you cannot go to a private high school in my state. His dad taught at my school so naturally he went there. Anyway, he too had an arch nemesis in the form of a Greek kid named Kosta Fantidas. He used to tell me about how much he hated this kid and what a drag on his life he was.\\n\\n\r\nTurns out that Surugu talks her nemesis to death and then defeats her in a game of basketball. Da fuq? My friend's nemesis probably grew up to be a villain in a Bond movie just to contrast.\\n\\n\r\nNear the end this series pulls out all the stops on being offensive and reintroduces Araragi. I was sincerely hoping I wouldn't have to see this guy in this show because seeing him negatively affects the quality of my life. I am worse off for knowing that Koyomi Araragi is a character in a show.\\n\\n\r\nAraragi spends the last 10 minutes of the show talking about how much he wants to molest his sister. Also he was being a creep and watching Surugu sleep in the nude. That was after he entered her house uninvited. Seriously though, Hitagi volunteered to be this idiot's girlfriend. He should be getting enough sex from her to get over his deviant sexual behavior. Guess I'm too optimistic, though.\\n\\n\r\nIt will probably take no less than 3 hours of spamming Guile's theme for me to feel better about myself as a person after having viewed this show.",
            "date": "2016-06-20T17:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 221342,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5467326.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/carnage_panda",
                "username": "carnage_panda"
            },
            "url": "https://myanimelist.net/reviews.php?id=221342"
        },
        {
            "content": "Hanamonogatari - 9/10\r\nHanamonogatari is a sequel of Monogatari Series Second Season (Adaption of 7th book Nekomonogatari Shiro, 8th book Kabukimonogatari, 10th book Odorimonogatari, 11th book Onimonogatari, 12th book Koimonogatari) which itself is a sequel of Nisemonogatari which is a sequel of Bakemonogatari.\r\nThis one is about Kanbaru Suruga, this whole story is set after Araragi graduates so he is not related to the plot, neither is any other Monogatari characters, except for Kanbaru, Kaiki and some new characters, aswell as breifly mentioned Izuko Gaen.\r\nBy far, one of the best things i've ever seen. First of all, yes this is one of the most dialogue-heavy stories outof Monogatari, and is almost irrelevant to the actual plot, except for some clearance in what connection did Kaiki and Kanbaru share in Nisemonogatari.\\n\r\nEven though it's mostly dialogue, hell yeah it's well directed, it's dynamic, fast, awesome, creative and it looks awesome.\\n\r\nI loved it, the Basketball scene, the restaurant scene, the whole 5th episode are all awesome. Fucking awesome, there is so much depth to Kanbaru, which at first seemed like a filler character back in Bakemonogatari, but now feels almost like the deepest character in the series, it's just so well executed and done, though i feel like Araragi and Ougi weren't really necessary, Araragi was there because hell he is the main protag after all, and Ougi was there because....yeah, becuz you have to get people hyped up for all that sweet shekels you're gonna make on the third season huh?\\n\r\nAnyways, SHAFT is fucking based and this is one of the best shows ever.\\n\r\nAlso i guess this one is a bit more serious than the others, but oh well, it served it best, especially midway through episode 3 you just realize there is so much information, and all those side-story characters are all actually so interesting, and you just want to know more and see how it ends.\\n\r\nYou got the typical Pseudo-psychology here, just like Second Season, you got the super cool eye blink frames and the \"slides\" and much more.\\n\r\nIf you like Monogatari, and you thought you'd skip this one out because it's not about best girl, then maybe you should think again, because this one is awesome.\\n\\n\r\n\"There is no absolute evil, all evil will help someone, always, on the other hand, all good will always hurt someone, if a person is happy through their unhappiness, then why should someone tell one they are unhappy?\"\\n\r\n\"Maybe you weren't right, but you weren't wrong either, you were just enjoying Youth, after all.\"",
            "date": "2015-03-28T17:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 183803,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042687.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DanteMustDie8907",
                "username": "DanteMustDie8907"
            },
            "url": "https://myanimelist.net/reviews.php?id=183803"
        },
        {
            "content": "Warning: spoilers.\r\nLet's start saying that i really liked Hanamogatari, of course i watched the full movie version in one go. Visuals are above average for monogatari stardards, and the feeling of a movie as a whole arc was really great. Some of my friends said that this is a bit of a plot heavy arc. I don't think it was boring tough, it caught my attention and curiosity for it's whole duration, i've even watched it a second time to write a better comment.\r\nAs usual, i especially like to speak of the \"food for thoughts\" this series give, so lets begin.\r\nThe arc starts with Kanbarumentally speaking with her dead mother, which is considered a bad person. In \"being the poison\" i think she mean that it's better to crush others than to be crushed, but Kanbaru refuses this reasoning and wants to be different from her. Her mothers warns her that it will be hard: if you want too many things, you may obtaing nothing.\\n\\n\r\nKanbaru soon meets Numachi the Demon in this arc, and find her similiar to Araragi-senpai. This encounter officially stop the operate of the demon, which lasted for 3 years.\\n\\n\r\nShe did this \"profession\" for herself only, by meeting persons with bigger problems than her, she feels better. She just listen to them seriously, but on the inside she may laugh at them. After that, she do absolutely nothing. That's because, apart for extreme cases where she advices to contact autorities, she is avare that time heals every wound, and committing to face all your problems in one time only brings you damnation. This is her thought.\\n\\n\r\nSuruga actually had a big price to pay for deciding to face her problems right away, not enduring for a better situation. Her demonic arm caused her a whole hell of problems.\\n\\n\r\nAfter she hoped that someday, the arm will disappear, Numachi made that happen by stealing the demonic piece from her while she was groping her breast.\\n\\n\r\nAfter this encounter, we have another moment of conversation with suruga's mother. This time i find it really accurate and true: to put a serious face while pondering things, is to be stupid, real winners face things as they come, directly. To worry is to waste time, and if you actually got that time, then you can use it to ACT. It's no use crying over spilled milk.\\n\\n\r\nMan, SO TRUE YET HARD.\\n\\n\r\nSuruga wakes up without her demonic arm, and is overjoyed. After school she will meet Kaiki, who was looking for her. Kaiki sees immediately through her and knows how she thinks: Some thing can never resolved by running away, and there are wounds that time will not heal (numachi physical wound for example).\\n\\n\r\nSuruga has been warned against Kaiki, and tries to hate him, but she can't, he is really too kind with her, you could say even affectionate! After all suruga is the daughter of Kaiki's best friend and tutor. In the past, she asked to him to look after her child if something happened to her.\\n\\n\r\nKaiki brings something interesting to us: not always love is given back, and not always hate is responded with hate. Nobody and nothing is pure evil, every personality is totally different, and nobody is always coherent. We will find more of this later with our friend Numachi.\\n\\n\r\nKaiki is really affectionate with Suruga in many ways, this reveal his true face. I really like him, he is a great character!\\n\\n\r\nSecond encounter with Numachi: she still insist that running away is not always wrong, to face your problems is to jump right in to them, while avoiding them may not take away your happiness, on the contrary it can help you to accept your destiny and circumstances. She suffered from the hate that talent differences brings, she tried to hide her it as much as she could by starting a sport difficult for her. From soccer where she would use her foots, to basket where arms are used. She also played in defense to hide even more her incredible skill. She then hurted herself and was hospitalized.\\n\\n\r\nAfter she got to hospital, a girl pretending to be her friend came to her, and asked her for advices. Both of them thought the condition of the other was worse than their personal one. Anyway, Numachi was delighted of her misfortunes since this reminded her she was not the only one to be suffering, she was not alone.\\n\\n\r\nShe then explain why her method works: the important thing is the relief she gave to that person by listening to her, by doing that, one stops to worry about his problems and goes on with their life, making those \"obstacles\" disappear quickly. A tombstone is mentioned, this may be a hint telling you that Numachi is already dead.\\n\\n\r\nAfter this explanation, we talk again about absolute evil. It does not exist, and every baleful event is (often) needed to help something or someone. Also, every act of justice may hurt someone. So in the end, evil or good extremes may not exist at all.\\n\\n\r\nAnother interesting thing to mention is that Kaiki says that he do not believe on anomalies, even if they were clearly there in the series. Is this a hint too about the fact that they only exist in the characters psyche?\\n\\n\r\nSuruga leaves Numachi, then proceeds to run until exahusted in the middle of the night.\\n\\n\r\nShe meets the now grown Araragi-Senpai.\\n\\n\r\nHe talks about how often we change ourselves to be liked by others, after all social acceptance is SO IMPORTANT for us. But beware, by adapting too much we risk to loose sight of many things.\\n\\n\r\nThen they start talking about helping someone which is in a bad situation. Let's say this person is happy, even if she lives in misfortune. Suruga wonders if it is right to act just to tell that person how bad their situation is, potentially causing more problems.\\n\\n\r\nAraragi has a simple yet effective solution: you must act if it bothers at least YOU.\\n\\n\r\nTo commit to something because you are worried is always a good thing.\\n\\n\r\nAs oshino said (and this IS the setting stone of the series)\\n\\n\r\nOnly You can help yourself. Suruga decides to act for her friend.\\n\\n\r\nIn their last encounter Numachi says she prefers to regret something she did not do. Well here i can answer thanks to my personal experience: it's usually better to regret something you did, rather than regret something you did not do, because you will never know what consequences your effort would have brought, you would not like to miss new opportunities and new happiness for yourself, right?\\n\\n\r\nIn the end Suruga meets her senpai again, and boy we talk of some deep shit here.\\n\\n\r\nOne of the most powerful yet simple truth in this arc lies near the end:\\n\\n\r\nIt does not matter to make a wish real, but what really matters is the fact itself to have a wish, a desire. Whatever it is a realistic one or not, we really need wishes, we can use them to know ourselves better and focus on what we truly desire. If you do not know what you want, what you want to be, or who you are, you will always loose the way on your life. This important point can make the difference between a life which has been lived and one where someone only survived.\\n\r\nThis is a lesson essential for your life.",
            "date": "2018-12-19T00:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 296129,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5509366.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Heldarth",
                "username": "Heldarth"
            },
            "url": "https://myanimelist.net/reviews.php?id=296129"
        },
        {
            "content": "*THE RATINGS FOR THIS ARE SPECIFIC TO THE PART, BUT THE REVIEW IS FOR THE OVERALL SERIES*\r\n[STORY: 10/10]\r\nThe Monogatiri series comes together well to create a masterpiece of a story. This show is much deeper than alot of people think. It is filled to the brim with philosophical arguments and great storytelling. The focus isn't mainly on action, though it does have some visually stunning action scenes. Alot of the time, it will just be conversations between characters, but this is the blood that keeps this series alive and flourishing. Without it, you'd have a normal show with above average production. This type of showisn't for everyone, but I personally love it.\\n\\n\r\n[ART: 10/10]\\n\r\nThe animators went all out animating this show, as detail and flamboyance embody the artistic direction of this show. Each character's design and set piece is carefully planned out, and it shows. \\n\\n\r\n[SOUND: 10/10]\\n\r\nThe voice actors become their characters when they act them out, that's how into them they get. They really care about their role, you can tell. And sound effects are well done as well, nothing seems off in that department.\\n\\n\r\n[CHARACTER: 10/10]\\n\r\nMost every character is important to the main plot of the story and if they aren't a main character, the style of the show makes it seem as if they don't even exist. Whether they be designed as set pieces or outlines, the show really puts emphasis on those we really care about. These characters are no joke either, pretty much none of them are one-dimensional wastes of time, which is very appeciated.\\n\\n\r\n[ENJOYMENT/OVERALL: 10/10]\\n\r\nThough some parts of the series are better than others, the series as a whole is truly an amazing body of work that I consider a masterpiece. This story is filled to the brim with beautifully crafted characters, artwork, sound design, and an amazing story that philosophically challenges the observer to think. A masterful work by Isin Nisio.",
            "date": "2018-04-03T04:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 276639,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6971623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/godofmankind",
                "username": "godofmankind"
            },
            "url": "https://myanimelist.net/reviews.php?id=276639"
        },
        {
            "content": "While watching, what I think to be the last and final chapter of this series I went into it hopeful because I do really like the star of Noestsu high, Kanbaru.\r\nHowever I did find it, although it concluded well, sort of slow. I found myself asking myself, okay? well is learning about this rival of Kanbaru's such an important moment? especially when it takes about an whole episode to explain. Also, i was curious about Kaiki's part, because not only did I think he suffered a fatality, it opened up a lot more questions, but for what? Its like they just wanted to incorporate himinto it but like.. he has no real purpose.\\n\\n\r\nI was sad at the end when she reverted back to her short hair, because lets be real, she was a lot cuter with the longer hair. I would like to know more about her mother and her past, but I feel like thats something thats most likely not going to happen. Overall, as much as I did enjoy the story of this series, I am glad that it has finally concluded.",
            "date": "2017-01-10T15:31:00+00:00",
            "helpful_count": 0,
            "mal_id": 237976,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=237976"
        }
    ],
    [
        {
            "content": "Watching Hanamonogatari is like reading your favorite book on a weekend afternoon. And essentially, it is adapted from a novel written by NisiOisin. But rather than adapting it as a full TV series, Hanamonogatari debuts as a 5-episode show that offers more than just a sensational appeal to its fans. Hanamongatari (literally translated as Flower Story) is like a flower – beautiful, elegant, and has the pedals that shine like no other. For its creativity and cleverly thought out written story, we witness the story of Suruga Kanbaru and what her life is like after Koyomi Araragi graduates from high school.\r\nSimilar to the style ofthe previous Monogatari series, Hanamonogatari quickly takes command and lures viewers in with its cleverly constructed dialogues. The on-screen text serves as both a practice and testament to get a viewer’s attention because viewers wants to know their meaning. They also want to know their purpose, idea, and in general the message of the show is about. Directed by Tomoyuki Itamura with Akiyuki Shinbo serving as the chief director, Hanamonogatari is aimed at fans who wants to see the continuation of this franchise. It’s rather important to get yourself familiarized with the previous seasons such as Monogatari Second Series so that the experience will be that much better when venturing into this show.\\n\\n\r\nIt’s probably also said often that the show might not be for everyone. The style of Hanamonogatari has that avant- garde feeling with its style. But without jumping on the shark too hard, we also get a thrilling narration with referencing to the devil. Taglines such as “that person is a devilish one” and “the devil just might be me” drills a thrilling thought into a viewer’s mind. It becomes like a puzzle with pieces that fit together. And in Hanamonogatari, those pieces come together with its cleverly crafted story. For starters, the show advertises itself with Suruga Kanbaru as the main event. Sporting an athletic set of clothes and matching personality, viewers will quickly find that she has fragile part of her essence. Perhaps this could be the arm that is bandaged with a story to tell. And this is where exactly Monogatari series shine – the ability to articulate its story and tell it to the viewers with cleverness. \\n\\n\r\nThe show has a narrative-like tone and depicts Kanbaru’s side of the story. Despite taking place after Araragi’s graduation, several key characters make their presence well-known. A tragic example would be Rouka Numachi. Not only do we learn more about her past but also witness her influence in the present. Numachi’s rivalry with Kanbaru is perhaps a highlight in this show as it consists a variety of emotions; fear, anxiety, fiery, just to name a few. On the other hand, Numachi herself experiences pain but tries to ease it away through her own methods by delivering misfortunes. It justifies her own beliefs to make herself feel better despite her injury. After several events that intertwines the story collectively, the show highlights a climatic moments as Kanbaru fights against Numachi in a game of competitive sport. The show takes risks during this by introducing characters in sequence leading up to the moment with the anticipation and built-up. And thanks to Shaft’s extravagant style, the game lives up to its promise with innovative creativity. \\n\\n\r\nCharacter dynamics is a key success with this series’ presentation. Despite the fictional story with Kanbaru, her past is very realistic. From minute one, the show commands attention with Kanbaru’s mother and the cruel words she strikes upon her daughter. The imagery it creates has a spellbound moment as it illustrates the essence of Kanbaru’s life. Not only do we find out about herself as a character but also what she is capable of as a person. This is what exactly makes the show so appealing and attractive. Luckily, there are also characters returning to this series that fans may find most welcoming. Their roles also play both humorous and important parts to enhance the story’s overall direction. It’s also refreshing seeing them like a breath of fresh air. Engineered by the clever writing and dialogues, it’s easy to say that most if not all the characters are thought provoking. \\n\\n\r\nThe reason for provoking thoughts lies in Monogatari’s ability to discuss and break the boundary of supernatural mystery. Like its previous predecessors, the series doesn’t rely on cheap shounen antics but instead on fighting against one’s inner demons. Highlighted in perhaps the basketball game, the show clearly details and provides purpose leading up to the match. There’s a lot on stake but at the same time, the game becomes something of a battle – to not only for the win but also against themselves. Similarly to other installations of the Monogatari series, expect word plays and extensive dialogues. Thanks to the clever writing, you won’t get massive amount of mind indulging info dumps. Instead, what you will expect and receive is stylized dialogues with attractive interactions. The characters react with precision while also detailing their emotional appeal. At the same time, the dialogues themselves have deeper meaning and motifs that breaks the boundary of literature. NisiOisin’s explicit chattiness isn’t something to just take granted but also by the way it tells a story in its unique fashion. \\n\\n\r\nOn the artistic front, Hanamonogatari has a similar feeling as its previous seasons. By that, I mean it as fantastic. Characters are designed artistically with distinctive features. Kanbaru in particular has a tasteful design and reflects her character visually with attentiveness. Fan service also returns of course with high class style. Unlike most ecchi shows that draws their appeal from cliché values, Monogatari applies exactly what’s needed to command attention. If you’re a fan of Kanbaru, this is a must-see for its eye candy. Even if you’re not, that’s okay because the return of two other characters are bound to make you jump from your seat. Ultimately, Shaft gets the job done not only just with its head-tilts but ability to describe and tell what the story is with the characters.\\n\\n\r\nSoundtrack is put up with more of as a supplement appeal. The OST hits home base with its purpose by anticipating certain scenarios while climatic scenes weaves a mystical aura. However, where Monogatari truly shines is the dialogues that are played out. Thankfully, characters portray them well. As an abstract narrative, Hanamonogatari exceeds expectations with conversations by fusing together humor, mystery, and creativity all the same time. Voice mannerism is crucial to make these come to life and I have to say, it does just that. While it does feel occasionally forced or out of space, the way characters deliver their lines and performance is ecstatic and dosed with a level of energy that is hard to forget. Similarly, the OP song ‘Shirushi’ by Marina Kawano achieves its purpose with its symbolism.\\n\\n\r\nHanamonogatari is more or less for fans who have appreciated the series at its core. Familiarization with some of franchise is crucial to gain a full appreciable experience. Otherwise, you may be left stranded and wondering if it’s worth the time. But trust me, Hanamonogatari uses its time wisely. Even though it’s only 5 episodes, each of them play out the story artistically with its characters, themes, and setup that leaves you with memories you won’t forget. The technical aspects can be a hit or miss but for loyal fans, it hits home base again thanks to its style. Still, Hanamonogatari is more than just about style or storytelling. It’s about drawing attention and fantastically delivers what it tries to achieve. It might seem over-the-top-ridiculous but let’s face it, Monogatari is the epitome of that. Why? Because it said so.\\n",
            "date": "2014-08-17T21:50:00+00:00",
            "helpful_count": 319,
            "mal_id": 156973,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=156973"
        },
        {
            "content": "Over and over again Shaft stands and delivers, this time is no exception. Being a fan of the Monogatari Series, you (and I) were probably excited to hear about the adaption of Hanamonogatari. While its release was delayed a bit I have to say that the wait was well worth it.\r\nHanamonogatari is kinda the odd ball in the Monogatari Series Second Season. Released in the middle between Kabukimonogatari and Otorimonogatari, Hanamonogatari is set after all events of the Second Season and is told through the narrative of Suruga Kanbaru. While we are use to most arcs being told through the eyes of Araragi, Hanamonogatari adifferent look and deeper insight into one of the Monogatari Series overlooked characters.\\n\\n\r\nShaft once again creates something that only Shaft can create. Anyone who has seen any of Shaft's titles know what I am talking about. I found Hanamonogatari to be an overall entertaining and enjoyable. The story is above all captivating and compelling and will leave you wanting more. The lack of characters nor non traditional episode setting can take away from it.\\n\\n\r\nAll I can say is it is a must watch for fans of the Monogatari Series and to those who aren't or haven't seen any of the series, I urge you to. A brilliantly beautiful story adapted into a brilliantly beautiful anime adaption.\\n\\n\r\nBravo Shaft... Bravo",
            "date": "2014-08-21T00:00:00+00:00",
            "helpful_count": 42,
            "mal_id": 157357,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3281521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/goshujin_sama241",
                "username": "goshujin_sama241"
            },
            "url": "https://myanimelist.net/reviews.php?id=157357"
        },
        {
            "content": "There are numerous characters and their characteristics that exist in anime community, starting from the most common and arguably the most famous, tsundere, to kuudere, darudere, megadere, yandere, dandere and many more. However, those who have either read or seen any of nisioisin's--the writer of monogatari series and katanagatari above others--work would know that the characters he make are quite something else. They are obviously not normal, thus letting the story progress without boring the viewers/readers, but they are complex. They get angry like a normal person would, they get happy like a normal person would, they cry like a normal person would, and mostimportantly, they think like a normal person would.\\n\\n\r\nOf course, people may argue that some of the characters of monogatari series and nisioisin's characters in general do NOT think like a normal person should, and I agree. However, letting aside the abnormality and the comical setting nisioisin's characters convey, they are the most human characters in perhaps the entire anime world.\\n\\n\r\nThen, without further adieu, let's begin the review to the ninth part of anime adaptation of the monogatari series, hanamonogatari.\\n\\n\r\nStory: 8\\n\\n\r\nAn anime must not bore the viewers.\\n\\n\r\nThis is not just for anime. Movies, TV shows, music, etc. The entire purpose of any entertainment is to entertain the viewers.\\n\\n\r\nThe light novel, hanamonogatari, was actually published before the third arc of the monogatari series: second season, otorimonogatari. By Shaft's airing hanamonogatari after the end of monogatari second season, the viewers' attention was captured before it faded away in the dull and peaceful mood hanamonogatari inevitably created. By putting hanamonogatari after koimonogatari, the last arc of monogatari second season, a not-too-surprising factor became a ground-breaking factor for the hanamonogatari to capture the viewers' attention. (For those who do not understand and have seen the show, scroll to the bottom)\\n\\n\r\nHanamonogatari also successfully captures the attention of the viewers by doing what all stories of monogatari series did: eroticism. Although it is a very controversial issue, eroticism is a powerful tool to draw in viewers. It might give certain age or gender groups displeasure, but as long as the severity of sexual content is not too high, it serves as a strong hook to the readers.\\n\\n\r\nBut most of all, the beauty of hanamonogatari is in its ability to surprise the viewers and prove it can do something in the last 16 minutes.\\n\\n\r\nPlot twist at the last second is something that is not recommended, and naturally not done well, by many anime of all genres. They can give the viewers displeasure by its quickened pace of story and unsatisfying resolution. Hanamonogatari, however, uses this wonderfully. Although the story gave a sense of melancholy and resolution a minute earlier, hanamonogatari managed to quickly, in literally matter of minutes, completely change the mood of the story and resolute it beautifully.\\n\\n\r\nThe reason I gave 8 instead of 10 despite saying all these is the same reason I did not give 10 in any of the monogatari series franchise.\\n\\n\r\nThe talk can be boring.\\n\\n\r\nHanamonogatari contains quite a huge amount of dialogues and monologues rather than action and facial expressions. Because of this, the viewer/reader can get easily bored. Sometimes, by Shaft's bizarre adaptation from the book, and by revealing an important plot point, this is resolved, but a conversational anime definitely is not enjoyed by everyone. It certainly gives boredom to some viewers, and for those who have trouble reading subtitles, it can make the readers miss important details.\\n\\n\r\nDespite the heavy influence of conversation/monologue, however, hanamonogatari manages to re-spice the height of the story by continuously surprising the viewers or by the use of bizarre anime production, this is mostly not noticed or unnoticed, but hanamonogatari's method of story-telling definitely is not for everyone. Plus, because of the eroticism, it adds up to the reason hanamonogatari is not for everyone.\\n\\n\r\nFor that, I gave story eight out of ten.\\n\\n\r\nArt: 9/10\\n\\n\r\nAs mentioned in story, Shaft does a great job of animating.\\n\\n\r\nIt is not that it has remarkably high-quality battle scenes like Bones or ufotable, or that it has an unbelievably fluent movements like Production IG or Kyoto Animation. Shaft covered up the flaws of the original hanamonogatari it was based on. By the use of colors and random shots, shaft again proved that it was able to deliver the message of the anime viewers.\\n\\n\r\nThe only misgivings of Shaft is that there are limits to the number of people the bizarre adaptation can influence. Some people might get distracted by these bizarre adaptations and some people might be confused on what the anime is trying to say. Above all else, the flashing texts that are used to manage air time and also deliver messages are quite distracting and might get the viewers confused.\\n\\n\r\nStill, there is no question that Shaft is the best weapon that can send any of nisioisin's bizarre works to its highest heights. Shaft did the best it could do with the choices that were available that, before the first of monogatari series, bakemonogatari aired, was a risky course of action.\\n\\n\r\nArt itself is also a job well done. The characters and the background, via the help of famous animation studio such as PA works, were done in quite a high quality that is not always present in Shaft's animation.\\n\\n\r\nFor these, I gave a nine out of ten in art.\\n\\n\r\nSound: 6\\n\\n\r\nThe opening and the ending were not too bad, which I would give normally about a seven. They followed the usual catchy and beautiful themes that the past op/ed themes of monogatari series were infamous for. The voice actors were remarkable as well. Sawashiro Miyuki was able to convey Suruga's feelings quite well throughout the anime, which was not easy considering that Suruga's feelings changed from jumpy to serene to serious to so-happy-that-she-could-cry to so-sad-that-she-could-cry. The new character of the series, Numachi Rouka, was also given a well-known voice actor, Asumi Kana, who is famous for method acting--in this case, voicing--that gives her the ability to \"be\" the character she is voicing. I would give nine for the voicing, minus one for araragi koyomi's a-little-too-nonchalant voicing.\\n\\n\r\nThe problem was with the BGM.\\n\\n\r\nThe number one job of the BGM is to do its job. When the anime calls for battle themes, the BGM must give a sense of power and rush to the viewers. When the anime calls for a foreshadowing, the BGM must give a sense of mystery. When the anime calls for happy mood, BGM must do so.\\n\\n\r\nHowever, the music failed to give a sense of foreshadowing.\\n\\n\r\nA huge portion of the anime is based on talking--about 9/10, roughly calculated--and thus, the BGM must do a proper job of keeping the viewers interested while forming a mysterious environment. While the other monogatari series' animations did not require this as much, hanamonogatari did, being that it was a nonstop air from episode 1 to episode 5. The music failed to keep the viewer interested and sharp-minded and in the end made me miss some important details of the storyline.\\n\\n\r\nNormally, this would seem like not a big deal, since it is just factor of BGM's work that was not done well.\\n\\n\r\nHowever, if it is hanamonogatari's BGM, it is a big deal.\\n\\n\r\nIt is almost safe to say that any talk-based animation requires a BGM that does its job wonderfully, and Kousaka Satoru, the composer of most of BGM's of monogatari series animations, does this quite well, but Haneoka Kei, hanamonogatari's BGM's composer, did not reach up to Satoru's works. It is not to say that one is greater than the other, but hanamonogatari, an anime that aired for nearly couple of hours, requires the support of BGM more than others.\\n\\n\r\nFor this, I gave hanamonogatari's BGM a three out of ten.\\n\\n\r\nWith nine in voice-acting, three in BGM and seven in op/ed, I finally gave 6/10 for the sound portion of the anime.\\n\\n\r\nCharacter: 10\\n\\n\r\nKanbaru Suruga was the narrator.\\n\\n\r\nTHE KANBARU SURUGA.\\n\\n\r\nThe infamous pervert of monogatari series.\\n\\n\r\nOne of Nisioisin's finest qualities is his ability to make characters unpredictable. He can make a main character a total pedophile, a villain the final heroine, a heroine a villain, a gag character an important plot character.\\n\\n\r\nKanbaru Suruga is infamous for her voyeurism, constantly making erotic jokes with Araragi Koyomi, the main character of the monogatari series in general. However, when she was the narrator, as opposed to the expectations, she was quite serious-toned and rarely made a joke. Her being a narrator showed what she \"truly\" was inside, and not the character setting she kept on building.\\n\\n\r\nThis characteristic of any character is not easy. Making a complex character is sometimes harder than writing the story itself. However, Kanbaru Suruga, Araragi Koyomi, Numachi Roka, and pretty much all of the characters in hanamonogatari are complex. Trying to understand them as a certain type of one archetype of character is difficult, if not impossible. They are very human-like, as said, except for the inevitable character settings they show.\\n\\n\r\nWhat can I do but give a ten for the character?\\n\\n\r\nEnjoyment: 9\\n\\n\r\nDespite the music's failure, I quite enjoyed this. It has been a while since I clapped to the end of an anime and smiled in content. It had been more than I could have asked for a story with Kanbaru Suruga as the narrator.\\n\\n\r\nHowever, this is definitely not for everyone. For those who does not enjoy eroticism and severe verbal story progression, this is not an anime for you.\\n\\n\r\nFor this, I gave 9 out of 10 for the enjoyment section.\\n\\n\r\nOverall: 8\\n\\n\r\nGreat story, great animation, and a perfect character.\\n\\n\r\nFor those who have not watched this yet, or any of the monogatari series' animation for that matter, I have only two words for you.\\n\\n\r\nWATCH IT/THEM.\\n\\n\r\nAs always, may anime be with you and happy anime-ing.\\n\\n\\n\\n\r\n------------------------------------------------\\n\r\n********************************\\n\r\n000000000      SPOILER     0000000000\\n\r\n********************************\\n\r\n------------------------------------------------\\n\r\nKaiki's alive. Koimonogatari aired after this, we wouldn't have been as surprised.\\n\r\n------------------------------------------------\\n\r\n********************************\\n\r\n0000000      SPOILER END     00000000\\n\r\n********************************\\n\r\n------------------------------------------------",
            "date": "2014-08-19T21:28:00+00:00",
            "helpful_count": 37,
            "mal_id": 157209,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2639689.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MotherOfUltra",
                "username": "MotherOfUltra"
            },
            "url": "https://myanimelist.net/reviews.php?id=157209"
        },
        {
            "content": "I really enjoyed Hanamonogatari and much of the dialogue (and that Kanbaru-service!!) was superb throughout. It was great to finally get a huge focus on Kanbaru Suruga alone and have SHAFT flesh out her character, her past and her continuing issues because I felt as though she never got the treatment that she deserved in her previous arc and episodes. Her rival basketball player and our \"antagonist\" of sorts, Numachi, acted as an incredible foil (or as a mirror if you payed attention more closely later on) to Kanbaru and her naivety and unwillingness to move forward. It was interesting to hear Numachi's philosophical takeson her \"misfortune\" and \"devil\" collecting.\\n\\n\r\nThat being said, Hanamonogatari was a little light on action, variety and progression at least until we got to the last 2 episodes or so. It was probably the most dialogue heavy of all the arcs that we've encountered so far in the Monogatari universe. Also, the \"twist\" at the end wasn't all that big of a shocker for me either. I never got really hit with the major feels at any point like I did during Second Series or Bakemonogatari but the ending dialogue with Araragi was pretty nice and touching. It was a nice journey to see the progression of Kanbaru's character into accepting her decisions, wishes and herself. This was not my favorite arc but it seemed like SHAFT adapted it about as well as they could from the story in the LN.\\n\\n\r\nThe art and animation was beautiful without a doubt with plenty of head turns, delectable fanservice (I pray to God that Kanbaru eventually swings the other way eventually) and spectacular backdrops (the \"sinking\" basketball court for the win). This was definitely some of SHAFT's best work in terms of imagination and variety here just based upon the source. I guess the problem was that there just wasn't much to really animate or really go off of.\\n\\n\r\nStory: 8/10; Art: 10/10; Sound: 8/10; Character: 9/10; Enjoyment: 8/10; Overall: 8.25/10\\n\\n\r\nI'll give this a solid 8.25/10 (maybe a bit higher) and I'd probably put this around the same level or higher than Nekomonogatari: Kuro and obviously better than Nisemonogatari. Doesn't come close to Bake or the perfection of Second Series. Now, bring on Kizu! There are no more excuses left.\\n\\n\\n\r\nI'll leave the end card here as my last memory of Hanamonogatari and Kanbaru's journey. Just beautiful. \\n\\n\r\nhttp://www.monogatari-series.com/2ndseason/special/img/endcard27.jpg",
            "date": "2014-08-19T22:23:00+00:00",
            "helpful_count": 19,
            "mal_id": 157217,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2377155.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dankzel",
                "username": "dankzel"
            },
            "url": "https://myanimelist.net/reviews.php?id=157217"
        },
        {
            "content": "I'm going to talk about Hanamono's story, since every other metric as per a Monogatari production is tip top.\r\nBreaking down the walls and walls of dialogue set up by Nisio Isin, you can ultimately summarize the central idea of this show in 1 sentence: Growing up is to realize that people (in this case herself and her mother) are not perfect and that it is okay to be flawed. This alone is great. It's a great theme and Shaft delivers on its execution. What's the problem here then? Well, it's a rehash of many many other Monogatari stories without bringing out something fresh.\r\nFrom Nadeko Medusato Tsubasa Tiger, Ougi Dark to Koyomi Reverse, all of these stories had a similar main idea of coming-of-age/self-acceptance, but they consistently had something tangible and substantial to sort of serve as the platform to deliver this premise, as well as sort of a plot to develop that into or from. In Hanamonogatari's case, I can't think of anything substantial. If I were to put it frankly, I'd say that the whole dialogue over whether it was okay for Numachi to go around \"helping\" people was space-filling fluff. There's nothing thematic about it, there's no depth to the message. Alright, some basic utilitarianism vs kantianism. That's cool, but that's all it is. I didn't need to see such a long exchange of how one were to meet the devil, what they'd do, etc etc. It felt as if he was beating around the bush prior to going into the true meat of the story. You couldn't even try and posit that Numachi was a real person and that she wasn't just a vector similar to Tiger since then absorbing the hand would contradict what she had previously said about merely knowing about others' suffering and make no sense. Plus, the hand isn't.. just a hand. It's the manifestation of a weakness in character.\\n\\n\r\nWell, meat it is. The good ol' Monogatari symbolism is there when we need it to be. Sure. Numachi, is a lot of people. She is the manifestation - or more literally, the personification - of people's flaws and fears. To elaborate, since one of her candidates was Kanbaru herself, it was her potential weakness when she had a similar sports injury, the whole \"wishing well\" monkey arm of an arm she has that symbolizes rashness and impulsiveness that she developed due to bad parenting (the paw was given to her, figuratively and literally, from her mother), as well as her mother's overall bad influence in the form of the rest of the body parts. [Skip to the last sentence to avoid minor spoilers for Hana] As per how Hanekawa tore her Tiger parts into a separate entity, Kanbaru's right arm got absorbed by Numachi. You guys can see it. It's the same story. Even the ending, where Hanekawa reabsorbs her \"flaws\" which would be the Tiger, coming to terms with being herself, Kanbaru does the same in the last scene with the basketball finale. Along with more symbolism that IS unique to Hana, such as Kaiki telling her to beefen up and not run away from her flaws/herself/her fears, Gaen Tooe entrusting her devil head to Kaiki, a man not prone to act on impulse but instead on monetary gain, and an grown-up Araragi representing maturity leading her back from her escape from herself. That's it. Basically, the general framework for the story and the symbolism within it seems very similar to other arcs.\\n\\n\r\nInterestingly, what I enjoyed most about Hanamonogatari was only made possible because I watched Zoku Owarimonogatari and understood exactly what the Rainy Devil represented, subsequently understanding what the monkey paw, being gifted the monkey paw from her mother, and Numachi represented for Kanbaru. You could say that this was the thing that sets Hanamonogatari apart from the other arcs, but to be able to understand it after watching other arcs is a little too much to ask for. Since Zoku is chronologically right before Hana, I would recommend people watch Zoku first.\\n\\n\r\nIt might seem like I had drastically and exaggeratedly condensed the story, but I'd like to think that I didn't. I respect the avant-garde film direction of Shaft and the unique storytelling style of Nisio Isin, but no amount of those things should be used for the sake of covering up an attempt at mostly regurgitating old content. I hold almost all of Monogatari's works to very high regard, but this feels like one of its weaker ones.",
            "date": "2019-04-07T10:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 305696,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6745088.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/CloudeKr",
                "username": "CloudeKr"
            },
            "url": "https://myanimelist.net/reviews.php?id=305696"
        },
        {
            "content": "(This review has been adapted from my reddit thread. Spoilers ahead!)\r\nThe Monogatari series; famous for its style, dialogue, and humor, this show is held in high regard by many fans of anime (myself included). So it is no surprise that there was considerable hype for the next arc in this lovely story.\r\nSTORY\r\nMonogatari doesn't follow the simple structure of an overall arc that encompasses the rest of what is happening on screen. Instead, the show deliberately lets us know which arc we are on, and each arc is mostly stand-alone with some cross-over occurring depending on the circumstances.\r\nThis is once again the case with Hanamonogatari. Consistingof only five episodes, this arc contains the \"Suruga Devil\" story. It follows Kanbaru, the main protagonist and previous side-character from previous arcs, looking into a person named Rouka Numachi who can seemingly rid anyone of their own misfortunes.\\n\\n\r\nThe story itself is nothing special. However, what does it make special, and what is always the case, was the dialogue. The focus of the show is not so much in the actual plot. Instead, the plot is a device that allows for our characters to talk, mingle, interact, and otherwise converse with one another. It's the writing that separates this show from many others. And once again, Monogatari does it right.\\n\\n\r\nThey explore themes such as what it means to be happy, how one should act based on the situation, and how to solve one's problems. Besides being philosophical, the writing is also witty and quite humorous. And it should be; the majority of the show is dedicated to just talking, and it is this element that attracts many people to not only this arc but the others in the series as well.\\n\\n\r\nANIMATION\\n\\n\r\nWithout being a SHAFT fan-boy, I will say that the actual animation itself was good. Nothing great, but it's not the animation that needs to be paid attention to. Since it's mainly talking, it's the way the locales are presented that matters most. And SHAFT does a fantastic job of conveying multiple symbols, emotions, and ideas based solely on the shots, angles, and scenery. Every shot as a meaning; every shot serves some purpose for the narrative.\\n\\n\r\nIt's not really possible to grasp everything that is being conveyed within in one watch, but after looking at certain still-frames or re-watching certain parts, it becomes apparent that it's not SHAFT trying to be flashy or artsy-fartsy (even though they are), but rather it is their way of demonstrating that the actual locations and environment are just as important in telling a story as is the dialogue that goes with it.\\n\\n\r\nCHARACTERS\\n\\n\r\nBesides the writing, Monogatari is also known for its fantastic characters (Senjougahara, Araragi, Hanekawa, Karen, etc.). This time, the focus was mostly on two characters, Kanbaru and Rouka (a new character), with some intervention from some very familiar characters.\\n\\n\r\nStarting with Kanbaru, she does undergo change. She learns life lessons from people new and old. She comes to understand what it means to live with misfortune and how people should act the way the want to and not being told what to do.\\n\\n\r\nOn this point, one of the most important lines in the show is Kanbaru's mother's mantra, \"If you can't be medicine, then be poison. Otherwise you are just plain water.\" In other words, one should try to be wholly good or wholly evil, otherwise you fall into some gray area that has no real purpose; you neither help nor hurt, your just \"there\". She comes up with an answer to this motto near the end, and it helps to let us know that she, as a character, has also come to understand what it means to be good or evil.\\n\\n\r\nKanbaru learns this almost entirely through Rouka. Being a new character, the show spent the majority of its time letting us into her mind, as most arcs tend to do in Monogatari (focusing on one character and seeing them grow). Once again, they do a nice job. They make her stance/ideals interesting and unique enough so that her perspective on the matter contradicts what most people think. This, probably obviously, makes us think. Making us think is good, because it allows us to see the different side to an argument. Or at least, it provides us with a unique perspective that we probably have not thought of before.\\n\\n\r\nOverall, I liked her character. Not as much as the staple characters of the show, but enough where I consider her to be a part of the gang.\\n\\n\r\nSOUND\\n\\n\r\nSadly, I found the sound to be just average. The OP is used once and is too generic for my liking. The ED, while not to my liking as well, was definitely unique for its tone/beat. The visuals for it were nice as well.\\n\\n\r\nThe rest of the soundtrack was nicely done, but nothing out of the ordinary, except for a certain character's remix.\\n\\n\r\nThe voice-acting is expertly done was again. Kanbaru, Rouka, and the rest of the cast do a fantastic job of portraying their characters personality, and it is more of the same goodness from all of them.\\n\\n\r\nENJOYMENT\\n\\n\r\nSomething that most people will say is that this is a series that is not for the \"anime beginner\". I agree with this statement, not only because of the strange humor and style the show is known for, but also due to the heavy amount of talking. You have to love characters just talking to one another about one topic for a long time. If you need constant action, this is not the show for you. If you need a super-compelling plot with huge twists and turns, this is not the show for you.\\n\\n\r\nPersonally, I love these types of shows. It allows for great interactions and really shows off the writers'/author's prowess in presenting interesting conversations between the many different characters he/she have designed. And again, more so than most shows, these arcs always seem to be a step above. The talking never gets jarring or annoying, and you never feel like they are simply going through the motions. Everything they say is important and has specific meaning.\\n\\n\r\nFurthermore, if you like SHAFT head-tilts, interesting character designs, and stylized directing, then you will enjoy the show even more.\\n\r\nThe only complaint enjoyment-wise is that I wish the show was just slightly longer. But that may just be me wanting more Monogatari. :P\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, less about plot and more about good dialogue\\n\\n\r\nAnimation: Great, every shot counts (even if it is SHAFT being SHAFT)\\n\\n\r\nCharacters: Good, some old and some new, with nice development for everyone\\n\\n\r\nSound: Fine, OP and ED are average but the rest of the soundtrack was nice to hear\\n\\n\r\nEnjoyment: Good, more Monogatari is always a good thing, right?\\n\\n\r\nFinal Score: 7/10",
            "date": "2014-09-19T01:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 160943,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=160943"
        },
        {
            "content": "Hanamonogatari is a relatively average arc from the Monogatari Series. Hanamonogatari was originally supposed to be part of Monogatari Series: Second Season (it is in the light novel), so it fits pretty well with those arcs if you’ve seen them. Hanamonogatari is another monkey arc, but we follow Suruga Kanbaru as she meets up with an old friend. \r\nWhat makes Hanamonogatari stand out is the writing. It has an intricate plot, which is the highlight of the arc. Sadly, I cannot talk about it in too much detail because it’s 5 episodes that depend on a plot twist. What I can say, is that Ireally enjoyed the first three episodes. Hanamonogatari tells you a full, well written, convincing, wholesome story; then, it pulls a big plot twist in episode four. I’m not gonna say the plot twist original, or clever, or particularly unique, but I will say that the preposition of the plot twist was very well done. \\n\\n\r\nHanamonogatari is simply more Monogatari. It’s good and worth watching if you’ve gotten this far. \\n",
            "date": "2019-02-24T22:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 302406,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4169795.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Falco2424",
                "username": "Falco2424"
            },
            "url": "https://myanimelist.net/reviews.php?id=302406"
        },
        {
            "content": "(7.5/10)\r\nHanamonogatari, or \"Flower Story\" as i so expertly managed to google is a story about Kanbaru. Our favorite tomboy who actually managed to stay mostly out of the second season. \r\nApart from a mention in the first arc of the second season, she didn't make much more than a visual appearance throughout, however, she really has a solid story to deliver with Hanamonogatari. \r\nIn a way, Hana is a like an old friend you just recently got a message from. \"Hey, wanna meet up?\" At first you toss it aside and decide to go about your day. Whether that's watching anime, wack the one-eyed wonderweasel, or both at the same time. The day passes and the sun sets, you relax in bed after your tranquil day and decide to browse whatever social media website you prefer on your phone. \\n\\n\r\nHowever, you have another glimpse at this long forgotten friend and you decide, \"eh... why not?\" and message them back. \\n\\n\r\nYou meet up with them, talk a bit at the cafe, reminisce about the past, and move on. There isn't really any emotion to your conversation. There isn't really any spark. Its just a nice little talk you had. You don't regret it, but you don't think think you want to do it again as you have better things to do. \\n\\n\r\n______________________________\\n\\n\r\nThis kind of attitude is a lot like Kanbaru's arc. The entire episode feels a bit slower, a bit more reminiscent, and in a way, it is. Kanbaru meets up with her long forgotten rival, Numachi Rouka, and they don't hit it off, they don't hate each other, they just sorta talk. \\n\\n\r\nThen they part ways... and that's that. \\n\\n\r\n______________________________\\n\\n\r\n[PART 1] : How imagery reflects feeling\\n\\n\r\nOf course that's not all that happens. This is Monogatari after all, but i'm mostly talking about the first twenty or so minutes as I really enjoyed the general distance this show had.\\n\\n\r\nThe imagery reflected this too. We got wide open shots with just about everything. Empty classrooms, vast open white tiles with lonely tree stumps being some of the only decoration. Its a an empty world in Monogatari, but that's nothing new. \\n\\n\r\nHowever, much like a lot of season two, this show is putting us into the world of another character that is specifically not Araragi. \\n\\n\r\nJust like Kaiki's world was full of people, Kanbaru's is distinctly empty. \\n\\n\r\n_______________________________\\n\\n\r\nAs Araragi's cameo appearance drives her home in the dark, desolate land, Kanbaru talks of loneliness. She talks about how after the people who understood her left, she no longer really feels like she has anyone. \\n\\n\r\nThis reflects through her conversation with one of her \"friends\" in the first episode, and throughout the whole episode as well. She lays alone in bed, she wakes up and runs alone to school, and she sits alone in an empty classroom where her old friend Senjougahara sat. \\n\\n\r\nShe graduated a grade, but not emotionally. \\n\\n\r\nBut through this car ride conversation she sees that the world isn't really like that. Things get taken away from you and you feel weak afterwards but the things being taken away aren't unaffected. \\n\\n\r\nAraragi talks about Gahara's loneliness, he talks about his loneliness. And in one of the shows most sobering moments he mentioned of Kanbaru is one of the few people who understands his most personal wants. \\n\\n\r\nI think this is the first time we've actually seen Araragi discuss his definite pedophilia, and the scene wasn't played for laughs. \\n\\n\r\n....\\n\\n\r\nThis was my favorite scene in the arc as i related to it more than I like to admit. I've had close friends move, or even simply leave my school. And much like its obvious that Araragi doesn't actually live miles and miles away, it should have been obvious to me that these friends would just be a phone call away. \\n\\n\r\nBut somehow the stupid idea that if we don't go to the same school anymore festered within me and I no longer see them. I don't know why. Maybe its the lack of things to talk about. Maybe its the fact that I don't see them on a daily basis. \\n\\n\r\nThis is never more prevalent than when someone goes to college for their first year too. \\n\\n\r\nThe show does a great job with explaining that and showing that Araragi too is feeling lonely. \\n\\n\r\n....\\n\\n\r\nNot only did this scene relate and resonate with me, but it also helped the entire theme of the episode. \\n\\n\r\nJust as Rouka heard the misery of that person who visited her in the hospital, Kanbaru heard the loneliness Araragi and Gahara were feeling as well. Just like Rouka, Kanbaru felt better and while this loneliness wasn't perhaps as crippling as Kanbaru's; Kanbaru still found solace in knowing she wasn't the only one going through it. \\n\\n\r\nThis scene played out in-theme with the a lot of the first half of this arc and i loved it. Imagery correlates with emotion and can often effect it. The lonely highway and bright, yet derelict tunnel reflected this. \\n\\n\r\n__________________________________\\n\\n\r\n[PART 2] : The concept of story\\n\\n\\n\r\nBut this isn't really what this arc was. It still had to tell a story and I feel like that's what drags it a bit down in terms of success. \\n\\n\r\nMonogatari was never an overly emotional show, and when it was emotional, it was always sparse. With the highlights being Hachikuji's departure as well as Araragi and Gahara's date in Bake. \\n\\n\r\nI felt like this episode suffered from lack of emotion. Kanbaru struggled with the notion of telling Rouke that she's dead, but that struggle is all we saw. The resolution really had none of that. \\n\\n\r\nI felt like for once, we could've gotten a bit more of a punch, especially since the story was playing more like Season two Monogatari rather than season one. \\n\\n\r\nBy that I mean that the visuals were toned down and the story was on full focus.\\n\\n\r\nThis also meant that we got yet another episode-long exposition scene where Rouke goes on and on about her backstory. This is generally delivered straight and without much emotion either. It had me reminiscing back at the really painfully boring Shinobu backstory we got in season two as well. \\n\\n\r\nIt also had me thinking about Tsukimonogatari's exposition and how that was done significantly better than this. \\n\\n\r\n....\\n\\n\r\nWith that said, the relationship between Kanbaru and Rouke was interesting enough, with a definite romance being hinted at heavily in the intro. \\n\\n\r\nIt has all the building blocks for an emotional story but was much too bogged down by more cliche anime trappings like extended exposition for the sake of understanding.\\n\\n\r\nI may come off as pretentious here but sometimes not everything needs to be understood. Sometimes we can just let shit be if it means we get more calm, introspective car rides and talks with Kaike. \\n\\n\r\n_________________________________\\n\\n\r\n[PART 3] : Hypocrite\\n\\n\\n\r\nI can't help but feel like the show was hypocritical this arc, too. Especially when comparing said car scene and the twenty minute exposition scene. I felt like it was a completely juxtaposition to have both of those scenes in the same arc. \\n\\n\r\nThey felt like something completely different. \\n\\n\r\nThis is never the more prevalent than Kanbaru's talk with Kaike who's inexplicably alive after Hitagi end and is now sporting an absolutely awesome goatee. \\n\\n\r\nI don't know if it was intentional, but they had Kaike looking like a complete villain, what with his menacing goatee and devil-horn haircut. Yet he acted more like a father here. \\n\\n\r\nMuch like the car ride, this other scene served as one of my favorites. Kaike's  monologue on meat and Kanbaru's inability to let go of her petty hatred was a pleasure. While it felt a little cheapening of Hitagi End's absolutely jaw-dropping finale, I was still happy to see him in the show. \\n\\n\r\nThis is where this arc seems to fail the most. Its an passive look at an aggressive story. While the show is aggressive here on occasion, with Kanbaru battling Rouke in basketball... that serving as her return to the sport... its still something I can't really say worked that well.\\n\\n\r\nIt felt a little forced. It felt a little \"meh\", much like your discussion with previously mentioned friend. It was just there. \\n\\n\r\nI guess that fits the tone too, if I think about it. Maybe i'm being the hypocrite here. Maybe I don't understand, or childishly can't accept that when a show is as wholly encapsulated in a theme that that theme has to stretch past simple imagery or certain scenes. \\n\\n\r\nI don't know what I was expecting and as if this show is a pro at doing so, it makes me hard to give an honest rating to this episode. \\n\\n\r\nThe climax was underwhelming with Rouke, but maybe it was supposed to be? \\n\\n\r\n_________________________________\\n\\n\r\nConclusion : \\n\\n\\n\r\nThe arc as a whole was solid. It fits well with the second seasons more dreary and less comedic tone. It also helps finish Kanbaru's monkey arc. \\n\\n\r\nI find that it was a mix of absolutely spectacular dialogue and plodding less interesting rambling. Maybe that's a reflection on the show as a whole though, as the writer has to figure out some way to relay information to the viewer. \\n\\n\r\nMaybe that's one of the trappings of light novels, god knows i've never read one. \\n\\n\r\n....\\n\\n\r\nThis solid arc does a nice job of completely wrapping up the second season and giving us ample reason to be excited for the third and apparently final season. \\n\\n\r\nMuch like a calm talk with an old friend or simply admiring the cliche beauty of a flower, its not the most memorable arc. But its something I don't regret watching, and something I'm happy I got to see. \\n\\n\\n\r\nAll the best",
            "date": "2016-08-08T02:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 226210,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5554102.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Artrill",
                "username": "Artrill"
            },
            "url": "https://myanimelist.net/reviews.php?id=226210"
        },
        {
            "content": "I'm not a fan of Kanbaru Suruga so it took me 6 days just to finish 5 episodes of Hanamonogatari. However, I'm not saying that I hated Hanamonogatari. I just didn't like it as much as the previous Monogatari shows. \r\n[Story]: (7/10)\r\nHanamonogatari is a sequel to Monogatari Series: Second Season and it chronologically takes place after the events of Owarimonogatari. The show features Suruga Kanbaru and is set after Koyomi graduates from high school. \r\nFrom this point on, everything that comes out of my mouth....I mean, everything you read from this point on are just my opinions. So if I say the show bored meto death, that's not going to be the case for everyone. Ok then...\\n\\n\r\nThere's a reason why I found Hanamonogatari to be the most boring out of the Monogatari Series. Firstly, it doesn't feel the same as.....Bakemonogatari and Monogatari Series: Second Season. I mean, there's no more conflict left to resolve here. Everything is done after the \"Hitage End\" arc. So what the show did is build Suruga's character in the most boring way possible. Maybe the problem here is the plot doesn't move forward at all. It's just Suruga dealing with her past and her old rival. If you didn't find this show boring then good for you but I did. Remember, it's my goddamn opinion. \\n\\n\r\nBy skipping Hana, you're not going to miss a lot besides Suruga's character development. Then again, this is the last arc (chronologically) for the Monogatari series and there's no more stories after her arc so I don't see the point in her character development. The Suruga that you will see in this show won't be in Tsuki and Owari because they both take place place during the events of Monogatari Series: Second Season. \\n\\n\r\nWhat you are going to miss is Araragi in college, Ougi's sexual identity and all that minor stuff. \\n\\n\r\nThe pacing is excruciatingly slow. The dialogue scenes dragged out for way too long and Suruga's problem can be solved in about 3 episodes, maybe 2 episodes. I also hate to say this but this is the first Monogatari show that does not have interesting or engaging dialogues. Maybe it's because they talked about stuff like good and evil, selfishness and all that crap and dragged it out for as long as they can. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Art/Animation]: (10/10)\\n\r\nGod, this is the 5th show and I still have to review the animation. I just want to get this out of the way. The animation and visuals looks the same as Monogatari Series: Second Season which got a perfect 10 so I'm also giving it a 10 for this show. The unique animation that SHAFT has (SHAFT head tilt, flashing text, etc.) is still present.\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Sound]: (5/10)\\n\r\nNote that majority of the score for the \"Sound\" category comes from the Opening theme and part of it comes from the Ending theme so it doesn't matter if the soundtrack is crap or the voice acting is crap, it won't affect my sound rating that much. I'm not, however, saying that the soundtrack and the VA is crap because they're not. OST sounds great, the soundtrack sounds great and the VA's did a wonderful job voicing the characters. Now the OP and ED theme song.\\n\\n\r\nThe OP theme song is \"\"the last day of my adolescence\" by Suruga Kanbaru\" and \"Hana Ato: Shirushi\" by Marina Kawano. I am fully aware that the OP and ED theme song is the other way around in the TV Broadcast version but I watched the show in Blu-Ray version. Honestly, they both sound like crap. I ended up skipping the OP after the first episode and this if the first Monogatari OP that I skipped. ED song also sounds like crap. Nothing sounds catchy nor did the singer's voice sound wonderful. \\n\r\n--------------------------------------------------------------------------------------------\\n\r\n[Character]: (8/10)\\n\r\nHanamonogatari focused heavily on Suruga Kanbaru and her old basketball rival named \"Rouka Numachi\" so don't expect the other girls to appear. There are some character from the previous show who made an appearance like Araragi which shouldn't be a surprise and Kaiki who continues to be a bad-ass in this show. Araragi didn't really play that much of a role here. He just appeared to console Kanbaru and talk to her about stuff like college, where he got his car, etc. Kaiki played a minor role in solving Kanbaru's problem. \\n\\n\r\nThe only thing I like about this arc is Kanbaru's character being fleshed out. Ever since her arc in Bakemonogatari, her character was left to dust in Nise and Second Season and wasn't really explored that much. While I do love Kanbaru's character being fleshed out, that doesn't change the fact that Hana is boring show when compared to other Monogatari shows. I'm going to leave Numachi to you because I don't have the energy right now to explain who she is, her motives and why she's even here in the first place. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Enjoyment]: (6/10) \\n\r\nHow many times have I mentioned that I found this show to be boring? 3 times? That's right, I found it boring. I didn't enjoy this show as much as Bake, Nise or Second Season. It's insane that I finished this show in 6 days considering the fact that there's only 5 episodes. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[VERDICT]\\n\r\nHanamonogatari is, by far, the weakest Monogatari show I have ever seen when compared to Bake and Second Season. The dialogue scenes weren't as engaging as the previous shows and it ended up as a dragged out boring dialogue scene. Despite the boring dialogue scenes, it was nice to finally see Kanbaru's character being fleshed out. If you're a Kanbaru fan or you're a big fan of the Monogatari series then I recommend that you watch this show. Otherwise, just don't bring your expectations up. \\n\\n\r\n[OVERALL]: (7.2/10)\\n\\n\\n\r\nPros:\\n\r\n+Good Story\\n\r\n+Second Season's Outstanding Animation is here\\n\r\n+Kanbaru's character is finally being explored\\n\r\n+Fanservice drastically reduced\\n\\n\r\nCons:\\n\r\n-Dialogue scenes are not as engaging as the previous shows\\n\r\n-Dialogue scenes are dragged out\\n\r\n-Pacing is way too slow\\n\r\n-Soundtrack is mediocre compared to previous shows\\n\\n\\n\\n",
            "date": "2015-11-22T12:43:00+00:00",
            "helpful_count": 7,
            "mal_id": 203972,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=203972"
        },
        {
            "content": "I'm going to make this quick. This is NOT gonna be a full-review of the series, but a little overview of the Sugara Devil (Hanamonogatari) arc. It pains me to make this quick because it might just be my favorite Monogatari arc so far. \r\nWe start after everything ended. Araragi and Senjougahara gratuated, Hanekawa left on her trip, you know the whole thing is ended. That's pretty much it. \r\nHanamonogatari stands out among the other arcs like Bake, Nise and Second Season in that it doesn't use a lot of the trademark abstract moments, having little to none of those particularly weird transitions. With that,Sugara Devil feels... empty. Emptyness fills this arc. It basically was only Kanbaru, Rouka (a great character by the way), a little of our home boy Araragi and the glorious return of best girl (Kaiki). It makes the arc even slower than how the originals were... Which is slower than internet fucking explorer. Even though the show is even slower, it doesn't make it worst. I personally really enjoyed how it was the less focused on random bullshitting about stuff like salad dressing or fanservice or demons or any of the original tropes of the Monogatari franchise. It was almost only character development for Suruga which was amazing. For the story, it was not the best because of almost nothing happening (except the collector's plot which almost nobody cared about). As for the art, it's fucking Monogatari! What did you except from Shaft?!\\n\\n\\n\r\nAnyway, tonight was the 5th time I watched it and it really grew on me once again so I decided to write a lil' review about it. Yes it is not in-depth, it's not sophisticated, it's superficial, but it's better than my Code Geass R2 review. As for my real thoughts on the only good harem worth watching (The Monogatari Series), you can expect a very long one in the near future.  \\n",
            "date": "2015-04-30T18:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 186868,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4572747.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DankPeanut420",
                "username": "DankPeanut420"
            },
            "url": "https://myanimelist.net/reviews.php?id=186868"
        },
        {
            "content": "http://www.crunchyroll.com/monogatari-second-season/hanamonogatari-suruga-devil-659521 \r\nthis is the link i used to find it it is just a part of monogatari second season on crunchyroll\r\nI really just wrote this review for the link but apparently it has to be longer so... i mean  me likey the plot i guess and i would recommend it to my friends. shit i ran out of ideas and it isn't long enough. welp.\r\n well i guess i could also put this link\r\nhttp://bakemonogatari.wikia.com/wiki/Monogatari_Series_Timeline_and_Watch_Guide \r\nkiss anime has the series in chronological order as in the story and this has them in the order that they were made. I think it is better to seethe development of the writing and stuff, and most people watched it in that order and other stuff like that. the site explains more.",
            "date": "2017-06-28T20:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 251371,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6296894.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lordofthequacks",
                "username": "lordofthequacks"
            },
            "url": "https://myanimelist.net/reviews.php?id=251371"
        },
        {
            "content": "Hanamonogatari just didn't do it for me as a fan of the Monogatari series.  It's more of a side story focusing on Kanbaru and an old basketball rival of hers, Numachi.  And really, that was a problem for this anime.  Kanbaru is a likable character, but she is not nearly charismatic enough to carry an entire anime as the lead, especially when her foil, Numachi is particularly bland.  \r\nThe entirety of the anime focused entirely on these two characters and only briefly featured cameos from the Araragi family and Kaiki Deshuu.  This was a mistake, as most of the engagingdialogue and mystery was missing from this installment, precisely because most of the cast was either gone, or only involved for a cup of coffee.  \\n\\n\r\nBut what really hurt the anime was the insanely long backstory of Numachi, she spent all of episode 3 and then half of episode 4 explaining her history.  That really sucked me right out of the anime, because I wasn't really invested in her as a character to begin with so having so much time explaining her past wasn't incredibly entertaining.  \\n\\n\r\nThe climax of everything was also kind of lackluster.  Things are settled in this anime with basketball games instead of fights, which was kind of a weird choice.   But, at no point in time was the outcome in any doubt.  The conclusion was just kind of \"meh\".  And that sums up this whole anime for me. \"Meh.\".   I'm looking forward to better installments going forward.  \\n\\n\r\nStory: 5\\n\r\nArt: 10\\n\r\nSound: 7\\n\r\nCharacter: 6\\n\r\nEnjoyment: 5\\n\r\nOverall: 5",
            "date": "2018-07-24T10:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 284677,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=284677"
        },
        {
            "content": "This series is basically just talking. Talking, talking talking and talking. I know the other Monogatari seasons contains a lot of talking and mystery, but this one is the worse yet. It really didn't quite feel like the typical monogatari seasons where Araragi is the Main character, and he walks around to explore the mystery that the viewers also are queries about.\r\nAnyhow.. Ever since I started watching this Monogatari series, I noticed a high frequency sound when sound effects were played. So I guess either the sound wasn't checked through an equalizer, or the people making these sound effects didn't have the possibility to hearthese high frequencies.\\n\\n\r\nOverall I feel like this have been the most boring Monogatari series Yet. But you might like this kind of mystery.",
            "date": "2017-03-20T15:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 243051,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5721558.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/typewar",
                "username": "typewar"
            },
            "url": "https://myanimelist.net/reviews.php?id=243051"
        },
        {
            "content": "Hanamonoagatari is yet another fantastic entry of the Monogatari Series, written by novelist Nisio Isin. Everything that you know and love about the series is back in Hanamonogatari: the comedy, the mind-boggling dialogue, supernatural mumbo-jumbo, the out of this world art style and, best of all, the incredibly well written characters that will win you over in just a few scenes. However, what also makes Hanamonogatari so special is it's emotional attachment to a character that you would never have thought to care so much for in such surprising ways.\r\nNow, the first noticeably different factor of the show is its focus on one of themore minor characters of the series: Kanbaru. Kanbaru has always been a character who, although entertaining, is a bit downplayed in terms of the depth that other characters in the series contain. Fortunately, this entry allows you to connect better with her than before, and if you already loved her before then it's a win-win! \\n\\n\r\nBecause of this focus on Kanbaru, the story has you follow certain days of her life set after the events of Monogatari Series: Second Season. While the story is not as energetic compared to its predecessors, what makes it worth the watch is the terrific dynamic between Kanbaru and the character known as Rouka Numachi, Kanbaru's childhood friend. Rouka's amazingly detailed past including the affliction that she gained from it is told in a way that is both tragically heartbreaking and colorfully written. As interesting as the supernatural lore and topics are, watching Kanbaru's many interactions with this somber friend of hers are truly the standout moments in this show and deserve praise. \\n\\n\r\nSpeaking of interactions, Hanamonogatari still contains the series' usual fair of laugh-out-loud and witty conversations with its many eccentric characters. Many of the major characters of the series appear in the show in various scenes, however, I personally found that most of the characters shown on screen were pretty meaningless and served the purpose of showing up in the show only as cameos for fans. Like I said, these characters do still provide the witty humor and odd interactions, but I felt as though this specific entry in the series did not need most of them because of the fact that some of them had very little to do with the story, thus, causing them to serve as a distraction.\\n\\n\r\nIf you've watched any of the past entries in the series, then you shall already become familiar with Hanamonogatari's art style. The colorful scenes within the show are top-notch and beautiful to look at. What's also beautiful about the art this time around is the incredible scenery and architecture. The series has always contained great architectural scenery, but Hanamonogatari pushes it to a whole now level, containing transforming construction sites, spiral rooftops, and much more. What also makes the scenery so great in the show is how the scenery alone tells you a lot about the two central characters of the show just with art alone, which I found to be very impressive. \\n\\n\r\nHanamonogatari is a chapter of the Monogatari Series where you will find more of the same quirks and tropes of the series as well as many, many new factors. The emotional connection that you gain between Kanbaru and Rouka in just a mere five episodes is worthy of applause and will have you wanting more depth such as this in the future entries to come. While the rest of the supporting cast is a bit underwhelming, they still provide the usual comedic and dialogue-heavy moments that the series is known for. Hanamonogatari is an exceptional show, not just within the series, but as an anime in general because of its unique style used to portray various emotions with its central characters. This show is without a doubt worth watching if you love this series as much as I do!",
            "date": "2014-09-01T15:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 158805,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3235167.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Black_Butterfly",
                "username": "Black_Butterfly"
            },
            "url": "https://myanimelist.net/reviews.php?id=158805"
        },
        {
            "content": "Hanamonogatari is yet another entry in Studio Shaft's ultra offensive anime franchise. It lacks humor, the characters are dull, and the show is just getting worse.\r\nAfter the surprisingly good Hitagi End arc of the Second Season, we're left with this trite piece of...something. I'm loathe to call it art.\r\nHanamonogatari continues the show's long running gag of placing power point slides in the narrative that move too fast for most people to read. There are words there, but you'll never read them. Other times it'll be a black frame or red frame with the words \"black frame\" or \"red frame\" on them. This is just incase the viewer is too stupid to figure out what it really is. Hanamonogatari really stretches it by showing the viewers the elusive pink frame, however. Is that a plus? I'm not sure.\\n\\n\r\nThis show follows the character of Suruga, or something of the sort. I don't know. I forgot her name after she failed to kill Araragi all the way back in Bakemonogatari. Had she succeeded the quality of the show would have increased dramatically. But she didn't so I'm going to hold that against her. She's remiss when her arch-nemesis from jr. high shows up.\\n\\n\r\nIt reminds me of a story that one of my friends told me when I first met him in high school. He previously went to a private Catholic school. However, you cannot go to a private high school in my state. His dad taught at my school so naturally he went there. Anyway, he too had an arch nemesis in the form of a Greek kid named Kosta Fantidas. He used to tell me about how much he hated this kid and what a drag on his life he was.\\n\\n\r\nTurns out that Surugu talks her nemesis to death and then defeats her in a game of basketball. Da fuq? My friend's nemesis probably grew up to be a villain in a Bond movie just to contrast.\\n\\n\r\nNear the end this series pulls out all the stops on being offensive and reintroduces Araragi. I was sincerely hoping I wouldn't have to see this guy in this show because seeing him negatively affects the quality of my life. I am worse off for knowing that Koyomi Araragi is a character in a show.\\n\\n\r\nAraragi spends the last 10 minutes of the show talking about how much he wants to molest his sister. Also he was being a creep and watching Surugu sleep in the nude. That was after he entered her house uninvited. Seriously though, Hitagi volunteered to be this idiot's girlfriend. He should be getting enough sex from her to get over his deviant sexual behavior. Guess I'm too optimistic, though.\\n\\n\r\nIt will probably take no less than 3 hours of spamming Guile's theme for me to feel better about myself as a person after having viewed this show.",
            "date": "2016-06-20T17:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 221342,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5467326.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/carnage_panda",
                "username": "carnage_panda"
            },
            "url": "https://myanimelist.net/reviews.php?id=221342"
        },
        {
            "content": "Hanamonogatari - 9/10\r\nHanamonogatari is a sequel of Monogatari Series Second Season (Adaption of 7th book Nekomonogatari Shiro, 8th book Kabukimonogatari, 10th book Odorimonogatari, 11th book Onimonogatari, 12th book Koimonogatari) which itself is a sequel of Nisemonogatari which is a sequel of Bakemonogatari.\r\nThis one is about Kanbaru Suruga, this whole story is set after Araragi graduates so he is not related to the plot, neither is any other Monogatari characters, except for Kanbaru, Kaiki and some new characters, aswell as breifly mentioned Izuko Gaen.\r\nBy far, one of the best things i've ever seen. First of all, yes this is one of the most dialogue-heavy stories outof Monogatari, and is almost irrelevant to the actual plot, except for some clearance in what connection did Kaiki and Kanbaru share in Nisemonogatari.\\n\r\nEven though it's mostly dialogue, hell yeah it's well directed, it's dynamic, fast, awesome, creative and it looks awesome.\\n\r\nI loved it, the Basketball scene, the restaurant scene, the whole 5th episode are all awesome. Fucking awesome, there is so much depth to Kanbaru, which at first seemed like a filler character back in Bakemonogatari, but now feels almost like the deepest character in the series, it's just so well executed and done, though i feel like Araragi and Ougi weren't really necessary, Araragi was there because hell he is the main protag after all, and Ougi was there because....yeah, becuz you have to get people hyped up for all that sweet shekels you're gonna make on the third season huh?\\n\r\nAnyways, SHAFT is fucking based and this is one of the best shows ever.\\n\r\nAlso i guess this one is a bit more serious than the others, but oh well, it served it best, especially midway through episode 3 you just realize there is so much information, and all those side-story characters are all actually so interesting, and you just want to know more and see how it ends.\\n\r\nYou got the typical Pseudo-psychology here, just like Second Season, you got the super cool eye blink frames and the \"slides\" and much more.\\n\r\nIf you like Monogatari, and you thought you'd skip this one out because it's not about best girl, then maybe you should think again, because this one is awesome.\\n\\n\r\n\"There is no absolute evil, all evil will help someone, always, on the other hand, all good will always hurt someone, if a person is happy through their unhappiness, then why should someone tell one they are unhappy?\"\\n\r\n\"Maybe you weren't right, but you weren't wrong either, you were just enjoying Youth, after all.\"",
            "date": "2015-03-28T17:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 183803,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042687.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DanteMustDie8907",
                "username": "DanteMustDie8907"
            },
            "url": "https://myanimelist.net/reviews.php?id=183803"
        },
        {
            "content": "Warning: spoilers.\r\nLet's start saying that i really liked Hanamogatari, of course i watched the full movie version in one go. Visuals are above average for monogatari stardards, and the feeling of a movie as a whole arc was really great. Some of my friends said that this is a bit of a plot heavy arc. I don't think it was boring tough, it caught my attention and curiosity for it's whole duration, i've even watched it a second time to write a better comment.\r\nAs usual, i especially like to speak of the \"food for thoughts\" this series give, so lets begin.\r\nThe arc starts with Kanbarumentally speaking with her dead mother, which is considered a bad person. In \"being the poison\" i think she mean that it's better to crush others than to be crushed, but Kanbaru refuses this reasoning and wants to be different from her. Her mothers warns her that it will be hard: if you want too many things, you may obtaing nothing.\\n\\n\r\nKanbaru soon meets Numachi the Demon in this arc, and find her similiar to Araragi-senpai. This encounter officially stop the operate of the demon, which lasted for 3 years.\\n\\n\r\nShe did this \"profession\" for herself only, by meeting persons with bigger problems than her, she feels better. She just listen to them seriously, but on the inside she may laugh at them. After that, she do absolutely nothing. That's because, apart for extreme cases where she advices to contact autorities, she is avare that time heals every wound, and committing to face all your problems in one time only brings you damnation. This is her thought.\\n\\n\r\nSuruga actually had a big price to pay for deciding to face her problems right away, not enduring for a better situation. Her demonic arm caused her a whole hell of problems.\\n\\n\r\nAfter she hoped that someday, the arm will disappear, Numachi made that happen by stealing the demonic piece from her while she was groping her breast.\\n\\n\r\nAfter this encounter, we have another moment of conversation with suruga's mother. This time i find it really accurate and true: to put a serious face while pondering things, is to be stupid, real winners face things as they come, directly. To worry is to waste time, and if you actually got that time, then you can use it to ACT. It's no use crying over spilled milk.\\n\\n\r\nMan, SO TRUE YET HARD.\\n\\n\r\nSuruga wakes up without her demonic arm, and is overjoyed. After school she will meet Kaiki, who was looking for her. Kaiki sees immediately through her and knows how she thinks: Some thing can never resolved by running away, and there are wounds that time will not heal (numachi physical wound for example).\\n\\n\r\nSuruga has been warned against Kaiki, and tries to hate him, but she can't, he is really too kind with her, you could say even affectionate! After all suruga is the daughter of Kaiki's best friend and tutor. In the past, she asked to him to look after her child if something happened to her.\\n\\n\r\nKaiki brings something interesting to us: not always love is given back, and not always hate is responded with hate. Nobody and nothing is pure evil, every personality is totally different, and nobody is always coherent. We will find more of this later with our friend Numachi.\\n\\n\r\nKaiki is really affectionate with Suruga in many ways, this reveal his true face. I really like him, he is a great character!\\n\\n\r\nSecond encounter with Numachi: she still insist that running away is not always wrong, to face your problems is to jump right in to them, while avoiding them may not take away your happiness, on the contrary it can help you to accept your destiny and circumstances. She suffered from the hate that talent differences brings, she tried to hide her it as much as she could by starting a sport difficult for her. From soccer where she would use her foots, to basket where arms are used. She also played in defense to hide even more her incredible skill. She then hurted herself and was hospitalized.\\n\\n\r\nAfter she got to hospital, a girl pretending to be her friend came to her, and asked her for advices. Both of them thought the condition of the other was worse than their personal one. Anyway, Numachi was delighted of her misfortunes since this reminded her she was not the only one to be suffering, she was not alone.\\n\\n\r\nShe then explain why her method works: the important thing is the relief she gave to that person by listening to her, by doing that, one stops to worry about his problems and goes on with their life, making those \"obstacles\" disappear quickly. A tombstone is mentioned, this may be a hint telling you that Numachi is already dead.\\n\\n\r\nAfter this explanation, we talk again about absolute evil. It does not exist, and every baleful event is (often) needed to help something or someone. Also, every act of justice may hurt someone. So in the end, evil or good extremes may not exist at all.\\n\\n\r\nAnother interesting thing to mention is that Kaiki says that he do not believe on anomalies, even if they were clearly there in the series. Is this a hint too about the fact that they only exist in the characters psyche?\\n\\n\r\nSuruga leaves Numachi, then proceeds to run until exahusted in the middle of the night.\\n\\n\r\nShe meets the now grown Araragi-Senpai.\\n\\n\r\nHe talks about how often we change ourselves to be liked by others, after all social acceptance is SO IMPORTANT for us. But beware, by adapting too much we risk to loose sight of many things.\\n\\n\r\nThen they start talking about helping someone which is in a bad situation. Let's say this person is happy, even if she lives in misfortune. Suruga wonders if it is right to act just to tell that person how bad their situation is, potentially causing more problems.\\n\\n\r\nAraragi has a simple yet effective solution: you must act if it bothers at least YOU.\\n\\n\r\nTo commit to something because you are worried is always a good thing.\\n\\n\r\nAs oshino said (and this IS the setting stone of the series)\\n\\n\r\nOnly You can help yourself. Suruga decides to act for her friend.\\n\\n\r\nIn their last encounter Numachi says she prefers to regret something she did not do. Well here i can answer thanks to my personal experience: it's usually better to regret something you did, rather than regret something you did not do, because you will never know what consequences your effort would have brought, you would not like to miss new opportunities and new happiness for yourself, right?\\n\\n\r\nIn the end Suruga meets her senpai again, and boy we talk of some deep shit here.\\n\\n\r\nOne of the most powerful yet simple truth in this arc lies near the end:\\n\\n\r\nIt does not matter to make a wish real, but what really matters is the fact itself to have a wish, a desire. Whatever it is a realistic one or not, we really need wishes, we can use them to know ourselves better and focus on what we truly desire. If you do not know what you want, what you want to be, or who you are, you will always loose the way on your life. This important point can make the difference between a life which has been lived and one where someone only survived.\\n\r\nThis is a lesson essential for your life.",
            "date": "2018-12-19T00:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 296129,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5509366.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Heldarth",
                "username": "Heldarth"
            },
            "url": "https://myanimelist.net/reviews.php?id=296129"
        },
        {
            "content": "*THE RATINGS FOR THIS ARE SPECIFIC TO THE PART, BUT THE REVIEW IS FOR THE OVERALL SERIES*\r\n[STORY: 10/10]\r\nThe Monogatiri series comes together well to create a masterpiece of a story. This show is much deeper than alot of people think. It is filled to the brim with philosophical arguments and great storytelling. The focus isn't mainly on action, though it does have some visually stunning action scenes. Alot of the time, it will just be conversations between characters, but this is the blood that keeps this series alive and flourishing. Without it, you'd have a normal show with above average production. This type of showisn't for everyone, but I personally love it.\\n\\n\r\n[ART: 10/10]\\n\r\nThe animators went all out animating this show, as detail and flamboyance embody the artistic direction of this show. Each character's design and set piece is carefully planned out, and it shows. \\n\\n\r\n[SOUND: 10/10]\\n\r\nThe voice actors become their characters when they act them out, that's how into them they get. They really care about their role, you can tell. And sound effects are well done as well, nothing seems off in that department.\\n\\n\r\n[CHARACTER: 10/10]\\n\r\nMost every character is important to the main plot of the story and if they aren't a main character, the style of the show makes it seem as if they don't even exist. Whether they be designed as set pieces or outlines, the show really puts emphasis on those we really care about. These characters are no joke either, pretty much none of them are one-dimensional wastes of time, which is very appeciated.\\n\\n\r\n[ENJOYMENT/OVERALL: 10/10]\\n\r\nThough some parts of the series are better than others, the series as a whole is truly an amazing body of work that I consider a masterpiece. This story is filled to the brim with beautifully crafted characters, artwork, sound design, and an amazing story that philosophically challenges the observer to think. A masterful work by Isin Nisio.",
            "date": "2018-04-03T04:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 276639,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6971623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/godofmankind",
                "username": "godofmankind"
            },
            "url": "https://myanimelist.net/reviews.php?id=276639"
        },
        {
            "content": "While watching, what I think to be the last and final chapter of this series I went into it hopeful because I do really like the star of Noestsu high, Kanbaru.\r\nHowever I did find it, although it concluded well, sort of slow. I found myself asking myself, okay? well is learning about this rival of Kanbaru's such an important moment? especially when it takes about an whole episode to explain. Also, i was curious about Kaiki's part, because not only did I think he suffered a fatality, it opened up a lot more questions, but for what? Its like they just wanted to incorporate himinto it but like.. he has no real purpose.\\n\\n\r\nI was sad at the end when she reverted back to her short hair, because lets be real, she was a lot cuter with the longer hair. I would like to know more about her mother and her past, but I feel like thats something thats most likely not going to happen. Overall, as much as I did enjoy the story of this series, I am glad that it has finally concluded.",
            "date": "2017-01-10T15:31:00+00:00",
            "helpful_count": 0,
            "mal_id": 237976,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=237976"
        }
    ]
]