[
    [
        {
            "content": "This anime isn't really worth watching.. It pretty boring in it own sense. The main character is unique in its own way. The only thing that may be of some interest to some viewers is probably the artwork because it is a harem and ecchi anime.\r\nThis anime doesn't have a storyline. There is no hook for you to continue watching. It just an typical anime that takes about how the male protagonist lives his daily life as a talented novel writer. Just that fact may sparkle some interest and the fact that he specializes in writing not romance, drama or action... but in porno!\r\nThe artis fair, they are drawn a bit childish which states that the ecchi scene are just for fun. They aren't to be taken seriously because the characters stripe voluntarily just for the hell of it. Although i comment nothing but negative here, this particular child-like yet high school students could be used in a different story to utilize the effectiveness. Just that the author is a little off.\\n\\n\r\nThe Sounds could be better where the Narukara, Fukune only play one tune on her clarinet. I the producers provided more variety then this anime may gain some more points. But in another sense, they did indeed place another music aspect into the anime.. the idol Sonokoe, Utae (yes her name translated into \"this voice sing\" ) i like her song those.. even though they are just made up and i couldn't find out if it is from an actual song or just made up on the spot.\\n\\n\r\nCharacter wise let's simplify \\n\r\nMain male protagonist \\n\r\nAkutagawa, Taketo- Porno Novelist. His choice of words can literally get girls to experience a pseudo-orgasm... If he didn't pursue the genre of porno i think he got a real talent.\\n\\n\r\nKuroki, Kurumi: Chief of the schools newspaper.. not much to say, she seems like a very important person with two men in black always with her. She seems like a devil but really she's just bored\\n\\n\r\nMeiki, Raika: Talent--Cameraman. she like to take \"ugly\" photos of people. The ugly side of human are her love for take photos. \\n\\n\r\nNarukara, Fukune: talent--Clarinet.. Although that is her talent she only plays one tune throughout the whole story. She is a rather shy character \\n\\n\r\nSonokoe, Utae: Idol .. She a rather cute character i have to say. She sings in like 2 or 3 episode. She actually a nice person.. usually in other animes the so call school's idol have a rather ugly side to their cheerful personality but her character doesn't \\n\\n\r\nOverall i wouldn't recommend watching.. unless your looking for a simply, random ecchi anime then enjoy. But ill say this i got through the whole anime thinking that something big is somehow going to wrap things up nicely and don't get me wrong, the producers did wrap the anime with the appropriate ending. What got me through is that for each character, the male character have some unqiue, and intriguing fantasy about each girl. \\n\\n\r\nCiao for now~",
            "date": "2011-11-21T19:27:00+00:00",
            "helpful_count": 46,
            "mal_id": 47841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/494748.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ray357",
                "username": "ray357"
            },
            "url": "https://myanimelist.net/reviews.php?id=47841"
        },
        {
            "content": "I feel guilty and confused after watching R-15. I'm confused on why I feel guilty, and quite a bit more.\r\nStory (7/10):\r\nI'll give it this. The story had a unique plot, but it was combined with very unoriginal concepts. It need not stick to a very serious storyline, or it would have gone worse. Every time it does start to get serious, something would throw you off. I would say it was funny, but it couldn't get more than a snicker out of me.\r\nArt (5/10):\r\nIt was average. Nothing to go on and on about, but still caught your eye as an ecchi tends to do. Imean this in the least perverted way you can think of.\\n\\n\r\nSound (7/10):\\n\r\nCatchy ed, especially. Filled in silent moments with an adequate amount of sound effects and background music, but I'd never go out of my way to look for it after watching the show.\\n\\n\r\nCharacter (5/10):\\n\r\nThe only character I liked was the main character due to his unique skill. Everyone else felt either bland, emotionless, or was a loose canon throughout. No one really got any development either.\\n\\n\r\nEnjoyment (5/10):\\n\r\nI like the ecchi elements being incorporated in an innocent way, but everyone seemed too unaware of the perversion surrounding them. The lack of an outstanding element (story, art, etc.) left me wanting to stop watching.\\n\\n\r\nOverall (6/10)\\n\r\nWatch once, and be done. If you're running out of ecchi, this may be one to check out, but don't look for anything worth praise.",
            "date": "2014-03-18T17:47:00+00:00",
            "helpful_count": 34,
            "mal_id": 136057,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2572689.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ForeverFizz8",
                "username": "ForeverFizz8"
            },
            "url": "https://myanimelist.net/reviews.php?id=136057"
        },
        {
            "content": "R-15\r\nI approached this anime because there were split opinions that it was bad others that it was good so i wanted to see for myself which one was on spot, the thing that makes you say it's bad it's because the story was interesting at first and had potential but happens to go nowhere.\r\nStory\r\nThe story had potential, but was wasted because how bad they failed to continue developing the plot, they presented you other plots that they didn't finished, like that episode where they followed Kurumi the chief of the newspaper and find out that she has a lot of secrets and after that episodeit's like they forgot that s**t or if their memories were erased and never talk about what they saw and why didn't they continue their research about it? why not follow that particular story? i wanted to fu**ing know who she really was and Fukune too, is she just like her?, it was confusing and i thought they were going to continue in the next episode but no.\\n\\n\r\nArt & Animation\\n\r\nIt was colorful, it was ok, i thought it was fine because of the ecchiness.\\n\\n\r\nSound\\n\r\nThere was no music background most of the time, the ED song wasn't bad tho, the voice acting was ok, and the song in the last episode was beautiful, those things save this from having even a worse score, it was fine.\\n\\n\r\nCharacter\\n\r\nIt was poorly done, it was mediocre, you don't care for them to be honest, there wasn't development and they were emotionless although Taketo was ok because of his talent.\\n\\n\r\nEnjoyment\\n\r\nThe only thing that i enjoyed was the ecchi elements, the ending was bad and it was continued with an OVA, it was stupid.",
            "date": "2015-08-06T11:50:00+00:00",
            "helpful_count": 28,
            "mal_id": 195347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195347"
        },
        {
            "content": "R-15\r\nCast:\r\nTaketo Akutagawa -  a genius creative writer whose speciality involves very erotic works, often experenences nose bleeds when sexually arouse, in love with Fukune Narukara, he’s also the schools newspaper writer and interviewer.\r\nFukune Narukara – a genius clarinetist, a very shy girl who doesn’t respond very easily, very much an introvert, she has feeling for Taketo to the point that in ep8 she didn’t mind changing in front on him. She values the clarinet which was given to her by her father.\r\nRaika Meiki – a genius photographer, the only student who is excepted to wear the prescribe school uniform, has an fondness to takephotographs of Taketo embarrassing moments, even though she has some hostilities with Taketo, she also helps him get out of any bad situations he get’s into, her definition to taking photos of ugly subjects is an unclear issues for one to comprehend.\\n\\n\r\nRitsu Enshuu- a genius mathematician Taketo’s only close friend, easily get indirectly arouse by Taketo’s misused of certain words usually involves anything has to do with sex, so as a remedy Taketo makes him recite any mathematical formula.\\n\\n\r\nKurumi Kuroki – she’s either a first rate genius, an evil genius or an extra terrestrial whatever, she the editor of the schools newspaper normally is in the company of 2 Men In Black and she always want to put Taketo in a lot of  trouble. She also goes by the nickname “Bucho.”\\n\\n\r\nUtae Sonokoe – a genius pop idol of sorts, who has feelings for Taketo and knows that he writes porn.\\n\\n\r\nRan Musen- a genius computer programmer and hacker, dislikes Taketo at frist but later warms up to him, she a self declared protector of  girls in her class aginst Taketo, may also suggest that she’s lesbian.\\n\\n\r\nTsukuru Kagaku a genius inventor who has invented a lot of contraptions, most of it malfunctions and Taketo often ends up the victim or be in trouble for her inventions beakdown.\\n\\n\r\nBeni Botan or is that bellybutton – a genius avant grade artist with a strange habit of using people’s bodies as her canvass.\\n\\n\\n\r\nThe setting- Inspiration Academy Private High school or Hirameki Academy \\n\\n\\n\\n\\n\r\nOnly a couple of episodes left and before this anime ends I think it’s time to make my review. So this anime’s title is called “R 15,” it is not a media classification, rather it is actually the title itself, but, then again you could say that this anime is for teens 15 and up. So, my ratings for this anime:\\n\\n\\n\\n\r\nStory- fair 6.\\n\\n\r\nWell, the story is quite simple and it’s fair enough that the story involves the everyday misadventure of the reluctant genius porn novelist Taketo Akutagawa who is a student at Hirameki Academy, a private high school for very exceptional student whom are geniuses in their own right. I like the combination of harem, comedy and ecchi genre that adds to the misadventures of the muchacho (Taketo), the school genre is more of a let down, co’z everything that happens in the story doesn’t seem to have any relation to the plot, in fact the school genre is more of a setting than part of the plot. The ecchi genre is a bit of a let down too, co’z of the censors, but the comedy and romance all compensates for its short comings.\\n\\n\r\nArt- mediocre 5.\\n\\n\r\n If we’re referring to the art of how the characters were drawn, I’d say it’s just as plain as any other art from from other animes such “Kore wa Zombie Desu ka,” “Angel Beats” and “11 Eyes.” \\n\\n\r\nSound – good 7\\n\\n\r\nGood, as in I like the ending theme and I like Fukune’s clarinet theme. I also like the new seiyus who did the voices of the characters. Especially the one who did Utae's voice.\\n\\n\r\nCharacters -   poor 3.\\n\\n\r\nWhen I say “poor” what I meant is that the characters fell short of what their roles are, so let’s discussing every one of them:\\n\\n\r\nTaketo Akutagawa- he’s a genius creative novel writer specializing in porn, he’s also the school’s news paper writer and interviewer, duh, we know that already. Anyway, he’s a good perv and I’m not talking about superlatives here, rather it has to do with his characteristic co’z he’s not the type who would intentionally seek victims. Instead he finds inspiration from ladies who were in awkward situations that he encounters which gives him some ideas for his erotic novel, also, he has a talent for getting under a girl’s skin and I’m referring to how he can make a girl experience an orgasm without being banged, if you get my drift, but, he doesn’t do it as a way to gain something from a girl instead he uses his other worldly talent to help them (girls).Ok enough of that, for a creative writer, the author seem to just limit the character to just being a novel smut writer, then again the author himself has the muchacho’s role to also include being the school’s newspaper writer/interviewer.\\n\\n\r\nFukune Narukara- she’s a genius clarinetist and she has feeling for the muchacho (Taketo), ok I get, but in this anime she’s just limited to play just one tune and when she practices she always play the same tune and uses just one clarinet, I don’t know about them classical musician, but usually a musician would have 2 or more of the same kind of instrument one he uses for practice and the other he uses to perform. By the way, I prefer her to be the muchacho’s love interest over Utae (sorry, Utae fans out there). \\n\\n\r\nRaika Meiki- a genius photographer, she’s also the school’s newspaper paparazzi, she’s the only one in Hirameki Academy who’s excepted to wear the school’s uniform for girls, though I would like to see her in one. It is not clear whether or not she has feelings for the muchacho (Taketo), though she does stalk and takes pictures of him every now and then. For a genius photographer she’s really been undermine, because in this anime she uses 1990’s photographic technology whereas she should be using the latest state of the art in digital photography and we don’t see her having  used other photographic equipment other that her film rolled camera and her darkroom. To add to her let down, is that she seems to be just an average person with a camera due to the fact that she was never seen taking artistic photography.\\n\\n\r\nKurumi Kuroki also called “Buchou”- ok so she’s the school’s newspaper editor of sorts, here, either she’s an evil genius or some kind of extraterrestrial being who’s in the company of 2 men in black. She has a habit of putting the muchacho in a lot of trouble; then again no harem genre would be complete without a manipulative rich girl around, as for her 2 men in black, either they’re her handlers (secret gov’t ops) or they’re her familiars, what is known is that they would beat the crap out of anyone who get’s close to that bitch (Kurumi). \\n\\n\r\nUtae Sonokoe – she’s a pop idol genius of sorts……….ok so does this mean that Justin Biebier is also one? Wtf , was the author of this anime is thinking about in giving her that role when she can be a genius song writer or composer? I asked this question, co’z she was never seen writing any songs nor was she seen with any musical instrument other than a microphone, then again who the hell am I talking to? Forget I asked, so, here, she (Utae) is popular not only in Hirameki Academy but outside of the school as well and she also suffers from same kind of insecurities  commonly experience by some Hollywood teen stars and young celebrities who were stressed due to the pressures of showbiz. She was able to find comfort with the muchacho who helped her deal with her woes and she also developed feelings for the latter as well. Oh and I like her voice and her song.\\n\\n\r\nRan Musen- she’s a genius computer programmer/ hacker, who is limited to hack sensitive gov’t sites and mainframe, but is unable to hack into Kurumi’s info, in fact just like any other students in Hirameki Academy she dares not cross her too. For a computer.  Info states that she prefers girls over boys, so either she’s lesbian or a self proclaimed protector of girls of Hirameki Academy. She’s hostile towards the muchacho who also happens to be her classmate, she makes it a point to protect every girl from him even thought everything that happens to them (girls) with the muchacho around are just some kind of freakish accidents either perpetrated by Kurumi, Reika and Tsukuru. And as info states, she warms up to the muchacho after helping her in a erotic skinship match with Beni Boton who wants to make a canvass out of Fukune’s body. Frankly, to be a computer geek, a tough cookie and be a hot babe like her don’t go hand in hand, she would’ve have been better off as a genius athlete or martial artist than being in front of a computer.\\n\\n\r\nRitsu Enshuu- the muchacho’s only friend and defender, he defends the muchacho against anybody who misjudges the muchacho especially from Ran, here, he’s a mathematics genius, he gets arouse whenever he hears the muchacho (Taketo) saying something erotic even though the words and slang’s were just the muchacho’s figure of speech, so to calm him down the muchacho would ask him to recite some mathematical formula (I hate math). It is not clear if he has some yaoi tendencies towards the muchacho or does he has some feeling with Ran (they make a good couple), what is known is that no school genre would be complete if the main character doesn’t have a best bud around.\\n\\n\r\nTsukuru Kagaku- a so called genius but absentminded inventor/ rocket scientist,  aside from some of her malfunctioning contraptions she’s also careless when she performs her test or experiments around campus grounds and  mostly involves rockets or pyrotechnics,  often it is the muchacho who becomes the accidental victim when her experiments and contraptions go bad.\\n\\n\r\nBeni Botan- a genius advant grade artist, she’s nothing, just some bad girl who is necessary part of the climax for this anime. Anyway, she has an unusual magic touch that can render anybody unconscious whom she sees as live canvass material (and it always involves female bodies), she feels arouse when she does her art as if she’s playing with herself. And in the remaining episode of this anime, she is one of those together with Tetsubou Meguru a so called genius gymnast who are responsible for pitting the first years against each other in some kind of “Orientation Tournament” in Hirameki Academy’s Inspiration hot springs town festival.\\n\\n\r\nKatsuyo Kurabu- a genius manger whom I thought is a genius cheer leader at first, she didn’t do much in this anime except be in a cameo role and that’s just about it.\\n\\n\\n\r\nEnjoyment and overall – fair 6.\\n\\n\r\nIn my opinion I’d say such rating is appropriate, since such let downs can be brushed aside and just enjoy this anime as it is, ok so the major let down is were the “Utae” fans out there seems to hate the idea that the muchacho (Taketo) is leaning towards Fukune, but hey! It’s just an anime, let’s just enjoy the accidental misadventures of the muchacho (Taketo) co’z it is all about him anyway,co’z it kinda look like that there’ll be more chaos coming to him until this anime ends.\\n\\n\r\nMy apologies to Utae fans out there.\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2011-09-17T11:44:00+00:00",
            "helpful_count": 23,
            "mal_id": 43583,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=43583"
        },
        {
            "content": "R-15 is a show with a mediocre story, your usual art style, fantastic music with your usual harem characters (this is not a harem show). There are tons and I mean absolutely tons of panty shots and nose bleeds, so if you like that kind of stuff in large amounts, this is the show for you.\r\n~Warning~ The very beginning of the show is very off-putting. It is something very unexpected and probably repels most people when they attempt to watch the show.\r\n~Warning 2~ Do not watch this show unless you have downloaded or bought the Blue-Ray version. The censorship that I sat through wassevere and even simple underwear shots were censored, leaving me to not understand some of the stuff that happened in the show.\\n\\n\\n\r\nStory 6/10\\n\r\nThe story isn't very original, but with what parts of the story I could follow, this is how I would summarize it. In the show there will be two girls who love the main male protagonist, but this guy has sex constantly on his mind and not to mention how incredibly dense he is. So, the show is mainly about how he becomes friends with several girls and how they must learn how to over-look his sex obsessions and understand him for who he truly is.\\n\\n\r\nArt 8/10\\n\r\nThe art is your usual bright color pallet, the lines are drawn well and the art is very consistent (unless the main character is imagining something). Overall, the backgrounds were well drawn and had focus, the characters had their own style attached to them and nothing seemed over bearing or very off-putting.\\n\\n\r\nSound 10/10\\n\r\nThis show really focused on the dialogue and music. Half of the final episode is  pretty much a music video. A clarinet isn't a very popular instrument and I was happy to see that it was a main focus in the show.\\n\\n\r\nCharacter 8/10\\n\r\nThe characters are not unique, but I was most happy with Fukune (the main female character) she is a quiet one that was able to find love. I liked that because the quiet-mysterious girls are usually just supporting characters. All the other characters are your usual harem types: Tusndere, Science genius, peppy-cheerleader, very popular type etc... The main male protagonist, instead of groping and fondling all the chicks, he instead imagines doing it and writes it down like a hentai story.\\n\\n\r\nEnjoyment 8/10\\n\r\nI enjoyed the story and the interactions (most of them) between most of the characters, but I didn't enjoy the severe censorship, so I'll have to rewatch this when the dvd's or blue-rays come out.\\n\\n\r\nOverall, the story isn't unique, the art is your usual stuff, the music is fantastic with your usual characters. There are tons and I mean absolutely tons of panty shots and nose bleeds, so if you like that kind of stuff in large amounts, this is the show for you.",
            "date": "2011-10-01T18:58:00+00:00",
            "helpful_count": 18,
            "mal_id": 44569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=44569"
        },
        {
            "content": "Updated up to the final episode.\r\nHaving just finished R-15 completely, something I had doubts about since it was so perverted to the very end, I have to say I was pleased that it was enjoyable. The concept of \"Genius\" Porno Writer was able to carry its weight, never being censored in the slightest the entire series, his delusions and fantasies top notch the entire ride. \r\nStory: \r\nAt first I thought this was just going to be random comedic absurdity, but after seeing episode two there might just be a story behind it all. With the protagnist possibly on a journey of self discovery. Then againit might be that he is just misunderstood by everyone. You know its as they say, they don't realize a writers true potential during the time he's alive. It ended up leading Taketo through a journey of self RE-discovery, as he reinforced what he is, a porno writer. Through the series he often hit stumps that made his writing turn out less than it could be, but every time some form of inspiration or discovery made him continue on the path of a porno writer.\\n\\n\r\nArt:\\n\r\nPersonally I love the art, the color is appealing, it looks pretty fluid to me as well. Everything is pretty well drawn as well, considering there are so many different elements mixing, such as robots, photography, musical instruments, sports, etc.  The girls are especially well designed, they just scream cuteness! And to the end the art pleased me, they had no issue with drawing nude bodies (censored but nude) the entire series. Gotta hand it to a company that can produce the lewder subjects in anime.\\n\\n\r\nSound:\\n\r\nThe Opening and Ending are nothing out of the ordinary. The opening can be a little catchy after listening to it a few times I guess, same with the ending. If I had to pick I like the ending song a bit more since the jingle does stick with you more. The second episode also had some music sung by the Genius Idol, and I found that enjoyable to listen to at least. Also the clairnet tune that's been played by Fukune is nice and somber. Though I have to admit the final episode blew my mind by the song that Taketo and the genius composer made, mainly due to Taketo's hella amazing lyrics. (Trust me, they were damn amazing.) \\n\\n\r\nCharacter:\\n\r\nThe characters were pretty standard in a sense they featured some of the common archtypes, but having each be a genius in a certain area in an ecchi comedy anime, shit did hit the fan at times. With Taketo our genius porno writer as the protagnist, it would be hard to say \"Oh he's pretty standard.\" Fukune I guess would fall under the shy naive archtype. Utae would fall under the idol archtype as well, but with how bold she was able to be and direct you get some fairly fantastic surprises later on. The photographer genius was ... demented I guess, she had a fetish for taking pictures of \"bad\" things as she put it once, the ugliness of humanity, don't think I've seen a character that obsessed with that before. And the other girls, well it would make this review very long if I went on about every character. \\n\\n\r\nEnjoyment:\\n\r\nI'll be honest, this is pretty much an anime you watch with little expectation and just go along for the ride. Its perverted, hilarious and makes little sense (I mean seriously, a genius  porno writer?). But, hey, this type of anime is needed once in a while just to enjoy and laugh at. And here at the end of watching this anime, I standby what I've said, you gotta watch this for the laughs and expect nothing to happen, otherwise you're going to ask yourself \"Why the eff am I watching this absurdity?!\" or \"Why am I.. Oh right the boobies.\" \\n\\n\r\nOverall, I'll keep watching just to take in more laughs and see if the story really does end up having some form of moral with the protagnist. (It did by the way.)\\n",
            "date": "2011-07-16T15:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 39289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473250.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KiritoKun",
                "username": "KiritoKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=39289"
        },
        {
            "content": "Pros\r\n-The artwork was decent, though simple to the eye. Simplicity is often a good thing, as complicated, over-detailed artwork tends to distract the viewer\r\n-The characters were unique, each having their own story to connect with their habits and personality. -The setting is an academy for geniuses, which is moderately original, but it has been done before. \r\nCons\r\n-The plot was weak, and did not flow. For example, there was a part where Taketo's editing chief was thought to keeping a secret about herself, only for Taketo to never discover what it was. This left me hanging throughout the rest of the anime wondering to myself whatthat secret could have been.\\n\r\n-There was nothing that really made me want to keep watching. Nothing about this anime particularly grabbed me. I wouldn't recommend it if you are easily bored.",
            "date": "2012-11-19T18:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 77955,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/413175.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Erucia",
                "username": "Erucia"
            },
            "url": "https://myanimelist.net/reviews.php?id=77955"
        },
        {
            "content": "R-15 is pretty much an average if not slightly under average slice of life, school life, anime series which only excels in bringing a new level of Ecchi.  The art is decent, characters are okay, story basically non-existant at times or quite weak.  I typically at this point would go into more details about the series but that really about sums up this series unfortunately.  I highly doubt that I will recommend this series, unless someone is really looking for some Ecchi school girl anime.\r\nRating 4/10\r\nPosted by @GameJok3r",
            "date": "2011-10-06T21:07:00+00:00",
            "helpful_count": 8,
            "mal_id": 44975,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=44975"
        },
        {
            "content": "R-15 anime, approaching ecchi anime with goddamn story. Overall, 9/10 equivalent to B+. The score is spread into :\r\nStory : B+. A struggle of erotic writer (Taketo, male) in literally all aspect in his life. Particularly innovative, although retaining some aspect of harem. He's quite a fool not concealing his real name in such a kind of writing. The plot developed into romantic-mixed story after first quarter\r\nArt : B+. Hard to say, but the artwork is very realistic; quite similar to animated photograph instead of hand-drawn pictures. Most girls are armed with boobs as a fanservice with notable exceptions for two girls : Fukune andKagaku. The mixture of oppai (boobs) and loli makes the anime eligible for A in art. Penalty was given for the censorship mechanism, a laser beam (reminding Indonesians for 2011 AFF Cup in their enemy's land)\\n\\n\r\nSound : A. No complaints, except a minor voice trap (female seiyuu voicing male characters), but it acts totally the opposite to add moeness effect for the male character.\\n\\n\r\nCharacter : B-. Severe penalty on several aspect. For instance, Ran's hacking ability that claimed to be able to hack Pentagon's ICBM control system (another WTF!?) that even unconnected to any computer except parallel power supply. Also Ritsu's arousal problems. Those might be add fun factor, but when a funny thing is used excessively, it won't be funny anymore.\\n\\n\r\nEnjoyment : A. Thanks to the BD-Rip, the laser is exterminated and all possible nudity under Jap's constitution is visible.\\n\\n\r\nTotally good anime for those wishes to have an anime safe enough to be watched anytime anywhere and powerful enough to be fapped on",
            "date": "2012-01-07T15:05:00+00:00",
            "helpful_count": 7,
            "mal_id": 51207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cruiser",
                "username": "Cruiser"
            },
            "url": "https://myanimelist.net/reviews.php?id=51207"
        },
        {
            "content": "This is my essential review of this awful anime : Don't watch it. It has no plot development, the story to begin with is awful. If it was going to be about a guy who writes hentai things, it might as well have been a hentai. Very awful and not even worth looking it. This is the first anime I have watched and never finished, you can check my list...this is literally the only one I have had to give a 1 to, as well.\r\nPlease save yourself time and do not watch this anime.",
            "date": "2012-01-26T15:41:00+00:00",
            "helpful_count": 7,
            "mal_id": 52605,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1108991.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/kikoredog",
                "username": "kikoredog"
            },
            "url": "https://myanimelist.net/reviews.php?id=52605"
        },
        {
            "content": "Pros \r\n+Funny at times \r\n+Decent art style\r\n+Some Decent Music  \r\nCons\r\n-Boring\r\n-Poor story \r\n-Poor Lead \r\n-All Fan Service \r\n-Slow pace \r\nMy Opinion \r\nBit behind the time on this one but Ill keep this short a sweet. I am really sick of these anime's,it's just rehashed shit, i'm sorry but that's all it is. I finished this because i don't like having half compete shows on my list. It could not have been any less original if it tried. I mean there some pretty good music in there and that was really it. I could go into each character and pick them apart but whats the point,the fact is there were all just poor and the male lead just... ill say no more. \\n\\n\r\nShould you watch this? NO just save yourself the time \\n\r\nHope my review was helpful \\n\r\nMurphy",
            "date": "2013-05-25T15:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 98391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2556849.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/MurphyTV",
                "username": "MurphyTV"
            },
            "url": "https://myanimelist.net/reviews.php?id=98391"
        },
        {
            "content": "I hate writing long reviews, but feel for me.\r\nSo you take a stroll down the path of comedy and ecchi, fanservice and laughs all around. What disappoints me now from years ago are the shameless tactics of censoring brought on by the anime industry. Its a tactic made so if the viewer wants to see the original cut he/she is forced to buy the BD. Way to go guys! Way to go.\r\nAs for the story at hand our main character is a guy who writes porn . . . riiiiiiight.\r\nHe is a  high school kid writing about his deepest and most perverted fantasies. Imean don't lie you've done it once or twice. Takuto is a lot nicer than he seems though, but writing everything that comes to his mind puts him in bad situations that will either kill him or get him some a**. Lets hope its the latter.\\n",
            "date": "2011-08-07T09:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 40937,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=40937"
        },
        {
            "content": "Story :\r\nThe story starts off pretty average, but as it gets further in things start getting much more interesting. Sadly, it just takes too long to start bringing the story to light. 7/10\r\nArt :\r\nThe art is of really high quality, and the style is quite pleasing to the eyes. This is definitely one of its strong points. Still, I only give a 10 to ones that exceed what I consider amazing. 9/10\r\nSound :\r\nThe Opening and Ending are great, very upbeat and full of life and vigor, just like the show! But, Fukune's clarinet gets really boring after hearing the same tune every episode. Thankfully there'sa point where you get to hear her play something interesting at some point in the show. yet, it makes sense, so I can't really mark it down for that to be honest. And then there's a song in this show that just blew me away which is why this is getting a 10/10\\n\\n\r\nCharacter :\\n\r\nThe strongest point of this show I would say. I loved the entire cast a lot! Well, at first, Fukune annoyed me some, but that was for unreasonable reasons. Ran really stood out well for me, and I'm glad they made her a genius programmer, it really helped make situations in the show more entertaining/interesting. The supporting cast was also really enjoyable. Fukune was fairly boring through the beginning, but she really does become much more interesting later, you just have to hang on and continue watching! 10/10\\n\\n\r\nEnjoyment :\\n\r\nIt's fun, lively, energetic, emotional, full of insight into the human psyche, and full of hilarious moments. As well as it has its fair share of sad or moving moments. Especially that song. 10/10\\n\\n\r\nOverall :\\n\r\nA lot of people will overlook this show because of its premise. And those who do decide to chance it will probably get turned off by the levels of ero, but for those who can brave it, I believe you'll find quite the enjoyable show. Though, if you hate yaoi/yuri, then stay away from this show. It plays at these themes quite a lot throughout. Most of it is just ecchi-service and nothing super super serious, but that will turn some people away for sure, and I feel those people should know this ahead of time. Now, despite how fun and enjoyable it is, the story does pull down the score some. But, as someone who's a HUGE fan of slice of life, and slice of moe life shows, story isn't the most important thing I look for in an anime. So, if you're the type that looks more to character interactions than story (and you aren't turned away by ero or yuri/yaoi) then give this one a chance! 9/10",
            "date": "2012-05-19T16:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 61543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1282997.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vampko",
                "username": "vampko"
            },
            "url": "https://myanimelist.net/reviews.php?id=61543"
        },
        {
            "content": "This is my first review, and I had to write it.\r\nR-15 had some awesome art. Super cute girls, etc. The thing is, the plot was a nightmare.\r\nFirst of all, the main character is so stupid and had to pick the MOST BORING GIRL. Second, there are WAY too many censors. Third, why does that girl have to play the same song over and over again? This anime was purely for fanservice, but it was so censored you couldn't see a thing.\r\nMaybe if it wasn't as censored, I would have scored it higher. But it's funny how it's a fanservice anime without the fanservice.",
            "date": "2011-09-11T21:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 43173,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/421549.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/freemonad",
                "username": "freemonad"
            },
            "url": "https://myanimelist.net/reviews.php?id=43173"
        },
        {
            "content": "First of all, this anime is pretty much average in a sense that it's not that great and it's not that terrible. People would often find this dull because of poor story and character development but can easily catch up because of the art and characters.\r\nStory --- 5\r\nThe story is  below aveage where the main character struggles because of his hobby/talent in which the majority thinks it's offensive. There are also parts in the story in which it doesn't make any sense at all and we can hardly notice the story development. All in all, I rate it pretty much a 5.\r\nArt --- 9\r\nIfind the art great. The camera angles and character positions are well structured. The surrounding are well-endowed with detail. The colors are bright giving it a joyful feeling to the audience. As the anime belongs to the ecchi category, we can see lots of fan service that are shown with good detail.\\n\\n\r\nSound --- 5\\n\r\nI give the sound a rating of 5. Why?\\n\r\nIt's because of the poor character voices. I kind of find it annoying for the chosen voice actors in their respected roles. Majority of the characters are not suited with their voice actors. Some students have voices like an old hag that's about to cough hairballs. It's pretty annoying for me at least.\\n\r\nThe background music and sound props used are great though. Only the voices are the ones that give me a letdown.\\n\\n\r\nCharacter --- 7\\n\r\nThe characters shown are unique with lots of variety. From a genius mathematician to a genius exorcist. It really gives a good vibe. Some characters even have a mysterious background which give an anticipated feeling. The character development is slow though but that's what makes it one of its charms.\\n\\n\r\nEnjoyment --- 6\\n\r\nEnjoyment of the series is pretty much in an average category. It doesn't attract majority of my attention as it has its own flaws. The jokes used are  redundant which loses some of its charms and some scenes are pretty predictable.\\n\\n\r\nOverall, I give this anime a 6. It's not that great of an anime but it has its own charms. If you're looking for an ecchi anime with unique characters with slow development and doesn't bothered with the story then try this anime.",
            "date": "2013-04-05T20:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 92589,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2350467.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DeAnimation",
                "username": "DeAnimation"
            },
            "url": "https://myanimelist.net/reviews.php?id=92589"
        },
        {
            "content": "After I finished watching this anime, I kind of expected how it was going to end; since many anime with harems end kind of similar in terms of romance. I found it kind of strange that the MC, who is a porno writer, easily gets nosebleeds. In my opinion, characters that get nosebleeds from witnessing something perverted are...\"pure\". Going off of that, if he is this pure, why is he a porno writer?\r\nAs with romance-comedy anime (harem optional), the male MC usually displays some kind of a dense personality; creating situational irony for the viewers to laugh at. This is effective for comedy in anime,but I felt that this anime over-used it a tiny bit. People that are picky with what they watch probably shouldn't watch this if they don't like the main character portrayed like this.\\n\\n\r\nThe setting is probably one of my most favorite parts of this anime. It sounds very original and unique. The school that contains only geniuses in all aspects of life was interesting. But, they could have focused more on the story. The story was weakened a little bit with the prominent fan-service.\\n\\n\r\nSpeaking about fan-service, the censoring was over-done a bit. There are many different anime that have WAY more fan-service but way less censoring.\\n\\n\r\nI would recommend this anime to anyone that watches anime casually only.",
            "date": "2011-10-01T19:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 44573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403099.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simpsonhead3",
                "username": "Simpsonhead3"
            },
            "url": "https://myanimelist.net/reviews.php?id=44573"
        },
        {
            "content": "I will say that R-15 was not anything special. In all honesty at times I found it downright boring at parts. In fact it took me 3 tries to get though it. Its not that this show was bad, I just believe it was badly done.\r\nStory: This anime was about a teenage porno writer who attends a school for the exceptionally gifted. If anything I would say parts of the plot is what drew me away from this anime. The relationship between the main character and most of the girls is the cliched \"dere\" relationships. The plot was really nothing exceptional itself and really boredme at times.\\n\\n\r\nCharacter: The characters were truly the only real reason I stuck though with this show. I myself enjoy the eccentric type of characters such as the ones in this series. The main character being a scorned Porno writer really interested me and I actually kinda enjoyed how he was depicted. Not only him but many of the girls as well were funny with eccentric personalities and made me enjoy the anime. The only character I really found lack luster was the main girl, the clarinet player. Even though she was suppose to be a shy type who doesn't always show her emotions. I believe that she was uninteresting and that she was a real bore throughout the entire show. In animes i'm used to seeing characters either really unemotional or showed emotions very willingly. The main girl in this anime was in between, and being as such I don't believe she was a good choice for her position.\\n\\n\r\nArt: The aren't wasn't too especially good or too especially bad. It was normal.\\n\\n\r\nMusic: In all honesty I didn't really like the songs in this series. In animes I usually find many of the songs to be entertaining and catchy, but for this series, even though it involved musical virtuosos, I didn't find a song I found catchy. \\n\\n\r\nOverall: Overall this series really wasn't something exceptional. If you watch it you may have the same experience as me, getting bored partway though and dropping it even though you had times you enjoyed. You may end up liking this series, but this is just my experience with it. R-15 was nothing exceptional and the characters are really what I thought were the only good points of the show.",
            "date": "2014-07-11T00:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 151485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3390523.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/giby1",
                "username": "giby1"
            },
            "url": "https://myanimelist.net/reviews.php?id=151485"
        }
    ],
    [
        {
            "content": "This anime isn't really worth watching.. It pretty boring in it own sense. The main character is unique in its own way. The only thing that may be of some interest to some viewers is probably the artwork because it is a harem and ecchi anime.\r\nThis anime doesn't have a storyline. There is no hook for you to continue watching. It just an typical anime that takes about how the male protagonist lives his daily life as a talented novel writer. Just that fact may sparkle some interest and the fact that he specializes in writing not romance, drama or action... but in porno!\r\nThe artis fair, they are drawn a bit childish which states that the ecchi scene are just for fun. They aren't to be taken seriously because the characters stripe voluntarily just for the hell of it. Although i comment nothing but negative here, this particular child-like yet high school students could be used in a different story to utilize the effectiveness. Just that the author is a little off.\\n\\n\r\nThe Sounds could be better where the Narukara, Fukune only play one tune on her clarinet. I the producers provided more variety then this anime may gain some more points. But in another sense, they did indeed place another music aspect into the anime.. the idol Sonokoe, Utae (yes her name translated into \"this voice sing\" ) i like her song those.. even though they are just made up and i couldn't find out if it is from an actual song or just made up on the spot.\\n\\n\r\nCharacter wise let's simplify \\n\r\nMain male protagonist \\n\r\nAkutagawa, Taketo- Porno Novelist. His choice of words can literally get girls to experience a pseudo-orgasm... If he didn't pursue the genre of porno i think he got a real talent.\\n\\n\r\nKuroki, Kurumi: Chief of the schools newspaper.. not much to say, she seems like a very important person with two men in black always with her. She seems like a devil but really she's just bored\\n\\n\r\nMeiki, Raika: Talent--Cameraman. she like to take \"ugly\" photos of people. The ugly side of human are her love for take photos. \\n\\n\r\nNarukara, Fukune: talent--Clarinet.. Although that is her talent she only plays one tune throughout the whole story. She is a rather shy character \\n\\n\r\nSonokoe, Utae: Idol .. She a rather cute character i have to say. She sings in like 2 or 3 episode. She actually a nice person.. usually in other animes the so call school's idol have a rather ugly side to their cheerful personality but her character doesn't \\n\\n\r\nOverall i wouldn't recommend watching.. unless your looking for a simply, random ecchi anime then enjoy. But ill say this i got through the whole anime thinking that something big is somehow going to wrap things up nicely and don't get me wrong, the producers did wrap the anime with the appropriate ending. What got me through is that for each character, the male character have some unqiue, and intriguing fantasy about each girl. \\n\\n\r\nCiao for now~",
            "date": "2011-11-21T19:27:00+00:00",
            "helpful_count": 46,
            "mal_id": 47841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/494748.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ray357",
                "username": "ray357"
            },
            "url": "https://myanimelist.net/reviews.php?id=47841"
        },
        {
            "content": "I feel guilty and confused after watching R-15. I'm confused on why I feel guilty, and quite a bit more.\r\nStory (7/10):\r\nI'll give it this. The story had a unique plot, but it was combined with very unoriginal concepts. It need not stick to a very serious storyline, or it would have gone worse. Every time it does start to get serious, something would throw you off. I would say it was funny, but it couldn't get more than a snicker out of me.\r\nArt (5/10):\r\nIt was average. Nothing to go on and on about, but still caught your eye as an ecchi tends to do. Imean this in the least perverted way you can think of.\\n\\n\r\nSound (7/10):\\n\r\nCatchy ed, especially. Filled in silent moments with an adequate amount of sound effects and background music, but I'd never go out of my way to look for it after watching the show.\\n\\n\r\nCharacter (5/10):\\n\r\nThe only character I liked was the main character due to his unique skill. Everyone else felt either bland, emotionless, or was a loose canon throughout. No one really got any development either.\\n\\n\r\nEnjoyment (5/10):\\n\r\nI like the ecchi elements being incorporated in an innocent way, but everyone seemed too unaware of the perversion surrounding them. The lack of an outstanding element (story, art, etc.) left me wanting to stop watching.\\n\\n\r\nOverall (6/10)\\n\r\nWatch once, and be done. If you're running out of ecchi, this may be one to check out, but don't look for anything worth praise.",
            "date": "2014-03-18T17:47:00+00:00",
            "helpful_count": 34,
            "mal_id": 136057,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2572689.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ForeverFizz8",
                "username": "ForeverFizz8"
            },
            "url": "https://myanimelist.net/reviews.php?id=136057"
        },
        {
            "content": "R-15\r\nI approached this anime because there were split opinions that it was bad others that it was good so i wanted to see for myself which one was on spot, the thing that makes you say it's bad it's because the story was interesting at first and had potential but happens to go nowhere.\r\nStory\r\nThe story had potential, but was wasted because how bad they failed to continue developing the plot, they presented you other plots that they didn't finished, like that episode where they followed Kurumi the chief of the newspaper and find out that she has a lot of secrets and after that episodeit's like they forgot that s**t or if their memories were erased and never talk about what they saw and why didn't they continue their research about it? why not follow that particular story? i wanted to fu**ing know who she really was and Fukune too, is she just like her?, it was confusing and i thought they were going to continue in the next episode but no.\\n\\n\r\nArt & Animation\\n\r\nIt was colorful, it was ok, i thought it was fine because of the ecchiness.\\n\\n\r\nSound\\n\r\nThere was no music background most of the time, the ED song wasn't bad tho, the voice acting was ok, and the song in the last episode was beautiful, those things save this from having even a worse score, it was fine.\\n\\n\r\nCharacter\\n\r\nIt was poorly done, it was mediocre, you don't care for them to be honest, there wasn't development and they were emotionless although Taketo was ok because of his talent.\\n\\n\r\nEnjoyment\\n\r\nThe only thing that i enjoyed was the ecchi elements, the ending was bad and it was continued with an OVA, it was stupid.",
            "date": "2015-08-06T11:50:00+00:00",
            "helpful_count": 28,
            "mal_id": 195347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195347"
        },
        {
            "content": "R-15\r\nCast:\r\nTaketo Akutagawa -  a genius creative writer whose speciality involves very erotic works, often experenences nose bleeds when sexually arouse, in love with Fukune Narukara, he’s also the schools newspaper writer and interviewer.\r\nFukune Narukara – a genius clarinetist, a very shy girl who doesn’t respond very easily, very much an introvert, she has feeling for Taketo to the point that in ep8 she didn’t mind changing in front on him. She values the clarinet which was given to her by her father.\r\nRaika Meiki – a genius photographer, the only student who is excepted to wear the prescribe school uniform, has an fondness to takephotographs of Taketo embarrassing moments, even though she has some hostilities with Taketo, she also helps him get out of any bad situations he get’s into, her definition to taking photos of ugly subjects is an unclear issues for one to comprehend.\\n\\n\r\nRitsu Enshuu- a genius mathematician Taketo’s only close friend, easily get indirectly arouse by Taketo’s misused of certain words usually involves anything has to do with sex, so as a remedy Taketo makes him recite any mathematical formula.\\n\\n\r\nKurumi Kuroki – she’s either a first rate genius, an evil genius or an extra terrestrial whatever, she the editor of the schools newspaper normally is in the company of 2 Men In Black and she always want to put Taketo in a lot of  trouble. She also goes by the nickname “Bucho.”\\n\\n\r\nUtae Sonokoe – a genius pop idol of sorts, who has feelings for Taketo and knows that he writes porn.\\n\\n\r\nRan Musen- a genius computer programmer and hacker, dislikes Taketo at frist but later warms up to him, she a self declared protector of  girls in her class aginst Taketo, may also suggest that she’s lesbian.\\n\\n\r\nTsukuru Kagaku a genius inventor who has invented a lot of contraptions, most of it malfunctions and Taketo often ends up the victim or be in trouble for her inventions beakdown.\\n\\n\r\nBeni Botan or is that bellybutton – a genius avant grade artist with a strange habit of using people’s bodies as her canvass.\\n\\n\\n\r\nThe setting- Inspiration Academy Private High school or Hirameki Academy \\n\\n\\n\\n\\n\r\nOnly a couple of episodes left and before this anime ends I think it’s time to make my review. So this anime’s title is called “R 15,” it is not a media classification, rather it is actually the title itself, but, then again you could say that this anime is for teens 15 and up. So, my ratings for this anime:\\n\\n\\n\\n\r\nStory- fair 6.\\n\\n\r\nWell, the story is quite simple and it’s fair enough that the story involves the everyday misadventure of the reluctant genius porn novelist Taketo Akutagawa who is a student at Hirameki Academy, a private high school for very exceptional student whom are geniuses in their own right. I like the combination of harem, comedy and ecchi genre that adds to the misadventures of the muchacho (Taketo), the school genre is more of a let down, co’z everything that happens in the story doesn’t seem to have any relation to the plot, in fact the school genre is more of a setting than part of the plot. The ecchi genre is a bit of a let down too, co’z of the censors, but the comedy and romance all compensates for its short comings.\\n\\n\r\nArt- mediocre 5.\\n\\n\r\n If we’re referring to the art of how the characters were drawn, I’d say it’s just as plain as any other art from from other animes such “Kore wa Zombie Desu ka,” “Angel Beats” and “11 Eyes.” \\n\\n\r\nSound – good 7\\n\\n\r\nGood, as in I like the ending theme and I like Fukune’s clarinet theme. I also like the new seiyus who did the voices of the characters. Especially the one who did Utae's voice.\\n\\n\r\nCharacters -   poor 3.\\n\\n\r\nWhen I say “poor” what I meant is that the characters fell short of what their roles are, so let’s discussing every one of them:\\n\\n\r\nTaketo Akutagawa- he’s a genius creative novel writer specializing in porn, he’s also the school’s news paper writer and interviewer, duh, we know that already. Anyway, he’s a good perv and I’m not talking about superlatives here, rather it has to do with his characteristic co’z he’s not the type who would intentionally seek victims. Instead he finds inspiration from ladies who were in awkward situations that he encounters which gives him some ideas for his erotic novel, also, he has a talent for getting under a girl’s skin and I’m referring to how he can make a girl experience an orgasm without being banged, if you get my drift, but, he doesn’t do it as a way to gain something from a girl instead he uses his other worldly talent to help them (girls).Ok enough of that, for a creative writer, the author seem to just limit the character to just being a novel smut writer, then again the author himself has the muchacho’s role to also include being the school’s newspaper writer/interviewer.\\n\\n\r\nFukune Narukara- she’s a genius clarinetist and she has feeling for the muchacho (Taketo), ok I get, but in this anime she’s just limited to play just one tune and when she practices she always play the same tune and uses just one clarinet, I don’t know about them classical musician, but usually a musician would have 2 or more of the same kind of instrument one he uses for practice and the other he uses to perform. By the way, I prefer her to be the muchacho’s love interest over Utae (sorry, Utae fans out there). \\n\\n\r\nRaika Meiki- a genius photographer, she’s also the school’s newspaper paparazzi, she’s the only one in Hirameki Academy who’s excepted to wear the school’s uniform for girls, though I would like to see her in one. It is not clear whether or not she has feelings for the muchacho (Taketo), though she does stalk and takes pictures of him every now and then. For a genius photographer she’s really been undermine, because in this anime she uses 1990’s photographic technology whereas she should be using the latest state of the art in digital photography and we don’t see her having  used other photographic equipment other that her film rolled camera and her darkroom. To add to her let down, is that she seems to be just an average person with a camera due to the fact that she was never seen taking artistic photography.\\n\\n\r\nKurumi Kuroki also called “Buchou”- ok so she’s the school’s newspaper editor of sorts, here, either she’s an evil genius or some kind of extraterrestrial being who’s in the company of 2 men in black. She has a habit of putting the muchacho in a lot of trouble; then again no harem genre would be complete without a manipulative rich girl around, as for her 2 men in black, either they’re her handlers (secret gov’t ops) or they’re her familiars, what is known is that they would beat the crap out of anyone who get’s close to that bitch (Kurumi). \\n\\n\r\nUtae Sonokoe – she’s a pop idol genius of sorts……….ok so does this mean that Justin Biebier is also one? Wtf , was the author of this anime is thinking about in giving her that role when she can be a genius song writer or composer? I asked this question, co’z she was never seen writing any songs nor was she seen with any musical instrument other than a microphone, then again who the hell am I talking to? Forget I asked, so, here, she (Utae) is popular not only in Hirameki Academy but outside of the school as well and she also suffers from same kind of insecurities  commonly experience by some Hollywood teen stars and young celebrities who were stressed due to the pressures of showbiz. She was able to find comfort with the muchacho who helped her deal with her woes and she also developed feelings for the latter as well. Oh and I like her voice and her song.\\n\\n\r\nRan Musen- she’s a genius computer programmer/ hacker, who is limited to hack sensitive gov’t sites and mainframe, but is unable to hack into Kurumi’s info, in fact just like any other students in Hirameki Academy she dares not cross her too. For a computer.  Info states that she prefers girls over boys, so either she’s lesbian or a self proclaimed protector of girls of Hirameki Academy. She’s hostile towards the muchacho who also happens to be her classmate, she makes it a point to protect every girl from him even thought everything that happens to them (girls) with the muchacho around are just some kind of freakish accidents either perpetrated by Kurumi, Reika and Tsukuru. And as info states, she warms up to the muchacho after helping her in a erotic skinship match with Beni Boton who wants to make a canvass out of Fukune’s body. Frankly, to be a computer geek, a tough cookie and be a hot babe like her don’t go hand in hand, she would’ve have been better off as a genius athlete or martial artist than being in front of a computer.\\n\\n\r\nRitsu Enshuu- the muchacho’s only friend and defender, he defends the muchacho against anybody who misjudges the muchacho especially from Ran, here, he’s a mathematics genius, he gets arouse whenever he hears the muchacho (Taketo) saying something erotic even though the words and slang’s were just the muchacho’s figure of speech, so to calm him down the muchacho would ask him to recite some mathematical formula (I hate math). It is not clear if he has some yaoi tendencies towards the muchacho or does he has some feeling with Ran (they make a good couple), what is known is that no school genre would be complete if the main character doesn’t have a best bud around.\\n\\n\r\nTsukuru Kagaku- a so called genius but absentminded inventor/ rocket scientist,  aside from some of her malfunctioning contraptions she’s also careless when she performs her test or experiments around campus grounds and  mostly involves rockets or pyrotechnics,  often it is the muchacho who becomes the accidental victim when her experiments and contraptions go bad.\\n\\n\r\nBeni Botan- a genius advant grade artist, she’s nothing, just some bad girl who is necessary part of the climax for this anime. Anyway, she has an unusual magic touch that can render anybody unconscious whom she sees as live canvass material (and it always involves female bodies), she feels arouse when she does her art as if she’s playing with herself. And in the remaining episode of this anime, she is one of those together with Tetsubou Meguru a so called genius gymnast who are responsible for pitting the first years against each other in some kind of “Orientation Tournament” in Hirameki Academy’s Inspiration hot springs town festival.\\n\\n\r\nKatsuyo Kurabu- a genius manger whom I thought is a genius cheer leader at first, she didn’t do much in this anime except be in a cameo role and that’s just about it.\\n\\n\\n\r\nEnjoyment and overall – fair 6.\\n\\n\r\nIn my opinion I’d say such rating is appropriate, since such let downs can be brushed aside and just enjoy this anime as it is, ok so the major let down is were the “Utae” fans out there seems to hate the idea that the muchacho (Taketo) is leaning towards Fukune, but hey! It’s just an anime, let’s just enjoy the accidental misadventures of the muchacho (Taketo) co’z it is all about him anyway,co’z it kinda look like that there’ll be more chaos coming to him until this anime ends.\\n\\n\r\nMy apologies to Utae fans out there.\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2011-09-17T11:44:00+00:00",
            "helpful_count": 23,
            "mal_id": 43583,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=43583"
        },
        {
            "content": "R-15 is a show with a mediocre story, your usual art style, fantastic music with your usual harem characters (this is not a harem show). There are tons and I mean absolutely tons of panty shots and nose bleeds, so if you like that kind of stuff in large amounts, this is the show for you.\r\n~Warning~ The very beginning of the show is very off-putting. It is something very unexpected and probably repels most people when they attempt to watch the show.\r\n~Warning 2~ Do not watch this show unless you have downloaded or bought the Blue-Ray version. The censorship that I sat through wassevere and even simple underwear shots were censored, leaving me to not understand some of the stuff that happened in the show.\\n\\n\\n\r\nStory 6/10\\n\r\nThe story isn't very original, but with what parts of the story I could follow, this is how I would summarize it. In the show there will be two girls who love the main male protagonist, but this guy has sex constantly on his mind and not to mention how incredibly dense he is. So, the show is mainly about how he becomes friends with several girls and how they must learn how to over-look his sex obsessions and understand him for who he truly is.\\n\\n\r\nArt 8/10\\n\r\nThe art is your usual bright color pallet, the lines are drawn well and the art is very consistent (unless the main character is imagining something). Overall, the backgrounds were well drawn and had focus, the characters had their own style attached to them and nothing seemed over bearing or very off-putting.\\n\\n\r\nSound 10/10\\n\r\nThis show really focused on the dialogue and music. Half of the final episode is  pretty much a music video. A clarinet isn't a very popular instrument and I was happy to see that it was a main focus in the show.\\n\\n\r\nCharacter 8/10\\n\r\nThe characters are not unique, but I was most happy with Fukune (the main female character) she is a quiet one that was able to find love. I liked that because the quiet-mysterious girls are usually just supporting characters. All the other characters are your usual harem types: Tusndere, Science genius, peppy-cheerleader, very popular type etc... The main male protagonist, instead of groping and fondling all the chicks, he instead imagines doing it and writes it down like a hentai story.\\n\\n\r\nEnjoyment 8/10\\n\r\nI enjoyed the story and the interactions (most of them) between most of the characters, but I didn't enjoy the severe censorship, so I'll have to rewatch this when the dvd's or blue-rays come out.\\n\\n\r\nOverall, the story isn't unique, the art is your usual stuff, the music is fantastic with your usual characters. There are tons and I mean absolutely tons of panty shots and nose bleeds, so if you like that kind of stuff in large amounts, this is the show for you.",
            "date": "2011-10-01T18:58:00+00:00",
            "helpful_count": 18,
            "mal_id": 44569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=44569"
        },
        {
            "content": "Updated up to the final episode.\r\nHaving just finished R-15 completely, something I had doubts about since it was so perverted to the very end, I have to say I was pleased that it was enjoyable. The concept of \"Genius\" Porno Writer was able to carry its weight, never being censored in the slightest the entire series, his delusions and fantasies top notch the entire ride. \r\nStory: \r\nAt first I thought this was just going to be random comedic absurdity, but after seeing episode two there might just be a story behind it all. With the protagnist possibly on a journey of self discovery. Then againit might be that he is just misunderstood by everyone. You know its as they say, they don't realize a writers true potential during the time he's alive. It ended up leading Taketo through a journey of self RE-discovery, as he reinforced what he is, a porno writer. Through the series he often hit stumps that made his writing turn out less than it could be, but every time some form of inspiration or discovery made him continue on the path of a porno writer.\\n\\n\r\nArt:\\n\r\nPersonally I love the art, the color is appealing, it looks pretty fluid to me as well. Everything is pretty well drawn as well, considering there are so many different elements mixing, such as robots, photography, musical instruments, sports, etc.  The girls are especially well designed, they just scream cuteness! And to the end the art pleased me, they had no issue with drawing nude bodies (censored but nude) the entire series. Gotta hand it to a company that can produce the lewder subjects in anime.\\n\\n\r\nSound:\\n\r\nThe Opening and Ending are nothing out of the ordinary. The opening can be a little catchy after listening to it a few times I guess, same with the ending. If I had to pick I like the ending song a bit more since the jingle does stick with you more. The second episode also had some music sung by the Genius Idol, and I found that enjoyable to listen to at least. Also the clairnet tune that's been played by Fukune is nice and somber. Though I have to admit the final episode blew my mind by the song that Taketo and the genius composer made, mainly due to Taketo's hella amazing lyrics. (Trust me, they were damn amazing.) \\n\\n\r\nCharacter:\\n\r\nThe characters were pretty standard in a sense they featured some of the common archtypes, but having each be a genius in a certain area in an ecchi comedy anime, shit did hit the fan at times. With Taketo our genius porno writer as the protagnist, it would be hard to say \"Oh he's pretty standard.\" Fukune I guess would fall under the shy naive archtype. Utae would fall under the idol archtype as well, but with how bold she was able to be and direct you get some fairly fantastic surprises later on. The photographer genius was ... demented I guess, she had a fetish for taking pictures of \"bad\" things as she put it once, the ugliness of humanity, don't think I've seen a character that obsessed with that before. And the other girls, well it would make this review very long if I went on about every character. \\n\\n\r\nEnjoyment:\\n\r\nI'll be honest, this is pretty much an anime you watch with little expectation and just go along for the ride. Its perverted, hilarious and makes little sense (I mean seriously, a genius  porno writer?). But, hey, this type of anime is needed once in a while just to enjoy and laugh at. And here at the end of watching this anime, I standby what I've said, you gotta watch this for the laughs and expect nothing to happen, otherwise you're going to ask yourself \"Why the eff am I watching this absurdity?!\" or \"Why am I.. Oh right the boobies.\" \\n\\n\r\nOverall, I'll keep watching just to take in more laughs and see if the story really does end up having some form of moral with the protagnist. (It did by the way.)\\n",
            "date": "2011-07-16T15:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 39289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473250.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KiritoKun",
                "username": "KiritoKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=39289"
        },
        {
            "content": "Pros\r\n-The artwork was decent, though simple to the eye. Simplicity is often a good thing, as complicated, over-detailed artwork tends to distract the viewer\r\n-The characters were unique, each having their own story to connect with their habits and personality. -The setting is an academy for geniuses, which is moderately original, but it has been done before. \r\nCons\r\n-The plot was weak, and did not flow. For example, there was a part where Taketo's editing chief was thought to keeping a secret about herself, only for Taketo to never discover what it was. This left me hanging throughout the rest of the anime wondering to myself whatthat secret could have been.\\n\r\n-There was nothing that really made me want to keep watching. Nothing about this anime particularly grabbed me. I wouldn't recommend it if you are easily bored.",
            "date": "2012-11-19T18:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 77955,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/413175.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Erucia",
                "username": "Erucia"
            },
            "url": "https://myanimelist.net/reviews.php?id=77955"
        },
        {
            "content": "R-15 is pretty much an average if not slightly under average slice of life, school life, anime series which only excels in bringing a new level of Ecchi.  The art is decent, characters are okay, story basically non-existant at times or quite weak.  I typically at this point would go into more details about the series but that really about sums up this series unfortunately.  I highly doubt that I will recommend this series, unless someone is really looking for some Ecchi school girl anime.\r\nRating 4/10\r\nPosted by @GameJok3r",
            "date": "2011-10-06T21:07:00+00:00",
            "helpful_count": 8,
            "mal_id": 44975,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=44975"
        },
        {
            "content": "R-15 anime, approaching ecchi anime with goddamn story. Overall, 9/10 equivalent to B+. The score is spread into :\r\nStory : B+. A struggle of erotic writer (Taketo, male) in literally all aspect in his life. Particularly innovative, although retaining some aspect of harem. He's quite a fool not concealing his real name in such a kind of writing. The plot developed into romantic-mixed story after first quarter\r\nArt : B+. Hard to say, but the artwork is very realistic; quite similar to animated photograph instead of hand-drawn pictures. Most girls are armed with boobs as a fanservice with notable exceptions for two girls : Fukune andKagaku. The mixture of oppai (boobs) and loli makes the anime eligible for A in art. Penalty was given for the censorship mechanism, a laser beam (reminding Indonesians for 2011 AFF Cup in their enemy's land)\\n\\n\r\nSound : A. No complaints, except a minor voice trap (female seiyuu voicing male characters), but it acts totally the opposite to add moeness effect for the male character.\\n\\n\r\nCharacter : B-. Severe penalty on several aspect. For instance, Ran's hacking ability that claimed to be able to hack Pentagon's ICBM control system (another WTF!?) that even unconnected to any computer except parallel power supply. Also Ritsu's arousal problems. Those might be add fun factor, but when a funny thing is used excessively, it won't be funny anymore.\\n\\n\r\nEnjoyment : A. Thanks to the BD-Rip, the laser is exterminated and all possible nudity under Jap's constitution is visible.\\n\\n\r\nTotally good anime for those wishes to have an anime safe enough to be watched anytime anywhere and powerful enough to be fapped on",
            "date": "2012-01-07T15:05:00+00:00",
            "helpful_count": 7,
            "mal_id": 51207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cruiser",
                "username": "Cruiser"
            },
            "url": "https://myanimelist.net/reviews.php?id=51207"
        },
        {
            "content": "This is my essential review of this awful anime : Don't watch it. It has no plot development, the story to begin with is awful. If it was going to be about a guy who writes hentai things, it might as well have been a hentai. Very awful and not even worth looking it. This is the first anime I have watched and never finished, you can check my list...this is literally the only one I have had to give a 1 to, as well.\r\nPlease save yourself time and do not watch this anime.",
            "date": "2012-01-26T15:41:00+00:00",
            "helpful_count": 7,
            "mal_id": 52605,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1108991.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/kikoredog",
                "username": "kikoredog"
            },
            "url": "https://myanimelist.net/reviews.php?id=52605"
        },
        {
            "content": "Pros \r\n+Funny at times \r\n+Decent art style\r\n+Some Decent Music  \r\nCons\r\n-Boring\r\n-Poor story \r\n-Poor Lead \r\n-All Fan Service \r\n-Slow pace \r\nMy Opinion \r\nBit behind the time on this one but Ill keep this short a sweet. I am really sick of these anime's,it's just rehashed shit, i'm sorry but that's all it is. I finished this because i don't like having half compete shows on my list. It could not have been any less original if it tried. I mean there some pretty good music in there and that was really it. I could go into each character and pick them apart but whats the point,the fact is there were all just poor and the male lead just... ill say no more. \\n\\n\r\nShould you watch this? NO just save yourself the time \\n\r\nHope my review was helpful \\n\r\nMurphy",
            "date": "2013-05-25T15:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 98391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2556849.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/MurphyTV",
                "username": "MurphyTV"
            },
            "url": "https://myanimelist.net/reviews.php?id=98391"
        },
        {
            "content": "I hate writing long reviews, but feel for me.\r\nSo you take a stroll down the path of comedy and ecchi, fanservice and laughs all around. What disappoints me now from years ago are the shameless tactics of censoring brought on by the anime industry. Its a tactic made so if the viewer wants to see the original cut he/she is forced to buy the BD. Way to go guys! Way to go.\r\nAs for the story at hand our main character is a guy who writes porn . . . riiiiiiight.\r\nHe is a  high school kid writing about his deepest and most perverted fantasies. Imean don't lie you've done it once or twice. Takuto is a lot nicer than he seems though, but writing everything that comes to his mind puts him in bad situations that will either kill him or get him some a**. Lets hope its the latter.\\n",
            "date": "2011-08-07T09:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 40937,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=40937"
        },
        {
            "content": "Story :\r\nThe story starts off pretty average, but as it gets further in things start getting much more interesting. Sadly, it just takes too long to start bringing the story to light. 7/10\r\nArt :\r\nThe art is of really high quality, and the style is quite pleasing to the eyes. This is definitely one of its strong points. Still, I only give a 10 to ones that exceed what I consider amazing. 9/10\r\nSound :\r\nThe Opening and Ending are great, very upbeat and full of life and vigor, just like the show! But, Fukune's clarinet gets really boring after hearing the same tune every episode. Thankfully there'sa point where you get to hear her play something interesting at some point in the show. yet, it makes sense, so I can't really mark it down for that to be honest. And then there's a song in this show that just blew me away which is why this is getting a 10/10\\n\\n\r\nCharacter :\\n\r\nThe strongest point of this show I would say. I loved the entire cast a lot! Well, at first, Fukune annoyed me some, but that was for unreasonable reasons. Ran really stood out well for me, and I'm glad they made her a genius programmer, it really helped make situations in the show more entertaining/interesting. The supporting cast was also really enjoyable. Fukune was fairly boring through the beginning, but she really does become much more interesting later, you just have to hang on and continue watching! 10/10\\n\\n\r\nEnjoyment :\\n\r\nIt's fun, lively, energetic, emotional, full of insight into the human psyche, and full of hilarious moments. As well as it has its fair share of sad or moving moments. Especially that song. 10/10\\n\\n\r\nOverall :\\n\r\nA lot of people will overlook this show because of its premise. And those who do decide to chance it will probably get turned off by the levels of ero, but for those who can brave it, I believe you'll find quite the enjoyable show. Though, if you hate yaoi/yuri, then stay away from this show. It plays at these themes quite a lot throughout. Most of it is just ecchi-service and nothing super super serious, but that will turn some people away for sure, and I feel those people should know this ahead of time. Now, despite how fun and enjoyable it is, the story does pull down the score some. But, as someone who's a HUGE fan of slice of life, and slice of moe life shows, story isn't the most important thing I look for in an anime. So, if you're the type that looks more to character interactions than story (and you aren't turned away by ero or yuri/yaoi) then give this one a chance! 9/10",
            "date": "2012-05-19T16:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 61543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1282997.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vampko",
                "username": "vampko"
            },
            "url": "https://myanimelist.net/reviews.php?id=61543"
        },
        {
            "content": "This is my first review, and I had to write it.\r\nR-15 had some awesome art. Super cute girls, etc. The thing is, the plot was a nightmare.\r\nFirst of all, the main character is so stupid and had to pick the MOST BORING GIRL. Second, there are WAY too many censors. Third, why does that girl have to play the same song over and over again? This anime was purely for fanservice, but it was so censored you couldn't see a thing.\r\nMaybe if it wasn't as censored, I would have scored it higher. But it's funny how it's a fanservice anime without the fanservice.",
            "date": "2011-09-11T21:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 43173,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/421549.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/freemonad",
                "username": "freemonad"
            },
            "url": "https://myanimelist.net/reviews.php?id=43173"
        },
        {
            "content": "First of all, this anime is pretty much average in a sense that it's not that great and it's not that terrible. People would often find this dull because of poor story and character development but can easily catch up because of the art and characters.\r\nStory --- 5\r\nThe story is  below aveage where the main character struggles because of his hobby/talent in which the majority thinks it's offensive. There are also parts in the story in which it doesn't make any sense at all and we can hardly notice the story development. All in all, I rate it pretty much a 5.\r\nArt --- 9\r\nIfind the art great. The camera angles and character positions are well structured. The surrounding are well-endowed with detail. The colors are bright giving it a joyful feeling to the audience. As the anime belongs to the ecchi category, we can see lots of fan service that are shown with good detail.\\n\\n\r\nSound --- 5\\n\r\nI give the sound a rating of 5. Why?\\n\r\nIt's because of the poor character voices. I kind of find it annoying for the chosen voice actors in their respected roles. Majority of the characters are not suited with their voice actors. Some students have voices like an old hag that's about to cough hairballs. It's pretty annoying for me at least.\\n\r\nThe background music and sound props used are great though. Only the voices are the ones that give me a letdown.\\n\\n\r\nCharacter --- 7\\n\r\nThe characters shown are unique with lots of variety. From a genius mathematician to a genius exorcist. It really gives a good vibe. Some characters even have a mysterious background which give an anticipated feeling. The character development is slow though but that's what makes it one of its charms.\\n\\n\r\nEnjoyment --- 6\\n\r\nEnjoyment of the series is pretty much in an average category. It doesn't attract majority of my attention as it has its own flaws. The jokes used are  redundant which loses some of its charms and some scenes are pretty predictable.\\n\\n\r\nOverall, I give this anime a 6. It's not that great of an anime but it has its own charms. If you're looking for an ecchi anime with unique characters with slow development and doesn't bothered with the story then try this anime.",
            "date": "2013-04-05T20:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 92589,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2350467.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DeAnimation",
                "username": "DeAnimation"
            },
            "url": "https://myanimelist.net/reviews.php?id=92589"
        },
        {
            "content": "After I finished watching this anime, I kind of expected how it was going to end; since many anime with harems end kind of similar in terms of romance. I found it kind of strange that the MC, who is a porno writer, easily gets nosebleeds. In my opinion, characters that get nosebleeds from witnessing something perverted are...\"pure\". Going off of that, if he is this pure, why is he a porno writer?\r\nAs with romance-comedy anime (harem optional), the male MC usually displays some kind of a dense personality; creating situational irony for the viewers to laugh at. This is effective for comedy in anime,but I felt that this anime over-used it a tiny bit. People that are picky with what they watch probably shouldn't watch this if they don't like the main character portrayed like this.\\n\\n\r\nThe setting is probably one of my most favorite parts of this anime. It sounds very original and unique. The school that contains only geniuses in all aspects of life was interesting. But, they could have focused more on the story. The story was weakened a little bit with the prominent fan-service.\\n\\n\r\nSpeaking about fan-service, the censoring was over-done a bit. There are many different anime that have WAY more fan-service but way less censoring.\\n\\n\r\nI would recommend this anime to anyone that watches anime casually only.",
            "date": "2011-10-01T19:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 44573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403099.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simpsonhead3",
                "username": "Simpsonhead3"
            },
            "url": "https://myanimelist.net/reviews.php?id=44573"
        },
        {
            "content": "I will say that R-15 was not anything special. In all honesty at times I found it downright boring at parts. In fact it took me 3 tries to get though it. Its not that this show was bad, I just believe it was badly done.\r\nStory: This anime was about a teenage porno writer who attends a school for the exceptionally gifted. If anything I would say parts of the plot is what drew me away from this anime. The relationship between the main character and most of the girls is the cliched \"dere\" relationships. The plot was really nothing exceptional itself and really boredme at times.\\n\\n\r\nCharacter: The characters were truly the only real reason I stuck though with this show. I myself enjoy the eccentric type of characters such as the ones in this series. The main character being a scorned Porno writer really interested me and I actually kinda enjoyed how he was depicted. Not only him but many of the girls as well were funny with eccentric personalities and made me enjoy the anime. The only character I really found lack luster was the main girl, the clarinet player. Even though she was suppose to be a shy type who doesn't always show her emotions. I believe that she was uninteresting and that she was a real bore throughout the entire show. In animes i'm used to seeing characters either really unemotional or showed emotions very willingly. The main girl in this anime was in between, and being as such I don't believe she was a good choice for her position.\\n\\n\r\nArt: The aren't wasn't too especially good or too especially bad. It was normal.\\n\\n\r\nMusic: In all honesty I didn't really like the songs in this series. In animes I usually find many of the songs to be entertaining and catchy, but for this series, even though it involved musical virtuosos, I didn't find a song I found catchy. \\n\\n\r\nOverall: Overall this series really wasn't something exceptional. If you watch it you may have the same experience as me, getting bored partway though and dropping it even though you had times you enjoyed. You may end up liking this series, but this is just my experience with it. R-15 was nothing exceptional and the characters are really what I thought were the only good points of the show.",
            "date": "2014-07-11T00:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 151485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3390523.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/giby1",
                "username": "giby1"
            },
            "url": "https://myanimelist.net/reviews.php?id=151485"
        }
    ]
]