[
    [
        {
            "content": "Story: 9/10\r\nSekai-Ichi Hatsukoi 2 is basically continues where the first season left, if you've been keeping up with the manga. There are three main stories being told. One is that of former lovers, broken apart by a rather stupid misunderstanding, finding each other again after a couple of years. The other is of a thirty-year-old dude who likes good looking guys and ends up with one, but his self-esteem generally sucks because he /is/ thirty and his boyfriend is pretty much sex on legs. The last story is of two childhood friends, one ends up falling for the other and you know what happens next.;) \\n\\n\r\nOut of all the yaoi or shounen-ai series out there, the anime adapted from Nakamura's works still stand to be the best. They have enough emotion and depth to actually count as a love story and not just some fujoshi's wet dream. The first episode actually made me cry. Don't judge me. I totally feel for Ritsu/Masamune. \\n\\n\r\nArt: 7/10\\n\\n\r\nGah, the weakest point of almost every anime--the art. But compared to other yaoi/shounen-ai series--I'd probably give Sekai-Ichi a 9.\\n\\n\r\nSound: 9/10\\n\\n\r\nI like last season's ED theme better but I'm pretty sure the new one will grow on me soon. The OP has the same atmosphere as the other season and those of Junjou Romantica. Jumpy. Happy. Lovey-Dovey. The BGM are wonderful, as always. Making me cry. *sniffles*\\n\\n\r\nCharacter: 9/10\\n\\n\r\nI don't know about you guys but I love all of the characters. Even Ritsu. Heck, especially Ritsu. I honestly don't understand why people hate him that much. If he isn't always so hesitant, then this series would've ended quickly. \\n\\n\r\nAnd Masamune, but that's mostly because I've read manga. There's an extra chapter there about his and Ritsu's high school ~*affair*~; it's gives him more depth. Without it, he'd be pretty much like the other tops Nakamura writes. \\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nReally. How can this be explained? Two boys making sweet, sweet love? Um. Yessss. But seriously though, that's not Sekai-Ichi's winning point. :) It really does have katons of sweet moments that make your stomach flutter. For that, it's very hard to jack off to. \\n\\n\r\nOverall: 9/10",
            "date": "2011-10-07T15:33:00+00:00",
            "helpful_count": 119,
            "mal_id": 45029,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332558.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yutsuru",
                "username": "yutsuru"
            },
            "url": "https://myanimelist.net/reviews.php?id=45029"
        },
        {
            "content": "Story:\r\nContinues from the first season,the story isn't a complex one but it is interesting with all the misunderstandings about the past and the characters.(7 Good)\r\nArt:\r\nI personaly like the art and have no problem with it but there is quite a few people who don't like the style and say the characters look too similar.(7 Good)\r\nSound:\r\nI acually like the OP and ED more from this season than the first one,up beat happy kinda songs that I enjoy listening too but that being said there isn't any memorable background music in the acual anime.(6 Fair)\r\nCharacters:\r\nVery well formed characters that is a joy to watch with there up'sand down's.\\n\r\nFunny,entertaining!(9 Great)\\n\r\nEnjoyment:\\n\r\nI enjoy watching every episode,as soon as it ends I'm waiting for the next one!(8 Very Good)\\n\r\nOverall:\\n\r\nAll together if you like BL anime then this is a very good and entertaining anime for you that will leave you begging for more!(9 Great)",
            "date": "2011-10-14T15:20:00+00:00",
            "helpful_count": 32,
            "mal_id": 45547,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/393480.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ParadoxCharlie",
                "username": "ParadoxCharlie"
            },
            "url": "https://myanimelist.net/reviews.php?id=45547"
        },
        {
            "content": "This season is a marked improvement over the first, I actually enjoyed watching the characters develop and their interactions are a tad more believable. My main gripe carries over from last season and that is that this show is still very rapey at times which spoils the enjoyment of an otherwise funny love story.",
            "date": "2014-03-21T06:04:00+00:00",
            "helpful_count": 17,
            "mal_id": 136307,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/hellomrpoor",
                "username": "hellomrpoor"
            },
            "url": "https://myanimelist.net/reviews.php?id=136307"
        },
        {
            "content": "Lo and behold, more gay, but hey, thats okay.\r\nAny straight man who stumbles on this without looking at the tags will instantly realize his testicles have shrunken multiple sizes, carved a hole in his pelvic region and formed something called a uterus. From that day on the realization hits him, **** man, what happened.\r\nI watched the first season of Sekaiichi Hatsukoi for shitts and giggles but mainly to fulfill a dare with a friend to determine who drops out first. Minus the \"scenes\" the story actually works out fairly well, the arcs are in an order that is easy to follow for someone with halfa brain. The art is pretty much your typical bishounen style that attracts females and fags alike, although its not my cup of tea. It is a pretty good air freshener from the usual content you see, from a day to day basis in your classic perverted shows aimed at under aged virgin male teenagers.\\n\\n\r\nBeing well, not gay I can't say im warming up to the characters, I can tolerate a trap but thats a trap, the level of deception is well, cute. The uke types are a bit tsundere in my opinion but what the hells a tsundere anymore? Your typical female? The wife? Sarah Palin . . . oops.\\n\\n\r\nI can get used to the awkward as hell moments that would make this funny to anyone that gets them, awkward is traditional and its funny. To me thats the enjoyable part, watching someone deny something then cringe over it with a face that would break nails.\\n\\n\r\nThis is a girls world boys . . . wear a cup\\n\\n\r\nComedy aside, lets get serious. Homosexuality, seen and loathed by people worldwide, especially in the religious sect of our word. It has no place nor bounds, it is rejected by law and society as a whole. The world spits and casts rocks at you as if you were a plague or virus that would otherwise need be eradicated. You feel like reaching out yet no one will be there for you, they would all reject and hate you because you are sexually oriented differently than friends and family. Coming out of the closet really seems that difficult. However in the world of anime you have a vast fanbase dedicated to \"Gay\". The typical fangirl and your ordinary boy with  fantasies involving 2 fine women, yes its out there, and yes there are a number of shows that cater to these fans.\\n\\n\r\nSekaiichi Hatsukoi is a series based off the manga Sekaiichi Hatsukoi of course, it is a spin off of the series Junjou Romantica and it the features and cast are practically clone like. Same author, same triangles, same well . . . a lot. Here we have our three different relationships, the editor x editor, our author x salesman, and another work x work type basis. Its your typical romance; lovey dovey and what not. Jealousy and attraction all around and of course one person of the couple has the more feminine feel to them, I mean there has to be a catcher right? The series itself does not catch my eye in any line personally, any fangirl however will be instantly attracted to this hence high views. The series, and spin offs themselves I feel are better rated than they deserve partially due to the lack of male audience even though its not the target audience. You either like it or you don't.",
            "date": "2011-10-29T03:22:00+00:00",
            "helpful_count": 15,
            "mal_id": 46401,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=46401"
        },
        {
            "content": "How should I put this? It's my first time to write a review so this MAY contain spoilers if I get carried away. \r\nStory: 9/10\r\nThe second season is better and has more plot than the first in my opinion. What excited me about the second season is that it has plenty twists in every couples' story. I personally enjoyed Kisa and the book keeper's story. It has a strong impact and heavy drama which will probably lead fujoshis in tears. Although there also cliffhangers which will inevitably make you hate the anime but all in all the story is what delighted me the most aboutSH 2. \\n\\n\r\nArt: 6/10\\n\r\nSorry I had to give this a tad lower score than the others but hear me out first. My reason kinda sucks actually, it's because sometimes I get confused with the characters and I can't tell which is which! It's because some characters look almost the same. Same hair, same eyes, but, maybe it's just me. I don't know! I get confused a lot! Sorry but the art is just okay for me. \\n\\n\\n\r\nSound: 8/10\\n\r\nThe soundtracks were cute although I didn't take a liking to them at first. \\n\\n\r\nCharacters: 10/10\\n\r\nI gave this a perfect score simply because they were all perfect. Everyone of them, although I have my personal favorites, the other characters aren't to be overlooked. All of the pairings had this unbreakable and promising auras which will keep you wanting more of them. The antagonists were also good. \\n\\n\r\nOverall: 9/10\\n\r\nThis anime is very interesting and commendable. Since this is the first yaoi I've watched, I don't have much to compare it with, but it will leave you both laughing and in tears... and peeved. \\n\\n\\n",
            "date": "2013-04-29T04:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 95335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1317607.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gothaku24",
                "username": "gothaku24"
            },
            "url": "https://myanimelist.net/reviews.php?id=95335"
        },
        {
            "content": "Hm, it kept me watching for the BL but that's really it. Actually watching it sort of ticks me off because there are tones of better yaoi out there that get one or two half a$$ed OVAs, desexualized series, post poned, given a low budget manga voice acting job, or just plain ignored. While cookie cutter BL like this gets 12 full animated episodes and two seasons. I don't get it. I just don't get it. Maybe stuff like this is considered \"safe\" in their world of nothing happening storylines. Where the uke must constantly deny his attraction while the Seme becomes a sappy idiotwho will wait on the uke forever and turn down any man who comes his way. Safe are the stories that are nothing more than the \"problem of the week\" for the characters. \"I saw my boyfriend talking to a woman...I guess that's much better than him being with a man, he MUST like HER because she's a woman\" or the stereotypical best friend who is perfect for a guy in every way BUT will never get the guy he wants.\\n\\n\r\nSeriously, been there, done that, and bought the T-shirt! How many of these SAME BL stories are going to get recycled and turned into craptastic unfinished shows while beautiful yaois like Ai no Kusabi gets pushed to the back burner?? Geez! \\n\\n\r\nCan we please get some of Miyamoto Kano or Mizukami Shin stuff made? What about Complex, Sakura Gari or the beautiful Zankoku na Kama ga Shihaisuru. But nope, I guess I have to wait for anything this mangaka farts out just to get animated BL. *eye roll*",
            "date": "2011-12-25T06:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 50083,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/846605.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hazegurl",
                "username": "Hazegurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=50083"
        },
        {
            "content": "This anime and Junjou Romantica is linked somehow but I can't figure out exactly how, except that the characters work is linked, and we do see some of the characters from the JR series. This anime just focuses on another couple. \r\nThis anime is sweet, and just like Junjou Romantica, this anime is focusing on a daily life on an adult mixed with a lovers life. \r\nI must say that the story here is more serious than in Junjou, as in, there are less hilarious moments.\r\nThe art was amazing and so was the sound.\r\nThe characters, just as unique as the ones in JR and thecouples are just as cute. \\n\r\nI enjoyed the story overall, sweet and cute and dramatic.\\n\r\nI'd say the second season of Sekaiichi is better than the first as we get to know a bit more about the way each character thinks. \\n\r\nVery well made.",
            "date": "2018-07-29T06:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 285049,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6738220.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Craneface",
                "username": "Craneface"
            },
            "url": "https://myanimelist.net/reviews.php?id=285049"
        },
        {
            "content": "I'm really binge watching BL right now, which might not have a good effect on my reviews, but is bound to make them more honest.  Not that I don't always try to write honest reviews, but when one can directly compare one anime within a genre to another, one is bound to notice smaller differences in quality.\r\nI gotta say, I am a little disappointed that something as solidly mediocre as Sekaiichi Hatsukoi gets not one but two cours plus an OVA plus a movie, when almost none of the excellent BL I've read gets as much as a pitiful OVA.  Yeah, yeah, it'smore popular, I know.  Still, it rankles.\\n\\n\r\nSo here we continue straight from the first season, with the same couples, Takano x Onodera, our main pairing, Hatari x Yoshino as couple B, and Yukina x Kisa as couple C.  Also added is an episode for Asahina x Isaka (the latter being Marukawa Shoten's Director, the former his childhood playmate and current executive assistant).  And the \"spoilers\" are back as well, Yokozawa, Yanase, plus a standard slot \"girl who walks with my beloved which is proof he is not true to me\".\\n\\n\r\nStory (5): More of the manga publishing business, more of our seme trying to get closer to their uke, more of the uke resisting.  If it weren't for the workplace information and interaction, I would rate this a lot lower because at this point I am pretty much dead tired of the tsundere uke resistance, and the lack of good communication between the couples.  But for those less demanding, there is actual story here, this isn't about the sex.\\n\\n\r\nArt (4): Still not liking Nakamura's art, sorry.  Good backgrounds again, typical BL animation.\\n\\n\r\nSound (6): I didn't like the BGM as much, nor the OP.  Voice acting is as good as ever.\\n\\n\r\nCharacter (5):  Win some, lose some.  At first I started to dislike Onodera because there is only so much hemming and hawing and avoidance and denial and vacillating I can take before I want to slap somebody with a large, wet fish.  His saving grace remained that he is a hard worker and really tries to become a good editor.  And then we get to see more of his high school self with Saga/Takano, and he was just a great kid -- he has some of the uke mannerisms, the blushing, the stammering, but it's not so bad, and he is so enthusiastic and caring, and actually pretty straightforward in what he wants -- it becomes immediately clear just how much the disaster with Takano has damaged his self-confidence, and how high the walls have become which he built for protecting himself from this ever happening again.  I really felt for him.  I think if the flashbacks had come much earlier, I would have never even started to dislike him, because I would have understood.  I like Takano even better here than before because he's becoming quite good at trying to communicate, both with Onodera about work and their private business, as well as with Yokozawa, who needed some truth telling.\\n\\n\r\nWith the other couples it's mostly \"lose some\".  Hatori remains mostly stoic until provoked severely, and Yoshino remains an oblivious idiot who IMO doesn't care enough about anyone, and in consequence I don't care about their pairing.  Kisa, of whom I wasn't particularly fond already, slid into the \"hate you now\" column for being a total ass to Yukina, who was an even greater guy than last season.  I get insecurity, I do, and I am forgiving of it, but not when it results in lashing out at somebody who has only ever been decent.  FU, Kisa, Yukina deserves better.  There is one totally fantastic scene where Yukina just blew me away; you'll know it when you see it. \\n\\n\r\nYokozawa I feel for; he's such a good friend, if a bit pushy, and he has the same strict but fair behaviour at work as Takano.  I'd like him to find somebody.  Yanase I feel for as well, but we never saw much of him; I hope he develops better taste in lovers.  Isaka and Asahina didn't affect me; they felt like filler.\\n\\n\r\nEnjoyment (7): The workplace interactions continued to please me, and there is a lot of interesting stuff between Takano, Onodera, and Yokozawa, and there is a reasonably satisfying conclusion (though not really as good as I would have wanted).  Do I care enough to read the rest of the manga?  Urm.  I honestly don't know.",
            "date": "2016-09-20T21:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 229680,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=229680"
        },
        {
            "content": "It's actually really crazy because normally the season season isn't as good as the first, kinda like the second movie to an original but this really was a so-what master piece, I have to admit that this anime really got me hooked.  I'm not bi-sexual or gay, I'm straight (also a girl too) and I'm not being sexiest towards the anime but I have this strange feeling straight guys wouldn't really like a cute, romance filled guy > guy anime. But girls on the other hand, this as SO CUTE!  Without a doubt watching this anime gives off such an amazing vibe it'scrazy! You can pen point with of the to is the woman in the situation but then again you keep changing are you watch it further, the two are just so true to each other and all the mis-happs, conflicts, and obstacles make it so much better.  But the best part is that it doesn't just focus on the two main characters, it switches between love stories of the co-workers and in the end they're all really just the same. Except for one, he isn't really looked at, at all but that's OK. \\n\\n\r\nMy finally thoughts on this is well: If you don't mind the boy boy relationship then this anime if perfect, the combination of romance and comedy levels out itself and the pinch of drama just makes you come crawling for more! Though I do recommend that you watch the first season Sekaiichi Hatsukoi, because you know the '2' after it kinda lets you know this is the sequel.",
            "date": "2012-01-20T18:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 52201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Missywalker",
                "username": "Missywalker"
            },
            "url": "https://myanimelist.net/reviews.php?id=52201"
        },
        {
            "content": "Just as an FYI, the sixth episode of this season is an unaired extra episode from another Shounen Ai that's similar to this one, so if you haven't seen that, I'd recommend you skip episode 6.\r\nI'm not gonna rehash all the things I said about this anime in my review of the first season, so this review will probably be brief. First of all, one of my bigger gripes after finishing the first season was that we were hearing about all of this background from the two main characters while we barely got a look at it. This season, that changes. You will get, inthe final episode, a flashback of their time together in high school. That being said, it really should not have been the last episode of the series. For a finale, it didn't really sit well. \\n\\n\r\nThe story this season was slightly heavier than the prior season as you get into each characters' issues with being in a relationship vs. the other persons' want to be in that relationship. It's nice to see that bit of conflict rather than the relationships just boiling down to some kiss scenes and some comedic freakouts.\\n\\n\r\nSpeaking of the comedy, it's on point as always this season. Other than that, there was less story told involving things other than the romance. However, I do think that this was counteracted nicely with good character development in the romance area. In other words, this felt like a real romance story and not just a mild Yaoi. I would've liked to see some more background on the supporting characters, though, as their stories still felt unnecessary overall for this season. I definitely would've preferred it if the 12 episodes were about the two main characters and no one else. Had there been more background for the other characters-- perhaps with a longer season-- then I would've enjoyed it more.\\n\\n\r\nI guess my main critiques are that the spacing and placement of everyone's story was sort of off so I didn't really stay as immersed in everyone's story as I would've liked to be. \\n\\n\r\nOverall, though, this is a pretty strong Shounen Ai. Don't be too disappointed if the ending isn't the firecracker you wanted it to be, though. At the end of the day, this anime doesn't live up to what it had the potential to do, but it's still something that's deserving of the love it gets.",
            "date": "2018-10-31T19:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 293096,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=293096"
        },
        {
            "content": "I really like the story and in fact it touches my heart and I'm so glad that the author made this story and it became an anime and I'm i think this is the one of the best love story  I've read and seen and its just this story captures me and i can't forget and move on because of this story and in fact it inspires me...\r\nI hope the Author will read this and be inspires to make another season of this story.....\r\nCoz, I'm keeping on waiting for the next season and i will not stop hoping......:) ^.^ Thanks again for this wonderfulstory....\\n",
            "date": "2018-05-08T04:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 280048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ruckzzel",
                "username": "Ruckzzel"
            },
            "url": "https://myanimelist.net/reviews.php?id=280048"
        },
        {
            "content": "This is the first review i have ever written on anything, so it might be a little scrambled and awkward.\r\nBut Sekaiichi Hatsukoi and Sekaiicki Hatsukoi 2 both have an interesting story line and a great selection of characters. I admit to shedding a bit of a tear toward the end of the series, but i think that is just in my fangirl-ish moments that i actually did cry a little.\r\n Though, i couldn't help but think that there was something missing to make this truly a work of art and a unique anime series. I feel like if they added a little more of idlike to say passion into how the characters felt toward each it would be better.\\n\r\nAlso, i felt like the conflicts that happened within each of the different characters were the same, which made it sort of a little boring.",
            "date": "2013-07-29T10:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 107349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1975516.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/10seiga",
                "username": "10seiga"
            },
            "url": "https://myanimelist.net/reviews.php?id=107349"
        },
        {
            "content": "Before we start...okay yes, I have a soft spot for yaoi. Not because I'm a fangirl, but because when you're part of the queer community, you take what you can get. You can either take that as me being slightly biased or me looking for more realism, you're choice.\r\nAnd as always, I should probably warn you that I may let a tiny spoiler slip. I never ruin any major plot points, but if you don't want to know a thing, I can't promise that.\r\nNow down to business...\r\nStory: 8/10 (Please not this includes the first season.)\r\nI've seen a few complaints that the storyline isn't very realistic,which I can see. But honestly, anime isn't all the realistic. And as far as this one goes, I'd say it isn't too bad. The way the relationships in this one form much better than in Nakamura's previous works. Age isn't really a factor as much with all the pairings, which was a recurring thing in her works. Though, it still retains some recurring themes, such as the three pairings and such. I've found the other two pairings to actually be more enjoyable than the ones from other works, like there was more thought put into them.\\n\\n\r\nIt's got what you'd typically expect from any romance anime in terms of storyline: jealousy, misunderstandings, etc. The pacing was quite appropriate as well, though I wouldn't recommend it to people who become impatient with an anime very easily. Otherwise, the story is entertaining enough.\\n\\n\r\nArt: 7/10\\n\\n\r\nAnyone who's watched any anime long enough knows that yaoi anime and manga has a history for some interesting uh...anatomy developments. I think I only cringed at one scene in this one, which is a record for me. Honestly, compared to other yaoi anime and manga, I'd give this a 10. For once, Studio Deen did alright on this one.\\n\\n\r\nSound: 7/10\\n\\n\r\nThe opening and ending for this one is quite good, even better than the first ones. The BGM is used appropriately, which surprised me, considering how the BGM was in Junjou Romantica, which is by the same animation studio. At the same time, it's not exactly anything special either. What I'd expect from any anime.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nI'll be the first to admit that by the time I'd started this season, I still couldn't understand what was going on in some of the character's heads. However, you get that bit you need as you go on. \\n\\n\r\nI know a lot of people were irritated with Ritsu, but I don't think they really understood the way he felt? Yes, he was stubborn, and a slight tsundere at times, but how willing would you be to trust somebody you hadn't seen in ten years with your heart? Especially when they had the misunderstanding they had. Sure, it was a little over the top, but it was appropriate in a way for the beginning even more so.\\n\\n\r\nYokozawa made my blood boil, but how he feels and the kind of person he is really isn't showcased here very well at all. I highly suggest you watch the movie, it really helps to understand his character. Same with Masamune and Hatori, I would highly recommend you watch the OVAs, it make their characters a lot easier to understand.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nLike I said, I've already got a soft spot for yaoi. And as far as yaoi goes, this is probably one of the best I've seen/read, and one of my favorites. \\n\\n\r\nOverall: 8/10\\n\\n\r\nCall me biased, but still, It's a decent anime, and good yaoi anime is especially hard to come by, so this a basically the stuff of dreams at this point. Even if you don't end up liking it, at least you got the experience.",
            "date": "2015-09-05T15:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 197889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4854235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nomnomcheerios",
                "username": "nomnomcheerios"
            },
            "url": "https://myanimelist.net/reviews.php?id=197889"
        },
        {
            "content": "This anime it was very funny for me.\r\nIt have sad moments, happy moments... I think this anime is so recommended to girls(or boys(!)) who like shonen-ai/yaoi.\r\nNakamura sensei has a lot of imagination, I like she and I hope that she will do more animes like this or Junjou Romantica.\r\nThe best character in the anime was Onodera Ritsu(for me), because, he appears that he's crazy in the anime, and I like it: it's funny!\r\nMy score in the anime:\r\n-Story > 9 =Great\r\n-Art > 8 =Very Good\r\n-Sound> 9 =Great\r\n-Character> 10 =Outstanding\r\n-Enjoyment> 10= Outstanding\r\n-Total> 9= Great",
            "date": "2012-06-09T15:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 63015,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1285829.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Doragonized",
                "username": "Doragonized"
            },
            "url": "https://myanimelist.net/reviews.php?id=63015"
        }
    ],
    [
        {
            "content": "Story: 9/10\r\nSekai-Ichi Hatsukoi 2 is basically continues where the first season left, if you've been keeping up with the manga. There are three main stories being told. One is that of former lovers, broken apart by a rather stupid misunderstanding, finding each other again after a couple of years. The other is of a thirty-year-old dude who likes good looking guys and ends up with one, but his self-esteem generally sucks because he /is/ thirty and his boyfriend is pretty much sex on legs. The last story is of two childhood friends, one ends up falling for the other and you know what happens next.;) \\n\\n\r\nOut of all the yaoi or shounen-ai series out there, the anime adapted from Nakamura's works still stand to be the best. They have enough emotion and depth to actually count as a love story and not just some fujoshi's wet dream. The first episode actually made me cry. Don't judge me. I totally feel for Ritsu/Masamune. \\n\\n\r\nArt: 7/10\\n\\n\r\nGah, the weakest point of almost every anime--the art. But compared to other yaoi/shounen-ai series--I'd probably give Sekai-Ichi a 9.\\n\\n\r\nSound: 9/10\\n\\n\r\nI like last season's ED theme better but I'm pretty sure the new one will grow on me soon. The OP has the same atmosphere as the other season and those of Junjou Romantica. Jumpy. Happy. Lovey-Dovey. The BGM are wonderful, as always. Making me cry. *sniffles*\\n\\n\r\nCharacter: 9/10\\n\\n\r\nI don't know about you guys but I love all of the characters. Even Ritsu. Heck, especially Ritsu. I honestly don't understand why people hate him that much. If he isn't always so hesitant, then this series would've ended quickly. \\n\\n\r\nAnd Masamune, but that's mostly because I've read manga. There's an extra chapter there about his and Ritsu's high school ~*affair*~; it's gives him more depth. Without it, he'd be pretty much like the other tops Nakamura writes. \\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nReally. How can this be explained? Two boys making sweet, sweet love? Um. Yessss. But seriously though, that's not Sekai-Ichi's winning point. :) It really does have katons of sweet moments that make your stomach flutter. For that, it's very hard to jack off to. \\n\\n\r\nOverall: 9/10",
            "date": "2011-10-07T15:33:00+00:00",
            "helpful_count": 119,
            "mal_id": 45029,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332558.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yutsuru",
                "username": "yutsuru"
            },
            "url": "https://myanimelist.net/reviews.php?id=45029"
        },
        {
            "content": "Story:\r\nContinues from the first season,the story isn't a complex one but it is interesting with all the misunderstandings about the past and the characters.(7 Good)\r\nArt:\r\nI personaly like the art and have no problem with it but there is quite a few people who don't like the style and say the characters look too similar.(7 Good)\r\nSound:\r\nI acually like the OP and ED more from this season than the first one,up beat happy kinda songs that I enjoy listening too but that being said there isn't any memorable background music in the acual anime.(6 Fair)\r\nCharacters:\r\nVery well formed characters that is a joy to watch with there up'sand down's.\\n\r\nFunny,entertaining!(9 Great)\\n\r\nEnjoyment:\\n\r\nI enjoy watching every episode,as soon as it ends I'm waiting for the next one!(8 Very Good)\\n\r\nOverall:\\n\r\nAll together if you like BL anime then this is a very good and entertaining anime for you that will leave you begging for more!(9 Great)",
            "date": "2011-10-14T15:20:00+00:00",
            "helpful_count": 32,
            "mal_id": 45547,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/393480.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ParadoxCharlie",
                "username": "ParadoxCharlie"
            },
            "url": "https://myanimelist.net/reviews.php?id=45547"
        },
        {
            "content": "This season is a marked improvement over the first, I actually enjoyed watching the characters develop and their interactions are a tad more believable. My main gripe carries over from last season and that is that this show is still very rapey at times which spoils the enjoyment of an otherwise funny love story.",
            "date": "2014-03-21T06:04:00+00:00",
            "helpful_count": 17,
            "mal_id": 136307,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/hellomrpoor",
                "username": "hellomrpoor"
            },
            "url": "https://myanimelist.net/reviews.php?id=136307"
        },
        {
            "content": "Lo and behold, more gay, but hey, thats okay.\r\nAny straight man who stumbles on this without looking at the tags will instantly realize his testicles have shrunken multiple sizes, carved a hole in his pelvic region and formed something called a uterus. From that day on the realization hits him, **** man, what happened.\r\nI watched the first season of Sekaiichi Hatsukoi for shitts and giggles but mainly to fulfill a dare with a friend to determine who drops out first. Minus the \"scenes\" the story actually works out fairly well, the arcs are in an order that is easy to follow for someone with halfa brain. The art is pretty much your typical bishounen style that attracts females and fags alike, although its not my cup of tea. It is a pretty good air freshener from the usual content you see, from a day to day basis in your classic perverted shows aimed at under aged virgin male teenagers.\\n\\n\r\nBeing well, not gay I can't say im warming up to the characters, I can tolerate a trap but thats a trap, the level of deception is well, cute. The uke types are a bit tsundere in my opinion but what the hells a tsundere anymore? Your typical female? The wife? Sarah Palin . . . oops.\\n\\n\r\nI can get used to the awkward as hell moments that would make this funny to anyone that gets them, awkward is traditional and its funny. To me thats the enjoyable part, watching someone deny something then cringe over it with a face that would break nails.\\n\\n\r\nThis is a girls world boys . . . wear a cup\\n\\n\r\nComedy aside, lets get serious. Homosexuality, seen and loathed by people worldwide, especially in the religious sect of our word. It has no place nor bounds, it is rejected by law and society as a whole. The world spits and casts rocks at you as if you were a plague or virus that would otherwise need be eradicated. You feel like reaching out yet no one will be there for you, they would all reject and hate you because you are sexually oriented differently than friends and family. Coming out of the closet really seems that difficult. However in the world of anime you have a vast fanbase dedicated to \"Gay\". The typical fangirl and your ordinary boy with  fantasies involving 2 fine women, yes its out there, and yes there are a number of shows that cater to these fans.\\n\\n\r\nSekaiichi Hatsukoi is a series based off the manga Sekaiichi Hatsukoi of course, it is a spin off of the series Junjou Romantica and it the features and cast are practically clone like. Same author, same triangles, same well . . . a lot. Here we have our three different relationships, the editor x editor, our author x salesman, and another work x work type basis. Its your typical romance; lovey dovey and what not. Jealousy and attraction all around and of course one person of the couple has the more feminine feel to them, I mean there has to be a catcher right? The series itself does not catch my eye in any line personally, any fangirl however will be instantly attracted to this hence high views. The series, and spin offs themselves I feel are better rated than they deserve partially due to the lack of male audience even though its not the target audience. You either like it or you don't.",
            "date": "2011-10-29T03:22:00+00:00",
            "helpful_count": 15,
            "mal_id": 46401,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=46401"
        },
        {
            "content": "How should I put this? It's my first time to write a review so this MAY contain spoilers if I get carried away. \r\nStory: 9/10\r\nThe second season is better and has more plot than the first in my opinion. What excited me about the second season is that it has plenty twists in every couples' story. I personally enjoyed Kisa and the book keeper's story. It has a strong impact and heavy drama which will probably lead fujoshis in tears. Although there also cliffhangers which will inevitably make you hate the anime but all in all the story is what delighted me the most aboutSH 2. \\n\\n\r\nArt: 6/10\\n\r\nSorry I had to give this a tad lower score than the others but hear me out first. My reason kinda sucks actually, it's because sometimes I get confused with the characters and I can't tell which is which! It's because some characters look almost the same. Same hair, same eyes, but, maybe it's just me. I don't know! I get confused a lot! Sorry but the art is just okay for me. \\n\\n\\n\r\nSound: 8/10\\n\r\nThe soundtracks were cute although I didn't take a liking to them at first. \\n\\n\r\nCharacters: 10/10\\n\r\nI gave this a perfect score simply because they were all perfect. Everyone of them, although I have my personal favorites, the other characters aren't to be overlooked. All of the pairings had this unbreakable and promising auras which will keep you wanting more of them. The antagonists were also good. \\n\\n\r\nOverall: 9/10\\n\r\nThis anime is very interesting and commendable. Since this is the first yaoi I've watched, I don't have much to compare it with, but it will leave you both laughing and in tears... and peeved. \\n\\n\\n",
            "date": "2013-04-29T04:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 95335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1317607.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gothaku24",
                "username": "gothaku24"
            },
            "url": "https://myanimelist.net/reviews.php?id=95335"
        },
        {
            "content": "Hm, it kept me watching for the BL but that's really it. Actually watching it sort of ticks me off because there are tones of better yaoi out there that get one or two half a$$ed OVAs, desexualized series, post poned, given a low budget manga voice acting job, or just plain ignored. While cookie cutter BL like this gets 12 full animated episodes and two seasons. I don't get it. I just don't get it. Maybe stuff like this is considered \"safe\" in their world of nothing happening storylines. Where the uke must constantly deny his attraction while the Seme becomes a sappy idiotwho will wait on the uke forever and turn down any man who comes his way. Safe are the stories that are nothing more than the \"problem of the week\" for the characters. \"I saw my boyfriend talking to a woman...I guess that's much better than him being with a man, he MUST like HER because she's a woman\" or the stereotypical best friend who is perfect for a guy in every way BUT will never get the guy he wants.\\n\\n\r\nSeriously, been there, done that, and bought the T-shirt! How many of these SAME BL stories are going to get recycled and turned into craptastic unfinished shows while beautiful yaois like Ai no Kusabi gets pushed to the back burner?? Geez! \\n\\n\r\nCan we please get some of Miyamoto Kano or Mizukami Shin stuff made? What about Complex, Sakura Gari or the beautiful Zankoku na Kama ga Shihaisuru. But nope, I guess I have to wait for anything this mangaka farts out just to get animated BL. *eye roll*",
            "date": "2011-12-25T06:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 50083,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/846605.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hazegurl",
                "username": "Hazegurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=50083"
        },
        {
            "content": "This anime and Junjou Romantica is linked somehow but I can't figure out exactly how, except that the characters work is linked, and we do see some of the characters from the JR series. This anime just focuses on another couple. \r\nThis anime is sweet, and just like Junjou Romantica, this anime is focusing on a daily life on an adult mixed with a lovers life. \r\nI must say that the story here is more serious than in Junjou, as in, there are less hilarious moments.\r\nThe art was amazing and so was the sound.\r\nThe characters, just as unique as the ones in JR and thecouples are just as cute. \\n\r\nI enjoyed the story overall, sweet and cute and dramatic.\\n\r\nI'd say the second season of Sekaiichi is better than the first as we get to know a bit more about the way each character thinks. \\n\r\nVery well made.",
            "date": "2018-07-29T06:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 285049,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6738220.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Craneface",
                "username": "Craneface"
            },
            "url": "https://myanimelist.net/reviews.php?id=285049"
        },
        {
            "content": "I'm really binge watching BL right now, which might not have a good effect on my reviews, but is bound to make them more honest.  Not that I don't always try to write honest reviews, but when one can directly compare one anime within a genre to another, one is bound to notice smaller differences in quality.\r\nI gotta say, I am a little disappointed that something as solidly mediocre as Sekaiichi Hatsukoi gets not one but two cours plus an OVA plus a movie, when almost none of the excellent BL I've read gets as much as a pitiful OVA.  Yeah, yeah, it'smore popular, I know.  Still, it rankles.\\n\\n\r\nSo here we continue straight from the first season, with the same couples, Takano x Onodera, our main pairing, Hatari x Yoshino as couple B, and Yukina x Kisa as couple C.  Also added is an episode for Asahina x Isaka (the latter being Marukawa Shoten's Director, the former his childhood playmate and current executive assistant).  And the \"spoilers\" are back as well, Yokozawa, Yanase, plus a standard slot \"girl who walks with my beloved which is proof he is not true to me\".\\n\\n\r\nStory (5): More of the manga publishing business, more of our seme trying to get closer to their uke, more of the uke resisting.  If it weren't for the workplace information and interaction, I would rate this a lot lower because at this point I am pretty much dead tired of the tsundere uke resistance, and the lack of good communication between the couples.  But for those less demanding, there is actual story here, this isn't about the sex.\\n\\n\r\nArt (4): Still not liking Nakamura's art, sorry.  Good backgrounds again, typical BL animation.\\n\\n\r\nSound (6): I didn't like the BGM as much, nor the OP.  Voice acting is as good as ever.\\n\\n\r\nCharacter (5):  Win some, lose some.  At first I started to dislike Onodera because there is only so much hemming and hawing and avoidance and denial and vacillating I can take before I want to slap somebody with a large, wet fish.  His saving grace remained that he is a hard worker and really tries to become a good editor.  And then we get to see more of his high school self with Saga/Takano, and he was just a great kid -- he has some of the uke mannerisms, the blushing, the stammering, but it's not so bad, and he is so enthusiastic and caring, and actually pretty straightforward in what he wants -- it becomes immediately clear just how much the disaster with Takano has damaged his self-confidence, and how high the walls have become which he built for protecting himself from this ever happening again.  I really felt for him.  I think if the flashbacks had come much earlier, I would have never even started to dislike him, because I would have understood.  I like Takano even better here than before because he's becoming quite good at trying to communicate, both with Onodera about work and their private business, as well as with Yokozawa, who needed some truth telling.\\n\\n\r\nWith the other couples it's mostly \"lose some\".  Hatori remains mostly stoic until provoked severely, and Yoshino remains an oblivious idiot who IMO doesn't care enough about anyone, and in consequence I don't care about their pairing.  Kisa, of whom I wasn't particularly fond already, slid into the \"hate you now\" column for being a total ass to Yukina, who was an even greater guy than last season.  I get insecurity, I do, and I am forgiving of it, but not when it results in lashing out at somebody who has only ever been decent.  FU, Kisa, Yukina deserves better.  There is one totally fantastic scene where Yukina just blew me away; you'll know it when you see it. \\n\\n\r\nYokozawa I feel for; he's such a good friend, if a bit pushy, and he has the same strict but fair behaviour at work as Takano.  I'd like him to find somebody.  Yanase I feel for as well, but we never saw much of him; I hope he develops better taste in lovers.  Isaka and Asahina didn't affect me; they felt like filler.\\n\\n\r\nEnjoyment (7): The workplace interactions continued to please me, and there is a lot of interesting stuff between Takano, Onodera, and Yokozawa, and there is a reasonably satisfying conclusion (though not really as good as I would have wanted).  Do I care enough to read the rest of the manga?  Urm.  I honestly don't know.",
            "date": "2016-09-20T21:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 229680,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=229680"
        },
        {
            "content": "It's actually really crazy because normally the season season isn't as good as the first, kinda like the second movie to an original but this really was a so-what master piece, I have to admit that this anime really got me hooked.  I'm not bi-sexual or gay, I'm straight (also a girl too) and I'm not being sexiest towards the anime but I have this strange feeling straight guys wouldn't really like a cute, romance filled guy > guy anime. But girls on the other hand, this as SO CUTE!  Without a doubt watching this anime gives off such an amazing vibe it'scrazy! You can pen point with of the to is the woman in the situation but then again you keep changing are you watch it further, the two are just so true to each other and all the mis-happs, conflicts, and obstacles make it so much better.  But the best part is that it doesn't just focus on the two main characters, it switches between love stories of the co-workers and in the end they're all really just the same. Except for one, he isn't really looked at, at all but that's OK. \\n\\n\r\nMy finally thoughts on this is well: If you don't mind the boy boy relationship then this anime if perfect, the combination of romance and comedy levels out itself and the pinch of drama just makes you come crawling for more! Though I do recommend that you watch the first season Sekaiichi Hatsukoi, because you know the '2' after it kinda lets you know this is the sequel.",
            "date": "2012-01-20T18:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 52201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Missywalker",
                "username": "Missywalker"
            },
            "url": "https://myanimelist.net/reviews.php?id=52201"
        },
        {
            "content": "Just as an FYI, the sixth episode of this season is an unaired extra episode from another Shounen Ai that's similar to this one, so if you haven't seen that, I'd recommend you skip episode 6.\r\nI'm not gonna rehash all the things I said about this anime in my review of the first season, so this review will probably be brief. First of all, one of my bigger gripes after finishing the first season was that we were hearing about all of this background from the two main characters while we barely got a look at it. This season, that changes. You will get, inthe final episode, a flashback of their time together in high school. That being said, it really should not have been the last episode of the series. For a finale, it didn't really sit well. \\n\\n\r\nThe story this season was slightly heavier than the prior season as you get into each characters' issues with being in a relationship vs. the other persons' want to be in that relationship. It's nice to see that bit of conflict rather than the relationships just boiling down to some kiss scenes and some comedic freakouts.\\n\\n\r\nSpeaking of the comedy, it's on point as always this season. Other than that, there was less story told involving things other than the romance. However, I do think that this was counteracted nicely with good character development in the romance area. In other words, this felt like a real romance story and not just a mild Yaoi. I would've liked to see some more background on the supporting characters, though, as their stories still felt unnecessary overall for this season. I definitely would've preferred it if the 12 episodes were about the two main characters and no one else. Had there been more background for the other characters-- perhaps with a longer season-- then I would've enjoyed it more.\\n\\n\r\nI guess my main critiques are that the spacing and placement of everyone's story was sort of off so I didn't really stay as immersed in everyone's story as I would've liked to be. \\n\\n\r\nOverall, though, this is a pretty strong Shounen Ai. Don't be too disappointed if the ending isn't the firecracker you wanted it to be, though. At the end of the day, this anime doesn't live up to what it had the potential to do, but it's still something that's deserving of the love it gets.",
            "date": "2018-10-31T19:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 293096,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=293096"
        },
        {
            "content": "I really like the story and in fact it touches my heart and I'm so glad that the author made this story and it became an anime and I'm i think this is the one of the best love story  I've read and seen and its just this story captures me and i can't forget and move on because of this story and in fact it inspires me...\r\nI hope the Author will read this and be inspires to make another season of this story.....\r\nCoz, I'm keeping on waiting for the next season and i will not stop hoping......:) ^.^ Thanks again for this wonderfulstory....\\n",
            "date": "2018-05-08T04:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 280048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ruckzzel",
                "username": "Ruckzzel"
            },
            "url": "https://myanimelist.net/reviews.php?id=280048"
        },
        {
            "content": "This is the first review i have ever written on anything, so it might be a little scrambled and awkward.\r\nBut Sekaiichi Hatsukoi and Sekaiicki Hatsukoi 2 both have an interesting story line and a great selection of characters. I admit to shedding a bit of a tear toward the end of the series, but i think that is just in my fangirl-ish moments that i actually did cry a little.\r\n Though, i couldn't help but think that there was something missing to make this truly a work of art and a unique anime series. I feel like if they added a little more of idlike to say passion into how the characters felt toward each it would be better.\\n\r\nAlso, i felt like the conflicts that happened within each of the different characters were the same, which made it sort of a little boring.",
            "date": "2013-07-29T10:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 107349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1975516.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/10seiga",
                "username": "10seiga"
            },
            "url": "https://myanimelist.net/reviews.php?id=107349"
        },
        {
            "content": "Before we start...okay yes, I have a soft spot for yaoi. Not because I'm a fangirl, but because when you're part of the queer community, you take what you can get. You can either take that as me being slightly biased or me looking for more realism, you're choice.\r\nAnd as always, I should probably warn you that I may let a tiny spoiler slip. I never ruin any major plot points, but if you don't want to know a thing, I can't promise that.\r\nNow down to business...\r\nStory: 8/10 (Please not this includes the first season.)\r\nI've seen a few complaints that the storyline isn't very realistic,which I can see. But honestly, anime isn't all the realistic. And as far as this one goes, I'd say it isn't too bad. The way the relationships in this one form much better than in Nakamura's previous works. Age isn't really a factor as much with all the pairings, which was a recurring thing in her works. Though, it still retains some recurring themes, such as the three pairings and such. I've found the other two pairings to actually be more enjoyable than the ones from other works, like there was more thought put into them.\\n\\n\r\nIt's got what you'd typically expect from any romance anime in terms of storyline: jealousy, misunderstandings, etc. The pacing was quite appropriate as well, though I wouldn't recommend it to people who become impatient with an anime very easily. Otherwise, the story is entertaining enough.\\n\\n\r\nArt: 7/10\\n\\n\r\nAnyone who's watched any anime long enough knows that yaoi anime and manga has a history for some interesting uh...anatomy developments. I think I only cringed at one scene in this one, which is a record for me. Honestly, compared to other yaoi anime and manga, I'd give this a 10. For once, Studio Deen did alright on this one.\\n\\n\r\nSound: 7/10\\n\\n\r\nThe opening and ending for this one is quite good, even better than the first ones. The BGM is used appropriately, which surprised me, considering how the BGM was in Junjou Romantica, which is by the same animation studio. At the same time, it's not exactly anything special either. What I'd expect from any anime.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nI'll be the first to admit that by the time I'd started this season, I still couldn't understand what was going on in some of the character's heads. However, you get that bit you need as you go on. \\n\\n\r\nI know a lot of people were irritated with Ritsu, but I don't think they really understood the way he felt? Yes, he was stubborn, and a slight tsundere at times, but how willing would you be to trust somebody you hadn't seen in ten years with your heart? Especially when they had the misunderstanding they had. Sure, it was a little over the top, but it was appropriate in a way for the beginning even more so.\\n\\n\r\nYokozawa made my blood boil, but how he feels and the kind of person he is really isn't showcased here very well at all. I highly suggest you watch the movie, it really helps to understand his character. Same with Masamune and Hatori, I would highly recommend you watch the OVAs, it make their characters a lot easier to understand.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nLike I said, I've already got a soft spot for yaoi. And as far as yaoi goes, this is probably one of the best I've seen/read, and one of my favorites. \\n\\n\r\nOverall: 8/10\\n\\n\r\nCall me biased, but still, It's a decent anime, and good yaoi anime is especially hard to come by, so this a basically the stuff of dreams at this point. Even if you don't end up liking it, at least you got the experience.",
            "date": "2015-09-05T15:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 197889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4854235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nomnomcheerios",
                "username": "nomnomcheerios"
            },
            "url": "https://myanimelist.net/reviews.php?id=197889"
        },
        {
            "content": "This anime it was very funny for me.\r\nIt have sad moments, happy moments... I think this anime is so recommended to girls(or boys(!)) who like shonen-ai/yaoi.\r\nNakamura sensei has a lot of imagination, I like she and I hope that she will do more animes like this or Junjou Romantica.\r\nThe best character in the anime was Onodera Ritsu(for me), because, he appears that he's crazy in the anime, and I like it: it's funny!\r\nMy score in the anime:\r\n-Story > 9 =Great\r\n-Art > 8 =Very Good\r\n-Sound> 9 =Great\r\n-Character> 10 =Outstanding\r\n-Enjoyment> 10= Outstanding\r\n-Total> 9= Great",
            "date": "2012-06-09T15:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 63015,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1285829.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Doragonized",
                "username": "Doragonized"
            },
            "url": "https://myanimelist.net/reviews.php?id=63015"
        }
    ]
]