[
    [
        {
            "content": "It’s easy to describe what Taimadou Gakuen 35 Shiken Shoutai really is. Just like the reputation of the “Small Fry Platoon”, being described as a group of failures at a school known as the 35th Test Platoon of Antimagic Academy, this show is also a failure of itself.  Before getting to the what, how, and why, there’s a few things new viewers should understand about the show.\r\nTaimadou Gakuen 35 Shiken Shoutai (also known as Anti-Magic Academy 35th Test Platoon) is a light novel adaptation that has over 10 volumes and currently publishing. Common logic dictates that such an adaptation could only be tolerable ifadapted into at least a 2-cour show. What do we get instead? A chunk of mess and missed potentials that gets buried by Silver Link and the director’s incompetence. Don’t get me wrong though, the show has an interesting premise. Unlike many normal schools, the 35th Test Platoon of Anti-magic Academy is part of a group that is designed to hunt down witches, beings branded with dangerous magical abilities. It’s easy to theorize what they learn is more than the usual textbook stuff like math or literature. While this stands out as somewhat unique, the show is unable to carry itself with its oddball set of characters and messy storytelling.\\n\\n\r\nThe series follows the bizarre adventures of the “Small Fry Platoon”. Like some light novel adaptations, its story structure is formatted in arcs although it interconnects and has direct relations with the overall premise. In hopes for a faithful adaptation, director Kawamura Tomoyuki instead delivers a disappointing story that fails to capture the magic, emotions, and powers with its characters. It’s pretty much a washed out action flick and nothing more as each episode dashes hopes for what fans will have expectations for this series. And it all begins from the very first few episodes.\\n\\n\r\nThere’s no official written rule but I think it’s common that most people judge if they drop or keep a show of interest with a span of three episodes. This show will likely take just one. The pilot episode establishes the main premise while also introducing some of the main characters. Because the main cast is composed of female characters, expect some generic impressions like the ‘main guy walking in on girl half-naked’ type of situation. It actually crosses that line not once but sort of twice too when Takeru Kusanagi, the leader of the 35th Test Platoon sees two of his teammates in a lewd fashion. The rest of his squad members are also all girls and throughout the show, their relationship with him ventures into the harem-esque territory. We got Ouka Ootori, a girl with a hate for witches and cold personality. As time goes on, she develops unrecognized feelings for Takeru that is acted out in a slightly tsundere fashion. Her rivalry with Mari Nikadou, a witch formerly affiliated with Valhalla, also gets personal and irritating to watch as time drags on. Then, there’s Usagi Saionji, a shy yet emotional girl with some lack of common sense and desire to marry Takeru. Her background story isn’t pretty despite her high class family status. Ikaruga Suginami, the genius and professional hacker of the group is also well known for making suggestive and often sexual jokes towards her teammates. Oh and finally, the show has to include a girl with a “lack of emotions” so Lapis, a relic eater is added to fill in the void. \\n\\n\r\nAs the storytelling is handled by arcs, each of these arcs consists of a set of episodes that focuses on a problem and specifically about a girl. Takeru and the rest of his squad always somehow gets involved in these affairs. It’s as predictable as any generic writing when Takeru attempts to save them from whatever problem they have. While it initially handles the buildup and emotional appeals well, it quickly dies out as an arc is wrapped up with the rushing. As a 1-cour adaptation, it fails with minimal plot development and feels more like just a group of ideas thrown altogether in one piece to entertain the audience. I will admit that the action flows pretty well on par with acceptable production values but everything in the end seems to lack charisma. The comical jokes gets old fast and the fan service seems to be forced into the viewers’ minds every time it tries something funny. There’s even some major filler content for this adaptation despite being already rushed. And that’s really tragic considering how much the series dropped the ball with its ridiculous directing. Don’t expect strong characterization but do be prepared for a lack of originality. There may be times that a few of the characters can be quite fun to watch though as their personalities adds some excitement to the messy story. But in retrospect, it’s still not far from disappointment.\\n\\n\r\nSilver Links adapts this series and given the production quality, they seem to have taken their sweet time with it. It’s tolerable in terms of action packed choreography especially in the more intense fighting angles. But when it comes to characters, it’s lacking in their expressions. Most of the characters seems to have the same face most of the time. While the character designs holds uniqueness to some degree, it’s hard to make it up when over-saturated fan service is mixed in with it. On the other hand, I am impressed by some of the combat gear the show produces. These include a wide range of guns, vehicles, and magical spells. The technological aspect of the setting also looks solid despite the shallow backgrounds. \\n\\n\r\nIf there’s one thing to write home about, it would be the music and soundtrack. For a sci-fi military flick with its production values, the soundtrack is surprisingly well crafted. With the stereo beat and fast paced cinematics, it correlates effectively with the action. Character theme songs are also designed with a decent amount of effort as well. While the OP and ED theme songs aren’t stellar, the overall coordination of the soundtrack deserves some praise. Character voice mannerism is another story though. While they have credibility with their personalities, there’s nothing impressive about them.\\n\\n\r\nIt’s like the group of producers for this show gathered together and thought, “let’s make this show with some pretty action and everyone will have something to talk about!” But really, besides the action and soundtrack, this show is more like an advertisement for the light novel. If you are interested more in the story, then do feel free to give it a read although by this point, it might feel like a waste of time. And time really is something they messed up for this adaptation. With its heavy rushing and lack of characterization, there’s hardly any time to craft a consistent story. In the end, it’s a waste potential.  \\n\\n\\n",
            "date": "2015-12-23T10:13:00+00:00",
            "helpful_count": 110,
            "mal_id": 206556,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=206556"
        },
        {
            "content": "These are some points that i haven't seen and would like to express them.\r\nWhen i saw the first part of the first episode, it looked epic. The scene starts off in a war zone with the main character almost dead on the floor. I love anime that has a brutal reality of war in its art, however i was fooled. The epic battlefield that the show birthed us into, turned into a day care for the non rational and childish characters, and a harem for the main protagonist. \r\nFights\r\nThere are the fights and the set ups for missions that i like, but it gets spoiledby just plain stupidity. The realistic war zone edge that they had, where they could get wounded and they felt weak, turned into an irrational invisibility that they had when they battled. \\n\\n\r\nCharacter Hardships\\n\r\nThe deepness of the mental wounds of the characters seem easily shallow, for example one of the characters accidentally killed someone, but the main dude was like *pat pat* on her fucking head and then everything was resolved.\\n\\n\r\nVillains \\n\r\nThe villains in this series have no special attribute ---- they are the same a power ranger villains, as in they come in with epic stuff but then get beat and cry like a baby, its the same thing every time. \\n\\n\r\nMain character weapons\\n\r\nThe main character is ...... you guessed it, a katana wielder. Not that having katanas is bad but there isn't any unique style to it. The final form of the main character is a set of armore that looks really cartoon -ish, like i wanted a rusted metallic armor, but instead we get the colorful suit from when the power rangers morph. \\n\\n\r\nI hoped you found some use and sympathies with me on some points instead of growling at your screen trying to find where i live so you can chop my fingers off so i will never type such a bad review again. :)\\n\\n",
            "date": "2015-12-02T23:19:00+00:00",
            "helpful_count": 53,
            "mal_id": 204679,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5028562.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ddguide56",
                "username": "ddguide56"
            },
            "url": "https://myanimelist.net/reviews.php?id=204679"
        },
        {
            "content": "Art: 7/10\r\nThere isn't anything particulary new for the art. It is not bad, just okay. So animations are - there isn't spectacular show to see but it's decent. Characters could've been designed a little better for me but i didn't dislike it all.\r\nSounds: 6/10\r\nFirstly, Opening and Ending songs are pretty good and somehow cachy. Too badly that there isn't too much \"background\" music in the actual show. Sound effects and voice acting are just okay for me - just like with art.\r\nCharacter: 6/10\r\nBasically we have here standard set of characters, typical for romance/ecchi/harem anime. Every female \"hero\" 35 is in love with our MC. Wehave booby-one, perv-one, shy-one, open-one and they all are like: He's mine! Don't try to take him away from me! So it's nothing special but it's kinda funny after all.\\n\\n\r\nOn the other every character have some problems which we discover tro the show although the plot is too rushed.\\n\\n\r\nStory: 6/10\\n\\n\r\nI've seen a big potential. I thought it may be something different from typical harem/love/friendship (dunno) anime. Story is too rushed and too focused on romances and friendships in the 2nd half of the show. So it's just okay - nothing more.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nI did enjoy the show. It made me laugh in some parts and generally it was light to watch. Decent show If we have some free time.\\n\\n\r\nOverall: 6/10\\n\\n\r\nAs I mentioned above this show have had potenial but it turned out to be another harem focused anime with bad developed romance and rushed story. Other than that there isn't anything special in art, animation, sounds and characters - everything is just okay.\\n",
            "date": "2015-12-26T17:55:00+00:00",
            "helpful_count": 43,
            "mal_id": 206899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4221097.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gaatcha",
                "username": "Gaatcha"
            },
            "url": "https://myanimelist.net/reviews.php?id=206899"
        },
        {
            "content": "Ah Silver Link.  You...you really didn't do a good job this season, now did you...\r\nStory: Kusanagi Takeru is a student at AntiMagic Academy.  In a world where magic and witches run rampant, only one platoon is fit for the job.  No, not the top ones, this little one called Platoon 35 with only 5 people.  One guy and four girls.  That's...that's a harem right there.  \r\nThe story, as mentioned before, follows the 35th or \"Small Fry Platoon\", comprising of what many in the Antimagic academy call a platoon of failures.  Following a more arcic setup on account ofthe way that the light novels are arranged, the show organizes itself to follow the story of the LN's (with quite some variation might I add) from start to end.  As a fantasy series, Antimagic requires quite a bit of explanation in order to progress the story, and that's really only when the problems for this adaptation begins.  \\n\\n\r\nPacing (like every other show Silver Link made this Fall 2015) is the main issue for this adaptation.  Because Silver Link wanted to do so much in so little, a lot of the content that was in the original LN was cut out to the point that most of what was happening didn't make complete sense or was made so insignificant that even if it was key to the plot, you would never know whether or not it was.  \\n\\n\r\nAs a result of the pacing issue, the series lost a lot of its own content and became only a hollow shell of its former self.  They rushed so much that I began questioning what was even going on in front of me, and that is never a good sign.  The ending itself didn't really solve much of anything either because the show just...ended.  It dropped everything that was happening and created an original ending that was just kinda shoehorned in there just to finish off what they were doing.  That is not only a bad move, but leaves a lot to be desired.\\n\\n\r\nOverview:\\n\r\n+ Interesting premise\\n\r\n-  Terrible, terrible pacing issues\\n\r\n-  Lack of explanation\\n\r\n-  Lackluster ending\\n\\n\r\nCharacters:  Characters in Antimagic also share some semblance of lacking quality similar to its story.\\n\\n\r\nUp first we have Kusanagi Takeru, the main protagonist of the Antimagic series.  As the main protagonist of a harem series, he has the 'nice' quality that almost every godforsaken one of those dense asshats have.  As a wielder of the Kusanagi sword arts, Takeru spends most of the series on missions to aid the girls in his Platoon of their problems and does so with promise to share half of their burden.  As such, he has built up quite a legion of potential wives just like others of his kin.  (Kin being other harem protags.)  He's also apparently prone to anger, but that just doesn't seem like it's in there.  \\n\\n\r\nThen we have the girls in the series.  Ouka, Mari, Usagi, Ikaruga, and Lapis.  As with all harem series, I will give a quick rundown for all of them.\\n\\n\r\nOuka: Token tsundere of the series.\\n\r\nMari: A witch forced to be part of the platoon.  The one with the bust complex.\\n\r\nUsagi: The small one with the oversized chest.  Quite easy to tease and is quite the wimp.\\n\r\nIkaruga: The last one to give a shit about anything.  Also flirty.  \\n\r\nLapis: Kusanagi's Relic Eater.  (Basically, a zanpaktou of sorts.)  The loli/kuudere character.\\n\\n\r\nThe entire runtime of the series is essentially devoted to these girls (except Lapis) and their respective arcs.  With each proceeding arc, we tackle one of the girls' issues, cure or take care of it, induct them further into Takeru's harem, rinse and repeat.  The problem here is that the pacing issues really hamper what we know about the characters.  Because it's so rushed, the explanations are either incomplete, or so pushed through that it doesn't really make sense.  As such, the reason as to why or how they changed really doesn't make the most sense and doesn't fulfill the character development that they should have.\\n\\n\r\nIn addition, the show doesn't really focus on a lot of the other characters as much.  All of the other characters are pretty much shafted to the side to be plot related more than anything else.  Even going to the extent of showing you a few scenes of characters that Antimagic fans know, but never get to experience because the time they're shown in is so miniscule.  \\n\\n\r\nOverview:\\n\r\n+/- Semi-decent main characters\\n\r\n-  Lack of character development/personality\\n\r\n-  Other characters are pretty much ousted and/or only show up when needed\\n\\n\r\nArt: Art for Antimagic is a bit of a rickety subject.  For the most part, Antimagic has a lot of fairly nice animation, as the general look of the show has a moody yet bright look to it that genuinely looks nice as an artstyle.  They also have quite a few magic circles and other magical bits like that that look nice and detailed.  \\n\\n\r\nOn the flipside however, because Antimagic has power suits, mechs, and the like, a lot of the action scenes with those qualities have CGI attached to them, making Takeru's fighting form and other things in the show look like clunky bits of CG that are only semi-meshed with the background.  As such, it looks quite awkward to see the CG in an animated background, creating a clash that just looks off.  Especially in the last episode.\\n\\n\r\nOverview:\\n\r\n+ Good standard animation\\n\r\n-  Bad CGI\\n\\n\r\nSound:  The OP and ED tracks for Antimagic are quite hit and miss.  The OP for starters sounds so generic and one-note that I don't think it's really think it's worth mentioning.  The ED on the other hand has a tone to it that connects more to the Antimagic series, as it's a more technical, more darker or melancholic tone that relates to some of what goes on in the series.  \\n\\n\r\nPersonal Enjoyment: I heard quite a few good things about Anti-magic academy before going into it.  Things about how the females were very strong despite being a harem series, there were some pretty deep and personal arcs for the characters, and there was an imouto that turned into cthulu.  Well...I guess one out of three wasn't bad?\\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nI wouldn't say I enjoyed this anime as I was intrigued by it.  A lot of what was shown was ok to watch, I laughed a bit, but there wasn't really anything that made me think that this was worth more than I'm giving it.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nThe rushing.  I had to get someone to explain to me what was going on with every passing episode, and just saw how much there was missing.  Plus, the CGI is eye gouging.  It's not as bad as other series' I've seen, but it's definitely not good CGI.  (I don't think any CGI in anime is really that good tbh.)\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nNot...really.  I would say you're better off reading the LN.  They skip over so much detail that you'll be left with more questions than answers if you watch this by itself.  (Or without someone to spoon feed you information like I did.)",
            "date": "2015-12-23T23:28:00+00:00",
            "helpful_count": 32,
            "mal_id": 206635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206635"
        },
        {
            "content": "It is released in October 2015 anime, consisting of 12 episodes and whose highlight genres are action, harem and fantasy.\r\nAt first glance it may seem the typical harem, but you can not judge without knowing a little more about it.\r\nHISTORY: The anime tells the story of Takeru, a student of inquisitor (Witch Hunter) found in a firing antimagic at his academy, but not any squad, is the leading 35th and last squad, known as the worst of all platoons ...\r\nthe members of this squad have great individual skills but they are not good at working in teams, but everything will change soon with the arrivalof a new member to the squad: Ouka, a girl who had already questioning but demoted to the squad for different reasons.\\n\\n\r\nMAIN CHARACTERS\\n\r\n-Kusanagi Takeru: Freshman Academy, he is unable to use firearms, their clumsiness in handling them is known as a \"curse\", the only way to be strong was polishing his skills with the sword . Takeru decided to become a part of the Inquisition to show the world that the sword will not lose a firearm, after the defeat at the hands of Ootori Ouka, he decided to continue striving to become an inquisitor for the money. His family has a huge debt he have to pay, he also need money for the sake of his little sister. He is the leader of the 35th firing test, the worst of all.\\n\\n\r\n-Ootori Ouka: Freshman Academy, moved to the school in the medium term and enlisted in 35º firing tests due to manipulation by the president of the academy whom is also her adoptive father. She has a deep hatred of witches, due to a tragic incident in the past where his family was killed by a witch. Ouka excels in any kind of combat, and possesses skills that allows her to act alone, she is a prodigious inquisitor who previously was qualified to join Dullahan: the special unit inquisitors.\\n\\n\r\n-Usagi Saionji: Usagi is a sniper genius who is also assigned to the 35th squad, she is a girl from a family of high class. She is very emotional, and it shows in his face and his actions, suffers from a horrible stage fright, causing major incidents and errors.\\n\\n\r\n-Suginami Ikaruga: she is also a freshman at the academy, she is a genius when it comes to maintaining and creating weapons, playing with machines, and piracy. A classmate and good friend of Takeru. Previously it was investigated to join a special division before entering high school; however, she refused saying she wanted to live her \"youth school life\" and continue attending school, she was assigned to 35º firing tests when entering high school.\\n\\n\r\n-Mari Nikaidou: A witch previously affiliated to Valhalla (evil organization), tricked help them out with their criminal activities. Possessor of \"Aurora'', an ancient attribute of magic, which specializes in high-power destructive magic. shes distinctive features are the muffler and hat she always wears, even when indoors, is currently in the 35th squad for different reasons.\\n\\n\r\nART: It highlights the simplicity of some faces as the protagonist. If it is true that landscapes and background are fairly well but at the level of character design lacks precision.\\n\\n\r\nOn the issue that we all like ...... .the oppais !! Well, we found some good oppais throughout the anime, due to some ecchi containing, among which are especially Ikaruga and Saionji.\\n\\n\r\nAs for the animation, we found a good anime, it is true that it is not packed with action scenes, but there are very well animated.\\n\\n\r\nSOUND: Inside the music is a fairly regular anime, it contains the typical soundtrack and music lacks some important moments in action.\\n\\n\r\nA sugarcane band in these fights would have been quite favorable in this anime.\\n\\n\r\nEnjoyment: The truth is not an anime that have been highlighted especially..\\n\\n\r\nSomething more power demonstration in protagonist would not have been wrong.\\n\\n\r\nI think it's an anime that is not bad but it could be better",
            "date": "2016-03-12T13:02:00+00:00",
            "helpful_count": 6,
            "mal_id": 212781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5017776.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gyachi",
                "username": "Gyachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=212781"
        },
        {
            "content": "*Spoiler Free*\r\nIt's hard to review an anime without any bias. If you enjoyed the anime, you're most likely going to give it a higher score or vice versa. With that being said, I do enjoy this anime so although the unbiased score would most likely be a 6, I'll giving it a 7 since there is the highly personal \"enjoyment\" category in this review system. \r\nStory - 6\r\n\"Taimadou Gakuen 35 Shaken Shoutai\" or AntiMagic Academy 35th Test Platoon is your average magical high school anime filled with magic, supernatural, and advanced weaponry. More specifically to this story, the school is an academy specialized in raisingwitch hunters. Students are put into \"platoons\" and their job is to neutralize any magical threats aka, capturing/destroying witches. The 35th platoon is led by the main character of the story Takeru Kusanagi, accompanied by several other female students. They along with other platoons are sent out to combat witches. Sounds interesting right? However, the story doesn't seem to have a lot of depth. I still don't really know who the main antagonists are, we've mostly just had name drops. I haven't heard of a second season so we are likely to end off with no conclusion. \\n\\n\r\nArt - 7\\n\\n\r\nAnimation is pretty good. Characters are drawn nicely and fight scenes are pretty fluid. No complaints here.\\n\\n\r\nSound - 8\\n\\n\r\nI've mentioned how the \"enjoyment\" category is pretty personal and is often very biased. This goes the same for \"sound\". You either like the music or not. As you can see by my score, I quite enjoyed the OP and ED. They're catchy and works well with the opening and ending animation. The score is also tailored nicely according to specific scenes and situations.\\n\\n\r\nCharacter - 6\\n\\n\r\nLike its story, AntiMagic Academy 35th Test Platoon has pretty average characters. There isn't anyone that stands out. The male MC is your regular male protagonist. He's caring, he's kind and he's willing to help his comrades no matter the cost. And just like other harem animes, he's surrounding by a group of females - his teammates. However, Takeru isn't an overpowered MC, he does in fact bleed. None of the characters in this anime seem to have a deep background, in fact we haven't really seen a lot of the background stories. The ones we have seen though are pretty average (i.e. losing a family member - not to say that this should be taken lightly).\\n\\n\r\nEnjoyment - 8\\n\\n\r\nI really enjoy this anime. I usually don't enjoy these types of animes as they're so overdone. I also don't enjoy that echhi and harem tag as I'm not a shounen. However, unlike the other \"magical high school\" animes airing this season, AntiMagic Academy gives a darker and more mysterious vibe - both in story and in tone. As a result I'm able to take it more seriously, instead of idly watching an episode every week just so I could add it to the \"completed\" section of MAL. \\n\\n\r\nOverall - 6 (unbiased) 7 (biased)\\n\\n\r\nAntiMagic Academy 35th Test Platoon isn't anything special. With an overused storyline and average characters it's not the must watch of the fall season. But if we expect spectacular storylines and characters in every anime, we probably won't have very much to watch.\\n",
            "date": "2015-12-28T19:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 207152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4619577.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/aznangel",
                "username": "aznangel"
            },
            "url": "https://myanimelist.net/reviews.php?id=207152"
        },
        {
            "content": "It's becoming a common occurrence for various series that I know absolutely nothing about to blindside me and overtake a 4-5 hour portion of my life, leaving nothing but a few gasps and several wide-eyed stares in their respective wakes. In just this year alone, it's happened with shows like Ranpo Kitan, Death Parade, SaeKano, and so many others. Why do so many of the shows that I haven't looked into wind up being better than the ones I count down the days for? Am I just overhyping things too much? Anyway, Anti-Magic Academy: The 35th Test Platoon is just another example of one ofthese series to glide in under my radar and become something much bigger than anticipated. However, not everyone seems to see it that way.\\n\\n\r\nBeing another light novel adaptation, the Anti-Magic Academy anime already had a story set in stone prior to its creation. This is both a good and bad thing. The good part is that since the product has already been exposed to the general populous, there are a guaranteed few people who will be tuning in to see how the anime turns out. The bad part, though, is that these same people are typically the ones to shout, \"Heresy!\" when things don't play out exactly as they should. Personally, I haven't read the light novels. And I'm not sure if that's a good or bad thing at this point after reading so many reviews from people who did.\\n\\n\r\nWritten by Touki Yanagimi with art from Kippu, Anti-Magic Academy focuses on one of the many different student platoons of the aptly named \"Anti-Magic Academy.\" However, the platoon that we will be spending our time with (Platoon 35) isn't exactly the best one out there. In fact, they're total crap in comparison to every other platoon of the school. But that all changes once Ouka Ootori is appointed as its newest inquisitor. For those that haven't watched the series, inquisitors are basically this anime's version of magic-police, or people who dedicate their lives to eliminating \"Witches\" which can be viewed as criminalistic mages for lack of a better word(s). Ouka Ootori happens to be a damn good one, but that's probably because she has given up everything else in her life in order to exact revenge for her sister, who was basically killed by a witch. Kind of. As for the rest of the platoon, well, they're pretty okay. I guess.\\n\\n\r\nThe leader of the 35th test platoon, Takeru Kusanagi, is a level-headed, semi-typical male protagonist. And I say semi-typical because he isn't an overly-dense unrealistic moron that doesn't realize he is the main character of a harem. Takeru isn't just another carbon copy of this type of character, though. His backstory, which is briefly highlighted in the later portion of the anime, is actually pretty cool. There is this whole thing with how he is forced into either protecting or murdering his sister (SPOILER: She's a witch) and it's actually really cool. The other characters are all equally memorable as well. There's Usagi: The sniper rabbit, Suginami: The girl next door if that girl never left her house, and Mari Nikaidou: The second cutest girl of the season. The cast itself is probably the most memorable of the season as far as I'm concerned, and a huge reason for that is that each one was actually developed.\\n\\n\r\nHere is where the light-novel fans are probably clenching their fists and thinking, \"Yo, they weren't developed at all! Suginami only had three episodes of backstory! WTF?!\". The fact of the matter is this -- we're looking at a typical one-cour show. With the 12 episodes we have, there isn't a ton of time for development. But honestly, the way this development was handled was actually significantly better than a bunch of other adaptations that face the same issue. Look at Toyko Ghoul √A for example. Do you remember how they handled character development? That's right, they just skipped over it entirely. Anti-Magic Academy actually gives some thought to each of its characters, even if that time wasn't in the form of six-episode arcs for each person.\\n\\n\r\nOne of the best things about Anti-Magic Academy is how unafraid it is to highlight the darker portions of its story -- a feat that a lot of anime nowadays strays away from in order to achieve a better time-slot and ultimately be exposed to a wider variety of people. There is actually a ton of moments in this series that will make you think, \"Wait, what is this show rated?\" and those moments really go on to sculpt another unique viewing experience. But at the same time, the series still dedicates sufficient time to those fanservice-craving viewers that just want to see Suginami without her shirt on. That's not a bad thing, don't worry, guys. In fact, I think that's a totally plausible reason to watch this show in the first place. I mean, come on. We all know it.\\n\\n\r\nIn the later portion of the show, we are finally introduced to Kusanagi's little sister, Kiseki (Which is an incredibly perfect name for her character if you know the meaning of the word). Kiseki is basically Saya from Saya no Uta, meaning that she is basically so awesome that her awesomeness can't be contained and takes on the form of a giant monster that wants to kill everyone. In fact, she is so awesome that the inquisition has had to chain her up for years now just to ensure that she doesn't escape and kill all of their families, making her into some sick test-subject for the inquisition who, up until now, appeared to be the good guys. And so they kill her hundreds of times every day, only to have her constantly respawn as if nothing had ever happened. This sequence of events is not only disturbing and totally f'ed up, but excruciatingly depressing as soon as we find out how adorable and kind she really is. Needless to say, Kusanagi finds everything out about her being murdered all the time and totally flips on the inquisition and spirals into a madness centered on protecting his sister at all costs. And considering this is a harem, his entire platoon follows him, putting their lives on the line as well, culminating in an action-packed arc that turned this series into something even bigger -- a story about \"Right vs. Wrong.\"\\n\\n\r\nNow, I don't think I'd go as far as saying this is an essential watch or how I will remember this for the rest of my life. But it's shows like these that serve as a reminder as to why I watch anime. The first two anime series I ever watched were Love Hina and Elfen Lied. And, in a weird way, this is kind of a wonky combination between those two, as well as...Index or something along those lines. What I'm trying to say is that everyone has that niche -- that one type of show that really appeals to them in a nostalgic sort of way. For me, Anti-Magic Academy was just that. I don't care about the light novel (Though I will definitely buy it if winds up being published in the US), I don't care about what this anime \"skipped.\" I care about what I saw. And to sum it up, what I saw was everything that I wanted to see, wrapped tightly in one unique package.\\n\\n\r\nIn Summary: \\n\r\nDespite what you may hear about it, Anti-Magic Academy is well-paced action drama that pays close attention to what its viewers want to see. Character development is executed well for the short amount of time the series has to offer, and the cast is one of the most lovable and memorable of the year. A surprisingly dark story will reel you in within the first several episodes and continue to surprise you from that point on. Though the art might not be as beautiful as some other series out there, the story and cast more than make up for it. If you like action, cute girls, an actual story and weird eyeball-flesh-monsters, this anime might just be what you've been searching for.",
            "date": "2016-04-08T12:43:00+00:00",
            "helpful_count": 6,
            "mal_id": 215856,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DJNOSTYLE",
                "username": "DJNOSTYLE"
            },
            "url": "https://myanimelist.net/reviews.php?id=215856"
        },
        {
            "content": "I did enjoy this anime even though I hate harems the characters were all cliché af but I still liked them. It is pretty simplistic but that's not a bad thing.  I think it was pretty well paced for a typical harem series. I had no problems with the ending I mean I expected everything I got from an anime like this. I didn't expect anything impactful just something to enjoy with cliché characters and plot. None of the backgrounds in this anime were breathtaking beautiful just normal. :/ I wish the antagonist got more development in all honesty there was nothing deep abouthim he was just there to be there. 😂 If you go into this anime not expecting anything else but a typical harem anime you'll like it. But it's definitely not worth re watching.",
            "date": "2015-12-23T22:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 206630,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4901635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seasonalanime",
                "username": "Seasonalanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=206630"
        },
        {
            "content": "Ok! This is my first time writting a review so please go easy on me and also english is not my mother tongue so please forgive some of the grammar mistake i'll make in the review below.\r\nSo let go started! i'll keep this as short as possible because i don't think many of you guys have the time to read an entire essay about an anime.\r\n-First impression: Uppon watching the first episode of the anime i think it will be just another formulatic anime with you can see all over the place now a days but boy i was wrong. For the first time inthe history we don't have a try hard main or a dense as hell main in combine with the mix of action, comedy and a little bit of harem make it a really enjoyable serie.\\n\\n\r\nI-Story: (well you guys can always read the Synopsis of the anime written by anime list above so i don't think i can out done them so i won't try)\\n\r\n   +Main content: Well Silver Link did a fantastic job of adapting the light novel to the anime,no time were wasted not a single minute or second (Except for the beach part and those comedy part of the anime which are still really enjoyable) and although this anime is an adaption of a novel but you won't get the feeling that the anime is being rush infact this is one of the best novel apdaption i've ever seen and they end it in a perfect spot that won't leave you hanging or rushing to buy the novel to read what happen next.\\n\\n\r\nII-Art:\\n\r\n   +Overall: well there is nothing we can call extraordinary here but they did put enough efford into it so that you won't get the feeling of watching a Haft done anime.\\n\r\n   +CGI: this is what make this serie special to me, they do use CGI in this anime but they did not over use them and even if when they are using it, most of the CGI involved scenes are really well done and fit right into the back ground, the enviroment and the overall art style of the anime. From my experience of watching the anime, from the start to the end there are no CGI scenes that will give you the impression of a 3d blocks jumping around slasing and shooting at each other.\\n\\n\r\nIII-Character:\\n\r\n  +Chatacter development: Silver Link did a decent job on this one they give us a little bit of the back ground history of each and every main character and also show us the reason why they have that problem in the past and the process of dealing with that problem in the present.\\n\r\n  +Character relation ship: They did a good job of slowly introdude us to the character's personality and then give us some comedy conflict between the characters then use it as a source of comedy giving us the viewer plenty of enjoyable moments.\\n\\n\r\nIV-Sound: Ok now this is the best part.\\n\r\n  +Enviroment sound effect: pretty common stuff can see every where.\\n\r\n  +OST ( offical sound track ): The use of techno and semi Soft Rock music to fuel the combat scene of the anime and make them really enjoyable.\\n\\n\r\n-My Personal Enjoyment: Personally this show is one of the good show i've seen in a long time , the music, the action and the story always get my eyes clued to the screen.\\n\\n\r\n**Scoring**\\n\r\n-Story: 7\\n\r\n-Art: 7\\n\r\n-Character: 6\\n\r\n-Enjoyment: 8\\n\r\n-Overall: 7\\n",
            "date": "2016-01-03T04:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 207639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4238597.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WinZeLord",
                "username": "WinZeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=207639"
        },
        {
            "content": "This anime is all about small team of trainees at \"police academy\" like setting, except they're dealing with no ordinary criminal, but magic-user one. Here's my personal opinion about this show:\r\nStory: 7/10\r\nThere is some issues about the plot, the main problem is there is no big plot or main story here. The events just start here and there without any story line that tied them together. the main villain exists just to create chaos or do some crazy-crime to be dealt by the anti-magic kids. No explanation whatsoever. I don't read the novel, so I might missed something that this show failed to explain.\r\nThe onlyreason I give decent score is, the character's arc. If you don't know or don't watch this anime yet, I'll just inform you that the story here consists of 2-3 episodes arcs. each of them tell the personal story of each \"harem\" character. And in my opinion, they're nicely done. There might be some filler or fan service, but you're not expecting less right? it clearly has ecchi, harem tags in the genre after all, and don't worry they're not overdoing it.\\n\\n\r\nCharacters: 8/10\\n\r\nGreat aspect of this show, the MC is skilled and have strong personality, though sometimes feels awkward and cliche. The other members also not bad. Yes, they're generic stereotypes you can find in another harem anime (You'll find tsundere, kuudere, imouto, pettanko, onee-chan-type, blablabla), but that doesn't mean they're not interesting to watch. Their personality are pretty deep and distinct from each other, they're also skilled in their expertise. I really enjoy their arc(especially Ikagura's). Other characters outside the 35th platoon barely have enough screen time, so not worth mentioning.\\n\\n\r\nArt: 6/10\\n\r\nPersonally, the animation doesn't suit my taste. Including the tokusatsu-like transformation. the battle animation also looks sluggish and dull, it leaves no impression at all (at least for me).\\n\\n\r\nSound: 7/10\\n\r\nI have not much saying in this, except the ED song is pretty nice.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI have good experience watching this show, there are funny moments as well.  It might have some pacing issue at the start, but it pick up better from that as the show going (some people might not survive though).\\n\\n\r\noverall, I would recommend this show for the one who enjoy good harem, ecchi show with some action. those who seek great and depth story-line or romance might disappointed.\\n\\n\\n\\n",
            "date": "2015-12-31T09:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 207392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3023903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Juarez",
                "username": "Juarez"
            },
            "url": "https://myanimelist.net/reviews.php?id=207392"
        },
        {
            "content": "If you're expecting the average swordsman harem, this isn't quite it, and yet it, exactly, is.  Taimadou Gakuen 35 Shiken Shoutai is a satire of the swordsman harem genre that has become the rage in recent seasons.  It is enjoyable to watch and follow as it develops, while it points out the glaring, annoying holes that many dislike in the genre.  \r\nThe story is divided into arcs, which is commonplace for this genre.  Each arc tends to be devoted to focusing on a girl of the cast while showing how badass the main character is.  The common pitfall is that,while they do get focus during their arcs, the girls in other anime are instantly thrown to the side when the next arc comes around.  Anti-Magic Academy does not follow the common failures.  \\n\\n\r\nThe great thing about 35th is that all the characters remain relevant with each arc.  The events that help develop a character does not just happen inside that character's arc: EVERY ( main ) character develops from events that have passed, and they continue to grow as the series progresses.  \\n\\n\r\nFor the main character's arc, it was enjoyable watching them deconstruct the flashback episode.  The purpose of the flashback episode is to explain the angst, brooding, and woe that torments our main characters.  When done poorly, it presents in an insufficiently short arc ambiguous reasons, like \"I should have told them the truth\", \"I should have saved them all\", or \"I should have stopped them from going\".  Takeru's arc pokes fun by throwing you tons of info and yet you walk out with the SINGULAR reason for his lament.  You understand him better as a character and you will understand the place from where he must grow.  \\n\\n\r\nYou will, however, notice that the arcs themselves are very loosely tied together, if at all.  If you are a stickler for just the perfect story, you can appreciate each arc and how it is constructed, but not the overarching story, because there isn't one.  \\n\\n\r\nThere is, however, an overarching development in terms of the characters.  You will be able to enjoy the evolution of the platoon as a team, supporting one another, and covering each other's backs.  \\n\\n\r\nAnti-Magic Academy's 35th Test Platoon's true strength is in its use of characters.  If you like Kirito but wished he had some emotions, Takeru is your man.  If you like Ayato but wished he had a few quirks, flaws, and humanizing characteristics, Takeru is the guy for you.  I thoroughly enjoyed watching him grow as a character, and be a badass while being human.  He interacts well with the side characters, while shining the spotlight on them.  That's right!  He actually steps off camera to let the other characters be awesome!  \\n\\n\r\nThe other main characters, the harem, continuously develop as the anime progresses.  Their attraction towards Takeru may seem only barely deep at first, but because the platoon develops with each episode, AND it gives events that support the supposed increase in attraction, none of the affection seems out of place.  \\n\\n\r\nThe affection from the artists of the anime is... excessive.  While the writing for the anime is golden, the drawings are fanservice-friendly.  The ecchi moments can be over the top, especially in terms of Usagi.  Luckily, Usagi is a well written character, if questionably drawn; but nothing beats Ikaruga's, Mari's, and Ouka's fanservice moments.  \\n\\n\r\nHaving said that, the art is pretty good, and the action scenes are pretty nice too.  Not much frame by frame fight choreography, but enough to accentuate the use of magic, guns, and swords.  \\n\\n\r\nThe sound is amazing, especially that thrilling light techno action theme that plays, akin to Danganronpa's investigation theme.  The OP is just the best and the ED was enjoyable too.  \\n\\n\r\nThe series was enjoyable for me in that I was expecting to be turned off, it being the swordsman harem genre, but when it gave me a little too much of that, it clicked that this wasn't like the others.  It presents to you the common annoyances of the genre, while showing you it can be done well.  Instead of \"it's so bad, it's good\", Anti-Magic Academy's 35th Test Platoon tells us, \"this genre can be bad, but I'll show you it can be good\".",
            "date": "2016-01-18T21:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 208888,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kokorosplatter",
                "username": "kokorosplatter"
            },
            "url": "https://myanimelist.net/reviews.php?id=208888"
        },
        {
            "content": "Now to start another review for Taimadou Gakuen 35 Shiken Shoutai...to put it simply this isn't the best show I've seen but I enjoyed it. Yet again another anime based of a light novel and I can't compared at the moment as I haven't read the light novel so I can't compare but this anime has inspired to start reading it. Other than the weird fanservice in places the story was enjoyable.\r\nSTORY\r\nAs I mentioned just now the story had a lot of fanservice in it to some people would draw back the actual story, yeah it was a but pointless but the story overall hadproblems even without it. It didn't add or take away any qualities that I enjoyed of the overall anime. The story itself had wholes and there are many things left unanswered but I felt like there was also a lot that was answered (I would use examples but they would be pretty major to the story).\\n\\n\r\nANIMATION\\n\\n\r\nOverall not bad, but not great, I like the detail in the close ups however there was some moments that I thought was slightly off (and seriously the boobs why were most of them so big). Oh wait, I got off topic again, anyway I liked the overall animation but there was some parts I thought...well this could be slightly better.\\n\\n\r\nSOUND\\n\\n\r\nNice sounding opening and ending but they don't really add anything special to the show  which to me could be seen as a problem however they weren't bad which was enough for me. The voice acting was great to me, once I got to know the characters quite well the voices seemed to fit quite well (which is why this score isn't too low).\\n\\n\r\nCHARACTERS\\n\\n\r\nThere were some characters I thought was a bit annoying but you soon got used to them. Takeru seems to be a typical MC, fighting for friends and stuff but I liked how he developed overall as a character, how the girls see to warm to him rather than hate him etc. The girls were all full of the typical character traits but each had a bit extra which I found was quite sweet.\\n\\n\r\nOverall good watch, definitely will check out the light novel to compare and maybe update this review soon enough XD\\n\\n\r\n-AngelBeatsYui-",
            "date": "2016-01-17T05:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 208736,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3811857.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AngelBeatsYui",
                "username": "AngelBeatsYui"
            },
            "url": "https://myanimelist.net/reviews.php?id=208736"
        },
        {
            "content": "Though it initially looks like a military-based magic-fighting show, Taimadou is actually more like your typical action-based harem in a school. It takes many of the good ideas from other shows and, in my opinion, follows many of the themes in Trinity Seven.\r\nOur protagonist, Takeru, is the rather level-headed leader of squad 35, the worst-performing team at the anti-magic academy, which is a school that fights against magic using guns and Shana-like contractors. However, soon, their squad is joined by Ouka, an uptight tsundere who happened to be a star inquisitor but demoted due to her revengeful nature. How will she bond with Takeru andhis other companions?\\n\\n\r\nThough there are certainly flaws with this show, especially in the latter episodes, the overall execution is well done and the characters are surprisingly interesting and well developed. If you like a mix of action and harem, this is a pretty good choice.\\n\\n\r\nAnimation:\\n\r\nThe animation is mostly good though there are a few qualms. The drawing style is pretty mainstream with nice coloring and average shading. Backgrounds are often plain and occasionally blurred out. The setting is actually rather undeveloped relative to the characters and takes place mostly in an urban setting. Despite the school-based theme, there actually aren't very many scenes in what you'd normally consider a school. My main criticism is the blatant usage of low-quality CGI; this is especially painful during many of the latter battles. Characters are well drawn and, compared to Trinity Seven, more appealing over all. Usagi does carry a striking resemblance to Dekomori from Chuunibyou, all the way down to the short eyebrows.\\n\\n\r\nBattles are fair overall with average choreography and a fair amount of special effects. Our protagonist uses swords in an age where most sensible people use bullets, which makes for some fun scenes. Speaking of fun scenes, there is definitely a fair amount of ecchi in this show as well. Takeru has his fair share of accidental run ins with naked girls and is often teased by the team's mad scientist Ikaruga. Oh, you even get an entire filler episode dedicated to ecchi with two separate portions involving a love potion and a tentacle-wielding beach monster.\\n\\n\r\nSound:\\n\r\nThe sound package here is definitely a pleasant surprise. The show opens with a lyric-heavy but catchy and melodic piece; it's the type that grows the more you listen to it. The show often fades into the unique ED by Kanako Itou; though her voice is very familiar, the instrumentation is a lot more electronic (fittingly) than many of her other songs. This is fitting given the show's unique and electronic-infused BGM; expect a lot of drums. There are some nice melodies in the BGM, and it sets the tonality well during both battles and peaceful/playful moments.\\n\\n\r\nThe voice cast is actually pretty junior and though Rumi Ookubo does a great job as Usagi, Kanae Itou's experience shines as Mari. There's a lot of character development and dialogue here and the main cast does a great job in general.\\n\\n\r\nStory:\\n\r\nThough Taimadou reuses a lot of concepts that we've seen in other shows, it does it well for the most part. The general progression is a bit of a mix of your traditional action-based harem and the beginnings of an underdog group working to surpass expectations. As mentioned, one of the weaker aspects of the show is the weak setting explication. Why are witches at war against our protagonist's school? Why are there Shana-like weapons contracting with humans? What is the school in the first place? It feels more like the office in Plastic Memories than an actual place of learning (of which we see none of). This doesn't get any better as the show progresses as antagonists hide their true purpose and, like in Trinity Seven, there are hints of larger forces at work that aren't really explained.\\n\\n\r\nFortunately, the rest of the elements nicely conceal this shortcoming unless you really focus on it (sorry- my bad). In particular, the neatly packed integration of fluid plot progression and character development was superb. The show can be broken into character arcs, with each of the harem gals taking their turn explaining their past and otherwise getting center stage. However, the central plot moves throughout these arcs as well, which allows this show to avoid the all-too-often overly-crammed second half of the season. The show also has a good deal of cliffhangers and plot twists, though the latter isn't always positive; the main antagonist for one pops out randomly and is in general overused as a plot device.\\n\\n\r\nThough I thought the story was above average overall, too much of the screen time was spent on developing subplots that go nowhere; of course this is unless they are planning a sequel.\\n\\n\r\nCharacter:\\n\r\nMaybe it's just me, but I think the characters in this show were surprisingly good. Their interactions were fun and they didn't feel like flat stereotypes. Yes, almost all of the girls are slightly tsundere, but in peculiarly different ways. Mari and Usagi are both exceptionally strong as characters with depth and dynamic progressions. Though the show tries to sell orange-haired Ouka as the primary heroine, she doesn't come across as strong as the others. Ikaruga is a bit of a mystery until her arc but adds a good mature balance to the otherwise overly tsun-tsun group. Even the emotion-lacking Lapis has her comedic moments.\\n\\n\r\nIn addition to a strong character presence, the show actually takes advantage of the fact that they are a team. No, I don't mean the \"leave this to me go on\" type of \"team\" as seen in virtually every other show, but an actual combined effort to overcome odds using everyone's expertise. Therefore, in addition to good character development, you get actual group development as well (their first attempt as a team is quite comical).\\n\\n\r\nIf there is a sore element here, and it is rather small, it's the antagonists. You don't really care about them, and no effort is made to explain their purpose or rationale.\\n\\n\r\nValue:\\n\r\nTaimadou is not going to be the next SAO but is definitely an above average watch in its category. It easily trounces other recent contenders in the genre such as Trinity Seven, Seirei, and Fafnir. If you're looking for a decent action-based harem with a bit of comedy and ecchi, and don't mind a thin setting, look no further than this show.",
            "date": "2016-02-06T21:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 210284,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=210284"
        },
        {
            "content": "Overall I found the anime to be a pretty good watch with a very intriguing story. I will admit that The character development was a tad bit lacking because they were trying to fit so much information into 12 episodes which caused them to give us a lack of details when it came to the characters, and there were some cliché moments that sprinkled throughout the 12 episodes, but those little cliché moments gave the anime a very light atmosphere and kept it enjoyable. I also think that they set the anime up for the possibility of a second season where they will probably gointo a little more details about the characters, which is why they probably gave us so little details in this season,. Its definitely worth the watch I personally loved it, because the story is different and cool the art was pleasing to the eyes and though the characters aren't developed to there full potential the are still very likable characters the will give you so moments of laughter",
            "date": "2015-12-31T03:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 207374,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dj-1996",
                "username": "Dj-1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=207374"
        },
        {
            "content": "\"Everyone in my crew was killed except me and Shizuka-chan,\" a cheerful girl says, in a voice she might use to describe her trip to the store to buy milk and eggs.\r\nRemember in the second half of Sword Art Online when the story suddenly dealt with rape and it was really weird and badly handled? This anime reminds me of that. It's really cliche and shallow, bearing striking resemblance to other mediocre anime such as Gakusen Toshi Asterisk or Rakudai Kishi no Cavalry, but it has a lot of dark moments showing (relatively) graphic violence and, eventually, attempted rape. \r\nAnd it just comes off badly.The show's too shallow and immature to handle those aspects well. And given how goofy it is the rest of the time it's just all over the place.\\n\\n\r\nBut the really sad thing is how that's nearly the only notable element of this show. Otherwise it's just rampantly cliche. It's badly paced, flitting between mostly unconcnected storylines before ending on one that, besides being very bad, doesn't get nearly enough setup to feel climactic or important. \\n\\n\r\nBoth of the shows I mentioned earlier are actually much better than this anime, which takes a very played out premise and fails to deliver on it quite badly.\\n",
            "date": "2016-01-04T16:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 207752,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1302019.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Evillordexdeath",
                "username": "Evillordexdeath"
            },
            "url": "https://myanimelist.net/reviews.php?id=207752"
        },
        {
            "content": "My Taimadou Gakuen 35 Shiken Shoutai review. ALLELUIA!!!! ( Did I just use the name of the Lord's god in vain?) \r\nRatings: \r\nStory: Mediocre 5.\r\nArt: Decent 4.\r\nSound: Fair 6.\r\nCharacter: Poor 3.\r\nEnjoyment: Fair 6.\r\nOverall: Poor 3.\r\nFeliz Navidad to all of you, so what we have is an anime whose genre was the usual harem, school, magic, fantasy, action, romance, ecchi, supernatural and military. Which basically were all ill-fitted to this anime or manga in general, so no more BS, as I explained my ratings for each of this anime's ratings: \r\nStory (up)\r\nDespite of all the genre mention from above, what was more profound were the action,ecchi, and supernatural, frankly the title of the anime in a romanize version was \" AntiMagic Academy 35th Test Platoon\", but the story focuses on a group of losers whom IMO, don't look like a \"Test Platoon,\" let's not forget that 35th platoon were given the pun as the \"Small Fry Platoon\" and basically the story kinda sway from what that unit was suppose to be. Also the plot doesn't seem to fit the way the story was suppose to go. It was basically a mediocre since this anime simply completes this winter season quintessential anime with a supernatural theme.\\n\\n\r\nArt: (up)\\n\\n\r\nOk, I could forgive the inuniforminty of the characters attire, were have Takeru and Otori both sporting the school's standard uniform, Usagi who seemly looks like a goth lolita, Suginami, who dresses like a whore, Mari who  basically complete the group as the quintessential Zettai ryōiki, and I can't understand why she has to dress apart from the others. There is also Lapiz ( which means pencil in Spanish) who don's her own attire which is a given since she is a relic eater, but what makes this anime a decent was that there is a limited fanservice being used, where it was just limited to Suginami, in her lingera an a couple of swimsuit fanservice that we saw with Otori and Mari and it is nice that they don't rely a lot to make this anime sell.\\n\\n\r\nSound: (up)\\n\\n\r\nNow Otori's seiyu Reina Ueda maybe only 21, but she doesn't have that teen age voice that makes Otori sound more like a grown woman that a girl, Mari's seiyu Itou Kanade is already nearing her 30's is already showing signs that she shouldn't be doing young voices anymore, Usagi's seiyu Rumi Ookubo seems to like forcing herself to act like a kid which obviously can be notice. Suginami should be voiced by Yamada Natsumi and not by Shirashi Ryoko.  takeru's seiyu is ok and so as Lapiz's seiyu Nomizu Iori, but what really prompt me to give this category a  6, was the closing theme and Haunted's ALLELUIAAAAAAA!!!!!!! catchphrase...Oh boy, I just used the name of the Lord's God in vain. Oh, and I don't get that belt thing that we see going around the character's body like a super high leather bikini jock strap to looks like an inverted suspender.   \\n\\n\r\nCharacter (up)\\n\\n\r\nJust like  the story doesn't corresponds to it's plot, so too the character's, we have Takeru Kusanagi who has given his humanity to Lapiz still acted like he is still himself, Mari who portrayed to be a strong witch, kinda looks like that she either a 7 or a 8 (1 being the highest) when it comes to combat capability. Otori on the other hand refuses to give his humanity to her relic eater and yet when she finally did, her combat capability is the same as before, the only thing that has change was that she can shoot at multiple targets at the same time, Lapiz, a relic eater was suppose to give her master, Takeru more power looks more like a bio armor than a energy booster. Usagi's portrayal was  more of a misnomer, since at one point she is a prodigy marksman, in another point she a klutz and there is another side to her that make her a misnomer, was that she is this rich brat who was suppose to marry  Reima Tenmyouji, and yet she allows herself to be this battered wife when as a inquisitor, she should have the capability to fight and yet she was regulated as a damsel in distress. Suginami, a science prodigy, well, I kinda hate it that she didn't do much in this anime, but I'm kinda disgusted that she has to back out from the last moment when she was about to have sex with Takeru. But really, what prompts me to give this category a 3, was the fact that the character's were portrayed to do the job of a grown up, also the school setting was a complete misnomer to say the least was a poor choice for the original creator to conceptualize  , since we always see them character's and other student going out in the field hunting witches  and other supernatural outlaws. If that were to be the case then authors Kippu and Yanagimi Touki should have just portray all the student at the Anti-Magic Academy as operatives working in a Anti Magic   Agency, also the main characters should be portrayed as young adults whom were in their late teens (18 to 19) and early adults (20 to 25) than high school kids doing  a grown ups job. \\n\\n\r\nEnjoyment (up)\\n\\n\r\nMy enjoyment was simply somewhere within the borders of me wanting to drop this anime or just continue to watch it up the last episode, in which I did, besides, I did wanna to see some  fanservice after all.\\n\\n\r\nOverall (up)\\n\\n\r\nWhat can I say, the anime's title doesn't correspond to the anime;s plot, the story deviates from the plot , the characters don't match up to their portrayals and the setting is a mismatch made by author who can't get enough of high school kids doing a grown ups job and of course the usual cliches, so overall this anime is as poor as it can be. So season 2??? Don't even think about it.\\n\\n\r\nMerry Christmas. ALLELUIAAAA!!!!",
            "date": "2015-12-24T22:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 206720,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=206720"
        },
        {
            "content": "Taimadou Gakuen 35 Shiken Shoutai is one of those anime that you don’t expect much from as it looks like your typical magical school anime on the covers, and well, it is just that. It manages to stay as an ecchi-harem, fantasy-school anime without being anything else. The anime has colorful characters, but only by their hair. The premise is interesting, only if the story wasn’t crammed into a mess. Taimadou Gakuen 35 Shiken Shoutai is a great example, a great example of how poor direction can ruin an anime’s potential of being great. \r\n~{Story}~\r\nThe story is about The 35th Test Platoon, one of thesquads at an anti-witch academy named Antimagic Academy, are nicknamed as the \"Small Fry Platoon\" due to their lack of co-operation abilities. The story itself isn’t that bad at first as it seems interesting enough. You’ve got a magical academy that actually gets the job done. The premise is strong enough to warrant a decent enough story. However the story is arc-based, and none of the stories end up being, well, good. Some of the arc feel messy and disjointed. You can blame it’s horridly fast pacing, its inconsistent tone, or its childish writing. The anime is filled with inconsistency By far the best arc was the final one, where they focus on the protagonist’s sister. It was nice to see a backstory for the main character, however the fast-pacing ruined the experience. It is easy to see that the light novels are a bunch better as it isn’t rushed. Also this anime doesn’t even get a proper conclusion. Right when the final arc gets solved, it just cuts to its ending. \\n\r\nStory: 4/10\\n\\n\r\n~{Presentation}~\\n\r\nTaimadou Gakuen 35 Shiken Shoutai presents a decent style in its presentation as the military feel to the anime does make it better than what it is. However the anime’s inconsistent tone is what pulls down its presentation. Its dark themes and bleak feel gets ruined by its light-hearted jokes in between, and its poorly placed fanservice. Not to mention this anime ticks down most of the clichés for its genres. However the anime does deliver top-notch action, which all get cut short and are rushed. Talking about rushing, the anime’s pacing doesn’t do a good job with its content. The pacing is incredibly fast for the worst. Taimadou Gakuen 35 Shiken Shoutai would have been lots better is it was given two-cours rather than one, as it would have had more space to spread out its plot. And the worst part is that there is a filler episode sitting in between this series after all those rushing. Why the director would ask for something like that is beyond my intellectual grasp. The pacing is by far one of the worst ever seen, and it’s a shame since this anime has something to present that is worth some attention.\\n\r\nPresentation: 3/10\\n\\n\r\n~{Character}~\\n\r\nThe cast of characters are just a bunch of clichés put in a box called Taimadou Gakuen 35 Shiken Shoutai. You’ve got your protagonist, Kusanagi Takeru, the underestimated swordsman who has family issues, Ootori Ouka, a skillful tsundere, Saionji Usagi, the cheerful one who gets extremely nervous at everything, Nikaidou Mari, the outgoing one who is insecure about her breast size, Suginami Ikaruga, the wise one and one who sexual harasses everyone, Lazuli Lapis, the emotionless loli who is probably older than the protagonist so it’s legal, and Kusanagi Kiseki, the imouto character because every main character of a ecchi-harem, fantasy-school anime needs a little sister. However, even if they are cliché, they still work. At the end, I ended up liking all of the characters. However, due to the rushed presentation present in the anime, the all characters feel bare-bones. None of the character development actually works in this anime as the pacing doesn’t let it breathe. Unfortunately this makes you care less and less about the characters. \\n\r\nCharacter: 5/10\\n\\n\r\n~{Art}~, \\n\r\nThe art is really good considering Silver Link had two other projects to work on too. The detailing is nice and the backgrounds are okay. The backgrounds do lack some detailing. However the character designs aren’t anything new, but that is to be expected. However I do like the costume designing, particularly the designs of their military-style uniform. The mixture of high-school style and military style makes the characters look far better than they are supposed to be. The mecha-type designs are also pretty good. The anime does use more of a vivid feeling in its art, which doesn’t work to well at some part. It would have been better if it had a more bleached-out look to it to maximize the effectivity of its content.\\n\r\nArt: 7/10\\n\\n\r\n~{Animation}~\\n\r\nThe animations is where Taimadou Gakuen 35 Shiken Shoutai shines, as it is very top-notch. The high production values can be seen here as the animation quality is smooth. The action is well choreographed (until it gets cut short) and it looks really good. Taimadou Gakuen 35 Shiken Shoutai also used quite a lot of CG, especially during action sequences. However the CG doesn’t distract at all as it is well done and it looks good. The detailing in the CG makes the CG look more organized. Also some of the camera angles used during action sequences are really good at it adds a better effect to its content.\\n\r\nAnimation: 8/10\\n\\n\r\n~{Voice Acting}~\\n\r\nOverall the voice acting is decent in Taimadou Gakuen 35 Shiken Shoutai, however its, for the most part, something you’ve already heard before. Hosoya Yoshimasa does a good job as Kusanagi Takeru as he makes the character sound more unique than he actually is. Kusanagi’s sounds a lot more mature than most of your protagonists of the same genre. However, it does sound a little weird at times, but it’s refreshing to hear something different. Ueda Reina does the same thing to Ootori Ouka as Hosoya Yoshimasa did to Kusanagi; she added a maturity to her character. Once again, it does sound weird, but it’s nice to see a seiyuu trying to do more with their character. Ookubo Rumi doesn’t do anything special to Saionji, Usagi, but it works. Itou Kanae does a great job with Nikaidou Mari as she uses proper ranges of tone for her character. Shiraishi Ryoko makes gives a Sawashiro Miyuki-ish voice to Suginami Ikaruga, which isn’t a bad thing. It’s hard to judge Nomizu Iori as Lazuli because her script doesn’t ask for much as she plays an emotionless character..\\n\r\nVoice Acting: 6/10\\n\\n\r\n~{Music}~\\n\r\nThe OP, “Embrace Blade” is decent and the ED, “Calling my Twilight”, sounds impressive in its first ten seconds (and that’s it), however the background music and OST is fantastic. The electro beats are really nice and it helps in making the action sequences much more enjoyable. Also the placement of the soundtracks are really good. The anime knows best where to place what OST. However it does get slightly repetitive at times, but it’s not anything too noticeable. The music itself doesn’t sound anything special, but when it is bundled to the anime and it’s action sequences, both benefit from each other.\\n\r\nMusic: 6.5/10\\n\\n\r\n~{Enjoyment}~\\n\r\nDue to pacing issues, it became harder and harder to actually enjoy the anime. The plot felt uninteresting due to lack of plot development, characters felt bare-bones, not enough exposition was given to the anime, and the anime didn’t even have a proper ending. However its production values are top-notch and they make the anime worth continuing. Also the soundtrack and background music is really good, so it makes the anime better than what it is. Even though the action in the anime is great and well-choreographed, most of the action scenes get cut short or get insanely rushed that it becomes hard to actually appreciate the action scenes in the anime.\\n\r\nEnjoyment: 4/10\\n\\n\r\nAt the end, Taimadou Gakuen 35 Shiken Shoutai is a great example of how terrible directions and horrid pacing can halt the quality of an anime drastically. It has a great premise, which gets ruined by its inefficient plot development due to the anime rushing. The characters seem fun enough, however not enough exposition was given to them to make them well-developed characters. The action in the anime is great, only if they would rush it or cut it short. The biggest problem in Taimadou Gakuen 35 Shiken Shoutai is its pacing, as this anime would have done a lot better if it was a two-cour anime rather than one. \\n\\n\r\n+ Great animations and proper use of CG.\\n\r\n+ Background music is great and it is well placed.\\n\r\n+ Great, well-choreographed action, even if it doesn’t last long.\\n\r\n- Horridly fast pacing which ruins everything this anime is capable of presenting.\\n\r\n- None of the story arcs are interesting enough due to the rushed plot development. \\n\r\n- Characters get inefficient amount of character development due to pacing issues and content skipping. \\n\\n\r\nOverall: 5.4/10",
            "date": "2016-07-02T04:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 222753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4586872.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/GoldenDevilGamer",
                "username": "GoldenDevilGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=222753"
        },
        {
            "content": "The genre of this anime, as well as the fact that it came out in the same season as two other similar animes (Rakudai and Asterisk), means that this anime will inevitably be compared to the other two shows. It seems to me that this show was generally less well-received than the other two shows, and after watching it, deservedly so. \r\nStory: 5/10 and Characters 6/10\r\nTo be succinct, this show's story was nothing special, but was thoroughly made worse by its execution. Not to blame the studio, of course, seeing as they only had 12 episodes to work with, much like Rakudai. If it wereadapted into 2 cours of 12 episodes each much like Asterisk, this show would have been much better. At least, the content would be delivered way better. \\n\\n\r\nFrom the outset, its premise is nothing special, which, considering its genre, is nothing to gripe about. I actually found the general feel to the show rather refreshing. The militaristic and slightly darker tone to the show's story was something that I felt set it apart from other animes of the same genre, and if done well, could truly make this show excel. But ultimately, this anime fell short in doing so. \\n\\n\r\nOne of the reasons was that the typical harem tropes were widely prevalent in this show. With so many typical harem scenes like accidentally touching a girl's boobs, or walking into them while they were showering, as well as some cosplay scenes, to name a few, it was difficult to actually take this show seriously. The fanservice wasn't too excessive though. It was moreso the cliched scenes that kept showing up. Not to mention a certain corny line that kept popping up, so much so that by the end, it was pretty much a joke hearing it. \\n\\n\r\nAnother big problem was the pacing. As a whole, the story is divided into multiple arcs that each focused and \"fleshed\" out a particular character. And yes, with those quotation marks, I mean to say that they did it pretty horribly. \\n\\n\r\nAs I've said, with only 12 episodes, it's only natural they tried to fit as much content in as possible in order to captivate the audience with the plot. However, in doing so, they rushed every arc, with each arc I think lasting around 2-3 episodes. The dark elements of the plot felt so badly done because they were over before you knew it, and resolved so simply it felt it was never even an issue. The struggles the characters faced didn't really feel that great too, considering the enormity of it all could be ameliorated by the main character, Takeru, taking half your fucking burden. \\n\\n\r\nIndividual episodes also felt stupidly rushed. Without spoiling anything, it's hard to truly explain what I felt while watching the show. I just felt so on edge watching the show, because it was full of climaxes, but no buildup. Often, I found myself watching the previous episode again to understand what on earth was going on in the next episode because everything would escalate so quickly you felt as though you'd missed something. And yeah, the show did miss a lot of the light novel's content.\\n\\n\r\nTo this date, I still don't understand the combat system, and I don't think I ever will unless I read the light novels. All this Relic Eater, witch-hunter, god-hunter bullshit seemed to be just shoved in your face. Then you have your villains that are somehow immortal, and capable of doing just about anything, while screaming \"Hallelujah\" (No kidding, Haunted was a pretty cool villain). \\n\\n\r\nIn terms of characters, I think the villains were pretty badly done. They felt completely irrelevant. That's to be expected for the villains of the individual arcs, but even the main villains, supposedly Valhalla, felt like sidemen. I think this was because we don't even know their motivations, nor do we know their backstories. In other words, you could chuck them in just about any anime as it would still work. \\n\\n\r\nYou've got a couple of enigmatic characters that never got any screentime. (Sougetsu, the strongest Witch Hunter guy, Kusanagi Orochi, etc.) As a result, much of the show is still shrouded in mystery. Even your supposed main protagonist is an enigma. We don't understand their powers, and their backstories are barely touched upon. Heck, even the characters of each character arc might be more fleshed out than the male protagonist. Takeru keeps going on about his sword style but when I watch it animated, it just looks like some overpowered sword arts with no technical aspect to it. \\n\\n\r\nThe romance aspect of the show is also pretty terribly done. Much of it is down to the pacing of the show. Because I think I'm rambling on too long, all I'll say is that characters fall head over heels with Takeru waay too easily. All the \"half your burden\" shit also got a bit stale over time. \\n\\n\r\nIn conclusion, the story and the characters are just as you would expect from a typical action-harem show. You've got your generic characters, a bad main character, as well as a plot full of harem tropes. Most of the cast are unmemorable, in part due to the fact that they receive no development, and are thus easily forgettable. The show was horribly paced, and even the fighting felt horrible in spite of the animation because zero thought was given to the technical aspect of things. Just another light novel series ruined by the 12 episode restriction and lack of detail in content being animated. \\n\\n\r\nArt: 7/10 and Sound: 9/10\\n\\n\r\nConsidering the workload of the animation studio during this season (Rakudai, Shomin Sample, and this), it's quite amazing that the animation quality was still this solid. It was nothing ufotable-esque, but it was smooth enough that the show was still rather enjoyable in spite of the poor story and characters. \\n\\n\r\nThe colours were generally darker in this show, which suited the show well. That said, it was still rather difficult to truly appreciate the animation when the things being animated were incomprehensible. \\n\\n\r\nThe soundtrack of this show is perhaps the best thing about it. Both opening and ending were superb. Like seriously. The lead-in to the music is also fantastic, and it generally suited the show very well. The OSTs were nothing memorable, which is largely why it fails to earn a perfect grade. But still, it was solid especially in fighting scenes. It also brought out the dark tones of the series well. \\n\\n\r\nEnjoyment: 7/10 and Overall: 6/10\\n\\n\r\nAll in all, this was nothing but a forgettable show. Apart from the soundtrack, everything about this show screamed mediocrity. Maybe even worse. That's not to detract anything away from the entertainment value of the show though. Yes, while you may have trouble understanding much of the show due to the lack of detail in it, and the show may feel horribly rushed as a result, you should still be enjoy the action scenes. \\n\\n\r\nI doubt this will be getting a season 2 since it wasn't that well-received as a show, and I won't be weeping tears over that. However, a season 2 would definitely be a big plus to the show as the show concluded rather poorly, with a lot of gaping holes in the plot left unfulfilled.",
            "date": "2015-12-27T05:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 206947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/karrapls",
                "username": "karrapls"
            },
            "url": "https://myanimelist.net/reviews.php?id=206947"
        },
        {
            "content": "It seems that all the anime companies and their mothers decided to go for the “harem fantasy magic school” theme for the Fall season of 2015. It's actually ridiculous how similar a lot of the shows have been and I can only hope future seasons won't be like this. Taimadou Gakuen 35 Shiken Shoutai is another branch of the fantasy magic shows, and while it uses the harem genre to drag in viewers, it's clear it wants to be more like A Certain Magical Index where the fantasy world and characters make up a large chunk of interest. Unlike Index however, Taimadou completely fails indeveloping the world, characters, and interactions and what it ends up being is a haphazard mess of gibberish.\\n\\n\r\nThe anime follows a squad of misfits in a witch-hunting school. The world is terrorized by magic that usually does more harm than good. Takeru Kusanagi is a special snowflake MC and leader of the misfits squad. He uses a katana rather than guns, usually spouting some edgy sword attack (Kusangi Style: Dragon Strike) when he defeats his enemies, which ends ups just being a generic sword swing with name emphasis only there to sound cool. Luckily for the MC his entire squad is filled with cute girls.\\n\\n\r\nI have no idea if the source material is crap or Silver Link decided to butcher it in their poor adaptation. Regardless, the anime quickly rushes past character and villain arcs in a 2-episode formula. The formula is as follows: a female character has her troubles with the past in the first episode, the second episode follows with the MC winning the female over by swinging his sword around in his robo-samurai armor and swearing he will carry “half of her burden”. Every few minutes there will be world building attempts where side-characters attempt to act mysterious by spouting random magic mumbo jumbo (Arthur Pendragon resurrected, philosophers stone, the Esper organization, the Alchemists whatever) in the looming background. The result at the end of each arc is a jumbled mess of a show with half-baked details and gibberish. It seems clear the writer wanted this to be something like Nasuverse or Index, but the anime’s poor portrayal doesn’t make up half of the respective latter worlds.\\n\\n\r\nIt's quite unfortunate because the character themselves have great designs and endearing personalities. They however can’t get beyond general interest in to deep and meaningful characters win because their arcs are horribly rushed.  A lot of the side characters too are likeable but they are quickly forgotten and left in the dust once a specific arc starring them ends. There are also some pretty grim moments from children zombies to clone genocides which would have left a pretty dark impression on the world build, but they are censored and delivered so poorly with the harem hijinks that they feel awkward.  \\n\\n\r\nThe production values are lazy and boring. The animation in fights feel incredibly generic where the MC is swinging his sword left and fight and not an ounce of effort was placed in choreography. I found myself dozing off in the moments that should have had my attention glued to the screen. It's hard to think a robotic-samurai destroying monsters and dueling other robot smaurai with a katana could be boring, but Silver Link manages to achieve that with this lazy production. The music is forgettable and dull.\\n\\n\r\nIn the end Taimadou can be thought of as “what if  A Certain Magical Index” failed. Imagine if  A Certain Magical Index was cut to 12 episodes and each arc had to be rushed in the short time the developers had. The only positive thing I can say about Taimadou is that it has a great cast of female characters, but even they end up being disappointing with their improperly developed character arcs. Taimadou is a show that will be forgotten once Fall 2015 is over and it is a clear example that trying to jump in on what the current popular bandwagon is does not work. \\n",
            "date": "2015-12-27T15:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 207010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/409217.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ryanxwonbin",
                "username": "ryanxwonbin"
            },
            "url": "https://myanimelist.net/reviews.php?id=207010"
        },
        {
            "content": "Mild Spoilers :)\r\n\"So then, let me carry half your burden for you\" That sentence was the meme of the whole series. Chessy/Cute sayings like these are exclaimed, of course in a non-romantic way, (which somehow all the girls fell for), by the MC all throughout the anime as he sets off on his own personal mission to ensure the safety of his new and old comrades no matter the story of their past. Then at the end, it's time for the girls to \"end a shoulder\" on his personal situation. It very much reminded me of Grisaia no Rakuen. \"Which one was better?\" I hearyou ask. Probably this one. And here's why.\\n\\n\r\nThis anime was very good. It was like an updated version of your classic cliche harem. Yes, there is a dense asf, innocentish, well mannered MC. Japans image of an ideal boy. Yes, there is the tit grab on the new tsundere that he just met in the first episode and ofc it takes him years to take his hand off her tit. We are off to a perfect start :/. As the story goes on I realised that unlike most animes, this one actually had an ongoing plot which was interesting. All the mini-arcs they manage to fit in the punny half season it ran for had enough detail, breakdown and character development for me to be satisfied with. There were many well-executed funny moments in this anime, which were really well done considering it isn't a comedy and the masochist side of the MC wasn't visited that often unlike most harems when so I'm glad for that change too.\\n\\n\r\nThe only thing I wasn't satisfied with this anime was the way they finished these mini arcs. I felt that they rushed it a bit especially the last arc. I don't know whether is me, the way they explain or the fact that they are waiting for a second season to explain it ore. Either way, I'll be crossing my fingers real tight for it. It really is a good, funny comedic watch. It's your classic cliche harem but it really doesn't get on your nerves :))) \\n\\n",
            "date": "2018-01-02T12:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 267210,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6832774.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shultz013",
                "username": "Shultz013"
            },
            "url": "https://myanimelist.net/reviews.php?id=267210"
        }
    ],
    [
        {
            "content": "It’s easy to describe what Taimadou Gakuen 35 Shiken Shoutai really is. Just like the reputation of the “Small Fry Platoon”, being described as a group of failures at a school known as the 35th Test Platoon of Antimagic Academy, this show is also a failure of itself.  Before getting to the what, how, and why, there’s a few things new viewers should understand about the show.\r\nTaimadou Gakuen 35 Shiken Shoutai (also known as Anti-Magic Academy 35th Test Platoon) is a light novel adaptation that has over 10 volumes and currently publishing. Common logic dictates that such an adaptation could only be tolerable ifadapted into at least a 2-cour show. What do we get instead? A chunk of mess and missed potentials that gets buried by Silver Link and the director’s incompetence. Don’t get me wrong though, the show has an interesting premise. Unlike many normal schools, the 35th Test Platoon of Anti-magic Academy is part of a group that is designed to hunt down witches, beings branded with dangerous magical abilities. It’s easy to theorize what they learn is more than the usual textbook stuff like math or literature. While this stands out as somewhat unique, the show is unable to carry itself with its oddball set of characters and messy storytelling.\\n\\n\r\nThe series follows the bizarre adventures of the “Small Fry Platoon”. Like some light novel adaptations, its story structure is formatted in arcs although it interconnects and has direct relations with the overall premise. In hopes for a faithful adaptation, director Kawamura Tomoyuki instead delivers a disappointing story that fails to capture the magic, emotions, and powers with its characters. It’s pretty much a washed out action flick and nothing more as each episode dashes hopes for what fans will have expectations for this series. And it all begins from the very first few episodes.\\n\\n\r\nThere’s no official written rule but I think it’s common that most people judge if they drop or keep a show of interest with a span of three episodes. This show will likely take just one. The pilot episode establishes the main premise while also introducing some of the main characters. Because the main cast is composed of female characters, expect some generic impressions like the ‘main guy walking in on girl half-naked’ type of situation. It actually crosses that line not once but sort of twice too when Takeru Kusanagi, the leader of the 35th Test Platoon sees two of his teammates in a lewd fashion. The rest of his squad members are also all girls and throughout the show, their relationship with him ventures into the harem-esque territory. We got Ouka Ootori, a girl with a hate for witches and cold personality. As time goes on, she develops unrecognized feelings for Takeru that is acted out in a slightly tsundere fashion. Her rivalry with Mari Nikadou, a witch formerly affiliated with Valhalla, also gets personal and irritating to watch as time drags on. Then, there’s Usagi Saionji, a shy yet emotional girl with some lack of common sense and desire to marry Takeru. Her background story isn’t pretty despite her high class family status. Ikaruga Suginami, the genius and professional hacker of the group is also well known for making suggestive and often sexual jokes towards her teammates. Oh and finally, the show has to include a girl with a “lack of emotions” so Lapis, a relic eater is added to fill in the void. \\n\\n\r\nAs the storytelling is handled by arcs, each of these arcs consists of a set of episodes that focuses on a problem and specifically about a girl. Takeru and the rest of his squad always somehow gets involved in these affairs. It’s as predictable as any generic writing when Takeru attempts to save them from whatever problem they have. While it initially handles the buildup and emotional appeals well, it quickly dies out as an arc is wrapped up with the rushing. As a 1-cour adaptation, it fails with minimal plot development and feels more like just a group of ideas thrown altogether in one piece to entertain the audience. I will admit that the action flows pretty well on par with acceptable production values but everything in the end seems to lack charisma. The comical jokes gets old fast and the fan service seems to be forced into the viewers’ minds every time it tries something funny. There’s even some major filler content for this adaptation despite being already rushed. And that’s really tragic considering how much the series dropped the ball with its ridiculous directing. Don’t expect strong characterization but do be prepared for a lack of originality. There may be times that a few of the characters can be quite fun to watch though as their personalities adds some excitement to the messy story. But in retrospect, it’s still not far from disappointment.\\n\\n\r\nSilver Links adapts this series and given the production quality, they seem to have taken their sweet time with it. It’s tolerable in terms of action packed choreography especially in the more intense fighting angles. But when it comes to characters, it’s lacking in their expressions. Most of the characters seems to have the same face most of the time. While the character designs holds uniqueness to some degree, it’s hard to make it up when over-saturated fan service is mixed in with it. On the other hand, I am impressed by some of the combat gear the show produces. These include a wide range of guns, vehicles, and magical spells. The technological aspect of the setting also looks solid despite the shallow backgrounds. \\n\\n\r\nIf there’s one thing to write home about, it would be the music and soundtrack. For a sci-fi military flick with its production values, the soundtrack is surprisingly well crafted. With the stereo beat and fast paced cinematics, it correlates effectively with the action. Character theme songs are also designed with a decent amount of effort as well. While the OP and ED theme songs aren’t stellar, the overall coordination of the soundtrack deserves some praise. Character voice mannerism is another story though. While they have credibility with their personalities, there’s nothing impressive about them.\\n\\n\r\nIt’s like the group of producers for this show gathered together and thought, “let’s make this show with some pretty action and everyone will have something to talk about!” But really, besides the action and soundtrack, this show is more like an advertisement for the light novel. If you are interested more in the story, then do feel free to give it a read although by this point, it might feel like a waste of time. And time really is something they messed up for this adaptation. With its heavy rushing and lack of characterization, there’s hardly any time to craft a consistent story. In the end, it’s a waste potential.  \\n\\n\\n",
            "date": "2015-12-23T10:13:00+00:00",
            "helpful_count": 110,
            "mal_id": 206556,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=206556"
        },
        {
            "content": "These are some points that i haven't seen and would like to express them.\r\nWhen i saw the first part of the first episode, it looked epic. The scene starts off in a war zone with the main character almost dead on the floor. I love anime that has a brutal reality of war in its art, however i was fooled. The epic battlefield that the show birthed us into, turned into a day care for the non rational and childish characters, and a harem for the main protagonist. \r\nFights\r\nThere are the fights and the set ups for missions that i like, but it gets spoiledby just plain stupidity. The realistic war zone edge that they had, where they could get wounded and they felt weak, turned into an irrational invisibility that they had when they battled. \\n\\n\r\nCharacter Hardships\\n\r\nThe deepness of the mental wounds of the characters seem easily shallow, for example one of the characters accidentally killed someone, but the main dude was like *pat pat* on her fucking head and then everything was resolved.\\n\\n\r\nVillains \\n\r\nThe villains in this series have no special attribute ---- they are the same a power ranger villains, as in they come in with epic stuff but then get beat and cry like a baby, its the same thing every time. \\n\\n\r\nMain character weapons\\n\r\nThe main character is ...... you guessed it, a katana wielder. Not that having katanas is bad but there isn't any unique style to it. The final form of the main character is a set of armore that looks really cartoon -ish, like i wanted a rusted metallic armor, but instead we get the colorful suit from when the power rangers morph. \\n\\n\r\nI hoped you found some use and sympathies with me on some points instead of growling at your screen trying to find where i live so you can chop my fingers off so i will never type such a bad review again. :)\\n\\n",
            "date": "2015-12-02T23:19:00+00:00",
            "helpful_count": 53,
            "mal_id": 204679,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5028562.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ddguide56",
                "username": "ddguide56"
            },
            "url": "https://myanimelist.net/reviews.php?id=204679"
        },
        {
            "content": "Art: 7/10\r\nThere isn't anything particulary new for the art. It is not bad, just okay. So animations are - there isn't spectacular show to see but it's decent. Characters could've been designed a little better for me but i didn't dislike it all.\r\nSounds: 6/10\r\nFirstly, Opening and Ending songs are pretty good and somehow cachy. Too badly that there isn't too much \"background\" music in the actual show. Sound effects and voice acting are just okay for me - just like with art.\r\nCharacter: 6/10\r\nBasically we have here standard set of characters, typical for romance/ecchi/harem anime. Every female \"hero\" 35 is in love with our MC. Wehave booby-one, perv-one, shy-one, open-one and they all are like: He's mine! Don't try to take him away from me! So it's nothing special but it's kinda funny after all.\\n\\n\r\nOn the other every character have some problems which we discover tro the show although the plot is too rushed.\\n\\n\r\nStory: 6/10\\n\\n\r\nI've seen a big potential. I thought it may be something different from typical harem/love/friendship (dunno) anime. Story is too rushed and too focused on romances and friendships in the 2nd half of the show. So it's just okay - nothing more.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nI did enjoy the show. It made me laugh in some parts and generally it was light to watch. Decent show If we have some free time.\\n\\n\r\nOverall: 6/10\\n\\n\r\nAs I mentioned above this show have had potenial but it turned out to be another harem focused anime with bad developed romance and rushed story. Other than that there isn't anything special in art, animation, sounds and characters - everything is just okay.\\n",
            "date": "2015-12-26T17:55:00+00:00",
            "helpful_count": 43,
            "mal_id": 206899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4221097.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gaatcha",
                "username": "Gaatcha"
            },
            "url": "https://myanimelist.net/reviews.php?id=206899"
        },
        {
            "content": "Ah Silver Link.  You...you really didn't do a good job this season, now did you...\r\nStory: Kusanagi Takeru is a student at AntiMagic Academy.  In a world where magic and witches run rampant, only one platoon is fit for the job.  No, not the top ones, this little one called Platoon 35 with only 5 people.  One guy and four girls.  That's...that's a harem right there.  \r\nThe story, as mentioned before, follows the 35th or \"Small Fry Platoon\", comprising of what many in the Antimagic academy call a platoon of failures.  Following a more arcic setup on account ofthe way that the light novels are arranged, the show organizes itself to follow the story of the LN's (with quite some variation might I add) from start to end.  As a fantasy series, Antimagic requires quite a bit of explanation in order to progress the story, and that's really only when the problems for this adaptation begins.  \\n\\n\r\nPacing (like every other show Silver Link made this Fall 2015) is the main issue for this adaptation.  Because Silver Link wanted to do so much in so little, a lot of the content that was in the original LN was cut out to the point that most of what was happening didn't make complete sense or was made so insignificant that even if it was key to the plot, you would never know whether or not it was.  \\n\\n\r\nAs a result of the pacing issue, the series lost a lot of its own content and became only a hollow shell of its former self.  They rushed so much that I began questioning what was even going on in front of me, and that is never a good sign.  The ending itself didn't really solve much of anything either because the show just...ended.  It dropped everything that was happening and created an original ending that was just kinda shoehorned in there just to finish off what they were doing.  That is not only a bad move, but leaves a lot to be desired.\\n\\n\r\nOverview:\\n\r\n+ Interesting premise\\n\r\n-  Terrible, terrible pacing issues\\n\r\n-  Lack of explanation\\n\r\n-  Lackluster ending\\n\\n\r\nCharacters:  Characters in Antimagic also share some semblance of lacking quality similar to its story.\\n\\n\r\nUp first we have Kusanagi Takeru, the main protagonist of the Antimagic series.  As the main protagonist of a harem series, he has the 'nice' quality that almost every godforsaken one of those dense asshats have.  As a wielder of the Kusanagi sword arts, Takeru spends most of the series on missions to aid the girls in his Platoon of their problems and does so with promise to share half of their burden.  As such, he has built up quite a legion of potential wives just like others of his kin.  (Kin being other harem protags.)  He's also apparently prone to anger, but that just doesn't seem like it's in there.  \\n\\n\r\nThen we have the girls in the series.  Ouka, Mari, Usagi, Ikaruga, and Lapis.  As with all harem series, I will give a quick rundown for all of them.\\n\\n\r\nOuka: Token tsundere of the series.\\n\r\nMari: A witch forced to be part of the platoon.  The one with the bust complex.\\n\r\nUsagi: The small one with the oversized chest.  Quite easy to tease and is quite the wimp.\\n\r\nIkaruga: The last one to give a shit about anything.  Also flirty.  \\n\r\nLapis: Kusanagi's Relic Eater.  (Basically, a zanpaktou of sorts.)  The loli/kuudere character.\\n\\n\r\nThe entire runtime of the series is essentially devoted to these girls (except Lapis) and their respective arcs.  With each proceeding arc, we tackle one of the girls' issues, cure or take care of it, induct them further into Takeru's harem, rinse and repeat.  The problem here is that the pacing issues really hamper what we know about the characters.  Because it's so rushed, the explanations are either incomplete, or so pushed through that it doesn't really make sense.  As such, the reason as to why or how they changed really doesn't make the most sense and doesn't fulfill the character development that they should have.\\n\\n\r\nIn addition, the show doesn't really focus on a lot of the other characters as much.  All of the other characters are pretty much shafted to the side to be plot related more than anything else.  Even going to the extent of showing you a few scenes of characters that Antimagic fans know, but never get to experience because the time they're shown in is so miniscule.  \\n\\n\r\nOverview:\\n\r\n+/- Semi-decent main characters\\n\r\n-  Lack of character development/personality\\n\r\n-  Other characters are pretty much ousted and/or only show up when needed\\n\\n\r\nArt: Art for Antimagic is a bit of a rickety subject.  For the most part, Antimagic has a lot of fairly nice animation, as the general look of the show has a moody yet bright look to it that genuinely looks nice as an artstyle.  They also have quite a few magic circles and other magical bits like that that look nice and detailed.  \\n\\n\r\nOn the flipside however, because Antimagic has power suits, mechs, and the like, a lot of the action scenes with those qualities have CGI attached to them, making Takeru's fighting form and other things in the show look like clunky bits of CG that are only semi-meshed with the background.  As such, it looks quite awkward to see the CG in an animated background, creating a clash that just looks off.  Especially in the last episode.\\n\\n\r\nOverview:\\n\r\n+ Good standard animation\\n\r\n-  Bad CGI\\n\\n\r\nSound:  The OP and ED tracks for Antimagic are quite hit and miss.  The OP for starters sounds so generic and one-note that I don't think it's really think it's worth mentioning.  The ED on the other hand has a tone to it that connects more to the Antimagic series, as it's a more technical, more darker or melancholic tone that relates to some of what goes on in the series.  \\n\\n\r\nPersonal Enjoyment: I heard quite a few good things about Anti-magic academy before going into it.  Things about how the females were very strong despite being a harem series, there were some pretty deep and personal arcs for the characters, and there was an imouto that turned into cthulu.  Well...I guess one out of three wasn't bad?\\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nI wouldn't say I enjoyed this anime as I was intrigued by it.  A lot of what was shown was ok to watch, I laughed a bit, but there wasn't really anything that made me think that this was worth more than I'm giving it.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nThe rushing.  I had to get someone to explain to me what was going on with every passing episode, and just saw how much there was missing.  Plus, the CGI is eye gouging.  It's not as bad as other series' I've seen, but it's definitely not good CGI.  (I don't think any CGI in anime is really that good tbh.)\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nNot...really.  I would say you're better off reading the LN.  They skip over so much detail that you'll be left with more questions than answers if you watch this by itself.  (Or without someone to spoon feed you information like I did.)",
            "date": "2015-12-23T23:28:00+00:00",
            "helpful_count": 32,
            "mal_id": 206635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206635"
        },
        {
            "content": "It is released in October 2015 anime, consisting of 12 episodes and whose highlight genres are action, harem and fantasy.\r\nAt first glance it may seem the typical harem, but you can not judge without knowing a little more about it.\r\nHISTORY: The anime tells the story of Takeru, a student of inquisitor (Witch Hunter) found in a firing antimagic at his academy, but not any squad, is the leading 35th and last squad, known as the worst of all platoons ...\r\nthe members of this squad have great individual skills but they are not good at working in teams, but everything will change soon with the arrivalof a new member to the squad: Ouka, a girl who had already questioning but demoted to the squad for different reasons.\\n\\n\r\nMAIN CHARACTERS\\n\r\n-Kusanagi Takeru: Freshman Academy, he is unable to use firearms, their clumsiness in handling them is known as a \"curse\", the only way to be strong was polishing his skills with the sword . Takeru decided to become a part of the Inquisition to show the world that the sword will not lose a firearm, after the defeat at the hands of Ootori Ouka, he decided to continue striving to become an inquisitor for the money. His family has a huge debt he have to pay, he also need money for the sake of his little sister. He is the leader of the 35th firing test, the worst of all.\\n\\n\r\n-Ootori Ouka: Freshman Academy, moved to the school in the medium term and enlisted in 35º firing tests due to manipulation by the president of the academy whom is also her adoptive father. She has a deep hatred of witches, due to a tragic incident in the past where his family was killed by a witch. Ouka excels in any kind of combat, and possesses skills that allows her to act alone, she is a prodigious inquisitor who previously was qualified to join Dullahan: the special unit inquisitors.\\n\\n\r\n-Usagi Saionji: Usagi is a sniper genius who is also assigned to the 35th squad, she is a girl from a family of high class. She is very emotional, and it shows in his face and his actions, suffers from a horrible stage fright, causing major incidents and errors.\\n\\n\r\n-Suginami Ikaruga: she is also a freshman at the academy, she is a genius when it comes to maintaining and creating weapons, playing with machines, and piracy. A classmate and good friend of Takeru. Previously it was investigated to join a special division before entering high school; however, she refused saying she wanted to live her \"youth school life\" and continue attending school, she was assigned to 35º firing tests when entering high school.\\n\\n\r\n-Mari Nikaidou: A witch previously affiliated to Valhalla (evil organization), tricked help them out with their criminal activities. Possessor of \"Aurora'', an ancient attribute of magic, which specializes in high-power destructive magic. shes distinctive features are the muffler and hat she always wears, even when indoors, is currently in the 35th squad for different reasons.\\n\\n\r\nART: It highlights the simplicity of some faces as the protagonist. If it is true that landscapes and background are fairly well but at the level of character design lacks precision.\\n\\n\r\nOn the issue that we all like ...... .the oppais !! Well, we found some good oppais throughout the anime, due to some ecchi containing, among which are especially Ikaruga and Saionji.\\n\\n\r\nAs for the animation, we found a good anime, it is true that it is not packed with action scenes, but there are very well animated.\\n\\n\r\nSOUND: Inside the music is a fairly regular anime, it contains the typical soundtrack and music lacks some important moments in action.\\n\\n\r\nA sugarcane band in these fights would have been quite favorable in this anime.\\n\\n\r\nEnjoyment: The truth is not an anime that have been highlighted especially..\\n\\n\r\nSomething more power demonstration in protagonist would not have been wrong.\\n\\n\r\nI think it's an anime that is not bad but it could be better",
            "date": "2016-03-12T13:02:00+00:00",
            "helpful_count": 6,
            "mal_id": 212781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5017776.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gyachi",
                "username": "Gyachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=212781"
        },
        {
            "content": "*Spoiler Free*\r\nIt's hard to review an anime without any bias. If you enjoyed the anime, you're most likely going to give it a higher score or vice versa. With that being said, I do enjoy this anime so although the unbiased score would most likely be a 6, I'll giving it a 7 since there is the highly personal \"enjoyment\" category in this review system. \r\nStory - 6\r\n\"Taimadou Gakuen 35 Shaken Shoutai\" or AntiMagic Academy 35th Test Platoon is your average magical high school anime filled with magic, supernatural, and advanced weaponry. More specifically to this story, the school is an academy specialized in raisingwitch hunters. Students are put into \"platoons\" and their job is to neutralize any magical threats aka, capturing/destroying witches. The 35th platoon is led by the main character of the story Takeru Kusanagi, accompanied by several other female students. They along with other platoons are sent out to combat witches. Sounds interesting right? However, the story doesn't seem to have a lot of depth. I still don't really know who the main antagonists are, we've mostly just had name drops. I haven't heard of a second season so we are likely to end off with no conclusion. \\n\\n\r\nArt - 7\\n\\n\r\nAnimation is pretty good. Characters are drawn nicely and fight scenes are pretty fluid. No complaints here.\\n\\n\r\nSound - 8\\n\\n\r\nI've mentioned how the \"enjoyment\" category is pretty personal and is often very biased. This goes the same for \"sound\". You either like the music or not. As you can see by my score, I quite enjoyed the OP and ED. They're catchy and works well with the opening and ending animation. The score is also tailored nicely according to specific scenes and situations.\\n\\n\r\nCharacter - 6\\n\\n\r\nLike its story, AntiMagic Academy 35th Test Platoon has pretty average characters. There isn't anyone that stands out. The male MC is your regular male protagonist. He's caring, he's kind and he's willing to help his comrades no matter the cost. And just like other harem animes, he's surrounding by a group of females - his teammates. However, Takeru isn't an overpowered MC, he does in fact bleed. None of the characters in this anime seem to have a deep background, in fact we haven't really seen a lot of the background stories. The ones we have seen though are pretty average (i.e. losing a family member - not to say that this should be taken lightly).\\n\\n\r\nEnjoyment - 8\\n\\n\r\nI really enjoy this anime. I usually don't enjoy these types of animes as they're so overdone. I also don't enjoy that echhi and harem tag as I'm not a shounen. However, unlike the other \"magical high school\" animes airing this season, AntiMagic Academy gives a darker and more mysterious vibe - both in story and in tone. As a result I'm able to take it more seriously, instead of idly watching an episode every week just so I could add it to the \"completed\" section of MAL. \\n\\n\r\nOverall - 6 (unbiased) 7 (biased)\\n\\n\r\nAntiMagic Academy 35th Test Platoon isn't anything special. With an overused storyline and average characters it's not the must watch of the fall season. But if we expect spectacular storylines and characters in every anime, we probably won't have very much to watch.\\n",
            "date": "2015-12-28T19:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 207152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4619577.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/aznangel",
                "username": "aznangel"
            },
            "url": "https://myanimelist.net/reviews.php?id=207152"
        },
        {
            "content": "It's becoming a common occurrence for various series that I know absolutely nothing about to blindside me and overtake a 4-5 hour portion of my life, leaving nothing but a few gasps and several wide-eyed stares in their respective wakes. In just this year alone, it's happened with shows like Ranpo Kitan, Death Parade, SaeKano, and so many others. Why do so many of the shows that I haven't looked into wind up being better than the ones I count down the days for? Am I just overhyping things too much? Anyway, Anti-Magic Academy: The 35th Test Platoon is just another example of one ofthese series to glide in under my radar and become something much bigger than anticipated. However, not everyone seems to see it that way.\\n\\n\r\nBeing another light novel adaptation, the Anti-Magic Academy anime already had a story set in stone prior to its creation. This is both a good and bad thing. The good part is that since the product has already been exposed to the general populous, there are a guaranteed few people who will be tuning in to see how the anime turns out. The bad part, though, is that these same people are typically the ones to shout, \"Heresy!\" when things don't play out exactly as they should. Personally, I haven't read the light novels. And I'm not sure if that's a good or bad thing at this point after reading so many reviews from people who did.\\n\\n\r\nWritten by Touki Yanagimi with art from Kippu, Anti-Magic Academy focuses on one of the many different student platoons of the aptly named \"Anti-Magic Academy.\" However, the platoon that we will be spending our time with (Platoon 35) isn't exactly the best one out there. In fact, they're total crap in comparison to every other platoon of the school. But that all changes once Ouka Ootori is appointed as its newest inquisitor. For those that haven't watched the series, inquisitors are basically this anime's version of magic-police, or people who dedicate their lives to eliminating \"Witches\" which can be viewed as criminalistic mages for lack of a better word(s). Ouka Ootori happens to be a damn good one, but that's probably because she has given up everything else in her life in order to exact revenge for her sister, who was basically killed by a witch. Kind of. As for the rest of the platoon, well, they're pretty okay. I guess.\\n\\n\r\nThe leader of the 35th test platoon, Takeru Kusanagi, is a level-headed, semi-typical male protagonist. And I say semi-typical because he isn't an overly-dense unrealistic moron that doesn't realize he is the main character of a harem. Takeru isn't just another carbon copy of this type of character, though. His backstory, which is briefly highlighted in the later portion of the anime, is actually pretty cool. There is this whole thing with how he is forced into either protecting or murdering his sister (SPOILER: She's a witch) and it's actually really cool. The other characters are all equally memorable as well. There's Usagi: The sniper rabbit, Suginami: The girl next door if that girl never left her house, and Mari Nikaidou: The second cutest girl of the season. The cast itself is probably the most memorable of the season as far as I'm concerned, and a huge reason for that is that each one was actually developed.\\n\\n\r\nHere is where the light-novel fans are probably clenching their fists and thinking, \"Yo, they weren't developed at all! Suginami only had three episodes of backstory! WTF?!\". The fact of the matter is this -- we're looking at a typical one-cour show. With the 12 episodes we have, there isn't a ton of time for development. But honestly, the way this development was handled was actually significantly better than a bunch of other adaptations that face the same issue. Look at Toyko Ghoul √A for example. Do you remember how they handled character development? That's right, they just skipped over it entirely. Anti-Magic Academy actually gives some thought to each of its characters, even if that time wasn't in the form of six-episode arcs for each person.\\n\\n\r\nOne of the best things about Anti-Magic Academy is how unafraid it is to highlight the darker portions of its story -- a feat that a lot of anime nowadays strays away from in order to achieve a better time-slot and ultimately be exposed to a wider variety of people. There is actually a ton of moments in this series that will make you think, \"Wait, what is this show rated?\" and those moments really go on to sculpt another unique viewing experience. But at the same time, the series still dedicates sufficient time to those fanservice-craving viewers that just want to see Suginami without her shirt on. That's not a bad thing, don't worry, guys. In fact, I think that's a totally plausible reason to watch this show in the first place. I mean, come on. We all know it.\\n\\n\r\nIn the later portion of the show, we are finally introduced to Kusanagi's little sister, Kiseki (Which is an incredibly perfect name for her character if you know the meaning of the word). Kiseki is basically Saya from Saya no Uta, meaning that she is basically so awesome that her awesomeness can't be contained and takes on the form of a giant monster that wants to kill everyone. In fact, she is so awesome that the inquisition has had to chain her up for years now just to ensure that she doesn't escape and kill all of their families, making her into some sick test-subject for the inquisition who, up until now, appeared to be the good guys. And so they kill her hundreds of times every day, only to have her constantly respawn as if nothing had ever happened. This sequence of events is not only disturbing and totally f'ed up, but excruciatingly depressing as soon as we find out how adorable and kind she really is. Needless to say, Kusanagi finds everything out about her being murdered all the time and totally flips on the inquisition and spirals into a madness centered on protecting his sister at all costs. And considering this is a harem, his entire platoon follows him, putting their lives on the line as well, culminating in an action-packed arc that turned this series into something even bigger -- a story about \"Right vs. Wrong.\"\\n\\n\r\nNow, I don't think I'd go as far as saying this is an essential watch or how I will remember this for the rest of my life. But it's shows like these that serve as a reminder as to why I watch anime. The first two anime series I ever watched were Love Hina and Elfen Lied. And, in a weird way, this is kind of a wonky combination between those two, as well as...Index or something along those lines. What I'm trying to say is that everyone has that niche -- that one type of show that really appeals to them in a nostalgic sort of way. For me, Anti-Magic Academy was just that. I don't care about the light novel (Though I will definitely buy it if winds up being published in the US), I don't care about what this anime \"skipped.\" I care about what I saw. And to sum it up, what I saw was everything that I wanted to see, wrapped tightly in one unique package.\\n\\n\r\nIn Summary: \\n\r\nDespite what you may hear about it, Anti-Magic Academy is well-paced action drama that pays close attention to what its viewers want to see. Character development is executed well for the short amount of time the series has to offer, and the cast is one of the most lovable and memorable of the year. A surprisingly dark story will reel you in within the first several episodes and continue to surprise you from that point on. Though the art might not be as beautiful as some other series out there, the story and cast more than make up for it. If you like action, cute girls, an actual story and weird eyeball-flesh-monsters, this anime might just be what you've been searching for.",
            "date": "2016-04-08T12:43:00+00:00",
            "helpful_count": 6,
            "mal_id": 215856,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DJNOSTYLE",
                "username": "DJNOSTYLE"
            },
            "url": "https://myanimelist.net/reviews.php?id=215856"
        },
        {
            "content": "I did enjoy this anime even though I hate harems the characters were all cliché af but I still liked them. It is pretty simplistic but that's not a bad thing.  I think it was pretty well paced for a typical harem series. I had no problems with the ending I mean I expected everything I got from an anime like this. I didn't expect anything impactful just something to enjoy with cliché characters and plot. None of the backgrounds in this anime were breathtaking beautiful just normal. :/ I wish the antagonist got more development in all honesty there was nothing deep abouthim he was just there to be there. 😂 If you go into this anime not expecting anything else but a typical harem anime you'll like it. But it's definitely not worth re watching.",
            "date": "2015-12-23T22:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 206630,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4901635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seasonalanime",
                "username": "Seasonalanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=206630"
        },
        {
            "content": "Ok! This is my first time writting a review so please go easy on me and also english is not my mother tongue so please forgive some of the grammar mistake i'll make in the review below.\r\nSo let go started! i'll keep this as short as possible because i don't think many of you guys have the time to read an entire essay about an anime.\r\n-First impression: Uppon watching the first episode of the anime i think it will be just another formulatic anime with you can see all over the place now a days but boy i was wrong. For the first time inthe history we don't have a try hard main or a dense as hell main in combine with the mix of action, comedy and a little bit of harem make it a really enjoyable serie.\\n\\n\r\nI-Story: (well you guys can always read the Synopsis of the anime written by anime list above so i don't think i can out done them so i won't try)\\n\r\n   +Main content: Well Silver Link did a fantastic job of adapting the light novel to the anime,no time were wasted not a single minute or second (Except for the beach part and those comedy part of the anime which are still really enjoyable) and although this anime is an adaption of a novel but you won't get the feeling that the anime is being rush infact this is one of the best novel apdaption i've ever seen and they end it in a perfect spot that won't leave you hanging or rushing to buy the novel to read what happen next.\\n\\n\r\nII-Art:\\n\r\n   +Overall: well there is nothing we can call extraordinary here but they did put enough efford into it so that you won't get the feeling of watching a Haft done anime.\\n\r\n   +CGI: this is what make this serie special to me, they do use CGI in this anime but they did not over use them and even if when they are using it, most of the CGI involved scenes are really well done and fit right into the back ground, the enviroment and the overall art style of the anime. From my experience of watching the anime, from the start to the end there are no CGI scenes that will give you the impression of a 3d blocks jumping around slasing and shooting at each other.\\n\\n\r\nIII-Character:\\n\r\n  +Chatacter development: Silver Link did a decent job on this one they give us a little bit of the back ground history of each and every main character and also show us the reason why they have that problem in the past and the process of dealing with that problem in the present.\\n\r\n  +Character relation ship: They did a good job of slowly introdude us to the character's personality and then give us some comedy conflict between the characters then use it as a source of comedy giving us the viewer plenty of enjoyable moments.\\n\\n\r\nIV-Sound: Ok now this is the best part.\\n\r\n  +Enviroment sound effect: pretty common stuff can see every where.\\n\r\n  +OST ( offical sound track ): The use of techno and semi Soft Rock music to fuel the combat scene of the anime and make them really enjoyable.\\n\\n\r\n-My Personal Enjoyment: Personally this show is one of the good show i've seen in a long time , the music, the action and the story always get my eyes clued to the screen.\\n\\n\r\n**Scoring**\\n\r\n-Story: 7\\n\r\n-Art: 7\\n\r\n-Character: 6\\n\r\n-Enjoyment: 8\\n\r\n-Overall: 7\\n",
            "date": "2016-01-03T04:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 207639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4238597.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WinZeLord",
                "username": "WinZeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=207639"
        },
        {
            "content": "This anime is all about small team of trainees at \"police academy\" like setting, except they're dealing with no ordinary criminal, but magic-user one. Here's my personal opinion about this show:\r\nStory: 7/10\r\nThere is some issues about the plot, the main problem is there is no big plot or main story here. The events just start here and there without any story line that tied them together. the main villain exists just to create chaos or do some crazy-crime to be dealt by the anti-magic kids. No explanation whatsoever. I don't read the novel, so I might missed something that this show failed to explain.\r\nThe onlyreason I give decent score is, the character's arc. If you don't know or don't watch this anime yet, I'll just inform you that the story here consists of 2-3 episodes arcs. each of them tell the personal story of each \"harem\" character. And in my opinion, they're nicely done. There might be some filler or fan service, but you're not expecting less right? it clearly has ecchi, harem tags in the genre after all, and don't worry they're not overdoing it.\\n\\n\r\nCharacters: 8/10\\n\r\nGreat aspect of this show, the MC is skilled and have strong personality, though sometimes feels awkward and cliche. The other members also not bad. Yes, they're generic stereotypes you can find in another harem anime (You'll find tsundere, kuudere, imouto, pettanko, onee-chan-type, blablabla), but that doesn't mean they're not interesting to watch. Their personality are pretty deep and distinct from each other, they're also skilled in their expertise. I really enjoy their arc(especially Ikagura's). Other characters outside the 35th platoon barely have enough screen time, so not worth mentioning.\\n\\n\r\nArt: 6/10\\n\r\nPersonally, the animation doesn't suit my taste. Including the tokusatsu-like transformation. the battle animation also looks sluggish and dull, it leaves no impression at all (at least for me).\\n\\n\r\nSound: 7/10\\n\r\nI have not much saying in this, except the ED song is pretty nice.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI have good experience watching this show, there are funny moments as well.  It might have some pacing issue at the start, but it pick up better from that as the show going (some people might not survive though).\\n\\n\r\noverall, I would recommend this show for the one who enjoy good harem, ecchi show with some action. those who seek great and depth story-line or romance might disappointed.\\n\\n\\n\\n",
            "date": "2015-12-31T09:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 207392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3023903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Juarez",
                "username": "Juarez"
            },
            "url": "https://myanimelist.net/reviews.php?id=207392"
        },
        {
            "content": "If you're expecting the average swordsman harem, this isn't quite it, and yet it, exactly, is.  Taimadou Gakuen 35 Shiken Shoutai is a satire of the swordsman harem genre that has become the rage in recent seasons.  It is enjoyable to watch and follow as it develops, while it points out the glaring, annoying holes that many dislike in the genre.  \r\nThe story is divided into arcs, which is commonplace for this genre.  Each arc tends to be devoted to focusing on a girl of the cast while showing how badass the main character is.  The common pitfall is that,while they do get focus during their arcs, the girls in other anime are instantly thrown to the side when the next arc comes around.  Anti-Magic Academy does not follow the common failures.  \\n\\n\r\nThe great thing about 35th is that all the characters remain relevant with each arc.  The events that help develop a character does not just happen inside that character's arc: EVERY ( main ) character develops from events that have passed, and they continue to grow as the series progresses.  \\n\\n\r\nFor the main character's arc, it was enjoyable watching them deconstruct the flashback episode.  The purpose of the flashback episode is to explain the angst, brooding, and woe that torments our main characters.  When done poorly, it presents in an insufficiently short arc ambiguous reasons, like \"I should have told them the truth\", \"I should have saved them all\", or \"I should have stopped them from going\".  Takeru's arc pokes fun by throwing you tons of info and yet you walk out with the SINGULAR reason for his lament.  You understand him better as a character and you will understand the place from where he must grow.  \\n\\n\r\nYou will, however, notice that the arcs themselves are very loosely tied together, if at all.  If you are a stickler for just the perfect story, you can appreciate each arc and how it is constructed, but not the overarching story, because there isn't one.  \\n\\n\r\nThere is, however, an overarching development in terms of the characters.  You will be able to enjoy the evolution of the platoon as a team, supporting one another, and covering each other's backs.  \\n\\n\r\nAnti-Magic Academy's 35th Test Platoon's true strength is in its use of characters.  If you like Kirito but wished he had some emotions, Takeru is your man.  If you like Ayato but wished he had a few quirks, flaws, and humanizing characteristics, Takeru is the guy for you.  I thoroughly enjoyed watching him grow as a character, and be a badass while being human.  He interacts well with the side characters, while shining the spotlight on them.  That's right!  He actually steps off camera to let the other characters be awesome!  \\n\\n\r\nThe other main characters, the harem, continuously develop as the anime progresses.  Their attraction towards Takeru may seem only barely deep at first, but because the platoon develops with each episode, AND it gives events that support the supposed increase in attraction, none of the affection seems out of place.  \\n\\n\r\nThe affection from the artists of the anime is... excessive.  While the writing for the anime is golden, the drawings are fanservice-friendly.  The ecchi moments can be over the top, especially in terms of Usagi.  Luckily, Usagi is a well written character, if questionably drawn; but nothing beats Ikaruga's, Mari's, and Ouka's fanservice moments.  \\n\\n\r\nHaving said that, the art is pretty good, and the action scenes are pretty nice too.  Not much frame by frame fight choreography, but enough to accentuate the use of magic, guns, and swords.  \\n\\n\r\nThe sound is amazing, especially that thrilling light techno action theme that plays, akin to Danganronpa's investigation theme.  The OP is just the best and the ED was enjoyable too.  \\n\\n\r\nThe series was enjoyable for me in that I was expecting to be turned off, it being the swordsman harem genre, but when it gave me a little too much of that, it clicked that this wasn't like the others.  It presents to you the common annoyances of the genre, while showing you it can be done well.  Instead of \"it's so bad, it's good\", Anti-Magic Academy's 35th Test Platoon tells us, \"this genre can be bad, but I'll show you it can be good\".",
            "date": "2016-01-18T21:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 208888,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kokorosplatter",
                "username": "kokorosplatter"
            },
            "url": "https://myanimelist.net/reviews.php?id=208888"
        },
        {
            "content": "Now to start another review for Taimadou Gakuen 35 Shiken Shoutai...to put it simply this isn't the best show I've seen but I enjoyed it. Yet again another anime based of a light novel and I can't compared at the moment as I haven't read the light novel so I can't compare but this anime has inspired to start reading it. Other than the weird fanservice in places the story was enjoyable.\r\nSTORY\r\nAs I mentioned just now the story had a lot of fanservice in it to some people would draw back the actual story, yeah it was a but pointless but the story overall hadproblems even without it. It didn't add or take away any qualities that I enjoyed of the overall anime. The story itself had wholes and there are many things left unanswered but I felt like there was also a lot that was answered (I would use examples but they would be pretty major to the story).\\n\\n\r\nANIMATION\\n\\n\r\nOverall not bad, but not great, I like the detail in the close ups however there was some moments that I thought was slightly off (and seriously the boobs why were most of them so big). Oh wait, I got off topic again, anyway I liked the overall animation but there was some parts I thought...well this could be slightly better.\\n\\n\r\nSOUND\\n\\n\r\nNice sounding opening and ending but they don't really add anything special to the show  which to me could be seen as a problem however they weren't bad which was enough for me. The voice acting was great to me, once I got to know the characters quite well the voices seemed to fit quite well (which is why this score isn't too low).\\n\\n\r\nCHARACTERS\\n\\n\r\nThere were some characters I thought was a bit annoying but you soon got used to them. Takeru seems to be a typical MC, fighting for friends and stuff but I liked how he developed overall as a character, how the girls see to warm to him rather than hate him etc. The girls were all full of the typical character traits but each had a bit extra which I found was quite sweet.\\n\\n\r\nOverall good watch, definitely will check out the light novel to compare and maybe update this review soon enough XD\\n\\n\r\n-AngelBeatsYui-",
            "date": "2016-01-17T05:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 208736,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3811857.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AngelBeatsYui",
                "username": "AngelBeatsYui"
            },
            "url": "https://myanimelist.net/reviews.php?id=208736"
        },
        {
            "content": "Though it initially looks like a military-based magic-fighting show, Taimadou is actually more like your typical action-based harem in a school. It takes many of the good ideas from other shows and, in my opinion, follows many of the themes in Trinity Seven.\r\nOur protagonist, Takeru, is the rather level-headed leader of squad 35, the worst-performing team at the anti-magic academy, which is a school that fights against magic using guns and Shana-like contractors. However, soon, their squad is joined by Ouka, an uptight tsundere who happened to be a star inquisitor but demoted due to her revengeful nature. How will she bond with Takeru andhis other companions?\\n\\n\r\nThough there are certainly flaws with this show, especially in the latter episodes, the overall execution is well done and the characters are surprisingly interesting and well developed. If you like a mix of action and harem, this is a pretty good choice.\\n\\n\r\nAnimation:\\n\r\nThe animation is mostly good though there are a few qualms. The drawing style is pretty mainstream with nice coloring and average shading. Backgrounds are often plain and occasionally blurred out. The setting is actually rather undeveloped relative to the characters and takes place mostly in an urban setting. Despite the school-based theme, there actually aren't very many scenes in what you'd normally consider a school. My main criticism is the blatant usage of low-quality CGI; this is especially painful during many of the latter battles. Characters are well drawn and, compared to Trinity Seven, more appealing over all. Usagi does carry a striking resemblance to Dekomori from Chuunibyou, all the way down to the short eyebrows.\\n\\n\r\nBattles are fair overall with average choreography and a fair amount of special effects. Our protagonist uses swords in an age where most sensible people use bullets, which makes for some fun scenes. Speaking of fun scenes, there is definitely a fair amount of ecchi in this show as well. Takeru has his fair share of accidental run ins with naked girls and is often teased by the team's mad scientist Ikaruga. Oh, you even get an entire filler episode dedicated to ecchi with two separate portions involving a love potion and a tentacle-wielding beach monster.\\n\\n\r\nSound:\\n\r\nThe sound package here is definitely a pleasant surprise. The show opens with a lyric-heavy but catchy and melodic piece; it's the type that grows the more you listen to it. The show often fades into the unique ED by Kanako Itou; though her voice is very familiar, the instrumentation is a lot more electronic (fittingly) than many of her other songs. This is fitting given the show's unique and electronic-infused BGM; expect a lot of drums. There are some nice melodies in the BGM, and it sets the tonality well during both battles and peaceful/playful moments.\\n\\n\r\nThe voice cast is actually pretty junior and though Rumi Ookubo does a great job as Usagi, Kanae Itou's experience shines as Mari. There's a lot of character development and dialogue here and the main cast does a great job in general.\\n\\n\r\nStory:\\n\r\nThough Taimadou reuses a lot of concepts that we've seen in other shows, it does it well for the most part. The general progression is a bit of a mix of your traditional action-based harem and the beginnings of an underdog group working to surpass expectations. As mentioned, one of the weaker aspects of the show is the weak setting explication. Why are witches at war against our protagonist's school? Why are there Shana-like weapons contracting with humans? What is the school in the first place? It feels more like the office in Plastic Memories than an actual place of learning (of which we see none of). This doesn't get any better as the show progresses as antagonists hide their true purpose and, like in Trinity Seven, there are hints of larger forces at work that aren't really explained.\\n\\n\r\nFortunately, the rest of the elements nicely conceal this shortcoming unless you really focus on it (sorry- my bad). In particular, the neatly packed integration of fluid plot progression and character development was superb. The show can be broken into character arcs, with each of the harem gals taking their turn explaining their past and otherwise getting center stage. However, the central plot moves throughout these arcs as well, which allows this show to avoid the all-too-often overly-crammed second half of the season. The show also has a good deal of cliffhangers and plot twists, though the latter isn't always positive; the main antagonist for one pops out randomly and is in general overused as a plot device.\\n\\n\r\nThough I thought the story was above average overall, too much of the screen time was spent on developing subplots that go nowhere; of course this is unless they are planning a sequel.\\n\\n\r\nCharacter:\\n\r\nMaybe it's just me, but I think the characters in this show were surprisingly good. Their interactions were fun and they didn't feel like flat stereotypes. Yes, almost all of the girls are slightly tsundere, but in peculiarly different ways. Mari and Usagi are both exceptionally strong as characters with depth and dynamic progressions. Though the show tries to sell orange-haired Ouka as the primary heroine, she doesn't come across as strong as the others. Ikaruga is a bit of a mystery until her arc but adds a good mature balance to the otherwise overly tsun-tsun group. Even the emotion-lacking Lapis has her comedic moments.\\n\\n\r\nIn addition to a strong character presence, the show actually takes advantage of the fact that they are a team. No, I don't mean the \"leave this to me go on\" type of \"team\" as seen in virtually every other show, but an actual combined effort to overcome odds using everyone's expertise. Therefore, in addition to good character development, you get actual group development as well (their first attempt as a team is quite comical).\\n\\n\r\nIf there is a sore element here, and it is rather small, it's the antagonists. You don't really care about them, and no effort is made to explain their purpose or rationale.\\n\\n\r\nValue:\\n\r\nTaimadou is not going to be the next SAO but is definitely an above average watch in its category. It easily trounces other recent contenders in the genre such as Trinity Seven, Seirei, and Fafnir. If you're looking for a decent action-based harem with a bit of comedy and ecchi, and don't mind a thin setting, look no further than this show.",
            "date": "2016-02-06T21:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 210284,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=210284"
        },
        {
            "content": "Overall I found the anime to be a pretty good watch with a very intriguing story. I will admit that The character development was a tad bit lacking because they were trying to fit so much information into 12 episodes which caused them to give us a lack of details when it came to the characters, and there were some cliché moments that sprinkled throughout the 12 episodes, but those little cliché moments gave the anime a very light atmosphere and kept it enjoyable. I also think that they set the anime up for the possibility of a second season where they will probably gointo a little more details about the characters, which is why they probably gave us so little details in this season,. Its definitely worth the watch I personally loved it, because the story is different and cool the art was pleasing to the eyes and though the characters aren't developed to there full potential the are still very likable characters the will give you so moments of laughter",
            "date": "2015-12-31T03:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 207374,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dj-1996",
                "username": "Dj-1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=207374"
        },
        {
            "content": "\"Everyone in my crew was killed except me and Shizuka-chan,\" a cheerful girl says, in a voice she might use to describe her trip to the store to buy milk and eggs.\r\nRemember in the second half of Sword Art Online when the story suddenly dealt with rape and it was really weird and badly handled? This anime reminds me of that. It's really cliche and shallow, bearing striking resemblance to other mediocre anime such as Gakusen Toshi Asterisk or Rakudai Kishi no Cavalry, but it has a lot of dark moments showing (relatively) graphic violence and, eventually, attempted rape. \r\nAnd it just comes off badly.The show's too shallow and immature to handle those aspects well. And given how goofy it is the rest of the time it's just all over the place.\\n\\n\r\nBut the really sad thing is how that's nearly the only notable element of this show. Otherwise it's just rampantly cliche. It's badly paced, flitting between mostly unconcnected storylines before ending on one that, besides being very bad, doesn't get nearly enough setup to feel climactic or important. \\n\\n\r\nBoth of the shows I mentioned earlier are actually much better than this anime, which takes a very played out premise and fails to deliver on it quite badly.\\n",
            "date": "2016-01-04T16:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 207752,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1302019.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Evillordexdeath",
                "username": "Evillordexdeath"
            },
            "url": "https://myanimelist.net/reviews.php?id=207752"
        },
        {
            "content": "My Taimadou Gakuen 35 Shiken Shoutai review. ALLELUIA!!!! ( Did I just use the name of the Lord's god in vain?) \r\nRatings: \r\nStory: Mediocre 5.\r\nArt: Decent 4.\r\nSound: Fair 6.\r\nCharacter: Poor 3.\r\nEnjoyment: Fair 6.\r\nOverall: Poor 3.\r\nFeliz Navidad to all of you, so what we have is an anime whose genre was the usual harem, school, magic, fantasy, action, romance, ecchi, supernatural and military. Which basically were all ill-fitted to this anime or manga in general, so no more BS, as I explained my ratings for each of this anime's ratings: \r\nStory (up)\r\nDespite of all the genre mention from above, what was more profound were the action,ecchi, and supernatural, frankly the title of the anime in a romanize version was \" AntiMagic Academy 35th Test Platoon\", but the story focuses on a group of losers whom IMO, don't look like a \"Test Platoon,\" let's not forget that 35th platoon were given the pun as the \"Small Fry Platoon\" and basically the story kinda sway from what that unit was suppose to be. Also the plot doesn't seem to fit the way the story was suppose to go. It was basically a mediocre since this anime simply completes this winter season quintessential anime with a supernatural theme.\\n\\n\r\nArt: (up)\\n\\n\r\nOk, I could forgive the inuniforminty of the characters attire, were have Takeru and Otori both sporting the school's standard uniform, Usagi who seemly looks like a goth lolita, Suginami, who dresses like a whore, Mari who  basically complete the group as the quintessential Zettai ryōiki, and I can't understand why she has to dress apart from the others. There is also Lapiz ( which means pencil in Spanish) who don's her own attire which is a given since she is a relic eater, but what makes this anime a decent was that there is a limited fanservice being used, where it was just limited to Suginami, in her lingera an a couple of swimsuit fanservice that we saw with Otori and Mari and it is nice that they don't rely a lot to make this anime sell.\\n\\n\r\nSound: (up)\\n\\n\r\nNow Otori's seiyu Reina Ueda maybe only 21, but she doesn't have that teen age voice that makes Otori sound more like a grown woman that a girl, Mari's seiyu Itou Kanade is already nearing her 30's is already showing signs that she shouldn't be doing young voices anymore, Usagi's seiyu Rumi Ookubo seems to like forcing herself to act like a kid which obviously can be notice. Suginami should be voiced by Yamada Natsumi and not by Shirashi Ryoko.  takeru's seiyu is ok and so as Lapiz's seiyu Nomizu Iori, but what really prompt me to give this category a  6, was the closing theme and Haunted's ALLELUIAAAAAAA!!!!!!! catchphrase...Oh boy, I just used the name of the Lord's God in vain. Oh, and I don't get that belt thing that we see going around the character's body like a super high leather bikini jock strap to looks like an inverted suspender.   \\n\\n\r\nCharacter (up)\\n\\n\r\nJust like  the story doesn't corresponds to it's plot, so too the character's, we have Takeru Kusanagi who has given his humanity to Lapiz still acted like he is still himself, Mari who portrayed to be a strong witch, kinda looks like that she either a 7 or a 8 (1 being the highest) when it comes to combat capability. Otori on the other hand refuses to give his humanity to her relic eater and yet when she finally did, her combat capability is the same as before, the only thing that has change was that she can shoot at multiple targets at the same time, Lapiz, a relic eater was suppose to give her master, Takeru more power looks more like a bio armor than a energy booster. Usagi's portrayal was  more of a misnomer, since at one point she is a prodigy marksman, in another point she a klutz and there is another side to her that make her a misnomer, was that she is this rich brat who was suppose to marry  Reima Tenmyouji, and yet she allows herself to be this battered wife when as a inquisitor, she should have the capability to fight and yet she was regulated as a damsel in distress. Suginami, a science prodigy, well, I kinda hate it that she didn't do much in this anime, but I'm kinda disgusted that she has to back out from the last moment when she was about to have sex with Takeru. But really, what prompts me to give this category a 3, was the fact that the character's were portrayed to do the job of a grown up, also the school setting was a complete misnomer to say the least was a poor choice for the original creator to conceptualize  , since we always see them character's and other student going out in the field hunting witches  and other supernatural outlaws. If that were to be the case then authors Kippu and Yanagimi Touki should have just portray all the student at the Anti-Magic Academy as operatives working in a Anti Magic   Agency, also the main characters should be portrayed as young adults whom were in their late teens (18 to 19) and early adults (20 to 25) than high school kids doing  a grown ups job. \\n\\n\r\nEnjoyment (up)\\n\\n\r\nMy enjoyment was simply somewhere within the borders of me wanting to drop this anime or just continue to watch it up the last episode, in which I did, besides, I did wanna to see some  fanservice after all.\\n\\n\r\nOverall (up)\\n\\n\r\nWhat can I say, the anime's title doesn't correspond to the anime;s plot, the story deviates from the plot , the characters don't match up to their portrayals and the setting is a mismatch made by author who can't get enough of high school kids doing a grown ups job and of course the usual cliches, so overall this anime is as poor as it can be. So season 2??? Don't even think about it.\\n\\n\r\nMerry Christmas. ALLELUIAAAA!!!!",
            "date": "2015-12-24T22:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 206720,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=206720"
        },
        {
            "content": "Taimadou Gakuen 35 Shiken Shoutai is one of those anime that you don’t expect much from as it looks like your typical magical school anime on the covers, and well, it is just that. It manages to stay as an ecchi-harem, fantasy-school anime without being anything else. The anime has colorful characters, but only by their hair. The premise is interesting, only if the story wasn’t crammed into a mess. Taimadou Gakuen 35 Shiken Shoutai is a great example, a great example of how poor direction can ruin an anime’s potential of being great. \r\n~{Story}~\r\nThe story is about The 35th Test Platoon, one of thesquads at an anti-witch academy named Antimagic Academy, are nicknamed as the \"Small Fry Platoon\" due to their lack of co-operation abilities. The story itself isn’t that bad at first as it seems interesting enough. You’ve got a magical academy that actually gets the job done. The premise is strong enough to warrant a decent enough story. However the story is arc-based, and none of the stories end up being, well, good. Some of the arc feel messy and disjointed. You can blame it’s horridly fast pacing, its inconsistent tone, or its childish writing. The anime is filled with inconsistency By far the best arc was the final one, where they focus on the protagonist’s sister. It was nice to see a backstory for the main character, however the fast-pacing ruined the experience. It is easy to see that the light novels are a bunch better as it isn’t rushed. Also this anime doesn’t even get a proper conclusion. Right when the final arc gets solved, it just cuts to its ending. \\n\r\nStory: 4/10\\n\\n\r\n~{Presentation}~\\n\r\nTaimadou Gakuen 35 Shiken Shoutai presents a decent style in its presentation as the military feel to the anime does make it better than what it is. However the anime’s inconsistent tone is what pulls down its presentation. Its dark themes and bleak feel gets ruined by its light-hearted jokes in between, and its poorly placed fanservice. Not to mention this anime ticks down most of the clichés for its genres. However the anime does deliver top-notch action, which all get cut short and are rushed. Talking about rushing, the anime’s pacing doesn’t do a good job with its content. The pacing is incredibly fast for the worst. Taimadou Gakuen 35 Shiken Shoutai would have been lots better is it was given two-cours rather than one, as it would have had more space to spread out its plot. And the worst part is that there is a filler episode sitting in between this series after all those rushing. Why the director would ask for something like that is beyond my intellectual grasp. The pacing is by far one of the worst ever seen, and it’s a shame since this anime has something to present that is worth some attention.\\n\r\nPresentation: 3/10\\n\\n\r\n~{Character}~\\n\r\nThe cast of characters are just a bunch of clichés put in a box called Taimadou Gakuen 35 Shiken Shoutai. You’ve got your protagonist, Kusanagi Takeru, the underestimated swordsman who has family issues, Ootori Ouka, a skillful tsundere, Saionji Usagi, the cheerful one who gets extremely nervous at everything, Nikaidou Mari, the outgoing one who is insecure about her breast size, Suginami Ikaruga, the wise one and one who sexual harasses everyone, Lazuli Lapis, the emotionless loli who is probably older than the protagonist so it’s legal, and Kusanagi Kiseki, the imouto character because every main character of a ecchi-harem, fantasy-school anime needs a little sister. However, even if they are cliché, they still work. At the end, I ended up liking all of the characters. However, due to the rushed presentation present in the anime, the all characters feel bare-bones. None of the character development actually works in this anime as the pacing doesn’t let it breathe. Unfortunately this makes you care less and less about the characters. \\n\r\nCharacter: 5/10\\n\\n\r\n~{Art}~, \\n\r\nThe art is really good considering Silver Link had two other projects to work on too. The detailing is nice and the backgrounds are okay. The backgrounds do lack some detailing. However the character designs aren’t anything new, but that is to be expected. However I do like the costume designing, particularly the designs of their military-style uniform. The mixture of high-school style and military style makes the characters look far better than they are supposed to be. The mecha-type designs are also pretty good. The anime does use more of a vivid feeling in its art, which doesn’t work to well at some part. It would have been better if it had a more bleached-out look to it to maximize the effectivity of its content.\\n\r\nArt: 7/10\\n\\n\r\n~{Animation}~\\n\r\nThe animations is where Taimadou Gakuen 35 Shiken Shoutai shines, as it is very top-notch. The high production values can be seen here as the animation quality is smooth. The action is well choreographed (until it gets cut short) and it looks really good. Taimadou Gakuen 35 Shiken Shoutai also used quite a lot of CG, especially during action sequences. However the CG doesn’t distract at all as it is well done and it looks good. The detailing in the CG makes the CG look more organized. Also some of the camera angles used during action sequences are really good at it adds a better effect to its content.\\n\r\nAnimation: 8/10\\n\\n\r\n~{Voice Acting}~\\n\r\nOverall the voice acting is decent in Taimadou Gakuen 35 Shiken Shoutai, however its, for the most part, something you’ve already heard before. Hosoya Yoshimasa does a good job as Kusanagi Takeru as he makes the character sound more unique than he actually is. Kusanagi’s sounds a lot more mature than most of your protagonists of the same genre. However, it does sound a little weird at times, but it’s refreshing to hear something different. Ueda Reina does the same thing to Ootori Ouka as Hosoya Yoshimasa did to Kusanagi; she added a maturity to her character. Once again, it does sound weird, but it’s nice to see a seiyuu trying to do more with their character. Ookubo Rumi doesn’t do anything special to Saionji, Usagi, but it works. Itou Kanae does a great job with Nikaidou Mari as she uses proper ranges of tone for her character. Shiraishi Ryoko makes gives a Sawashiro Miyuki-ish voice to Suginami Ikaruga, which isn’t a bad thing. It’s hard to judge Nomizu Iori as Lazuli because her script doesn’t ask for much as she plays an emotionless character..\\n\r\nVoice Acting: 6/10\\n\\n\r\n~{Music}~\\n\r\nThe OP, “Embrace Blade” is decent and the ED, “Calling my Twilight”, sounds impressive in its first ten seconds (and that’s it), however the background music and OST is fantastic. The electro beats are really nice and it helps in making the action sequences much more enjoyable. Also the placement of the soundtracks are really good. The anime knows best where to place what OST. However it does get slightly repetitive at times, but it’s not anything too noticeable. The music itself doesn’t sound anything special, but when it is bundled to the anime and it’s action sequences, both benefit from each other.\\n\r\nMusic: 6.5/10\\n\\n\r\n~{Enjoyment}~\\n\r\nDue to pacing issues, it became harder and harder to actually enjoy the anime. The plot felt uninteresting due to lack of plot development, characters felt bare-bones, not enough exposition was given to the anime, and the anime didn’t even have a proper ending. However its production values are top-notch and they make the anime worth continuing. Also the soundtrack and background music is really good, so it makes the anime better than what it is. Even though the action in the anime is great and well-choreographed, most of the action scenes get cut short or get insanely rushed that it becomes hard to actually appreciate the action scenes in the anime.\\n\r\nEnjoyment: 4/10\\n\\n\r\nAt the end, Taimadou Gakuen 35 Shiken Shoutai is a great example of how terrible directions and horrid pacing can halt the quality of an anime drastically. It has a great premise, which gets ruined by its inefficient plot development due to the anime rushing. The characters seem fun enough, however not enough exposition was given to them to make them well-developed characters. The action in the anime is great, only if they would rush it or cut it short. The biggest problem in Taimadou Gakuen 35 Shiken Shoutai is its pacing, as this anime would have done a lot better if it was a two-cour anime rather than one. \\n\\n\r\n+ Great animations and proper use of CG.\\n\r\n+ Background music is great and it is well placed.\\n\r\n+ Great, well-choreographed action, even if it doesn’t last long.\\n\r\n- Horridly fast pacing which ruins everything this anime is capable of presenting.\\n\r\n- None of the story arcs are interesting enough due to the rushed plot development. \\n\r\n- Characters get inefficient amount of character development due to pacing issues and content skipping. \\n\\n\r\nOverall: 5.4/10",
            "date": "2016-07-02T04:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 222753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4586872.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/GoldenDevilGamer",
                "username": "GoldenDevilGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=222753"
        },
        {
            "content": "The genre of this anime, as well as the fact that it came out in the same season as two other similar animes (Rakudai and Asterisk), means that this anime will inevitably be compared to the other two shows. It seems to me that this show was generally less well-received than the other two shows, and after watching it, deservedly so. \r\nStory: 5/10 and Characters 6/10\r\nTo be succinct, this show's story was nothing special, but was thoroughly made worse by its execution. Not to blame the studio, of course, seeing as they only had 12 episodes to work with, much like Rakudai. If it wereadapted into 2 cours of 12 episodes each much like Asterisk, this show would have been much better. At least, the content would be delivered way better. \\n\\n\r\nFrom the outset, its premise is nothing special, which, considering its genre, is nothing to gripe about. I actually found the general feel to the show rather refreshing. The militaristic and slightly darker tone to the show's story was something that I felt set it apart from other animes of the same genre, and if done well, could truly make this show excel. But ultimately, this anime fell short in doing so. \\n\\n\r\nOne of the reasons was that the typical harem tropes were widely prevalent in this show. With so many typical harem scenes like accidentally touching a girl's boobs, or walking into them while they were showering, as well as some cosplay scenes, to name a few, it was difficult to actually take this show seriously. The fanservice wasn't too excessive though. It was moreso the cliched scenes that kept showing up. Not to mention a certain corny line that kept popping up, so much so that by the end, it was pretty much a joke hearing it. \\n\\n\r\nAnother big problem was the pacing. As a whole, the story is divided into multiple arcs that each focused and \"fleshed\" out a particular character. And yes, with those quotation marks, I mean to say that they did it pretty horribly. \\n\\n\r\nAs I've said, with only 12 episodes, it's only natural they tried to fit as much content in as possible in order to captivate the audience with the plot. However, in doing so, they rushed every arc, with each arc I think lasting around 2-3 episodes. The dark elements of the plot felt so badly done because they were over before you knew it, and resolved so simply it felt it was never even an issue. The struggles the characters faced didn't really feel that great too, considering the enormity of it all could be ameliorated by the main character, Takeru, taking half your fucking burden. \\n\\n\r\nIndividual episodes also felt stupidly rushed. Without spoiling anything, it's hard to truly explain what I felt while watching the show. I just felt so on edge watching the show, because it was full of climaxes, but no buildup. Often, I found myself watching the previous episode again to understand what on earth was going on in the next episode because everything would escalate so quickly you felt as though you'd missed something. And yeah, the show did miss a lot of the light novel's content.\\n\\n\r\nTo this date, I still don't understand the combat system, and I don't think I ever will unless I read the light novels. All this Relic Eater, witch-hunter, god-hunter bullshit seemed to be just shoved in your face. Then you have your villains that are somehow immortal, and capable of doing just about anything, while screaming \"Hallelujah\" (No kidding, Haunted was a pretty cool villain). \\n\\n\r\nIn terms of characters, I think the villains were pretty badly done. They felt completely irrelevant. That's to be expected for the villains of the individual arcs, but even the main villains, supposedly Valhalla, felt like sidemen. I think this was because we don't even know their motivations, nor do we know their backstories. In other words, you could chuck them in just about any anime as it would still work. \\n\\n\r\nYou've got a couple of enigmatic characters that never got any screentime. (Sougetsu, the strongest Witch Hunter guy, Kusanagi Orochi, etc.) As a result, much of the show is still shrouded in mystery. Even your supposed main protagonist is an enigma. We don't understand their powers, and their backstories are barely touched upon. Heck, even the characters of each character arc might be more fleshed out than the male protagonist. Takeru keeps going on about his sword style but when I watch it animated, it just looks like some overpowered sword arts with no technical aspect to it. \\n\\n\r\nThe romance aspect of the show is also pretty terribly done. Much of it is down to the pacing of the show. Because I think I'm rambling on too long, all I'll say is that characters fall head over heels with Takeru waay too easily. All the \"half your burden\" shit also got a bit stale over time. \\n\\n\r\nIn conclusion, the story and the characters are just as you would expect from a typical action-harem show. You've got your generic characters, a bad main character, as well as a plot full of harem tropes. Most of the cast are unmemorable, in part due to the fact that they receive no development, and are thus easily forgettable. The show was horribly paced, and even the fighting felt horrible in spite of the animation because zero thought was given to the technical aspect of things. Just another light novel series ruined by the 12 episode restriction and lack of detail in content being animated. \\n\\n\r\nArt: 7/10 and Sound: 9/10\\n\\n\r\nConsidering the workload of the animation studio during this season (Rakudai, Shomin Sample, and this), it's quite amazing that the animation quality was still this solid. It was nothing ufotable-esque, but it was smooth enough that the show was still rather enjoyable in spite of the poor story and characters. \\n\\n\r\nThe colours were generally darker in this show, which suited the show well. That said, it was still rather difficult to truly appreciate the animation when the things being animated were incomprehensible. \\n\\n\r\nThe soundtrack of this show is perhaps the best thing about it. Both opening and ending were superb. Like seriously. The lead-in to the music is also fantastic, and it generally suited the show very well. The OSTs were nothing memorable, which is largely why it fails to earn a perfect grade. But still, it was solid especially in fighting scenes. It also brought out the dark tones of the series well. \\n\\n\r\nEnjoyment: 7/10 and Overall: 6/10\\n\\n\r\nAll in all, this was nothing but a forgettable show. Apart from the soundtrack, everything about this show screamed mediocrity. Maybe even worse. That's not to detract anything away from the entertainment value of the show though. Yes, while you may have trouble understanding much of the show due to the lack of detail in it, and the show may feel horribly rushed as a result, you should still be enjoy the action scenes. \\n\\n\r\nI doubt this will be getting a season 2 since it wasn't that well-received as a show, and I won't be weeping tears over that. However, a season 2 would definitely be a big plus to the show as the show concluded rather poorly, with a lot of gaping holes in the plot left unfulfilled.",
            "date": "2015-12-27T05:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 206947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/karrapls",
                "username": "karrapls"
            },
            "url": "https://myanimelist.net/reviews.php?id=206947"
        },
        {
            "content": "It seems that all the anime companies and their mothers decided to go for the “harem fantasy magic school” theme for the Fall season of 2015. It's actually ridiculous how similar a lot of the shows have been and I can only hope future seasons won't be like this. Taimadou Gakuen 35 Shiken Shoutai is another branch of the fantasy magic shows, and while it uses the harem genre to drag in viewers, it's clear it wants to be more like A Certain Magical Index where the fantasy world and characters make up a large chunk of interest. Unlike Index however, Taimadou completely fails indeveloping the world, characters, and interactions and what it ends up being is a haphazard mess of gibberish.\\n\\n\r\nThe anime follows a squad of misfits in a witch-hunting school. The world is terrorized by magic that usually does more harm than good. Takeru Kusanagi is a special snowflake MC and leader of the misfits squad. He uses a katana rather than guns, usually spouting some edgy sword attack (Kusangi Style: Dragon Strike) when he defeats his enemies, which ends ups just being a generic sword swing with name emphasis only there to sound cool. Luckily for the MC his entire squad is filled with cute girls.\\n\\n\r\nI have no idea if the source material is crap or Silver Link decided to butcher it in their poor adaptation. Regardless, the anime quickly rushes past character and villain arcs in a 2-episode formula. The formula is as follows: a female character has her troubles with the past in the first episode, the second episode follows with the MC winning the female over by swinging his sword around in his robo-samurai armor and swearing he will carry “half of her burden”. Every few minutes there will be world building attempts where side-characters attempt to act mysterious by spouting random magic mumbo jumbo (Arthur Pendragon resurrected, philosophers stone, the Esper organization, the Alchemists whatever) in the looming background. The result at the end of each arc is a jumbled mess of a show with half-baked details and gibberish. It seems clear the writer wanted this to be something like Nasuverse or Index, but the anime’s poor portrayal doesn’t make up half of the respective latter worlds.\\n\\n\r\nIt's quite unfortunate because the character themselves have great designs and endearing personalities. They however can’t get beyond general interest in to deep and meaningful characters win because their arcs are horribly rushed.  A lot of the side characters too are likeable but they are quickly forgotten and left in the dust once a specific arc starring them ends. There are also some pretty grim moments from children zombies to clone genocides which would have left a pretty dark impression on the world build, but they are censored and delivered so poorly with the harem hijinks that they feel awkward.  \\n\\n\r\nThe production values are lazy and boring. The animation in fights feel incredibly generic where the MC is swinging his sword left and fight and not an ounce of effort was placed in choreography. I found myself dozing off in the moments that should have had my attention glued to the screen. It's hard to think a robotic-samurai destroying monsters and dueling other robot smaurai with a katana could be boring, but Silver Link manages to achieve that with this lazy production. The music is forgettable and dull.\\n\\n\r\nIn the end Taimadou can be thought of as “what if  A Certain Magical Index” failed. Imagine if  A Certain Magical Index was cut to 12 episodes and each arc had to be rushed in the short time the developers had. The only positive thing I can say about Taimadou is that it has a great cast of female characters, but even they end up being disappointing with their improperly developed character arcs. Taimadou is a show that will be forgotten once Fall 2015 is over and it is a clear example that trying to jump in on what the current popular bandwagon is does not work. \\n",
            "date": "2015-12-27T15:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 207010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/409217.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ryanxwonbin",
                "username": "ryanxwonbin"
            },
            "url": "https://myanimelist.net/reviews.php?id=207010"
        },
        {
            "content": "Mild Spoilers :)\r\n\"So then, let me carry half your burden for you\" That sentence was the meme of the whole series. Chessy/Cute sayings like these are exclaimed, of course in a non-romantic way, (which somehow all the girls fell for), by the MC all throughout the anime as he sets off on his own personal mission to ensure the safety of his new and old comrades no matter the story of their past. Then at the end, it's time for the girls to \"end a shoulder\" on his personal situation. It very much reminded me of Grisaia no Rakuen. \"Which one was better?\" I hearyou ask. Probably this one. And here's why.\\n\\n\r\nThis anime was very good. It was like an updated version of your classic cliche harem. Yes, there is a dense asf, innocentish, well mannered MC. Japans image of an ideal boy. Yes, there is the tit grab on the new tsundere that he just met in the first episode and ofc it takes him years to take his hand off her tit. We are off to a perfect start :/. As the story goes on I realised that unlike most animes, this one actually had an ongoing plot which was interesting. All the mini-arcs they manage to fit in the punny half season it ran for had enough detail, breakdown and character development for me to be satisfied with. There were many well-executed funny moments in this anime, which were really well done considering it isn't a comedy and the masochist side of the MC wasn't visited that often unlike most harems when so I'm glad for that change too.\\n\\n\r\nThe only thing I wasn't satisfied with this anime was the way they finished these mini arcs. I felt that they rushed it a bit especially the last arc. I don't know whether is me, the way they explain or the fact that they are waiting for a second season to explain it ore. Either way, I'll be crossing my fingers real tight for it. It really is a good, funny comedic watch. It's your classic cliche harem but it really doesn't get on your nerves :))) \\n\\n",
            "date": "2018-01-02T12:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 267210,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6832774.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shultz013",
                "username": "Shultz013"
            },
            "url": "https://myanimelist.net/reviews.php?id=267210"
        }
    ],
    [
        {
            "content": "*****SPOILERS....MAYBE****\r\nok let me start by saying that i liked this anime and wont put up this \"Oh look at me i am a proffesional fucking reviewer and ill give a good anime 1/10 cause im retarded\" persona!.\r\nLet let's start by saying that this anime was really enjoyable and i liked it alot. There are some problems with it like them introducing the MC sister...which just comes out of nowhere and just fucks shit up...i would prefer if they build her up and introduce her in like EP 5..because u really dont get enough time to get attached to her.She should be the main objective fromEP 1..but she comes out of nowhere and is the object from EP 7.\\n\\n\r\nI found the picture transitions very good and the music..including the outro song really good! THeve done a very good job on the music n sound in this one!\\n\\n\r\nAnother problem i had with this anime was the ending...the guy was supposed to die because he used that suit or whatever...but he just survived and they dident even explain that...which pissed me off.I was hoping this anime would have a sad ending where the mc dies along his sister..and make a very emotional and powerfull ending...but its just a generic rushed happy ending.\\n\\n\r\nAnother problem is that this is supposed to be a harem romance ecchi anime..but there was fuck all romance exept for the part where the MC says to Ootori \"I will catty half ur burden\" apart from that there isin't much more romance...if u even consider it romance.There was kinda a good setup for harem between MC,Ootori & Mari But that didn't really go anywhere....And ecchi...the only ecchi part was in the beginning and maybe when that older once kissed/teased the MC on later episodes!\\n\\n\r\nIn overall this is a OK anime..but it needs a remake or even a sequal to be perfecto!!!\\n\\n\r\n8/10\\n\r\nKurdo",
            "date": "2017-09-07T10:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 257064,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6337406.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KacGames",
                "username": "KacGames"
            },
            "url": "https://myanimelist.net/reviews.php?id=257064"
        },
        {
            "content": "This show is great example of great ideas ruined by bad execution.\r\nCharacters: The characters are alright though sometimes they have the most clichéd dialogue imaginable. They do become a bit flat once they get forced into the harem plot archetypes. The the villains are terrible. We are never really told what they want except that they are evil and have evil plans. They are so over-the-top evil that they become unbelievable and almost comical. \r\nAnimation and Sound. Sound is fine. The animation is really good minus one really glaring part. Whenever a powerful character (including the main character) transforms the subsequent animation is justawful. Its clunky, laggy, and somehow manages to be worse than the standard animation.\\n\\n\r\nStory: This show has a really interesting concept in an interesting setting. Everything that is needed for a great anime is there. So what goes wrong? The anime is set up really well but fails to have a main plot. The plot ends up being the side-story harem which becomes the major driving force instead of a real substantive plot. This is a disastrous decision as this is the wrong show for that kind of plot development. The universe is too interesting and it feels like the harem diverts our attention from something better. It does try to beef up the harem plot with some ecchi but this show is too serious for that and it feels out of place. The best way to describe it is that it feels like you and a friend are each watching half of a movie but he gets the good parts and you are stuck with the boring, out of context ones. Finally, the ending. While the middle was a poor excuse for a harem, the end is completely different from what happened in the beginning and the middle. It’s a bunch of half-explained concepts that come out of nowhere and completely blindsides you. It leaves you really confused and unsatisfied. It also cliff hangs in a way that crushes any enjoyment that could be had.\\n\r\nIf this show had a start-to-finish plot it would be a great show. Instead it’s a great concept that goes from bad to worse. \\n",
            "date": "2016-04-06T23:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 215731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MadHatter90",
                "username": "MadHatter90"
            },
            "url": "https://myanimelist.net/reviews.php?id=215731"
        },
        {
            "content": "... what am I doing with my life? This is the question I am asking myself after watching this.\r\nThis anime is bad. It had some potential, and its artisic style is not horrible, but ... \r\nHave you ever seen that annoying type of story turn when a villain shows up, and proceeds to abuse and verbally torture weakest character present who usually happens to be a weak defenseless girl (even though there may be people present capable of killing him) and then somehow at the last moment escapes the situation undefeated or evne unhurt? This anime does this often, to the point where it startsresembling Re:Zero level torture porn. (Just WHY, WHY would you let someone spew 10 whopping minutes of verbal abuse when you have a sword in your hand and every moral justification and reason to lop their head off? Why?) Except it is mostly psychological and less frequent. And after psychologically torturing and abusing a character the anime throws the whole thing away, and forgets that it ever happened. There were plenty of those scenes to tick me off... Sigh. I'll add detailed breakdown below.\\n\\n\r\nStory: 2/10\\n\r\nIt had potential, but it devolves  into incomprehensible mess and leave huge number of storylines without any closure. The anime tries to be too many things - from drama to harem comedy, and pretty much fails at all of them. Dramatic parts look cliched and harem/romance part lacks punch/jokes. Lots of interactions out of the blue, occasional Diabolus ex Machine, and that weird fascination with letting vilalins talk too much. \\n\\n\r\nSound: 4/10:\\n\r\nIt does its job, but there are couple of out of place tunes. Decent voice acting, as usual.\\n\\n\r\nCharacters: 2/10:\\n\r\nCharacters  are plot devices without personality. Pretty much all of them. When someones \"arc\" comes up they'll go through several obstacles and dramatic events, but when the arc is over, they pretty much forget that anything of the kind ever happened, and start acting like carton cutouts. Everybody has their own \"quirk\" (like one of heroines having complex about her breast size) they occaisonally display, but in group scenes they're nearly interchangeable with each other.\\n\\n\r\nAlso, the villains in this anime are horribly done. They're \"cartoon\" villain types, plus anybody who is supposed to act as an antagonist usually act like a complete lunatic without any reason or logic. Villains are completely unbelievable.\\n\\n\r\nEnjoyment: 3/10.\\n\\n\r\nI pretty much started to hate it closer to the end, but decided to finish it to see if anything improves. Nope. \\n\\n\r\nOverall: 4/10:\\n\\n\r\nMy advice is to skip it. This anime may fly for young teens or perhaps for someone who haven't seen much anime before, but it is bad and doesn't have anything worth watching.  it tries many things, attempts to bring up an interesting event or two, but nothing ever reaches any conclusion... meaning it doesn't work. It HAD potential, but the potential isn't realized. So, the best idea is to skip it.",
            "date": "2017-04-23T19:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 246189,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=246189"
        },
        {
            "content": "The story centers on a guy who is secretly more powerful than he lets on and his harem of girls who use magical weapons to battle...wait, that describes three different shows from this & last season. This review is for Anti-Magic Academy: The 35th Test Platoon but there may be some comparison to the other two shows, The Asterisk War & Hundred. It's inevitable given all the similarities between all three shows. Of the three Anti-Magic Academy: The 35th Test Platoon is the least memorable and innovative. In fact I had forgotten I'd even watched it until my brother reminded me. That's what doesn't workhere. Nothing stands out, nothing is memorable. Bland cookie cutter characters, blasé setting; vauge enemy. It's too clichéd, to seemingly manufacted. Like literally someone googled the top ten most popular tropes and stereotypes and wrote a series based on the results. No further thought or effort went into the plot here. There's nothing to see here that isn't equalled to exceeded in one way or another by other series. Case in point the two aforementioned anime in this review. Sometimes I have to stop and ask, \"Couldn't I be watching better anime than this?\" and Anti-Magic Academy: The 35th Test Platoon certainly qualifies. Also when it was over, I just moved on to the next thing. It couldn't have been anymore run of the mill; ordinary. Just watch the other two shows I mentioned.\\n",
            "date": "2016-07-06T22:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 223348,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=223348"
        },
        {
            "content": "When I saw the first episode of this show, I was pretty excited. It had pretty much everything going for it: gritty war story, character strewn about in a ruined battlefield, debris and fire everywhere. Something told me it was going to be a cool show, not a very good one, but cool nonetheless.\r\nThen it just fell flat on its face.\r\nHere's a short run-down of the overall premise: magic is common in this universe, and our MC is part of an academy that specializes in fighting the misuse of magic by witches and the like.\r\nCharacters\r\nTakeru - Harem protagonist, usual \"nice\" guy that wields a katanafor whatever reason and always tries to help other people. Has a deep as hell voice that is a stark contrast to the usual harem MCs that sound like women when you don't pay attention.\\n\\n\r\nOthers - Every other character is just the usual lineup of characters from any other harem show: excitable loli big tits, tsundere, kuudere, perverted big sister-type, the one flat chested girl that has a complex about her breasts...\\n\\n\r\nEveryone in the show has some semblance of a backstory, which is at least somewhat good, but the show just tries so hard to pass each of their backstories off as \"deep\" and \"mature\".... Then Takeru comes along and says his trademark \"Let me carry half your burden\" line to them and all is resolved somehow.\\n\\n\r\nStory\\n\\n\r\nThe first half focuses on Takeru and the members of his platoon - the \"35th Test Platoon\" or \"Small Fry Platoon\". Their platoon is so-called due to their abysmal performance in the academy but nothing serious ever really comes out of that, making the whole \"we're the worse team so we should do something before we get kicked out\" thing seem insignificant.\\n\\n\r\nThe second half involves the usual \"the world is gonna end because of X and we need to stop X using the power of friendship\" story arc.\\n\\n\r\nI get that they're really trying to go about with this gritty magic scifi plot, I really do. But it really took it out of me when most of the characters have magical engrish chants and costumes straight out of goddamn Power Rangers - it just does not match what they are selling.\\n\\n\r\nArt\\n\\n\r\nThe art is decent - the characters are mostly modest in design and the backgrounds look good with some looking a bit too stiff. Colours are suitably bright and cheerful when needed, with the darker moments being noticeably grim and dark to match. The action scenes are made with really clunky CG, so the disparity is largely there.\\n\\n\r\nSound\\n\\n\r\nOP and ED are one-note and not very memorable. Voice acting is good as well, you can tell the VAs had some fun with their work. Others sounds sound a little generic but nothing too bad.\\n\\n\r\nEnjoyment\\n\\n\r\nI genuinely had some moments of fun with this show. It may fail in the drama section, but with this being a harem and romance show at the core, I say Silver Link did a decent job.\\n\\n\r\nOverall\\n\\n\r\nWhen it's the holidays or you just have some time on your hands and nothing to watch, then this is the show for you. It doesn't have any hard thought put into its story, making it ideal for a quick marathon and a popcorn flick through and through.\\n\\n\r\nBut hey, who am I to tell you what shows to watch? Take this review seriously or with a pinch of salt, I don't really care. Cheers.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-07-04T20:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 223159,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5021006.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AverageUser",
                "username": "AverageUser"
            },
            "url": "https://myanimelist.net/reviews.php?id=223159"
        },
        {
            "content": "Here's the deal, it's true that after watching over 400 animes it starts to get harder to find more to watch. I do find a lot with potencial and nice art, outstanding voice acting, etc, just like this one. But an anime that treats me like I have brain damage.. it can't grow on me for sure. By the second episode I already knew everything about the anime. I hate anime based on the power of friendship, but most of all I hate anime where the characters just explain everything to us in the 1st episodes. This stops me from watching farther, this because thereare no misteries, I can easily predict everything and I already did, that's why I dropped this anime less than half-way through. I shall thank you if you read so far, i'll keep going. And im gonna give one of the countless examples why Im having difficulties finding another good anime to watch, present in this one. TO avoid spoilers (which is hard since the anime spoils itself but wtv) I'll be rather vague about it. One of the characters activates a special hability, the \"hability talks to her and asks her:\" do you want to use option 1 or option 2?\" , when she answers: \"option 1 ofcourse, doesnt choosing the option 2 means i'll have to \"give up my soul to you?\", if you can't see whats wrong with this, congratz, you wont have any problem finding over 2000 anime to watch. The problem is that, 1st, WHY did she had to point that when both know it already, and 2nd, you can really noticed that she is only explaining it to the viewers like we are stupid. You can ruin anime easily like this. There are a lot of other examples present in this anime and in many others. I do compliment the ones that \"explain\" the \"what's\" and the \"how's\", \"why's\" etc, without having the character say it out loud for us. \\n\\n\r\nIn the end I found myself pissed of so much after dropping a few in a row because of this matter and I ended up writing an anger, but accurate review on many anime outhere. Watch it at your own risk, if you after reading all this, still wanna try it out. Farewell.",
            "date": "2016-03-15T23:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 213029,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1298353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/oddnoise",
                "username": "oddnoise"
            },
            "url": "https://myanimelist.net/reviews.php?id=213029"
        }
    ]
]