[
    [
        {
            "content": "Hitsugi no Chaika is a show of peculiar nature, one based on a fantasy premise but is able to explore in depth of its potentials. The sequel, Hitsugi no Chaika: Avenging Battle wastes no time as it returns with our trio of adventurers. For those who have seen the first season, then it should be known that Chaika, Toru, and Akari are still on their quest to find Emperor Gaz’s remains. But throughout that journey, conflicts arise and dangers lurk in the shadow for the group to deal with. From this sequel, we learn more about their world, characters, and secrets that may invoke morethan just a SHOCKING TRUTH.\\n\\n\r\nAs a sequel, it’s advised to watch the first season especially since this continuation doesn’t recap events. Nonetheless, new events happen which breaks down the barrier of normalcy. While the show still focuses on our main characters, it also doesn’t miss the opportunity to give other characters insight as well whether it’s Red Chaika’s group, the Gillet Corps, or even King Gaz himself. And like a race to win a game, Toru’s group faces competition in collecting the remains. This is where the fun pours in as we see how far they go to get the job done. One thing that the show has been good at doing is evoking entertainment through humor and gimmicks. Rather than just shock value or overly extended fan service, the show cracks jokes between characters at proper timings. This includes scenes relating to the characters or battles. Because let’s face it, without some comedy, the show would end up to become a chore and too straightforward to watch. However, Hitsugi no Chaika seizes every opportunity at the right time to inspire laughter in a good sense.\\n\\n\r\nThe overlay of the story is irrefutably crafted by realizing the setting of its world. In this sequel, we learn more about some of the origins and secrets that unfold when our heroes journey to a mysterious place like never before. What’s more interesting about these secrets is that it also brings question to Chaika’s ultimate goal. While the info dump can be a lot to take in at once, it also makes the show more interesting as we see how the protagonists deal with their newfound knowledge. Of course, the show doesn’t stop to focus on backstories and deliver action-packed moments to keep up with the momentum. It unites themes and buildup to bring about a story unfolded with revelations while mixing in humor at once. Although it sounds hard to accomplish, I would say that the sequel definitely played its cards right. At its best, the story works like a charm as a gift for what fans expect to see. \\n\\n\r\nA decent balance of the pacing is also evident throughout the sequel. While the show has both heavy info dumping and action scenarios, it also makes time to characterize the cast. Although there’s not much change to their persona, it’s easy to see how they fit with the story with credibility. Not only that but new characters introduced also gets their own memorable spotlights. The problem that does occur on occasions is how some parts feel less inclined to fit in with the pacing. However, it’s also simple to see how far the show goes to create a feeling of connection between certain characters. Even enemies can become comrades when the situations calls for it and gives the audience a glimpse at the true nature of our characters. We also can’t forget about the humorous exchange between certain characters such as Toru and Akari. Chaika’s broken speech continues to be a device for amusement. In contrast, characters suffering from their own issues such as Vivi also creates tension and compelling emotions. The endgame here is that characters aren’t just there to fight like chess pieces but all fit together like a puzzle with impressive fashion.\\n\\n\r\nAs the show is called Avenging Battles, the sequel doesn’t neglect action scenes. Whether it’s competitions, training sessions, or fighting for survival, the series pulls out the right combinations for what’s trying to accomplish. Every battle has a mix in of intensity, strategy, and humor. It’s important to mix in these together or otherwise, fighting can become quite stale when it’s all straightforward. It also gets violent too with the blood spilling, limps severed, and deaths that actually occur without teasing. Viewers who are familiar with the first season should already expect this with some of the abilities of our main characters. What never ceases to be noticeable still is Chaika’s Gundo Sniper Rifle. Even though the weapon is about half her size, she uses it with great skill complete with ridiculously long spell incantations. Be rest assured though as the action never dies down by its pacing and is crafted with unique attributes that stand out for itself.\\n\\n\r\nDespite the refreshing story, Hitsugi no Chaika isn’t without flaws. Namely the story, there’s pitfall of fast resolutions when it comes down to the way it concludes certain episodes. Rush would be one word to describe such resolutions. Not only that but the villains involved in them are stereotypical whom are saturated with clichés and generic motivations. Mad scientists, corrupt political figures, and experimental species aren’t new to the anime world. Neither too are mysterious girls with odd-looking eyes. The point is that some of these villains aren’t very compelling or interesting at all. To put it simply, they are just there to move the plot forward as devices with little focus on their characterization. Furthermore, the comedy can be a mixed bag for some people. It can feel repulsive at times with the same repetitive jokes between characters. \\n\\n\r\nBones return as the animation studio to adapt this series and to say the least, they are impressive on the visuals frontier. Characters are crafted well with fantasy tropes such as the case of Francesca, demi-humans, and experimental beasts. Weaponry also offer a variety of factors with relevance. Like I mentioned before, the action scenes are coordinated with strong degrees of fluent movements. It’s rapid and takes away your breath when witnessing it with your own eyes. Furthermore, the fantasy lands of the sequel exploits new places that are memorable. Fan service remains minimal as the show concentrates more on plot rather than exposition of fulfillment. \\n\\n\r\nSoundtrack remains adequate although it doesn’t change much from the first season. We do get new OP and ED songs that retains a similar style compared to the first season. Nonetheless, the OST and character voice mannerisms stand out the most. Unfortunately, some of the new characters can be easily forgotten and only returning cast steals most of the show such as Red Chaika, Francesca, etc. To put it simply, the soundtrack is decent but nothing earth shattering with their voice mannerisms.\\n\\n\r\nConsider this series as a gift for the fans as the show adapts further into our heroes’ quest in an unknown world. What started out as a journey to collect pieces to a puzzle has become a complicated labyrinth of mysteries forged by origins of the characters. While the show doesn’t escape the usual generics with its stereotypical archetypes, it does compel to a more refreshing premise backed up with insightful characters. The intersecting arcs puts characters at angles where viewers can anticipate what will happen. And along with plot twists, there will be moments when you feel as though the show is hiding even more. While pulling off all the risks, this sequel is a must-see not just for fans of the first season but also anyone who is interested in a journey of enthralling fantasy. \\n",
            "date": "2014-12-10T09:34:00+00:00",
            "helpful_count": 86,
            "mal_id": 171671,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=171671"
        },
        {
            "content": "Every once in a while you stumble upon gems amid a sea of plain, gray stones, and to me, Hitsugi no Chaika was one of them. While it was nowhere close to being a masterpiece, Chaika explores certain themes and original ideas that few anime are able to. This action-adventure flick can get a little boring sometimes, but certainly pays off towards the end.\r\nTL;DR\r\nStory: 7/10\r\nArt: 8/10\r\nSound: 10/10\r\nCharacter: 6/10\r\nEnjoyment: 7/10\r\nOverall: 7/10 (rounded down from 7.25)\r\nGood points:\r\n+ Adorable main moe lead (Chaika)\r\n+ Great action & fighting scenes with myriad of magical abilities\r\n+ Huge set of varied and interesting supporting characters\r\n+ Significant plot twists throughout development\r\n+ Excellent OPand ED themes\\n\r\n+ Great animation\\n\r\n+ Good main antagonist (Gaz)\\n\r\n+ Good resolution\\n\\n\r\nBad points:\\n\r\n- Disappointing male and female leads (Toru and Akari)\\n\r\n- Plot development is a bit slow and can be draggy at times\\n\r\n- Some plot holes especially in S2\\n\r\n- Dialogue may seem too repetitive in nature\\n\\n\r\nStory: 7/10\\n\\n\r\nChaika is set in a world where technology and magic co-exist, or rather where magic is seen as technology and \"progressive\" in nature. Also, there exists beasts and hostile creatures called Fayla with magical powers that have been studied to research into magic. While the origins and source of said magic research is not shown, the plot does keep to these believable assumptions and does not deviate from the laws it itself creates. (+1 for believable assumptions)\\n\\n\r\nThe story is split into 3 main arcs spanning across two seasons. The first, being the \"remains gathering\" arc, the second being the \"Niva Lada arc\", and the third and final one being the \"Martial Arts Tournament arc\".\\n\\n\r\nThe story starts off with Toru rescuing Chaika from some hostile Fayla, and already you know you're watching an action flick. It doesn't take long for the audience to realize that Chaika is completely clueless, knowing nothing save for the fact that she wants to collect her father, Emperor Gaz's, remains. Toru and Akari are then hired by her and thus begins a long journey of collecting said remains throughout the first half of series (up to Avenging Battle).\\n\\n\r\nApparently, we are told multiple times, as if the writers were afraid we'd forget, that Emperor Gaz's remains contain great magical power and we constantly get the feeling that Chaika should be looking more into her lost memories and that as they collect more and more remains, that they are making a mistake and are inadvertently going to bring disaster somehow. (+1 for interest) The story alludes to this by the introduction of Guy, a mysterious informant who does nothing but conveniently tell them where the remains are, yet answers none of their questions as to why Chaika is gathering remains. Chaika's reason was for \"Father's funeral\".\\n\\n\r\nAlso, from the beginning we are introduced to the Gilette squad, whom we already get the feeling from their general aesthetic that they are protagonists alongside Chaika, despite them seemingly trying to stop White Chaika's group from gathering more remains, with the goal of \"averting disaster\" or the coming of another war. This same idea that the remains could start another war gets constantly repeated and perpetuated that it would come to no surprise that it would indeed start another war - the only question remaining is how it would do so.\\n\\n\r\nThe Gilette squad though, while only being supporting cast, actually plays a huge role in this plot. They managed to uncover the secret of Gaz's empire from rumours heard by townspeople who saw large fortresses flying around many years ago. They were also instrumental in helping White Chaika and her gang multiple times along the way.\\n\\n\r\nWhen we hit halfway into the first season, we get introduced to Red Chaika, who's completely different from our White Chaika, but who's also after the emperor's remains, just for a different purpose - Revenge. And that's where things start to get interesting. The story thrusts us into a realm where many things could be possible, and succeeds in making the audience curious beyond measure, asking questions like \"Why are there so many Chaikas collecting remains?\" and \"Who's orchestrating all this?\" but it continues to keep us in constant suspense.\\n\\n\r\nTowards the end of the first season, there's also the introduction of another Blue Chaika, one who gave up completely on her mission of finding remains after finding out the truth that she was just a tool. She instead decides to help two fools in a quest to start a war by killing innocent girls for their memories as a form of magic fuel for flying fortress Soara. After the destruction of Soara, Vivi from the Gilette team turns into a Chaika herself, making the audience even more startled. \\n\\n\r\nMeanwhile, aside from the trio's adventures, there are also multiple scenes of The Alliance of Six Nations discussing whether or not they should take military action against a certain party, and this discussion kind of goes on and on throughout the anime, and even though no decision can ever be reached, most of the parties simply take independent action and launch their flying fortresses anyway - hence completely making every one of these scenes irrelevant, save for Konrad's updates to the Gilette Team.\\n\\n\r\nMost of the first arc felt rather slow and repetitive, it was all about infiltrating some location, housed by some hero who defeated Emperor Gaz 5 years ago, and this hero took one of his body parts as a reward. After getting the remains and the trio would, every single time, question themselves as to why they are getting remains in the first place - to which Toru will always answer \"Let's just do it because we can.\"\\n\\n\r\nThings start to clear up when we hit the second season, in the second arc, when White Chaika gets word from Guy to get her \"father's fortune\" on a secret island off a coast. As revelation upon revelation about her own past occurs, first from the Kraken Fayla who told her about her use as merely a tool to collect the remains and unlock a \"destiny\", and second from Iszmash, the wizard who carried out Gaz's dying wishes in creating a super powerful Gundo (magic weapon) - called Niva Lada. (+1 for plot development)\\n\\n\r\nAt this point of the story, it also begins to explore themes on whether Chaika was merely a \"tool\", akin to Niva Lada's role, in the story. Throughout the anime Chaika has been performing a role as a tool, and eventually, is revealed to simply be the \"magic\" that Gaz himself created to revive himself, but at the same time we can see that Chaika is more than that - despite being young and innocent, she has a personality, stubborn and all, and so does Niva Lada, and this autonomous nature of personality becomes a key driver of the plot, though it's a pity it only appears in the last episode. (+1 for depth)\\n\\n\r\nAlready we start to see snippets of how the anime is going end, and in the final arc, the Chaikas begin to gather at the principality of Hartgen, where it seems to be all part of a Black Chaika's plan to get all the remains at one place. After some long action, fighting and random duels, the Black Chaika finally managed to blackmail / steal from all the other Chaikas to finally get a hold of all the remains. At first, we are inclined to think that Hartgen was the perpetrator, but the plot gives a twist again - that it was instead Gaz who had all along planned his reincarnation. (+1 for plot twist)\\n\\n\r\nThen again, this twist was very well substantiated because honestly there were clues littered throughout the entire anime, and for the simple fact that gathering a magician's body parts together in one place was obviously going to revive him. Anyway, Gaz reincarnates and is able to acquire this huge source of magic power, and with Niva Lada in his hands, looks basically unstoppable. Specifically, the reveal of his pre-made satellite technology used for gathering feelings of people for magic fuel, was very ingenious, original and breathtaking to watch. (+1 for originality)\\n\\n\r\nToru goes on a suicide mission to defeat Gaz that we already know will fail, but enough about him because honestly, Toru sucks. Chaika ends up being the main hero of this story, and in a very fitting way - by recognizing Niva Lada as a \"person\" - and to saying the final line that she had been saying all along. The line that I found mostly repetitive and annoying throughout, but at the end giving the most fitting finishing line before killing the emperor with his own weapon, \"Father, funeral.\" That has been her objective all along, also making her the only Chaika that was able to kill her own father. (+1 for plot twist)\\n\\n\r\nWhen it comes to coherence though, the plot also suffers a bit as well.\\n\\n\r\nThroughout the first season, Toru and Akari continuously insist that it's okay if Chaika doesn't know who she really is, so long as she completes her objective. This is completely stupid and against common sense, especially when there are multiple Chaikas around. Even if they are task-oriented people, Saboteurs should at least have enough common sense and intuition to realize the importance of knowing how she got her objective in the first place and where she comes from. What if Chaika was brainwashed by bad people? Could they not have at least considered that possibility? I find it stupid that Toru and Akari make no effort to investigate and find out who Chaika really is - even Gilette did so, and all Gilette needed was to have one encounter with Chaika to set him thinking on the right track!\\n\\n\r\nIn episode 3 of S2, Toru's adamant insistence, that finding Gaz's remains is more important than Chaika's wish to see her father's fortune on the hidden island, is invariably stupid. Didn't Toru say before that a Saboteur's objective is his master's objective? If Chaika really wants to go to the island, what right does Toru have to convince to change her mind? In fact, why is Toru so fixated on this collection of remains when all he's doing is supposedly following his master's wishes? As a good saboteur he should be supporting Chaika when she said she wants to find the island. At least towards the end of the episode, Akari points out this contradiction between Toru's words and the \"law of Saboteur\" that he claims to live by, but I'm still penalizing for this under unreasonable character behaviour.\\n\\n\r\nAlso later on in the episode, Toru suggests that the reason why Clay Morgan didn't sell off the remains despite not wanting to be near them, was because he thought he would be cursed if he got rid of them. How does this make sense? If anything, it should be exactly the opposite - he should be scared of a curse if he kept them!\\n\\n\r\nIn episode 7, Toru and Akari are seen using these wooden snorkels to dive. Despite having these snorkels though, their heads still resurface when they need another breath of air. What's the point of having those snorkels if you're going to end up resurfacing anyway? Isn't the whole point of it supposed to keep you slightly more inconspicuous as you breathe through the snorkels, just slightly below the surface of the water?\\n\\n\r\nIn episode 9, we see the Chaikas being forced to battle it out in a duel orchestrated by the Black Chaika, whose goal was to capture White Chaika and force them to hand over the remains. Not a bad deal, but then why also capture Vivi who didn't have any remains? For entertainment? Also, Gillette's memory erasure was never fully explained. Why is it that only when his hand got cut off did his memories come back to him?\\n\\n\r\nAlso, the mystery behind Guy is never really fully explained. He seems to have mind controlling powers as we see in the scene where he saves Gillette from death by ordering all the soldiers around him to surround him using their bodies to protect him from the magic blast. He also seems to have multiple forms of himself towards the end. If Guy was really Gaz, as was suggestion by the similar voice and hairstyle, how did Gaz managed to create Guy? In fact, what's the point of having a human body if Gaz could simply use all his magic through Guy? Guy was basically invulnerable by all his appearing and disappearing.\\n\\n\r\nSo a total of 6 plot holes, unfortunately I can't give a bonus point for coherence.\\n\\n\r\nArt: 8/10\\n\\n\r\nAnimation: 3/3 - Very well done. I loved all the Gundo animations when magic was being used, and all the action scenes were very well animated.\\n\r\nAesthetics: 3/3 - Excellent. Character designs were very varied, many different outfit and hair colours, very pleasing to look at. Even the Fayla designs, demi-human designs were pretty good.\\n\r\nOP Sequence: 1/2 - I didn't really like the first season's one, but the second season had really nice OP sequence\\n\r\nED Sequence: 1/2 - Just beautiful with the wonderful designs. I liked S1 better than S2 ending sequence.\\n\\n\r\nSound: 10/10\\n\r\nOP Theme 1: 2/2\\n\r\nED Theme 1: 2/2 \\n\r\nOP Theme 2: 2/2\\n\r\nED Theme 2: 2/2\\n\r\nBackground Music: 2/2 - They also use the same music for most action scenes, and all the sinister scenes, but it's really good :)\\n\\n\r\nIt's amazing that all of the themes are just good - all catch and upbeat, exactly the way I like it!\\n\\n\r\nCharacters: 6/10\\n\\n\r\nThis section is probably where the anime may suffer a bit. We'll go through with the best characters, followed by the worst characters of the lot, from both protagonists and antagonists.\\n\\n\r\nMy favourite character definitely has to be Chaika Trabant. While all the other Chaikas are all cute, moe and pretty awesome as well, Chaika Trabant is like the epitome of innocence and cuteness. Her cheeks are always permanently blushing with that red tinge and she is voiced very well with that cutesy voice. She's a magic user so she has basically like a gazillion useful spells up her sleeve, and her stubborn and helpful nature means that she will insist that they save people along the way, like the demi-humans, even if they aren't necessarily part of the objective (+1 for cuteness, innocence and sincerity, +1 for magic usage).\\n\\n\r\nThe second best character would have to be Gillette. Despite being relegated to a supporting cast member, Gillette shows a high sense of duty, honour, responsibility, and also lots of courage and bravery - being able to stand up to an entire army, risking his life to save his friends, Viva and Zita in the Soara arc (+1 for bravery). He also shows us that he can think on his own and goes to research about Gaz and his connection with Chaika. Unfortunately, being a supporting cast meant that he doesn't get much screentime and despite playing a key role in the plot, is not developed any much further beyond that. But he's still very likeable as a character.\\n\\n\r\nThe other character worth special mention is Gaz himself, the main antagonist of the story, later revealed. He's a not the simple villain type role who only seeks destruction around the world, he merely uses war as a means to further magic research, to gain magic fuel, as well as power to rule over the entire continent (+1 for deep motives). While he may seem inherently cruel, and throughout the anime stays shrouded in mystery, he's also actually contributed lots to the progress of society with his research of magic tools, so perhaps he's not such a bad guy after all.\\n\\n\r\nLast but not least, the character that shows the most amount of growth through the anime is actually Vivi, the girl on Gillette team who not so secretly likes Gillette. At the beginning, she doesn't show much development, she was just portrayed as shy, and a bit like a tsundere-type, but once Gillette is reportedly dead by Leo, she transforms into a chaika herself and starts making things happen on her own rather than always clinging on to Gillette. Her determination really starts to show, and even though Nikolai was given mantle of leadership, it mostly seemed like it was Vivi who was the most influential in the group (+1 for character growth). It was also a pity that we didn't get to see more of this beautiful supporting character.\\n\\n\r\nNow we come to the rather problematic Toru and Akari. Sure, they are both good fighters, but beyond that they are nothing special. Their Iron-Blood Transformation was supposed to make them faster and stronger, but in almost every battle they end up just being on par with their opponents, hence making them actually physically weaker or making the transformation have so little effect that it's technically useless.\\n\\n\r\nToru is a major problem in this anime and it's a shame that he was given they main character role over others. Toru's main flaw is with his narrow-mindedness and ability to only think about the objective, following the \"Saboteur's Law\" which Shin has constantly reminded him that he isn't cut out to be a saboteur in the first place. Toru makes countless of annoying references about being a Saboteur, and while it's great to see that he has fervent loyalty to Chaika, his loyalty is also baseless and he fails to substantiate anything he does with any reasoning beyond \"It's my duty.\" Even at the last part when he goes on a suicide mission, it was simply for revenge on Gaz for calling Chaika just a tool? I mean, really what gives with this stupid male lead?\\n\\n\r\nThen we have the other stupid female lead, Akari. Akari is slightly more interesting because at least she has this brother complex that makes her say weird and inappropriate things about Toru, things like being wet, preying on girls and so on, but her character also fails to pull through. She maintains only 1 kind of facial expression throughout the show and I've honestly never seen her smile, cry, laugh or anything of the sort. She seems devoid of emotions and her character is reduced to nothing but \"brother complex\", which is very sad for one of the main characters.\\n\\n\r\nLuckily for the anime, it's saved by it's host of very varied and interesting supporting cast members like Fredrica, the adorable dragoon, Zite, Nikolai, Claudia the vineyard manager and even the whole of Chaika Bogdan (Red Chaika)'s group. All of them are just a really great cast that made the story a whole lot more interesting and enjoyable to watch. (+1 for variety of supporting cast)\\n\\n\r\nSo as a whole, the characters are mostly fine, save for the main characters Toru and Akari, whose backstory was pretty okay save for the fact that it didn't get any proper character development whacked into them somehow. This is a first for a set of main characters who have a backstory to have so little and so trivial development. Just a complete disappointment.\\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nThe suspense for this anime, despite it not being a mystery show, was pretty good and they managed to keep it up all the way until the Niva Lada arc, which by that time, I was honestly thinking the resolution was going to fall flat on it's face due to the number of unanswered questions, but eventually the anime delivered so I'm giving it a point. (+1 for suspense)\\n\\n\r\nThe action sequences in this anime were also very good from start to finish. Every episode had a good action scene in them and it was also using a combination of interesting magic spells coupled with saboteur-fighting, plus throw in a dragoon and you've got a great fight sequence (+3 for action).\\n\\n\r\nThere was also some parts of humour in the show, particularly with Akari's completely inappropriate and spontaneous comments that came out of her brother complex, every time that Toru gets wet or has to go with Chaika. Red Chaika's interactions with Toru when she was captured was also rather funny to watch. (+1 for comedy)\\n\\n\r\nAs for pacing, the story started off really slowly, with not much going on and the plot hardly progressing beyond collecting more remains. At this point, things and conversations could get so repetitive that it was tempting to just skip to where more key plot lines were being uncovered. Towards the middle, even as things were being revealed, it also took a really long time, with Blue Chaika (Layla), the Kraken, Iszhmash and finally Gaz himself to tell Chaika that she was a tool before it finally hit her. The good thing was, at least the story didn't end abruptly, and the resolution was pretty much complete. (+1 for satisfactory resolution)\\n\\n\r\nThis anime receives a bonus point for not having any filler episodes! (+1 bonus point)\\n\\n\r\nOverall: 7.25/10\\n\\n\r\nHaving watched Shingeki no Bahamut (an anime with a very similar plot line) before this, I was really expecting to be disappointed at the resolution. Fortunately, I wasn't, the anime resolves all the conflict in quite an amazing fashion, tying up most loose ends, and wrapping up a plot that had much fewer plot holes than that of Bahamut. Another key difference is that while Bahamut's forte lies in the exquisite nature of Favaro, the hero, Chaika's forte lies in the innocence and sincerity of Chaika, the tool. While both animes may seem similar, I ultimately enjoyed Chaika better than Bahamut, owing to a more consistent plot that had less plot holes overall, and a much better antagonist.",
            "date": "2015-03-19T01:57:00+00:00",
            "helpful_count": 59,
            "mal_id": 182682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=182682"
        },
        {
            "content": "Ha ha! man! this show got even more awesome! \r\nThe animation along with the intense amount of action was almost flawless! Thrilling! exciting, I mean the overall quality increased, and you can tell that the animators had themselves a jolly good time working on season 2.\r\nThere were so many things that I liked first one being that the main story is finally a clear as to who or what Chaika's are. Along with the main story that back-story that I've wanted has finally been explained too! because there were a few more questions I had as to why there were so many chaika's and honestlyit started to ruin my experiences however after getting the explaining I'm okay with it. The story was so interesting to the point where I marathon-ed both seasons 1 and 2 via Crunchyroll and knocked both of my reviews out today! that's how great it was. The amount of action is the strong point of this series. There should be no disagreement with this. It's like everything comes down to this finally conclusion where both Chaika's and squad has to complete their goal or fulfill their purpose. Now, biggest problem I had with Season 2 was that there were way too many damn Chaika's. It really got annoying after some times. I mean I know it's part of the story and all but there is a limit to how many of the same characters I can take. After more than 3 were confirmed I was saying to myself \"oh god dammit all.\" The ending was okay, I'm not going to spoil it but it is a bit of a cliffhanger... kind of. \\n\\n\r\nOne thing I said in an earlier review that I thing I now regret is saying that Chaika's speech pattern is annoying. Once I got used to her, her speech became really cute! CHAIKA WANT, SEASON 3, NOW! I'd also like to take back the comment about her seiyuu too... my bad. Moving along from those comments, my comments etc. With this seasons, I liked seeing new characters, that weren't Chaika just thought I'd add that again. Because while most of them were not of significant importance to the story, they still provided enough entertainment for me to enjoy. Examples of course the tournament on episode 7 and onward to final boss.\\n\\n\r\nMoving on finally to the soundtrack it was pretty nice. I said and keep to my word that the music helps improve the dramatic battle sequences. The OP and ED songs were not that interesting to me. I didn't r\\n\\n\r\nReally care for the songs again this season. So I don't have too much to add on that setting.\\n\r\nEnjoyment 10/10 I love watching shows that keep me entertained more than keep me waiting. Some shows that I like will let drama build and build then deliver its good. However Chaika it's almost nonstop in your face action.. Gosh the last sentences sound kind of lewd, don't they? Hmm anyway Overall I have to give Season 2 8/10 because it was phenomenal in many ways!",
            "date": "2016-04-18T11:37:00+00:00",
            "helpful_count": 33,
            "mal_id": 216645,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=216645"
        },
        {
            "content": "I waited till the whole anime was over. Warning! It may contain spoilers. I try not to.\r\nThe anime is done now. I don't know about the manga. I was pleased by the first season and more excited by the second season. The story was good through the whole season except the last episode. It felt like easily done, we don't have the time to make it perfect. But still the rest of the anime make it all a good fit. I wished to see more of the battles for the remains of the emperor. \r\nThe characters where nice. I wished to see a lot moreChaikas around the anime instead only the last episodes. The story contains only the white Chaika and sometimes the red Chaika. But through the story you hear that there is a lot of Chaikas. So why only those 2 mainly and the black one with her puppets in the end? A little dissepointed though. The other characters where avarange. The Gillette Sqaud was on 3 people a little in detailed. I am talking about Gillette ofcourse, Vivi and Stora. The others of the sqaud you know the names and that is basically it. Toru, Fredirika, Chaika and Akari was where the anime was over. You know them good at the end. You know what they were going to do.\\n\\n\r\nLike I said. I like the anime. That's why Enjoyment is a 9. Story is an 8. Character ( Toru, Fredirika, Chaika and Akari) also an 8. Art was very normal so but still okay same as sound both a 7. Overall it is still an 8. \\n\\n\r\nI would recommend this anime. If you love an adventure, some weird humor, a dragon and magic. And that you are okay with pieces of the human body.",
            "date": "2014-12-13T02:01:00+00:00",
            "helpful_count": 28,
            "mal_id": 171995,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/518989.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KingdomHeart",
                "username": "KingdomHeart"
            },
            "url": "https://myanimelist.net/reviews.php?id=171995"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nA famous piece of music contains the line, \"War, what is it good for?\" And the response is, \"Absolutely nothing.\" War brings about destruction, famine, despair, and global bloodshed. While not technically nothing, it's definitely something that shouldn't be desired. Yet, for some people, war, or to a lesser degree, violence, is just in the nature of their hearts. Some describe war as an inevitability, while others still attempt to thwart such onslaughts. Hitsugi no Chaika: Avenging Battle is a mix of the two ideas, a mix that is a significant step down from the original season.\r\nSTORY\r\nAvenging Battlecontinues where Hitsugi no Chaika left off. Toru, Akari, and (of course) Chaika are still looking for the remaining body pieces of Emperor Gaz, Chaika's father, in order to fulfill Chaika's wish of providing him a proper funeral.\\n\\n\r\nThe first season did a lot of things right: an intriguing world, fun cast of characters, and a journey with a seemingly peaceful end-goal in mind. For all intents and purposes, the second season is no different. It's more of the same cast doing what they can to achieve Chaika's dream. However, whether it be the journey coming to an end or the rather strange plot points, it just doesn't feel quite the same. The narrative mostly jumps between differing locations in order to provide us with new information in order to make the story seem coherent. That is, instead of Toru and Akari investigating this world and getting to the bottom of the mystery, they are sort of forced to just \"go with the flow.\"\\n\\n\r\nThis \"flow\" is quite choppy. Many of the plot points that occur are either left unexplained or never seem to hold much substance: Gaz's fortune, Guy's omnipresence, Vivi's transformation, etc. Now, the argument here is that most of it can just be attributed to \"magic,\" but that's a rather contrived excuse to avoid providing reason to many of the occurrences. Much of the fault lies with the abysmal ending. Where the majority of the show leaves things unexplained, the conclusion leaves many open-ended areas. This includes for many of the characters as well as the story as a whole. Perhaps the idea is to continue with an OVA or movie of some sort, but as it stands, this season is entirely incomplete.\\n\\n\r\nTrying to dig deeper, and linking back to my introduction, the show tries to look at the idea behind war and whether or not it can be prevented. To an extent, it does this moderately well. Overall, Chaika is a story about war. It's effect on society, the environment, and on the future of the people involved. The show's answer to stopping violence is with more violence, and while that may seem silly, it works. While people may want or wish for violence to just up and stop with peaceful protest all of the time, there are instances when resorting to such measures is unfortunately necessary. Avenging Battle provides such a setting to demonstrate this idea, and while the inconsistent story telling tends to get in the way, this idea is not lost in the process.\\n\\n\r\nANIMATION\\n\\n\r\nAvenging Battle maintains the same art style that was employed by its first season. The character designs themselves are generally well thought out, with each of the Chaikas having a particular allure to them due to their hair and personal coloring. Toru, Akari, Frederica, and the rest of the cast are also unique enough to be distinguishable.\\n\\n\r\nOf note are the settings involved. Invisible, off-shore islands, a foreboding castle, and local towns provide great fantasy locations that lend to the overall atmosphere.\\n\\n\r\nFinally, the actual animation involved is usually above average. The fights are easy to follow during duels, there exist both large and small scale battles, long-range skirmishes, and air-raids. In other words, there is no shortage of opportunities for the anime to show off its animation skills.\\n\\n\r\nCHARACTERS\\n\\n\r\nThis time around, Avenging Battle sadly foregoes character development in order to focus on the story, and since the story became a mess, the characters are incapable of picking up the slack.\\n\\n\r\nPerhaps it's best to start with Toru and Akari. At this point, we know who they are: Toru is level-headed and looking to perform his job to the best of his ability, while Akari is trying to find the inside of her brother's pants rather than trying to find the next Gaz piece. As they are, they're fun people. Akari is more or less relegated to the sidelines this time around, which I can forgive. However, Toru is placed in a strange spot. His wishy-washy feelings toward Chaika and his general lack of emotion are never given an opportunity to flourish. He is literally just there to be Chaika's guard rather than become someone interesting.\\n\\n\r\nOne of the biggest disappointments comes from the final antagonist, who is not too terribly hard to guess. The build-up his immense, and the pay-off is extremely lackluster. Around for less than a single episode, his purpose is to present the message talked about earlier, that war is a cycle that will never truly end. The issue with him is that he is way too much of a final boss. Beyond over-powered, his capabilities as a person were beyond anything the show had to offer. And his quick defeat has zero impact because of his lack of presence. This is odd, considering his \"presence\" throughout both seasons. But this almost had to happen when considering his aforementioned powers; he is so strong that if not dealt with immediately there would literally be no more Chaika.\\n\\n\r\nFinally, and since her name has been mentioned enough already, Chaika at least tries to support the cast. Per usual, her broken speech pattern, bright whiteness, and gundo are back. One thing that is missing, however, is the cute Chaika of old. This is mainly due in part to the tonal shift of the show going from adventurous to arduous. The show becomes more serious, and with that, Chaika loses part of her charm.\\n\\n\r\nPart of her development for this final season was to have her come to the realization of who she actually is, since that was a rather important question and has been for a long time. Such questions are finally answered, and for a time it seems as if Chaika learns and grows from the revelation. However, the show doesn't really allude back to such facts, and when it does, it seems as if Chaika actually hasn't developed at all, maintaining the same reaction and shock from the first time. Even right up until the end, the idea of who she is as a person isn't looked at with enough light to warrant her a well thought-out character, which is a huge disappointment considering everything she's been through.\\n\\n\r\nSOUND\\n\\n\r\nThe OP has the same feeling as its season one counterpart, with the vocals and hard guitar taking the lead. The song gets considerably better when it picks up at around the half-way point, and ends on both a literal and figurative high note.\\n\\n\r\nAs with the OP, the ED pays homage to the first season. The soft singing and ambient instruments give an eerie tone that fits nicely with the atmosphere of what goes on within the anime. It is also quite catchy in certain sections.\\n\\n\r\nBoth the OP and ED, however, are okay at best and are really not standalone pieces.\\n\\n\r\nOddly, I find the soundtrack to be stronger than the OP and ED. Of special note is the fast-paced, stepping piece that usually plays during tense fight scenes. It makes the viewer feel that much more engaged with what is occurring on-screen.\\n\\n\r\nAs for voice acting, Chika Anzai (yes, not \"Chaika\") performs nicely as Chaika once more, giving her the iconic voice and speech we all know about her today.\\n\\n\r\nENJOYMENT\\n\\n\r\nThe anime itself had to make a tough choice, and that was deciding to split up the content into two separate seasons. The way it all goes down, I believe that this was an incorrect decision. The ending is rather lame and what goes on in the middle is too grandiose or nonsensical to work. Only the beginning arc of the second season felt like it belonged. There we had nice character interactions, more history about the world, and some of the more interesting battles. Afterwards, it felt more like the show was trying to feed us as much information as possible to make us satisfied.\\n\\n\r\nAkari and Chaika are some of the main reasons for why I liked watching this one all the way through. Their personalities and way of acting never really got old (at least, when they were being true to themselves), and same goes for Frederica. Sure, she is a huge convenient plot device, but I enjoyed having her around when she was needed the most.\\n\\n\r\nMaybe given a few more episodes or at least some type of continuation can we call Hitsugi no Chaika: Avenging Battle fulfilling. But when everything wrapped up, it just didn't quite live up to its predecessor.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, inconsistent, terrible ending, lost message\\n\\n\r\nAnimation: Good, fantastical setting with a plethora of fight scenes\\n\\n\r\nCharacters: Bad, lame final antagonist, weak main cast\\n\\n\r\nSound: Fine, okay OP and ED, okay soundtrack, fine VA work\\n\\n\r\nEnjoyment: Fine, felt like \"no Hitsugi no Chaika\"\\n\\n\r\nFinal Score: 4/10",
            "date": "2014-12-10T13:13:00+00:00",
            "helpful_count": 23,
            "mal_id": 171697,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=171697"
        },
        {
            "content": "Hello everyone!\r\nI was expecting much from this season of Chaika, after I finished watching the first season expecting much from the second and was great.\r\nThe story of getting the remains of the parents has been fine integrante, namely because they had other Chaikas, the battles, music (the opening fabulous), well designed characters, I love Fredrica :3 ,and art make this anime in my opinion one the best of 2014.\r\nI would have given it a 10/10 but I feel that some things were in the air (must watch the anime and you will realize) and just 10 chapters seemed a final very forced. \r\n9/10 Recommended 100%\r\nthankyou for reading!!!",
            "date": "2014-12-20T19:34:00+00:00",
            "helpful_count": 21,
            "mal_id": 173339,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1816167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/titoman12",
                "username": "titoman12"
            },
            "url": "https://myanimelist.net/reviews.php?id=173339"
        },
        {
            "content": "Anime...Hitsugi no Chaika: Avenging Battle....now finish, man I'm speaking like Yoda, here, anyways the season 2 is finally over and for that I'm gonna make my review.\r\nStory\r\nWhat we have is basically a continuation of the previous season where a Chaika finally accomplishes her mission....of course it was in a indirect situation where she has to fight to gain possession of Arthur Gaz's parts and like any quest it has to end. What I like about the story of this anime is how she keep her goal to bury his father's remains which of course it ended in a very good climax despite of the rush,and oh when she did say \"bury\".....well it doesn't always mean that has to be on the ground, it can sometime be by fire. Ok, so it was rushed, who cares? as long as we see Arthur Gaz's demise and to me, its an 8 for the story.\\n\\n\\n\r\nArt  \\n\\n\r\nTbh, I just have nothing to say about the art of this anime, in fact I don't even care if the cast would wearing school uniforms. I'm just after the content. But I do have some issues with Chaika Trabant's eyelash where I find it to be too ugly. My verdict for the art, a 5.\\n\\n\r\nSound \\n\\n\r\nI find Chaika Trabant's voice very cutsey and so as Toru's voice, but not with Akira's voice since it kinda project a more mature tone given that she is younger than Toru, it would have been much better if Saito Chiwa did Akira's voice rather than Hara Yuko, also I kinda like  Albéric Gillette way of speaking since it establishes authority with honor, so its a 7 for this part.\\n\\n\\n\r\nCharacter\\n\\n\r\nHummmm, well let's see, I don't like the way as to how Chaika Trabant was portrayed as this character who speak like Yoda, where the sentence violates every grammatical rules, ok , so the way she speaks was a symptom of having to use her magical power, where every time she uses it she loses some of her memories, but does it have to affect her speech? Lousy, its not just Chaika Trabant, but also Chaika Bohdan, I can help but notice as to why it was only limited to the two, where there are other chaika's who seemingly speak normally. Also, I hate the fact that Chaika Trabant is the only one who has to hand carry her coffin, I mean, wtf was going on in mind of the original creator,  Sakaki, Ichirou for having her do that in the manga, anime or LH? For all I know since he could have had the main character, Chaika Trabant have the ability to magically put her baggage in some kind of magical portal where she can pull it out when needed, also the two other character like Toru and Akira, whom  Sakaki, Ichirou has them portrayed as \"Saboteurs\", now I don't know if he's trying to have some fun of his low vocabulary IQ or if he is just too chicken to use the term \"assassin\" for Toru and Akira since basically that what the two does. Now let's go to the two \"Saboteurs, Akira and Toru, at first I'm annoyed that those two always get to have the upper hand over their opponents, however my mood for them has change when the two were finally got owned on the few remaining episodes which kinda provide me with such enjoyment, frankly I hate the fact that they are called \"Saboteurs\" where in fact the term \"assassin\" would have been a better fit for the two, since that what they really do. Now ever I've started watching the 1st season I've always like that those two \"Saboteurs\" would be owned by the  Gillette Corps, but alas, it didn't happen and it would have to be Shin Acura who has to owned them, so for getting to owned Toru and Akira, I'm giving this part a 8, which btw the score is for  Shin Acura.   \\n\\n\\n\r\nEnjoyment and Overall\\n\\n\r\nIt was a good 10 episode, where it has some degree of development and the fact that the Chaika Trabant was able to do what she has to do, where it was too bad for Arthur Gaz who seemingly didn't saw that a Chaika's task can go both ways where he was revived and in the end met his demise in the hands of the same Chaika whom he deemed as a tool and that makes it enjoyable. Though, it is very good I still can't deny that the last episode was rushed, so overall it a 7 all the way.  \\n\\n\r\nReview..finish..no more...to say.",
            "date": "2014-12-11T11:11:00+00:00",
            "helpful_count": 14,
            "mal_id": 171803,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4212159.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tres_Bandidas",
                "username": "Tres_Bandidas"
            },
            "url": "https://myanimelist.net/reviews.php?id=171803"
        },
        {
            "content": "There seems to be a trend going on with anime these days.  With any show with 13 episodes gets a sequel, there always seems to only be an allotted 10 episodes for the sequel.  I dunno why.  Anyway, real introduction time.  Chaika, Chaika, Chaika.  When a word is said over and over again, it is said that it will lose its meaning eventually as the same syllables are played over like a broken record.  But what happens when you put a little something...more into a word's meaning, hmm?  \r\nStory (7.43/10):  The story of Hitsugi no Chaika: AvengingBattle stays relatively the same as its predecessor in terms of main story which is to gather the remains of the Emperor Gaz.  Our protagonists Toru, Akari, and of course, the Coffin princess herself, Chaika, continue their task in finding the severed remains of the emperor that befell the Allied six nations to war.  \\n\\n\r\nWhat I've always liked about the Chaika series is just how unique it is.  The story of Chaika has always played out as a sort of fill in the blanks game where after every piece of the Emperor is obtained, more and more of the story is unfolded.  The first season benefited highly from this storytelling perspective because it never revealed too much or too little with every bit of story it was giving.  The second season does continue this format of giving the crucial backstory to our main characters while progressing the plot.  \\n\\n\r\nWhat I also feel is beneficial about this sequel is also from a difference perspective.  While the goals that the characters try to achieve with every arc are virtually the same, the settings and individual arc storylines are different enough in terms of setting from one arc to the other to give off a different feel as to what the characters have to do in order to accomplish their goals.  \\n\\n\r\nAnother point I have to make is magic.  Magic is a very subjective term in anime because it has a wide variety of terms and spectrums that pertain to individual series.  It can either be total wands and spells like Zero no Tsukaima, or it can be based on the complicated theorems and terms that can break our heads like Mahouka.  Chaika achieves what I believe is a perfect balance of both complexity and \"fuck it, it's magic\" because  it logically make sense in the world that they're in.  Not to mention that it's centrally tied to the story which as an end result forces out more explanation and thus, and easier understanding.  Plus, they use freaking sniper rifles to fire magic.  That is awesome.\\n\\n\r\nHowever, no series is without its flaws.  Let's start with a really obvious one, time crunch.  Seeing as how this series only got a total of 10 episodes for its runtime, a few fears ran into my mind.  1.  There would be a lot of uneven pacing, rushing through some parts of the story whilst leaving other maybe more important parts high and dry.  2.  Story may be incomplete by the end of it.  Luckily, the second point wasn't anything to worry about, but the first one is definitely an issue.\\n\\n\r\nRush, rush, rush.  Pacing.  I stated in my previous Chaika review that the pacing can get a bit awkward at times.  This sequel is no different.  In fact, it's even more so of a problem than before.  Because of the 10 episode time crunch, some parts of the series were what I would call half-baked.  When you're doing anything with mystery, you need time to fully explain what exactly is going on because the audience anticipates an explanation to the mystery.  Chaika does this a little bit by speeding through a couple of what I would call crucial explanations, sort of glossing them over as if it was nothing.  In fact, THE most crucial explanation was given maybe like 4 total minutes of explanation and I feel sad because I personally was anticipating a good explanation as to WHO Chaika was.  Plus, the final episode was horrendously rushed, making me feel like they could've made the finale just a bit more epic with more screentime because having that an epic finale, a finale that you anticipated for and thought would be awesome and epic, be boiled into one episode, kinda ruins the tension since you basically solve an ENTIRE PLOTLINE in 23 minutes.  (Looking at you as well, DAL II)\\n\\n\r\nAnd finally, and this is the most crucial part, the story ends.  A lot of anime adaptations I see don't really have a satisfactory ending, as they either try to end the story but end up failing miserably, or make it so open-ended that you have to either read the source material to know what is going to happen later, or do it just so they can laugh at their fanbase.  While the end I felt was kinda...meh due to the fact that like I said, bad pacing issues (and pretty bad ones at that), it ended, the story is done and over, and that's the best thing I can ask for any anime.\\n\\n\r\nOverview:\\n\r\n+ Good storytelling\\n\r\n+ Good integration and explanation of magic\\n\r\n+ It Ends\\n\r\n-  Pacing can get bad at times\\n\r\n-  The final rush to the end\\n\\n\r\nCharacter (7.01/10):  The characters in Hitsugi no Chaika are characters I've praised before due to their uniqueness as characters and their attitudes towards certain events and people around them.\\n\\n\r\nUp first is our main protagonist Toru, the sabetour (basically a mercenary) that is employed by Chaika to help gather her father's remains.  As a sabetour, he thinks himself nothing more than a tool used to help his master achieve his/her goal thinking more as a strategist with a level head in order to achieve said goal.  What I like about Toru's character is the growth.  As time passes on, you can clearly see what his motives are and think more of himself and for himself as he becomes less and less of a tool.  His personality doesn't really change that much, but his viewpoints in life certainly do.  \\n\\n\r\nAnd then we have Akari who is...Akari; kinda hard to explain her.  She is similar to her \"brother\" (since they're not blood related) in the sense that she takes the tasks she is given seriously and is also like a sabetour, treating herself like a tool for her master more than anything else.  Honestly, she doesn't change much in the series and sort of fades away into the background as time goes on since she truly doesn't get any development to her character.  \\n\\n\r\nAnd then we have Chaika.  Chaika, Chaika, Chaika.  Chaika as the sort of main female protagonist has always been a very interesting character what with her broken speech pattern, unknown past, and desire to give her father a funeral by burying the dead remains.  Her character for the most part has been shaped in large due to the effect of the word \"Chaika\" in the six Allied nations as well as the little hints of backstory that we get concerning her character.  But that's really where it ends.  While Chaika herself does get a bit of development, she really doesn't change very much aside from having to think about who she is after finding out what exactly \"Chaika\" means.  \\n\\n\r\nWith the main cast, we have the supporting cast of characters of varying importance starting at the bottom with the Nation leaders who don't do anything beyond talk and discuss what is going on in terms of plot around a round table, the Gillette Squad that act as \"protagonists\" since the main characters of this series are technically doing something bad, the red Chaika and her small band of mercenaries, and Frederica, who once again GETS KILLED.  (I mean seriously.  You did this last season!  You don't kill the same character AGAIN in the same point of the series!)  The supporting cast does little more than to add obstacles or give more explanation to the world that is Hitsugi no Chaika.  They each have their own personalities and motives, and some of them are even quite interesting but, in comparison to what kind of characters they were in the first season, they have little to no change.\\n\\n\r\nOverview:\\n\r\n+ Decent character growth\\n\r\n+/-  Unchanged supporting cast\\n\r\n- Some MC's lacked any proper development\\n\\n\r\nArt and Sound (8.35/10 and 7.98/10):  Hitsugi no Chaika was produced by Studio Bones.  Yeah, no explanation required as to how good the animation.  The entire series is done in a very crisp looking animation that utilizes many dark themes to show that this show is not some happy go lucky magic show.  Many of the characters are wonderfully detailed, showcasing the many details that are involved with their designs such as Chaika's dress, Fredica's dragon form, and of course, the magic circles. The action and movement in this show is very fluid and nothing visually looks clunky.\\n\\n\r\nIn addition, the show gets special mention for its magic circles as the magic in this show utilizes the formation of magic circles.  Let me tell you one thing, they're fantastically done.  There is an absurd amount of detail that goes into every one of these circles and the character utilize these things A LOT.  \\n\\n\r\nIn terms of soundtrack, similar to its predecessor, Avenging Battle hosts a very unique sound.  Both its OP and ED use fast-paced music that have a very yearning and hopeful tone to them, in addition to some darker areas in the songs, giving the audience a feel of what is to come when they watch the show.  Personally, the Chaika soundtrack is one of my personal favorites because its actiony, but not sterotypically actiony.  Plus, if you like electric guitar solos, you'll get a lot of that.\\n\\n\r\nOverview:\\n\r\n+ Studio Bones (Aka, fantastic artwork)\\n\r\n+ Great soundtrack\\n\\n\r\nPersonal Enjoyment (8.01/10):  Chaika I've always felt was a very underrated series.  Many people don't like it and I'm a bit saddened by that because it does offer a very interesting story idea in addition to its unique characters and way of expressing plot.  I was very excited for the second season because the first one had enthralled me with its story and the mystery of what Chaika is.  And now, having had finished the series, I can honestly say that the second season of Chaika is a good sequel.  It isn't without its flaws, but it still is a good show.  Onto the three questions!\\n\\n\r\nWhat did I like about this show?\\n\\n\r\nWhat I liked about it is that it was a true sequel that did pick up from where the last one ended off.  A little bit of time passed, but being able to see what happened after the first season and then continuing on was a good thing.  In addition to the unique plot, characters, and soundtrack, the series also ends fully, as in nothing more beyond it storywise.  \\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nA big complaint I have now is well, I don't have anymore Chaika to watch.  Another thing is its horrendous pacing at times.  Some explanations were cut short and/or glossed over in order to move the plot around due to time constraints.  Explanations are very important when it comes to mystery anime, and when you cut down even one, there are some issues.  In addition, I felt that the end of the series was rather sudden.  After the final event is over, we get an epilogue as to what happens afterwards which really doesn't explain much heavily since they squeezed all of the afterstories in 5 minutes of runtime.  Also, 10 episodes.  Why not make it a proper sequel with a length of 13 or something like that?  You wouldn't have to squeeze in so much information in such a small timeframe.  Really.  \\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you're a fan of mystery anime or magic anime, go for it.  Hitsugi no Chaika is what I define as an underrated anime because it solely focuses on its story and its characters without any fail.  It puts the story first beyond anything else and that is why I praise it so highly.  There is no ecchi crap that you'll find with this series, no romantic subplots (ok, maybe one REALLY minor one), and no sidestories.  It does have its fair share of pacing problems, but overall, this is a good show.  Honest.  \\n\\n\r\nOverall Score: 7.42/10",
            "date": "2014-12-10T17:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 171713,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=171713"
        },
        {
            "content": "So, this will be a long one, the long story short, it really sucks. It loses all the initial charm in season 1 and it results in all characaters being horrible, I don't feel strongly for a single character and there are more plot holes than the holes in swiss cheese. It's a waste of time, utterly. \r\nSeason two further went down a bad path and the flaws became all the more apparent for various reasons, be it the rushed pace, the more \"serious\" mood, the horrible settings and decisions or the characters themselves. Thus the score had to be lowered greatly, actually I should’veprobably lowered it more than I did, because it’s probably not worth this much seeing how many giant flaws are present, I even started feeling like it was too much of a chore to watch and just wanted to drop it because it sucked too much, but I stuck with it because I had already watched most of it. \\n\\n\r\nThanks to how it was executed, I started feeling even less attachment to characters I didn’t really care much for in the first place(such as the mc team). The only character I actually truly like is fredrika, the dragoon, she had some nice zest, not that it was used properly. The characters overall feel as if they lack things, there isn’t enough spirit and they feel pretty damn artificial. Their motivations are extremely flawed and illogical, absolutely not something you’d connect to people like them. It just feels empty, which in turn reduces my enjoyment greatly as I don’t really care much about anyone, be it from the mc team or villain teams. \\n\\n\r\nThe story also just keeps on getting worse, what wasn’t good to begin with starts becoming even more horrible. The chaika issue where there’s a lot of her and whatever is just overdone. The plot going on behind the scenes is silly and stupid(the very reason for the chaikas existing and as to why gaz did all of this is so damn ridiculous and half-arsed that I can’t even bother to care anymore, instead just marking this entire thing as a huge failure not worthy of anyones time), it’s also extremely simple to the point where I guessed correctly what was happening and what the plot would be from the first few minutes of episode 1 in season 1. The only thing I couldn’t guess back then was the chaika issue, but as soon as we became aware of there being multiple versions of her, it became extremely clear what her purpose was and why there’s many of her around. \\n\\n\r\nI also absolutely hate how the mc team doesn't even have a proper purpose, they’re just moving forward because they have nothing better to do. Chaika(the mc team one) just wants to keep on collecting parts even after becoming aware of the truth that she’s just a tool and not even a true daughter of gaz(although reluctant to accept it, she denies it until the end and although the mc knows better, he doesn't give a f*ck), for the moronic reason that “she doesn’t know what else to do and is kinda curious” or something. The mc and his sister tags along because they also have nothing better to do than collect body parts while knowing they’re being used and it will bring nothing but demerits such as fatal danger and being used. They just don’t seem to care about anything and their motivations are just… unbelievably foolish. \\n\\n\r\nI also hate how their personalities doesn’t fit their character settings, neither does their powers seem reasonable considering how they’re supposed to be stronger than this, being trained from youth and having superhuman abilities, that's the ONLY good trait of this mc, yet it's removed all the time. Only the strongest of people should be able to put up a fight, but turns out they’re actually not that big of a deal most of the time unless the situation calls for it, because he keeps on getting bested by people that can’t possible have similar training or skill to him so that the plot can advance as the author wants it to. \\n\\n\r\nOh, and if the people have similar training to him, he gets owned extremely fast without a chance to fight back even if it’s a 2v1 with his sister helping out, utterly pathetic, I can’t get to like a mc like this, not when he needs to form a special contract with a dragoon to fight people he should be able to fight even before. Not that I didn’t like that he formed a contract, I really liked the dragoon in question after all, too bad that he just can’t get around to doing it before it’s pretty much too late already like the moron he is, waiting until the final boss battle in the last episode when he literally has no other choice, because it’s suuuuuch a big decision and change, now he has new, shiny armour and skills/abilities after all, so he can’t possibly keep on doing what he did before but while using the new powers! Naaaah. Well, it’s not like he got much stronger, he just became less skilled and more of a brute who charges head on as he can heal everything, talk about throwing pearls to pigs who can't utilize them. Heh, but something happened, perhaps the only hilarious thing in this season, the mc didn’t even get to do anything after “building up the courage” to form a contract with fredrika. Nah, he just got beat up like a sandbag several times or something and had nothing at all to do with the conclusion, maybe he might've helped with some motivation at best. Pathetic to the very end, what was the point of him anyway?\\n\\n\r\nWe're supposed to like chaika, right? She's kinda like the mc after all, at least she's the main focus here, sadly it's impossible to do so. Chaika keeps on making foolish decisions due to her “innocence” despite being told off again and again, it truly pisses me off more and more every time she does it, I just want to facepalm as I cringe hard while witnessing it(since season 2 is more serious and worthless, it's way more obvious and irritating than in season 1). She seems to have zero ability to learn or grasp her situation nor judge people, it’s not at the level of mere stupidity or foolishness after a while and it becomes clear that she’s just, excuse my choice of words, damn retarded, to the point where she might as well die and be replaced with another chaika, the red one seems more interesting for example(well, she also became irritating in season 2, seemingly having similar levels of IQ to the mc team chaika). She doesn’t truly develop throughout the entire series, the biggest development would be at the very end, but who cares when the story is already over? It was also a forced development, not that she actually matured or anything, she just was kinda reset(I'll leave it at that to avoid spoiling what truly happened), we don't even get to see more than a few seconds of it, truly displeasing. She's an extremely crappy character that only weighs people down with her immaturity and personality, especially when things got more serious. Even her way of talking gets more and more annoying and one starts getting the desire to punch her until she speaks like a human instead of speaking in broken japanese(well, it’s not that her pronunciation is weird, it’s that she can't speak properly, like not using suffixes, not using particles and using words that you wouldn’t use normally). \\n\\n\r\nI guess you see how this got worse and worse now. I’m giving this a 4/10 for pity since it had good promise, interesting initial settings and the first season was a fair bit better. It got to the point where I just started rolling my eyes at every serious point, feeling that they should just stop the fake crap already and stop being so damn retarded. I have to say it was kinda amusing that they, in the end, won only because some “love and friendship” bullsh*t where a supposedly emotionless tool/half-machine somehow took their previous friendship too seriously after shallow and short interaction with chaika and took some words to heart and thus goes back to chaika. The battle was actually won thanks to chaika being a moron who treats everyone and everything with such “kindness” without thinking. Holy sh*t, it’s rare for me to cringe so hard that I laugh at the sheer impossibility of the situation, it wasn’t executed well even a little. \\n\\n\r\nFrom start to end, none of the characters went through even a smidgen of development, nor were any characters good enough to be that likeable, fredrika was the most lovable character, but since the author didn’t keep her around enough and suppressed her personality when it mattered so that she felt way too fake, even she wasn’t that good, she actually didn’t say a single thing after forming the contract with the mc and that was at the very end, seemingly she disappeared or something without explanation. Sad. F*ck, it’s rare to see such a horrible story that fails in so many ways. By the way, the “gundo” that chaika used to end the battle got captured and no one cares, I guess that’s as far as this friendship and love power thing goes. I am officially disgusted, I feel mindraped in more ways than one. Give me back my time, how dare this author(or anime staff) make it seem interesting at the start but make it turn out like this? Well, it seems like extremely much was changed in the anime and isn't the same as the novel at all, that season 1 was much more in line with the original albeit with a fair amount of new stuff, so maybe that's the issue. It might not be the original author’s fault that it turned into super garbage from at least being average or a bit above average(it was never that good though, just the idea for the setting was initially awesome and had great promise). By the way, unlike season 1, I see nothing resembling comedy in season 2. I guess that's one of the big issues here, how they decided to make it serious and thus lost EVERYTHING in the process just to advance a half-arsed, rushed story that sucked in the first place.",
            "date": "2018-10-15T05:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 291793,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=291793"
        },
        {
            "content": "Hitsugi no Chaika: Avenging Battle\r\nWhere the story ends by finding all the remains of the most powerful wizard of all time. \r\nBy this phrase, I think you can guess how is this going to end...you know...he is the most powerful wizard of all time, and the smartest (or not).\r\nI got to be honest, I was kind disappointed with the second season. The first season had most of the story pretty cooked to be eaten on this season..But still this being an action anime, we didn't\u0092 get the opportunity to see much action. The fight were probably the down side of this season, were there wasalways an overpowered side, with no suspense or excitement. It felt kind empty and sad. (\"most powerful wizard my a**\")\\n\\n\r\nWeren't you here to see that badass dragon to kick some a**? Or him? \\n\\n\r\nThe ending, in one word - empty.\\n\r\nIt told me nothing, is it a happy ending? But where is everyone? Is she okay? What? \\n\\n\r\nLet's stop the chitchat and go to what you came here for.\\n\\n\r\nScore\\n\\n\r\n---- Story 7/10 ----\\n\\n\r\nIt's basically the continuation of the \"hunting\" for the remains of the \"most powerful wizard\", A.Gaz, but now even with that, they throw in a new quest to found a lost treasure of the wizard boss. But the sad part of the hunting is that it lost interest, there is no more sneaky peek saboteur getting into fights to steal the remains. Now they almost give them with no problems. And, being the last season, you can guess they get all the remains, the rest you can imagine what will happen...he actually is the \"most powerful wizard\"...but c\u0092mon the MOST POWERFUL with a battle of that style? Nhaaa...and the ending, really empty. Just some random images put together. Not that good to end an anime. But still it was a solid story. \\n\\n\r\n---- Art 8/10 ----\\n\\n\r\nI can say that I like almost all kinds of art, and this one had its style, I am no artist to judge how good this was. If you have doubts, just go to YouTube and watch a little segment.\\n\\n\r\n---- Sound 7/10 ----\\n\\n\r\nChaika's voice. 10/10 Me being a cuteness fan, she was the best :D\\n\r\nThe rest of the voices were pretty good\\n\r\nBut music? Nothing to be memorable.\\n\r\nOnly 1 OP and 1ED.\\n\\n\r\n---- Character 7/10 -----\\n\\n\r\nSo many Chaikas! o/ But only our Chaika is the cutest! :D\\n\\n\r\nWell, this season was kind weak on \"telling\" the story behind of the 3/4 hero\u0092s left, where the one more \"strong\" was the one that had the head. But still, it was forgettable.\\n\r\nThere were even more 2 downsides for the Character's. \\n\\n\r\nOne: The final enemy. Being final, we would say it needed to be a nice and long fight. But guess what. Nop\\n\\n\r\nSecond: The final \"form\" of Tooru, was so cool, but with a final enemy like that we didn't\u0092 even had the opportunity to see and feel its true potential. \\n\\n\r\nThe rest of the new characters presented were all forgettable. And me being stupid as I am, I was still hoping for my \"Romance\", but no, don\u0092t get that idea. There is nothing like that for you in here.\\n\\n\\n\r\n---- Enjoyment/Overall 8/10 ----- \\n\\n\r\nI actually enjoyed this anime. Not as much as i wanted, but still was kind satisfying. You have the fight segments mixed with some comedy, what was the refreshing side of it, by keeping you attached to the anime.\\n\r\nTbh, I felt a sadness inside be when I saw that this anime would only get 10 episodes...I was like will the fights and hunts fit in there? Well...it did...not like I wanted...but still..\\n\r\nI know mist of you will not agree with my final score. But I actually felt bad by giving a lower score to it.\\n\\n\r\nJust keep one thing in mind. No epic ending, No epic sounds, Funny and relaxing, small and fast.\\n\\n\r\nThank you for reading everything (like you actually did xD) and give me your response to it. I will delete any kind of hate/troll/irrational comment to my profile.\\n\\n\\n\\n",
            "date": "2015-01-03T08:46:00+00:00",
            "helpful_count": 11,
            "mal_id": 175919,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3334117.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Plinius",
                "username": "Plinius"
            },
            "url": "https://myanimelist.net/reviews.php?id=175919"
        },
        {
            "content": "As I've stated before, the trend of split-cour TV series (a series that will air its first half, take a season off, and then air its second half) has become increasingly more popular in the anime industry. Not only does it give the writers more time to think of ideas for the second half, but it also allows them to budget the animation better. By this logic, the second half should be just as good, if not better, than the first half, but is this always the case?To be honest, this was one of my most anticipated series for the Fall season, and the unique flair of fantasy mixed with pseudo-gothic elements from the first half has carried over nicely into the second half. However, in terms of having a stable story, Avenging Battle leaves a lot to be desired, and the reason for that is actually a bit odd considering the circumstances. As I mentions earlier, turning something into a split-cour series is usually done to relieve both the pockets of the budgeting committee and the brains of the writers, so it was a bit strange to see that Avenging Battle only has 10 episodes, while the first half has 12. While the reason for this doesn't seem clear, the result is obvious: the story went from being moderately paced in the first half to speeding off a cliff towards a conclusion in the second.\\n\\n\r\n          The last three or so episodes are especially guilty of this. There were many times throughout each episode where it felt like they were going through the Cliff Notes of what was actually supposed to happen in those scenes, resulting in rushed story lines, unexplained plot holes, and forgotten character development, ultimately leading to a final episode where a ton of events happened that didn't really seem to connect to each other. I have no doubts whatsoever that if this second cour had gotten 12 or 13 episodes, the pacing would have sat much better, but of course that isn't the case, so now we're left with plot threads dangling everywhere. Why did Vivi turn into a Chaika at the end of the first half? What exactly was the point of introducing the demi-humans if they're going to be forgotten completely after they left the island? What exactly happens when you make a contract with a dragoon? None of this is answered, and the series leaves us with a lot more questions that will never be satisfied.\\n\\n\r\n          Character development takes a rather noticeable hit because of this pacing issue as well. To be honest, pretty much all of the character development that was going to happen in this series happened during the first half, and only the main Chaika sees any significant changes in ﻿Avenging Battle, which only happens in the final episodes, and even then it feels rushed and poorly explained. Even the new characters that get introduced barely get any noteworthy developments, even the ones that are pretty much crucial to the plot of the entire series.\\n\\n\r\n          On a quick aside, without spoiling anything, there is a certain event that's been foreshadowed throughout the entire series and finally transpires in episode 9, and while this particular scene could have been written in any number of ways, the method they chose was, quite possibly, one of the worst possible ways they could have done it, creating a conglomerate of the weirdly gross and the unintentionally sexual. I bring this up because this a perfect example of what happens when you don't pace your writing properly. Really weird stuff starts happening, and unfortunately one of the images from that scene is now something I have permanently associated with this series.\\n\\n\r\n          Like the first cour, the animation was done by Studio Bones, and not much seems to have changed in between these two halves. The pseudo-gothic style and surprisingly diverse environments work really well for this series, but the animation itself still suffers from a lack of clarify and refinement, just like the first half.\\n\\n\r\n          There is currently no dub to speak of, though I would not be surprised if Seraphim Digital were to create one for this series.\\n\\n\r\n          The soundtrack was composed by Seikou Nagaoka, and while it does fill in the silence rather well with its intense orchestral sounds, nothing really stood out as particularly impressive. The opening theme \"Shikkoku wo Nuritsubuse\" by Iori Nomizu gives us another hard rock punch to drive us in, though this time with a bit more of an uplift that in the first half, while the ending theme \"Watashi wa Omae no Naka ni Iru\" by coffin princess (VAs Chika Anzai, Saeko Zougou, and Iori Nomizu) gives us another quick-paced dance number.\\n\\n\r\n          Overall, while I wouldn't say that this was a bad ending to the series, Avenging Battle certainly wasn't as good as the first half of Chaika, and it's rather disappointing to see the series not be allowed to flesh itself out more.",
            "date": "2014-12-10T17:55:00+00:00",
            "helpful_count": 11,
            "mal_id": 171717,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3337767.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/emberreviews",
                "username": "emberreviews"
            },
            "url": "https://myanimelist.net/reviews.php?id=171717"
        },
        {
            "content": "The original \"Hitsugi no Chaika\"was a pleasant surprise for most people. It started out as your average fantasy- filled with magic, swords, and a quest. It was slowly, but nicely, paced; however, it left the viewer with a lot of questions. \"Hitsugi no Chaika: Avenging Battle\" set out to answer what was left in the air, and possibly conclude the series. \r\n   The story in Chaika 2 started out very poor. It lost the intensity that the ending of Chaika 1 had, although many sequels do. The show leisurely found a footing and made its linear path to an almostdisappointing ending. The ending wasn't what was very bad, but it was the time leading up to the final episodes that was poorly done (specifically the introduction of Gaz being in episode 9 or so). Some might call it an attempt at an intricate plot, but it became almost predictable. Predictable or expected really; there weren't any surprises that would catch you off guard. It didn't resolve its romantic subplots, but finished off some of the other ones (Nikolai/Gillette squad) decently. I'm not satisfied with this ending. From the the hype that Gaz was given, it seems too unlikely that'd he'd be beaten so easily. 4/10 for story. \\n\\n\r\n   Animation was nice to look at, nothing much to talk about here. The fight scenes were ok, but it didn't have anything outstanding. 7/10\\n\\n\r\n   The opening for Chaika Dos was catchy, but not memorable enough. Same with the ending; it wasn't anything special. The OST blended fine with the art style to create it's fun but serious tone, and it was fine overall. 6/10\\n\\n\r\n   The characters weren't developed enough for my care. Shin was given very little screen time for his, somewhat, important role. Our MC's were developed enough in the first season, but didn't receive much this time around, which is fine.  Hartgen and the other heroes didn't get much backstory, which was disappointing. As well as the new Chaika's that were introduced. I was hoping for more, and was left disappointed. 5/10\\n\\n\r\n   Didn't enjoy this that much compared to the other, better series' this fall. 4/10\\n\\n\r\n   Overall, 5/10 for feeling uninteresting at times, but still keeping its fun charm. No matter what I said, it's not bad, but a mediocre series overall. It is still worth the watch if you've seen the first season. I wouldn't put this high on your priority list, but it is a nice, fun series. \\n\\n",
            "date": "2014-12-10T17:45:00+00:00",
            "helpful_count": 11,
            "mal_id": 171715,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3887743.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/EpicSawce",
                "username": "EpicSawce"
            },
            "url": "https://myanimelist.net/reviews.php?id=171715"
        },
        {
            "content": "The continuation of Hitsugi No Chaika...continues Hitsugi no Chaika. It doesn't improve upon it, it isn't a lot worse than the original, it just...continues.\r\nDifferences from the first season: The pacing of the story events is faster and the focus has partially shifted away from Tohru as the main character.\r\nSimilarities: Half of the episodes leading in to the climax have no point. The plot and characters don't really develop at all. Well, a couple of the side characters developed a bit this season, just none of the main three. The anime makes up for all this by having an intriguing premise and interesting world building orin-world philosophy. \\n\\n\r\nIs the cause of all conflict that humans are intrinsically unsatisfied with peace? Can good intentions prevail over evil wisdom? You might find out if you skip to the end of the season. \\n\\n\r\nAlso, they added ANOTHER loli. Because 4+ wasn't enough. I will give them this, though, the main villain who appears in the very last few episodes is genuinely creepy. Good job with a strong villain, guys. \\n\\n",
            "date": "2014-12-10T22:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 171755,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/evilteddybear101",
                "username": "evilteddybear101"
            },
            "url": "https://myanimelist.net/reviews.php?id=171755"
        },
        {
            "content": "Since this is the Second Season, most unanswered questions were answered here. Hitsugi no Chaika: Avenging Battle puts forth new questions in a deeper story about memories which define one's personality.\r\nStory: 9/10\r\nThe story that was started in the previous First Season ends here in the Second Season as we get to explore it in more depth. The conclusion was fitting, but felt a little bit rushed towards the end, especially the last episode. The pacing was fine throughout the other episodes otherwise. The story becomes more complex in this season as darker secrets appear to be uncovered. Sometimes sequels will completely ruin a show andsometimes they make it even better. This show did go deeper into the story and didn't stray away from it, so it wasn't worsened, but the quality of the story didn't improve either. The First Season already gave a good start to a good story and the Second Season finished it off with an appropriate conclusion. \\n\\n\r\nArt: 7/10\\n\r\nThe art is good, thus 7/10, but the problem in the art isn't because the animation is cheap, but that the character designs were nothing too admirable. The animation is actually great especially for battle scenes. It's just I've seen many shows out there that have amazing character designs that captivate me completely, but this show at least has a distinctive feel to it and definitely was far from bad. (Chaika's eyebrows) The background art was important to this show as it the characters travel, with their environment constantly changing, and it wasn't handled badly in any way at all.\\n\\n\r\nSound: 8/10\\n\r\nThe opening and ending still stayed consistent with theme of the story and the background music doesn't ever get old or annoying. The voices were my favorite part. I felt that the voice actors all portrayed their character's personalities really well. There are some shows where the voice and the character seem out of sync and unnatural, but this show definitely has a well done connection between the characters and the voice actors. Akari's voice really went well with her comedic remarks, Fredica's voice actor really did a good job of portraying her voice in all different forms (Dominica, the dragoon, and Fredrica). The voices for the other characters were definitely well thought out and even the beserk and antagonistic characters didn't sound like monsters. What caught me the most was Chaika's voice because I'm a fan of cute characters, but it wasn't overly cute up to the point where that was her only trait, making her a strong but adorable and lovable female lead.\\n\\n\r\nCharacter: 9/10\\n\r\nChaika wants to find out more about herself because she starts to feel uncertain about her existence. Tooru is against it, wanting to protect her from danger. Red Chaika starts becoming more active in stealing the remains getting one step ahead of the main cast. More Chaikas start appearing, one of them being the one the First Season ended off on: Vivi. The informant guy starts to have more of an active role than he did before. There's lots of character development and change everywhere, and each of the characters deal with the changing situation in their own way, since as noticed in the previous season, the personalities of the characters vary from one to another making it a diverse cast.  \\n\\n\r\nEnjoyment: 9/10\\n\r\nI really enjoyed this series from the moment I picked it up and the moment I finished. Chaika was an innocent, cute, and overall likable main female lead that was consistent with her character even as she learned more of the truths in the world. She really wasn't as weak as she seemed. Most female leads when hit with a tragic truth go down in despair and need the protagonist to cheer them and motivate them back up again, but Chaika didn't need to. My enjoyment came mostly out of the characters: Chaika's strong will and Akari's well delivered comedic remarks. If the story is good, but the characters don't flow naturally with the story it makes it hard to watch. The characters really fit along with the setting and plot, making it original and an irreplaceable anime. \\n\\n\r\nOverall=9/10\\n\r\nDefinitely a anime worth watching (Of course, starting with the First Season)",
            "date": "2015-04-06T07:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 184934,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855801.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Neptune-",
                "username": "-Neptune-"
            },
            "url": "https://myanimelist.net/reviews.php?id=184934"
        },
        {
            "content": "i actually think the story of the sequel was splendidly done. The anime actually started half way where they ended the first season, to continue the story and have answered a lot of question that the first season has not given. if you've watched the first season and liked it, wanting the answers. you should watch this, i loved how they ended it.\r\nOverall: this is the sequel for the anime \" Hitsugi no Chaika\", i rated it 8/10 since it has given more than the first season. enjoy",
            "date": "2015-08-24T18:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 196960,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JustAkitteh",
                "username": "JustAkitteh"
            },
            "url": "https://myanimelist.net/reviews.php?id=196960"
        },
        {
            "content": "Hitsugi no Chaika - Avenging Battle - 7/10\r\nBefore we start, let me warn you, Hitsugi no Chaika was my first ever anime, so keep it in mind while reading this review.\r\nShort Review:\r\nArt is ok, budget is kinda low but at least it's watchable so, it lacks CGI or cinematic effects so, to be fair it's a 6/10\r\nSound is ok, voice actors really did push some unique voices and personalities, the episode BGM is bland, but the Opening and Ending makes up for it so 7/10\r\nCharacters don't really have any depth whatsoever, but they are likable, maybe not as likable as say Cowboy Bebop, but stillclose enough so a 6/10. Another thing is that Chaika is neither as moe or as adorable as she was in the first season, particularly because 10 episodes left barely any time for her development and dialogue.\\n\r\nEnjoyment factor really stands out as all the action scenes have nice choreography and are all animated good, again, nothing too special but good is good, besides, the pacing in this show is fast and the plot unravels quickly so the overall dynamic is enjoyable, both here and in the first season in fact, straight 8/10 in that department.\\n\r\nStory is good, the lore is big and clever, while it may not be deep or hard to comprehend like in some other adventure/journey style shows like Ergo Proxy as an example, it is still quite a big universe and the world of chaika is an interesting experience, along with numerous new, to the fantasy genre concepts such as getting magic from memories and without spoiling too much the creature designs are very interesting and how they interact in the world. The actual plot is quite simple at the start, mostly really just finishing what first season started while throwing in plot twists up untill the end where all mysteries are solved and the show rapidly concludes itself wrapping up the story and coming to a complete closure, so i think the story, albeit simple, is enjoyable and deserves a fair 7/10.\\n\\n\r\nLong Review (or rather an extension to the short one):\\n\r\nFirst of all, the ART is good, nothing too awesome, but it's ok, it's slightly worse than Akame ga Kill, but there is nothing too wrong with it, there is no CGI aside from a few small scenes, there aren't really any lightning or other advanced FX and it's just plainly drawn with not much detail, but aside from that there aren't really any glitches or mistakes in the art department, and i guess i can't judge the animation quality since it's only out in shitty bitrate on HDTVrips and not actual BDRemux/BDrip releases yet so even 1080p still looks like shit. Ok, the soundtrack itself is good, OP&ED are awesome just like in the first season, although the actual episode BGM is quite bland, nothing interesting there. Now the enjoyement rate is really high and the action scenes are well drawn from what i could tell and are fast-paced which makes it all dynamic and intense which is something i haven't seen in anime for a while. Now the story and the lore, especially the lore i think was the focus of the show, and i can't particularly state it succeded.\\n\r\nWhat i really liked about Chaika was that world-building, where it was a simple shounen anime technically, but it still had some unique aspects such as the creatures themselves and what they do, the history of their world, the mystery of emperor Gaz and what and why the Chaikas are in this world. I like how now in the second season the show then switches to de-building that world by questioning chaika's past and everything else, introducing one silly and expectable plot twist after another while simply working on what was already there in the first season. However, then in episode 9 there is a massive twist and all the mysteries are solved and all the pieces of puzzle are pulled together, the lore is now pretty much complete and we get a full picture and answers to why and how. Then in episode 10 there's a little bit that seems simillar to how in Fullmetal Alchemist the main villian tried to use souls to power the superhumans, only that here it's smarter and the main villian uses emotions and starvation for war, ironically the main protag and every good guy in this show fights and has emotions and memories, which power the magic in this show, so it becomes an interesting dillema, but the show ends before any of that is given any focus.\\n\r\nOverall, i liked the plot, the universe and will definitely miss this show and it's characters which may not have that much depth, but they sure are likable. The ending is very straightforward, and i'm not so sure really whether i like it, on one hand it's definitely good it didn't end in a mindfuck or some open-ended shit like Ergo Proxy because as much as those endings have the artistic value, they always leave a bad taste in my mouth, so maybe because of the good ending i liked the show, felt it had a closure.",
            "date": "2015-03-30T00:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 184049,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042687.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DanteMustDie8907",
                "username": "DanteMustDie8907"
            },
            "url": "https://myanimelist.net/reviews.php?id=184049"
        },
        {
            "content": "S2's focus is not on running around collecting the remains, but rather what comes after that. S2 sets up the conclusion very nicely. It's a nice change of pace. For the most part, the plot was told well. It also focuses on more than just Chaika and friends.\r\nAs for it's issues, there are too many underdeveloped characters. This is a very big, glaring problem. It feels like some characters got ignored or even screwed over. Akari, for example,pretty much got no characterisation. Character are tied to the plot to an extent, so this hurts that in turn. Particularly in the last 2 or 3 episodes.It's very disappointing if you like more than just chaika and toru. This was a big reason why I couldn't give S2 a 8.  I even considered giving it a 6.\\n\\n\r\nSpeaking of which, if I had to summarise the last episode in a word, it'd be \"abrupt.\" No explanations are given for much of what happens in the epilogue. Not much indication of what everyone is doing now or what happened immediately after the conclusion. \\n\\n\r\nDon't get me wrong, despite this, I enjoyed this anime a lot.  I had high hopes for this show which were not met. Season 2 really would have benefited from more episodes. I'd say another 4-6 would've been enough to show great improvement.  If there was more characterisation and the ending was better, this easily could've gotten an 8. Anyways, as for the entire series, I'd recommend it.",
            "date": "2017-10-05T22:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 259818,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3128533.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/oappo",
                "username": "oappo"
            },
            "url": "https://myanimelist.net/reviews.php?id=259818"
        },
        {
            "content": "Having enjoyed alot the first season, I was expecting the second one to be at least good.\r\nNot diving much further into. \r\nIt meet my expectations, and while it had slower, more boring episodes, the story was still interesting, the music was great to be point I never skipped the OPs, the characters, again if you enjoyed the first season, you know what to expect, Frederica is charming like always, the main cast trio is likeable, the supporting characters do they job, sure the anime has some flaws, some pacings issues, and japanese nonsense, but you see the anime till the end, and those cease tobe that noticiable.\\n\\n\r\nBy what I found, the LN ended already, and these 2 seasons are supposed to have covered the whole 11 volumes. So this is really the end of the series.\\n\r\nAnd that is where I most enjoyed the series itself, despite the flaws, and of course there is always room to improvement... the conclusion is satisfying! \\n\r\nIt brings closure! Some stories, you were attached to those so much but by the end, they leave a biter taste in your memory with the conclusion, and while Hitsugi no Chaika: Avenging Battle had its cliches and predictable troupes plot, you invested your time watching the anime, you will be rewarded. Sure I was left wanting to see a bit more, non less it is easy to watch, and concluded in a pleasant way, not the most unforgetable anime, by far. But it does the job, and doesnt disappoint, and like I mentioned, if you enjoyed the first season, I cant see you hating this one. \\n\r\nGive the first a try, and if you liked it, you have here more 10 episodes to entertain you.\\n",
            "date": "2015-01-06T18:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 176561,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1778785.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Playcool",
                "username": "Playcool"
            },
            "url": "https://myanimelist.net/reviews.php?id=176561"
        },
        {
            "content": "The hardest part of being a critic of anything is deciding whether to give in to your snobbish, critical side or to allow yourself to actually enjoy the things you watch. It’s a problem a lot of hardcore critics have to deal with and something that doesn’t translate well in the written word. I have written many reviews stating that an anime has problems but I heavily enjoyed it, something that seems contradictory to many, especially when the score reflects a better product than what is actually seen.\r\nThus, Chaika: The Coffin Princess, an anime I had such a hard time reviewing because I loved itoh so much despite all the issues it had. It was so average in nearly every regard that giving it a 6 seemed perfectly fine. But my critical persona dissipated after watching part of the second season and I realized I don’t think Chaika deserves a 6 because it’s more than a good average. It’s freaking good.\\n\\n\r\nAnd that’s why I raised the score on the review, that’s why I had to re-edit it, and that’s also why I created the new Otaku Seal of Approval category, a category dedicated to anime I particularly enjoyed and think you’ll find fun as well.\\n\\n\r\nThe second season of Chaika: The Coffin Princess is just as good as the first and finishes up the story of Chaika and her pals gathering the pieces of her father’s body. While it opens following the same formula as the previous season it moves into a grand finale with a final confrontation against the old emperor himself as well as a whole lot of revelations about what the Chaika’s are and their purpose.\\n\\n\r\nLet’s get into the averages. Average story. Average world-building. Average writing. Average characters with average development. Average music.\\n\\n\r\nBut the action is fantastic. The characters are cute and despite their averageness I still think Chaika is lovable and adorable, Toru badass, and Vivi is just so freaking wonderful.\\n\\n\r\nThe story isn’t anything new or smart but it provides for an entertaining ride that is formulaic but has pretty good twists toward the end and keeps you invested in the character’s.\\n\\n\r\nThe world itself is weakly developed but the magic system is unique and interesting. Using bullets containing magic powders and then being able to shoot the weapon and produce all kinds of different effects based on the incantation they use is a really smart and interesting system. It makes more sense than a fantasy series containing guns with regular bullets being used alongside lances and swords.\\n\\n\r\nSome new problems of the second season include the introduction of a female character who was artificially created to be a weapon. Her purple twin-tails combined with her purpose reminds me all too much of Sophie from Tales of Graces F.\\n\\n\r\nThe mentor of Toru and his sister winds up working for the bad guys by complete coincidence. Oh, and so does a supposedly dead character.That’s poor writing.\\n\\n\r\nBut the biggest problem I have with this anime is that it moves too fast to the conclusion. Not only do I want more but I feel like, had the series been extended to twice as long, it would have built up the characters and escalated the tension of the final scenes. The ending is emotional and pretty good, but it feels like the buildup wasn’t enough. There are eleven books in the light novel series and I can’t help but feel they compressed the books too much. Perhaps I should wait for the release of the first light novel in English this summer as it may develop these characters I already love and make me love them even more.\\n\\n\r\nThe ending comes way too abruptly and we don’t get to see the characters after the final battle more than thirty seconds. This small glimpse is not enough to satisfy me. I want closure, I want to see that Chaika and Toru are together or Chaika is happy in her new life. I want to see why Red Chaika is busting down doors and living with Toru, his sister, and Chaika. The most important thing an anime can do at the finale is leave us feeling satisfied that our heroes are doing well because when they’re happy, we’re happy. There is an upcoming OVA I hope gives us a better glimpse at the aftermath of the series, but lord only knows what they’ll do with it.\\n\\n\r\nChaika: The Coffin Princess is not a smart, thought-provoking, or pretty anime. It’s a really fun show, despite all the flaws, that I feel you’d be remiss to pass up. Definitely one of the better anime I’ve seen from last year and one of my favorite anime I’ve reviewed in the past couple of years.",
            "date": "2015-05-22T10:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 188430,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188430"
        },
        {
            "content": "Hitsugi no Chaika as a quite phenomenal series with the main character, Chaika, back with a second season. Still using the same theme in the first season, we were taken to see Chaika collect the pieces of her father's corpse despite the doubts and the mystery behind the Chaika herself. Accompanied by Tooru Acura and Akari Acura, also loli dragon Frederica, this second season solves up various mysteries that were encountered during the first season.\r\nWith the use of the same themes in the first season until the third episode, we were taken to Chaika adventure in finding the heroes who have the pieces of herfather's body. The story began to focus on the mystery during the first season on mid-fourth episode. Still the same as the first season, the series is still using a fast tempo story. Luckily we can still enjoy the story though there are details that are missing, the same as the first season that lost the important details of the story.\\n\\n\r\nI think because of the fast tempo, the end of the story feels end quite suddenly. A king is said to be the greatest wizard and has been in power for five centuries was defeated by his own goods in about 1 hour time story. I feel it can not be matched by the development of the strength of the main character. In addition, there is a \"betrayal\" by a character with unreasonable reasons. There is no scene that implies that the reason given is a reasonable.\\n\\n\r\nDespite the weaknesses that exist in the story, the character traits of the characters in this series is quite satisfactory. Additional character in the second season brings a new atmosphere in the story. In addition, the mystery of the few characters solved properly with reaction of those characters when they knew the truth. In the final battle, it can be felt the flashbacks that were given very illustrate what has been passed by Tooru for this two season.\\n\\n\r\nIn addition to the characters, the animation is displayed quite nicely. It’s quite obvious that there are additional budget in the battle animation. However, it is not matched by the quality of the art even after how they did the first season. Depictions of \"derp face\" that exist in the first season are still widely seen in the second season. In addition, there is a mistake in the second episode when Chaika fall with her Gundo. All of a sudden, the Gundo disappeared from her grasp and the next scene is shown that Akari bring the Gundo to Chaika. Also, the coloring of the character in this series does not really represent the darkness of the story. It is quite unfortunate because the designs of new characters there are very brilliant in describing the atmosphere of the story.\\n\\n\r\nThere is nothing special about the music in this series. The opening song sung by Iori Nomizu still have the atmosphere similar to the opening song on the first season. Similarly, the closing song too. Background song also did not have anything special. Quite good for the action series like this, but can’t make me amazed.\\n\\n\r\nAlthough with the reproachs that I gave, I quite liked this series. The absence of important details on the story and how the picture did not deter me to watch this series. I have always been loyal to watch this series every week to look forward to a variety of characters and also with the mystery solving. I am not so disappointed with the end of story, although I am a bit curious about the fate of Chaika memory. Hopefully this is discussed in the OVA.\\n\\n\r\nI can say that this series is quite interesting to watch. The mysteries are quite interesting although not all the mysteries solved in this series. Also, the character are very entertaining and made me look forward to this series. I would recommend this series to you who like action series with spices of mystery and stories.\\n\\n\r\nThanks for reading my review!",
            "date": "2014-12-11T06:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 171787,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452111.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xgunawan",
                "username": "xgunawan"
            },
            "url": "https://myanimelist.net/reviews.php?id=171787"
        }
    ],
    [
        {
            "content": "Hitsugi no Chaika is a show of peculiar nature, one based on a fantasy premise but is able to explore in depth of its potentials. The sequel, Hitsugi no Chaika: Avenging Battle wastes no time as it returns with our trio of adventurers. For those who have seen the first season, then it should be known that Chaika, Toru, and Akari are still on their quest to find Emperor Gaz’s remains. But throughout that journey, conflicts arise and dangers lurk in the shadow for the group to deal with. From this sequel, we learn more about their world, characters, and secrets that may invoke morethan just a SHOCKING TRUTH.\\n\\n\r\nAs a sequel, it’s advised to watch the first season especially since this continuation doesn’t recap events. Nonetheless, new events happen which breaks down the barrier of normalcy. While the show still focuses on our main characters, it also doesn’t miss the opportunity to give other characters insight as well whether it’s Red Chaika’s group, the Gillet Corps, or even King Gaz himself. And like a race to win a game, Toru’s group faces competition in collecting the remains. This is where the fun pours in as we see how far they go to get the job done. One thing that the show has been good at doing is evoking entertainment through humor and gimmicks. Rather than just shock value or overly extended fan service, the show cracks jokes between characters at proper timings. This includes scenes relating to the characters or battles. Because let’s face it, without some comedy, the show would end up to become a chore and too straightforward to watch. However, Hitsugi no Chaika seizes every opportunity at the right time to inspire laughter in a good sense.\\n\\n\r\nThe overlay of the story is irrefutably crafted by realizing the setting of its world. In this sequel, we learn more about some of the origins and secrets that unfold when our heroes journey to a mysterious place like never before. What’s more interesting about these secrets is that it also brings question to Chaika’s ultimate goal. While the info dump can be a lot to take in at once, it also makes the show more interesting as we see how the protagonists deal with their newfound knowledge. Of course, the show doesn’t stop to focus on backstories and deliver action-packed moments to keep up with the momentum. It unites themes and buildup to bring about a story unfolded with revelations while mixing in humor at once. Although it sounds hard to accomplish, I would say that the sequel definitely played its cards right. At its best, the story works like a charm as a gift for what fans expect to see. \\n\\n\r\nA decent balance of the pacing is also evident throughout the sequel. While the show has both heavy info dumping and action scenarios, it also makes time to characterize the cast. Although there’s not much change to their persona, it’s easy to see how they fit with the story with credibility. Not only that but new characters introduced also gets their own memorable spotlights. The problem that does occur on occasions is how some parts feel less inclined to fit in with the pacing. However, it’s also simple to see how far the show goes to create a feeling of connection between certain characters. Even enemies can become comrades when the situations calls for it and gives the audience a glimpse at the true nature of our characters. We also can’t forget about the humorous exchange between certain characters such as Toru and Akari. Chaika’s broken speech continues to be a device for amusement. In contrast, characters suffering from their own issues such as Vivi also creates tension and compelling emotions. The endgame here is that characters aren’t just there to fight like chess pieces but all fit together like a puzzle with impressive fashion.\\n\\n\r\nAs the show is called Avenging Battles, the sequel doesn’t neglect action scenes. Whether it’s competitions, training sessions, or fighting for survival, the series pulls out the right combinations for what’s trying to accomplish. Every battle has a mix in of intensity, strategy, and humor. It’s important to mix in these together or otherwise, fighting can become quite stale when it’s all straightforward. It also gets violent too with the blood spilling, limps severed, and deaths that actually occur without teasing. Viewers who are familiar with the first season should already expect this with some of the abilities of our main characters. What never ceases to be noticeable still is Chaika’s Gundo Sniper Rifle. Even though the weapon is about half her size, she uses it with great skill complete with ridiculously long spell incantations. Be rest assured though as the action never dies down by its pacing and is crafted with unique attributes that stand out for itself.\\n\\n\r\nDespite the refreshing story, Hitsugi no Chaika isn’t without flaws. Namely the story, there’s pitfall of fast resolutions when it comes down to the way it concludes certain episodes. Rush would be one word to describe such resolutions. Not only that but the villains involved in them are stereotypical whom are saturated with clichés and generic motivations. Mad scientists, corrupt political figures, and experimental species aren’t new to the anime world. Neither too are mysterious girls with odd-looking eyes. The point is that some of these villains aren’t very compelling or interesting at all. To put it simply, they are just there to move the plot forward as devices with little focus on their characterization. Furthermore, the comedy can be a mixed bag for some people. It can feel repulsive at times with the same repetitive jokes between characters. \\n\\n\r\nBones return as the animation studio to adapt this series and to say the least, they are impressive on the visuals frontier. Characters are crafted well with fantasy tropes such as the case of Francesca, demi-humans, and experimental beasts. Weaponry also offer a variety of factors with relevance. Like I mentioned before, the action scenes are coordinated with strong degrees of fluent movements. It’s rapid and takes away your breath when witnessing it with your own eyes. Furthermore, the fantasy lands of the sequel exploits new places that are memorable. Fan service remains minimal as the show concentrates more on plot rather than exposition of fulfillment. \\n\\n\r\nSoundtrack remains adequate although it doesn’t change much from the first season. We do get new OP and ED songs that retains a similar style compared to the first season. Nonetheless, the OST and character voice mannerisms stand out the most. Unfortunately, some of the new characters can be easily forgotten and only returning cast steals most of the show such as Red Chaika, Francesca, etc. To put it simply, the soundtrack is decent but nothing earth shattering with their voice mannerisms.\\n\\n\r\nConsider this series as a gift for the fans as the show adapts further into our heroes’ quest in an unknown world. What started out as a journey to collect pieces to a puzzle has become a complicated labyrinth of mysteries forged by origins of the characters. While the show doesn’t escape the usual generics with its stereotypical archetypes, it does compel to a more refreshing premise backed up with insightful characters. The intersecting arcs puts characters at angles where viewers can anticipate what will happen. And along with plot twists, there will be moments when you feel as though the show is hiding even more. While pulling off all the risks, this sequel is a must-see not just for fans of the first season but also anyone who is interested in a journey of enthralling fantasy. \\n",
            "date": "2014-12-10T09:34:00+00:00",
            "helpful_count": 86,
            "mal_id": 171671,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=171671"
        },
        {
            "content": "Every once in a while you stumble upon gems amid a sea of plain, gray stones, and to me, Hitsugi no Chaika was one of them. While it was nowhere close to being a masterpiece, Chaika explores certain themes and original ideas that few anime are able to. This action-adventure flick can get a little boring sometimes, but certainly pays off towards the end.\r\nTL;DR\r\nStory: 7/10\r\nArt: 8/10\r\nSound: 10/10\r\nCharacter: 6/10\r\nEnjoyment: 7/10\r\nOverall: 7/10 (rounded down from 7.25)\r\nGood points:\r\n+ Adorable main moe lead (Chaika)\r\n+ Great action & fighting scenes with myriad of magical abilities\r\n+ Huge set of varied and interesting supporting characters\r\n+ Significant plot twists throughout development\r\n+ Excellent OPand ED themes\\n\r\n+ Great animation\\n\r\n+ Good main antagonist (Gaz)\\n\r\n+ Good resolution\\n\\n\r\nBad points:\\n\r\n- Disappointing male and female leads (Toru and Akari)\\n\r\n- Plot development is a bit slow and can be draggy at times\\n\r\n- Some plot holes especially in S2\\n\r\n- Dialogue may seem too repetitive in nature\\n\\n\r\nStory: 7/10\\n\\n\r\nChaika is set in a world where technology and magic co-exist, or rather where magic is seen as technology and \"progressive\" in nature. Also, there exists beasts and hostile creatures called Fayla with magical powers that have been studied to research into magic. While the origins and source of said magic research is not shown, the plot does keep to these believable assumptions and does not deviate from the laws it itself creates. (+1 for believable assumptions)\\n\\n\r\nThe story is split into 3 main arcs spanning across two seasons. The first, being the \"remains gathering\" arc, the second being the \"Niva Lada arc\", and the third and final one being the \"Martial Arts Tournament arc\".\\n\\n\r\nThe story starts off with Toru rescuing Chaika from some hostile Fayla, and already you know you're watching an action flick. It doesn't take long for the audience to realize that Chaika is completely clueless, knowing nothing save for the fact that she wants to collect her father, Emperor Gaz's, remains. Toru and Akari are then hired by her and thus begins a long journey of collecting said remains throughout the first half of series (up to Avenging Battle).\\n\\n\r\nApparently, we are told multiple times, as if the writers were afraid we'd forget, that Emperor Gaz's remains contain great magical power and we constantly get the feeling that Chaika should be looking more into her lost memories and that as they collect more and more remains, that they are making a mistake and are inadvertently going to bring disaster somehow. (+1 for interest) The story alludes to this by the introduction of Guy, a mysterious informant who does nothing but conveniently tell them where the remains are, yet answers none of their questions as to why Chaika is gathering remains. Chaika's reason was for \"Father's funeral\".\\n\\n\r\nAlso, from the beginning we are introduced to the Gilette squad, whom we already get the feeling from their general aesthetic that they are protagonists alongside Chaika, despite them seemingly trying to stop White Chaika's group from gathering more remains, with the goal of \"averting disaster\" or the coming of another war. This same idea that the remains could start another war gets constantly repeated and perpetuated that it would come to no surprise that it would indeed start another war - the only question remaining is how it would do so.\\n\\n\r\nThe Gilette squad though, while only being supporting cast, actually plays a huge role in this plot. They managed to uncover the secret of Gaz's empire from rumours heard by townspeople who saw large fortresses flying around many years ago. They were also instrumental in helping White Chaika and her gang multiple times along the way.\\n\\n\r\nWhen we hit halfway into the first season, we get introduced to Red Chaika, who's completely different from our White Chaika, but who's also after the emperor's remains, just for a different purpose - Revenge. And that's where things start to get interesting. The story thrusts us into a realm where many things could be possible, and succeeds in making the audience curious beyond measure, asking questions like \"Why are there so many Chaikas collecting remains?\" and \"Who's orchestrating all this?\" but it continues to keep us in constant suspense.\\n\\n\r\nTowards the end of the first season, there's also the introduction of another Blue Chaika, one who gave up completely on her mission of finding remains after finding out the truth that she was just a tool. She instead decides to help two fools in a quest to start a war by killing innocent girls for their memories as a form of magic fuel for flying fortress Soara. After the destruction of Soara, Vivi from the Gilette team turns into a Chaika herself, making the audience even more startled. \\n\\n\r\nMeanwhile, aside from the trio's adventures, there are also multiple scenes of The Alliance of Six Nations discussing whether or not they should take military action against a certain party, and this discussion kind of goes on and on throughout the anime, and even though no decision can ever be reached, most of the parties simply take independent action and launch their flying fortresses anyway - hence completely making every one of these scenes irrelevant, save for Konrad's updates to the Gilette Team.\\n\\n\r\nMost of the first arc felt rather slow and repetitive, it was all about infiltrating some location, housed by some hero who defeated Emperor Gaz 5 years ago, and this hero took one of his body parts as a reward. After getting the remains and the trio would, every single time, question themselves as to why they are getting remains in the first place - to which Toru will always answer \"Let's just do it because we can.\"\\n\\n\r\nThings start to clear up when we hit the second season, in the second arc, when White Chaika gets word from Guy to get her \"father's fortune\" on a secret island off a coast. As revelation upon revelation about her own past occurs, first from the Kraken Fayla who told her about her use as merely a tool to collect the remains and unlock a \"destiny\", and second from Iszmash, the wizard who carried out Gaz's dying wishes in creating a super powerful Gundo (magic weapon) - called Niva Lada. (+1 for plot development)\\n\\n\r\nAt this point of the story, it also begins to explore themes on whether Chaika was merely a \"tool\", akin to Niva Lada's role, in the story. Throughout the anime Chaika has been performing a role as a tool, and eventually, is revealed to simply be the \"magic\" that Gaz himself created to revive himself, but at the same time we can see that Chaika is more than that - despite being young and innocent, she has a personality, stubborn and all, and so does Niva Lada, and this autonomous nature of personality becomes a key driver of the plot, though it's a pity it only appears in the last episode. (+1 for depth)\\n\\n\r\nAlready we start to see snippets of how the anime is going end, and in the final arc, the Chaikas begin to gather at the principality of Hartgen, where it seems to be all part of a Black Chaika's plan to get all the remains at one place. After some long action, fighting and random duels, the Black Chaika finally managed to blackmail / steal from all the other Chaikas to finally get a hold of all the remains. At first, we are inclined to think that Hartgen was the perpetrator, but the plot gives a twist again - that it was instead Gaz who had all along planned his reincarnation. (+1 for plot twist)\\n\\n\r\nThen again, this twist was very well substantiated because honestly there were clues littered throughout the entire anime, and for the simple fact that gathering a magician's body parts together in one place was obviously going to revive him. Anyway, Gaz reincarnates and is able to acquire this huge source of magic power, and with Niva Lada in his hands, looks basically unstoppable. Specifically, the reveal of his pre-made satellite technology used for gathering feelings of people for magic fuel, was very ingenious, original and breathtaking to watch. (+1 for originality)\\n\\n\r\nToru goes on a suicide mission to defeat Gaz that we already know will fail, but enough about him because honestly, Toru sucks. Chaika ends up being the main hero of this story, and in a very fitting way - by recognizing Niva Lada as a \"person\" - and to saying the final line that she had been saying all along. The line that I found mostly repetitive and annoying throughout, but at the end giving the most fitting finishing line before killing the emperor with his own weapon, \"Father, funeral.\" That has been her objective all along, also making her the only Chaika that was able to kill her own father. (+1 for plot twist)\\n\\n\r\nWhen it comes to coherence though, the plot also suffers a bit as well.\\n\\n\r\nThroughout the first season, Toru and Akari continuously insist that it's okay if Chaika doesn't know who she really is, so long as she completes her objective. This is completely stupid and against common sense, especially when there are multiple Chaikas around. Even if they are task-oriented people, Saboteurs should at least have enough common sense and intuition to realize the importance of knowing how she got her objective in the first place and where she comes from. What if Chaika was brainwashed by bad people? Could they not have at least considered that possibility? I find it stupid that Toru and Akari make no effort to investigate and find out who Chaika really is - even Gilette did so, and all Gilette needed was to have one encounter with Chaika to set him thinking on the right track!\\n\\n\r\nIn episode 3 of S2, Toru's adamant insistence, that finding Gaz's remains is more important than Chaika's wish to see her father's fortune on the hidden island, is invariably stupid. Didn't Toru say before that a Saboteur's objective is his master's objective? If Chaika really wants to go to the island, what right does Toru have to convince to change her mind? In fact, why is Toru so fixated on this collection of remains when all he's doing is supposedly following his master's wishes? As a good saboteur he should be supporting Chaika when she said she wants to find the island. At least towards the end of the episode, Akari points out this contradiction between Toru's words and the \"law of Saboteur\" that he claims to live by, but I'm still penalizing for this under unreasonable character behaviour.\\n\\n\r\nAlso later on in the episode, Toru suggests that the reason why Clay Morgan didn't sell off the remains despite not wanting to be near them, was because he thought he would be cursed if he got rid of them. How does this make sense? If anything, it should be exactly the opposite - he should be scared of a curse if he kept them!\\n\\n\r\nIn episode 7, Toru and Akari are seen using these wooden snorkels to dive. Despite having these snorkels though, their heads still resurface when they need another breath of air. What's the point of having those snorkels if you're going to end up resurfacing anyway? Isn't the whole point of it supposed to keep you slightly more inconspicuous as you breathe through the snorkels, just slightly below the surface of the water?\\n\\n\r\nIn episode 9, we see the Chaikas being forced to battle it out in a duel orchestrated by the Black Chaika, whose goal was to capture White Chaika and force them to hand over the remains. Not a bad deal, but then why also capture Vivi who didn't have any remains? For entertainment? Also, Gillette's memory erasure was never fully explained. Why is it that only when his hand got cut off did his memories come back to him?\\n\\n\r\nAlso, the mystery behind Guy is never really fully explained. He seems to have mind controlling powers as we see in the scene where he saves Gillette from death by ordering all the soldiers around him to surround him using their bodies to protect him from the magic blast. He also seems to have multiple forms of himself towards the end. If Guy was really Gaz, as was suggestion by the similar voice and hairstyle, how did Gaz managed to create Guy? In fact, what's the point of having a human body if Gaz could simply use all his magic through Guy? Guy was basically invulnerable by all his appearing and disappearing.\\n\\n\r\nSo a total of 6 plot holes, unfortunately I can't give a bonus point for coherence.\\n\\n\r\nArt: 8/10\\n\\n\r\nAnimation: 3/3 - Very well done. I loved all the Gundo animations when magic was being used, and all the action scenes were very well animated.\\n\r\nAesthetics: 3/3 - Excellent. Character designs were very varied, many different outfit and hair colours, very pleasing to look at. Even the Fayla designs, demi-human designs were pretty good.\\n\r\nOP Sequence: 1/2 - I didn't really like the first season's one, but the second season had really nice OP sequence\\n\r\nED Sequence: 1/2 - Just beautiful with the wonderful designs. I liked S1 better than S2 ending sequence.\\n\\n\r\nSound: 10/10\\n\r\nOP Theme 1: 2/2\\n\r\nED Theme 1: 2/2 \\n\r\nOP Theme 2: 2/2\\n\r\nED Theme 2: 2/2\\n\r\nBackground Music: 2/2 - They also use the same music for most action scenes, and all the sinister scenes, but it's really good :)\\n\\n\r\nIt's amazing that all of the themes are just good - all catch and upbeat, exactly the way I like it!\\n\\n\r\nCharacters: 6/10\\n\\n\r\nThis section is probably where the anime may suffer a bit. We'll go through with the best characters, followed by the worst characters of the lot, from both protagonists and antagonists.\\n\\n\r\nMy favourite character definitely has to be Chaika Trabant. While all the other Chaikas are all cute, moe and pretty awesome as well, Chaika Trabant is like the epitome of innocence and cuteness. Her cheeks are always permanently blushing with that red tinge and she is voiced very well with that cutesy voice. She's a magic user so she has basically like a gazillion useful spells up her sleeve, and her stubborn and helpful nature means that she will insist that they save people along the way, like the demi-humans, even if they aren't necessarily part of the objective (+1 for cuteness, innocence and sincerity, +1 for magic usage).\\n\\n\r\nThe second best character would have to be Gillette. Despite being relegated to a supporting cast member, Gillette shows a high sense of duty, honour, responsibility, and also lots of courage and bravery - being able to stand up to an entire army, risking his life to save his friends, Viva and Zita in the Soara arc (+1 for bravery). He also shows us that he can think on his own and goes to research about Gaz and his connection with Chaika. Unfortunately, being a supporting cast meant that he doesn't get much screentime and despite playing a key role in the plot, is not developed any much further beyond that. But he's still very likeable as a character.\\n\\n\r\nThe other character worth special mention is Gaz himself, the main antagonist of the story, later revealed. He's a not the simple villain type role who only seeks destruction around the world, he merely uses war as a means to further magic research, to gain magic fuel, as well as power to rule over the entire continent (+1 for deep motives). While he may seem inherently cruel, and throughout the anime stays shrouded in mystery, he's also actually contributed lots to the progress of society with his research of magic tools, so perhaps he's not such a bad guy after all.\\n\\n\r\nLast but not least, the character that shows the most amount of growth through the anime is actually Vivi, the girl on Gillette team who not so secretly likes Gillette. At the beginning, she doesn't show much development, she was just portrayed as shy, and a bit like a tsundere-type, but once Gillette is reportedly dead by Leo, she transforms into a chaika herself and starts making things happen on her own rather than always clinging on to Gillette. Her determination really starts to show, and even though Nikolai was given mantle of leadership, it mostly seemed like it was Vivi who was the most influential in the group (+1 for character growth). It was also a pity that we didn't get to see more of this beautiful supporting character.\\n\\n\r\nNow we come to the rather problematic Toru and Akari. Sure, they are both good fighters, but beyond that they are nothing special. Their Iron-Blood Transformation was supposed to make them faster and stronger, but in almost every battle they end up just being on par with their opponents, hence making them actually physically weaker or making the transformation have so little effect that it's technically useless.\\n\\n\r\nToru is a major problem in this anime and it's a shame that he was given they main character role over others. Toru's main flaw is with his narrow-mindedness and ability to only think about the objective, following the \"Saboteur's Law\" which Shin has constantly reminded him that he isn't cut out to be a saboteur in the first place. Toru makes countless of annoying references about being a Saboteur, and while it's great to see that he has fervent loyalty to Chaika, his loyalty is also baseless and he fails to substantiate anything he does with any reasoning beyond \"It's my duty.\" Even at the last part when he goes on a suicide mission, it was simply for revenge on Gaz for calling Chaika just a tool? I mean, really what gives with this stupid male lead?\\n\\n\r\nThen we have the other stupid female lead, Akari. Akari is slightly more interesting because at least she has this brother complex that makes her say weird and inappropriate things about Toru, things like being wet, preying on girls and so on, but her character also fails to pull through. She maintains only 1 kind of facial expression throughout the show and I've honestly never seen her smile, cry, laugh or anything of the sort. She seems devoid of emotions and her character is reduced to nothing but \"brother complex\", which is very sad for one of the main characters.\\n\\n\r\nLuckily for the anime, it's saved by it's host of very varied and interesting supporting cast members like Fredrica, the adorable dragoon, Zite, Nikolai, Claudia the vineyard manager and even the whole of Chaika Bogdan (Red Chaika)'s group. All of them are just a really great cast that made the story a whole lot more interesting and enjoyable to watch. (+1 for variety of supporting cast)\\n\\n\r\nSo as a whole, the characters are mostly fine, save for the main characters Toru and Akari, whose backstory was pretty okay save for the fact that it didn't get any proper character development whacked into them somehow. This is a first for a set of main characters who have a backstory to have so little and so trivial development. Just a complete disappointment.\\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nThe suspense for this anime, despite it not being a mystery show, was pretty good and they managed to keep it up all the way until the Niva Lada arc, which by that time, I was honestly thinking the resolution was going to fall flat on it's face due to the number of unanswered questions, but eventually the anime delivered so I'm giving it a point. (+1 for suspense)\\n\\n\r\nThe action sequences in this anime were also very good from start to finish. Every episode had a good action scene in them and it was also using a combination of interesting magic spells coupled with saboteur-fighting, plus throw in a dragoon and you've got a great fight sequence (+3 for action).\\n\\n\r\nThere was also some parts of humour in the show, particularly with Akari's completely inappropriate and spontaneous comments that came out of her brother complex, every time that Toru gets wet or has to go with Chaika. Red Chaika's interactions with Toru when she was captured was also rather funny to watch. (+1 for comedy)\\n\\n\r\nAs for pacing, the story started off really slowly, with not much going on and the plot hardly progressing beyond collecting more remains. At this point, things and conversations could get so repetitive that it was tempting to just skip to where more key plot lines were being uncovered. Towards the middle, even as things were being revealed, it also took a really long time, with Blue Chaika (Layla), the Kraken, Iszhmash and finally Gaz himself to tell Chaika that she was a tool before it finally hit her. The good thing was, at least the story didn't end abruptly, and the resolution was pretty much complete. (+1 for satisfactory resolution)\\n\\n\r\nThis anime receives a bonus point for not having any filler episodes! (+1 bonus point)\\n\\n\r\nOverall: 7.25/10\\n\\n\r\nHaving watched Shingeki no Bahamut (an anime with a very similar plot line) before this, I was really expecting to be disappointed at the resolution. Fortunately, I wasn't, the anime resolves all the conflict in quite an amazing fashion, tying up most loose ends, and wrapping up a plot that had much fewer plot holes than that of Bahamut. Another key difference is that while Bahamut's forte lies in the exquisite nature of Favaro, the hero, Chaika's forte lies in the innocence and sincerity of Chaika, the tool. While both animes may seem similar, I ultimately enjoyed Chaika better than Bahamut, owing to a more consistent plot that had less plot holes overall, and a much better antagonist.",
            "date": "2015-03-19T01:57:00+00:00",
            "helpful_count": 59,
            "mal_id": 182682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=182682"
        },
        {
            "content": "Ha ha! man! this show got even more awesome! \r\nThe animation along with the intense amount of action was almost flawless! Thrilling! exciting, I mean the overall quality increased, and you can tell that the animators had themselves a jolly good time working on season 2.\r\nThere were so many things that I liked first one being that the main story is finally a clear as to who or what Chaika's are. Along with the main story that back-story that I've wanted has finally been explained too! because there were a few more questions I had as to why there were so many chaika's and honestlyit started to ruin my experiences however after getting the explaining I'm okay with it. The story was so interesting to the point where I marathon-ed both seasons 1 and 2 via Crunchyroll and knocked both of my reviews out today! that's how great it was. The amount of action is the strong point of this series. There should be no disagreement with this. It's like everything comes down to this finally conclusion where both Chaika's and squad has to complete their goal or fulfill their purpose. Now, biggest problem I had with Season 2 was that there were way too many damn Chaika's. It really got annoying after some times. I mean I know it's part of the story and all but there is a limit to how many of the same characters I can take. After more than 3 were confirmed I was saying to myself \"oh god dammit all.\" The ending was okay, I'm not going to spoil it but it is a bit of a cliffhanger... kind of. \\n\\n\r\nOne thing I said in an earlier review that I thing I now regret is saying that Chaika's speech pattern is annoying. Once I got used to her, her speech became really cute! CHAIKA WANT, SEASON 3, NOW! I'd also like to take back the comment about her seiyuu too... my bad. Moving along from those comments, my comments etc. With this seasons, I liked seeing new characters, that weren't Chaika just thought I'd add that again. Because while most of them were not of significant importance to the story, they still provided enough entertainment for me to enjoy. Examples of course the tournament on episode 7 and onward to final boss.\\n\\n\r\nMoving on finally to the soundtrack it was pretty nice. I said and keep to my word that the music helps improve the dramatic battle sequences. The OP and ED songs were not that interesting to me. I didn't r\\n\\n\r\nReally care for the songs again this season. So I don't have too much to add on that setting.\\n\r\nEnjoyment 10/10 I love watching shows that keep me entertained more than keep me waiting. Some shows that I like will let drama build and build then deliver its good. However Chaika it's almost nonstop in your face action.. Gosh the last sentences sound kind of lewd, don't they? Hmm anyway Overall I have to give Season 2 8/10 because it was phenomenal in many ways!",
            "date": "2016-04-18T11:37:00+00:00",
            "helpful_count": 33,
            "mal_id": 216645,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=216645"
        },
        {
            "content": "I waited till the whole anime was over. Warning! It may contain spoilers. I try not to.\r\nThe anime is done now. I don't know about the manga. I was pleased by the first season and more excited by the second season. The story was good through the whole season except the last episode. It felt like easily done, we don't have the time to make it perfect. But still the rest of the anime make it all a good fit. I wished to see more of the battles for the remains of the emperor. \r\nThe characters where nice. I wished to see a lot moreChaikas around the anime instead only the last episodes. The story contains only the white Chaika and sometimes the red Chaika. But through the story you hear that there is a lot of Chaikas. So why only those 2 mainly and the black one with her puppets in the end? A little dissepointed though. The other characters where avarange. The Gillette Sqaud was on 3 people a little in detailed. I am talking about Gillette ofcourse, Vivi and Stora. The others of the sqaud you know the names and that is basically it. Toru, Fredirika, Chaika and Akari was where the anime was over. You know them good at the end. You know what they were going to do.\\n\\n\r\nLike I said. I like the anime. That's why Enjoyment is a 9. Story is an 8. Character ( Toru, Fredirika, Chaika and Akari) also an 8. Art was very normal so but still okay same as sound both a 7. Overall it is still an 8. \\n\\n\r\nI would recommend this anime. If you love an adventure, some weird humor, a dragon and magic. And that you are okay with pieces of the human body.",
            "date": "2014-12-13T02:01:00+00:00",
            "helpful_count": 28,
            "mal_id": 171995,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/518989.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KingdomHeart",
                "username": "KingdomHeart"
            },
            "url": "https://myanimelist.net/reviews.php?id=171995"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nA famous piece of music contains the line, \"War, what is it good for?\" And the response is, \"Absolutely nothing.\" War brings about destruction, famine, despair, and global bloodshed. While not technically nothing, it's definitely something that shouldn't be desired. Yet, for some people, war, or to a lesser degree, violence, is just in the nature of their hearts. Some describe war as an inevitability, while others still attempt to thwart such onslaughts. Hitsugi no Chaika: Avenging Battle is a mix of the two ideas, a mix that is a significant step down from the original season.\r\nSTORY\r\nAvenging Battlecontinues where Hitsugi no Chaika left off. Toru, Akari, and (of course) Chaika are still looking for the remaining body pieces of Emperor Gaz, Chaika's father, in order to fulfill Chaika's wish of providing him a proper funeral.\\n\\n\r\nThe first season did a lot of things right: an intriguing world, fun cast of characters, and a journey with a seemingly peaceful end-goal in mind. For all intents and purposes, the second season is no different. It's more of the same cast doing what they can to achieve Chaika's dream. However, whether it be the journey coming to an end or the rather strange plot points, it just doesn't feel quite the same. The narrative mostly jumps between differing locations in order to provide us with new information in order to make the story seem coherent. That is, instead of Toru and Akari investigating this world and getting to the bottom of the mystery, they are sort of forced to just \"go with the flow.\"\\n\\n\r\nThis \"flow\" is quite choppy. Many of the plot points that occur are either left unexplained or never seem to hold much substance: Gaz's fortune, Guy's omnipresence, Vivi's transformation, etc. Now, the argument here is that most of it can just be attributed to \"magic,\" but that's a rather contrived excuse to avoid providing reason to many of the occurrences. Much of the fault lies with the abysmal ending. Where the majority of the show leaves things unexplained, the conclusion leaves many open-ended areas. This includes for many of the characters as well as the story as a whole. Perhaps the idea is to continue with an OVA or movie of some sort, but as it stands, this season is entirely incomplete.\\n\\n\r\nTrying to dig deeper, and linking back to my introduction, the show tries to look at the idea behind war and whether or not it can be prevented. To an extent, it does this moderately well. Overall, Chaika is a story about war. It's effect on society, the environment, and on the future of the people involved. The show's answer to stopping violence is with more violence, and while that may seem silly, it works. While people may want or wish for violence to just up and stop with peaceful protest all of the time, there are instances when resorting to such measures is unfortunately necessary. Avenging Battle provides such a setting to demonstrate this idea, and while the inconsistent story telling tends to get in the way, this idea is not lost in the process.\\n\\n\r\nANIMATION\\n\\n\r\nAvenging Battle maintains the same art style that was employed by its first season. The character designs themselves are generally well thought out, with each of the Chaikas having a particular allure to them due to their hair and personal coloring. Toru, Akari, Frederica, and the rest of the cast are also unique enough to be distinguishable.\\n\\n\r\nOf note are the settings involved. Invisible, off-shore islands, a foreboding castle, and local towns provide great fantasy locations that lend to the overall atmosphere.\\n\\n\r\nFinally, the actual animation involved is usually above average. The fights are easy to follow during duels, there exist both large and small scale battles, long-range skirmishes, and air-raids. In other words, there is no shortage of opportunities for the anime to show off its animation skills.\\n\\n\r\nCHARACTERS\\n\\n\r\nThis time around, Avenging Battle sadly foregoes character development in order to focus on the story, and since the story became a mess, the characters are incapable of picking up the slack.\\n\\n\r\nPerhaps it's best to start with Toru and Akari. At this point, we know who they are: Toru is level-headed and looking to perform his job to the best of his ability, while Akari is trying to find the inside of her brother's pants rather than trying to find the next Gaz piece. As they are, they're fun people. Akari is more or less relegated to the sidelines this time around, which I can forgive. However, Toru is placed in a strange spot. His wishy-washy feelings toward Chaika and his general lack of emotion are never given an opportunity to flourish. He is literally just there to be Chaika's guard rather than become someone interesting.\\n\\n\r\nOne of the biggest disappointments comes from the final antagonist, who is not too terribly hard to guess. The build-up his immense, and the pay-off is extremely lackluster. Around for less than a single episode, his purpose is to present the message talked about earlier, that war is a cycle that will never truly end. The issue with him is that he is way too much of a final boss. Beyond over-powered, his capabilities as a person were beyond anything the show had to offer. And his quick defeat has zero impact because of his lack of presence. This is odd, considering his \"presence\" throughout both seasons. But this almost had to happen when considering his aforementioned powers; he is so strong that if not dealt with immediately there would literally be no more Chaika.\\n\\n\r\nFinally, and since her name has been mentioned enough already, Chaika at least tries to support the cast. Per usual, her broken speech pattern, bright whiteness, and gundo are back. One thing that is missing, however, is the cute Chaika of old. This is mainly due in part to the tonal shift of the show going from adventurous to arduous. The show becomes more serious, and with that, Chaika loses part of her charm.\\n\\n\r\nPart of her development for this final season was to have her come to the realization of who she actually is, since that was a rather important question and has been for a long time. Such questions are finally answered, and for a time it seems as if Chaika learns and grows from the revelation. However, the show doesn't really allude back to such facts, and when it does, it seems as if Chaika actually hasn't developed at all, maintaining the same reaction and shock from the first time. Even right up until the end, the idea of who she is as a person isn't looked at with enough light to warrant her a well thought-out character, which is a huge disappointment considering everything she's been through.\\n\\n\r\nSOUND\\n\\n\r\nThe OP has the same feeling as its season one counterpart, with the vocals and hard guitar taking the lead. The song gets considerably better when it picks up at around the half-way point, and ends on both a literal and figurative high note.\\n\\n\r\nAs with the OP, the ED pays homage to the first season. The soft singing and ambient instruments give an eerie tone that fits nicely with the atmosphere of what goes on within the anime. It is also quite catchy in certain sections.\\n\\n\r\nBoth the OP and ED, however, are okay at best and are really not standalone pieces.\\n\\n\r\nOddly, I find the soundtrack to be stronger than the OP and ED. Of special note is the fast-paced, stepping piece that usually plays during tense fight scenes. It makes the viewer feel that much more engaged with what is occurring on-screen.\\n\\n\r\nAs for voice acting, Chika Anzai (yes, not \"Chaika\") performs nicely as Chaika once more, giving her the iconic voice and speech we all know about her today.\\n\\n\r\nENJOYMENT\\n\\n\r\nThe anime itself had to make a tough choice, and that was deciding to split up the content into two separate seasons. The way it all goes down, I believe that this was an incorrect decision. The ending is rather lame and what goes on in the middle is too grandiose or nonsensical to work. Only the beginning arc of the second season felt like it belonged. There we had nice character interactions, more history about the world, and some of the more interesting battles. Afterwards, it felt more like the show was trying to feed us as much information as possible to make us satisfied.\\n\\n\r\nAkari and Chaika are some of the main reasons for why I liked watching this one all the way through. Their personalities and way of acting never really got old (at least, when they were being true to themselves), and same goes for Frederica. Sure, she is a huge convenient plot device, but I enjoyed having her around when she was needed the most.\\n\\n\r\nMaybe given a few more episodes or at least some type of continuation can we call Hitsugi no Chaika: Avenging Battle fulfilling. But when everything wrapped up, it just didn't quite live up to its predecessor.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, inconsistent, terrible ending, lost message\\n\\n\r\nAnimation: Good, fantastical setting with a plethora of fight scenes\\n\\n\r\nCharacters: Bad, lame final antagonist, weak main cast\\n\\n\r\nSound: Fine, okay OP and ED, okay soundtrack, fine VA work\\n\\n\r\nEnjoyment: Fine, felt like \"no Hitsugi no Chaika\"\\n\\n\r\nFinal Score: 4/10",
            "date": "2014-12-10T13:13:00+00:00",
            "helpful_count": 23,
            "mal_id": 171697,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=171697"
        },
        {
            "content": "Hello everyone!\r\nI was expecting much from this season of Chaika, after I finished watching the first season expecting much from the second and was great.\r\nThe story of getting the remains of the parents has been fine integrante, namely because they had other Chaikas, the battles, music (the opening fabulous), well designed characters, I love Fredrica :3 ,and art make this anime in my opinion one the best of 2014.\r\nI would have given it a 10/10 but I feel that some things were in the air (must watch the anime and you will realize) and just 10 chapters seemed a final very forced. \r\n9/10 Recommended 100%\r\nthankyou for reading!!!",
            "date": "2014-12-20T19:34:00+00:00",
            "helpful_count": 21,
            "mal_id": 173339,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1816167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/titoman12",
                "username": "titoman12"
            },
            "url": "https://myanimelist.net/reviews.php?id=173339"
        },
        {
            "content": "Anime...Hitsugi no Chaika: Avenging Battle....now finish, man I'm speaking like Yoda, here, anyways the season 2 is finally over and for that I'm gonna make my review.\r\nStory\r\nWhat we have is basically a continuation of the previous season where a Chaika finally accomplishes her mission....of course it was in a indirect situation where she has to fight to gain possession of Arthur Gaz's parts and like any quest it has to end. What I like about the story of this anime is how she keep her goal to bury his father's remains which of course it ended in a very good climax despite of the rush,and oh when she did say \"bury\".....well it doesn't always mean that has to be on the ground, it can sometime be by fire. Ok, so it was rushed, who cares? as long as we see Arthur Gaz's demise and to me, its an 8 for the story.\\n\\n\\n\r\nArt  \\n\\n\r\nTbh, I just have nothing to say about the art of this anime, in fact I don't even care if the cast would wearing school uniforms. I'm just after the content. But I do have some issues with Chaika Trabant's eyelash where I find it to be too ugly. My verdict for the art, a 5.\\n\\n\r\nSound \\n\\n\r\nI find Chaika Trabant's voice very cutsey and so as Toru's voice, but not with Akira's voice since it kinda project a more mature tone given that she is younger than Toru, it would have been much better if Saito Chiwa did Akira's voice rather than Hara Yuko, also I kinda like  Albéric Gillette way of speaking since it establishes authority with honor, so its a 7 for this part.\\n\\n\\n\r\nCharacter\\n\\n\r\nHummmm, well let's see, I don't like the way as to how Chaika Trabant was portrayed as this character who speak like Yoda, where the sentence violates every grammatical rules, ok , so the way she speaks was a symptom of having to use her magical power, where every time she uses it she loses some of her memories, but does it have to affect her speech? Lousy, its not just Chaika Trabant, but also Chaika Bohdan, I can help but notice as to why it was only limited to the two, where there are other chaika's who seemingly speak normally. Also, I hate the fact that Chaika Trabant is the only one who has to hand carry her coffin, I mean, wtf was going on in mind of the original creator,  Sakaki, Ichirou for having her do that in the manga, anime or LH? For all I know since he could have had the main character, Chaika Trabant have the ability to magically put her baggage in some kind of magical portal where she can pull it out when needed, also the two other character like Toru and Akira, whom  Sakaki, Ichirou has them portrayed as \"Saboteurs\", now I don't know if he's trying to have some fun of his low vocabulary IQ or if he is just too chicken to use the term \"assassin\" for Toru and Akira since basically that what the two does. Now let's go to the two \"Saboteurs, Akira and Toru, at first I'm annoyed that those two always get to have the upper hand over their opponents, however my mood for them has change when the two were finally got owned on the few remaining episodes which kinda provide me with such enjoyment, frankly I hate the fact that they are called \"Saboteurs\" where in fact the term \"assassin\" would have been a better fit for the two, since that what they really do. Now ever I've started watching the 1st season I've always like that those two \"Saboteurs\" would be owned by the  Gillette Corps, but alas, it didn't happen and it would have to be Shin Acura who has to owned them, so for getting to owned Toru and Akira, I'm giving this part a 8, which btw the score is for  Shin Acura.   \\n\\n\\n\r\nEnjoyment and Overall\\n\\n\r\nIt was a good 10 episode, where it has some degree of development and the fact that the Chaika Trabant was able to do what she has to do, where it was too bad for Arthur Gaz who seemingly didn't saw that a Chaika's task can go both ways where he was revived and in the end met his demise in the hands of the same Chaika whom he deemed as a tool and that makes it enjoyable. Though, it is very good I still can't deny that the last episode was rushed, so overall it a 7 all the way.  \\n\\n\r\nReview..finish..no more...to say.",
            "date": "2014-12-11T11:11:00+00:00",
            "helpful_count": 14,
            "mal_id": 171803,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4212159.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tres_Bandidas",
                "username": "Tres_Bandidas"
            },
            "url": "https://myanimelist.net/reviews.php?id=171803"
        },
        {
            "content": "There seems to be a trend going on with anime these days.  With any show with 13 episodes gets a sequel, there always seems to only be an allotted 10 episodes for the sequel.  I dunno why.  Anyway, real introduction time.  Chaika, Chaika, Chaika.  When a word is said over and over again, it is said that it will lose its meaning eventually as the same syllables are played over like a broken record.  But what happens when you put a little something...more into a word's meaning, hmm?  \r\nStory (7.43/10):  The story of Hitsugi no Chaika: AvengingBattle stays relatively the same as its predecessor in terms of main story which is to gather the remains of the Emperor Gaz.  Our protagonists Toru, Akari, and of course, the Coffin princess herself, Chaika, continue their task in finding the severed remains of the emperor that befell the Allied six nations to war.  \\n\\n\r\nWhat I've always liked about the Chaika series is just how unique it is.  The story of Chaika has always played out as a sort of fill in the blanks game where after every piece of the Emperor is obtained, more and more of the story is unfolded.  The first season benefited highly from this storytelling perspective because it never revealed too much or too little with every bit of story it was giving.  The second season does continue this format of giving the crucial backstory to our main characters while progressing the plot.  \\n\\n\r\nWhat I also feel is beneficial about this sequel is also from a difference perspective.  While the goals that the characters try to achieve with every arc are virtually the same, the settings and individual arc storylines are different enough in terms of setting from one arc to the other to give off a different feel as to what the characters have to do in order to accomplish their goals.  \\n\\n\r\nAnother point I have to make is magic.  Magic is a very subjective term in anime because it has a wide variety of terms and spectrums that pertain to individual series.  It can either be total wands and spells like Zero no Tsukaima, or it can be based on the complicated theorems and terms that can break our heads like Mahouka.  Chaika achieves what I believe is a perfect balance of both complexity and \"fuck it, it's magic\" because  it logically make sense in the world that they're in.  Not to mention that it's centrally tied to the story which as an end result forces out more explanation and thus, and easier understanding.  Plus, they use freaking sniper rifles to fire magic.  That is awesome.\\n\\n\r\nHowever, no series is without its flaws.  Let's start with a really obvious one, time crunch.  Seeing as how this series only got a total of 10 episodes for its runtime, a few fears ran into my mind.  1.  There would be a lot of uneven pacing, rushing through some parts of the story whilst leaving other maybe more important parts high and dry.  2.  Story may be incomplete by the end of it.  Luckily, the second point wasn't anything to worry about, but the first one is definitely an issue.\\n\\n\r\nRush, rush, rush.  Pacing.  I stated in my previous Chaika review that the pacing can get a bit awkward at times.  This sequel is no different.  In fact, it's even more so of a problem than before.  Because of the 10 episode time crunch, some parts of the series were what I would call half-baked.  When you're doing anything with mystery, you need time to fully explain what exactly is going on because the audience anticipates an explanation to the mystery.  Chaika does this a little bit by speeding through a couple of what I would call crucial explanations, sort of glossing them over as if it was nothing.  In fact, THE most crucial explanation was given maybe like 4 total minutes of explanation and I feel sad because I personally was anticipating a good explanation as to WHO Chaika was.  Plus, the final episode was horrendously rushed, making me feel like they could've made the finale just a bit more epic with more screentime because having that an epic finale, a finale that you anticipated for and thought would be awesome and epic, be boiled into one episode, kinda ruins the tension since you basically solve an ENTIRE PLOTLINE in 23 minutes.  (Looking at you as well, DAL II)\\n\\n\r\nAnd finally, and this is the most crucial part, the story ends.  A lot of anime adaptations I see don't really have a satisfactory ending, as they either try to end the story but end up failing miserably, or make it so open-ended that you have to either read the source material to know what is going to happen later, or do it just so they can laugh at their fanbase.  While the end I felt was kinda...meh due to the fact that like I said, bad pacing issues (and pretty bad ones at that), it ended, the story is done and over, and that's the best thing I can ask for any anime.\\n\\n\r\nOverview:\\n\r\n+ Good storytelling\\n\r\n+ Good integration and explanation of magic\\n\r\n+ It Ends\\n\r\n-  Pacing can get bad at times\\n\r\n-  The final rush to the end\\n\\n\r\nCharacter (7.01/10):  The characters in Hitsugi no Chaika are characters I've praised before due to their uniqueness as characters and their attitudes towards certain events and people around them.\\n\\n\r\nUp first is our main protagonist Toru, the sabetour (basically a mercenary) that is employed by Chaika to help gather her father's remains.  As a sabetour, he thinks himself nothing more than a tool used to help his master achieve his/her goal thinking more as a strategist with a level head in order to achieve said goal.  What I like about Toru's character is the growth.  As time passes on, you can clearly see what his motives are and think more of himself and for himself as he becomes less and less of a tool.  His personality doesn't really change that much, but his viewpoints in life certainly do.  \\n\\n\r\nAnd then we have Akari who is...Akari; kinda hard to explain her.  She is similar to her \"brother\" (since they're not blood related) in the sense that she takes the tasks she is given seriously and is also like a sabetour, treating herself like a tool for her master more than anything else.  Honestly, she doesn't change much in the series and sort of fades away into the background as time goes on since she truly doesn't get any development to her character.  \\n\\n\r\nAnd then we have Chaika.  Chaika, Chaika, Chaika.  Chaika as the sort of main female protagonist has always been a very interesting character what with her broken speech pattern, unknown past, and desire to give her father a funeral by burying the dead remains.  Her character for the most part has been shaped in large due to the effect of the word \"Chaika\" in the six Allied nations as well as the little hints of backstory that we get concerning her character.  But that's really where it ends.  While Chaika herself does get a bit of development, she really doesn't change very much aside from having to think about who she is after finding out what exactly \"Chaika\" means.  \\n\\n\r\nWith the main cast, we have the supporting cast of characters of varying importance starting at the bottom with the Nation leaders who don't do anything beyond talk and discuss what is going on in terms of plot around a round table, the Gillette Squad that act as \"protagonists\" since the main characters of this series are technically doing something bad, the red Chaika and her small band of mercenaries, and Frederica, who once again GETS KILLED.  (I mean seriously.  You did this last season!  You don't kill the same character AGAIN in the same point of the series!)  The supporting cast does little more than to add obstacles or give more explanation to the world that is Hitsugi no Chaika.  They each have their own personalities and motives, and some of them are even quite interesting but, in comparison to what kind of characters they were in the first season, they have little to no change.\\n\\n\r\nOverview:\\n\r\n+ Decent character growth\\n\r\n+/-  Unchanged supporting cast\\n\r\n- Some MC's lacked any proper development\\n\\n\r\nArt and Sound (8.35/10 and 7.98/10):  Hitsugi no Chaika was produced by Studio Bones.  Yeah, no explanation required as to how good the animation.  The entire series is done in a very crisp looking animation that utilizes many dark themes to show that this show is not some happy go lucky magic show.  Many of the characters are wonderfully detailed, showcasing the many details that are involved with their designs such as Chaika's dress, Fredica's dragon form, and of course, the magic circles. The action and movement in this show is very fluid and nothing visually looks clunky.\\n\\n\r\nIn addition, the show gets special mention for its magic circles as the magic in this show utilizes the formation of magic circles.  Let me tell you one thing, they're fantastically done.  There is an absurd amount of detail that goes into every one of these circles and the character utilize these things A LOT.  \\n\\n\r\nIn terms of soundtrack, similar to its predecessor, Avenging Battle hosts a very unique sound.  Both its OP and ED use fast-paced music that have a very yearning and hopeful tone to them, in addition to some darker areas in the songs, giving the audience a feel of what is to come when they watch the show.  Personally, the Chaika soundtrack is one of my personal favorites because its actiony, but not sterotypically actiony.  Plus, if you like electric guitar solos, you'll get a lot of that.\\n\\n\r\nOverview:\\n\r\n+ Studio Bones (Aka, fantastic artwork)\\n\r\n+ Great soundtrack\\n\\n\r\nPersonal Enjoyment (8.01/10):  Chaika I've always felt was a very underrated series.  Many people don't like it and I'm a bit saddened by that because it does offer a very interesting story idea in addition to its unique characters and way of expressing plot.  I was very excited for the second season because the first one had enthralled me with its story and the mystery of what Chaika is.  And now, having had finished the series, I can honestly say that the second season of Chaika is a good sequel.  It isn't without its flaws, but it still is a good show.  Onto the three questions!\\n\\n\r\nWhat did I like about this show?\\n\\n\r\nWhat I liked about it is that it was a true sequel that did pick up from where the last one ended off.  A little bit of time passed, but being able to see what happened after the first season and then continuing on was a good thing.  In addition to the unique plot, characters, and soundtrack, the series also ends fully, as in nothing more beyond it storywise.  \\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nA big complaint I have now is well, I don't have anymore Chaika to watch.  Another thing is its horrendous pacing at times.  Some explanations were cut short and/or glossed over in order to move the plot around due to time constraints.  Explanations are very important when it comes to mystery anime, and when you cut down even one, there are some issues.  In addition, I felt that the end of the series was rather sudden.  After the final event is over, we get an epilogue as to what happens afterwards which really doesn't explain much heavily since they squeezed all of the afterstories in 5 minutes of runtime.  Also, 10 episodes.  Why not make it a proper sequel with a length of 13 or something like that?  You wouldn't have to squeeze in so much information in such a small timeframe.  Really.  \\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you're a fan of mystery anime or magic anime, go for it.  Hitsugi no Chaika is what I define as an underrated anime because it solely focuses on its story and its characters without any fail.  It puts the story first beyond anything else and that is why I praise it so highly.  There is no ecchi crap that you'll find with this series, no romantic subplots (ok, maybe one REALLY minor one), and no sidestories.  It does have its fair share of pacing problems, but overall, this is a good show.  Honest.  \\n\\n\r\nOverall Score: 7.42/10",
            "date": "2014-12-10T17:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 171713,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=171713"
        },
        {
            "content": "So, this will be a long one, the long story short, it really sucks. It loses all the initial charm in season 1 and it results in all characaters being horrible, I don't feel strongly for a single character and there are more plot holes than the holes in swiss cheese. It's a waste of time, utterly. \r\nSeason two further went down a bad path and the flaws became all the more apparent for various reasons, be it the rushed pace, the more \"serious\" mood, the horrible settings and decisions or the characters themselves. Thus the score had to be lowered greatly, actually I should’veprobably lowered it more than I did, because it’s probably not worth this much seeing how many giant flaws are present, I even started feeling like it was too much of a chore to watch and just wanted to drop it because it sucked too much, but I stuck with it because I had already watched most of it. \\n\\n\r\nThanks to how it was executed, I started feeling even less attachment to characters I didn’t really care much for in the first place(such as the mc team). The only character I actually truly like is fredrika, the dragoon, she had some nice zest, not that it was used properly. The characters overall feel as if they lack things, there isn’t enough spirit and they feel pretty damn artificial. Their motivations are extremely flawed and illogical, absolutely not something you’d connect to people like them. It just feels empty, which in turn reduces my enjoyment greatly as I don’t really care much about anyone, be it from the mc team or villain teams. \\n\\n\r\nThe story also just keeps on getting worse, what wasn’t good to begin with starts becoming even more horrible. The chaika issue where there’s a lot of her and whatever is just overdone. The plot going on behind the scenes is silly and stupid(the very reason for the chaikas existing and as to why gaz did all of this is so damn ridiculous and half-arsed that I can’t even bother to care anymore, instead just marking this entire thing as a huge failure not worthy of anyones time), it’s also extremely simple to the point where I guessed correctly what was happening and what the plot would be from the first few minutes of episode 1 in season 1. The only thing I couldn’t guess back then was the chaika issue, but as soon as we became aware of there being multiple versions of her, it became extremely clear what her purpose was and why there’s many of her around. \\n\\n\r\nI also absolutely hate how the mc team doesn't even have a proper purpose, they’re just moving forward because they have nothing better to do. Chaika(the mc team one) just wants to keep on collecting parts even after becoming aware of the truth that she’s just a tool and not even a true daughter of gaz(although reluctant to accept it, she denies it until the end and although the mc knows better, he doesn't give a f*ck), for the moronic reason that “she doesn’t know what else to do and is kinda curious” or something. The mc and his sister tags along because they also have nothing better to do than collect body parts while knowing they’re being used and it will bring nothing but demerits such as fatal danger and being used. They just don’t seem to care about anything and their motivations are just… unbelievably foolish. \\n\\n\r\nI also hate how their personalities doesn’t fit their character settings, neither does their powers seem reasonable considering how they’re supposed to be stronger than this, being trained from youth and having superhuman abilities, that's the ONLY good trait of this mc, yet it's removed all the time. Only the strongest of people should be able to put up a fight, but turns out they’re actually not that big of a deal most of the time unless the situation calls for it, because he keeps on getting bested by people that can’t possible have similar training or skill to him so that the plot can advance as the author wants it to. \\n\\n\r\nOh, and if the people have similar training to him, he gets owned extremely fast without a chance to fight back even if it’s a 2v1 with his sister helping out, utterly pathetic, I can’t get to like a mc like this, not when he needs to form a special contract with a dragoon to fight people he should be able to fight even before. Not that I didn’t like that he formed a contract, I really liked the dragoon in question after all, too bad that he just can’t get around to doing it before it’s pretty much too late already like the moron he is, waiting until the final boss battle in the last episode when he literally has no other choice, because it’s suuuuuch a big decision and change, now he has new, shiny armour and skills/abilities after all, so he can’t possibly keep on doing what he did before but while using the new powers! Naaaah. Well, it’s not like he got much stronger, he just became less skilled and more of a brute who charges head on as he can heal everything, talk about throwing pearls to pigs who can't utilize them. Heh, but something happened, perhaps the only hilarious thing in this season, the mc didn’t even get to do anything after “building up the courage” to form a contract with fredrika. Nah, he just got beat up like a sandbag several times or something and had nothing at all to do with the conclusion, maybe he might've helped with some motivation at best. Pathetic to the very end, what was the point of him anyway?\\n\\n\r\nWe're supposed to like chaika, right? She's kinda like the mc after all, at least she's the main focus here, sadly it's impossible to do so. Chaika keeps on making foolish decisions due to her “innocence” despite being told off again and again, it truly pisses me off more and more every time she does it, I just want to facepalm as I cringe hard while witnessing it(since season 2 is more serious and worthless, it's way more obvious and irritating than in season 1). She seems to have zero ability to learn or grasp her situation nor judge people, it’s not at the level of mere stupidity or foolishness after a while and it becomes clear that she’s just, excuse my choice of words, damn retarded, to the point where she might as well die and be replaced with another chaika, the red one seems more interesting for example(well, she also became irritating in season 2, seemingly having similar levels of IQ to the mc team chaika). She doesn’t truly develop throughout the entire series, the biggest development would be at the very end, but who cares when the story is already over? It was also a forced development, not that she actually matured or anything, she just was kinda reset(I'll leave it at that to avoid spoiling what truly happened), we don't even get to see more than a few seconds of it, truly displeasing. She's an extremely crappy character that only weighs people down with her immaturity and personality, especially when things got more serious. Even her way of talking gets more and more annoying and one starts getting the desire to punch her until she speaks like a human instead of speaking in broken japanese(well, it’s not that her pronunciation is weird, it’s that she can't speak properly, like not using suffixes, not using particles and using words that you wouldn’t use normally). \\n\\n\r\nI guess you see how this got worse and worse now. I’m giving this a 4/10 for pity since it had good promise, interesting initial settings and the first season was a fair bit better. It got to the point where I just started rolling my eyes at every serious point, feeling that they should just stop the fake crap already and stop being so damn retarded. I have to say it was kinda amusing that they, in the end, won only because some “love and friendship” bullsh*t where a supposedly emotionless tool/half-machine somehow took their previous friendship too seriously after shallow and short interaction with chaika and took some words to heart and thus goes back to chaika. The battle was actually won thanks to chaika being a moron who treats everyone and everything with such “kindness” without thinking. Holy sh*t, it’s rare for me to cringe so hard that I laugh at the sheer impossibility of the situation, it wasn’t executed well even a little. \\n\\n\r\nFrom start to end, none of the characters went through even a smidgen of development, nor were any characters good enough to be that likeable, fredrika was the most lovable character, but since the author didn’t keep her around enough and suppressed her personality when it mattered so that she felt way too fake, even she wasn’t that good, she actually didn’t say a single thing after forming the contract with the mc and that was at the very end, seemingly she disappeared or something without explanation. Sad. F*ck, it’s rare to see such a horrible story that fails in so many ways. By the way, the “gundo” that chaika used to end the battle got captured and no one cares, I guess that’s as far as this friendship and love power thing goes. I am officially disgusted, I feel mindraped in more ways than one. Give me back my time, how dare this author(or anime staff) make it seem interesting at the start but make it turn out like this? Well, it seems like extremely much was changed in the anime and isn't the same as the novel at all, that season 1 was much more in line with the original albeit with a fair amount of new stuff, so maybe that's the issue. It might not be the original author’s fault that it turned into super garbage from at least being average or a bit above average(it was never that good though, just the idea for the setting was initially awesome and had great promise). By the way, unlike season 1, I see nothing resembling comedy in season 2. I guess that's one of the big issues here, how they decided to make it serious and thus lost EVERYTHING in the process just to advance a half-arsed, rushed story that sucked in the first place.",
            "date": "2018-10-15T05:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 291793,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=291793"
        },
        {
            "content": "Hitsugi no Chaika: Avenging Battle\r\nWhere the story ends by finding all the remains of the most powerful wizard of all time. \r\nBy this phrase, I think you can guess how is this going to end...you know...he is the most powerful wizard of all time, and the smartest (or not).\r\nI got to be honest, I was kind disappointed with the second season. The first season had most of the story pretty cooked to be eaten on this season..But still this being an action anime, we didn't\u0092 get the opportunity to see much action. The fight were probably the down side of this season, were there wasalways an overpowered side, with no suspense or excitement. It felt kind empty and sad. (\"most powerful wizard my a**\")\\n\\n\r\nWeren't you here to see that badass dragon to kick some a**? Or him? \\n\\n\r\nThe ending, in one word - empty.\\n\r\nIt told me nothing, is it a happy ending? But where is everyone? Is she okay? What? \\n\\n\r\nLet's stop the chitchat and go to what you came here for.\\n\\n\r\nScore\\n\\n\r\n---- Story 7/10 ----\\n\\n\r\nIt's basically the continuation of the \"hunting\" for the remains of the \"most powerful wizard\", A.Gaz, but now even with that, they throw in a new quest to found a lost treasure of the wizard boss. But the sad part of the hunting is that it lost interest, there is no more sneaky peek saboteur getting into fights to steal the remains. Now they almost give them with no problems. And, being the last season, you can guess they get all the remains, the rest you can imagine what will happen...he actually is the \"most powerful wizard\"...but c\u0092mon the MOST POWERFUL with a battle of that style? Nhaaa...and the ending, really empty. Just some random images put together. Not that good to end an anime. But still it was a solid story. \\n\\n\r\n---- Art 8/10 ----\\n\\n\r\nI can say that I like almost all kinds of art, and this one had its style, I am no artist to judge how good this was. If you have doubts, just go to YouTube and watch a little segment.\\n\\n\r\n---- Sound 7/10 ----\\n\\n\r\nChaika's voice. 10/10 Me being a cuteness fan, she was the best :D\\n\r\nThe rest of the voices were pretty good\\n\r\nBut music? Nothing to be memorable.\\n\r\nOnly 1 OP and 1ED.\\n\\n\r\n---- Character 7/10 -----\\n\\n\r\nSo many Chaikas! o/ But only our Chaika is the cutest! :D\\n\\n\r\nWell, this season was kind weak on \"telling\" the story behind of the 3/4 hero\u0092s left, where the one more \"strong\" was the one that had the head. But still, it was forgettable.\\n\r\nThere were even more 2 downsides for the Character's. \\n\\n\r\nOne: The final enemy. Being final, we would say it needed to be a nice and long fight. But guess what. Nop\\n\\n\r\nSecond: The final \"form\" of Tooru, was so cool, but with a final enemy like that we didn't\u0092 even had the opportunity to see and feel its true potential. \\n\\n\r\nThe rest of the new characters presented were all forgettable. And me being stupid as I am, I was still hoping for my \"Romance\", but no, don\u0092t get that idea. There is nothing like that for you in here.\\n\\n\\n\r\n---- Enjoyment/Overall 8/10 ----- \\n\\n\r\nI actually enjoyed this anime. Not as much as i wanted, but still was kind satisfying. You have the fight segments mixed with some comedy, what was the refreshing side of it, by keeping you attached to the anime.\\n\r\nTbh, I felt a sadness inside be when I saw that this anime would only get 10 episodes...I was like will the fights and hunts fit in there? Well...it did...not like I wanted...but still..\\n\r\nI know mist of you will not agree with my final score. But I actually felt bad by giving a lower score to it.\\n\\n\r\nJust keep one thing in mind. No epic ending, No epic sounds, Funny and relaxing, small and fast.\\n\\n\r\nThank you for reading everything (like you actually did xD) and give me your response to it. I will delete any kind of hate/troll/irrational comment to my profile.\\n\\n\\n\\n",
            "date": "2015-01-03T08:46:00+00:00",
            "helpful_count": 11,
            "mal_id": 175919,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3334117.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Plinius",
                "username": "Plinius"
            },
            "url": "https://myanimelist.net/reviews.php?id=175919"
        },
        {
            "content": "As I've stated before, the trend of split-cour TV series (a series that will air its first half, take a season off, and then air its second half) has become increasingly more popular in the anime industry. Not only does it give the writers more time to think of ideas for the second half, but it also allows them to budget the animation better. By this logic, the second half should be just as good, if not better, than the first half, but is this always the case?To be honest, this was one of my most anticipated series for the Fall season, and the unique flair of fantasy mixed with pseudo-gothic elements from the first half has carried over nicely into the second half. However, in terms of having a stable story, Avenging Battle leaves a lot to be desired, and the reason for that is actually a bit odd considering the circumstances. As I mentions earlier, turning something into a split-cour series is usually done to relieve both the pockets of the budgeting committee and the brains of the writers, so it was a bit strange to see that Avenging Battle only has 10 episodes, while the first half has 12. While the reason for this doesn't seem clear, the result is obvious: the story went from being moderately paced in the first half to speeding off a cliff towards a conclusion in the second.\\n\\n\r\n          The last three or so episodes are especially guilty of this. There were many times throughout each episode where it felt like they were going through the Cliff Notes of what was actually supposed to happen in those scenes, resulting in rushed story lines, unexplained plot holes, and forgotten character development, ultimately leading to a final episode where a ton of events happened that didn't really seem to connect to each other. I have no doubts whatsoever that if this second cour had gotten 12 or 13 episodes, the pacing would have sat much better, but of course that isn't the case, so now we're left with plot threads dangling everywhere. Why did Vivi turn into a Chaika at the end of the first half? What exactly was the point of introducing the demi-humans if they're going to be forgotten completely after they left the island? What exactly happens when you make a contract with a dragoon? None of this is answered, and the series leaves us with a lot more questions that will never be satisfied.\\n\\n\r\n          Character development takes a rather noticeable hit because of this pacing issue as well. To be honest, pretty much all of the character development that was going to happen in this series happened during the first half, and only the main Chaika sees any significant changes in ﻿Avenging Battle, which only happens in the final episodes, and even then it feels rushed and poorly explained. Even the new characters that get introduced barely get any noteworthy developments, even the ones that are pretty much crucial to the plot of the entire series.\\n\\n\r\n          On a quick aside, without spoiling anything, there is a certain event that's been foreshadowed throughout the entire series and finally transpires in episode 9, and while this particular scene could have been written in any number of ways, the method they chose was, quite possibly, one of the worst possible ways they could have done it, creating a conglomerate of the weirdly gross and the unintentionally sexual. I bring this up because this a perfect example of what happens when you don't pace your writing properly. Really weird stuff starts happening, and unfortunately one of the images from that scene is now something I have permanently associated with this series.\\n\\n\r\n          Like the first cour, the animation was done by Studio Bones, and not much seems to have changed in between these two halves. The pseudo-gothic style and surprisingly diverse environments work really well for this series, but the animation itself still suffers from a lack of clarify and refinement, just like the first half.\\n\\n\r\n          There is currently no dub to speak of, though I would not be surprised if Seraphim Digital were to create one for this series.\\n\\n\r\n          The soundtrack was composed by Seikou Nagaoka, and while it does fill in the silence rather well with its intense orchestral sounds, nothing really stood out as particularly impressive. The opening theme \"Shikkoku wo Nuritsubuse\" by Iori Nomizu gives us another hard rock punch to drive us in, though this time with a bit more of an uplift that in the first half, while the ending theme \"Watashi wa Omae no Naka ni Iru\" by coffin princess (VAs Chika Anzai, Saeko Zougou, and Iori Nomizu) gives us another quick-paced dance number.\\n\\n\r\n          Overall, while I wouldn't say that this was a bad ending to the series, Avenging Battle certainly wasn't as good as the first half of Chaika, and it's rather disappointing to see the series not be allowed to flesh itself out more.",
            "date": "2014-12-10T17:55:00+00:00",
            "helpful_count": 11,
            "mal_id": 171717,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3337767.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/emberreviews",
                "username": "emberreviews"
            },
            "url": "https://myanimelist.net/reviews.php?id=171717"
        },
        {
            "content": "The original \"Hitsugi no Chaika\"was a pleasant surprise for most people. It started out as your average fantasy- filled with magic, swords, and a quest. It was slowly, but nicely, paced; however, it left the viewer with a lot of questions. \"Hitsugi no Chaika: Avenging Battle\" set out to answer what was left in the air, and possibly conclude the series. \r\n   The story in Chaika 2 started out very poor. It lost the intensity that the ending of Chaika 1 had, although many sequels do. The show leisurely found a footing and made its linear path to an almostdisappointing ending. The ending wasn't what was very bad, but it was the time leading up to the final episodes that was poorly done (specifically the introduction of Gaz being in episode 9 or so). Some might call it an attempt at an intricate plot, but it became almost predictable. Predictable or expected really; there weren't any surprises that would catch you off guard. It didn't resolve its romantic subplots, but finished off some of the other ones (Nikolai/Gillette squad) decently. I'm not satisfied with this ending. From the the hype that Gaz was given, it seems too unlikely that'd he'd be beaten so easily. 4/10 for story. \\n\\n\r\n   Animation was nice to look at, nothing much to talk about here. The fight scenes were ok, but it didn't have anything outstanding. 7/10\\n\\n\r\n   The opening for Chaika Dos was catchy, but not memorable enough. Same with the ending; it wasn't anything special. The OST blended fine with the art style to create it's fun but serious tone, and it was fine overall. 6/10\\n\\n\r\n   The characters weren't developed enough for my care. Shin was given very little screen time for his, somewhat, important role. Our MC's were developed enough in the first season, but didn't receive much this time around, which is fine.  Hartgen and the other heroes didn't get much backstory, which was disappointing. As well as the new Chaika's that were introduced. I was hoping for more, and was left disappointed. 5/10\\n\\n\r\n   Didn't enjoy this that much compared to the other, better series' this fall. 4/10\\n\\n\r\n   Overall, 5/10 for feeling uninteresting at times, but still keeping its fun charm. No matter what I said, it's not bad, but a mediocre series overall. It is still worth the watch if you've seen the first season. I wouldn't put this high on your priority list, but it is a nice, fun series. \\n\\n",
            "date": "2014-12-10T17:45:00+00:00",
            "helpful_count": 11,
            "mal_id": 171715,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3887743.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/EpicSawce",
                "username": "EpicSawce"
            },
            "url": "https://myanimelist.net/reviews.php?id=171715"
        },
        {
            "content": "The continuation of Hitsugi No Chaika...continues Hitsugi no Chaika. It doesn't improve upon it, it isn't a lot worse than the original, it just...continues.\r\nDifferences from the first season: The pacing of the story events is faster and the focus has partially shifted away from Tohru as the main character.\r\nSimilarities: Half of the episodes leading in to the climax have no point. The plot and characters don't really develop at all. Well, a couple of the side characters developed a bit this season, just none of the main three. The anime makes up for all this by having an intriguing premise and interesting world building orin-world philosophy. \\n\\n\r\nIs the cause of all conflict that humans are intrinsically unsatisfied with peace? Can good intentions prevail over evil wisdom? You might find out if you skip to the end of the season. \\n\\n\r\nAlso, they added ANOTHER loli. Because 4+ wasn't enough. I will give them this, though, the main villain who appears in the very last few episodes is genuinely creepy. Good job with a strong villain, guys. \\n\\n",
            "date": "2014-12-10T22:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 171755,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/evilteddybear101",
                "username": "evilteddybear101"
            },
            "url": "https://myanimelist.net/reviews.php?id=171755"
        },
        {
            "content": "Since this is the Second Season, most unanswered questions were answered here. Hitsugi no Chaika: Avenging Battle puts forth new questions in a deeper story about memories which define one's personality.\r\nStory: 9/10\r\nThe story that was started in the previous First Season ends here in the Second Season as we get to explore it in more depth. The conclusion was fitting, but felt a little bit rushed towards the end, especially the last episode. The pacing was fine throughout the other episodes otherwise. The story becomes more complex in this season as darker secrets appear to be uncovered. Sometimes sequels will completely ruin a show andsometimes they make it even better. This show did go deeper into the story and didn't stray away from it, so it wasn't worsened, but the quality of the story didn't improve either. The First Season already gave a good start to a good story and the Second Season finished it off with an appropriate conclusion. \\n\\n\r\nArt: 7/10\\n\r\nThe art is good, thus 7/10, but the problem in the art isn't because the animation is cheap, but that the character designs were nothing too admirable. The animation is actually great especially for battle scenes. It's just I've seen many shows out there that have amazing character designs that captivate me completely, but this show at least has a distinctive feel to it and definitely was far from bad. (Chaika's eyebrows) The background art was important to this show as it the characters travel, with their environment constantly changing, and it wasn't handled badly in any way at all.\\n\\n\r\nSound: 8/10\\n\r\nThe opening and ending still stayed consistent with theme of the story and the background music doesn't ever get old or annoying. The voices were my favorite part. I felt that the voice actors all portrayed their character's personalities really well. There are some shows where the voice and the character seem out of sync and unnatural, but this show definitely has a well done connection between the characters and the voice actors. Akari's voice really went well with her comedic remarks, Fredica's voice actor really did a good job of portraying her voice in all different forms (Dominica, the dragoon, and Fredrica). The voices for the other characters were definitely well thought out and even the beserk and antagonistic characters didn't sound like monsters. What caught me the most was Chaika's voice because I'm a fan of cute characters, but it wasn't overly cute up to the point where that was her only trait, making her a strong but adorable and lovable female lead.\\n\\n\r\nCharacter: 9/10\\n\r\nChaika wants to find out more about herself because she starts to feel uncertain about her existence. Tooru is against it, wanting to protect her from danger. Red Chaika starts becoming more active in stealing the remains getting one step ahead of the main cast. More Chaikas start appearing, one of them being the one the First Season ended off on: Vivi. The informant guy starts to have more of an active role than he did before. There's lots of character development and change everywhere, and each of the characters deal with the changing situation in their own way, since as noticed in the previous season, the personalities of the characters vary from one to another making it a diverse cast.  \\n\\n\r\nEnjoyment: 9/10\\n\r\nI really enjoyed this series from the moment I picked it up and the moment I finished. Chaika was an innocent, cute, and overall likable main female lead that was consistent with her character even as she learned more of the truths in the world. She really wasn't as weak as she seemed. Most female leads when hit with a tragic truth go down in despair and need the protagonist to cheer them and motivate them back up again, but Chaika didn't need to. My enjoyment came mostly out of the characters: Chaika's strong will and Akari's well delivered comedic remarks. If the story is good, but the characters don't flow naturally with the story it makes it hard to watch. The characters really fit along with the setting and plot, making it original and an irreplaceable anime. \\n\\n\r\nOverall=9/10\\n\r\nDefinitely a anime worth watching (Of course, starting with the First Season)",
            "date": "2015-04-06T07:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 184934,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855801.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Neptune-",
                "username": "-Neptune-"
            },
            "url": "https://myanimelist.net/reviews.php?id=184934"
        },
        {
            "content": "i actually think the story of the sequel was splendidly done. The anime actually started half way where they ended the first season, to continue the story and have answered a lot of question that the first season has not given. if you've watched the first season and liked it, wanting the answers. you should watch this, i loved how they ended it.\r\nOverall: this is the sequel for the anime \" Hitsugi no Chaika\", i rated it 8/10 since it has given more than the first season. enjoy",
            "date": "2015-08-24T18:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 196960,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JustAkitteh",
                "username": "JustAkitteh"
            },
            "url": "https://myanimelist.net/reviews.php?id=196960"
        },
        {
            "content": "Hitsugi no Chaika - Avenging Battle - 7/10\r\nBefore we start, let me warn you, Hitsugi no Chaika was my first ever anime, so keep it in mind while reading this review.\r\nShort Review:\r\nArt is ok, budget is kinda low but at least it's watchable so, it lacks CGI or cinematic effects so, to be fair it's a 6/10\r\nSound is ok, voice actors really did push some unique voices and personalities, the episode BGM is bland, but the Opening and Ending makes up for it so 7/10\r\nCharacters don't really have any depth whatsoever, but they are likable, maybe not as likable as say Cowboy Bebop, but stillclose enough so a 6/10. Another thing is that Chaika is neither as moe or as adorable as she was in the first season, particularly because 10 episodes left barely any time for her development and dialogue.\\n\r\nEnjoyment factor really stands out as all the action scenes have nice choreography and are all animated good, again, nothing too special but good is good, besides, the pacing in this show is fast and the plot unravels quickly so the overall dynamic is enjoyable, both here and in the first season in fact, straight 8/10 in that department.\\n\r\nStory is good, the lore is big and clever, while it may not be deep or hard to comprehend like in some other adventure/journey style shows like Ergo Proxy as an example, it is still quite a big universe and the world of chaika is an interesting experience, along with numerous new, to the fantasy genre concepts such as getting magic from memories and without spoiling too much the creature designs are very interesting and how they interact in the world. The actual plot is quite simple at the start, mostly really just finishing what first season started while throwing in plot twists up untill the end where all mysteries are solved and the show rapidly concludes itself wrapping up the story and coming to a complete closure, so i think the story, albeit simple, is enjoyable and deserves a fair 7/10.\\n\\n\r\nLong Review (or rather an extension to the short one):\\n\r\nFirst of all, the ART is good, nothing too awesome, but it's ok, it's slightly worse than Akame ga Kill, but there is nothing too wrong with it, there is no CGI aside from a few small scenes, there aren't really any lightning or other advanced FX and it's just plainly drawn with not much detail, but aside from that there aren't really any glitches or mistakes in the art department, and i guess i can't judge the animation quality since it's only out in shitty bitrate on HDTVrips and not actual BDRemux/BDrip releases yet so even 1080p still looks like shit. Ok, the soundtrack itself is good, OP&ED are awesome just like in the first season, although the actual episode BGM is quite bland, nothing interesting there. Now the enjoyement rate is really high and the action scenes are well drawn from what i could tell and are fast-paced which makes it all dynamic and intense which is something i haven't seen in anime for a while. Now the story and the lore, especially the lore i think was the focus of the show, and i can't particularly state it succeded.\\n\r\nWhat i really liked about Chaika was that world-building, where it was a simple shounen anime technically, but it still had some unique aspects such as the creatures themselves and what they do, the history of their world, the mystery of emperor Gaz and what and why the Chaikas are in this world. I like how now in the second season the show then switches to de-building that world by questioning chaika's past and everything else, introducing one silly and expectable plot twist after another while simply working on what was already there in the first season. However, then in episode 9 there is a massive twist and all the mysteries are solved and all the pieces of puzzle are pulled together, the lore is now pretty much complete and we get a full picture and answers to why and how. Then in episode 10 there's a little bit that seems simillar to how in Fullmetal Alchemist the main villian tried to use souls to power the superhumans, only that here it's smarter and the main villian uses emotions and starvation for war, ironically the main protag and every good guy in this show fights and has emotions and memories, which power the magic in this show, so it becomes an interesting dillema, but the show ends before any of that is given any focus.\\n\r\nOverall, i liked the plot, the universe and will definitely miss this show and it's characters which may not have that much depth, but they sure are likable. The ending is very straightforward, and i'm not so sure really whether i like it, on one hand it's definitely good it didn't end in a mindfuck or some open-ended shit like Ergo Proxy because as much as those endings have the artistic value, they always leave a bad taste in my mouth, so maybe because of the good ending i liked the show, felt it had a closure.",
            "date": "2015-03-30T00:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 184049,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042687.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DanteMustDie8907",
                "username": "DanteMustDie8907"
            },
            "url": "https://myanimelist.net/reviews.php?id=184049"
        },
        {
            "content": "S2's focus is not on running around collecting the remains, but rather what comes after that. S2 sets up the conclusion very nicely. It's a nice change of pace. For the most part, the plot was told well. It also focuses on more than just Chaika and friends.\r\nAs for it's issues, there are too many underdeveloped characters. This is a very big, glaring problem. It feels like some characters got ignored or even screwed over. Akari, for example,pretty much got no characterisation. Character are tied to the plot to an extent, so this hurts that in turn. Particularly in the last 2 or 3 episodes.It's very disappointing if you like more than just chaika and toru. This was a big reason why I couldn't give S2 a 8.  I even considered giving it a 6.\\n\\n\r\nSpeaking of which, if I had to summarise the last episode in a word, it'd be \"abrupt.\" No explanations are given for much of what happens in the epilogue. Not much indication of what everyone is doing now or what happened immediately after the conclusion. \\n\\n\r\nDon't get me wrong, despite this, I enjoyed this anime a lot.  I had high hopes for this show which were not met. Season 2 really would have benefited from more episodes. I'd say another 4-6 would've been enough to show great improvement.  If there was more characterisation and the ending was better, this easily could've gotten an 8. Anyways, as for the entire series, I'd recommend it.",
            "date": "2017-10-05T22:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 259818,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3128533.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/oappo",
                "username": "oappo"
            },
            "url": "https://myanimelist.net/reviews.php?id=259818"
        },
        {
            "content": "Having enjoyed alot the first season, I was expecting the second one to be at least good.\r\nNot diving much further into. \r\nIt meet my expectations, and while it had slower, more boring episodes, the story was still interesting, the music was great to be point I never skipped the OPs, the characters, again if you enjoyed the first season, you know what to expect, Frederica is charming like always, the main cast trio is likeable, the supporting characters do they job, sure the anime has some flaws, some pacings issues, and japanese nonsense, but you see the anime till the end, and those cease tobe that noticiable.\\n\\n\r\nBy what I found, the LN ended already, and these 2 seasons are supposed to have covered the whole 11 volumes. So this is really the end of the series.\\n\r\nAnd that is where I most enjoyed the series itself, despite the flaws, and of course there is always room to improvement... the conclusion is satisfying! \\n\r\nIt brings closure! Some stories, you were attached to those so much but by the end, they leave a biter taste in your memory with the conclusion, and while Hitsugi no Chaika: Avenging Battle had its cliches and predictable troupes plot, you invested your time watching the anime, you will be rewarded. Sure I was left wanting to see a bit more, non less it is easy to watch, and concluded in a pleasant way, not the most unforgetable anime, by far. But it does the job, and doesnt disappoint, and like I mentioned, if you enjoyed the first season, I cant see you hating this one. \\n\r\nGive the first a try, and if you liked it, you have here more 10 episodes to entertain you.\\n",
            "date": "2015-01-06T18:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 176561,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1778785.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Playcool",
                "username": "Playcool"
            },
            "url": "https://myanimelist.net/reviews.php?id=176561"
        },
        {
            "content": "The hardest part of being a critic of anything is deciding whether to give in to your snobbish, critical side or to allow yourself to actually enjoy the things you watch. It’s a problem a lot of hardcore critics have to deal with and something that doesn’t translate well in the written word. I have written many reviews stating that an anime has problems but I heavily enjoyed it, something that seems contradictory to many, especially when the score reflects a better product than what is actually seen.\r\nThus, Chaika: The Coffin Princess, an anime I had such a hard time reviewing because I loved itoh so much despite all the issues it had. It was so average in nearly every regard that giving it a 6 seemed perfectly fine. But my critical persona dissipated after watching part of the second season and I realized I don’t think Chaika deserves a 6 because it’s more than a good average. It’s freaking good.\\n\\n\r\nAnd that’s why I raised the score on the review, that’s why I had to re-edit it, and that’s also why I created the new Otaku Seal of Approval category, a category dedicated to anime I particularly enjoyed and think you’ll find fun as well.\\n\\n\r\nThe second season of Chaika: The Coffin Princess is just as good as the first and finishes up the story of Chaika and her pals gathering the pieces of her father’s body. While it opens following the same formula as the previous season it moves into a grand finale with a final confrontation against the old emperor himself as well as a whole lot of revelations about what the Chaika’s are and their purpose.\\n\\n\r\nLet’s get into the averages. Average story. Average world-building. Average writing. Average characters with average development. Average music.\\n\\n\r\nBut the action is fantastic. The characters are cute and despite their averageness I still think Chaika is lovable and adorable, Toru badass, and Vivi is just so freaking wonderful.\\n\\n\r\nThe story isn’t anything new or smart but it provides for an entertaining ride that is formulaic but has pretty good twists toward the end and keeps you invested in the character’s.\\n\\n\r\nThe world itself is weakly developed but the magic system is unique and interesting. Using bullets containing magic powders and then being able to shoot the weapon and produce all kinds of different effects based on the incantation they use is a really smart and interesting system. It makes more sense than a fantasy series containing guns with regular bullets being used alongside lances and swords.\\n\\n\r\nSome new problems of the second season include the introduction of a female character who was artificially created to be a weapon. Her purple twin-tails combined with her purpose reminds me all too much of Sophie from Tales of Graces F.\\n\\n\r\nThe mentor of Toru and his sister winds up working for the bad guys by complete coincidence. Oh, and so does a supposedly dead character.That’s poor writing.\\n\\n\r\nBut the biggest problem I have with this anime is that it moves too fast to the conclusion. Not only do I want more but I feel like, had the series been extended to twice as long, it would have built up the characters and escalated the tension of the final scenes. The ending is emotional and pretty good, but it feels like the buildup wasn’t enough. There are eleven books in the light novel series and I can’t help but feel they compressed the books too much. Perhaps I should wait for the release of the first light novel in English this summer as it may develop these characters I already love and make me love them even more.\\n\\n\r\nThe ending comes way too abruptly and we don’t get to see the characters after the final battle more than thirty seconds. This small glimpse is not enough to satisfy me. I want closure, I want to see that Chaika and Toru are together or Chaika is happy in her new life. I want to see why Red Chaika is busting down doors and living with Toru, his sister, and Chaika. The most important thing an anime can do at the finale is leave us feeling satisfied that our heroes are doing well because when they’re happy, we’re happy. There is an upcoming OVA I hope gives us a better glimpse at the aftermath of the series, but lord only knows what they’ll do with it.\\n\\n\r\nChaika: The Coffin Princess is not a smart, thought-provoking, or pretty anime. It’s a really fun show, despite all the flaws, that I feel you’d be remiss to pass up. Definitely one of the better anime I’ve seen from last year and one of my favorite anime I’ve reviewed in the past couple of years.",
            "date": "2015-05-22T10:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 188430,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188430"
        },
        {
            "content": "Hitsugi no Chaika as a quite phenomenal series with the main character, Chaika, back with a second season. Still using the same theme in the first season, we were taken to see Chaika collect the pieces of her father's corpse despite the doubts and the mystery behind the Chaika herself. Accompanied by Tooru Acura and Akari Acura, also loli dragon Frederica, this second season solves up various mysteries that were encountered during the first season.\r\nWith the use of the same themes in the first season until the third episode, we were taken to Chaika adventure in finding the heroes who have the pieces of herfather's body. The story began to focus on the mystery during the first season on mid-fourth episode. Still the same as the first season, the series is still using a fast tempo story. Luckily we can still enjoy the story though there are details that are missing, the same as the first season that lost the important details of the story.\\n\\n\r\nI think because of the fast tempo, the end of the story feels end quite suddenly. A king is said to be the greatest wizard and has been in power for five centuries was defeated by his own goods in about 1 hour time story. I feel it can not be matched by the development of the strength of the main character. In addition, there is a \"betrayal\" by a character with unreasonable reasons. There is no scene that implies that the reason given is a reasonable.\\n\\n\r\nDespite the weaknesses that exist in the story, the character traits of the characters in this series is quite satisfactory. Additional character in the second season brings a new atmosphere in the story. In addition, the mystery of the few characters solved properly with reaction of those characters when they knew the truth. In the final battle, it can be felt the flashbacks that were given very illustrate what has been passed by Tooru for this two season.\\n\\n\r\nIn addition to the characters, the animation is displayed quite nicely. It’s quite obvious that there are additional budget in the battle animation. However, it is not matched by the quality of the art even after how they did the first season. Depictions of \"derp face\" that exist in the first season are still widely seen in the second season. In addition, there is a mistake in the second episode when Chaika fall with her Gundo. All of a sudden, the Gundo disappeared from her grasp and the next scene is shown that Akari bring the Gundo to Chaika. Also, the coloring of the character in this series does not really represent the darkness of the story. It is quite unfortunate because the designs of new characters there are very brilliant in describing the atmosphere of the story.\\n\\n\r\nThere is nothing special about the music in this series. The opening song sung by Iori Nomizu still have the atmosphere similar to the opening song on the first season. Similarly, the closing song too. Background song also did not have anything special. Quite good for the action series like this, but can’t make me amazed.\\n\\n\r\nAlthough with the reproachs that I gave, I quite liked this series. The absence of important details on the story and how the picture did not deter me to watch this series. I have always been loyal to watch this series every week to look forward to a variety of characters and also with the mystery solving. I am not so disappointed with the end of story, although I am a bit curious about the fate of Chaika memory. Hopefully this is discussed in the OVA.\\n\\n\r\nI can say that this series is quite interesting to watch. The mysteries are quite interesting although not all the mysteries solved in this series. Also, the character are very entertaining and made me look forward to this series. I would recommend this series to you who like action series with spices of mystery and stories.\\n\\n\r\nThanks for reading my review!",
            "date": "2014-12-11T06:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 171787,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452111.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xgunawan",
                "username": "xgunawan"
            },
            "url": "https://myanimelist.net/reviews.php?id=171787"
        }
    ],
    [
        {
            "content": "When it comes to anime with 12 episodes or less, you have to take into consideration the length of each season which represent the allotted time the creators have given themselves to put a story into animation.  This is did a terrible job of pacing and in fact the first season suffered from the same problem.  It tries so hard to \"blow your mind\" and try to go above and beyond but it just doesn't have enough time for it.  This gets really highlighted in the ending.  I loved watching this show but the ending was so lackluster and forced itwas jarring.  I still must highly recommend this show to any fan of fantasy, violence, and even a little humor.  Overall this show is really fun to watch, but the ending was one of the worst I have ever seen.",
            "date": "2016-11-24T22:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 234348,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5810522.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Genji-Shimada",
                "username": "Genji-Shimada"
            },
            "url": "https://myanimelist.net/reviews.php?id=234348"
        },
        {
            "content": "Hey folks, this will be a review for Hitsugi no Chaika: Avenging Battle. Oh man what a huge let down. The first season was pretty great, and I expected similar treatment given to the second season. Unfortunately its a huge let down.\r\nThe story picks up shortly after the first season. We find our party going to a heroes home where we learn a bit more about magic and the life of soldiers and heroes after the war. This is a crucial first couple episodes as its basically a giant information dump. The hero the party has to deal with is really fair and basically givesaway the remains and a list of where the rest of the heroes are. We also get Guy to touch base and urge the party towards two goals, one being a remains and the other being this mysterious fortune left by Gaz. \\n\\n\r\nThis is where we have to start dealing yet again with Chaika questioning her own identity, as if she didn't have enough evidence from battles with multiple other Chaika's and the information given by the one at the end. I cant go into much more detail without spoilers. However I do want to mention how insanely crap the ending for this story was. My mouth was open the entire time and I could only think, \"That isn't how this is going to end is it\".\\n\\n\r\nThe art is the same as the first season, same with music and voice acting. \\n\\n\r\nThe characters also took a dramatic hit in quality. Chaika of course having problems with self identity, which just feels like crappy anime drama. Tooru has a bit of childish shonen out bursts. He also refuses to become a Dragoon, which seems to be practically invincible. Gillette has a rather forgettable re introduction. Its actually hard to see the point of having him as a character this season. That could aslo be said about the whole Gillette squad. Red Chaika also comes in to settle her score with White Chaika. This however lasts a total of 1 minute and really felt like another wasted character. Most of the other characters dont really matter, as it was a full 8 episodes of personal crisis with hints of polishing up side stories without actually doing anything.\\n\\n\r\nI am so disappointed in this second season. It took all of what made the first series great and demolished it. The story actually is interesting and I didn't see the twist coming, at least not as clearly as I usually can. However they just poop on it. Its like they looked at how much longer they had and said, \"fuck it, make this happen because of this one really small detail that doesn't matter then just end it\". I actually cant remember the last time a story has made me literally angry at how idiotic it was. The characters were back to poorly written \"life is good, I'm an angry hero\"-esque status. There was so much side story and character development just written off in like five minutes time that its almost comical. I have so much more to talk about, however I don't want to add spoilers. I just cant express how disappointed I feel, and how insanely poorly they handled a decent starting anime.\\n\\n\r\nTLDR: Insanely crap. Can't remember being angrier with a sequel to something I enjoyed. Characters are crap, story ends in a instant of pure \"wut\", side stories concluded in about 5 minutes. Seriously bad, wish I hadn't watched it.\\n\\n",
            "date": "2016-05-11T20:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 218396,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=218396"
        },
        {
            "content": "I've seen a lot of anime and this for me is average. It’s a mix of action, adventure, comedy and romance. This anime is highly recommended for ages 15 and below because the story is light and can easily be understand. I don’t find the fighting scenes violent for there are hardly any blood to be seen. The romance is not the highlight. There are no any sexual scenes. \r\nThe overall plot is just average because again it is light. It focuses more on the action and adventure side. The ending has a lot of loose ends. It is one of those that will giveyou the “that’s it” reaction after you have seen the last episode. Seriously, it left me hanging out there. The ending is the most crucial because it will justify the time and effort one has given to watch the whole anime. No matter how great the story, if the ending sucks, it turns everything into trash. \\n\r\nThe phasing of the story is slow but almost all of the episodes have fighting scenes. it took some time before the problem of the story unfolds.  \\n\\n\r\nCharacters\\n\\n\r\nAll the characters personality is just the same throughout the series. There was no build-up or even development of new personality whit in the characters except maybe for Chaika when she knew the truth of her existence. Even the skills of the characters didn’t develop until the last episode. I felt that they haven’t reached their full potential because it seems that all the battles they have faced was not a challenge to them. Toru may have evolved in the last episode but he was not given a real fight in that state. Even Fredrica, her full strength wasn’t showcase. It was not even clear whose side she is because her lending of help was always conditional and she was always the assist type.\\n\\n\r\nDrawing\\n\\n\r\nThe drawing was just average as well. The only thing I found amusing was the flying fortress. There were no swords of weapons that I found exceptional and unique except for Niva.\\n\\n\r\nIf you are looking for an anime that is not complex but has a lot of fighting scenes, then this anime will do just fine. It also contains some funny scenes that successfully made me laugh.\\n",
            "date": "2015-10-05T22:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 200618,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4910669.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MystyBee",
                "username": "MystyBee"
            },
            "url": "https://myanimelist.net/reviews.php?id=200618"
        },
        {
            "content": "Summary: This was a good ending to the Chaika series. Not a great ending, and not the ending I was hoping for, but it was good. I'm not sure why the second season only got 10 instead of 12 episodes; you could definitely tell that they needed those last 2 to do a proper job of wrapping everything up. The ending was a little vague but satisfying and I can't complain too much but it did feel rushed and considering how much I enjoyed the first season I couldn't help but feel a bit disappointed. By all means though, don't let this review prevent youfrom watching. The overall series was excellent and minus the few issues I had with this season I am very glad I watched it!\\n\\n\r\nStory: 7/10\\n\r\nThe story wasn't bad, don't get me wrong. Everything that should have been resolved did get resolved, but the last few episodes felt needlessly rushing (considering this was a 10 and not 12 episode season). There could have been more clarity on a few points of during the arc and there were some plot points that were left hanging at the conclusion, but everything major was wrapped up in one way or another. I had hoped for more but I can live with it.\\n\\n\r\nArt: 9/10\\n\r\nThe art style was similar to season 1. It is still very strong and again does a great job of balancing light and dark colors to help emphasize the mood and give a good amount of visual diversity.\\n\\n\r\nSound: 8/10\\n\r\nAgain the sound track is solid. Not quite as good as season 1 but it got the job done.\\n\\n\r\nCharacter: 8/10\\n\r\nThis is another place where season 2 fell a little short of expectations. There wasn't nearly as much development of a few key characters as I would have hoped and the \"after story\" felt rushed and I didn't get a great sense of how the rest of the lives of the cast would play out. That aside, there was further development of several characters from season 1 and I think at least the main characters got a good amount of attention.\\n\\n\r\nEnjoyment: 7/10\\n\r\nI had a nagging feeling from around episode 5 through the end that they were suffering from a pacing issue and that they wouldn't cover everything they needed to in 10 episodes. In fact, I found myself very close to stopping before the last episode. I've seen enough anime to know what you can reasonably cover in a single episode and I just knew the ending was going to leave me disappointed. Granted it wasn't THAT bad, but it still left a bit to be desired. I did enjoy the anime overall but that nagging feeling inhibited a bit of my enjoyment.\\n\\n\r\nOverall: 7/10\\n\r\nOverall, it was a good ending to the series. Not bad, not great, just good. Had this had 12 episodes instead of 10 and had they spread the ending out over a half an episode at least I think I would have given this at least an 8/10. Plus, there were a few plot points that could have been wrapped up a bit better in my opinion. I definitely recommend everyone who enjoys this genre of anime to watch.",
            "date": "2016-01-26T21:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 209437,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=209437"
        },
        {
            "content": "The first season was a diamond in the rough, great ideas but bad execution, now we are presented another season. Did it manage to overcome the previous problems or did it manage to create brand new ones, read on and find out. \r\nThe story continues right where the previous left off and our heroes are still on the quest to find the remains of Chaika’s father, even tough she is now facing some serious existential questions as she now knows she was just a pawn her father’s scheme.\r\n After the loss of their captain Gillette’s squad is back to their usual business, tracking down Chaikaand her companions. Well not all is the same as Mimi has turned into a half Chaika (how we never get to know) after the loss of her beloved Gillette.\\n\r\nThe red Chaika has a more serious role now as they are also trying to get back the remains before the others do and we can se quite the rivalry between the two teams.\\n\\n\r\nThe main selling point for the previous season was the interesting story and while here the story is not bad, it loses almost all the uniqueness it had before. Now it is just a regular action anime where different teams are after some treasure and then later they have to fight together to defeat an evil villain. The next great thing about the first season was its portrayal of the peaceful world as a dull and boring place and seeing people longing for the excitement of battle and killing, here we go back to the black and white portrayal of war is bad, not that I disagree with the statement, but it was one of the most original things about the first season and now everyone, other than the villains, want to stop fighting. On the positive note they do manage to explain many of the things they forgotten in the first season, but some explanations are still left out. The pacing has also improved significantly and the whole structure of the anime was really well thought out and it managed not feel rushed even with its ten episode runtime. The ending is also well done if a bit to cliche for my liking.\\n\\n\r\nThe characters have also gotten worse than they were before. Chaika has in my opinion, lost most of her charm as she lacks any kind of progression. Tooru seems to have gotten the most development as he faces his teacher in battle and has a few tough decisions to make. His sister Akari has managed to change from a perfectly fun character into an even more annoying version of Mikasa from Attack on Titan, which I did not believe was even possible. The side characters have not changed all that much from the previous season and are still perfectly fine, but they do not stand out. As for the antagonists this time, they are uninteresting and seriously unoriginal.\\n\\n\r\nThe art is once again completely on par with other similar anime, but nothing exceptional. The soundtrack itself is adequate but the opening and ending themes were nowhere near as good as in the previous season and got skipped after having heard them them three or four times.\\n\\n\r\nI said in the review of the first season that it showed promise but never managed to get quite there and in the beginning I thought that this was, what the first season should have been, but soon it managed to loose all its previous charm and become this generic action anime, which is in my opinion just sad as it showed so much potential. I am going to give it the score of a high 6 as it still managed to entertain me but it had so much more potential. I am not sure if I can recommend this to the people who watched the first season as it is significantly worse, but on the other hand it still explains some of the opened questions from the first season so it might be worth watching the first few episodes and them maybe skip the ending.\\n\r\nFeel free to leave me some feedback and if you liked this review you should check out my growing collection of reviews.",
            "date": "2015-10-04T13:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 200518,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4641268.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/matic12345",
                "username": "matic12345"
            },
            "url": "https://myanimelist.net/reviews.php?id=200518"
        },
        {
            "content": "Story--Hitsugi no Chaika: Avenging Battle, takes place a short time after the first series's climatic ending which left allot of questions.\r\nThe series starts off with our main characters continuing their hunt for Emperor Gaz's Body parts. we also get too see the other supporting characters and how they're coping after the events of the first series's ending.\r\nThe series delves between casual episodes of Chaika and gang meeting new faces whilst collecting body parts for Chaika to collect and bury.\r\nhalfway through we get too see the true history of Chaika and the many other chaika's which I'll keep quiet about. The series picks up it's paceto a conclusion towards the final episodes and becomes very enjoyable. Unfortunately the last half of the final episode is a bit of a let down because well to put it simple, it just ends very quickly and suddenly and I came out feeling a little un satisfied by the ending. Take away the un satisfying ending and the story is really enjoyable and rich in story telling.\\n\\n\\n\r\nArt/Sound- There's not much to say if you've already watched series one and if you haven't you shouldn't be reading this review yet nothing much has changed and it's still to a very high quality.\\n\\n\r\nCharacters- were introduced to allot of new characters in the second series as well as a fair few new chaika's, Unfortunately again too go into detail of the characters will spoil allot.\\n\\n\r\nOverall-  The second series is still as strong as the first and is just as enjoyable apart from it's anti-climatic ending.\\n\\n",
            "date": "2015-03-08T13:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 181970,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4274195.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jonnyh101",
                "username": "Jonnyh101"
            },
            "url": "https://myanimelist.net/reviews.php?id=181970"
        },
        {
            "content": "Fight scenes were still as underwhelming as season 1 and the saboteurs’ “super mode” – the Iron Blood Transformation – was sadly still lacking in badassery. One thing that kept me going was the introduction of the saboteurs' master, Shin Acura, as I was curious as to see how he and the protagonists would interact. I expected a friendly reunion but I was in for a surprise, so well played there. Also, I thought that this was one of the few better fights that this show had. However, I was glad that they expanded some more about Arthur Gaz but the overall buildup felt messyor like it was lacking a lot for me.\\n\\n\r\nWould recommend if you enjoyed the first season and would want something decent, or if you wanted to see more of your favourite characters in this show (if any).\\n",
            "date": "2017-07-28T00:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 254025,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5841964.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Hikiku11",
                "username": "Hikiku11"
            },
            "url": "https://myanimelist.net/reviews.php?id=254025"
        },
        {
            "content": "Copied from my review of Season 1.\r\nThis is a review for both seasons to fully encompass the show. \r\nFirst off, I went into this show with LOW expectations. Oh man, I was horribly mistaken. Overall, I give the series an 8.5. For 22 episodes I was just amazed. It has action, it has gore, it has comedy. And furthermore it has a decent story, an amazing musical score and good characters.\r\nStory: Chaika, a female with white hair and purple eyes gathering the remains of the Taboo Emperor. MC, Toru, unemployed, struggling ever since the great war ended 5 years ago. While he is in themountains picking up edible plants, he runs into Chaika who is horribly lost. But before introductions can be properly made they encounter a unicorn (not the ones from a fairy tale) and are forced to team up to fight it. After everything happens, Chaika offers Toru and his sister employment, to help her gather her father's remains to give him a proper burial. \\n\r\nThis story is full of twists and turns, deceit and shock. This is one of the better animes that is horribly dark when you start looking into it.\\n\\n\r\nArt: I thought this anime would be bland, but I was wrong. It has amazing art work, the scenes are very well done.\\n\\n\r\nSound: First review I have had something to say other than fair; this anime for both seasons has an amazing musical track. This show was carefully crafted and well executed.\\n\\n\r\nCharacters: All of the characters are well developed and progressively grow throughout the show. They aren't one dimensional, they don't try to brush everything off. These characters have depth, they are all well connected and intertwined.\\n\\n\r\nEnjoyment/Overall: This show is usually in the top 15 that I recommend. It hit every expectation and then some. I have watched this show roughly 4 times now and it keeps getting better and better. This is an odd ball show with not a lot of fan service but it is a must watch for any anime lover.",
            "date": "2016-06-30T18:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 222500,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4900873.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lovevillain",
                "username": "lovevillain"
            },
            "url": "https://myanimelist.net/reviews.php?id=222500"
        },
        {
            "content": "A unique concept within the anime sphere, with great world building and interesting three dimensional characters with believable development. I really enjoyed watching the series, especially due to the characters, but the ending left something to be desired.\r\nSPOILERS FOR THE ENDING\r\nI think making Chaika lose all her memories was simply done to make the audience feel sad and make the anime more memorable because of those sad feelings. The first season also had feels at the ending, but mostly of victory and happiness, with a mix of pity for Blue Chaika. I think a similar bittersweet ending would've been a better route to go withto conclude the series, instead of basically destroying a MC just to get an emotional rise out of the audience at the very end. I think this is quite cheap.",
            "date": "2018-05-23T19:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 281263,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4202653.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Biglulu",
                "username": "Biglulu"
            },
            "url": "https://myanimelist.net/reviews.php?id=281263"
        },
        {
            "content": "I had no idea the 2nd season of Hitsugi no Chaika series, Hitsugi no Chaika: Avenging Battle [棺姫のチャイカ AVENGING BATTLE], would be so damn good series.\r\nI got question mark popped out of my head invisibly why it got serialized when the 1st season didn't have any superb quality. I thought the reason for 2nd season to be there was because the 1st season was hanging, Chaika's unmet desire and the viewers might criticize about it.\r\nI will combine the summary Chaika's series plot here. The 1st season was all about Chaika's never-ending battle to collect her father remains after great war killed her father. Even ifChaika didn't have memories left except her believes about she is the Emperor Gaz daughter and to collect her father remains is her duty. Emperor Gaz was the strongest but so thirsty about war, so the brave knights united to kill him and ended the war. The problem emerged after Chaika met other Chaikas with the same resolve, whilst Chaikas considered as threats by other Empires.\\n\r\n    That was the 1st season, ended without any explanation of what is Chaika? and our Chaika wasn't success yet to collect all of the remains. Chaika's journey is continuing on the 2nd season, where the story gets so appealing, enchanting! The battle and the truth behind all of this series  (/❛o❛\\) \\n\\n\r\n    There aren't big differences between 1st season and 2nd season art. It's pretty average, dense or bold colours with few gradations to make it feel more alive. The visuals for its battle tho', is nice. I like their battles, the fast movements are presenting well and clear while the effect is sparkling. It is collaborating the action & fantasy aspects, so no wonder the effect of battles is one of the charm.\\n\\n\\n\r\n    The main point here is the story and how it's developed, although there aren't much new characters involved, but that's just the way it should be! Every characters here are improving, presented well in detail and showing a good passion. It lures us with the issues arise and the tense of the ending of the world. Can they stop the god of war—I mean, Emperor Gaz, since he won't stay quietly in the world with no war--from its resurrection? How every characters face their own troubles that connected to a single main point, the Chaika project? The 2nd season is afar from its predecessor (1st season) from story and characters development aspects.\\n\r\n[Somewhat SPOILER] I really like the fact that Vivi turns into half Chaika, opened up my mind that Chaika might be not just about the children used as guinea pigs when it was young and aimless but it might be related to psychological thingy and will to survive too. All of the ambitious Chaika, they are so charming.\\n\\n\r\n    The unchanged aspect here is the music. Both 1st and 2nd season theme songs, just along the continuum of satisfying. Nothing to brag about, I feel sad about that, I bet they could give us more for enjoyment through the music. The OP song is \"Shikkoku wo Nuritsubuse (漆黒を塗りつぶせ)\" by Iori Nomizu and the ED song is \"Watashi wa Omae no Naka ni Iru (ワタシハオマエノナカニイル)\" by coffin princess. Well, I do like the insert songs here,\\n\\n\\n\r\n    Damn I love every episodes, everything as the story went. It also provides lots of meaning, especially friendship and trust. Their friendship is what tie them up to not get separated so far to their own self, the trust binds them to not lost their way, their desires are what keep them to move forward and do more hard-work and still on sane mind to think positively for gloomy matters which must be faced.\\n\r\nI give Chaika's 2nd series 9 for rate.\\n\r\nPros:\\n\r\nAlluring story, alluring characters and the developments\\n\r\nThe meaning of its story. Don't know why but I can find easily the meaning here, it is clearly projected from the story which has positive meanings.\\n\r\nThe enjoyment",
            "date": "2016-07-23T21:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 224791,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224791"
        },
        {
            "content": "This anime has some of the best characters that I have ever encountered. The humorous dynamic of the 'Saboteur siblings', nonchalance of Frederica, and the dazed antics of adorable Chaika was a perfect mixture of effortless comedy that combined to spice up an already pretty interesting plot. The twists and turns of the story were unexpected and well thought out and the portrayal of each character's personalities: old and new, big and small, was skillfully executed through every scene. I wanted this anime to continue on and on. I will most likely have to relive my enjoyment and take a look at the manga. Imean I've already re-watched both the original as well as this season a number of times already. Also, who wouldn't want to see a man 'sitting fully naked in a tub of boiling water, impersonating a cockatrice, while eating pasta through his nose' ?",
            "date": "2015-09-29T03:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 200065,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685559.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TenshiMaria",
                "username": "TenshiMaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=200065"
        }
    ]
]