[
    [
        {
            "content": "This is, putting it simply, a softcore lesbian porn anime. It exists primarily to arouse the viewer; nothing more, nothing less. The story is simply an excuse for seeing sexy girls interact, fanservicey fight-scenes and borderline hentai scenes. The truth is, actual hentai anime tends to be stuck with very small budgets; meanwhile \"softcore\" anime can more often afford significantly better production values, as this anime shows, and I much rather enjoy a softcore show with decent production values over chicken-scratch \"hardcore\" OVAs.\r\nThe story of a bunch of girls being trapped on an island, the \"Soul Eater, but with orgasms\" premise of the action scenes...all of this, as I said above, pretty much an excuse for boobs and yuri, and the characters primarily exist to fit specific fetishes. In that regard, both the \"plot\" and characterization do a pretty good job.\\n\\n\r\nThe visuals are pretty nice; sometimes the amount of polish obviously falters, but the lewd scenes tend to look quite good and the character designs are obviously the best and most appealing out of all the Valkyrie Drive projects. They lack the typical VN-esque cheapness often found in such anime, instead managing to be quite stylish and charming and, while not particularly unique, nonetheless have their own look and feel. The animation is pretty competently done when it matters and the series succeeds at having many genuinely sexy scenes.\\n\\n\r\nSound-wise there's nothing to complain about; the VA cast is fine, as is the music, and the obligatory moans do their job quite well.\\n\\n\r\nAs a fan of competently done lewd yuri, I quite enjoyed this series in the basest way imaginable; and really, given what its intentions are, that's just about all that I needed.",
            "date": "2016-01-09T10:27:00+00:00",
            "helpful_count": 118,
            "mal_id": 208133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372914.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/busterbeam",
                "username": "busterbeam"
            },
            "url": "https://myanimelist.net/reviews.php?id=208133"
        },
        {
            "content": "FROM STUDIO ARMS.... COMES SOMETHING CALLED VALKYRIE DRIVE MERMAID.. \r\nWtf did i get myself into... Well if u like boobs... and if u like yuri... and if u like magic fighting girls with guns and swords... and u like a show with \"plot\" but really no real plot... \r\nTHIS IS THE SHOW FOR YOU\r\n\"Story\" 3/10\r\nI really am not enjoying any of this.. There is no elements that seem to matter or show importance in the show... none of it really makes sense and I really think none of it matters... Just a 15 year old girl and a 19 year old girl make love (uncensored)and one turns into a fucking weapon or something... stuck on a mermaid island with other magic lesbian girls... and activate powers by smashing tits. Introducing other fun generic yuri characters from other animes. Trying to cater to any type of fetish you may have as the viewer... but I really just dont feel obligated to watch another episode... you will never get hyped or feel any real emotion... and if you do... well good I am glad you are enjoying it... while I can't see any redeeming qualities to a show that literally needs a bouncing tit to keep the show from going to boring generic garbage... but really I LOVE ECCHI and LOVE all the other stuff but like with no story no enjoyable characters.. generic everything I just barely can make it through each episode... \\n\\n\r\nArt: 8/10\\n\r\nIts good computer garbage stuff not amazing but... really can see those bouncing plots.. \\n\\n\r\nSound: 9/10\\n\r\nVoice acting is fine clear, some characters don't fit there voices and become extremely annoying but at least I can really here the love noises so that's a plus..\\n\\n\r\nCharacters: 3/10\\n\r\nSo far... ones an underage virgin or something and the other is a serious twenty year old with huge tits but in reality is like 15.. they become partners.. and do shit... Other characters are thinking they are overpowered female lesbians who transform into the best weapons and just get their asses kicked by loli MC and 20 year old MC and other side friends like money loli, mom with huge boobs, and basically everyone has huge boobs and is lesbian... and the one guy or governor or something is a girl thats called a\"guy\"... Really not memorable.. Characters are pretty generic and annoying.. \\n\\n\r\nEnjoyment: 5/10\\n\r\nA sad fap...\\n\\n\r\nOverall: 3/10\\n\r\nJust a show with tits and yuri to keep the viewer entertained with no real story to cherish... Really disappointing... waste of time (unless u wanna fap)\\n\r\nIf you want a similar show.. go watch High school DxD or something... idk... 3/10 \\n\\n\r\njust dont",
            "date": "2015-11-28T14:40:00+00:00",
            "helpful_count": 94,
            "mal_id": 204368,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4516181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Anthoniichan",
                "username": "Anthoniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=204368"
        },
        {
            "content": "This is lewd show for sure, everyone can read the description right? though I must admit, this one is not your average ecchi show, I think  it is not exaggerated to label it borderline hen***. Is it bad then? that's up to the viewer to decide. personally I'll say this show is enjoyable, not because the perverted things, it has few good points too.\r\nStory: 7/10\r\ncall me inexperienced, but I won't complain that much about this anime originality. the concept about human transform into weapon might have used in some anime. But combine it with other elements this anime has, I think this one ispretty unique. Okay let's move to real plot. The story itself is pretty decent in my opinion. It might have awkward and slow introduction, but trust me, you'll eventually understand almost everything about the chicks circumstance or even how their world is working. There are a lot of flashback as well, which is presented well and smooth. Also, there is good portion of battle in this show.Although, I'll call the battle itself a joke. No.. uhm, I don't mean the \"intro\", but the actual battle itself. It just went bam..bam! or maybe few flash, beam.. then its over, as simple as that. Some character might give a good show though, for example the four-eyes commander or duo lady.\\n\\n\r\nArt: 8/10\\n\r\nThere are a lot of oversized things here, if you know what I mean. I think they should made it moderate, not that I totally dislike it. Joke aside, I think the animation is good and fluid, the characters design are nice if you ignore particular part. I especially like the duo lady figures, it give \"wild but cool\" image matching perfectly with their personalities. And the last episode animation was amazing.\\n\\n\r\nSound: 8/10\\n\r\ncharacter voices are not half bad, and I like the OP and ED.\\n\\n\r\nCharacter: 9/10\\n\r\nI like most character.The blonde one have some development, everyone else are static though, just being what they are until the end. Some of them might even surprise you. I like how everyone participated in the last battle, that was some cool action there, the best part in this anime in my opinion.\\n\\n\r\nEnjoyment and Overall: 9/10\\n\r\nHonestly, I'll even give this show full score in term of enjoyment. But I'll hold back since I don't want to be labelled as hen***. Still, this show keep me entertained until last episode, it has nice characters, decent story with good pacing. It's not show for some kid with weak heart as there are some intense scene, also not good for any good man who dislike anything lewd and irrational. But, if you think you like this kind of show, you'll realized this anime is not bad at all.. and you might want to double check your room door to ensure it's locked properly.",
            "date": "2016-01-02T07:17:00+00:00",
            "helpful_count": 71,
            "mal_id": 207540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3023903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Juarez",
                "username": "Juarez"
            },
            "url": "https://myanimelist.net/reviews.php?id=207540"
        },
        {
            "content": "Studio Arms has a rather—shall we say—less than impressive reputation in the anime community. Although they have done numerous different types of shows in the past, the most prevalent one is action/ecchi... and I mean the very worst kind of it. If there is one company who seemingly has a full monopoly on bad ecchi anime, then it's Arms. I still consider Queen's Blade to be the single worst full-length anime TV-series I have ever seen, and my faith in the studio since then has been rather limited to say the least. And thus it is hardly a surprise that I wasn't exactly expecting muchout of Valkyrie Drive either, but to my amazement... it wasn't actually that bad. Certainly not more than average at best mind you, but a hell of a lot better than what I've come to expect from Arms at this point.\\n\\n\r\nThe story is about as nonsensical as you'd imagine it to be. It takes place on a set of artificial islands with an all-female population. The girls are divided into pairs of Liberators and Exters. If a Liberator sexually stimulates her partner, the Exter will transform into a physical weapon which the Liberator can then wield in combat. Sounds weird I'm sure but it's pretty straightforward, and that's the way this world works. There is an established society on the islands with different internal factions and individuals pursuing their own goals. And that leads us to what I'd probably consider the anime's greatest weakness, namely the lack of any real long-term purpose for the majority of the story. For about two thirds of the show, there's no one bad guy on the islands to defeat, nor is there a personal ambition for the main duo to reach or anything like that. They just... go with the flow of events and one thing leads to another which gets them tangled up in various incidents, and eventually it converges on to a single goal. It's a bit awkward, but then again you have to consider this a secondary notion since you'll certainly not be watching Valkyrie Drive for the story anyway.\\n\\n\r\nAnd that is where this anime exceeded my expectations: the ecchi. Historically speaking, Arms has pretty much the worst ecchi on the market, basically having the \"big breasts solve everything\" approach with absolutely no creativity put into it at all (and when I say big breasts I mean REALLY big). In Valkyrie Drive however, this is not really the case. Well okay, it certainly does have a lot of needlessly busty girls in it, but it's got a lot more than that. Since the series revolves around girls sexually stimulating each other in order to draw out their partners' powers, it obviously can't just get away with shoving tits into the camera every 5 seconds. It needs actual physical stimulation. And as a result, Valkyrie Drive has a plethora of uncensored yuri sex in it. That's not something you see every day. Now of course that doesn't mean it's at hentai level, but it comes pretty close sometimes (especially the BD specials, hot damn). For example there's one scene where two of the girls are blatantly 69'ing and licking each other out; we may not actually be shown their genitals on screen but... you know exactly what's going on as a viewer. Case in point, Valkyrie Drive is actually pretty hot. Not all the time of course, but often enough. For an Arms anime, that's a tremendous achievement to me. And let's be honest here, how many borderline hentai anime does there exist out there that's girl-on-girl? Yuri is normally stereotyped as something cute and romantic like in Yuru Yuri or Sakura Trick for example, not something as lustful and perverted as this. That alone gives it a lot of points for originality when you think about it.\\n\\n\r\nAnd really that is pretty much all that needs to be said about this anime. The art and sound is about what you'd expect it to be, nothing remarkable but not bad either (I like the OP song though). The plotline is incredibly dumb but I don't think anyone believed it to be otherwise before watching it either. And the characters are for the most part not anything more than plot mechanics for the sake of ecchi, though I'll at least have to give some credit to Meifon for being somewhat of an unexpected wildcat who kept things interesting with her deceitful antics. But in the end, all that really matters in Valkyrie Drive is of course the ecchi, and although it still suffers from having a lot of oversized breasts and clothes ripping during action scenes for no apparent reason, the yuri scenes more than make up for it. There's something magical about seeing a pair of horny anime chicks passionately tongue wrestling and greedily indulging in each other's nipples, and Valkyrie Drive tries its very hardest to showcase exactly why. It may be considered crude, but so be it; at least it's crude in a damn arousing way.",
            "date": "2015-12-27T03:28:00+00:00",
            "helpful_count": 33,
            "mal_id": 206937,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=206937"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nPicture a mermaid.\r\nMost people imagine a beautiful woman whose lower body is that of a scaled, green fish. Maybe she can sing real swell and maybe she is longing for love. But regardless, she is two halves that make up an entire whole.\r\nValkyrie Drive: Mermaid is the same. Mermaid is one half sex and one half tale, making it one not-as-bad-as-you-may-imagine anime.\r\nSTORY\r\nAnime has its fair share of strange premises; Mermaid’s premise gets added to this list.\r\nA virus, the “Armed Virus,” infects women, granting them special abilities. Society deems these women dangerous, so they get sentto isolated islands to fend for themselves. The kicker is that these special abilities remain latent unless the women classified as “Liberators” make the women classified as “Extars” achieve orgasm. (Intriguing, no?)\\n\\n\r\nUnderstandably, then, Mermaid is rampant with sexual content. Girls are constantly kissing and fondling and canoodling. But they are not swapping spit because the audience wants to see it (although that is one reason for doing so), they are tongue twirling because it is an essential part of the plot. In other words, the sex is not just pleasurable but also purposeful.\\n\\n\r\nThe season, with sex in tow, takes a standard approach. The first few episodes mostly establish the setting and the characters. The next few after move into slice-of-life territory with more character-oriented material. And the final few episodes are where the major conflict occurs.\\n\\n\r\nThroughout the season, Mermaid is prone to repetition. The fights are usually one-sided triumphs rather than full-fledged duels. But even worse is the repetition in the sexual asides. Surprisingly, the anime does not get very creative, using the same means to sexually arouse the girls’ partners with each iteration. Admittedly there are not a whole lot of ways that making out and touching can be depicted, but the actions almost never come off as unique for the individuals involved.\\n\\n\r\nIn order to combat this repetition, Mermaid dabbles into other areas besides sex. One episode follows a girl who grows gigantically. (The size of her breasts have to have broken an anime world record of some kind.) Another episode has the women participating in a beauty pageant. And all the while, the anime injects bits of comedy, like Mamori getting called a “virgin” or Meifon having a “Foreclosure” sign censoring her crotch.\\n\\n\r\nRepetition is further fought when the anime continually includes more and different details. Liberators and Extars that can switch roles. Artificial Extars. New abilities and powers. The introduction of enhanced “Soldiers.” And massive robots. The anime does a decent job of constantly introducing new material even if said material is only around for a brief period of time.\\n\\n\r\nThe general amount of fun that Mermaid takes part in mistakenly pushes away the relevancy of the major conflict until the end of the season. The Soldiers and their organization are very briefly mentioned in flashbacks or in passing, and it is only near the end of the season where they finally reveal themselves. Since the show did not buildup to this conflict, when it finally appears, it almost feels out of place.\\n\\n\r\nThe ending has tonal issues, too. Before, the anime could get dire, but it was never grim or overly dramatic. The major conflict, however, does away with this notion: rape, underhandedness, and lots of losing become the norm. On the one hand, the tonal shift is welcoming because Mermaid did not seem to have a coherent narrative in mind. On the other hand, the tonal shift is rather jarring when it gets as dark as it does.\\n\\n\r\nThe ending also has two more problems.\\n\\n\r\nOne, it is too contrived. Not just that the virus essentially cures itself, but also there is no precedence for it. Momoka brings up the idea at the end in passing only. And nothing really changes between Mamori and Mirei over the course of the season to constitute them achieving “Valkyrie Drive” at the end as opposed to the countless other times.\\n\\n\r\nAnd two, it goes against the plot of the anime. The entire time, the girls on the island were trying to prove that they could be reinstated into normal society by exemplifying order and stability. But the solution given instantly saves everyone, meaning that the events leading up to the ending were mostly for naught.\\n\\n\r\nWhen all is said and done, there are about two ways to view Mermaid. The first view is the simpler one: A grander message does not exist. This anime is all about action and boobs and girls and not much more. This interpretation is fine; a show does not have to be deep to be worthwhile.\\n\\n\r\nThe second view, however, gives the anime a bit more credit: Always have hope. Placed on an island far and away from normal civilization, the girls still hold out hope that they will someday make their way back home. Until that time, they rely on each other. They do so more intimately than one may think, but, as they prove, hope is made stronger when it is held by many rather than when it is held by few.\\n\\n\r\nOr one can believe in the third, hidden, and arguably best view: Yuri is a blessing. What saved the girls and cured the virus was not some newfound piece of technology or a breakthrough in medicine. What brought peace and comfort was the beautiful love that two girls shared between each other.\\n\\n\r\nIf that is not a wonderful message, then no message is.\\n\\n\r\nANIMATION\\n\\n\r\nMermaid is best watched (perhaps obviously) while uncensored. The uncensored version does away with nearly every single light beam that shines throughout the censored version. “Nearly every” because the one in episode six, where Mirei performs a rather lewd exercise, exists.\\n\\n\r\nGiven that Mermaid is watched while uncensored, it focuses its art and its animation where it counts the most: the girls, the boobs, and the near-fornication.\\n\\n\r\nDowntime in the anime hardly sees extensive animation such as with hair or limb movements. However, the anime almost always makes sure to have the breasts jiggling. Battles, in contrast, do try their best to keep up in animation. Flying fire birds, colorful laser beams, and difficult-to-pull-off acrobatics, while lacking in tight choreography, create a lot of movement on the screen. Mermaid knows it cannot always keep up, so, to compensate, the cinematography hones in on risqué shots of the characters’ butts and bosoms wherever necessary (or unnecessary).\\n\\n\r\nWhere Mermaid diverts most of its animation is into the sexual content, and, more specifically, the scenes where the Liberators have to use their Extars. Extra frames for turgid nipples, dancing tongues, and locked legs are more than welcome, creating steamy scenarios that even the people in the anime cannot help but blush at.\\n\\n\r\nThe rest of the art is similar to the usual amount of actual animation in that it is not that impressive. Island terrain makes up the vast majority of the art – jungles, hot springs, and ocean fronts – but the castle, a hidden abode, and an underground factory attempt to shake up, however slightly, the usual offerings.\\n\\n\r\nAnd to be fair to the anime, the characters are on an island. Meaning, it may be silly to expect anything else besides a lot of trees and the sea.\\n\\n\r\nAs for the character designs, while the characters rarely change outfits, they are diverse and detailed enough to be considered interesting. Furthermore, each character wears lipstick or has their lips colored, accentuating their beauty that much more.\\n\\n\r\nFor example, Mirei’s long, blonde hair, too-short skirt, and ample figure maximize her attractiveness. Meifon’s signature pink cowboy hat symbolizes her fun and carefree nature. And Akira’s different designs contrasted well: While disguised as a male, she wears a professional, commander suit with cropped hair, and, as her regular self, she wears a summer gown with long, red hair that undeniably proves she is female.\\n\\n\r\nAlso, a special shout out goes to Charlotte’s design. Her styled, pink hair, purple, regal outfit, and exposed, ample bust turns her into quite the sexy minx.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Mermaid could go either way.\\n\\n\r\nThe characters do not have a discernable theme that connects them all. An argument exists for the characters protecting or fighting for a partner, but, since many of them do not have partners or do not uphold this sentiment, the theme is not that strong.\\n\\n\r\nLooking more closely at the cast, Mamori, the oft called “virgin,” appears to be the main protagonist of the anime. But she quickly makes it clear that she is not entirely fit for the role. She is wimpy, scared, and unable to fend for herself. However, what makes her a tried and true protagonist is that she is perhaps the strongest Extar on the island. This detail is only made known when her Liberator finally appears.\\n\\n\r\nSaid Liberator is none other than Mirei, the actual main protagonist of Mermaid. Mirei does not speak much: for her, “actions speak louder than words.” She also contrasts with Mamori (and not just in size). Mirei is strong. She is confident. She is able. (“Opposites attract.”) On top of sharing a dislike for violence (this trait of Mirei’s is revealed later) with Mamori, Mirei is the perfect match for the tiny, redheaded girl.\\n\\n\r\nThus, the two become a team. They work together to protect each other and to help the other denizens of the island. Although not everything is serene. Mamori longs to go home; she misses her parents. And Mirei has a past that remains mysterious to the audience for quite some time.\\n\\n\r\nIt is not until a very harrowing situation that Mirei reveals her secret: She was part of an “Enhanced” project that altered her body. As further flashbacks reveal, Mirei used to be with another partner, Momoka (codenamed “A3”). When Mirei refused to fight, she was deemed “useless” (the anime’s words), and she was nearly terminated. But the doctor (in a slightly contrived manner) wanted to make amends for his sins, so he did not kill Mirei. He sent her away.\\n\\n\r\nHaving abandoned and been abandoned, Mirei was lonely. She was lost in a world that did not want her. She was eventually caught as an Armed Virus holder, and she was once again whisked away. Only this time, she met the person who would save her: Mamori.\\n\\n\r\nMamori was there for her and kind to her. But, most importantly, she became her friend, her lover in arms. It is Mamori that drives Mirei to go the distance. Mirei defeats Momoka, saves the girls of the island, and leaves with Mamori to be together forever.\\n\\n\r\nThe negative side effects of Mirei’s enhanced form are brought up, but Mermaid mistakenly does not use this detail for any purpose except to conveniently force Mirei to retreat. Still, it is apparent that Mirei is the strongest character of the show. She gets a lot of focus, and, more specifically, she gets a lot of focus in the final few episodes of the season. This development is nice for her, but Mermaid almost seems to forget about its other characters.\\n\\n\r\nFor example, Mamori hardly has a presence. After she reveals how much she wishes to go home, her character receives very little attention. Literally right at the end, however, she demonstrates her newfound courage. When presented with the chance to finally go home, she decides not to, opting to help the other girls affected by the virus all around the world.\\n\\n\r\nLady Lady are characters that likewise lack presence. They believe that people should be allowed to do what they want, and they repeatedly show this by acting of their own volition. It is an interesting trait, but since Lady Lady never have their characters elaborated on, they are more like convenient plot devices than actual characters. They are arguably heavy side characters, meaning them not receiving a lot of attention is understandable. But having at least a background would have been nice.\\n\\n\r\nAnd then there is Shigure who is yet another example of a character lacking presence. Her character acts as a mediator between Akira and Charlotte as well as a stern yet forgiving leader for the other girls on the island. She has a subplot involving Hibiki, a girl whose initial arrival on the island causes her severe mental trauma. This detail is minimally referenced throughout the season; the audience is only made aware of the full background near the end. Still, Hibiki gets inspired by Mirei to finally help and thereby giving the audience its first look at Shigure’s Armed state and bringing this meager subplot to completion.\\n\\n\r\nThe rest of the characters follow the trend of not completing their character arcs. The most glaring example is Akira. Her character represented hope. She was instilled with hope, she provided hope, and she believed in hope. When she was exposed to be a woman and not a man, her defeat is symbolic of hope being lost. And as the events show, hope is lost.\\n\\n\r\nYet the anime does not revisit her character, i.e., her arc does not complete. She shows up at the end, but very little time is given to her and her message of hope. The same happens with Charlotte. Charlotte was not much of a character; she was relegated to being a thorn in the sides of everyone. Later on, she takes over as Gouverneur, gets smacked around by Momoka, and loses thoroughly to Mirei and Lady Lady. Yet, like Akira, her character does not have a complete arc. The last line she speaks is “Now we can go home,” but that does not demonstrate if she changed or if she will change.\\n\\n\r\nAs for Momoka, besides not showing up until the end of the season, she was setup as a nice antagonist. Indirectly betrayed by Mirei, she was forced to undergo further experimentation, turning her into a “monster” (her own words). She is conniving, cruel, and crazy, but it is her unfathomable need for revenge against Mirei that made her seriously sinister.\\n\\n\r\nWhat results is her taking over the island, kidnapping Momoka, and nearly wiping out Mirei and the others. The final fight against her involves most of the cast – as well as a combined, “Valkyrie Drive” Momoka and Mirei – and it seems she is defeated. She is even the first one to get cured with a kiss from Mirei that also symbolizes the apology to her and the reformation of their relationship.\\n\\n\r\nBut, again, what happens to her afterwards is not shown. It is alluded that she is taken into custody, but whether or not she lives a happier life, tries to be nicer, or simply matures is not shown or known.\\n\\n\r\nThus the cast could go either way. However, since the anime was juggling many characters (and boobs) at once, and taking into consideration what the anime set out to do, they turned out rather okay.\\n\\n\r\nSOUND\\n\\n\r\nOne of Mermaid’s top strengths is the effects and music that it uses.\\n\\n\r\nStarting with the effects, two in particular stand out. The first is the breasts. The anime likes to have the breasts moving, and, to let the audience know that said breasts are jostling, the anime adds a breast-jiggling effect. No matter if Mirei is doing sit-ups, Torino is running to Meifon, or Charlotte is simply shifting her body sideways, the breasts are not just seen but also heard.\\n\\n\r\nThe second effect is heard most commonly when Mamori goes into her Extar form: a metallic moan. Including this effect is not necessary, but doing so made the transformation that much cooler.\\n\\n\r\nMoving away from the effects and towards the music, the opening track for Mermaid is rather nice. The vocalist is on point, the hard guitar is rockin’, and the background choir is in harmony. The OP, while not the best part of Mermaid, is still pretty strong.\\n\\n\r\nThe ending track contrasts completely with the OP, and that is only part of what makes it so awesome. The lyrics move at lightning speed. The onomatopoeia enhances the song. And the repetition makes it easy and fun to follow. Combined with the various vocalists and the catchy beat, it is clear just how “super-ultra-hyper-miracle-fantastic-romantic” this ED is.\\n\\n\r\nThe rest of the original soundtrack offers a nice array of tunes. Trumpets and violins for the silly times. Guitars and fiddles for the tense ones. And chimes and flutes for the sexual yet gentle moments. The other effects and music are stronger than the OST, even making up for some of the OST’s weaknesses, but the OST does what it has to.\\n\\n\r\nAnd because why not, the voice acting performances within Mermaid are generally above average. Yuka Iguchi as Mirei uses a husky and attractive voice for the mature girl. Mikako Izawa as Mamori uses an adorable voice for the small and shy girl; a nice performance for one of her first major roles. And Yuna Yoshino as Akira uses low- and high-pitched voices for her male disguise and female self respectively, demonstrating her vocal range.\\n\\n\r\nAlso, a very special shout out is more than deserved for Yurika Kubo who gives a fantastic performance as Meifon. The voice she provides can only be described as perfect for the carefree cowboy. Her line in episode six – “Hip raising training!” – in particular is spectacular.\\n\\n\r\nENJOYMENT\\n\\n\r\nYuri is my jam.\\n\\n\r\nErgo, I had a lot of fun with this one. The repetition did not phase me because that meant I got to see more naughty moments between Momoka and Mirei as well as the other pairings throughout the show. The bountiful bare breasts were likewise welcomed whenever they appeared on screen (which was practically every other minute).\\n\\n\r\nThis anime is pretty much designed for someone like me: a fan of yuri and bosoms. Disregarding these factors, I was honestly impressed with the show’s ability at attempting to be meaningful. It did not do anything groundbreaking, but I appreciated the anime spending time on the characters, the world, and the action.\\n\\n\r\nCharlotte was easily the most attractive to me, but the character that I found to be the most fun was Meifon. She was not around a whole lot, but, when she was, she brought the laughs. Trying to whistle unsuccessfully, getting scared by Mirei, and screaming while raising her butt in the air as Lady Lady used their massive gun were just a few of her hilarious antics.\\n\\n\r\nMamori gets a nod, too, for being so darn cute. But she (indirectly) also has my two gripes with the anime. Firstly, I was disappointed that the anime dropped the “virgin” joke with her name. I found it to be a simple yet silly running gag, so when it disappeared I was bummed.\\n\\n\r\nSecondly, I was not a fan of how she developed feelings for Akira and how she got forcefully used by Momoka. The first one had nothing occur between them. The second one was not her fault. And Mirei never lost her status as the girl with the highest compatibility with Mamori. Regardless, both instances came off as betrayals, betrayals that made me sad to see.\\n\\n\r\nValkyrie Drive: Mermaid has enough girls, boobs, and yuri to last a lifetime. But, surprisingly, it has some substance. The story, while finishing poorly, is interesting. The characters are competent. And the visuals and music do exactly what they have to. Mermaids may not be real, but, thankfully, this one is.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, repetition of the sexual content and a contrived ending do too much harm for the narrative to overcome\\n\\n\r\nAnimation: Good, the art and animation remains high where it counts the most but not much elsewhere, with nice character designs\\n\\n\r\nCharacters: Fine, while the characters lack a consistent theme, their mixture of both positive and negative qualities make them at least competent\\n\\n\r\nSound: Great, nice effects, good OP, great ED, nice OST, above average VA performances\\n\\n\r\nEnjoyment: Good, lots of yuri, branching out, and many laughs made for an almost entirely fun time\\n\\n\r\nFinal Score: 6/10",
            "date": "2016-07-24T12:12:00+00:00",
            "helpful_count": 16,
            "mal_id": 224861,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=224861"
        },
        {
            "content": "This anime is something that woke me up!!!\r\nThis is an anime I really like, not because its \"Yuri\" but because the whole series is about protecting one of the mcs, and not only that, then the series is nice, because of the ecchi, romance, action. The action is really, really, really, something that can facinate you, and the ecchi, is kind of fun, but its hard to explain, the romance is something that is really strong, between the main charaters.\r\nThis is an anime that really is fun, but in a weird way.\r\nYou will like this anime if you like Action, romance, ecchi and weird yuri,but when i wathced it, then my whole mind set was being changed, cuz this anime is really great, but not the best, but really great.\\n\\n\r\nI hope you found this useful.\\n\\n\r\nCya!!!",
            "date": "2017-12-11T04:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 264964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6546517.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DannieOne",
                "username": "DannieOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=264964"
        },
        {
            "content": "Ecchi has never had a big presence in the widely niche genre that is Yuri, or Shoujo Ai as it’s more accurately called. Yuri has always been a genre that I’ve always leaned toward the “erotic” side than the actual “romance” one, only because most of the anime tend to be too sugarcoated with soap opera quality stories. That doesn’t mean that I think there can’t be any ones that are good, I just think yuri fans deserve better than Valkyrie Drive Mermaid if they want their “dumb ecchi anime.”\r\nIf I had to describe the quality of Valkyrie Drive Mermaid in a very short statementit would be, “Not even trying.” What does it not bother to try? To be an entertaining ecchi anime. The boobs, butts, curves, kissing, and tripping all amount to pure nothingness. None pack any sort of charm or sensibility that generally make ecchi anime an exciting escapism. Whether it be from really poor comedic timing or the characters just being incredibly stale and formulaic. Upon further examination, the latter seems to be the biggest culprit than the former.\\n\\n\r\nIt’s not even the fact that none of the characters have any sort of profound characterization is what makes them stale. It’s the fact that their personalities, created by their dialogue and actions, are completely devoid of any humanity to them. A few of them even top my list of the worst characters of 2015. These characters being Mamori Tokonome and Mirei Shikishima. Mamori being the biggest crux of them all, she is by far one of the most annoying characters I’ve ever had the pleasure of seeing and listening. It isn’t just the bad, shrill voice performance by Mikako Izawa that makes her insufferable, but also how completely one-note her character is. All of the characters do suffer of being one-note but she takes the cake from her just being a character Mirei just kisses in order to gain her power and to be mocked because her name is the same as “virgin.” When something isn’t that clever the first time does not mean it will be funnier five more times.\\n\\n\r\nMirei Shikishima does do more than our damsiel Mamori, however her development is predictable right when she is introduced as a silent character. You could replace her with a cardboard cutout of her and it wouldn’t make much of a difference; that is how wooden her archetype is. The other characters besides our two main ones fall into similar territory. Our only male character in the anime, without spoiling anything (but you can probably guess anyway.), has one twist that comes off as so laughably random. Other than that noticeable moment, nothing can be distinguishable about that character before or afterwards. In fact the only character that was only semi-intriguing was Meifon Sakura because (1) she is voiced by Yurika Kubo so I could imagine Kayochin from Love Live doing the things Meifon is doing, and (2) she actually has some charisma that feels genuine and moves Valkyrie Drive Mermaid forward less tediously.\\n\\n\r\nSetting aside the other characters that are too forgettable to even bother reminiscing, the art is somewhat interesting to look at. The animation, on the one hand, feels as though Studio Arms was going on a lower budget than what they usually work with. As much as there are gorgeous art designs of the girls that are nice to look at, I don’t think there was enough material to go around to make these designs blossom. The first episode alone had way more dumb ecchi service than all of the episodes combined. Instead we are forced to sit through the most contrived story that one can get from an ecchi anime; hell Ikkitosen at least had an interesting lore to it that made it intriguing, Valkyrie Drive Mermaid has little to know meat to its story that garners any praise.\\n\\n\r\nIt is true that I don’t watch a ton of yuri anime that come out once or twice a year. I have not seen the great classics like Oniisama e…, Maria-sama ga Miteru, or even Yuru Yuri, as of writing this, to fully appreciate the genre. Valkyrie Drive Mermaid seems like one that openly insults the genre. It comes across as, “Well let’s just put a Shoujo-Ai element to this so that we can attract this niche audience to make money off of.” No, not even putting an ecchi spin on it is going to somehow make it somewhat different or unique when there is nothing to it. It is lazy implementation as one can get when watching this rubbish. As much as that one episode with the colossal naked girl at least gave me a single ray of sunshine in the mix, that was still not enough after it was over.\\n\\n\r\nWhen you can’t entice me, the self-proclaimed ecchi connoisseur, with boobs and butts, you know you’ve done goofed. One way of describing Valkyrie Drive Mermaid into one word is “soulless.” Soulless in every sense of the word. Boobs and butts that have no soul in them might as well not be boobs and butts at all.\\n\\n\r\nGrade: D-",
            "date": "2016-01-20T19:55:00+00:00",
            "helpful_count": 10,
            "mal_id": 209026,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=209026"
        },
        {
            "content": "For my anime reviews I am going to review the anime on the order of which you would experience while watching an episode of the anime that is being reviewed.\r\n1.Art - The art for this anime was not very impressive.  Wow that's a really negative thing to start of with, sorry.  I'm just say that the art was super average as well as the character models.  Now, that being said, there were some moments where the animation became strangely good.... like actually outstanding.  I couldn't help myself when I saw some amazing CGI in this show.  It was kinda weird.Anyway I give art a 7.  \\n\\n\r\n2.Sound - At first I didn't find this soundtrack attractive at all but after a while I started to like it.  By like it I mean I only enjoyed the opening and ending songs.  Those were awesome and might I add a perfect display of the characters boo..... designs.  The other songs in the soundtrack kinda suck.  They pretty much felt like background music to the show.  But I can't ignore the opening and ending  I give sound an 8.\\n\\n\r\n3.Character - This is where this anime really stood out and hung over to me.  The plots on each of the characters were enormous, with a few exceptions.  It was nice to see the relationships between the characters' plots, they were all mushing together and rubbing against each other.  On an honest note, all of the characters were interesting.  Surprisingly they all had pretty explained backstory and of coarse I'm not saying that there was a lot of backstory, I'm just saying that for a harem/yuri anime there was a surprising amount of it...... I enjoyed it.  10/10 for dose plots doe..... !\\n\\n\r\n4.Story - Well here's the thing.... I'm gonna rate the story keeping in mind of the other Valkyrie Drive islands and stuff so the story didn't feel unfinished to me.  I knew there would be more story adding on to Valkyrie Drive Mermaid so I had nothing to complain about but if you watch this anime while secluding it as it's own story, WHICH IT IS NOT, you will feel like it lacked.  By the way how could you hate a show the has awesome boo..... character designs and a pretty interesting story.  I know, you can't.  I can't give it a perfect score because of the story that can be added to this overall Valkyrie Drive thingy mcbob but I loved it enough to give it a 9.\\n\\n\r\n5.Enjoyment - This show was very enjoyable.  Of coarse it has a lot of hilarious fan service in it but if you like story it does have some of that to.  Honestly it was a very fun and relaxed show to watch.  I totally recommend it to you guys.  I enjoyed it at 10/10.\\n\\n\r\nThis anime is an overall 8.\\n\\n\r\n*I will also recommend that this anime is only watched by a matured audience.\\n\\n\r\nCaution:\\n\r\n!Keep in mind this anime has nudity.",
            "date": "2015-12-31T10:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 207395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642024.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Volticar",
                "username": "Volticar"
            },
            "url": "https://myanimelist.net/reviews.php?id=207395"
        },
        {
            "content": "I did my best to do not spoil anything but is pretty much impossible not to but nothing major but you are warned\r\nThe first 8 episodes are more of an ecchi anime but in the last episodes it will be completly different; am I triggered by people that don't understand the story because they are too stupid? Yes, of course. What to expect? A pervy anime at the start and good fights at the end pretty much... Why do i think it is so good? Because the story is original [correct me if I'm wrong], but i wished more episodes like the last ones idon't think it is going that far to be called Hentai but is not something SFW or light ecchi like ngnl. It will have a 10 if it had more fights maybe since the start. And is not that hard to understand the story (I can't understand Steins;Gate one so im stupid and i still managed to understand it).\\n\\n\\n\\n\r\nSory for the bad english i did the best that i could to make it understandable. I'm italian so don't expect much from me.",
            "date": "2017-03-13T11:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 242483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5983934.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/davidescion",
                "username": "davidescion"
            },
            "url": "https://myanimelist.net/reviews.php?id=242483"
        },
        {
            "content": "I think it was the point where I was watching a four-storey naked woman scream that I stopped hoping this show would ever make any sense.\r\nLook. I knew I was getting into something pretty questionable. This is the show that said \"You think Eromanga-Sensei is trashy? Hold my beer.\" This is a show that credits both a \"Special Breast Effects\" person and \"Giant Breasts Producer\"--yes folks, there were two people whose entire full-time job was animating giant pendulous breasts. In some cases, literally giant (aforementioned).\r\nBut there's no point interrogating the logic of porn. Which I think this is--it's the worst kind of exploitative view of(female) sexuality. A view that doesn't even try to make sense. The entire premise is that certain women, when sufficiently aroused or in a trance-like state, will transform into weapons. Okay... well, anybody who's ever had a frank conversation with a woman would realize the flaw with this, namely sexual response just doesn't work that way, when you need a weapon you need it now, not after several minutes of heavy petting, and for many--perhaps most, I would venture to guess--the immediate life threat would make it pretty hard to get well and truly turned on anyway. I say there's no point interrogating the logic of porn, but is it too much to ask for basic plausibility? Although I should have known; even the silhouette of the main character pair shows a wanton disregard for the realities of biology, with Mamori's rib cage clearly in a different time zone from her hips. And for a show that's supposed to be all about a bunch of women having sex with each other, it... sure seems to have no real idea of how that actually works.\\n\\n\r\nI've (elsewhere) praised Monster Musume for being refreshingly straightforward about what it is. Most ecchi harems are coy and unconsummatable; this one opens with a snake handjob. Most harems spend at least some effort coming up with an excuse for the women to pursue the main character; MonMusu, someone just sort of tells them to, so they do. Most harems wouldn't have basically the entire cast just give up and call the guy a variation on \"MC-kun\". But Monster Musume knows exactly what it is.\\n\\n\r\nNot so Valkyrie Drive. The show keeps reaching for a narrative weight, a seriousness and importance, that it has no way to earn, neither through its compelling plot (which it doesn't have) nor its lovable characters (also missing, instead we get one-note cliches, from Miss Protect Virginity to the various Obviously Psychotic Sexpots who show up, always with the non-consensual S&M routine). But because it has pretensions or aspirations to legitimacy, it tries to deal with ideas well outside its weight class. The threat of rape--weaponized rape, rape to turn its victims into weapons--looms heavy over the show, but won't be seriously examined. It can't be examined, because it's a cheap source of drama and menace, but also (so far as I can tell) supposed to be *hot*; and never mind that the already flimsy premise of plot-convenient arousal falls apart when women can be raped into ecstatic transformation--unless the show is seriously trying to sell a view that's seriously despicable.\\n\\n\r\nThe show can't seem to decide if it wants to be Fantasy Island or Lord of the Flies, and when the serious high-drama plot starts happening you'll have seen it coming from literally episodes away. The only real question is how did anyone allow the situation to get to the state it's in, where all the dominoes can come crashing down so readily.\\n\\n\r\nThere's a way to read this show that as actually a statement about unbridled female sexual desire being such a powerful force that society will do anything to subjugate it, keep it under wraps; that women--especially women who love women--are oppressed and contained because of their *power*. There's a way to read this show as making direct commentary on the very objectification--literally transforming into objects--which it engages in and depicts. There's a way of reading this show that shows that the real monsters are the ones who try to keep these forces repressed, and that the real tragedy is the way women's solidarity turns into a power-struggle catfight as their society immediately reproduces patriarchal norms of dominance from the outside world. Or, rather, there *should* be. But the show's just not up to it. And I wouldn't mind that so much if it would just be honest about it and stop trying to claim some greater significance.\\n\\n\r\nThere's a way to read this show as being about militarism, psychological trauma, about bonds of love and the awakening of same-sex desire... but instead violence is just a thing people do, some because they're broken and others because they're stupid and sadistic; and desire is just a thing that happens when you touch your nipples together or lick the right parts, no matter what the circumstances. Guess it's lucky all the women with the virus happened to be into other women too, huh.\\n\\n\r\nAh well. I guess I should've known. Turns out it's just porn after all. But if that's what I'd wanted, I could've found something that didn't drag for three hours.\\n\\n\r\nNow if you'll excuse me, I'm going to go watch one episode each of three different shows to get this thing off the top of my recently-watched list.",
            "date": "2017-12-20T21:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 265787,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6284433.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/aesaloniichan",
                "username": "aesaloniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=265787"
        },
        {
            "content": "\"Soul Eater with Tits- Some random guy in the comments of the 1st episode\"\r\nWhat a weird but awesome fucking show. I came for the Yuri but stayed for the tits. \r\nThe Quote \" Soul Eater with tits isn't half wrong either. This show gives off a big feel of Soul Eater and Kill La Kill. With a  school structure kind of similar too Kill La Kill and people turning into weapons and wielders like Soul Eater. This just has lots of tits.\r\n~~Spoilers~~\r\nThe first episode or two are so fucking confusing, Nothing is explained and the viewer has no idea what's happening besides Boobs flyingeverywhere and girl on girl action. But you can't help but just watch it.\\n\\n\r\nI really don't have many things wrong with this. Maybe that the MC ( Tokonome) Isn't all that likable with her overly passive/Innocent personality. She isn't bad but isn't that interesting either. \\n\\n\r\nSomething else that kind of bugged me about the show in general is that some of the character models just have this weird look to them. With the only normal looking characters in the show at first were. Meifon Sakura,Rayne Hasumi and Kasumi Shigure. Thankfully later on it seems even the characters that have a weird design kind of look more normal.  The MC ( Tokonome) has a kind of weird design too. I narrowed what i think is wrong with her design down to her having Pigtails that just don't look good on her. It's seen in later episodes that she has her hair down and looks actually pretty normal. I honestly think she should have kept her hair down or in a pony tail for the rest of the show. \\n\\n\r\nThere is also the problem that the 1st episode isn't censored yet every other episode is censored more and more. .\\n\\n\r\nThe characters them self are pretty good. Really Meifon Sakura , Rayne Hasumi, Kasumi Shigure and Mirei Shikishima are probably the most likable characters in the show. Especially Meifon Sakura, She just has this very charming tomboyish personality and character model too boot. \\n\\n\r\nWhile this is a Echi show with Tit's and physically impossible boobs. I don't really think it's all that bad really. It's seems tamed at times i guess when you compare to other shows. Still don't think you should be showing this to your Mom or Dad ( They're probably already disappointed in you enough) \\n\\n\r\nThe ending like a lot of shows is lack luster. With how easily the MC ( Mirei Shikishima) Is defeated over and over again and how many times she would have died if it wasn't for ex machina. She is meant to be a killing machine yet is always easily disarmed and never really seems all that badass at times. She is a badass but it's annoying how she can't even keep herself armed. There is also tons of illogical things like why the Government would send agents out to retrieve such powerful things when there is always a chance that those agents will use such power to rebel. \\n\\n\r\nI do very much like the final villain and how it didn't end on a sour note with the MC and her.\\n\\n\r\nI disliked is what they did with the MC's wish of wanting to see her parents. This was something i honestly was wanting to see. I imagine that sense she was kidnapped that her parents are assuming she is dead or something else. It's also shown that the MC was bullied a lot at school. So i think it would have been really nice for the Two MC's to go back see the parents that have probably given up or about to give up hope that their daughter will come back. Maybe have the MC's go and visit the school she went too ( Was also at school when she was abducted) We could see every students reaction to seeing the chick that has been gone for at least 6 months or so. We could also see their reactions to seeing the MC's girlfriend.  I just feel that they messed up an awesome chance for something kind of cool and nice.\\n\\n\r\nlastly, I dislike how the everything is by the government. I kind of wish the government and the world was oblivious to the existence of these people. I think it would have been better if it some type of mystical organisms that were nothing more but Drones sending people with powers to these islands. I always hate it when the show has these big evil Companies/Organizations and/or Governments that are evil for the sake of being evil. They are what i think is one of the worst cliches in all of media. \\n\\n\r\nGreat show with some obvious issues but good and fun none the less.",
            "date": "2017-12-03T22:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 264483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264483"
        },
        {
            "content": "The premise of this show is absolutely absurd and is an excuse for the anime to be a softcore porn. That being said, if you accept the fact that you are in fact just watching porn, it is actually executed pretty well. The plot arcs in the show are rather generic, but are executed well enough to keep you interested. The characters interactions with each other are often incredibly sexual, but in many cases they have deep or thoughtful conversations about the tasks and issues at hand without it sounding like an excuse to get to the next girl on girl scene. The girl ongirl intimate actions also drops off towards the latter half of the series, but the girl on girl fighting action picks up for some pretty memorable and intense fight sequences. Overall, not a bad anime if you're ok with watching porn.",
            "date": "2017-10-24T10:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 261593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6549543.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DanevsAnime",
                "username": "DanevsAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=261593"
        },
        {
            "content": "Valkyrie Drive is the fan service show I always wanted. An all girl cast who are all lesbian, fighting each other and ripping each other clothes and having sex. This is too good to be true. That being said is it smart, HELL NO! Is it dumb fun at least, HELL YES………...Okay more like sort of, except the last episode which was AWESOME. Let get to the review.\r\nPlot: The basic plot is the fact they exist a diseased call arm, with a liberator and extar, where the liberator can turn their partner extar into a weapon by basically making them orgasm and only girls getthe disease. When discovered with the diseases the girls are sent to an isolated island, in hope that they can adjust back to society.\\n\\n\r\nSo, as you can see this is going to be a heavy yuri fanservice with no guys, except this girl calling himself a guy for some reason. Trust me that not a spoiler, is super obvious. The anime can be divided into three parts. The first four episode just focuses on the two main character fighting the school. At first, is entertaining because how over the top the fan service is. That being said it quickly becomes less and less interesting. In something like Keijo where it has over the top ridiculous fan service, the show keeps managing to make it more and more ridiculous, keeping the show entertaining. In Valkyrie Drive, however, it plays all its card in the first two episode, and the gimmick of lesbians turning into weapon wear off. It never managed to keep itself from feeling fresh and new, and taking it seriously does not do the anime any favor. Luckily after the first four episode, the anime decides to have fun with some fluff episode. While nothing amazing, it at least is entertaining. That being said again, the fanservice just feel tame, which makes the comedy even tamer. There never a clear direction where the show is going, and just feel like a mess. Is starting to feel like just an excuse to have an all lesbian island. Which in that case I rather just have it be a hentai. Luckily the 8 episode and forward does have a plot and does have more weight to the story. The main characters get more flesh out, and we get an over the top villain, who is frankly amazing. It starts to have better action, and an actual direction and plot. That being said is it enough to save what was a rather forgettable fan service show despite having an all lesbian cast? The answer lies in the last episode, which loudly screams yes. The last episode managed to be the over the top fun I was looking for with all their animation effort clearly put in that one episode. It had great design, nice animation, a great villain and just a good episode.  \\n\r\nThe plot is not the best. The plot could have used the disease as a form of discrimination like Cross Ange, or be over the dumb fun like Keijo. The anime, however, is not clever, and it gets pretty tame quickly. That being is still a show about an all lesbian island, with some really good and even awesome scene. It does deliver the fan service, and the last four episode does get interesting enough to have the audience invested. That being said the majority felt directionless.\\n\r\nCharacters: Most fan service show have a mediocre plot, but the characters are usually the saving grace. The two main lead consist of Mirei and Mamori. Mirei is an awesome character. She starts out not speaking almost the entire first episode, and just come off as a total bad ass. She gets jealous easy when it comes to Mirei, which makes for some fun interaction. Her backstory is decent and overall does what she supposed to do. Mamori at first can be annoying. She is basically the oblivious, optimistic airhead. Is fun to see her interaction with other people getting an orgasm in front of her, but it gets tiring fast. Luckily she does learn to accept it, to help other, but that where my problems lied. I wish her relationship with Mirei felt more romantic. I would have liked it if they went with the cliche, am I lesbian, and do I have a feeling for her. At first is clear that she has a problem with being touched, not only because she being sexually harassed, but because they are both girls. I wish there was a better development of her character. There so many ways you can approach with lesbian, and it never takes advantage of it aside for fan service.\\n\r\nAs for the side character, they are fine. They managed to be fun, and don’t really need to be that developed. Lady Lady is also a cool character that managed to have a presence to her that I enjoy. Charlotte was a horrible villain, to be honest, and was unmemorable, but the real villain was great. Not going to spoil her, but she is basically Lady Ragyo from Kill la Kill if she had a smaller body, and more “touching”. She was just over the top fun evil. \\n\r\nArt: Passable. I mean there lots of great fan service that is just hentai, to be honest. I mean the only difference is that hentai scene is longer, but have censored vagina, while this anime never shows it.  \\n\r\nThe fighting scenes are decent, but sometimes are way too short. They never really felt any impact or danger until episode 8. Episode 12 as I mention was amazing, as the animation was on point, with the design, choreography, everything. So prop to the last episode.\\n\r\nMusic: Is actually really good. The intro and ending are great to listen to. The intro has an awesome electric guitar, while the ending song is super catchy. My only complaint is that they could have to use the intro song more in the fights. They only used the song overdrive in a fight once. The score in the anime is decent overall.\\n\r\nOverall: There better ecchi action anime out there. Is it terrible, not really, but I can see people not liking it. Is not a must for yuri fans, and not a must for ecchi fans, but is a must if you are both because there are not many like this. That being said this was just dumb fun, that is really only memorable because of the last episode, and having an all lesbian cast.\\n",
            "date": "2017-08-19T20:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 255853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5944153.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jgames111",
                "username": "jgames111"
            },
            "url": "https://myanimelist.net/reviews.php?id=255853"
        },
        {
            "content": "Here is my review on the anime Valkyrie Drive: Mermaid\r\nThis anime is a rather unique and exciting one, mixing multiple genre elements into something new. New characters are introduced in just about every episode with clear introductions in various types, ranging from slow and explaining to quick and brief. The artwork of the anime looks great with pale and vibrant colors, plenty of detail, and lots of deep lighting effects. The audio is also great, being deep and clear with absolutely to disturbance between voice and sound effect The anime comes with lots of epic, high-paced, combat which shows the weapons, abilities, and skills ofall characters engaged in it which is always loads of fun to watch. As for being ecchi (and a yuri). This anime clearly doesn’t shy away from anything and that actually makes it hentai-like showing lots of sexual activity between exter and liberator, or more freely between any other character. The intro and outro of the anime are amazing, having the intro being far better than the outro. As the outro honestly feels a bit misleading compared to whats shown in the anime itself. But the songs used in them are fun to listen to and are actually kinda addicting to listen to.\\n\\n\r\nOverall, this anime is loads of fun to watch. It has a mix of multiple genres, amazing artwork and animation, and bold sound. It’s loaded with action and adventure, the yuri in the series seemed confusing at first glance, but the way everything has been cleverly put together just made it all make sense. This anime is recommended for those who like anime with action, adventure, and fantasy of sorts. It can be for people who like shoujo and/or yuri.",
            "date": "2016-03-21T11:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 213545,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208294.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nazo-The-Weeb",
                "username": "Nazo-The-Weeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=213545"
        },
        {
            "content": "It’s a masterpiece!\r\nI do mean that, in a sense. Of COURSE this anime is lackluster in the grand scheme of things but that isn’t what’s important here. What matters is that I went into this series expecting to drop it after the first episode(I try to give everything I watch 3 episodes unless it’s just horrible, I was expecting Valkyrie Drive to be horrible) but what I got was a strangely drinkable sexy-action anime with plenty of light hearted moments and humor to boot. I’m not really even that interested in these kinds of action series either but Valkyrie Drive is uniquely charming.\r\nThe 5 outof 10 score may as well be a perfect 10 considering what we are talking about and my predisposition I had for this anime. If you were curious about this one you should definitely give it a go, you might be surprised!",
            "date": "2016-01-02T01:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 207518,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4332091.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sawt0othGrin",
                "username": "Sawt0othGrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=207518"
        },
        {
            "content": "Here is my honest opinion.\r\nThe reason I'm watching this is for the soft-core borderline hentai Yuri where girls orgasm to the point of transforming into weapon kinda stuff,\r\nthroughout all the episode, all I can think about is ass and tits. Then after episode 8 things started to get kind a a bit interesting, especially about the story plot.\r\nHere is where the story told you a little about the secret of the island and the organization behind this, and also Shikishima Mirei's past history.\r\nAfter that, the battle went a bit intense and the story keeps me a bit interested about what is going to be unfolded.\r\nTheending was okay, I guess. It reminds me like that last scene from Madoka Magica of some sort, where everyone was saved and the MC became godlike (not to the point of becoming god themselves however).\\n\\n\r\nAlmost forgot, I like the opening song though, for a story this mediocre it's kinda catchy.",
            "date": "2017-04-28T15:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 246498,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3496045.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/virus_mal",
                "username": "virus_mal"
            },
            "url": "https://myanimelist.net/reviews.php?id=246498"
        },
        {
            "content": "Nobody can complain about the smut in this anime.  It's not a secret.  You know what you're getting when you watch it.  If you're okay with lewdity, fine.  If you're not, don't watch it.  It's very simple.  There are no surprises in that department and no need to include it in detail in this review.  So I won't.  \r\nIf you're okay with lewdity and tempted to watch this, I feel you should be forewarned.  The main character is a whimpering annoyance.  Her squeaky, cutesy, nervous, whiney voice WILL grate your last nerve.  Guaranteed.If you can handle her, and don't say you weren't warned, this anime is actually very watchable.  The story isn't great but the characters are reasonably interesting and there's enough going on to keep you interested.  It's not a classic, by any means.  It's just a bit of fun for a few hours, providing you can tolerate the main character.  \\n\\n\r\nI apologise for not going into too much depth about the story, but an anime this shallow doesn't require it.  Girls fight each other.  That's pretty much it.\\n",
            "date": "2017-04-14T08:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 245463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3521507.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GoGoTsukiko",
                "username": "GoGoTsukiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=245463"
        },
        {
            "content": "This is a 24 min, 12 episode show that has one of the best concepts of all time, what else do you want. Honestly, If you watch the first 5 minutes of episode 1 you can clearly realize what this show will be about so just enjoy this literal gift from God since there no many other shows out there like this one.  Kaneko, Hiraku is a god amongst man and people need to stop taking this so seriously, but I'm not saying people should not have standards but come on this show was created to show a ton of fanservice and not asa serious show. In the end, this is was an amazing yuri and ecchi show that I hope more people will enjoy in the future.",
            "date": "2019-04-07T17:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 305723,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7798082.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BecomingWeeb",
                "username": "BecomingWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=305723"
        },
        {
            "content": "Welcome to another of Robert's Too Late Reviews! I really gotta work on making sure they're actually late, instead of being half-way recent. Anyways, this time we're going to be talking about the dubbed version of Valkyrie Drive Mermaid. Be sure to check the synopsis, because I'm to be working directly off those details without repeating them. To make the short of it, this show is a good looking mess, with all kinds of convenient things thrown in and blended with some of the most unrealistic representation of the female form I've ever seen. Right now, the character Meifon would be taking bets on ifthis show made the wall of RTLR boobage, and the smart money is going to be on no. Let's kick this thing, and see what comes out. \\n\\n\r\nStory: 4\\n\r\nThe story can somewhat summed up in three words: echhi Soul Eater. To expound on this, we have girls who have a virus only females can get that causes them to either have the power to wield strong weapons, or become said weapons on being sexually stimulated. Basically the Liberator (wielder) makes the Extar (weapons girl) orgasm and then she turns into a machine gun, or a sword, and one even turns into a motorcycle. This is similar to Soul Eater (which I really enjoyed) only with the kink factor. I don't see how they ever get around to fighting anything, because before the battle they have to make out and get all hot and bothered before the weapon girl can transform. The show uses convenient 'out of time' moments to achieve this, but logistically it would just not work. There's a tacked on bit at the very end about this so-called 'Valkyrie effect' but we're never really told why it happens, what it does (besides a VERY basic 'it causes evolution' statement) or why one girl possesses it when the others don't. \\n\\n\r\nThe story moves from villain to villain, which in itself is not unusual, but the transitions are awkward. First it's the dominant group on the island that causes the issue, then they become a non-factor once a secret is discovered. In light of this new threat, the Liberator of the primary character develops sudden and convenient 'augmentations'. I will credit that they do slip in a flashback or two that kind of sets up the 'army' angle, but not at any level that explains what we see happen on screen. And once again we have a military soldier that refuses to kill an enemy out to kill her, but has not problem beating the ever loving shit out of strange girls she's just met. \\n\\n\r\nThe Liberator is your usual quiet, reserved girl, who is of course stacked like a brick house. This girl would make porn stars self conscious. The main girl, who is an Extar, is a year older, but very much your sweet, kind-hearted cliche. She seems like she would have a hard time passing for 14, let alone the 16 that is stated in the dubbed version. Of course she has to be brought to the height of sexual arousal and/or climax to transform into an awesome sword the Liberator girl uses to cut down everything in their path. Never once are we left to wonder why these girls are all attracted to other girls. I have no problem with homosexuality, but I do have a problem when it is a state of nature forced on all the characters for nothing more that titillation. If they explained that the virus causes same sex attraction, fine, but otherwise, why is every last girl at least bisexual or lesbian, except for the fact this is made for male fanservice? We even get a girl that dreams of a love that does not have the virus and is back in the 'real' world and that's a girl too. \\n\\n\r\nThe story seems to be made up as they went. First fight the original people who have formed a society. Then when that got boring, let's twist it up and introduce a secret that causes the former enemies to come to each other's aid. That got old so then they forced an outside source to come in and mop up the last of the story. It was a trudge to watch, and that's saying something when the art and action were pretty well done. Soul Eater was repetitious, and I actually like Fairy Tail, another show with endless recycling, but Valkyrie Overdrive Mermaid made me yawn and check my watch often. And that's with tits bouncing everywhere, and girls getting all hot and bothered with each other. We'll cover more of that later. \\n\\n\r\nThe story was a total yawn, even though it opened fairly competently for perhaps 2 episodes. After that it seemed like they were just throwing things against the wall and writing anything that even sort of stuck. Final complaint about the story, there's a character that preaches that the girls on the island are being watched for signs they can reintegrate into society at large. While this seems like nothing more than a convenient lie for that character to hold power, they throw in that the character was right, and there were watchers among them. What could have been a shocking moment turned groan inducing at best. \\n\\n\r\nAlso beware and this is a bit of a *SPOILER* but there is basically tentacle porn at one point in the end. If you're not looking to see things like that, steer clear. /SPOILER\\n\\n\r\nArt: 7\\n\r\nThe girls look good, and have unique looks. The art is nicely done, flows well, and for the characters that aren't over-designed look really good. The main girl and her Liberator are especially well done, the Liberator is stacked, but not ridiculously so (which is a HUGE problem in this anime) and the main character is cute as a button. Some of the other girls look really well, I was a fan of Meifon's character, but she was an A-cup chest wise and wasn't drawn with ungodly proportions. She seems so much more believable without breasts that likely generate their own gravity well. \\n\\n\r\nThat's the biggest knock on the art. For example I actually had to watch the first episode twice because I could not believe the super exaggerated breasts were actually part of the series. Until they started showing some of the other island inhabitants, I thought the girl on the beach with the beachball sized breasts was an anomaly. She isn't. Whoever directed art in this series doesn't seem too familiar with actual real breasts, or has some kind of HUGE fetish for large knockers. Seriously there is a character, and to an extent her partner, that I really think are three people standing huddled together with skin covering them. I swear Lady J's breasts actually outweighed the rest of her body. Her partner Lady Rain is just about as bad. \\n\\n\r\n*SPOILER* there is a character posing as the only male on the island who is actually female. She binds her breasts for her public appearances, but when she takes her binds off, her tits are probably in the running for largest in the entire series save for the Ladies. /SPOILER.\\n\\n\r\nOtherwise the fights are cool, the effects are awesome, and the colors pop nicely, if only if you can get past breasts bigger than their owners head.\\n\\n\r\nSound: 7\\n\r\nThe sound is nice, I particularly like the themes, opening and closing. they have a nice driving rock sound to them. The end song, after it gets past the cutesy opening seems to take a page from Metallica's One song. No comparison of course, but a nice heavy beat. It fits the show about girls battling quite nicely. The background music and sound effects are all within parameters and never stick out as odd. Sound is one of those things it can be kind of hard to mess up, outside of the themes and certain background tracks. The show also features two of my favorite VA's in the industry, Britteny Karbowski and Jamie Marchi. As an aside, I am only peripherally aware of some 'Vic' drama, and I have no interest in learning more about it. Many more important issues to me close to home, so I just like those girls because I admire their work. I could care less about the politics or whatever scandal is raging behind the scenes. If I want to take on that kind of thing, I'll watch the news. I come to anime to enjoy myself. \\n\\n\r\nBrittney does an excellent job with Meifon though Jami Marchi is kind of underutilized as Lady J. The rest of the voice work is well done. The extremely mature main Liberator, sounds appropriately grown up (even if she's supposed to be 15) and the main character is cute, and doesn't really move too close to annoying at any point. She sounds appropriately innocent and scared a lot of the time. The ding comes from the fact that there's one character who isn't who they say they are (earlier spoiler related) and the instant they open their mouths, it's more than obvious. \\n\\n\r\nI also recommend watching this alone or while wearing headphones. I mean the premise of the show is girls transforming when aroused or orgasming, so there's a LOT of moaning at times. Not something you might want to broadcast to everyone around you. \\n\\n\r\nCharacter: 5\\n\r\nThis is a weak link. The main Liberator is hinted in a couple of flashbacks as being a soldier, but that thread to me is weak, and seems shoehorned into to bring about the appearance of yet another villain later in the series. The Liberator is also the quiet type, to the point I thought that first she couldn't even talk. She never says much or contributes to the plot in any meaningful way via her speech. The main girl is innocent, but the act does get a little old. When we're 3 episodes from the end and she's transformed many times via sexual arousal, it seems odd that she's still shy about it. \\n\\n\r\nThe main Liberator's past is kind of skewed as well. At some point someone mentions that her type were not supposed to be given the training she had, yet she get its, along with one of the villains. Then we find out that Lady J and Lady Rain also have training. Yet they send the main girl and the main Liberator to the island at 16 and 15 respectively. Did the Ladies get sent later? Why was there a delay? There's a scene where the parents of the main girl learn that she has the virus, and the kid can't be more than 7 or 8 years old. Why wait a handful more years to ship her out to the island with the rest of the infected girls? Never explained.\\n\\n\r\nAnother character complaint is the lack of consistency in their Extars. For most girls, one is a user (Liberator) and one is the weapon (Extar). For some reason, the Governor has an artificial Extar, breaking the 'norm' of the island. The duo of Ladies also are able to to be both Liberator and Extar at the same time, and as far as I saw, was the only duo who were able to pull off that trick. Meifon, though I like her, doesn't have a human Extar, instead she's so obsessed with cash that she's able to use it to be her Extar, staying powered up as long as she has the funds. The rules on what/who can be an Extar is all over the place with no logical reasoning. In fact, one of the early villains is able to use several girls as Extars all at once without any mention if she had special training or why she can do something others don't seem capable of. \\n\\n\r\nThen we have the commander of the society's forces who starts as an enemy of our main pair but later becomes an ally yet cannot break free from her duty to do as she's told. They prop this up by holding her lover captive, but she's such a badass she could easily take out those that stand in her way and easily rescue of her love. Yet she doesn't do it, just follows orders that she knows are wrong. The characters are just a total mess. \\n\\n\r\nEnjoyment: 6\\n\r\nI got a fair amount of enjoyment, not from the nudity or anything like that but because Meifon cracked me up, and I kept rooting for the commander to overcome her circumstances. I also enjoy *good* ecchi, and while this is not that, it has it's own trashy appeal. The battles were also pretty cool at times, also I do have to complain about one thing: these girls often end up with melee weapons, and they all tend to use said melee weapons to shoot energy beams. If I see two people with swords, I want a sword fight, not them randomly trying to blast each other over and over with energy. The battles were still kind of fun irregardless. \\n\\n\r\nBest girl: Kasumi. The commander who's love is held hostage because she kicks nine kinds of ass without an Extar, and when she gets one, after suffering the initial setback all heroes face, she rocks the house. Love the hair cut too. \\n\\n\r\nThis show is trashy ecchi, and if you're looking for that, then this is the one for you. If you have watched Soul Eater and thought 'this needs more tits' then this is the show for you. If you're looking for something with a bit more substance over style, move on. So for this one, no entry on the RTLR of hotties. All thumbs horizontal at best.",
            "date": "2019-02-25T18:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 302465,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6918726.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/captjoe213",
                "username": "captjoe213"
            },
            "url": "https://myanimelist.net/reviews.php?id=302465"
        },
        {
            "content": "What will you find on this show?\r\nTITS. In Every colour, shape, and size, imaginable. \r\nAnd very bizarre relationships among women in general. This thing has'nt a single drop of history, it's like the  writter and the director would had crapped in your head until your brain melted out.\r\nHad not i seen this thing.... i probably would be happier. It's still better  than Mars of Destruction, but this is one of those thing which for the extreme danger that it represents for mankind, the world and the fabric of the reality itself....and should be hidden next to the ark of the covenant, the grailand those things from the histories of bygone\\n\\n\r\nSo, unless you really want to see this kind of  thing; please..... avoid this suffering",
            "date": "2016-05-27T12:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 219427,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4128459.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/josmaker2mk",
                "username": "josmaker2mk"
            },
            "url": "https://myanimelist.net/reviews.php?id=219427"
        }
    ],
    [
        {
            "content": "This is, putting it simply, a softcore lesbian porn anime. It exists primarily to arouse the viewer; nothing more, nothing less. The story is simply an excuse for seeing sexy girls interact, fanservicey fight-scenes and borderline hentai scenes. The truth is, actual hentai anime tends to be stuck with very small budgets; meanwhile \"softcore\" anime can more often afford significantly better production values, as this anime shows, and I much rather enjoy a softcore show with decent production values over chicken-scratch \"hardcore\" OVAs.\r\nThe story of a bunch of girls being trapped on an island, the \"Soul Eater, but with orgasms\" premise of the action scenes...all of this, as I said above, pretty much an excuse for boobs and yuri, and the characters primarily exist to fit specific fetishes. In that regard, both the \"plot\" and characterization do a pretty good job.\\n\\n\r\nThe visuals are pretty nice; sometimes the amount of polish obviously falters, but the lewd scenes tend to look quite good and the character designs are obviously the best and most appealing out of all the Valkyrie Drive projects. They lack the typical VN-esque cheapness often found in such anime, instead managing to be quite stylish and charming and, while not particularly unique, nonetheless have their own look and feel. The animation is pretty competently done when it matters and the series succeeds at having many genuinely sexy scenes.\\n\\n\r\nSound-wise there's nothing to complain about; the VA cast is fine, as is the music, and the obligatory moans do their job quite well.\\n\\n\r\nAs a fan of competently done lewd yuri, I quite enjoyed this series in the basest way imaginable; and really, given what its intentions are, that's just about all that I needed.",
            "date": "2016-01-09T10:27:00+00:00",
            "helpful_count": 118,
            "mal_id": 208133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372914.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/busterbeam",
                "username": "busterbeam"
            },
            "url": "https://myanimelist.net/reviews.php?id=208133"
        },
        {
            "content": "FROM STUDIO ARMS.... COMES SOMETHING CALLED VALKYRIE DRIVE MERMAID.. \r\nWtf did i get myself into... Well if u like boobs... and if u like yuri... and if u like magic fighting girls with guns and swords... and u like a show with \"plot\" but really no real plot... \r\nTHIS IS THE SHOW FOR YOU\r\n\"Story\" 3/10\r\nI really am not enjoying any of this.. There is no elements that seem to matter or show importance in the show... none of it really makes sense and I really think none of it matters... Just a 15 year old girl and a 19 year old girl make love (uncensored)and one turns into a fucking weapon or something... stuck on a mermaid island with other magic lesbian girls... and activate powers by smashing tits. Introducing other fun generic yuri characters from other animes. Trying to cater to any type of fetish you may have as the viewer... but I really just dont feel obligated to watch another episode... you will never get hyped or feel any real emotion... and if you do... well good I am glad you are enjoying it... while I can't see any redeeming qualities to a show that literally needs a bouncing tit to keep the show from going to boring generic garbage... but really I LOVE ECCHI and LOVE all the other stuff but like with no story no enjoyable characters.. generic everything I just barely can make it through each episode... \\n\\n\r\nArt: 8/10\\n\r\nIts good computer garbage stuff not amazing but... really can see those bouncing plots.. \\n\\n\r\nSound: 9/10\\n\r\nVoice acting is fine clear, some characters don't fit there voices and become extremely annoying but at least I can really here the love noises so that's a plus..\\n\\n\r\nCharacters: 3/10\\n\r\nSo far... ones an underage virgin or something and the other is a serious twenty year old with huge tits but in reality is like 15.. they become partners.. and do shit... Other characters are thinking they are overpowered female lesbians who transform into the best weapons and just get their asses kicked by loli MC and 20 year old MC and other side friends like money loli, mom with huge boobs, and basically everyone has huge boobs and is lesbian... and the one guy or governor or something is a girl thats called a\"guy\"... Really not memorable.. Characters are pretty generic and annoying.. \\n\\n\r\nEnjoyment: 5/10\\n\r\nA sad fap...\\n\\n\r\nOverall: 3/10\\n\r\nJust a show with tits and yuri to keep the viewer entertained with no real story to cherish... Really disappointing... waste of time (unless u wanna fap)\\n\r\nIf you want a similar show.. go watch High school DxD or something... idk... 3/10 \\n\\n\r\njust dont",
            "date": "2015-11-28T14:40:00+00:00",
            "helpful_count": 94,
            "mal_id": 204368,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4516181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Anthoniichan",
                "username": "Anthoniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=204368"
        },
        {
            "content": "This is lewd show for sure, everyone can read the description right? though I must admit, this one is not your average ecchi show, I think  it is not exaggerated to label it borderline hen***. Is it bad then? that's up to the viewer to decide. personally I'll say this show is enjoyable, not because the perverted things, it has few good points too.\r\nStory: 7/10\r\ncall me inexperienced, but I won't complain that much about this anime originality. the concept about human transform into weapon might have used in some anime. But combine it with other elements this anime has, I think this one ispretty unique. Okay let's move to real plot. The story itself is pretty decent in my opinion. It might have awkward and slow introduction, but trust me, you'll eventually understand almost everything about the chicks circumstance or even how their world is working. There are a lot of flashback as well, which is presented well and smooth. Also, there is good portion of battle in this show.Although, I'll call the battle itself a joke. No.. uhm, I don't mean the \"intro\", but the actual battle itself. It just went bam..bam! or maybe few flash, beam.. then its over, as simple as that. Some character might give a good show though, for example the four-eyes commander or duo lady.\\n\\n\r\nArt: 8/10\\n\r\nThere are a lot of oversized things here, if you know what I mean. I think they should made it moderate, not that I totally dislike it. Joke aside, I think the animation is good and fluid, the characters design are nice if you ignore particular part. I especially like the duo lady figures, it give \"wild but cool\" image matching perfectly with their personalities. And the last episode animation was amazing.\\n\\n\r\nSound: 8/10\\n\r\ncharacter voices are not half bad, and I like the OP and ED.\\n\\n\r\nCharacter: 9/10\\n\r\nI like most character.The blonde one have some development, everyone else are static though, just being what they are until the end. Some of them might even surprise you. I like how everyone participated in the last battle, that was some cool action there, the best part in this anime in my opinion.\\n\\n\r\nEnjoyment and Overall: 9/10\\n\r\nHonestly, I'll even give this show full score in term of enjoyment. But I'll hold back since I don't want to be labelled as hen***. Still, this show keep me entertained until last episode, it has nice characters, decent story with good pacing. It's not show for some kid with weak heart as there are some intense scene, also not good for any good man who dislike anything lewd and irrational. But, if you think you like this kind of show, you'll realized this anime is not bad at all.. and you might want to double check your room door to ensure it's locked properly.",
            "date": "2016-01-02T07:17:00+00:00",
            "helpful_count": 71,
            "mal_id": 207540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3023903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Juarez",
                "username": "Juarez"
            },
            "url": "https://myanimelist.net/reviews.php?id=207540"
        },
        {
            "content": "Studio Arms has a rather—shall we say—less than impressive reputation in the anime community. Although they have done numerous different types of shows in the past, the most prevalent one is action/ecchi... and I mean the very worst kind of it. If there is one company who seemingly has a full monopoly on bad ecchi anime, then it's Arms. I still consider Queen's Blade to be the single worst full-length anime TV-series I have ever seen, and my faith in the studio since then has been rather limited to say the least. And thus it is hardly a surprise that I wasn't exactly expecting muchout of Valkyrie Drive either, but to my amazement... it wasn't actually that bad. Certainly not more than average at best mind you, but a hell of a lot better than what I've come to expect from Arms at this point.\\n\\n\r\nThe story is about as nonsensical as you'd imagine it to be. It takes place on a set of artificial islands with an all-female population. The girls are divided into pairs of Liberators and Exters. If a Liberator sexually stimulates her partner, the Exter will transform into a physical weapon which the Liberator can then wield in combat. Sounds weird I'm sure but it's pretty straightforward, and that's the way this world works. There is an established society on the islands with different internal factions and individuals pursuing their own goals. And that leads us to what I'd probably consider the anime's greatest weakness, namely the lack of any real long-term purpose for the majority of the story. For about two thirds of the show, there's no one bad guy on the islands to defeat, nor is there a personal ambition for the main duo to reach or anything like that. They just... go with the flow of events and one thing leads to another which gets them tangled up in various incidents, and eventually it converges on to a single goal. It's a bit awkward, but then again you have to consider this a secondary notion since you'll certainly not be watching Valkyrie Drive for the story anyway.\\n\\n\r\nAnd that is where this anime exceeded my expectations: the ecchi. Historically speaking, Arms has pretty much the worst ecchi on the market, basically having the \"big breasts solve everything\" approach with absolutely no creativity put into it at all (and when I say big breasts I mean REALLY big). In Valkyrie Drive however, this is not really the case. Well okay, it certainly does have a lot of needlessly busty girls in it, but it's got a lot more than that. Since the series revolves around girls sexually stimulating each other in order to draw out their partners' powers, it obviously can't just get away with shoving tits into the camera every 5 seconds. It needs actual physical stimulation. And as a result, Valkyrie Drive has a plethora of uncensored yuri sex in it. That's not something you see every day. Now of course that doesn't mean it's at hentai level, but it comes pretty close sometimes (especially the BD specials, hot damn). For example there's one scene where two of the girls are blatantly 69'ing and licking each other out; we may not actually be shown their genitals on screen but... you know exactly what's going on as a viewer. Case in point, Valkyrie Drive is actually pretty hot. Not all the time of course, but often enough. For an Arms anime, that's a tremendous achievement to me. And let's be honest here, how many borderline hentai anime does there exist out there that's girl-on-girl? Yuri is normally stereotyped as something cute and romantic like in Yuru Yuri or Sakura Trick for example, not something as lustful and perverted as this. That alone gives it a lot of points for originality when you think about it.\\n\\n\r\nAnd really that is pretty much all that needs to be said about this anime. The art and sound is about what you'd expect it to be, nothing remarkable but not bad either (I like the OP song though). The plotline is incredibly dumb but I don't think anyone believed it to be otherwise before watching it either. And the characters are for the most part not anything more than plot mechanics for the sake of ecchi, though I'll at least have to give some credit to Meifon for being somewhat of an unexpected wildcat who kept things interesting with her deceitful antics. But in the end, all that really matters in Valkyrie Drive is of course the ecchi, and although it still suffers from having a lot of oversized breasts and clothes ripping during action scenes for no apparent reason, the yuri scenes more than make up for it. There's something magical about seeing a pair of horny anime chicks passionately tongue wrestling and greedily indulging in each other's nipples, and Valkyrie Drive tries its very hardest to showcase exactly why. It may be considered crude, but so be it; at least it's crude in a damn arousing way.",
            "date": "2015-12-27T03:28:00+00:00",
            "helpful_count": 33,
            "mal_id": 206937,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=206937"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nPicture a mermaid.\r\nMost people imagine a beautiful woman whose lower body is that of a scaled, green fish. Maybe she can sing real swell and maybe she is longing for love. But regardless, she is two halves that make up an entire whole.\r\nValkyrie Drive: Mermaid is the same. Mermaid is one half sex and one half tale, making it one not-as-bad-as-you-may-imagine anime.\r\nSTORY\r\nAnime has its fair share of strange premises; Mermaid’s premise gets added to this list.\r\nA virus, the “Armed Virus,” infects women, granting them special abilities. Society deems these women dangerous, so they get sentto isolated islands to fend for themselves. The kicker is that these special abilities remain latent unless the women classified as “Liberators” make the women classified as “Extars” achieve orgasm. (Intriguing, no?)\\n\\n\r\nUnderstandably, then, Mermaid is rampant with sexual content. Girls are constantly kissing and fondling and canoodling. But they are not swapping spit because the audience wants to see it (although that is one reason for doing so), they are tongue twirling because it is an essential part of the plot. In other words, the sex is not just pleasurable but also purposeful.\\n\\n\r\nThe season, with sex in tow, takes a standard approach. The first few episodes mostly establish the setting and the characters. The next few after move into slice-of-life territory with more character-oriented material. And the final few episodes are where the major conflict occurs.\\n\\n\r\nThroughout the season, Mermaid is prone to repetition. The fights are usually one-sided triumphs rather than full-fledged duels. But even worse is the repetition in the sexual asides. Surprisingly, the anime does not get very creative, using the same means to sexually arouse the girls’ partners with each iteration. Admittedly there are not a whole lot of ways that making out and touching can be depicted, but the actions almost never come off as unique for the individuals involved.\\n\\n\r\nIn order to combat this repetition, Mermaid dabbles into other areas besides sex. One episode follows a girl who grows gigantically. (The size of her breasts have to have broken an anime world record of some kind.) Another episode has the women participating in a beauty pageant. And all the while, the anime injects bits of comedy, like Mamori getting called a “virgin” or Meifon having a “Foreclosure” sign censoring her crotch.\\n\\n\r\nRepetition is further fought when the anime continually includes more and different details. Liberators and Extars that can switch roles. Artificial Extars. New abilities and powers. The introduction of enhanced “Soldiers.” And massive robots. The anime does a decent job of constantly introducing new material even if said material is only around for a brief period of time.\\n\\n\r\nThe general amount of fun that Mermaid takes part in mistakenly pushes away the relevancy of the major conflict until the end of the season. The Soldiers and their organization are very briefly mentioned in flashbacks or in passing, and it is only near the end of the season where they finally reveal themselves. Since the show did not buildup to this conflict, when it finally appears, it almost feels out of place.\\n\\n\r\nThe ending has tonal issues, too. Before, the anime could get dire, but it was never grim or overly dramatic. The major conflict, however, does away with this notion: rape, underhandedness, and lots of losing become the norm. On the one hand, the tonal shift is welcoming because Mermaid did not seem to have a coherent narrative in mind. On the other hand, the tonal shift is rather jarring when it gets as dark as it does.\\n\\n\r\nThe ending also has two more problems.\\n\\n\r\nOne, it is too contrived. Not just that the virus essentially cures itself, but also there is no precedence for it. Momoka brings up the idea at the end in passing only. And nothing really changes between Mamori and Mirei over the course of the season to constitute them achieving “Valkyrie Drive” at the end as opposed to the countless other times.\\n\\n\r\nAnd two, it goes against the plot of the anime. The entire time, the girls on the island were trying to prove that they could be reinstated into normal society by exemplifying order and stability. But the solution given instantly saves everyone, meaning that the events leading up to the ending were mostly for naught.\\n\\n\r\nWhen all is said and done, there are about two ways to view Mermaid. The first view is the simpler one: A grander message does not exist. This anime is all about action and boobs and girls and not much more. This interpretation is fine; a show does not have to be deep to be worthwhile.\\n\\n\r\nThe second view, however, gives the anime a bit more credit: Always have hope. Placed on an island far and away from normal civilization, the girls still hold out hope that they will someday make their way back home. Until that time, they rely on each other. They do so more intimately than one may think, but, as they prove, hope is made stronger when it is held by many rather than when it is held by few.\\n\\n\r\nOr one can believe in the third, hidden, and arguably best view: Yuri is a blessing. What saved the girls and cured the virus was not some newfound piece of technology or a breakthrough in medicine. What brought peace and comfort was the beautiful love that two girls shared between each other.\\n\\n\r\nIf that is not a wonderful message, then no message is.\\n\\n\r\nANIMATION\\n\\n\r\nMermaid is best watched (perhaps obviously) while uncensored. The uncensored version does away with nearly every single light beam that shines throughout the censored version. “Nearly every” because the one in episode six, where Mirei performs a rather lewd exercise, exists.\\n\\n\r\nGiven that Mermaid is watched while uncensored, it focuses its art and its animation where it counts the most: the girls, the boobs, and the near-fornication.\\n\\n\r\nDowntime in the anime hardly sees extensive animation such as with hair or limb movements. However, the anime almost always makes sure to have the breasts jiggling. Battles, in contrast, do try their best to keep up in animation. Flying fire birds, colorful laser beams, and difficult-to-pull-off acrobatics, while lacking in tight choreography, create a lot of movement on the screen. Mermaid knows it cannot always keep up, so, to compensate, the cinematography hones in on risqué shots of the characters’ butts and bosoms wherever necessary (or unnecessary).\\n\\n\r\nWhere Mermaid diverts most of its animation is into the sexual content, and, more specifically, the scenes where the Liberators have to use their Extars. Extra frames for turgid nipples, dancing tongues, and locked legs are more than welcome, creating steamy scenarios that even the people in the anime cannot help but blush at.\\n\\n\r\nThe rest of the art is similar to the usual amount of actual animation in that it is not that impressive. Island terrain makes up the vast majority of the art – jungles, hot springs, and ocean fronts – but the castle, a hidden abode, and an underground factory attempt to shake up, however slightly, the usual offerings.\\n\\n\r\nAnd to be fair to the anime, the characters are on an island. Meaning, it may be silly to expect anything else besides a lot of trees and the sea.\\n\\n\r\nAs for the character designs, while the characters rarely change outfits, they are diverse and detailed enough to be considered interesting. Furthermore, each character wears lipstick or has their lips colored, accentuating their beauty that much more.\\n\\n\r\nFor example, Mirei’s long, blonde hair, too-short skirt, and ample figure maximize her attractiveness. Meifon’s signature pink cowboy hat symbolizes her fun and carefree nature. And Akira’s different designs contrasted well: While disguised as a male, she wears a professional, commander suit with cropped hair, and, as her regular self, she wears a summer gown with long, red hair that undeniably proves she is female.\\n\\n\r\nAlso, a special shout out goes to Charlotte’s design. Her styled, pink hair, purple, regal outfit, and exposed, ample bust turns her into quite the sexy minx.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Mermaid could go either way.\\n\\n\r\nThe characters do not have a discernable theme that connects them all. An argument exists for the characters protecting or fighting for a partner, but, since many of them do not have partners or do not uphold this sentiment, the theme is not that strong.\\n\\n\r\nLooking more closely at the cast, Mamori, the oft called “virgin,” appears to be the main protagonist of the anime. But she quickly makes it clear that she is not entirely fit for the role. She is wimpy, scared, and unable to fend for herself. However, what makes her a tried and true protagonist is that she is perhaps the strongest Extar on the island. This detail is only made known when her Liberator finally appears.\\n\\n\r\nSaid Liberator is none other than Mirei, the actual main protagonist of Mermaid. Mirei does not speak much: for her, “actions speak louder than words.” She also contrasts with Mamori (and not just in size). Mirei is strong. She is confident. She is able. (“Opposites attract.”) On top of sharing a dislike for violence (this trait of Mirei’s is revealed later) with Mamori, Mirei is the perfect match for the tiny, redheaded girl.\\n\\n\r\nThus, the two become a team. They work together to protect each other and to help the other denizens of the island. Although not everything is serene. Mamori longs to go home; she misses her parents. And Mirei has a past that remains mysterious to the audience for quite some time.\\n\\n\r\nIt is not until a very harrowing situation that Mirei reveals her secret: She was part of an “Enhanced” project that altered her body. As further flashbacks reveal, Mirei used to be with another partner, Momoka (codenamed “A3”). When Mirei refused to fight, she was deemed “useless” (the anime’s words), and she was nearly terminated. But the doctor (in a slightly contrived manner) wanted to make amends for his sins, so he did not kill Mirei. He sent her away.\\n\\n\r\nHaving abandoned and been abandoned, Mirei was lonely. She was lost in a world that did not want her. She was eventually caught as an Armed Virus holder, and she was once again whisked away. Only this time, she met the person who would save her: Mamori.\\n\\n\r\nMamori was there for her and kind to her. But, most importantly, she became her friend, her lover in arms. It is Mamori that drives Mirei to go the distance. Mirei defeats Momoka, saves the girls of the island, and leaves with Mamori to be together forever.\\n\\n\r\nThe negative side effects of Mirei’s enhanced form are brought up, but Mermaid mistakenly does not use this detail for any purpose except to conveniently force Mirei to retreat. Still, it is apparent that Mirei is the strongest character of the show. She gets a lot of focus, and, more specifically, she gets a lot of focus in the final few episodes of the season. This development is nice for her, but Mermaid almost seems to forget about its other characters.\\n\\n\r\nFor example, Mamori hardly has a presence. After she reveals how much she wishes to go home, her character receives very little attention. Literally right at the end, however, she demonstrates her newfound courage. When presented with the chance to finally go home, she decides not to, opting to help the other girls affected by the virus all around the world.\\n\\n\r\nLady Lady are characters that likewise lack presence. They believe that people should be allowed to do what they want, and they repeatedly show this by acting of their own volition. It is an interesting trait, but since Lady Lady never have their characters elaborated on, they are more like convenient plot devices than actual characters. They are arguably heavy side characters, meaning them not receiving a lot of attention is understandable. But having at least a background would have been nice.\\n\\n\r\nAnd then there is Shigure who is yet another example of a character lacking presence. Her character acts as a mediator between Akira and Charlotte as well as a stern yet forgiving leader for the other girls on the island. She has a subplot involving Hibiki, a girl whose initial arrival on the island causes her severe mental trauma. This detail is minimally referenced throughout the season; the audience is only made aware of the full background near the end. Still, Hibiki gets inspired by Mirei to finally help and thereby giving the audience its first look at Shigure’s Armed state and bringing this meager subplot to completion.\\n\\n\r\nThe rest of the characters follow the trend of not completing their character arcs. The most glaring example is Akira. Her character represented hope. She was instilled with hope, she provided hope, and she believed in hope. When she was exposed to be a woman and not a man, her defeat is symbolic of hope being lost. And as the events show, hope is lost.\\n\\n\r\nYet the anime does not revisit her character, i.e., her arc does not complete. She shows up at the end, but very little time is given to her and her message of hope. The same happens with Charlotte. Charlotte was not much of a character; she was relegated to being a thorn in the sides of everyone. Later on, she takes over as Gouverneur, gets smacked around by Momoka, and loses thoroughly to Mirei and Lady Lady. Yet, like Akira, her character does not have a complete arc. The last line she speaks is “Now we can go home,” but that does not demonstrate if she changed or if she will change.\\n\\n\r\nAs for Momoka, besides not showing up until the end of the season, she was setup as a nice antagonist. Indirectly betrayed by Mirei, she was forced to undergo further experimentation, turning her into a “monster” (her own words). She is conniving, cruel, and crazy, but it is her unfathomable need for revenge against Mirei that made her seriously sinister.\\n\\n\r\nWhat results is her taking over the island, kidnapping Momoka, and nearly wiping out Mirei and the others. The final fight against her involves most of the cast – as well as a combined, “Valkyrie Drive” Momoka and Mirei – and it seems she is defeated. She is even the first one to get cured with a kiss from Mirei that also symbolizes the apology to her and the reformation of their relationship.\\n\\n\r\nBut, again, what happens to her afterwards is not shown. It is alluded that she is taken into custody, but whether or not she lives a happier life, tries to be nicer, or simply matures is not shown or known.\\n\\n\r\nThus the cast could go either way. However, since the anime was juggling many characters (and boobs) at once, and taking into consideration what the anime set out to do, they turned out rather okay.\\n\\n\r\nSOUND\\n\\n\r\nOne of Mermaid’s top strengths is the effects and music that it uses.\\n\\n\r\nStarting with the effects, two in particular stand out. The first is the breasts. The anime likes to have the breasts moving, and, to let the audience know that said breasts are jostling, the anime adds a breast-jiggling effect. No matter if Mirei is doing sit-ups, Torino is running to Meifon, or Charlotte is simply shifting her body sideways, the breasts are not just seen but also heard.\\n\\n\r\nThe second effect is heard most commonly when Mamori goes into her Extar form: a metallic moan. Including this effect is not necessary, but doing so made the transformation that much cooler.\\n\\n\r\nMoving away from the effects and towards the music, the opening track for Mermaid is rather nice. The vocalist is on point, the hard guitar is rockin’, and the background choir is in harmony. The OP, while not the best part of Mermaid, is still pretty strong.\\n\\n\r\nThe ending track contrasts completely with the OP, and that is only part of what makes it so awesome. The lyrics move at lightning speed. The onomatopoeia enhances the song. And the repetition makes it easy and fun to follow. Combined with the various vocalists and the catchy beat, it is clear just how “super-ultra-hyper-miracle-fantastic-romantic” this ED is.\\n\\n\r\nThe rest of the original soundtrack offers a nice array of tunes. Trumpets and violins for the silly times. Guitars and fiddles for the tense ones. And chimes and flutes for the sexual yet gentle moments. The other effects and music are stronger than the OST, even making up for some of the OST’s weaknesses, but the OST does what it has to.\\n\\n\r\nAnd because why not, the voice acting performances within Mermaid are generally above average. Yuka Iguchi as Mirei uses a husky and attractive voice for the mature girl. Mikako Izawa as Mamori uses an adorable voice for the small and shy girl; a nice performance for one of her first major roles. And Yuna Yoshino as Akira uses low- and high-pitched voices for her male disguise and female self respectively, demonstrating her vocal range.\\n\\n\r\nAlso, a very special shout out is more than deserved for Yurika Kubo who gives a fantastic performance as Meifon. The voice she provides can only be described as perfect for the carefree cowboy. Her line in episode six – “Hip raising training!” – in particular is spectacular.\\n\\n\r\nENJOYMENT\\n\\n\r\nYuri is my jam.\\n\\n\r\nErgo, I had a lot of fun with this one. The repetition did not phase me because that meant I got to see more naughty moments between Momoka and Mirei as well as the other pairings throughout the show. The bountiful bare breasts were likewise welcomed whenever they appeared on screen (which was practically every other minute).\\n\\n\r\nThis anime is pretty much designed for someone like me: a fan of yuri and bosoms. Disregarding these factors, I was honestly impressed with the show’s ability at attempting to be meaningful. It did not do anything groundbreaking, but I appreciated the anime spending time on the characters, the world, and the action.\\n\\n\r\nCharlotte was easily the most attractive to me, but the character that I found to be the most fun was Meifon. She was not around a whole lot, but, when she was, she brought the laughs. Trying to whistle unsuccessfully, getting scared by Mirei, and screaming while raising her butt in the air as Lady Lady used their massive gun were just a few of her hilarious antics.\\n\\n\r\nMamori gets a nod, too, for being so darn cute. But she (indirectly) also has my two gripes with the anime. Firstly, I was disappointed that the anime dropped the “virgin” joke with her name. I found it to be a simple yet silly running gag, so when it disappeared I was bummed.\\n\\n\r\nSecondly, I was not a fan of how she developed feelings for Akira and how she got forcefully used by Momoka. The first one had nothing occur between them. The second one was not her fault. And Mirei never lost her status as the girl with the highest compatibility with Mamori. Regardless, both instances came off as betrayals, betrayals that made me sad to see.\\n\\n\r\nValkyrie Drive: Mermaid has enough girls, boobs, and yuri to last a lifetime. But, surprisingly, it has some substance. The story, while finishing poorly, is interesting. The characters are competent. And the visuals and music do exactly what they have to. Mermaids may not be real, but, thankfully, this one is.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, repetition of the sexual content and a contrived ending do too much harm for the narrative to overcome\\n\\n\r\nAnimation: Good, the art and animation remains high where it counts the most but not much elsewhere, with nice character designs\\n\\n\r\nCharacters: Fine, while the characters lack a consistent theme, their mixture of both positive and negative qualities make them at least competent\\n\\n\r\nSound: Great, nice effects, good OP, great ED, nice OST, above average VA performances\\n\\n\r\nEnjoyment: Good, lots of yuri, branching out, and many laughs made for an almost entirely fun time\\n\\n\r\nFinal Score: 6/10",
            "date": "2016-07-24T12:12:00+00:00",
            "helpful_count": 16,
            "mal_id": 224861,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=224861"
        },
        {
            "content": "This anime is something that woke me up!!!\r\nThis is an anime I really like, not because its \"Yuri\" but because the whole series is about protecting one of the mcs, and not only that, then the series is nice, because of the ecchi, romance, action. The action is really, really, really, something that can facinate you, and the ecchi, is kind of fun, but its hard to explain, the romance is something that is really strong, between the main charaters.\r\nThis is an anime that really is fun, but in a weird way.\r\nYou will like this anime if you like Action, romance, ecchi and weird yuri,but when i wathced it, then my whole mind set was being changed, cuz this anime is really great, but not the best, but really great.\\n\\n\r\nI hope you found this useful.\\n\\n\r\nCya!!!",
            "date": "2017-12-11T04:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 264964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6546517.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DannieOne",
                "username": "DannieOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=264964"
        },
        {
            "content": "Ecchi has never had a big presence in the widely niche genre that is Yuri, or Shoujo Ai as it’s more accurately called. Yuri has always been a genre that I’ve always leaned toward the “erotic” side than the actual “romance” one, only because most of the anime tend to be too sugarcoated with soap opera quality stories. That doesn’t mean that I think there can’t be any ones that are good, I just think yuri fans deserve better than Valkyrie Drive Mermaid if they want their “dumb ecchi anime.”\r\nIf I had to describe the quality of Valkyrie Drive Mermaid in a very short statementit would be, “Not even trying.” What does it not bother to try? To be an entertaining ecchi anime. The boobs, butts, curves, kissing, and tripping all amount to pure nothingness. None pack any sort of charm or sensibility that generally make ecchi anime an exciting escapism. Whether it be from really poor comedic timing or the characters just being incredibly stale and formulaic. Upon further examination, the latter seems to be the biggest culprit than the former.\\n\\n\r\nIt’s not even the fact that none of the characters have any sort of profound characterization is what makes them stale. It’s the fact that their personalities, created by their dialogue and actions, are completely devoid of any humanity to them. A few of them even top my list of the worst characters of 2015. These characters being Mamori Tokonome and Mirei Shikishima. Mamori being the biggest crux of them all, she is by far one of the most annoying characters I’ve ever had the pleasure of seeing and listening. It isn’t just the bad, shrill voice performance by Mikako Izawa that makes her insufferable, but also how completely one-note her character is. All of the characters do suffer of being one-note but she takes the cake from her just being a character Mirei just kisses in order to gain her power and to be mocked because her name is the same as “virgin.” When something isn’t that clever the first time does not mean it will be funnier five more times.\\n\\n\r\nMirei Shikishima does do more than our damsiel Mamori, however her development is predictable right when she is introduced as a silent character. You could replace her with a cardboard cutout of her and it wouldn’t make much of a difference; that is how wooden her archetype is. The other characters besides our two main ones fall into similar territory. Our only male character in the anime, without spoiling anything (but you can probably guess anyway.), has one twist that comes off as so laughably random. Other than that noticeable moment, nothing can be distinguishable about that character before or afterwards. In fact the only character that was only semi-intriguing was Meifon Sakura because (1) she is voiced by Yurika Kubo so I could imagine Kayochin from Love Live doing the things Meifon is doing, and (2) she actually has some charisma that feels genuine and moves Valkyrie Drive Mermaid forward less tediously.\\n\\n\r\nSetting aside the other characters that are too forgettable to even bother reminiscing, the art is somewhat interesting to look at. The animation, on the one hand, feels as though Studio Arms was going on a lower budget than what they usually work with. As much as there are gorgeous art designs of the girls that are nice to look at, I don’t think there was enough material to go around to make these designs blossom. The first episode alone had way more dumb ecchi service than all of the episodes combined. Instead we are forced to sit through the most contrived story that one can get from an ecchi anime; hell Ikkitosen at least had an interesting lore to it that made it intriguing, Valkyrie Drive Mermaid has little to know meat to its story that garners any praise.\\n\\n\r\nIt is true that I don’t watch a ton of yuri anime that come out once or twice a year. I have not seen the great classics like Oniisama e…, Maria-sama ga Miteru, or even Yuru Yuri, as of writing this, to fully appreciate the genre. Valkyrie Drive Mermaid seems like one that openly insults the genre. It comes across as, “Well let’s just put a Shoujo-Ai element to this so that we can attract this niche audience to make money off of.” No, not even putting an ecchi spin on it is going to somehow make it somewhat different or unique when there is nothing to it. It is lazy implementation as one can get when watching this rubbish. As much as that one episode with the colossal naked girl at least gave me a single ray of sunshine in the mix, that was still not enough after it was over.\\n\\n\r\nWhen you can’t entice me, the self-proclaimed ecchi connoisseur, with boobs and butts, you know you’ve done goofed. One way of describing Valkyrie Drive Mermaid into one word is “soulless.” Soulless in every sense of the word. Boobs and butts that have no soul in them might as well not be boobs and butts at all.\\n\\n\r\nGrade: D-",
            "date": "2016-01-20T19:55:00+00:00",
            "helpful_count": 10,
            "mal_id": 209026,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=209026"
        },
        {
            "content": "For my anime reviews I am going to review the anime on the order of which you would experience while watching an episode of the anime that is being reviewed.\r\n1.Art - The art for this anime was not very impressive.  Wow that's a really negative thing to start of with, sorry.  I'm just say that the art was super average as well as the character models.  Now, that being said, there were some moments where the animation became strangely good.... like actually outstanding.  I couldn't help myself when I saw some amazing CGI in this show.  It was kinda weird.Anyway I give art a 7.  \\n\\n\r\n2.Sound - At first I didn't find this soundtrack attractive at all but after a while I started to like it.  By like it I mean I only enjoyed the opening and ending songs.  Those were awesome and might I add a perfect display of the characters boo..... designs.  The other songs in the soundtrack kinda suck.  They pretty much felt like background music to the show.  But I can't ignore the opening and ending  I give sound an 8.\\n\\n\r\n3.Character - This is where this anime really stood out and hung over to me.  The plots on each of the characters were enormous, with a few exceptions.  It was nice to see the relationships between the characters' plots, they were all mushing together and rubbing against each other.  On an honest note, all of the characters were interesting.  Surprisingly they all had pretty explained backstory and of coarse I'm not saying that there was a lot of backstory, I'm just saying that for a harem/yuri anime there was a surprising amount of it...... I enjoyed it.  10/10 for dose plots doe..... !\\n\\n\r\n4.Story - Well here's the thing.... I'm gonna rate the story keeping in mind of the other Valkyrie Drive islands and stuff so the story didn't feel unfinished to me.  I knew there would be more story adding on to Valkyrie Drive Mermaid so I had nothing to complain about but if you watch this anime while secluding it as it's own story, WHICH IT IS NOT, you will feel like it lacked.  By the way how could you hate a show the has awesome boo..... character designs and a pretty interesting story.  I know, you can't.  I can't give it a perfect score because of the story that can be added to this overall Valkyrie Drive thingy mcbob but I loved it enough to give it a 9.\\n\\n\r\n5.Enjoyment - This show was very enjoyable.  Of coarse it has a lot of hilarious fan service in it but if you like story it does have some of that to.  Honestly it was a very fun and relaxed show to watch.  I totally recommend it to you guys.  I enjoyed it at 10/10.\\n\\n\r\nThis anime is an overall 8.\\n\\n\r\n*I will also recommend that this anime is only watched by a matured audience.\\n\\n\r\nCaution:\\n\r\n!Keep in mind this anime has nudity.",
            "date": "2015-12-31T10:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 207395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642024.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Volticar",
                "username": "Volticar"
            },
            "url": "https://myanimelist.net/reviews.php?id=207395"
        },
        {
            "content": "I did my best to do not spoil anything but is pretty much impossible not to but nothing major but you are warned\r\nThe first 8 episodes are more of an ecchi anime but in the last episodes it will be completly different; am I triggered by people that don't understand the story because they are too stupid? Yes, of course. What to expect? A pervy anime at the start and good fights at the end pretty much... Why do i think it is so good? Because the story is original [correct me if I'm wrong], but i wished more episodes like the last ones idon't think it is going that far to be called Hentai but is not something SFW or light ecchi like ngnl. It will have a 10 if it had more fights maybe since the start. And is not that hard to understand the story (I can't understand Steins;Gate one so im stupid and i still managed to understand it).\\n\\n\\n\\n\r\nSory for the bad english i did the best that i could to make it understandable. I'm italian so don't expect much from me.",
            "date": "2017-03-13T11:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 242483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5983934.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/davidescion",
                "username": "davidescion"
            },
            "url": "https://myanimelist.net/reviews.php?id=242483"
        },
        {
            "content": "I think it was the point where I was watching a four-storey naked woman scream that I stopped hoping this show would ever make any sense.\r\nLook. I knew I was getting into something pretty questionable. This is the show that said \"You think Eromanga-Sensei is trashy? Hold my beer.\" This is a show that credits both a \"Special Breast Effects\" person and \"Giant Breasts Producer\"--yes folks, there were two people whose entire full-time job was animating giant pendulous breasts. In some cases, literally giant (aforementioned).\r\nBut there's no point interrogating the logic of porn. Which I think this is--it's the worst kind of exploitative view of(female) sexuality. A view that doesn't even try to make sense. The entire premise is that certain women, when sufficiently aroused or in a trance-like state, will transform into weapons. Okay... well, anybody who's ever had a frank conversation with a woman would realize the flaw with this, namely sexual response just doesn't work that way, when you need a weapon you need it now, not after several minutes of heavy petting, and for many--perhaps most, I would venture to guess--the immediate life threat would make it pretty hard to get well and truly turned on anyway. I say there's no point interrogating the logic of porn, but is it too much to ask for basic plausibility? Although I should have known; even the silhouette of the main character pair shows a wanton disregard for the realities of biology, with Mamori's rib cage clearly in a different time zone from her hips. And for a show that's supposed to be all about a bunch of women having sex with each other, it... sure seems to have no real idea of how that actually works.\\n\\n\r\nI've (elsewhere) praised Monster Musume for being refreshingly straightforward about what it is. Most ecchi harems are coy and unconsummatable; this one opens with a snake handjob. Most harems spend at least some effort coming up with an excuse for the women to pursue the main character; MonMusu, someone just sort of tells them to, so they do. Most harems wouldn't have basically the entire cast just give up and call the guy a variation on \"MC-kun\". But Monster Musume knows exactly what it is.\\n\\n\r\nNot so Valkyrie Drive. The show keeps reaching for a narrative weight, a seriousness and importance, that it has no way to earn, neither through its compelling plot (which it doesn't have) nor its lovable characters (also missing, instead we get one-note cliches, from Miss Protect Virginity to the various Obviously Psychotic Sexpots who show up, always with the non-consensual S&M routine). But because it has pretensions or aspirations to legitimacy, it tries to deal with ideas well outside its weight class. The threat of rape--weaponized rape, rape to turn its victims into weapons--looms heavy over the show, but won't be seriously examined. It can't be examined, because it's a cheap source of drama and menace, but also (so far as I can tell) supposed to be *hot*; and never mind that the already flimsy premise of plot-convenient arousal falls apart when women can be raped into ecstatic transformation--unless the show is seriously trying to sell a view that's seriously despicable.\\n\\n\r\nThe show can't seem to decide if it wants to be Fantasy Island or Lord of the Flies, and when the serious high-drama plot starts happening you'll have seen it coming from literally episodes away. The only real question is how did anyone allow the situation to get to the state it's in, where all the dominoes can come crashing down so readily.\\n\\n\r\nThere's a way to read this show that as actually a statement about unbridled female sexual desire being such a powerful force that society will do anything to subjugate it, keep it under wraps; that women--especially women who love women--are oppressed and contained because of their *power*. There's a way to read this show as making direct commentary on the very objectification--literally transforming into objects--which it engages in and depicts. There's a way of reading this show that shows that the real monsters are the ones who try to keep these forces repressed, and that the real tragedy is the way women's solidarity turns into a power-struggle catfight as their society immediately reproduces patriarchal norms of dominance from the outside world. Or, rather, there *should* be. But the show's just not up to it. And I wouldn't mind that so much if it would just be honest about it and stop trying to claim some greater significance.\\n\\n\r\nThere's a way to read this show as being about militarism, psychological trauma, about bonds of love and the awakening of same-sex desire... but instead violence is just a thing people do, some because they're broken and others because they're stupid and sadistic; and desire is just a thing that happens when you touch your nipples together or lick the right parts, no matter what the circumstances. Guess it's lucky all the women with the virus happened to be into other women too, huh.\\n\\n\r\nAh well. I guess I should've known. Turns out it's just porn after all. But if that's what I'd wanted, I could've found something that didn't drag for three hours.\\n\\n\r\nNow if you'll excuse me, I'm going to go watch one episode each of three different shows to get this thing off the top of my recently-watched list.",
            "date": "2017-12-20T21:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 265787,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6284433.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/aesaloniichan",
                "username": "aesaloniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=265787"
        },
        {
            "content": "\"Soul Eater with Tits- Some random guy in the comments of the 1st episode\"\r\nWhat a weird but awesome fucking show. I came for the Yuri but stayed for the tits. \r\nThe Quote \" Soul Eater with tits isn't half wrong either. This show gives off a big feel of Soul Eater and Kill La Kill. With a  school structure kind of similar too Kill La Kill and people turning into weapons and wielders like Soul Eater. This just has lots of tits.\r\n~~Spoilers~~\r\nThe first episode or two are so fucking confusing, Nothing is explained and the viewer has no idea what's happening besides Boobs flyingeverywhere and girl on girl action. But you can't help but just watch it.\\n\\n\r\nI really don't have many things wrong with this. Maybe that the MC ( Tokonome) Isn't all that likable with her overly passive/Innocent personality. She isn't bad but isn't that interesting either. \\n\\n\r\nSomething else that kind of bugged me about the show in general is that some of the character models just have this weird look to them. With the only normal looking characters in the show at first were. Meifon Sakura,Rayne Hasumi and Kasumi Shigure. Thankfully later on it seems even the characters that have a weird design kind of look more normal.  The MC ( Tokonome) has a kind of weird design too. I narrowed what i think is wrong with her design down to her having Pigtails that just don't look good on her. It's seen in later episodes that she has her hair down and looks actually pretty normal. I honestly think she should have kept her hair down or in a pony tail for the rest of the show. \\n\\n\r\nThere is also the problem that the 1st episode isn't censored yet every other episode is censored more and more. .\\n\\n\r\nThe characters them self are pretty good. Really Meifon Sakura , Rayne Hasumi, Kasumi Shigure and Mirei Shikishima are probably the most likable characters in the show. Especially Meifon Sakura, She just has this very charming tomboyish personality and character model too boot. \\n\\n\r\nWhile this is a Echi show with Tit's and physically impossible boobs. I don't really think it's all that bad really. It's seems tamed at times i guess when you compare to other shows. Still don't think you should be showing this to your Mom or Dad ( They're probably already disappointed in you enough) \\n\\n\r\nThe ending like a lot of shows is lack luster. With how easily the MC ( Mirei Shikishima) Is defeated over and over again and how many times she would have died if it wasn't for ex machina. She is meant to be a killing machine yet is always easily disarmed and never really seems all that badass at times. She is a badass but it's annoying how she can't even keep herself armed. There is also tons of illogical things like why the Government would send agents out to retrieve such powerful things when there is always a chance that those agents will use such power to rebel. \\n\\n\r\nI do very much like the final villain and how it didn't end on a sour note with the MC and her.\\n\\n\r\nI disliked is what they did with the MC's wish of wanting to see her parents. This was something i honestly was wanting to see. I imagine that sense she was kidnapped that her parents are assuming she is dead or something else. It's also shown that the MC was bullied a lot at school. So i think it would have been really nice for the Two MC's to go back see the parents that have probably given up or about to give up hope that their daughter will come back. Maybe have the MC's go and visit the school she went too ( Was also at school when she was abducted) We could see every students reaction to seeing the chick that has been gone for at least 6 months or so. We could also see their reactions to seeing the MC's girlfriend.  I just feel that they messed up an awesome chance for something kind of cool and nice.\\n\\n\r\nlastly, I dislike how the everything is by the government. I kind of wish the government and the world was oblivious to the existence of these people. I think it would have been better if it some type of mystical organisms that were nothing more but Drones sending people with powers to these islands. I always hate it when the show has these big evil Companies/Organizations and/or Governments that are evil for the sake of being evil. They are what i think is one of the worst cliches in all of media. \\n\\n\r\nGreat show with some obvious issues but good and fun none the less.",
            "date": "2017-12-03T22:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 264483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264483"
        },
        {
            "content": "The premise of this show is absolutely absurd and is an excuse for the anime to be a softcore porn. That being said, if you accept the fact that you are in fact just watching porn, it is actually executed pretty well. The plot arcs in the show are rather generic, but are executed well enough to keep you interested. The characters interactions with each other are often incredibly sexual, but in many cases they have deep or thoughtful conversations about the tasks and issues at hand without it sounding like an excuse to get to the next girl on girl scene. The girl ongirl intimate actions also drops off towards the latter half of the series, but the girl on girl fighting action picks up for some pretty memorable and intense fight sequences. Overall, not a bad anime if you're ok with watching porn.",
            "date": "2017-10-24T10:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 261593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6549543.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DanevsAnime",
                "username": "DanevsAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=261593"
        },
        {
            "content": "Valkyrie Drive is the fan service show I always wanted. An all girl cast who are all lesbian, fighting each other and ripping each other clothes and having sex. This is too good to be true. That being said is it smart, HELL NO! Is it dumb fun at least, HELL YES………...Okay more like sort of, except the last episode which was AWESOME. Let get to the review.\r\nPlot: The basic plot is the fact they exist a diseased call arm, with a liberator and extar, where the liberator can turn their partner extar into a weapon by basically making them orgasm and only girls getthe disease. When discovered with the diseases the girls are sent to an isolated island, in hope that they can adjust back to society.\\n\\n\r\nSo, as you can see this is going to be a heavy yuri fanservice with no guys, except this girl calling himself a guy for some reason. Trust me that not a spoiler, is super obvious. The anime can be divided into three parts. The first four episode just focuses on the two main character fighting the school. At first, is entertaining because how over the top the fan service is. That being said it quickly becomes less and less interesting. In something like Keijo where it has over the top ridiculous fan service, the show keeps managing to make it more and more ridiculous, keeping the show entertaining. In Valkyrie Drive, however, it plays all its card in the first two episode, and the gimmick of lesbians turning into weapon wear off. It never managed to keep itself from feeling fresh and new, and taking it seriously does not do the anime any favor. Luckily after the first four episode, the anime decides to have fun with some fluff episode. While nothing amazing, it at least is entertaining. That being said again, the fanservice just feel tame, which makes the comedy even tamer. There never a clear direction where the show is going, and just feel like a mess. Is starting to feel like just an excuse to have an all lesbian island. Which in that case I rather just have it be a hentai. Luckily the 8 episode and forward does have a plot and does have more weight to the story. The main characters get more flesh out, and we get an over the top villain, who is frankly amazing. It starts to have better action, and an actual direction and plot. That being said is it enough to save what was a rather forgettable fan service show despite having an all lesbian cast? The answer lies in the last episode, which loudly screams yes. The last episode managed to be the over the top fun I was looking for with all their animation effort clearly put in that one episode. It had great design, nice animation, a great villain and just a good episode.  \\n\r\nThe plot is not the best. The plot could have used the disease as a form of discrimination like Cross Ange, or be over the dumb fun like Keijo. The anime, however, is not clever, and it gets pretty tame quickly. That being is still a show about an all lesbian island, with some really good and even awesome scene. It does deliver the fan service, and the last four episode does get interesting enough to have the audience invested. That being said the majority felt directionless.\\n\r\nCharacters: Most fan service show have a mediocre plot, but the characters are usually the saving grace. The two main lead consist of Mirei and Mamori. Mirei is an awesome character. She starts out not speaking almost the entire first episode, and just come off as a total bad ass. She gets jealous easy when it comes to Mirei, which makes for some fun interaction. Her backstory is decent and overall does what she supposed to do. Mamori at first can be annoying. She is basically the oblivious, optimistic airhead. Is fun to see her interaction with other people getting an orgasm in front of her, but it gets tiring fast. Luckily she does learn to accept it, to help other, but that where my problems lied. I wish her relationship with Mirei felt more romantic. I would have liked it if they went with the cliche, am I lesbian, and do I have a feeling for her. At first is clear that she has a problem with being touched, not only because she being sexually harassed, but because they are both girls. I wish there was a better development of her character. There so many ways you can approach with lesbian, and it never takes advantage of it aside for fan service.\\n\r\nAs for the side character, they are fine. They managed to be fun, and don’t really need to be that developed. Lady Lady is also a cool character that managed to have a presence to her that I enjoy. Charlotte was a horrible villain, to be honest, and was unmemorable, but the real villain was great. Not going to spoil her, but she is basically Lady Ragyo from Kill la Kill if she had a smaller body, and more “touching”. She was just over the top fun evil. \\n\r\nArt: Passable. I mean there lots of great fan service that is just hentai, to be honest. I mean the only difference is that hentai scene is longer, but have censored vagina, while this anime never shows it.  \\n\r\nThe fighting scenes are decent, but sometimes are way too short. They never really felt any impact or danger until episode 8. Episode 12 as I mention was amazing, as the animation was on point, with the design, choreography, everything. So prop to the last episode.\\n\r\nMusic: Is actually really good. The intro and ending are great to listen to. The intro has an awesome electric guitar, while the ending song is super catchy. My only complaint is that they could have to use the intro song more in the fights. They only used the song overdrive in a fight once. The score in the anime is decent overall.\\n\r\nOverall: There better ecchi action anime out there. Is it terrible, not really, but I can see people not liking it. Is not a must for yuri fans, and not a must for ecchi fans, but is a must if you are both because there are not many like this. That being said this was just dumb fun, that is really only memorable because of the last episode, and having an all lesbian cast.\\n",
            "date": "2017-08-19T20:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 255853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5944153.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jgames111",
                "username": "jgames111"
            },
            "url": "https://myanimelist.net/reviews.php?id=255853"
        },
        {
            "content": "Here is my review on the anime Valkyrie Drive: Mermaid\r\nThis anime is a rather unique and exciting one, mixing multiple genre elements into something new. New characters are introduced in just about every episode with clear introductions in various types, ranging from slow and explaining to quick and brief. The artwork of the anime looks great with pale and vibrant colors, plenty of detail, and lots of deep lighting effects. The audio is also great, being deep and clear with absolutely to disturbance between voice and sound effect The anime comes with lots of epic, high-paced, combat which shows the weapons, abilities, and skills ofall characters engaged in it which is always loads of fun to watch. As for being ecchi (and a yuri). This anime clearly doesn’t shy away from anything and that actually makes it hentai-like showing lots of sexual activity between exter and liberator, or more freely between any other character. The intro and outro of the anime are amazing, having the intro being far better than the outro. As the outro honestly feels a bit misleading compared to whats shown in the anime itself. But the songs used in them are fun to listen to and are actually kinda addicting to listen to.\\n\\n\r\nOverall, this anime is loads of fun to watch. It has a mix of multiple genres, amazing artwork and animation, and bold sound. It’s loaded with action and adventure, the yuri in the series seemed confusing at first glance, but the way everything has been cleverly put together just made it all make sense. This anime is recommended for those who like anime with action, adventure, and fantasy of sorts. It can be for people who like shoujo and/or yuri.",
            "date": "2016-03-21T11:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 213545,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208294.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nazo-The-Weeb",
                "username": "Nazo-The-Weeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=213545"
        },
        {
            "content": "It’s a masterpiece!\r\nI do mean that, in a sense. Of COURSE this anime is lackluster in the grand scheme of things but that isn’t what’s important here. What matters is that I went into this series expecting to drop it after the first episode(I try to give everything I watch 3 episodes unless it’s just horrible, I was expecting Valkyrie Drive to be horrible) but what I got was a strangely drinkable sexy-action anime with plenty of light hearted moments and humor to boot. I’m not really even that interested in these kinds of action series either but Valkyrie Drive is uniquely charming.\r\nThe 5 outof 10 score may as well be a perfect 10 considering what we are talking about and my predisposition I had for this anime. If you were curious about this one you should definitely give it a go, you might be surprised!",
            "date": "2016-01-02T01:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 207518,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4332091.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sawt0othGrin",
                "username": "Sawt0othGrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=207518"
        },
        {
            "content": "Here is my honest opinion.\r\nThe reason I'm watching this is for the soft-core borderline hentai Yuri where girls orgasm to the point of transforming into weapon kinda stuff,\r\nthroughout all the episode, all I can think about is ass and tits. Then after episode 8 things started to get kind a a bit interesting, especially about the story plot.\r\nHere is where the story told you a little about the secret of the island and the organization behind this, and also Shikishima Mirei's past history.\r\nAfter that, the battle went a bit intense and the story keeps me a bit interested about what is going to be unfolded.\r\nTheending was okay, I guess. It reminds me like that last scene from Madoka Magica of some sort, where everyone was saved and the MC became godlike (not to the point of becoming god themselves however).\\n\\n\r\nAlmost forgot, I like the opening song though, for a story this mediocre it's kinda catchy.",
            "date": "2017-04-28T15:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 246498,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3496045.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/virus_mal",
                "username": "virus_mal"
            },
            "url": "https://myanimelist.net/reviews.php?id=246498"
        },
        {
            "content": "Nobody can complain about the smut in this anime.  It's not a secret.  You know what you're getting when you watch it.  If you're okay with lewdity, fine.  If you're not, don't watch it.  It's very simple.  There are no surprises in that department and no need to include it in detail in this review.  So I won't.  \r\nIf you're okay with lewdity and tempted to watch this, I feel you should be forewarned.  The main character is a whimpering annoyance.  Her squeaky, cutesy, nervous, whiney voice WILL grate your last nerve.  Guaranteed.If you can handle her, and don't say you weren't warned, this anime is actually very watchable.  The story isn't great but the characters are reasonably interesting and there's enough going on to keep you interested.  It's not a classic, by any means.  It's just a bit of fun for a few hours, providing you can tolerate the main character.  \\n\\n\r\nI apologise for not going into too much depth about the story, but an anime this shallow doesn't require it.  Girls fight each other.  That's pretty much it.\\n",
            "date": "2017-04-14T08:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 245463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3521507.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GoGoTsukiko",
                "username": "GoGoTsukiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=245463"
        },
        {
            "content": "This is a 24 min, 12 episode show that has one of the best concepts of all time, what else do you want. Honestly, If you watch the first 5 minutes of episode 1 you can clearly realize what this show will be about so just enjoy this literal gift from God since there no many other shows out there like this one.  Kaneko, Hiraku is a god amongst man and people need to stop taking this so seriously, but I'm not saying people should not have standards but come on this show was created to show a ton of fanservice and not asa serious show. In the end, this is was an amazing yuri and ecchi show that I hope more people will enjoy in the future.",
            "date": "2019-04-07T17:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 305723,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7798082.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BecomingWeeb",
                "username": "BecomingWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=305723"
        },
        {
            "content": "Welcome to another of Robert's Too Late Reviews! I really gotta work on making sure they're actually late, instead of being half-way recent. Anyways, this time we're going to be talking about the dubbed version of Valkyrie Drive Mermaid. Be sure to check the synopsis, because I'm to be working directly off those details without repeating them. To make the short of it, this show is a good looking mess, with all kinds of convenient things thrown in and blended with some of the most unrealistic representation of the female form I've ever seen. Right now, the character Meifon would be taking bets on ifthis show made the wall of RTLR boobage, and the smart money is going to be on no. Let's kick this thing, and see what comes out. \\n\\n\r\nStory: 4\\n\r\nThe story can somewhat summed up in three words: echhi Soul Eater. To expound on this, we have girls who have a virus only females can get that causes them to either have the power to wield strong weapons, or become said weapons on being sexually stimulated. Basically the Liberator (wielder) makes the Extar (weapons girl) orgasm and then she turns into a machine gun, or a sword, and one even turns into a motorcycle. This is similar to Soul Eater (which I really enjoyed) only with the kink factor. I don't see how they ever get around to fighting anything, because before the battle they have to make out and get all hot and bothered before the weapon girl can transform. The show uses convenient 'out of time' moments to achieve this, but logistically it would just not work. There's a tacked on bit at the very end about this so-called 'Valkyrie effect' but we're never really told why it happens, what it does (besides a VERY basic 'it causes evolution' statement) or why one girl possesses it when the others don't. \\n\\n\r\nThe story moves from villain to villain, which in itself is not unusual, but the transitions are awkward. First it's the dominant group on the island that causes the issue, then they become a non-factor once a secret is discovered. In light of this new threat, the Liberator of the primary character develops sudden and convenient 'augmentations'. I will credit that they do slip in a flashback or two that kind of sets up the 'army' angle, but not at any level that explains what we see happen on screen. And once again we have a military soldier that refuses to kill an enemy out to kill her, but has not problem beating the ever loving shit out of strange girls she's just met. \\n\\n\r\nThe Liberator is your usual quiet, reserved girl, who is of course stacked like a brick house. This girl would make porn stars self conscious. The main girl, who is an Extar, is a year older, but very much your sweet, kind-hearted cliche. She seems like she would have a hard time passing for 14, let alone the 16 that is stated in the dubbed version. Of course she has to be brought to the height of sexual arousal and/or climax to transform into an awesome sword the Liberator girl uses to cut down everything in their path. Never once are we left to wonder why these girls are all attracted to other girls. I have no problem with homosexuality, but I do have a problem when it is a state of nature forced on all the characters for nothing more that titillation. If they explained that the virus causes same sex attraction, fine, but otherwise, why is every last girl at least bisexual or lesbian, except for the fact this is made for male fanservice? We even get a girl that dreams of a love that does not have the virus and is back in the 'real' world and that's a girl too. \\n\\n\r\nThe story seems to be made up as they went. First fight the original people who have formed a society. Then when that got boring, let's twist it up and introduce a secret that causes the former enemies to come to each other's aid. That got old so then they forced an outside source to come in and mop up the last of the story. It was a trudge to watch, and that's saying something when the art and action were pretty well done. Soul Eater was repetitious, and I actually like Fairy Tail, another show with endless recycling, but Valkyrie Overdrive Mermaid made me yawn and check my watch often. And that's with tits bouncing everywhere, and girls getting all hot and bothered with each other. We'll cover more of that later. \\n\\n\r\nThe story was a total yawn, even though it opened fairly competently for perhaps 2 episodes. After that it seemed like they were just throwing things against the wall and writing anything that even sort of stuck. Final complaint about the story, there's a character that preaches that the girls on the island are being watched for signs they can reintegrate into society at large. While this seems like nothing more than a convenient lie for that character to hold power, they throw in that the character was right, and there were watchers among them. What could have been a shocking moment turned groan inducing at best. \\n\\n\r\nAlso beware and this is a bit of a *SPOILER* but there is basically tentacle porn at one point in the end. If you're not looking to see things like that, steer clear. /SPOILER\\n\\n\r\nArt: 7\\n\r\nThe girls look good, and have unique looks. The art is nicely done, flows well, and for the characters that aren't over-designed look really good. The main girl and her Liberator are especially well done, the Liberator is stacked, but not ridiculously so (which is a HUGE problem in this anime) and the main character is cute as a button. Some of the other girls look really well, I was a fan of Meifon's character, but she was an A-cup chest wise and wasn't drawn with ungodly proportions. She seems so much more believable without breasts that likely generate their own gravity well. \\n\\n\r\nThat's the biggest knock on the art. For example I actually had to watch the first episode twice because I could not believe the super exaggerated breasts were actually part of the series. Until they started showing some of the other island inhabitants, I thought the girl on the beach with the beachball sized breasts was an anomaly. She isn't. Whoever directed art in this series doesn't seem too familiar with actual real breasts, or has some kind of HUGE fetish for large knockers. Seriously there is a character, and to an extent her partner, that I really think are three people standing huddled together with skin covering them. I swear Lady J's breasts actually outweighed the rest of her body. Her partner Lady Rain is just about as bad. \\n\\n\r\n*SPOILER* there is a character posing as the only male on the island who is actually female. She binds her breasts for her public appearances, but when she takes her binds off, her tits are probably in the running for largest in the entire series save for the Ladies. /SPOILER.\\n\\n\r\nOtherwise the fights are cool, the effects are awesome, and the colors pop nicely, if only if you can get past breasts bigger than their owners head.\\n\\n\r\nSound: 7\\n\r\nThe sound is nice, I particularly like the themes, opening and closing. they have a nice driving rock sound to them. The end song, after it gets past the cutesy opening seems to take a page from Metallica's One song. No comparison of course, but a nice heavy beat. It fits the show about girls battling quite nicely. The background music and sound effects are all within parameters and never stick out as odd. Sound is one of those things it can be kind of hard to mess up, outside of the themes and certain background tracks. The show also features two of my favorite VA's in the industry, Britteny Karbowski and Jamie Marchi. As an aside, I am only peripherally aware of some 'Vic' drama, and I have no interest in learning more about it. Many more important issues to me close to home, so I just like those girls because I admire their work. I could care less about the politics or whatever scandal is raging behind the scenes. If I want to take on that kind of thing, I'll watch the news. I come to anime to enjoy myself. \\n\\n\r\nBrittney does an excellent job with Meifon though Jami Marchi is kind of underutilized as Lady J. The rest of the voice work is well done. The extremely mature main Liberator, sounds appropriately grown up (even if she's supposed to be 15) and the main character is cute, and doesn't really move too close to annoying at any point. She sounds appropriately innocent and scared a lot of the time. The ding comes from the fact that there's one character who isn't who they say they are (earlier spoiler related) and the instant they open their mouths, it's more than obvious. \\n\\n\r\nI also recommend watching this alone or while wearing headphones. I mean the premise of the show is girls transforming when aroused or orgasming, so there's a LOT of moaning at times. Not something you might want to broadcast to everyone around you. \\n\\n\r\nCharacter: 5\\n\r\nThis is a weak link. The main Liberator is hinted in a couple of flashbacks as being a soldier, but that thread to me is weak, and seems shoehorned into to bring about the appearance of yet another villain later in the series. The Liberator is also the quiet type, to the point I thought that first she couldn't even talk. She never says much or contributes to the plot in any meaningful way via her speech. The main girl is innocent, but the act does get a little old. When we're 3 episodes from the end and she's transformed many times via sexual arousal, it seems odd that she's still shy about it. \\n\\n\r\nThe main Liberator's past is kind of skewed as well. At some point someone mentions that her type were not supposed to be given the training she had, yet she get its, along with one of the villains. Then we find out that Lady J and Lady Rain also have training. Yet they send the main girl and the main Liberator to the island at 16 and 15 respectively. Did the Ladies get sent later? Why was there a delay? There's a scene where the parents of the main girl learn that she has the virus, and the kid can't be more than 7 or 8 years old. Why wait a handful more years to ship her out to the island with the rest of the infected girls? Never explained.\\n\\n\r\nAnother character complaint is the lack of consistency in their Extars. For most girls, one is a user (Liberator) and one is the weapon (Extar). For some reason, the Governor has an artificial Extar, breaking the 'norm' of the island. The duo of Ladies also are able to to be both Liberator and Extar at the same time, and as far as I saw, was the only duo who were able to pull off that trick. Meifon, though I like her, doesn't have a human Extar, instead she's so obsessed with cash that she's able to use it to be her Extar, staying powered up as long as she has the funds. The rules on what/who can be an Extar is all over the place with no logical reasoning. In fact, one of the early villains is able to use several girls as Extars all at once without any mention if she had special training or why she can do something others don't seem capable of. \\n\\n\r\nThen we have the commander of the society's forces who starts as an enemy of our main pair but later becomes an ally yet cannot break free from her duty to do as she's told. They prop this up by holding her lover captive, but she's such a badass she could easily take out those that stand in her way and easily rescue of her love. Yet she doesn't do it, just follows orders that she knows are wrong. The characters are just a total mess. \\n\\n\r\nEnjoyment: 6\\n\r\nI got a fair amount of enjoyment, not from the nudity or anything like that but because Meifon cracked me up, and I kept rooting for the commander to overcome her circumstances. I also enjoy *good* ecchi, and while this is not that, it has it's own trashy appeal. The battles were also pretty cool at times, also I do have to complain about one thing: these girls often end up with melee weapons, and they all tend to use said melee weapons to shoot energy beams. If I see two people with swords, I want a sword fight, not them randomly trying to blast each other over and over with energy. The battles were still kind of fun irregardless. \\n\\n\r\nBest girl: Kasumi. The commander who's love is held hostage because she kicks nine kinds of ass without an Extar, and when she gets one, after suffering the initial setback all heroes face, she rocks the house. Love the hair cut too. \\n\\n\r\nThis show is trashy ecchi, and if you're looking for that, then this is the one for you. If you have watched Soul Eater and thought 'this needs more tits' then this is the show for you. If you're looking for something with a bit more substance over style, move on. So for this one, no entry on the RTLR of hotties. All thumbs horizontal at best.",
            "date": "2019-02-25T18:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 302465,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6918726.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/captjoe213",
                "username": "captjoe213"
            },
            "url": "https://myanimelist.net/reviews.php?id=302465"
        },
        {
            "content": "What will you find on this show?\r\nTITS. In Every colour, shape, and size, imaginable. \r\nAnd very bizarre relationships among women in general. This thing has'nt a single drop of history, it's like the  writter and the director would had crapped in your head until your brain melted out.\r\nHad not i seen this thing.... i probably would be happier. It's still better  than Mars of Destruction, but this is one of those thing which for the extreme danger that it represents for mankind, the world and the fabric of the reality itself....and should be hidden next to the ark of the covenant, the grailand those things from the histories of bygone\\n\\n\r\nSo, unless you really want to see this kind of  thing; please..... avoid this suffering",
            "date": "2016-05-27T12:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 219427,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4128459.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/josmaker2mk",
                "username": "josmaker2mk"
            },
            "url": "https://myanimelist.net/reviews.php?id=219427"
        }
    ],
    [
        {
            "content": "This hentai had a surprising ammount of plot. To be real though, this anime is far from being yuri porn. All extreme nudity and sensuality aside, what you end up with is an anime with an enjoyable myriad of characters, each with their own flaws, and a story that had me thoroughly enthralled the whole time. Despite the ending not having all the romantacism that I was eager for, it was enough to satisfy and leave me with a warm feeling. All in all, if you can get past the \"plot\" you can enjoy a truely good anime.\r\nAlso that opening is fire.",
            "date": "2016-12-29T23:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 236931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5935700.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hellsdomain",
                "username": "Hellsdomain"
            },
            "url": "https://myanimelist.net/reviews.php?id=236931"
        },
        {
            "content": "So I'm completely inexperienced with reviews, similar cause to my grammar, I will still try my best to review it as much as I can to what I have seen during this anime.\r\nAs a fan of yuri myself, I looked upon this anime from a friend who enjoys it very well too, yet my choice during the anime slowly faded away as I enjoyed the story, yes. But, the characters and the fan-service honestly ruined it all.\r\nI'm not calling any hate upon any characters, I will explain why I gave a 4 to the character list.\r\nTo start off, the story was well-written, girls becoming weaponsis quite fantastic and it fills in my liking for Yuri, although being way too much of fan-service forced me to give an 8, as it looks like what they want was not to focus on the story, but create girls that people would get aroused of seeing and searches for other things like hentai after watching the anime, which I dislike. The story was overall good apart from that, and it kept me on watch each single minutes I've been watching this anime.\\n\\n\\n\r\nThe art's turn, fantastic, not the best I've seen, but I still very liked it, which is why I'll give a 8 for this. The characters are drawn well, the effects are fantastic, damn, I have no words for some moments, too.\\n\\n\\n\r\nThe sound's turn, as for this one, it was amazing, well fitting, good OST, what can I say more? Oh yeah, amazing voice acting, thanks to the voice actors!\\n\\n\\n\r\nNow then, the characters. The part I disliked the most about the anime is that they look like they are just there to fill in fan-service and fetishes, arousing people watching the anime. Boobs jiggling all around, girls bending over infront of the screen.. now I get this was ecchi, but sometimes It was just so ridiculously obvious that it was just there for fans to enjoy seeing lewd parts that, come on. The only characters I liked were Kisami and Hibiki, that's about it.\\n\\n\\n\r\nMy mind is filled of \"What the hell is even happening\", however the enjoyment was good, even to a point I had to stop it because I couldn't stop laughing at the part where the Gouverneur gets exposed (Before the battle) as a female. (Poor her by the way.) Now, my enjoyment was mostly based on the art, and the character development, I had a bet with a friend, telling him I knew Kisami was a good character, and she turned out to be one, protecting Hibiki, how sweet. Otherwise, it was ruined by fan-service, again.\\n\\n\\n\r\nOverall, I'll give it a 6 out of 10. Not the best anime I've seen, now I know they might have got low budgets, but I'm not into tits who shakes 24/7 and hentai scenes filling the empty spots of the plot. Remember that this is my review. Good job on the story, arts and sounds though, thanks for reading!",
            "date": "2018-12-04T11:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 295260,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7088121.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Airenia",
                "username": "Airenia"
            },
            "url": "https://myanimelist.net/reviews.php?id=295260"
        },
        {
            "content": "If you are looking for funny yuri with lots of ecchi, I mean what is there not to love? I had a blast watching this, maybe cause I took it for what it was. I never expected a GREAT plot or the emotional aspect to the whole yuri aspect, and I really enjoyed it. \r\nAfter watching stuff like Strawberry panic, I dont know if I want to put them in the same category, as their purpose and style is totally different. \r\nTho, if you want action, cool battles, ecchi yuri girls on the edge of hentai I dont think you'll be bored with this one",
            "date": "2016-03-08T11:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 212501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3412813.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hellhelper",
                "username": "Hellhelper"
            },
            "url": "https://myanimelist.net/reviews.php?id=212501"
        },
        {
            "content": "Started for the yuri, stayed for the plot.\r\nStory: 7\r\nPremise is interesting enough.\r\nI started watching this for the guilty pleasure, but the immersion took me in, and at the least, it provides literary enjoyment as well. Some characters I have sympathized in the beginning turns out to be antagonists, and in the end I sympathized with antagonists I never thought I would.\r\nEnding has a madoka-feeling too.\r\nArt: 8\r\nIf you're looking for lots of yuri kisses, here you have more than enough.\r\nSound: 8\r\nThe only complaint I have is the awkward breast sounds, but the voice actresses and the ending theme are a blast to listen to.\r\nCharacter: 7\r\nThe ideaof an innocent maiden and a strong and determined partner isn't too unique, but it does the job for the setting.\\n\\n\r\nEnjoyment: 8\\n\\n\r\nLots of suspense following rising action and during climax.\\n\\n\r\nOverall: 8\\n\\n\r\nOf course, this anime isn't to everyone's tastes. If you want sort of like a softcore hentai that has a better story than the one-shot hardcores, then give this a go.\\n",
            "date": "2016-12-19T17:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 235863,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5483339.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LesbianCornet",
                "username": "LesbianCornet"
            },
            "url": "https://myanimelist.net/reviews.php?id=235863"
        },
        {
            "content": "Valkyrie Drive is not great.\r\nMirei Shikishima, the tall blonde Gyaru type is perfect, but everything else about this show is terrible.\r\nLook, I like Yuri. A lot. I just don't like Lolicon, rape, tentacles or BDSM, all of which this anime has in abundance.\r\nValkyrie Drive is basically a high-budget hentai series with no crotch nudity. The characters are stupid (Except for Mirei) the fights are okay at best, and the sex scenes are weird.\r\nIt's not good. I didn't finish it because it got too rape-y to be sexy anymore.\r\nBottom line: Mirei deserved so much better than this.",
            "date": "2018-10-29T14:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 292948,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7498669.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Synchrogayzer",
                "username": "Synchrogayzer"
            },
            "url": "https://myanimelist.net/reviews.php?id=292948"
        },
        {
            "content": "I came here looking for hot anime girls kissing, and while it DID deliver on what I wanted, it didn't do it particularly well. If you're looking for a well-choreographed action shoujai ai with a compelling story, you'll have to look elsewhere. This is softcore lesbian porn for jacking off to when when hentai haven is down or something. Even then good luck finding uncensored versions. Actually, I think my enjoyment may have been raised by the ethereal glowing nipples all over the place, it was certainly good for a few laughs.\r\nTo be fair, the character designs are pretty interesting, even considering they're 90% boob.\r\nThere'ssome stuff in there that's VERY obviously fetish fuel, more so than all the uh...lowkey sexual assault. But who knows? Maybe you're into that.\\n\\n\r\nThe animation gets worse as the show goes on, but Hatsune Miku's weird cousin shows up in episode 7 so there's that to look forward to I guess.\\n\\n\r\nIf nothing else, the opening theme is an absolute banger and quite possibly the best thing about the series.\\n\\n\r\n3.5/10, turn your brain off, have a few tissues ready just in case. Enjoy.\\n\\n\r\nUpdate: Finished the series, there's some nicely animated fight scenes in the finale, but nothing too noteworthy",
            "date": "2018-08-30T19:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 287801,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7318893.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/azuill",
                "username": "azuill"
            },
            "url": "https://myanimelist.net/reviews.php?id=287801"
        },
        {
            "content": "This series was ok, if very short. Certain plot points I feel were sacrificed due to the author's mood or the publisher's SCHEDULE. It easily could've lasted at least 3 seasons with the content it had. Midway the series seemed rushed, which might have been due to the publisher. The ending was absolutely top notch mostly. My only complaint is that the story was a bit TOO obvious and could've done with a few more surprises. I mean the only surprise I found in it I saw in the third or fourth episode. Might be my talent at noticing foreshadowing, but still. A few morewould be preferable. The end enemy gaining power from her pawns is a QUITE a bit overplayed. That's a tactic from the 1980's. I should know, since I was born in that decade. It was annoying then and I don't think it serves any real purpose than to fill time.\\n\\n\r\nIt had so much more potential, that it's sad when an anime is cut down in its prime.\\n\\n\r\nI really hope it was due to deadlines that you skimped on this anime.\\n\\n\r\nP.S. I know that this review is 3 years after the fact, but I hope you'll forgive me.",
            "date": "2018-04-27T09:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 279133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/esparc",
                "username": "esparc"
            },
            "url": "https://myanimelist.net/reviews.php?id=279133"
        },
        {
            "content": "So, I'll start off by saying that I am not a huge watcher of anime, meaning I do not know the meanings of a lot of Japanese expressions a lot of people use.\r\nI would, myself, class this \"anime\" as a light/softcore porno. After looking up the meanings, I can definitely say this show is a ecchi/yuri (hope I'm using those right).\r\n# - What is good about this anime? \r\nIn my honest opinion, the artwork and sound are decent. Apart from that though, the \"plot\" *cough* is pretty bare-bones. \r\n----\r\n# - Plot/Synopsis\r\n\"\"Girls with special abilities are sent off to a secret island called Mermaid\"\" - thatgeneral synopsis drew me into this \"anime\", because I thought it sounded pretty cool - oh, how I was surprised at what I actually got.\\n\\n\r\nEnormous-breasted, over-the-top, cliché anime girls perform sexual acts and one of them becomes a cool-looking weapon and the other one is able to wield the weapon.\\n\\n\r\nThe main character is basically a 14/15 year-old virgin, so I'd say this \"anime\" borders on lolicon - the protagonist is ripped from her college and shuttled off to Mermaid where immediately upon arrival she is forced into lesbian foreplay with your typical edgy, not-so-talkative, \"side-kick\", so that she transforms into a weapon and can then defend herself from her attackers.\\n\\n\r\n----\\n\\n\r\nThat basically sums up the \"anime\" right there. \\n\\n\r\nGirls on the island perform some genre of sexual activity and become weapons/wielders of weapons.\\n\\n\r\nThe girl in question has to be sexually stimulated for this to work, so of course you see a wide variety, if not all, sexual fetishes. In the first few episodes we see grinding, BDSM and a few others.\\n\\n\r\n---\\n\\n\r\nMy overall rating for this anime is 4/10 simply for the fact that I wanted to watch an anime and not porn. \\n\\n\r\n(No, I'm not the type of person who will rate this type of anime highly because it allows me to crank out a quickie - which I didn't).\\n\\n\r\nThis type of anime is a turn-on for some people, because #boobs, but for me it just turned me right off and I just dropped it like a brick.\\n\\n\r\nP.S: It's 4/10 and not 1 or 2 because the artwork and sound are ok and boost the score.\\n\\n\\n",
            "date": "2016-03-10T09:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 212616,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Eleiyas",
                "username": "Eleiyas"
            },
            "url": "https://myanimelist.net/reviews.php?id=212616"
        },
        {
            "content": "Um... no. Just no.\r\nThere are some interesting ideas story-wise: how the girls need to reach orgasm to be in a state of trance and turn themselves into weaponry, how there’s no absolute good and evil among the girls on the island and everyone’s just looking to escape, etc.\r\nBut it’s just downright laughable to see the girls practically have sex right in front of their enemies in the name of preparing for the battle. I mean, if you’ve ever found Sailor Moon and the like’s long-ass costume change/transformation absurd, this is going to blow your mind.\r\nIn this anime, whenever the girls get attacked, they somehow magicallylose their clothing and get butt-naked. Plus, there are plenty of other excuses the anime makes up for the girls to go nude. The gratuitous nudity here is so excessive that it’s just distasteful and unpleasant.\\n\\n\r\nThe lead girl’s whiny voice and personality were instantly annoying, and even the artwork wasn’t that eye-pleasing.\\n\\n\r\nThe story, as I mentioned above, had potential but is ultimately dumb af. (spoiler: Am I supposed to believe that the government just stood by doing nothing while their weapons of mass destruction were going away? Making all their research go useless? I call bullshit.)\\n\\n\r\nAnd lastly, this should be banned from being called yuri because the vast majority of the girls, if not all of them, are “doing it” to achieve a certain goal (i.e. transform themselves for a battle), not because they have any feelings for their partner.\\n\\n\r\nIf you ask me why I even finished watching this anime, I honestly have no idea. I must be masochistic or something.",
            "date": "2016-04-06T18:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 215721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4027329.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/soylinda21",
                "username": "soylinda21"
            },
            "url": "https://myanimelist.net/reviews.php?id=215721"
        },
        {
            "content": "This is 95% fan service and 5% story and character. That should tell you something! I like some fan service when it's used to help the story and characters or is just a little eye-candy here and there, but when it takes up nearly all of the time this isn't a show. Secondly, the main characters who are paired, one of them looks like they are 10 and the other so called partner in terms of combat is literally pressing herself against the 10 year old after nearly undressing each other. Umm, seriously? I expect a certain amount of fan service as it's become acommon element in anime, and I have nothing against same sex, I'm gay, but this isn't interesting at all. I want to get pulled in by the story and characters and so when something romantic or sexual happens it means something.",
            "date": "2018-01-27T18:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 269845,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JadeKarter17",
                "username": "JadeKarter17"
            },
            "url": "https://myanimelist.net/reviews.php?id=269845"
        }
    ]
]