[
    [
        {
            "content": "Kekkaishi is basically one epic siege story.  The very fact that its based around protecting one piece of land (conveniently the main protagonists' school) only at night time, is the show's main hook, and it fulfils its interesting potential throughout.\r\nYoshimori and Tokine, our plucky teens, are charged with the seemingly life-long mission to protect a mystical piece of land with their barrier technique.  The ability to create barriers of all shapes and sizes by pointing their fingers and shouting \"Ketsu!\" and destroying the contents of their CGI boxes with \"Metsu!\"  It&rsquo;s a very cool and unusual technique and the animation remains consistentlygood throughout the series, so it never gets old watching the two develop their skills, or to watch Tokine take liberties and use her kekkai to smack Yoshimori in the face.\\n\\n\r\nThe manga is written by a female so you can expect some good characterization for Tokine.  The two heroes are on an even level for most of the anime, and being that it&rsquo;s written by a female, the relationship and romance has a more deft touch to it.  Sexist observation?  Maybe, but I can tell you that I didn&rsquo;t really roll my eyes or get bored with any of the lovey dovey moments sprinkled throughout Kekkaishi.\\n\\n\r\nPopulated by interesting and amusing characters, an epically memorable Taku Iwasaki score, refreshing pacing, and creative action, Kekkaishi is the definition of how a shonen genre anime is meant to be made.  It does get a tad derivative towards the end, being unable to escape the tropes of the genre, but its still good fun.  Each episode also ends with a great Photoshop-like montage of characters, basically summing up the climax of the last 20 minutes.\\n\\n\r\nThe producers even had the grace to just end the adaptation at the end of an arc, rather than overtake the manga or descend into filler hell.  It&rsquo;s a bittersweet compromise but one we should accept and respect.  For a show sponsored by McDonalds, you'd think greed would compel them to milk everything out of this show, but they knew when to stop.  Whether it was due to Kekkaishi not being as sell-able as Naruto or One Piece for example, I don&rsquo;t know, but I don&rsquo;t care when what they leave us with is an anime as excellent as this.\\n\\n\r\nSo like I said, Kekkaishi is a kind of siege story, a staple of the action-thriller genre that live-action films occasionally excel at, but anime rarely ever touches.  Kekkaishi greets the genre head on with shonen enthusiasm and ends up an entertaining show worth watching.",
            "date": "2008-03-22T15:42:00+00:00",
            "helpful_count": 209,
            "mal_id": 3339,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29975.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Beatnik",
                "username": "Beatnik"
            },
            "url": "https://myanimelist.net/reviews.php?id=3339"
        },
        {
            "content": "Perfect execution of a unpopular shonen anime. Even though it has a mainstream plot and presentation, it has a soundness of all the elements in the show that so many one shot animes lack.\r\nI could not give the show a 10 for character, since no character stood out like the infamous L, or Light, or Luffy, or many of the other great characters. Even though I was captivated by all the characters, no one stood out. It may be due to the female writer's preference not to bias her character development to only one of the two main characters. Even though it is a maleoriented theme overall, she has built a great relationship between the two characters. Their attachment and growth dependence on one another really shows in the later part of the anime.\\n\\n\r\nThe story I could only give a 9 because it did not have any shocking twists, nor deep revelations. The show was intended for amazing action, intense adventure, and they even blew the budget on the animation! I meant that last part as a figure of speech.  The plot was always entertaining, so I was never for a moment bored, and I was always anxious waiting for the next episode. Excellent themes are hidden within all the episodes. Especially between the common male male female character trinity, just like in Naruto. Also the ominous older brother, and tiresome grandfather play out in some dynamic relationship with Yoshimori. Kekkaishi is as good as Bleach and Naruto at their best. I use those two, since they stories are the most parallel to each other. \\n\\n\r\nThe animation was incredibly done. For clearly being an unpopular manga and show, the production was high grade. Limited CG images composited into the shows main scenes. Princess Mononoke was one of the first to do this well, and has been proven to be an incredible advancement for the industry. Over the next 10 years we are going to see much better animation, once show budgets increase as the world turns to a complete global market.\\n\\n\r\nThe score is done with great meticulousness for the creation of appeal. The end character montage with a rock rift is such a great way to end each episode. It makes you crave for the next episode. Shows like this that repeatably use the same melodies to lead into scenes really enhance the appeal of the show, instead of forcing some repetitive melody in your head. Animation is nothing without sound. Shows that do not put money into their soundtrack... fail.\\n\\n\r\nThe dialogue was great, so my overall enjoyment was superb. The common banter in shonens is a great exemplification of how it is possible to escape from all your problems in a moment. One minute a character is stressed over being weaker than an enemy, the next they are cajoling with their nemesis.\\n\\n\r\nIf you want to watch a consistent anime that gives everything you want, just take it all and watch the show. It does not disappoint and delivers in action, with only marginal build up of suspense. The creators of this show analyzed all the popular anime, and formulated a perfect model for a show they wished to produced, then approached the closest show that matched their requirements. Pretty prehistoric method of manga selection, but does it ever make a great animation.  \\n\\n\r\nNow its time for me to go back to the pile and search for another show. There is still one more episode to be subbed, but I am already satisfied by the show that is Kekkaishi. \\n\\n\r\nOh and by the way, they use these cool barriers called Kekkai, which act as shields, and can perform a type of volume combustion, which they then consume as a form of garbage collection/religious burial for ayakashi (ghosts/demons), and they even play on the idea of encapsulating dimensions, and also about dimension construction. I said the show had no deep revelations, but it does use some damn cool archetypes.",
            "date": "2008-03-26T00:41:00+00:00",
            "helpful_count": 111,
            "mal_id": 3405,
            "reviewer": {
                "episodes_seen": 51,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8407.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/renegade",
                "username": "renegade"
            },
            "url": "https://myanimelist.net/reviews.php?id=3405"
        },
        {
            "content": "Watching _Kekkaishi_ is like enjoying a big box of chocolate; you know it's essentially just fat and sugar, but that doesn't stop you from eating it.\r\n_Kekkaishi_ offers nothing new, nothing spectacular, essentially nothing. It's not one of those animes that tries to be high brow and thought provoking. In the limitation of its scope, however, the series has done extremely well. The story progresses with fast enough pace that one doesn't feel the urge to fast forward, often with suspense--in the form of unresolved secrets or crisis--sustained throughout several episodes. The art is excellent as well: very clean and rarely with the exaggeration of eitherbeing too 'shoujo' or too 'shounen.' It's rather rare these days to see the female protagonist drawn without over-developed body parts, which in this case only makes her more charming and lovable.  \\n\\n\r\nThe story is simple and rather straight-forward. The basic premise of nearly all episodes lies on the encounter of the two main characters with the invading monster(s) of the week, with stories dedicated to character development revolving around this premise. I am glad to say, however, that the story has not fallen into one of the major caveats of this structure. The conflict resolution does not always depend on the main characters getting stronger (through training, for instance), but also on their character growth and interaction. \\n\\n\r\nMany hints are dropped within the series suggesting the series targets a rather young main audience: too many things are explicitly spelled out for you. The male protagonist's main drive, for instance, is hammered repeatedly to the audience from his own dialogue. A good thing that comes out of this is that the characters have well-defined personalities that explain why they do the things they do. Every character remains faithful to his/her main trait. This, unfortunately, also makes the characters rather simplistic and two-dimensional, with no room left for surprise. I find it difficult, however, to blame a series dedicated to younger audience for being reductionist in its portrayal of human psyche. \\n\\n\\n",
            "date": "2008-12-26T23:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 10675,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/divaliant",
                "username": "divaliant"
            },
            "url": "https://myanimelist.net/reviews.php?id=10675"
        },
        {
            "content": "So the basic plot line involves a boy, a girl, and a best friend (who comes a bit later into the story) and their nightly  adventures as the Kekkaishi (protectors of some ancient spiritual power source). Of course their adventures lead to a bigger plot line involving mysterious enemies and even more mysterious brothers and family histories but that's how shonen plots usually go.. . \r\nThe strength of this show is definitely the characters and their relationships. Granted the fighting and etc kept me raptly entertained as well (it didn't drag likes shonen series are prone to do...naruto), my personal taste require that thecharacters are genuinely likeable or loveable, considerate, caring, thoughtful, and funny . And the characters in Kekkaishi did just that. \\n\\n\\n\r\nYoshimori (the boy) is for all appearances your regular shonen hero being lazy, stubborn, friendly, combative, and powerful despite his obvious lack of finesse (which he works on through out the series and does show development)...he has a very obvious crush on Tokine (the girl. and in my opinion his total devotion to her is very cute) and acts like a true best friend to the initially distant Shishio (who actually opens up to be charmingly clumsy). \\n\\n\r\nThe spirit dog helpers are funny and charming. Yoshimori's and Tokine's family are also a source of entertainment being comically violent, quirky, and sincerely loving of each other. \\n\\n\r\nIf it's not already obvious, characterization is the biggest point of concern for me when enjoying an anime. If I don' t like the characters then I usually lose interest. \\n\\n\r\nStory-wise, this anime kept me interested enough and ultimately hanging for more. \\n\\n\r\nThe art pleased me being simple yet attractive, comic...although it was a little messy at times. \\n\\n\r\nThe sound was decent \\n\\n\r\nEnjoyment was very high. Didn't skip an episode or scenes out of boredom as I tend to do in  a lot of shonen series. \\n\\n\r\nMy only sore point with this series would be its very small fanbase *sigh* such a great series.",
            "date": "2008-03-04T03:50:00+00:00",
            "helpful_count": 29,
            "mal_id": 2862,
            "reviewer": {
                "episodes_seen": 34,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/asianbubbles123",
                "username": "asianbubbles123"
            },
            "url": "https://myanimelist.net/reviews.php?id=2862"
        },
        {
            "content": "Let me start off by saying that Kekkaishi is NOT your average mainstream anime, because let me tell you, it ISN'T. It starts off making you think it's all \"we've got one aspiring, goofy young teen who wants to be noticed, one smart-perfect round about girl, and one best friend who is half-human half-other\" but then it takes you onto a whole other plane.\r\nKekkaishi has your drama, your comic relief scenes, and your thought provoking scenarios all in one AND the best part is that it isn't long and overly drawn out like Naruto, Bleach, or InuYasha.\r\nPlot (9/10):\r\nAs mentioned earlier, it's got your basic goofymain character who has a crush on his neighbor and later on meets his best friend who happens to be half-Ayakashi (\"ghost\"/\"demon\"). HOWEVER, Kekaishi also successfully merges in some well back story plots that defies your average shounen story making it about 100x more interesting and it isn't drawn out to be annoying. The only reason I don't give it a full 10 was because I felt the ending could have used a little more \"padding\" i.e, giving it a slightly more thorough conclusion. It wasn't completely open-ended, but I do feel that there were maybe one or two knots that could have been tied before ending completely.\\n\\n\r\nArt (8/10):\\n\r\nConsidering that I'm writing this review in 2015 and this anime finished airing in 2008, I'm actually rather impressed with some of the special effects in the show. There were a few questionable shots, but overall I thought the art work was clean, well-done, and interesting. I only give it an 8 though because there were a few awkward shots/angles.\\n\\n\r\nSound (9/10): \\n\r\nAwesome voice acing (I'm talking about the original Japanese) the voices are all amazing and you really feel like you're watching something and not listening to someone reading off a script. There are also some very good, well-known voice actors such as Hiroyuki Yoshino and Kenjiro Tsuda. Also, including sound, the voice sound wasn't as ill-proportioned as some anime can be (i.e, the sound effects and music overpowers the voices making it difficult to hear).\\n\\n\r\nCharacters (10/10):\\n\r\nThe characters were all very \"3D\" meaning they really captured the audience's attention. In my opinion, I really got to \"know\" the characters more as people than just characters in a story. Even the villain Kaguro, because dang, did that guy have STYLE! He was bad to the core, but there was a certain amount of charm in the way he did things that kind of makes you like him and respect him, but still not \"like-liking\" him enough to hope he isn't killed off in the end. He made for a very good villain and normally one would hope to look for \"grey villains\" in anime that can decide to be seen as good or bad, but not this time. Kaguro was completely black in personality, and it was kind of \"refreshing\" in a way because often anime creates antagonists who, more usually than not, join the hero side which, although interesting, can kind of become predictably boring after seeing it occur so often.\\n\r\nThere is also a good amount of character development and interesting personalities and, like I said, you really \"fall in love\" with the characters.\\n\\n\r\nOverall and Enjoyment (10/10: \\n\r\nOverall, it was an awesome show with a relatively satisfying ending and I'm actually really depressed now that it's over. I suggest it for people who want mindless fun, but not to the point of brain dead fluff. I mean, I liked it so much that I managed to write a review for it, which I haven't even done for my most FAVORITE or favorite shows; so it just goes to show how great this series is, right? :P",
            "date": "2015-03-13T13:43:00+00:00",
            "helpful_count": 28,
            "mal_id": 182277,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/405267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ShadowJackal35",
                "username": "ShadowJackal35"
            },
            "url": "https://myanimelist.net/reviews.php?id=182277"
        },
        {
            "content": "What is it that sets Kekkaishi apart from other shounen anime?  Well, nothing really.  Kekkaishi had a fairly original premise of two young kekkai users battling ayakashi (youkai) in order to protect a powerful piece of land.  In order to protect the land, their rivaling families have lived next to each other for 400 years.  Growing up together from a young age, Yoshimori and Tokine knew that their families were \"frienemies\"  and that they should not maintain a close relationship.  So the story begins...\r\nUnfortunately, all the unique and interesting parts of the anime had little development, and the animefocused on the run-of-the-mill shounen fodder. It would have been interesting if they had addressed Yoshimori's unrequited love for Tokine and what makes Yoshimori's powers so unique, but sadly it was mostly ignored. Another disturbing characteristic was the seeming lack of emotion over death.  Without going into too much detail, usually people have a strong emotional reaction to death.  Well, in this case, the next episode was back to usual and the death was rather unemotionally brought up only when convenient.  \\n\\n\r\nMany parallels can been seen between Kekkaishi, Naruto, and Bleach.  Yoshimori is basically a pre-Shippuden, less obnoxious Naruto; while Tokine is a slightly more useful and naggy Sakura.  One of the enemy ayakashi is a forgery of Rukia from Bleach.  It was pretty blatant character stealing.  \\n\\n\r\nStory: 5  Mediocre.  It had potential, but the beginning of the anime basically had no plot.  \\n\\n\r\nArt: 8 Very good.  While it was not my preferred style, the art was crisp and clean.  The characters were a little above average, but the backgrounds were beautiful.  Unfortunately, they use the same background over-and-over again.  Definitely the best aspect of the series.  \\n\\n\r\nSound: 3 Poor.  Whoever decided on the theme song needs to be fired.  It's one of those songs that is maybe ok once, but that screechy harpy voice makes you angry the second time you hear it.  All the ending themes but one were lackluster.  Sound effects were normal in the episodes.  Obviously, something the series fails at.\\n\\n\r\nCharacters: 6  This is what kept me coming back for more.  No, not Tokine and Yoshimori, but some fairly decent bad guys.  It's pretty sad when you want the protagonists to lose and have the antagonists take over the story.  Almost all the characters (especially the protagonists) were one-trick-ponies.  They had no discernible character development and felt flat.  \\n\\n\r\nEnjoyment: 5 Mediocre.  Unfortunately, the last 10 or so episodes do not make up for the 40+ bland episodes before it. I would have rated this higher if the first episodes had been less repetitive.  \\n\\n\r\nOverall: 6 Fair.  Although the the anime wasn't terrible at the every-episode-fight-weak-random-bad-guys scenario, I could have substituted any episode for the other.  That said, the anime did show significant improvement after the 40th episode. Kekkaishi could have benefited from compacting the beginning storyline and reducing the episode count.  Quantity does not equal quality.  \\n\\n\r\nIn conclusion: At this time, I would only recommend this anime to people who are new to the shounen genre.  Maybe you can enjoy it more if you have nothing to compare it to.  If there is a second season, that picks up were the first left off, I might actually recommend it.  That being said, you would have to sift through the previous 40 boring episodes.  I would recommend Bleach and Naruto over Kekkaishi (as long as you skip the fillers), and less well-known series such as: Sengoku Basara, Soul Eater, Monochrome Factor (manga is better), and Tactics.",
            "date": "2011-02-25T03:27:00+00:00",
            "helpful_count": 19,
            "mal_id": 34743,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/_Hanamaru_",
                "username": "_Hanamaru_"
            },
            "url": "https://myanimelist.net/reviews.php?id=34743"
        },
        {
            "content": "Kekkaishi is a decent shonen show. All the usual elements are there, a simple minded young hero, the cute girl from the neighbourhood, their hate/love relation and lots of monsters to make them evolve and become powerfull saving the day.\r\nWhat makes it decent? the techniques they use are interesting and the enemies vary as well, plenty of original monsters and the usual undisclosed romance do a good job entertaining, topped with funny gags and cliches that worked out quite good, becomes very silly for moments but also has the dramatic scenes building up momentum for the end.\r\nIts not completely original or a must see butits well built and didnt became boring like most shonens nowadays, if theres any flaw its prolly the open end, built on a good plot I was personally expecting more, at least the arc ends, but leaves room for more seasons. \\n\r\nTaking all into consideration its an average show built for entertaining and does it well, its not incredibly good but doesn't fall into boring or the usual flaws of shonens, if your into the style its a good watch but if you prefer something more elaborate, don't expect too much of it. \\n\r\nWont disappoint but wont leave a strong impression either.\\n\\n\r\nI enjoyed the ending song quite alot and Id like to comment on the 8 scoring in character, because I do believe there are good characters here, not original but better built then other similar shows. The enjoyment rating is a bit overrated because its hard to find an action shonen lately that isn't completely cookie cutter, this managed to get out of the box enough to be watchable.",
            "date": "2008-03-27T20:00:00+00:00",
            "helpful_count": 11,
            "mal_id": 3438,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3104.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/acceleratum",
                "username": "acceleratum"
            },
            "url": "https://myanimelist.net/reviews.php?id=3438"
        },
        {
            "content": "I could barely stand watching part of this series. It was if Inuyasha and Bleach had an ugly baby. The stream of events is so obvious and the cliche \"I WILL PROTECT HER\" line almost made me vomit, not to mention it was at the end of the first episode and there wasn't even time for decent character development between them. None of the characters are unique at all, except for the awesome fox demons that follow the main characters around. Go ahead and watch this series if you haven't seen any good shonen.",
            "date": "2011-08-09T16:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 41119,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/539591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/orenjizero",
                "username": "orenjizero"
            },
            "url": "https://myanimelist.net/reviews.php?id=41119"
        },
        {
            "content": "Kekkaishi has to be one of the greatest anime's I have ever seen in my life. It's full of so much emotion and joy. \r\nThe story line is interesting and gripping once it comes in and the characters have all been deveoped so well that you get a strong atachment to them.\r\nIt's a completely unique and creative anime that deserves so much more recognition than it currently has. \r\nTanabe has created a wonderful masterpiece that deserves to be watched by everyone. It's such an enjoyable anime with one of the greatest OST's I've heard.\r\nDEFINITE WATCH!",
            "date": "2012-12-19T05:06:00+00:00",
            "helpful_count": 8,
            "mal_id": 80570,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1314215.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/finalsabre",
                "username": "finalsabre"
            },
            "url": "https://myanimelist.net/reviews.php?id=80570"
        },
        {
            "content": "The story was pretty ordinary and not very interesting in itself. After all, this is a shounen fight anime, so obviously a really good story is unnecessary. It was quite annoying that all those things happened in such a short time(less than a year). \r\nThe backgrounds looked quite pleasing to the eye and the character designs were fairly well done as well(though Masamori's weird moon-shaped thing on the head was annoying). Animation was very good for a TV series and the different special abilities looked cool enough.\r\nI liked the opening song and thought it fit the series well. Background music and sound effects were alsogreat.\\n\\n\r\nCharacters were a little plain but nothing too bad. It was a pleasant surprise that the demon dogs were not annoying but rather amusing.\\n\\n\r\nOverall, I'd say it's an enjoyable show, it doesn't drag and get annoying even if watched in a very short time. The fights are entertaining, look cool and don't last too long. Recommended, unless you require a deep plot to enjoy your anime.",
            "date": "2008-06-01T02:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 5139,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zindrel",
                "username": "zindrel"
            },
            "url": "https://myanimelist.net/reviews.php?id=5139"
        },
        {
            "content": "The term Kekkaishi means barrier master. It is an awesome love story of a 14 yrs old boy Yoshimori and 16 yrs old girl Tokine. They work together at night protecting their land Karasumori from Ayakashi(s) which give them powers. As Tokine is elder than Yoshimori, she is better than him in their techniques. Their family also competes with each other. Tokine always manages to protect or save Yoshimori whenever he gets in trouble. That’s why to repay it, he works very hard and also tries to impress her making cakes for Tokine. In the beginning, the whole story comes with this romance. But soona boy called Gen joins forces with them as a new group of Ayakashi(s) called Kokuboro comes to take on Karasumori. The story now gets a little twisted when one of the Ayakashi, Kaguro kills Gen. To take his avenge, Yoshmori works harder and harder and harder. And finally manages to kill Kaguro and collapse Kokuboro. But during fight with Kaguro and collapsing of Kokuboro, Yoshimori makes a powerfull Barrier called Zekkai in which he closed himself and again Tokine manages to save him.\\n\r\nI loved Kekkaishi because it not only supports the main story but also it has many beautiful stories of other characters. The story of love, the story of friendship, the story of brotherhood. Every story was so strong and tearing. It was totally a marvelous series.\\n",
            "date": "2011-12-12T21:09:00+00:00",
            "helpful_count": 7,
            "mal_id": 49073,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/496184.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GaryKane",
                "username": "GaryKane"
            },
            "url": "https://myanimelist.net/reviews.php?id=49073"
        },
        {
            "content": "The way that I discover animes is a very odd one. It mostly consists of me looking through the Wikipedia page of a dub actor I like and seeing what I can find. I was looking through Vic Mignogna's Wikipedia page when I found Kekkaishi. \r\nI find it strange that until then, I had never heard of Kekkaishi. It was a 35 volume manga and a 52 episode anime, with bigshot voice actors Laura Bailey and Vic Mignogna, in a rare case of Mignogna playing the lead and not a supporting role (besides Edward Elric). It seems stranger that I had not heard of thisshow at all after I finished watching the whole thing. This show is actually really good.\\n\r\nThe characters are what make this show so good. The interactions are hilarious, especially between the two leads, Yoshimori and Tokine. Also there is Madarao, the hilarious ghost wolf, Gen, the half demon, and Kaguro, who looks like Asura from Soul Eater (or did Kekkaishi come first?). It is your typical mix of everyday life and supernatural that you may think of when you think of anime, but rarely have I seen that template done as well as it does here. This show gets the little things right, and that can make something pedestrian special. It's funny, it's entertaining, it has a lot of heart, and I hope that I can make more people aware of this show with this review.",
            "date": "2015-05-14T17:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 187852,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4565250.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NameWithheld",
                "username": "NameWithheld"
            },
            "url": "https://myanimelist.net/reviews.php?id=187852"
        },
        {
            "content": "this was a a really fun series. I must complitment them on their originality. and how they were able to keep me occuppied with boxes. the inguenuity of the main character was most enjoyable. there was also a good aura of mystery that kept me wanting for more.\r\nmost of the characters developed well, especialy the female protagonist,\r\ni was wondering how they were going to handle the elements for romance when one was in high school and the other in middle school, but it worked out well. \r\nthe sound in this series is one of its best points. it really comes strong during moments of suspense.\r\nanywaysgood series, tried its best, was original, and showed how shounen anime shoud be.",
            "date": "2009-03-20T21:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 13346,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/54757.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Goshin",
                "username": "Goshin"
            },
            "url": "https://myanimelist.net/reviews.php?id=13346"
        },
        {
            "content": "Okay guys, before beginning the review I have  to tell that this is my first review, not the first anime review on MAL but the first review ever and this is the first time I am going to write anything on the internet and I am a south asian and English is not my native language. So, I apologize for any grammatical errors. And yeah, this review will be very lengthy.\r\nFall 2006, studio sunrise created an amazing anime. The anime was so great that it received admiration from every anime fan in this world. Every one enjoyed it, loved it and admired it. Itbroke every record created by shows like cowboy bebop, fullmetal alchemist, Naruto and Bleach. Even most of the non- anime fan enjoyed it. It was the best mecha anime ever, yes I am talking about code geass. That anime became instant success but at the same time studio sunrise created another anime called Kekkaishi, which was also great and for me it was one of the best anime ever. Kekkaishi has every element to become a successful anime as code geass, It has great animation, amazing stories, likeable character, good music but for some reason it couldn’t grasp majority of the anime fans, it became unnoticed and died in the minds of the people, But now I am going to discuss why this anime is so great but it  is not without flaws.\\n\\n\r\nSTORY:  Sumimura and yukimura are two clans whose members are known as keekkashi, are entrusted to protect a piece of land from the demons called ayakashi. They have been doing this since hundreds of years, now we have yoshimori from sumimura and Tokine from yukimura clan, who has entrusted this duty to protect the land called Karasumori, which also happens to be the place where their school is built. So now they have to engage in this seamless battle with ayakashi. As the story goes, there is nothing original about it, but there are certain sub plots in the anime which are completely unique and I would call it breath of fresh air in a shonen anime, such as relationship between sumimura and his brother, the story behind the land of Karasumori being sacred and sumimura’s development. The kind of story that Kekkaishi has, one could possibly assume that, if it was handled correctly, there will be lots of development in the later episodes which will make the characters more likeable. But things didn’t happen exactly as I thought it would but I will talk about that later.\\n\\n\r\nCharacters: Our lead character “Yoshimori” is like a mature version of naruto, he does stupid things but he is not exactly as stupid and dumb as other shonen anime protagonists. Sometimes he makes sensible decisions. It is shown that he has great unexploited potential inside of him and if he trains hard he could become strongest of all. And he is in love with Tokine, his partner and his rival. Let’s talk about Tokine, She is your perfect female lead, She is one of those anime girls who are good in studies, beautiful, athletic, and everybody in the school likes her. In fact she is total opposite of our protagonist. Though she is good in combat but she is not as powerful as yoshimori is. Then we have masamori, yoshimura’s elder brother and yoshimori hates him and this is because masamori is stronger, and intelligent than yoshimori is. And also tokine likes him. Even though he is stronger than yoshimori he wasn’t chosen as the family heir but instead of developing a grudge against his yonger brother, who was chosen over him, he supports him to develop his power. Other supporting characters are yoshimori’s hotheaded but caring grandfather, yoshimori’s younger brother who is actually more mature than yoshimori, tokine’s grandmother who is just like tokine, smart, mature and elegant, Kaguro who is the main villain in this series, he reminds me of ulquirra from bleach. These are all likeable but the award for best supporting actor in kekkaishi goes to shesio gen. Gen reminds me of sasuke from naruto, he is your silent powerful type of guy. He has the ability to transform into an ayakashi, but he can’t control it, he is Immensly strong and he can heal fast. The reason he is so likeable is the character development he gained in the show though he is in the show for only 20 or so episodes. He has a sad past and it was well explained. We can see the relationship between him and his sister, which was really tragic. Being an ayakashi majri, people hated him, thus turning him into a monster. He is a member of night troop where masamori recognize his talent and becomes his mentor. He also has a good relationship with his trainer.\\n\\n\r\nANIMATION- The show is made by studio sunrise, so we can expect some decent animation. The character design is good, the atmosphere is amazing, it’s not too dark but not too bright either. The kekkai boxes are CGied but blends with the environment completely. For an unpopular show the production values are really high. \\n\\n\r\nSOUND-   Most of the successful shonen anime has the great sound track and this one is no exception( though it wasn’t successful). The OST is really good, the background score at the times of action scene is also amazing. Now about opening and endings, there is only one opening and they didn’t change it and may be for the good, because I really liked the opening track. And most of the endings were also good but my favourite was the 2nd one “Sekaijyuu Doko wo Sagashitemo”, by Aiko katahara, it has really nice music. And I don’t know anything about the English dub because I watched kekkaishi three times and all these times I watched it in Japanese and I thought it was amazing, maybe I can’t understand Japanese but I can say that the voice actors worked really hard to express the feelings and emotions.\\n\\n\r\nOVERALL- Overall, kekkaishi is a really good anime and in my opinion this anime has everything to become a successful anime but it couldn’t, my only complaint is the ending, it wasn’t bad but it could’ve been better, the way the anime was going I was expecting some epic climax but it wasn’t and the fight between kaguro and yoshimori was a big disappointment. But again the creator did what they could to provide a satisfactory climax because the show went into the losses and there is no way they could continue it. Thus here’s my final verdict-\\n\\n\r\nSTORY-7\t\\n\\n\r\nCHARACTERS- 8\\n\\n\r\nSOUND – 8.5\\n\\n\r\nANIMATION- 7.5\\n\\n\r\nOVERALL- 8/10\\n",
            "date": "2016-10-14T14:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 231780,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/22sri",
                "username": "22sri"
            },
            "url": "https://myanimelist.net/reviews.php?id=231780"
        },
        {
            "content": "Try to watch it! it`s so awesome right from the very start!\r\nEven the opening song is so cool!(well, atleast for me hehe...).\r\nanyways, if you watch it, you suddenly became inspired as if you want to watch for more than a week STRAIGHT! (maybe a jerk will :P).",
            "date": "2008-10-09T04:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 8533,
            "reviewer": {
                "episodes_seen": 42,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kemeru",
                "username": "Kemeru"
            },
            "url": "https://myanimelist.net/reviews.php?id=8533"
        },
        {
            "content": "Kekkaishi is one of the worst animes I have ever seen. After completing this anime I felt nothing but betrayal. I know that sounds crazy but bear with me.\r\nI could start off by saying that the beggining was boring and bland, but I hardly remember the earlier episodes because of \"blandness\". You probrobly wont remember them either. Even bleach's first 10 episodes are more memorable. \r\nThe anime does pick itself up really fast once the main plot is.introduced though. Kekkaishi's main strength was its battles. Defeating the bigger and stronger enemies was never done by power ups coming out of nowhere or training in anempty space like every other shounen. Instead battles are won by refining techniques, stradegy, and teamwork with a lttle bit of willpower thrown in there. It was actually a breath of fresh air see an anime like this. But it really doesnt last long. These battles were this intresting.because a technique called kekkai. It basically was just the ability to make a cube appear out of thin write in any way you want and then make the box implode on itself and kill whatever is inside. They really pushed the imagination with this and it was a good watch for a while. sadly this gets replaced by a technique called zekkai. Zekkai is the most boring thing to watch. \\n\\n\r\nbasically this is what is said when zekkai is used: hey I have a barrier surrounding be that burns whatever it touches. Come on attack me. You know you wanna.\\n\\n\r\nReally zekkai could've been used in better ways like using it at good timings before an attack and used in combination with kekkai. But no, its only one or the other and you have to stand still with zekkai. sadly this leads to an absolute embarrassment of a final battle that had an insane amount of build up to it. Some call it disappointment, I call it betrayal. \\n\\n\r\n All this anime sums up to me is a long wait for some really good action scenes and it jumps the shark in the end anyways.\\n\\n\r\nThere isnt much story to speak of other than \"they fight monster, then fight big monster, then fight fast monster, then fight regenerative monster, then fight monster with x power,  then fight monsters that actually count as characters, then we get new guy, etc\". There are other components like romance and family tensions but they never pan out to anything in the end so why bother. Except some very forced revenge plots near the end that make the characters look like total jerks and creeps just so we can see a few battles.\\n\\n\r\nAs far as characters, they are acceptable but nothing more. the only bad one to speak of is the main character. It is just so hard to stand how much of a prick he becomes near the end.\\n\\n\r\nOverall dont waste your time with 50+ episodes just to see the most lazy ending ever.",
            "date": "2012-01-10T21:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 51483,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Dflood",
                "username": "Dflood"
            },
            "url": "https://myanimelist.net/reviews.php?id=51483"
        },
        {
            "content": "Worst anime ever! Every episode is basically the same, I was gonna use pokemon but that's actually enjoyable, but they go to school at night to fight monsters, capture them, and that's it. Every episode I watched was just the same. \"But it gets better\" no it doesn't. Ever. There's barely any story to this damn anime. In my opinion you're better off reading the manga, it probably has more of a story.\r\nSigh, because I should write a \"longer\" review. I picked this up around the 30 episode mark I believe. Started watching it up till I dropped it around 20 in hopes of anew character at least, they don't show up till later. By the time i got to episode 10 or so, I was already dreading this anime. I would rather cut my own ballsack off rather than watch this anime again. Ever.",
            "date": "2016-02-01T21:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 209939,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6872.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Raven_Freak",
                "username": "Raven_Freak"
            },
            "url": "https://myanimelist.net/reviews.php?id=209939"
        },
        {
            "content": "I've been a fan of shounen animes ever since I was a kid. Shounen, being an action anime directed to kids and adolescents are really popular. So obviously, many shounen animes were made, but few succeeded, I don't know if kekkaishi is one of them, but I tell you, kekkaishi is one of the better ones I've watched.\r\nStory : 8\r\nAs the for the story, 500 years ago there was a land called Karasumori which holds mysterious powers, it increases an ayakashi's(monster) power, a monk who is a kekkai(barrier) master was tasked to protect it, but when the kekkai master fell ill and too old forhis job, he then tasked two households to protect Karasumori, the Sumimura and the Yukimura household. And after many generations, many things happenned at Karasumori, a school was built on it which the protagonists goes to, Sumimura Yoshimori is one of them,your average shounen character, he acts first before thinking. And Yukimura Tokine the main girl who is the total opposite of Yoshimori.  Every night Yoshimori and Tokine goes to their school to protect the land of Karasumori from ayakashi. Many things will happen on Karasumori, and that's for you to find out if you decide to start this series.\\n\\n\\n\\n\r\nArt : 7-8\\n\r\n7 to 8? Yes, since the series were aired for almost two years, the art is constantly improving in every episode, monsters who are simply drawn on early episodes were improved a lot on late episodes. The art was good, even backgrounds are good, on most of shounen animes, you gotta have the best destroyable environment. Even on those parts they did a good job.\\n\\n\\n\\n\r\nCharacters : 8\\n\r\nCharacters are good, we got Yoshimori who's your average shounen protagonist. A perfect example of being an adolescent. And Tokine, a calm and collected person who compliments our male protagonist who's a total airhead. Characters on kekkaishi were not that great, and not that bad. Its so-so, supporting characters are well done anyway.\\n\\n\\n\\n\r\nMusic : 8\\n\r\nI don't really know what's the music department on kekkaishi were doing on the opening theme, 1 opening theme for 52 episodes?! Really?! Come on! Well, I kinda hoped they made another opening theme on kekkaishi, since sticking on to one opening theme for 52 episodes is quite annoying. And as for the ending themes, they made 3 ending themes, played it randomly on late episodes. I kinda liked yhe ending themes though, they play the sad ending theme if something sad happenned, so its really good how they managed to solidify what happenned on an episode by playing an ending theme. It made up for the annoyingly reapetedly opening theme. Oh and yeah, backgrounds on fight scenes were pretty awesome too! They adjust the backgrounds depending what the mood is. So the background and ending theme made up for the opening theme.\\n\\n\\n\\n\r\nEnjoyment : 8\\n\r\nI really enjoyed the series, it certainly had its ups and downs, one moment you are getting excited for an upcoming battle. And another moment which you'll sympathize on what's happening. There was never a dull moment for me.\\n\\n\\n\\n\r\nOverall : 8\\n\r\nKekkaishi was aired on our country in a local channel, I stumbled upon it once browsing the channels, I was intrigued on what the plot was about. Since it was aired 2008 in our country, I was kinda young at that time, I didint have the access to internet yet, so I patiently waited for the episodes on the local channel, and I was pissed real good when they stopped airing the series on the 15th episode. I forgot everything about Kekkaishi. Until last week, I accidentaly found a poster of it under my bed, I've decided to watch the whole series after seeing the poster. And I'm really happy what the series turned to. The story revolves about protecting your friends, protecting what you think is right, and a little bit of sibling conflict, all in all. The series is worth watching, no matter how cliche the story is, you gotta appreciate this kinds of things.Honestly, its not a must watch, but once in a while, watching shounen series' bring the kid into you, the feeling of wanting to be the protagonist is priceless, you don't always feel like that, but when you do, its quite good.\\n",
            "date": "2013-07-27T05:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 107057,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=107057"
        },
        {
            "content": "Kekkaishi is just an amazing anime that sucks you in it has a epic story and epic battles, there is boy that named Yoshimori and a girl that named tokine and they are there to protect the school where theyre from , cause there are the bad people that want to do something with that school and Yoshimori and tokine are there to protect it from the bad people, the kakuburou.\r\nand they fighting with powers with kekkai these are boxes / barriers that closes u up and then vanish. U have to watch kekkaishi cause its amazing and the fighting style theyre fighting with itsjust amazing.",
            "date": "2009-05-07T02:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 14850,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179623.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheVongola10th",
                "username": "TheVongola10th"
            },
            "url": "https://myanimelist.net/reviews.php?id=14850"
        },
        {
            "content": "This is the show to watch if what you want to watch is either\r\nA) To kill time\r\nB) Some decent action scenes\r\nC) Some pretty decent comedy \r\nThis is not a show where if you want to see a good plot/story, well rounded charters, individuality, surprising twist and turns, or get you so immersed in the show that you just start yelling at the computer screen.\r\n-Plot-\r\nThe plot is annoyingly easy to predict it's been done over and over again. Not much to say really it's got potential just not well put out.\r\n-Characters-\r\nWell the characters are OK the spirit dogs are most colorful of any of them Iwould say. Yoshi's cliche save the girl get stronger type but not well done. Tokine is like a bland background character trying to be a main character.\\n\\n\r\n-Overall-\\n\r\nOK the show has it's up's and down's and alot of in between but all together it was a good show to kill time.\\n\\n\r\nWARNING~~~~~~~~~~~~~~~~~~~~~~WARNING~~~~~~~~~~~~~~~~~~~~~~~WARNING~~~~~~~~\\n\r\nIf you have just seen a totally awesome anime and looking for another one to watch don't watch Kekkaihi. I have done that I had just came from watching a great anime forget the title now but Kekkaishi was such a let down from that I ended up dropping it and only recently picking it back up from complete  boredom. UNLESS YOU HAD JUST SEEN A SEMI-DECENT ANIME OR JUST PLAIN BORED THEN YOU SHOULD WATCH AND ONLY THEN!!!",
            "date": "2011-08-11T04:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 41241,
            "reviewer": {
                "episodes_seen": 35,
                "image_url": "https://cdn.myanimelist.net/images/userimages/427909.jpg",
                "scores": {
                    "animation": 0,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 0,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnimeWatch_zlm",
                "username": "AnimeWatch_zlm"
            },
            "url": "https://myanimelist.net/reviews.php?id=41241"
        }
    ],
    [
        {
            "content": "Kekkaishi is basically one epic siege story.  The very fact that its based around protecting one piece of land (conveniently the main protagonists' school) only at night time, is the show's main hook, and it fulfils its interesting potential throughout.\r\nYoshimori and Tokine, our plucky teens, are charged with the seemingly life-long mission to protect a mystical piece of land with their barrier technique.  The ability to create barriers of all shapes and sizes by pointing their fingers and shouting \"Ketsu!\" and destroying the contents of their CGI boxes with \"Metsu!\"  It&rsquo;s a very cool and unusual technique and the animation remains consistentlygood throughout the series, so it never gets old watching the two develop their skills, or to watch Tokine take liberties and use her kekkai to smack Yoshimori in the face.\\n\\n\r\nThe manga is written by a female so you can expect some good characterization for Tokine.  The two heroes are on an even level for most of the anime, and being that it&rsquo;s written by a female, the relationship and romance has a more deft touch to it.  Sexist observation?  Maybe, but I can tell you that I didn&rsquo;t really roll my eyes or get bored with any of the lovey dovey moments sprinkled throughout Kekkaishi.\\n\\n\r\nPopulated by interesting and amusing characters, an epically memorable Taku Iwasaki score, refreshing pacing, and creative action, Kekkaishi is the definition of how a shonen genre anime is meant to be made.  It does get a tad derivative towards the end, being unable to escape the tropes of the genre, but its still good fun.  Each episode also ends with a great Photoshop-like montage of characters, basically summing up the climax of the last 20 minutes.\\n\\n\r\nThe producers even had the grace to just end the adaptation at the end of an arc, rather than overtake the manga or descend into filler hell.  It&rsquo;s a bittersweet compromise but one we should accept and respect.  For a show sponsored by McDonalds, you'd think greed would compel them to milk everything out of this show, but they knew when to stop.  Whether it was due to Kekkaishi not being as sell-able as Naruto or One Piece for example, I don&rsquo;t know, but I don&rsquo;t care when what they leave us with is an anime as excellent as this.\\n\\n\r\nSo like I said, Kekkaishi is a kind of siege story, a staple of the action-thriller genre that live-action films occasionally excel at, but anime rarely ever touches.  Kekkaishi greets the genre head on with shonen enthusiasm and ends up an entertaining show worth watching.",
            "date": "2008-03-22T15:42:00+00:00",
            "helpful_count": 209,
            "mal_id": 3339,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29975.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Beatnik",
                "username": "Beatnik"
            },
            "url": "https://myanimelist.net/reviews.php?id=3339"
        },
        {
            "content": "Perfect execution of a unpopular shonen anime. Even though it has a mainstream plot and presentation, it has a soundness of all the elements in the show that so many one shot animes lack.\r\nI could not give the show a 10 for character, since no character stood out like the infamous L, or Light, or Luffy, or many of the other great characters. Even though I was captivated by all the characters, no one stood out. It may be due to the female writer's preference not to bias her character development to only one of the two main characters. Even though it is a maleoriented theme overall, she has built a great relationship between the two characters. Their attachment and growth dependence on one another really shows in the later part of the anime.\\n\\n\r\nThe story I could only give a 9 because it did not have any shocking twists, nor deep revelations. The show was intended for amazing action, intense adventure, and they even blew the budget on the animation! I meant that last part as a figure of speech.  The plot was always entertaining, so I was never for a moment bored, and I was always anxious waiting for the next episode. Excellent themes are hidden within all the episodes. Especially between the common male male female character trinity, just like in Naruto. Also the ominous older brother, and tiresome grandfather play out in some dynamic relationship with Yoshimori. Kekkaishi is as good as Bleach and Naruto at their best. I use those two, since they stories are the most parallel to each other. \\n\\n\r\nThe animation was incredibly done. For clearly being an unpopular manga and show, the production was high grade. Limited CG images composited into the shows main scenes. Princess Mononoke was one of the first to do this well, and has been proven to be an incredible advancement for the industry. Over the next 10 years we are going to see much better animation, once show budgets increase as the world turns to a complete global market.\\n\\n\r\nThe score is done with great meticulousness for the creation of appeal. The end character montage with a rock rift is such a great way to end each episode. It makes you crave for the next episode. Shows like this that repeatably use the same melodies to lead into scenes really enhance the appeal of the show, instead of forcing some repetitive melody in your head. Animation is nothing without sound. Shows that do not put money into their soundtrack... fail.\\n\\n\r\nThe dialogue was great, so my overall enjoyment was superb. The common banter in shonens is a great exemplification of how it is possible to escape from all your problems in a moment. One minute a character is stressed over being weaker than an enemy, the next they are cajoling with their nemesis.\\n\\n\r\nIf you want to watch a consistent anime that gives everything you want, just take it all and watch the show. It does not disappoint and delivers in action, with only marginal build up of suspense. The creators of this show analyzed all the popular anime, and formulated a perfect model for a show they wished to produced, then approached the closest show that matched their requirements. Pretty prehistoric method of manga selection, but does it ever make a great animation.  \\n\\n\r\nNow its time for me to go back to the pile and search for another show. There is still one more episode to be subbed, but I am already satisfied by the show that is Kekkaishi. \\n\\n\r\nOh and by the way, they use these cool barriers called Kekkai, which act as shields, and can perform a type of volume combustion, which they then consume as a form of garbage collection/religious burial for ayakashi (ghosts/demons), and they even play on the idea of encapsulating dimensions, and also about dimension construction. I said the show had no deep revelations, but it does use some damn cool archetypes.",
            "date": "2008-03-26T00:41:00+00:00",
            "helpful_count": 111,
            "mal_id": 3405,
            "reviewer": {
                "episodes_seen": 51,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8407.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/renegade",
                "username": "renegade"
            },
            "url": "https://myanimelist.net/reviews.php?id=3405"
        },
        {
            "content": "Watching _Kekkaishi_ is like enjoying a big box of chocolate; you know it's essentially just fat and sugar, but that doesn't stop you from eating it.\r\n_Kekkaishi_ offers nothing new, nothing spectacular, essentially nothing. It's not one of those animes that tries to be high brow and thought provoking. In the limitation of its scope, however, the series has done extremely well. The story progresses with fast enough pace that one doesn't feel the urge to fast forward, often with suspense--in the form of unresolved secrets or crisis--sustained throughout several episodes. The art is excellent as well: very clean and rarely with the exaggeration of eitherbeing too 'shoujo' or too 'shounen.' It's rather rare these days to see the female protagonist drawn without over-developed body parts, which in this case only makes her more charming and lovable.  \\n\\n\r\nThe story is simple and rather straight-forward. The basic premise of nearly all episodes lies on the encounter of the two main characters with the invading monster(s) of the week, with stories dedicated to character development revolving around this premise. I am glad to say, however, that the story has not fallen into one of the major caveats of this structure. The conflict resolution does not always depend on the main characters getting stronger (through training, for instance), but also on their character growth and interaction. \\n\\n\r\nMany hints are dropped within the series suggesting the series targets a rather young main audience: too many things are explicitly spelled out for you. The male protagonist's main drive, for instance, is hammered repeatedly to the audience from his own dialogue. A good thing that comes out of this is that the characters have well-defined personalities that explain why they do the things they do. Every character remains faithful to his/her main trait. This, unfortunately, also makes the characters rather simplistic and two-dimensional, with no room left for surprise. I find it difficult, however, to blame a series dedicated to younger audience for being reductionist in its portrayal of human psyche. \\n\\n\\n",
            "date": "2008-12-26T23:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 10675,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/divaliant",
                "username": "divaliant"
            },
            "url": "https://myanimelist.net/reviews.php?id=10675"
        },
        {
            "content": "So the basic plot line involves a boy, a girl, and a best friend (who comes a bit later into the story) and their nightly  adventures as the Kekkaishi (protectors of some ancient spiritual power source). Of course their adventures lead to a bigger plot line involving mysterious enemies and even more mysterious brothers and family histories but that's how shonen plots usually go.. . \r\nThe strength of this show is definitely the characters and their relationships. Granted the fighting and etc kept me raptly entertained as well (it didn't drag likes shonen series are prone to do...naruto), my personal taste require that thecharacters are genuinely likeable or loveable, considerate, caring, thoughtful, and funny . And the characters in Kekkaishi did just that. \\n\\n\\n\r\nYoshimori (the boy) is for all appearances your regular shonen hero being lazy, stubborn, friendly, combative, and powerful despite his obvious lack of finesse (which he works on through out the series and does show development)...he has a very obvious crush on Tokine (the girl. and in my opinion his total devotion to her is very cute) and acts like a true best friend to the initially distant Shishio (who actually opens up to be charmingly clumsy). \\n\\n\r\nThe spirit dog helpers are funny and charming. Yoshimori's and Tokine's family are also a source of entertainment being comically violent, quirky, and sincerely loving of each other. \\n\\n\r\nIf it's not already obvious, characterization is the biggest point of concern for me when enjoying an anime. If I don' t like the characters then I usually lose interest. \\n\\n\r\nStory-wise, this anime kept me interested enough and ultimately hanging for more. \\n\\n\r\nThe art pleased me being simple yet attractive, comic...although it was a little messy at times. \\n\\n\r\nThe sound was decent \\n\\n\r\nEnjoyment was very high. Didn't skip an episode or scenes out of boredom as I tend to do in  a lot of shonen series. \\n\\n\r\nMy only sore point with this series would be its very small fanbase *sigh* such a great series.",
            "date": "2008-03-04T03:50:00+00:00",
            "helpful_count": 29,
            "mal_id": 2862,
            "reviewer": {
                "episodes_seen": 34,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/asianbubbles123",
                "username": "asianbubbles123"
            },
            "url": "https://myanimelist.net/reviews.php?id=2862"
        },
        {
            "content": "Let me start off by saying that Kekkaishi is NOT your average mainstream anime, because let me tell you, it ISN'T. It starts off making you think it's all \"we've got one aspiring, goofy young teen who wants to be noticed, one smart-perfect round about girl, and one best friend who is half-human half-other\" but then it takes you onto a whole other plane.\r\nKekkaishi has your drama, your comic relief scenes, and your thought provoking scenarios all in one AND the best part is that it isn't long and overly drawn out like Naruto, Bleach, or InuYasha.\r\nPlot (9/10):\r\nAs mentioned earlier, it's got your basic goofymain character who has a crush on his neighbor and later on meets his best friend who happens to be half-Ayakashi (\"ghost\"/\"demon\"). HOWEVER, Kekaishi also successfully merges in some well back story plots that defies your average shounen story making it about 100x more interesting and it isn't drawn out to be annoying. The only reason I don't give it a full 10 was because I felt the ending could have used a little more \"padding\" i.e, giving it a slightly more thorough conclusion. It wasn't completely open-ended, but I do feel that there were maybe one or two knots that could have been tied before ending completely.\\n\\n\r\nArt (8/10):\\n\r\nConsidering that I'm writing this review in 2015 and this anime finished airing in 2008, I'm actually rather impressed with some of the special effects in the show. There were a few questionable shots, but overall I thought the art work was clean, well-done, and interesting. I only give it an 8 though because there were a few awkward shots/angles.\\n\\n\r\nSound (9/10): \\n\r\nAwesome voice acing (I'm talking about the original Japanese) the voices are all amazing and you really feel like you're watching something and not listening to someone reading off a script. There are also some very good, well-known voice actors such as Hiroyuki Yoshino and Kenjiro Tsuda. Also, including sound, the voice sound wasn't as ill-proportioned as some anime can be (i.e, the sound effects and music overpowers the voices making it difficult to hear).\\n\\n\r\nCharacters (10/10):\\n\r\nThe characters were all very \"3D\" meaning they really captured the audience's attention. In my opinion, I really got to \"know\" the characters more as people than just characters in a story. Even the villain Kaguro, because dang, did that guy have STYLE! He was bad to the core, but there was a certain amount of charm in the way he did things that kind of makes you like him and respect him, but still not \"like-liking\" him enough to hope he isn't killed off in the end. He made for a very good villain and normally one would hope to look for \"grey villains\" in anime that can decide to be seen as good or bad, but not this time. Kaguro was completely black in personality, and it was kind of \"refreshing\" in a way because often anime creates antagonists who, more usually than not, join the hero side which, although interesting, can kind of become predictably boring after seeing it occur so often.\\n\r\nThere is also a good amount of character development and interesting personalities and, like I said, you really \"fall in love\" with the characters.\\n\\n\r\nOverall and Enjoyment (10/10: \\n\r\nOverall, it was an awesome show with a relatively satisfying ending and I'm actually really depressed now that it's over. I suggest it for people who want mindless fun, but not to the point of brain dead fluff. I mean, I liked it so much that I managed to write a review for it, which I haven't even done for my most FAVORITE or favorite shows; so it just goes to show how great this series is, right? :P",
            "date": "2015-03-13T13:43:00+00:00",
            "helpful_count": 28,
            "mal_id": 182277,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/405267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ShadowJackal35",
                "username": "ShadowJackal35"
            },
            "url": "https://myanimelist.net/reviews.php?id=182277"
        },
        {
            "content": "What is it that sets Kekkaishi apart from other shounen anime?  Well, nothing really.  Kekkaishi had a fairly original premise of two young kekkai users battling ayakashi (youkai) in order to protect a powerful piece of land.  In order to protect the land, their rivaling families have lived next to each other for 400 years.  Growing up together from a young age, Yoshimori and Tokine knew that their families were \"frienemies\"  and that they should not maintain a close relationship.  So the story begins...\r\nUnfortunately, all the unique and interesting parts of the anime had little development, and the animefocused on the run-of-the-mill shounen fodder. It would have been interesting if they had addressed Yoshimori's unrequited love for Tokine and what makes Yoshimori's powers so unique, but sadly it was mostly ignored. Another disturbing characteristic was the seeming lack of emotion over death.  Without going into too much detail, usually people have a strong emotional reaction to death.  Well, in this case, the next episode was back to usual and the death was rather unemotionally brought up only when convenient.  \\n\\n\r\nMany parallels can been seen between Kekkaishi, Naruto, and Bleach.  Yoshimori is basically a pre-Shippuden, less obnoxious Naruto; while Tokine is a slightly more useful and naggy Sakura.  One of the enemy ayakashi is a forgery of Rukia from Bleach.  It was pretty blatant character stealing.  \\n\\n\r\nStory: 5  Mediocre.  It had potential, but the beginning of the anime basically had no plot.  \\n\\n\r\nArt: 8 Very good.  While it was not my preferred style, the art was crisp and clean.  The characters were a little above average, but the backgrounds were beautiful.  Unfortunately, they use the same background over-and-over again.  Definitely the best aspect of the series.  \\n\\n\r\nSound: 3 Poor.  Whoever decided on the theme song needs to be fired.  It's one of those songs that is maybe ok once, but that screechy harpy voice makes you angry the second time you hear it.  All the ending themes but one were lackluster.  Sound effects were normal in the episodes.  Obviously, something the series fails at.\\n\\n\r\nCharacters: 6  This is what kept me coming back for more.  No, not Tokine and Yoshimori, but some fairly decent bad guys.  It's pretty sad when you want the protagonists to lose and have the antagonists take over the story.  Almost all the characters (especially the protagonists) were one-trick-ponies.  They had no discernible character development and felt flat.  \\n\\n\r\nEnjoyment: 5 Mediocre.  Unfortunately, the last 10 or so episodes do not make up for the 40+ bland episodes before it. I would have rated this higher if the first episodes had been less repetitive.  \\n\\n\r\nOverall: 6 Fair.  Although the the anime wasn't terrible at the every-episode-fight-weak-random-bad-guys scenario, I could have substituted any episode for the other.  That said, the anime did show significant improvement after the 40th episode. Kekkaishi could have benefited from compacting the beginning storyline and reducing the episode count.  Quantity does not equal quality.  \\n\\n\r\nIn conclusion: At this time, I would only recommend this anime to people who are new to the shounen genre.  Maybe you can enjoy it more if you have nothing to compare it to.  If there is a second season, that picks up were the first left off, I might actually recommend it.  That being said, you would have to sift through the previous 40 boring episodes.  I would recommend Bleach and Naruto over Kekkaishi (as long as you skip the fillers), and less well-known series such as: Sengoku Basara, Soul Eater, Monochrome Factor (manga is better), and Tactics.",
            "date": "2011-02-25T03:27:00+00:00",
            "helpful_count": 19,
            "mal_id": 34743,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/_Hanamaru_",
                "username": "_Hanamaru_"
            },
            "url": "https://myanimelist.net/reviews.php?id=34743"
        },
        {
            "content": "Kekkaishi is a decent shonen show. All the usual elements are there, a simple minded young hero, the cute girl from the neighbourhood, their hate/love relation and lots of monsters to make them evolve and become powerfull saving the day.\r\nWhat makes it decent? the techniques they use are interesting and the enemies vary as well, plenty of original monsters and the usual undisclosed romance do a good job entertaining, topped with funny gags and cliches that worked out quite good, becomes very silly for moments but also has the dramatic scenes building up momentum for the end.\r\nIts not completely original or a must see butits well built and didnt became boring like most shonens nowadays, if theres any flaw its prolly the open end, built on a good plot I was personally expecting more, at least the arc ends, but leaves room for more seasons. \\n\r\nTaking all into consideration its an average show built for entertaining and does it well, its not incredibly good but doesn't fall into boring or the usual flaws of shonens, if your into the style its a good watch but if you prefer something more elaborate, don't expect too much of it. \\n\r\nWont disappoint but wont leave a strong impression either.\\n\\n\r\nI enjoyed the ending song quite alot and Id like to comment on the 8 scoring in character, because I do believe there are good characters here, not original but better built then other similar shows. The enjoyment rating is a bit overrated because its hard to find an action shonen lately that isn't completely cookie cutter, this managed to get out of the box enough to be watchable.",
            "date": "2008-03-27T20:00:00+00:00",
            "helpful_count": 11,
            "mal_id": 3438,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3104.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/acceleratum",
                "username": "acceleratum"
            },
            "url": "https://myanimelist.net/reviews.php?id=3438"
        },
        {
            "content": "I could barely stand watching part of this series. It was if Inuyasha and Bleach had an ugly baby. The stream of events is so obvious and the cliche \"I WILL PROTECT HER\" line almost made me vomit, not to mention it was at the end of the first episode and there wasn't even time for decent character development between them. None of the characters are unique at all, except for the awesome fox demons that follow the main characters around. Go ahead and watch this series if you haven't seen any good shonen.",
            "date": "2011-08-09T16:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 41119,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/539591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/orenjizero",
                "username": "orenjizero"
            },
            "url": "https://myanimelist.net/reviews.php?id=41119"
        },
        {
            "content": "Kekkaishi has to be one of the greatest anime's I have ever seen in my life. It's full of so much emotion and joy. \r\nThe story line is interesting and gripping once it comes in and the characters have all been deveoped so well that you get a strong atachment to them.\r\nIt's a completely unique and creative anime that deserves so much more recognition than it currently has. \r\nTanabe has created a wonderful masterpiece that deserves to be watched by everyone. It's such an enjoyable anime with one of the greatest OST's I've heard.\r\nDEFINITE WATCH!",
            "date": "2012-12-19T05:06:00+00:00",
            "helpful_count": 8,
            "mal_id": 80570,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1314215.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/finalsabre",
                "username": "finalsabre"
            },
            "url": "https://myanimelist.net/reviews.php?id=80570"
        },
        {
            "content": "The story was pretty ordinary and not very interesting in itself. After all, this is a shounen fight anime, so obviously a really good story is unnecessary. It was quite annoying that all those things happened in such a short time(less than a year). \r\nThe backgrounds looked quite pleasing to the eye and the character designs were fairly well done as well(though Masamori's weird moon-shaped thing on the head was annoying). Animation was very good for a TV series and the different special abilities looked cool enough.\r\nI liked the opening song and thought it fit the series well. Background music and sound effects were alsogreat.\\n\\n\r\nCharacters were a little plain but nothing too bad. It was a pleasant surprise that the demon dogs were not annoying but rather amusing.\\n\\n\r\nOverall, I'd say it's an enjoyable show, it doesn't drag and get annoying even if watched in a very short time. The fights are entertaining, look cool and don't last too long. Recommended, unless you require a deep plot to enjoy your anime.",
            "date": "2008-06-01T02:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 5139,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zindrel",
                "username": "zindrel"
            },
            "url": "https://myanimelist.net/reviews.php?id=5139"
        },
        {
            "content": "The term Kekkaishi means barrier master. It is an awesome love story of a 14 yrs old boy Yoshimori and 16 yrs old girl Tokine. They work together at night protecting their land Karasumori from Ayakashi(s) which give them powers. As Tokine is elder than Yoshimori, she is better than him in their techniques. Their family also competes with each other. Tokine always manages to protect or save Yoshimori whenever he gets in trouble. That’s why to repay it, he works very hard and also tries to impress her making cakes for Tokine. In the beginning, the whole story comes with this romance. But soona boy called Gen joins forces with them as a new group of Ayakashi(s) called Kokuboro comes to take on Karasumori. The story now gets a little twisted when one of the Ayakashi, Kaguro kills Gen. To take his avenge, Yoshmori works harder and harder and harder. And finally manages to kill Kaguro and collapse Kokuboro. But during fight with Kaguro and collapsing of Kokuboro, Yoshimori makes a powerfull Barrier called Zekkai in which he closed himself and again Tokine manages to save him.\\n\r\nI loved Kekkaishi because it not only supports the main story but also it has many beautiful stories of other characters. The story of love, the story of friendship, the story of brotherhood. Every story was so strong and tearing. It was totally a marvelous series.\\n",
            "date": "2011-12-12T21:09:00+00:00",
            "helpful_count": 7,
            "mal_id": 49073,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/496184.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GaryKane",
                "username": "GaryKane"
            },
            "url": "https://myanimelist.net/reviews.php?id=49073"
        },
        {
            "content": "The way that I discover animes is a very odd one. It mostly consists of me looking through the Wikipedia page of a dub actor I like and seeing what I can find. I was looking through Vic Mignogna's Wikipedia page when I found Kekkaishi. \r\nI find it strange that until then, I had never heard of Kekkaishi. It was a 35 volume manga and a 52 episode anime, with bigshot voice actors Laura Bailey and Vic Mignogna, in a rare case of Mignogna playing the lead and not a supporting role (besides Edward Elric). It seems stranger that I had not heard of thisshow at all after I finished watching the whole thing. This show is actually really good.\\n\r\nThe characters are what make this show so good. The interactions are hilarious, especially between the two leads, Yoshimori and Tokine. Also there is Madarao, the hilarious ghost wolf, Gen, the half demon, and Kaguro, who looks like Asura from Soul Eater (or did Kekkaishi come first?). It is your typical mix of everyday life and supernatural that you may think of when you think of anime, but rarely have I seen that template done as well as it does here. This show gets the little things right, and that can make something pedestrian special. It's funny, it's entertaining, it has a lot of heart, and I hope that I can make more people aware of this show with this review.",
            "date": "2015-05-14T17:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 187852,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4565250.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NameWithheld",
                "username": "NameWithheld"
            },
            "url": "https://myanimelist.net/reviews.php?id=187852"
        },
        {
            "content": "this was a a really fun series. I must complitment them on their originality. and how they were able to keep me occuppied with boxes. the inguenuity of the main character was most enjoyable. there was also a good aura of mystery that kept me wanting for more.\r\nmost of the characters developed well, especialy the female protagonist,\r\ni was wondering how they were going to handle the elements for romance when one was in high school and the other in middle school, but it worked out well. \r\nthe sound in this series is one of its best points. it really comes strong during moments of suspense.\r\nanywaysgood series, tried its best, was original, and showed how shounen anime shoud be.",
            "date": "2009-03-20T21:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 13346,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/54757.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Goshin",
                "username": "Goshin"
            },
            "url": "https://myanimelist.net/reviews.php?id=13346"
        },
        {
            "content": "Okay guys, before beginning the review I have  to tell that this is my first review, not the first anime review on MAL but the first review ever and this is the first time I am going to write anything on the internet and I am a south asian and English is not my native language. So, I apologize for any grammatical errors. And yeah, this review will be very lengthy.\r\nFall 2006, studio sunrise created an amazing anime. The anime was so great that it received admiration from every anime fan in this world. Every one enjoyed it, loved it and admired it. Itbroke every record created by shows like cowboy bebop, fullmetal alchemist, Naruto and Bleach. Even most of the non- anime fan enjoyed it. It was the best mecha anime ever, yes I am talking about code geass. That anime became instant success but at the same time studio sunrise created another anime called Kekkaishi, which was also great and for me it was one of the best anime ever. Kekkaishi has every element to become a successful anime as code geass, It has great animation, amazing stories, likeable character, good music but for some reason it couldn’t grasp majority of the anime fans, it became unnoticed and died in the minds of the people, But now I am going to discuss why this anime is so great but it  is not without flaws.\\n\\n\r\nSTORY:  Sumimura and yukimura are two clans whose members are known as keekkashi, are entrusted to protect a piece of land from the demons called ayakashi. They have been doing this since hundreds of years, now we have yoshimori from sumimura and Tokine from yukimura clan, who has entrusted this duty to protect the land called Karasumori, which also happens to be the place where their school is built. So now they have to engage in this seamless battle with ayakashi. As the story goes, there is nothing original about it, but there are certain sub plots in the anime which are completely unique and I would call it breath of fresh air in a shonen anime, such as relationship between sumimura and his brother, the story behind the land of Karasumori being sacred and sumimura’s development. The kind of story that Kekkaishi has, one could possibly assume that, if it was handled correctly, there will be lots of development in the later episodes which will make the characters more likeable. But things didn’t happen exactly as I thought it would but I will talk about that later.\\n\\n\r\nCharacters: Our lead character “Yoshimori” is like a mature version of naruto, he does stupid things but he is not exactly as stupid and dumb as other shonen anime protagonists. Sometimes he makes sensible decisions. It is shown that he has great unexploited potential inside of him and if he trains hard he could become strongest of all. And he is in love with Tokine, his partner and his rival. Let’s talk about Tokine, She is your perfect female lead, She is one of those anime girls who are good in studies, beautiful, athletic, and everybody in the school likes her. In fact she is total opposite of our protagonist. Though she is good in combat but she is not as powerful as yoshimori is. Then we have masamori, yoshimura’s elder brother and yoshimori hates him and this is because masamori is stronger, and intelligent than yoshimori is. And also tokine likes him. Even though he is stronger than yoshimori he wasn’t chosen as the family heir but instead of developing a grudge against his yonger brother, who was chosen over him, he supports him to develop his power. Other supporting characters are yoshimori’s hotheaded but caring grandfather, yoshimori’s younger brother who is actually more mature than yoshimori, tokine’s grandmother who is just like tokine, smart, mature and elegant, Kaguro who is the main villain in this series, he reminds me of ulquirra from bleach. These are all likeable but the award for best supporting actor in kekkaishi goes to shesio gen. Gen reminds me of sasuke from naruto, he is your silent powerful type of guy. He has the ability to transform into an ayakashi, but he can’t control it, he is Immensly strong and he can heal fast. The reason he is so likeable is the character development he gained in the show though he is in the show for only 20 or so episodes. He has a sad past and it was well explained. We can see the relationship between him and his sister, which was really tragic. Being an ayakashi majri, people hated him, thus turning him into a monster. He is a member of night troop where masamori recognize his talent and becomes his mentor. He also has a good relationship with his trainer.\\n\\n\r\nANIMATION- The show is made by studio sunrise, so we can expect some decent animation. The character design is good, the atmosphere is amazing, it’s not too dark but not too bright either. The kekkai boxes are CGied but blends with the environment completely. For an unpopular show the production values are really high. \\n\\n\r\nSOUND-   Most of the successful shonen anime has the great sound track and this one is no exception( though it wasn’t successful). The OST is really good, the background score at the times of action scene is also amazing. Now about opening and endings, there is only one opening and they didn’t change it and may be for the good, because I really liked the opening track. And most of the endings were also good but my favourite was the 2nd one “Sekaijyuu Doko wo Sagashitemo”, by Aiko katahara, it has really nice music. And I don’t know anything about the English dub because I watched kekkaishi three times and all these times I watched it in Japanese and I thought it was amazing, maybe I can’t understand Japanese but I can say that the voice actors worked really hard to express the feelings and emotions.\\n\\n\r\nOVERALL- Overall, kekkaishi is a really good anime and in my opinion this anime has everything to become a successful anime but it couldn’t, my only complaint is the ending, it wasn’t bad but it could’ve been better, the way the anime was going I was expecting some epic climax but it wasn’t and the fight between kaguro and yoshimori was a big disappointment. But again the creator did what they could to provide a satisfactory climax because the show went into the losses and there is no way they could continue it. Thus here’s my final verdict-\\n\\n\r\nSTORY-7\t\\n\\n\r\nCHARACTERS- 8\\n\\n\r\nSOUND – 8.5\\n\\n\r\nANIMATION- 7.5\\n\\n\r\nOVERALL- 8/10\\n",
            "date": "2016-10-14T14:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 231780,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/22sri",
                "username": "22sri"
            },
            "url": "https://myanimelist.net/reviews.php?id=231780"
        },
        {
            "content": "Try to watch it! it`s so awesome right from the very start!\r\nEven the opening song is so cool!(well, atleast for me hehe...).\r\nanyways, if you watch it, you suddenly became inspired as if you want to watch for more than a week STRAIGHT! (maybe a jerk will :P).",
            "date": "2008-10-09T04:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 8533,
            "reviewer": {
                "episodes_seen": 42,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kemeru",
                "username": "Kemeru"
            },
            "url": "https://myanimelist.net/reviews.php?id=8533"
        },
        {
            "content": "Kekkaishi is one of the worst animes I have ever seen. After completing this anime I felt nothing but betrayal. I know that sounds crazy but bear with me.\r\nI could start off by saying that the beggining was boring and bland, but I hardly remember the earlier episodes because of \"blandness\". You probrobly wont remember them either. Even bleach's first 10 episodes are more memorable. \r\nThe anime does pick itself up really fast once the main plot is.introduced though. Kekkaishi's main strength was its battles. Defeating the bigger and stronger enemies was never done by power ups coming out of nowhere or training in anempty space like every other shounen. Instead battles are won by refining techniques, stradegy, and teamwork with a lttle bit of willpower thrown in there. It was actually a breath of fresh air see an anime like this. But it really doesnt last long. These battles were this intresting.because a technique called kekkai. It basically was just the ability to make a cube appear out of thin write in any way you want and then make the box implode on itself and kill whatever is inside. They really pushed the imagination with this and it was a good watch for a while. sadly this gets replaced by a technique called zekkai. Zekkai is the most boring thing to watch. \\n\\n\r\nbasically this is what is said when zekkai is used: hey I have a barrier surrounding be that burns whatever it touches. Come on attack me. You know you wanna.\\n\\n\r\nReally zekkai could've been used in better ways like using it at good timings before an attack and used in combination with kekkai. But no, its only one or the other and you have to stand still with zekkai. sadly this leads to an absolute embarrassment of a final battle that had an insane amount of build up to it. Some call it disappointment, I call it betrayal. \\n\\n\r\n All this anime sums up to me is a long wait for some really good action scenes and it jumps the shark in the end anyways.\\n\\n\r\nThere isnt much story to speak of other than \"they fight monster, then fight big monster, then fight fast monster, then fight regenerative monster, then fight monster with x power,  then fight monsters that actually count as characters, then we get new guy, etc\". There are other components like romance and family tensions but they never pan out to anything in the end so why bother. Except some very forced revenge plots near the end that make the characters look like total jerks and creeps just so we can see a few battles.\\n\\n\r\nAs far as characters, they are acceptable but nothing more. the only bad one to speak of is the main character. It is just so hard to stand how much of a prick he becomes near the end.\\n\\n\r\nOverall dont waste your time with 50+ episodes just to see the most lazy ending ever.",
            "date": "2012-01-10T21:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 51483,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Dflood",
                "username": "Dflood"
            },
            "url": "https://myanimelist.net/reviews.php?id=51483"
        },
        {
            "content": "Worst anime ever! Every episode is basically the same, I was gonna use pokemon but that's actually enjoyable, but they go to school at night to fight monsters, capture them, and that's it. Every episode I watched was just the same. \"But it gets better\" no it doesn't. Ever. There's barely any story to this damn anime. In my opinion you're better off reading the manga, it probably has more of a story.\r\nSigh, because I should write a \"longer\" review. I picked this up around the 30 episode mark I believe. Started watching it up till I dropped it around 20 in hopes of anew character at least, they don't show up till later. By the time i got to episode 10 or so, I was already dreading this anime. I would rather cut my own ballsack off rather than watch this anime again. Ever.",
            "date": "2016-02-01T21:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 209939,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6872.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Raven_Freak",
                "username": "Raven_Freak"
            },
            "url": "https://myanimelist.net/reviews.php?id=209939"
        },
        {
            "content": "I've been a fan of shounen animes ever since I was a kid. Shounen, being an action anime directed to kids and adolescents are really popular. So obviously, many shounen animes were made, but few succeeded, I don't know if kekkaishi is one of them, but I tell you, kekkaishi is one of the better ones I've watched.\r\nStory : 8\r\nAs the for the story, 500 years ago there was a land called Karasumori which holds mysterious powers, it increases an ayakashi's(monster) power, a monk who is a kekkai(barrier) master was tasked to protect it, but when the kekkai master fell ill and too old forhis job, he then tasked two households to protect Karasumori, the Sumimura and the Yukimura household. And after many generations, many things happenned at Karasumori, a school was built on it which the protagonists goes to, Sumimura Yoshimori is one of them,your average shounen character, he acts first before thinking. And Yukimura Tokine the main girl who is the total opposite of Yoshimori.  Every night Yoshimori and Tokine goes to their school to protect the land of Karasumori from ayakashi. Many things will happen on Karasumori, and that's for you to find out if you decide to start this series.\\n\\n\\n\\n\r\nArt : 7-8\\n\r\n7 to 8? Yes, since the series were aired for almost two years, the art is constantly improving in every episode, monsters who are simply drawn on early episodes were improved a lot on late episodes. The art was good, even backgrounds are good, on most of shounen animes, you gotta have the best destroyable environment. Even on those parts they did a good job.\\n\\n\\n\\n\r\nCharacters : 8\\n\r\nCharacters are good, we got Yoshimori who's your average shounen protagonist. A perfect example of being an adolescent. And Tokine, a calm and collected person who compliments our male protagonist who's a total airhead. Characters on kekkaishi were not that great, and not that bad. Its so-so, supporting characters are well done anyway.\\n\\n\\n\\n\r\nMusic : 8\\n\r\nI don't really know what's the music department on kekkaishi were doing on the opening theme, 1 opening theme for 52 episodes?! Really?! Come on! Well, I kinda hoped they made another opening theme on kekkaishi, since sticking on to one opening theme for 52 episodes is quite annoying. And as for the ending themes, they made 3 ending themes, played it randomly on late episodes. I kinda liked yhe ending themes though, they play the sad ending theme if something sad happenned, so its really good how they managed to solidify what happenned on an episode by playing an ending theme. It made up for the annoyingly reapetedly opening theme. Oh and yeah, backgrounds on fight scenes were pretty awesome too! They adjust the backgrounds depending what the mood is. So the background and ending theme made up for the opening theme.\\n\\n\\n\\n\r\nEnjoyment : 8\\n\r\nI really enjoyed the series, it certainly had its ups and downs, one moment you are getting excited for an upcoming battle. And another moment which you'll sympathize on what's happening. There was never a dull moment for me.\\n\\n\\n\\n\r\nOverall : 8\\n\r\nKekkaishi was aired on our country in a local channel, I stumbled upon it once browsing the channels, I was intrigued on what the plot was about. Since it was aired 2008 in our country, I was kinda young at that time, I didint have the access to internet yet, so I patiently waited for the episodes on the local channel, and I was pissed real good when they stopped airing the series on the 15th episode. I forgot everything about Kekkaishi. Until last week, I accidentaly found a poster of it under my bed, I've decided to watch the whole series after seeing the poster. And I'm really happy what the series turned to. The story revolves about protecting your friends, protecting what you think is right, and a little bit of sibling conflict, all in all. The series is worth watching, no matter how cliche the story is, you gotta appreciate this kinds of things.Honestly, its not a must watch, but once in a while, watching shounen series' bring the kid into you, the feeling of wanting to be the protagonist is priceless, you don't always feel like that, but when you do, its quite good.\\n",
            "date": "2013-07-27T05:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 107057,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=107057"
        },
        {
            "content": "Kekkaishi is just an amazing anime that sucks you in it has a epic story and epic battles, there is boy that named Yoshimori and a girl that named tokine and they are there to protect the school where theyre from , cause there are the bad people that want to do something with that school and Yoshimori and tokine are there to protect it from the bad people, the kakuburou.\r\nand they fighting with powers with kekkai these are boxes / barriers that closes u up and then vanish. U have to watch kekkaishi cause its amazing and the fighting style theyre fighting with itsjust amazing.",
            "date": "2009-05-07T02:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 14850,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179623.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheVongola10th",
                "username": "TheVongola10th"
            },
            "url": "https://myanimelist.net/reviews.php?id=14850"
        },
        {
            "content": "This is the show to watch if what you want to watch is either\r\nA) To kill time\r\nB) Some decent action scenes\r\nC) Some pretty decent comedy \r\nThis is not a show where if you want to see a good plot/story, well rounded charters, individuality, surprising twist and turns, or get you so immersed in the show that you just start yelling at the computer screen.\r\n-Plot-\r\nThe plot is annoyingly easy to predict it's been done over and over again. Not much to say really it's got potential just not well put out.\r\n-Characters-\r\nWell the characters are OK the spirit dogs are most colorful of any of them Iwould say. Yoshi's cliche save the girl get stronger type but not well done. Tokine is like a bland background character trying to be a main character.\\n\\n\r\n-Overall-\\n\r\nOK the show has it's up's and down's and alot of in between but all together it was a good show to kill time.\\n\\n\r\nWARNING~~~~~~~~~~~~~~~~~~~~~~WARNING~~~~~~~~~~~~~~~~~~~~~~~WARNING~~~~~~~~\\n\r\nIf you have just seen a totally awesome anime and looking for another one to watch don't watch Kekkaihi. I have done that I had just came from watching a great anime forget the title now but Kekkaishi was such a let down from that I ended up dropping it and only recently picking it back up from complete  boredom. UNLESS YOU HAD JUST SEEN A SEMI-DECENT ANIME OR JUST PLAIN BORED THEN YOU SHOULD WATCH AND ONLY THEN!!!",
            "date": "2011-08-11T04:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 41241,
            "reviewer": {
                "episodes_seen": 35,
                "image_url": "https://cdn.myanimelist.net/images/userimages/427909.jpg",
                "scores": {
                    "animation": 0,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 0,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnimeWatch_zlm",
                "username": "AnimeWatch_zlm"
            },
            "url": "https://myanimelist.net/reviews.php?id=41241"
        }
    ],
    [
        {
            "content": "Let me just start by saying for the first 30 episodes: I loved it. After that, I just got slightly bored of it just because it didn't seem to be going anywhere so it more or less went from a 9 to 5 within 8 episodes until I finally just dropped it. I really really wish I could have enjoyed it to the end, but the art, poor sound and the plot just didn't really captivate me long enough. \r\nThe story was dragged out too long which made the characters slightly more dull because they've done/said pretty much everything interesting so they just ended uprecycling old things and ended up following the cliché route. \\n\\n\r\nThat being said, the character development isn't really that bad and they have pretty great personalities so they can be relatable.",
            "date": "2018-07-11T07:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 283712,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LightningRage96",
                "username": "LightningRage96"
            },
            "url": "https://myanimelist.net/reviews.php?id=283712"
        },
        {
            "content": "This is a very polarizing show: reviewers either love it or hate it. For the most part, at least; there are a few who don't have strong feelings either way. I am one of those people. \r\nFor the most part, I found it enjoyable. There were a few moments that were really quite funny--there was even a subtle Matrix reference! The story was interesting enough, and I think the characterizations really suited the age of the characters. I found even the villains likeable. The music was nice, too. I liked how they brought back the Koshi Inaba closing theme when it was appropriate.\r\nThe biggest turnoff for me was the inconsistency of the art. On one hand, the style is different, and at times I thought, \"How refreshing!\". There were one or two scenes where it seems they really pushed their budget to create some nice effects (maybe even a subtle Art Shift). But more frequently, I found myself flinching at how off the anatomy was: heads too big, shoulders too narrow, arms too short, tiny hands, weirdly spaced eyes, strange nose shadows. Don't even get me started on their clothing. The last scene was the worst for me--what was up with their necks?? What is this, Liar Game? I don't know if they were going for something 'different', but due to the fact that there weren't *always* problems with anatomy, it didn't seem like a stylistic choice, but a mistake. \\n\\n\r\nIf you're not so picky about that kind of thing, it probably won't bother you. It bothered me. Even so, the story kept me engaged through all 52 episodes. Give it a try--I'd say watch until after the time skip to know if you want to stick with it or not.",
            "date": "2018-01-06T23:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 267718,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307040.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/blackfox17",
                "username": "blackfox17"
            },
            "url": "https://myanimelist.net/reviews.php?id=267718"
        },
        {
            "content": "This anime is one of my favorites I re watch it every year. The romance between the main characters is also interesting because it doesn't emphasis it too much but it is still there. I love this anime since it reminds me of a typical school setting and what happens to regular people with special powers. I wanted the anime to continue but after reading the manga I don't want it to end the way the manga does. I really wanted more filler episodes since they were more peaceful and I also wanted to see what happened in the future for both the main characters.I also really liked the powers of the man characters because it wasn't like your usual powers that you see with other main characters form other series. I would recommend this anime to anyone who like to watch a bit of romance and tons of action with a school setting.",
            "date": "2016-06-12T19:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 220624,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1310321.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mthoma3172",
                "username": "Mthoma3172"
            },
            "url": "https://myanimelist.net/reviews.php?id=220624"
        },
        {
            "content": "i really enjoyed watching this anime. in the beginning there wasn't a real story so it made it weird to watch, you had just these two teens who killed monsters. further the story really developed into something great. the art was a real relief, i thought the nose was weird on the poster, but it didn't really matter because the ayakashi were beautiful. i liked the sound, sometimes it was thrilling on other times it was sad, the timing was perfect. the only minus were the endings, they could've been better. but that yoshimori, god he was annoying with his whining. the rest of thecast was great but the main character was a  in the beginning it wasn't that great but it was enjoyable in the end, but there were a few questions  that were unanswered.",
            "date": "2012-12-06T13:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 79340,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1743629.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lyde",
                "username": "lyde"
            },
            "url": "https://myanimelist.net/reviews.php?id=79340"
        },
        {
            "content": "This Anime is really good though i wish it would be longer. I feel as if they rushed the story so getting to know the characters was rather difficult but\r\nother then that it was very enjoyable.",
            "date": "2009-10-12T21:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 19631,
            "reviewer": {
                "episodes_seen": 49,
                "image_url": "https://cdn.myanimelist.net/images/userimages/244917.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wrathofangels",
                "username": "wrathofangels"
            },
            "url": "https://myanimelist.net/reviews.php?id=19631"
        },
        {
            "content": "This IS a shonen anime. There is a dumb-ass protagonist that fights staight on and has loads of reishi or whatever the magical power is appliable. There is a weaker and making up with smarts lass that the protagonist has got a crush on. And a bunch of bad guy youkais that in the end turn out to be just very lonely guys, and that dissolve into nothingness after getting a bearhug from the good guys.\r\nSo, in the sense of story and cast, it's so shounen i'm feeling 14 again when watching this.\r\nBut then again, it is executed well, and while it suffers from \"nothingever gets resolved, team rocket only dissapears in the sky to come back again, and the protagonist never gets the girl\" syndrome, it certainly wasn't unpleasant to watch.",
            "date": "2016-05-10T06:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 218295,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1472429.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XanWasting",
                "username": "XanWasting"
            },
            "url": "https://myanimelist.net/reviews.php?id=218295"
        },
        {
            "content": "As for the Anime the story doesn't go as far as the Manga. (The Manga is approx. 345 chpt. I read it twice ♥) But the story is nothing too new nor too cliche, its your typical normal characters that have an alternate fate to them. Okay as much as I LOVE this Anime, (It is my favorite of all time!) The OP and music wasn't something to be favored for as to why I can't give it a perfect score of 10/10, but a 9/10. It's similar to a lot of Shounen  series in that the Protagonist is stubborn, hot-headed, reckless, but hasgood morals c: The main character Yoshimori reminds me a lot of Rin from Blue Exorcist because of how reckless the two can, but how kind of hearts they have. I will admit it's not for all people some say its boring others say that it lacks character etc. and to an extent that's true but there's nothing without flaws. c: (Unless those flaws are overlooked with something so redeeming that it replaces the flaws, but music can't really be overlooked because MUSIC IS THE KEY TO SCENE SETTING, but I am a Musician ). I hope you can give it a shot c: c: c:",
            "date": "2014-07-18T03:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 152591,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3913153.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Weeb2000",
                "username": "Weeb2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=152591"
        },
        {
            "content": "Kekkaishi ! Also known as (Barrier Master) Well when i get to the series i thought it will be fun action and comedy and and a female main character that kick ass and it's going to be fun story and character or so i thought \r\n Story : It's about the two main characters trying to protect this land that have the power to make this beasts stronger and that's about it nothing spacial no complex story or anything they try it and make me think about then they never touch it again it could have been a good story but they didn't make itright \\n\\n\\n\r\n Art :\\n\r\n Although it is not a very spectacular one the art is good for it's time let's put like that i am the type of people if i find the art not good i wouldn't watch the series even if it's have an amazing story characters overall an amazing series so it was good   \\n\\n\r\n Sound :\\n\r\nsimply it's an amazing OST to the opening to music in the episode to the ending so it's takes an amazing \\n\\n\r\n Characters :\\n\r\n The characters where do i begin let's begin with Yoshimori the main character ohh god first i hate him why because he is fucking dumb you saw your friend defend you and got hurt in the process so what you do you promise your self that you won't let here get hurt again and that good and how you gonna achieve that by becoming stronger how by training wrong by sleeping all day and go protect the land okay and you don't anyone to get hurt yeah right so don't go to school and train because all you do is sleeping god .. and guess what the girl go to school train do her job and she is good at it to and he DAMN IT you have various characters that starts the same way but they become stronger and they have the same personalities as him to some extent just to name a few ( tsuna - naruto - luffy ) because they want to achieve their goals just he's an idiot .. Next Tokine i hate her to but i hate her personality she remind me of ( sakura and nami and rukia ) i hate that type of personality ... But there some characters the two dogs and Shikigami( i know it's not character but still they are funny) and Masamori none the less everyone i don't like them \\n\\n\r\n Enjoyment :\\n\r\n Some episodes made me laugh and some episode make me wanna get into the fucking anime and slap the shit out of him you should do like these but but i enjoy it .. you fell angry and sad and excited with them \\n\\n\r\n Overall :\\n\r\n Well, what more can I say. the series it's not bad it's okay but if you going to watch it turn of your brain my mistake i gone in after watching (Higurashi no Naku Koro no)overall it's okay series to watch if you want to waste your time ... in the end that is my personal opinion and  of course everybody's Entitled to Their Own Opinion",
            "date": "2013-06-01T22:12:00+00:00",
            "helpful_count": 0,
            "mal_id": 99407,
            "reviewer": {
                "episodes_seen": 30,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1605945.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/hellphantom67",
                "username": "hellphantom67"
            },
            "url": "https://myanimelist.net/reviews.php?id=99407"
        },
        {
            "content": "I think that it would have been better to seal the series in a kekkai then metsu and tenketsu it so that people wouldn't waste their time on it. The most enjoyment I had from the series is listening to the voice actor who played Yoshimori, and that's because it was the same voice actor who played Edward Elric from Fullmetal Alchemist. The story is bad plain and simple. The whole concept of teenage kekkaishi having to be awake day and night to go to school and protect the city was absurd. The plot of finding out and defeating the Kokuburo took a little whileto get into, they waste precious episodes on dull premises, and the series ends with loose ties that do not offer any sense of fulfillment. The music is fine, on a good note was the opening music being one I enjoy listening to and bother listening to the opening song(s). The character designs were interesting to look at until everyone just started to look like a human instead of a monster. There was minor development and insight into characters, but nothing to base the series around as a selling point. Add to that the characters were pretty dull and in no way memorable. the fight scenes were decent, but all in all the series is mediocre at best. It gets three kekkais out of five.",
            "date": "2011-10-03T02:27:00+00:00",
            "helpful_count": 0,
            "mal_id": 44741,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/userimages/314582.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TWM",
                "username": "TWM"
            },
            "url": "https://myanimelist.net/reviews.php?id=44741"
        },
        {
            "content": "This show was atrocious.\r\nLackluster characters mixed with nonexistant development, uninteresting animation and overall just a stupid plot makes this completely not worth watching.\r\nDo avoid.",
            "date": "2014-09-11T18:50:00+00:00",
            "helpful_count": 0,
            "mal_id": 159959,
            "reviewer": {
                "episodes_seen": 52,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/BobathonSaget",
                "username": "BobathonSaget"
            },
            "url": "https://myanimelist.net/reviews.php?id=159959"
        }
    ]
]