[
    [
        {
            "content": "The idea in which equating popularity to greatness is disappointingly common in our modern world. Many people will claim that 50 Shades of Gray is high quality literature and many others will consider Drake to be a great rapper. They are blinded by the delusion that something being popular automatically makes it good. Obviously those people have never looked further into the media that they claim to be an aficionado of and have never read Infinite Jest or listened to Yung Lean before. This leads to Daitoshokan no Hitsujikai, an unfortunately overlooked show in the Fall 2014 season. It did not stand out and thepublicity was nearly nonexistent. However, if you were one of the people who decided to give the show a try, you were in for quite a treat. You would have experienced a coherent plot, enjoyable characters, entertaining drama, and an overall comfy feeling that viewers have not experienced since Non Non Biyori last Fall. The fact that people would rather discuss popular, yet mediocre shows is downright depressing. It brings back bad memories of last Summer when a terrible Adam Sandler movie beat out Pacific Rim in the box office for that weekend. Regardless, those of you who overlooked this show have a chance to redeem yourself if you change your ways and look to the less popular and more obscure things in life. Following that ideal will take lead you closer to the path of enlightenment.\\n\\n\r\nThe overall story for Daitoshokan no Hitsujikai was nothing extraordinary or groundbreaking. It compares to other typical club-type shows where you find both drama and comedy as the main ideas. A word that would describe the story would be “unoffensive”. It was rather soothing and made the viewer feel comfortable when watching it. The overall arching plot was a typical slice of life show with a bit of a supernatural twist added in, but that is once again typical for this genre of visual novel from which the show was adapted from. The story itself could have been more fleshed out, but that would not have been easily done with the time constraints of a 1 cour show. The pacing was also quite well done, it did not drag or feel boring at any time and gave the viewer a relaxed or comforting experience. The fact that the show was adapted from a visual and had such a comforting feel to it is rather unique. Many times visual novel adaptions are rather fanservice driven or focus mainly on the exciting action related parts of the game. That being said, Daitoshokan no Hitsujikai was not without fanservice (it had plenty), it just came off in a bit more subdued and enjoyable than the typical smut that you would expect to see. It did not feel out of place or forced into the story to sell more Blu Rays, it just had an overall natural feel due to how the story was told and how it was directed.\\n\\n\r\nOne aspect of this show that was rather interesting was the studio choice. Many people will remember Hoods Entertainment as a studio that did some of the most obscene fanservice shows that have aired on regular television. However, it seems that they have turned over a new leaf since their latest projects have not been lewd at all. It is a strange change of pace to go from doing Manyuu Hikenchou or Seikon no Qwaser which were over the top in terms of smut to the rather tame and pedestrian shows that they have done in recent history. Regardless, Daitoshokan no Hitsujikai was a rather pleasant show to look at. It featured a pastel color theme and the overall quality of the show was relatively high. Once again, the term that describes it best is “unoffensive”. That would also describe the sound for the show. The voice actors used were the same from the game which are commonly heard in visual novels. Experienced viewers will recognize a few voices, especially if they read visual novels. Regardless, the voice acting was well done and felt natural for the show. The OST and sound direction was also perfectly acceptable, it had that typical visual novel flair to it which fit the mood of the show perfectly. It definitely added to the comfortable feel that the show gave off.\\n\\n\r\nIn regards to characters, Daitoshokan no Hitsujikai did not feature anything special in particular. The cast was composed of rather cut and paste type characters with various back stories to give them some sort of depth. Obviously, the anime viewer would not see their full stories since it is not the original source material in which the reader would go through an entire route dedicated to all of the main characters, but it was easy to pick up on the various drama points and other traits from what was shown. However, what stood out for this show was the character interaction. That was top notch and it really felt like the characters had chemistry with each other. It was incredibly well done for this type of show and it really made it incredibly enjoyable to watch.\\n\\n\r\nWhen looking at the complete package of Daitoshokan no Hitsujikai, it is hard to consider it to be anything but enjoyable. The fact that it was one of the least popular and overlooked shows for the Fall 2014 season is rather disappointing. However, that may be for the better. The discussion and subsequent translation project for the visual novel were in part done due to the smaller and tight knit community that enjoyed watching this show. Regardless, if you are looking for something enjoyable that you can sit back and relax to, Daitoshokan no Hitsujikai would be an excellent choice. It goes to show that it does not matter if something is relatively overlooked, it could end up being better than many high profile options. That being said, the moral of this review is look in unlikely places and you will find true hidden gems. Worshiping nothing but mainstream media is a terrible habit and you should try to think outside the box more often. Once you do, you can appreciate more things and even find enjoyable stories in unlikely places. Or in terms more suited to Daitoshokan no Hitsujikai, don't judge a book by its cover. \\n",
            "date": "2014-12-25T11:56:00+00:00",
            "helpful_count": 92,
            "mal_id": 174263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/283056.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/McRib",
                "username": "McRib"
            },
            "url": "https://myanimelist.net/reviews.php?id=174263"
        },
        {
            "content": "Initially, I'd written a review halfway through the show, now that I've completed it, here's an updated version.\r\n Firstly, this is very much a slice of life show. If you're not a big fan of those, you may not want to watch this one. I enjoy slice of life, romance, comedy, fantasy, sci-fi, and other light-sided genre, so it appealed to me.\r\nThis show also incorporates a fantasy element - a magic library. I won't go into a lot of detail, so as not to ruin the story, but this library (while only briefly and periodically mentioned) is a theme that is important to everycharacter in the show (but two, specifically). Your Main Character, Kakei, is seen having premonitions right from the get-go. He has this strange, but imperfected, ability - which he uses mostly to save people. The First girl he saves using it (Shirasaki) was distributing flyers to start a club with the unspecific goal of 'making people happy' at the time, and later invites him to join her and her friend. The club grows in size and popularity as the show continues, as does the back story and magic library information. \\n\r\nThe characters are pretty fun to watch, their interactions are light-hearted and fluffy, but there are some tensions here and there between some of the side characters and the main characters. There is also the typical 'harem-style' anime theme of 'who does the MC really love?!' going on between the main female characters. The show doesn't have any naughty bits exposed, but there are some brief nudity scenes and some suggestive humor, but it is mostly a clean, happy romantic-style slice of life with little drama. Perfectly suited for sitting back on the couch or bed and relax while watching. You don't have to think too hard to follow the story.",
            "date": "2014-12-27T12:04:00+00:00",
            "helpful_count": 35,
            "mal_id": 174583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3798557.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gilder1985",
                "username": "gilder1985"
            },
            "url": "https://myanimelist.net/reviews.php?id=174583"
        },
        {
            "content": "everything about this anime was fine, just fine. the story was fine, the characters were fine, the art was fine. truly mediocre and the genre of this mediocre anime is school/harem/magic/slice of life. \r\nstory: kakei(the main character) reads books to not be scared of anything and his goal is to find the magic library. sounds somewhat interesting. nope it is not.\r\nart: average just average. \r\nsound: average.\r\n characters: typical harem.....their looks are average. also the MC is boring.\r\nenjoyment: average. i know i used that word a lot, but it perfectly describes this anime. never really laughed hard or smiled much or thought i cant wait tillnext episode.\\n\\n\r\noverall: do not recommend. its boring.\\n",
            "date": "2014-12-24T11:00:00+00:00",
            "helpful_count": 33,
            "mal_id": 174047,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ironcarrot2",
                "username": "ironcarrot2"
            },
            "url": "https://myanimelist.net/reviews.php?id=174047"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nDuring high school, it's a time to really start thinking about one's future: pursuing higher education, finding a part-time job, volunteer work, and extracurricular activities are all in the realm of setting one up for a successful life later down the road. Along the way, friends are made and decisions are chosen. Sometimes, though, teenagers need that tiny extra \"push\" to get them going down the right path. Daitoshokan no Hitsujikai will most definitely \"be telling this with a sigh\" that the path they took was \"the one less traveled by.\"\r\nSTORY\r\nDaitoshokan follows the life of Kakei, a younghigh school boy who, one day, saves Shirasaki from a fatal accident. Their newfound friendship causes them to form a group known as the Library Club.\\n\\n\r\nWhat's unfortunate with Daitoshokan is in its handling of the major plot device at play. Known as the \"Shepherd,\" it is designed to be an important aspect of the show. However, it is never perceived as such. The first half of the anime consists mainly of character introductions, which is perfectly reasonable. But the characters themselves are largely uninteresting, and coupled with the fact that the foreshadowing is handled so poorly causes the big reveal to be rather small. Even worse, it never elaborates much on the \"Shepherds\" either, making one not understand the full extent of their powers. When the second half of the season begins, it then fails to utilize this established plot device effectively. It is used quite sparingly, causing its use to hold no weight, drama, or emotional attachment. Simply put, this anime is exactly the same with or without the idea that is supposed to separate it from other shows.\\n\\n\r\nWhile Daitoshokan is considered a romance anime, it never tries to be. Instead, it's confused as to whether it wants to pursue a single, established relationship or have all the girls involved be potential suitors. In other words, it can't decide if it wants to be strictly romance or strictly harem. This causes a lot of the scenes to feel segmented; the continuity between differing events doesn't exist because the anime is always flip-flopping between both ideas, without coming to a clear solution.\\n\\n\r\nAt its core, the anime is about doing something for yourself versus doing something for others. It's an important life lesson that is usually learned at an early age. And there are similar ways to describe it: \"it's about giving, not receiving,\" \"treat others as you would want to be treated.\" The problem is that the show never really attempts to demonstrate such an idealistic message. It may come about as dialogue, but the actions that Kakei and the others take never fully demonstrates their movements as such. It all feels worthless, that the events taking place are neither for a single person or for a group of people; they're just there.\\n\\n\r\nANIMATION\\n\\n\r\nDaitoshokan continues its trend, having a tough time in the art and animation department.\\n\\n\r\nThe art style is wholly uninspired. It is boring, generic, lacking detail, plain, unadventurous, pretty much any adjective that places it in a negative light. The environments refrain from being enticing, and while the characters involved switch between \"realistic\" and \"comical\" in drawing, it does not save it from being hard to watch.\\n\\n\r\nThe character designs follow the same format as the art. That is to say, they are unappealing to say the least. The uniforms for the cast are forgettable, everyone's faces are eerily similar, and the only major difference between characters is their hair and bust size.\\n\\n\r\nAs for actual animation, it's average at best with a minimal amount of it existing. Character movements vary in complexity, but usually with one character moving on-screen at a time. To add salt to the wound, other avoidance techniques are incorporated, such as having dialogue with no one on screen or having the camera zoom out to a large degree.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe downward spiral continues; the cast of Daitoshokan completely fall flat, with zero qualities to separate them from other shows, let alone each other.\\n\\n\r\nAs the main character, Kakei is as generic as they come. Nice, calm, and trustworthy, he enjoys reading to talking any day of the week. Initially hesitant about joining the Library Club, the time he spends with his friends within it cause him to view life in a different way. He starts off being rather reclusive, but by the end, he's willing to help the people who have allowed him to break from his shell. He's as one-dimensional as protagonists go, with his sudden shift from being single to open-minded lost somewhere among the comedy, poor dialogue, and fan-service thrown his (and our) way.\\n\\n\r\nAs the leader of the \"Happy Project,\" Shirasaki is a clumsy yet affable girl. Her determination to make life filled with joy should be lauded. She is quick to be jealous, easily teased, and cute when she doesn't mean to be. The first to have feelings for Kakei, she is not the best at expressing such emotions. Nevertheless, she makes a good effort, making her the main romantic interest in the series. Outside of this, though, she does nothing else. She doesn't contribute to the narrative nor does she provide any insight that wasn't previously made available. She is, more or less, an object.\\n\\n\r\nSenri is arguably the most complex character within the show, but that isn't saying too much. Holding an elegant beauty, her voice is angelic, making her the center of attention even when she doesn't want to be. Her rigorous training and unfortunate past made her become an isolated person. Her development sees her going in the opposite direction as Kakei. That is, instead of doing something for everyone, she starts to do things for herself, proving that there should always be some room for \"me time.\" However, she somewhat rescinds on her new thought process, making it seem as if the realizations she had were for naught.\\n\\n\r\nKodachi is the resident jerk, looking to disrupt the flow of the Library Club. With a large bust and an even larger attitude, her sarcastic remarks and constant joking make her difficult to deal with. Her past and person are shrouded in mystery...with that mystery being discovered within the first episode or two. She is the shining example when it comes to the highly misused \"Shepherd\" idea. If anything, she provided the most laughs and sexiness to the show, making it at least somewhat tolerable.\\n\\n\r\nThe \"kid\" of the bunch, Kana is outgoing and not afraid to swing both ways. She normally refuses to wear her emotions on her sleeve, making her incapable of acting like her true self. She shares a love of books, just as Kakei does, giving her the opportunity to connect more easily with another person. Her past, while sad, provides the reasoning as to why she goes about doing what she does. Unfortunately, after her little and literal episode, she is relegated to the side, becoming another member of the unnecessary harem.\\n\\n\r\nThe last character to mention, since this process is beating a dead horse, is my personal favorite: Tamamo. The classic \"tsundere,\" she holds a trademark fan, both to conceal her embarrassment and to smack about the characters when needed. Among everyone, she tries the hardest (and fails the most) at getting Kakei to notice her properly. What's interesting is just how much she is tossed to the side. Her introduction early on, and sparingly over the course of the season, make it almost seem as if she isn't even a part of the cast at all. Surprisingly, she contributes even less than Shirasaki. Tamamo is just a trope to be filled, a last, lousy attempt to get viewers invested in the characters.\\n\\n\r\nSOUND\\n\\n\r\nThe OP has, like everything before it, a generic beat, making it quite unmemorable. The only good part attributed to the song is the rising and falling note effect, similar to swiping one's hand back-and-forth along the keys of a piano. Other than that, it's not worth hearing.\\n\\n\r\nThe ED is slightly better, with its very slow drumming and vocals. The vocalist is given the opportunity to demonstrate their chops a bit more, too. It's whimsical in nature due to the jingling bells and background singers.\\n\\n\r\nThe soundtrack contains appropriate pieces that fit the mood at hand. Melancholy piano playing and bass/guitar arrangements for more tense situations. Nothing to phone home about when all is said and done.\\n\\n\r\nThe voice acting for the anime is average, with no notable performances to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nI'd be the first one to tell you that romance is great and should be seen by everyone. This show does have these small moments, where the girls hug or otherwise get nervous when around Kakei. It can be cute and funny, depending on the girl involved, allowing for a reprieve that the show desperately needed.\\n\\n\r\nThe rest of the anime is mired in disconnected drama, strange sub-plots, and misshaped character backgrounds. Furthermore, the club's cat, Gizaemon, should never have been included. They try to use him for comedic relief, but it never got a laugh out of me. They never even explain his amazing ability to understand and communicate with speech, but I think at this point, it doesn't even matter.\\n\\n\r\nAs it stands, Daitoshokan no Hitsujikai does not do anything right, or even okay. When it comes to harems and supernatural abilities, other anime out there do it so much better. It's a wonder how this one got green-lit in the first place.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, inconsequential plot, romance trying to be a harem, lackluster theme\\n\\n\r\nAnimation: Bad, boring art style, generic character designs, slightly below average actual animation\\n\\n\r\nCharacters: Bad, cute girls with little development\\n\\n\r\nSound: Bad, bad OP, okay ED, bad soundtrack, average VA work\\n\\n\r\nEnjoyment: Bad, get that cat out of here\\n\\n\r\nFinal Score: 2/10",
            "date": "2014-12-27T11:50:00+00:00",
            "helpful_count": 26,
            "mal_id": 174581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=174581"
        },
        {
            "content": "A Good Librarian is a Good Shepherd:\r\nMINDSET:\r\nFirst glance: seems interesting. Second glance: it failed with the potent material and became Slice Of Life garbage.\r\nSYNOPSIS:\r\nBland protagonist was shown this random ticket from his Dad for no reason. Finds a chick to join her club, thought about it, then joins it with his newly found friends. Now do a bunch of random shtuff to apparently spread happiness for the school. And yeah, there's a supernatural element thrown for no reason.\r\nREVIEW:\r\nFortunately, there was a sense of risk in this project, or at least it tries to be interesting from the first episode with this girl trying to beless introverted with this club she runs. Now this opens up character development with theme for the whole cast, but she then magically loses timidness at the second episode. As if that trait never existed! The rest of the cast seemed to open up to the club too easily after the protagonist joined the party. All of the characters are archetypes, like the cool leader, Kudere, Moe, comic relief etc.\\n\\n\r\nNow the show isn't sold as a complete harem, you have an extra male. But that's it. Seriously, this guy has the least screen time and is completely useless in every aspect of the narrative, coming of as another comic relief cliché. I never cared about him, and the show was fine as a harem.\\n\\n\r\nAt the end of each of the early episodes, we see tid bits of mystery elements; like the school librarian has connections with this mysterious man who has a link to some supernatural thing to the plot. (does anyone notice a Key reference there?) Though it does try to keep the whole mystery aspect a \"mystery\" until the end of the earlier episodes, but does it seem interesting? Yes. Was it well presented? No. Because the show makes it a quirky back drop and its not like in Kokoro Connect when the whole show centres around it, and was used to create humour and drama. Ultimately, it is meaningless, and adds jack to the show.\\n\\n\r\nIf the show were to present the supernatural at some point, effectively, that makes the rest of these episodes (once the whole cast was introduced) seemed like filler. Though it seemed too late for it to have any real effect since you were trudging so many pointless episodes that lead to nothingness, making it poorly handled in that sense.\\n\\n\r\nSimply put, this makes it no more than just Slice of Life with failed elements to hook the critics interest. Since all these factors granting the show of higher value has failed, it does deliver its job well for just being used effectively as the day to day lives of a bunch of teenagers without realism to kill time with. Excluding that, its not worth the watch.\\n\\n\r\nLEGACY:\\n\r\nWhat else was there to say? It has the potential to become something \"a bit more\" but presented it badly. Let it be: Another Slice of Life High School show; that it may fade away to obscurity... Soon we are all hyped for the doushjins!\\n\\n\r\nCRITICAL SCORE:\\n\r\nCHARACTERS: 4/10 - Forgettable archetypes in the long run.\\n\r\nSTORY: 4/10 - Had potential at first. However, it took the safe route instead.\\n\r\nANIMATION: 5/10 - Mediocrity these days.\\n\r\nSOUND: 3/10 - I did not even heard the music, or even knew an OST for this sh*t even existed. OP = Skip it.\\n\\n\r\nFINALE: 4/10\\n\\n\r\nPERSONAL SCORE: (enjoyment)\\n\r\n3/10: I felt nothing as it became a pretty boring yet a watchable watch because of the supernatural tease.",
            "date": "2014-12-29T06:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 174991,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3904273.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Social_Elitist",
                "username": "Social_Elitist"
            },
            "url": "https://myanimelist.net/reviews.php?id=174991"
        },
        {
            "content": "Daitoshokan no Hitsujikai is an anime about Shirasaki, an introvert girl who wants to create the \"Happy Project\" with the help of Kakei who she met in an inconvenient accident with a boob grab in front of the school. The accident happened due to Kakei's seeing the future power. With Kakei and Shirasaki meeting, the two embark a typical school life journey towards the completion of \"Happy Project as they meet new friends. But here's the catch, a mysterious entity called the \"Sheppard\" stirs things up that either helps them or hinders them along the way.\r\nPros:\r\n- Slice of life and Supernatural genre blended well inthe plot\\n\r\n- fun characters (even the cat, which I think is the most interesting lol)\\n\r\n- minimal fanservice\\n\r\n- story pacing is smooth, not confusing\\n\r\n- a happy anime, you will always feel fuzzy inside\\n\\n\r\nCons:\\n\r\n- nothing groundbreaking in terms of story\\n\r\n- visuals are not as good compared to other modern day anime\\n\r\n- typical kindness will get you girls MC\\n\\n\r\nOverall, you can't hate this anime because of it's light-hearted atmosphere that gives you while you watch it. Though you might forget this anime in a month or two because to be frank there are no memorable moments here. If you want to take a break from fanservice or action anime you typically watch, this anime will give you a nice experience.",
            "date": "2014-12-29T05:33:00+00:00",
            "helpful_count": 12,
            "mal_id": 174983,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1550655.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Otaku_Buster",
                "username": "Otaku_Buster"
            },
            "url": "https://myanimelist.net/reviews.php?id=174983"
        },
        {
            "content": "before i start talking about the story i need to clear out something: out of my own experience am sure most of you guys will get the wrong idea of the show when you'll see the anime's cover up there. because the first impression i got of the show when i saw it was another romcom harem that will end up as every harem series. not like it's not true but, there's still a genres tag missing that makes the anime more entertaining. and it is the Supernatural tag.\r\nas most of you may know, the story is set in a prestigious high school academy withover 50000 students. and out of all this huge number, it follows our first main protagonist Kakei Kyoutarou a loner who enjoys reading books as his favorite passion.\\n\r\nhowever, he has a supernatural ability that lets him see the future of some people around him, and also that dragged him out of his peaceful book reading life.\\n\r\nthe nice aspect about the story here is the mystery theme that follows the events of his daily harem life, since our 6 club members get some weird mails from someone called a shepherd, mentioning something about their fate and life.\\n\r\nwhile getting into the story this shepherd secret will have a big impact in kakei's life, or rather his \"fate\" and that will make stuff a little bet complicated since it has a relation with his past self. \\n\r\nnow the one and only thing that didn't look right to me was rushing the events and especially in the last episode where everything will get settled down in the last minute rather than the whole episode. but the ending coveres this matter.\\n\r\n(i'm trying as hard as i could not to split any spoiler while writing~~)\\n\\n\r\nnow to the art and animation. i would like to say the art is unique but the only thing that makes it looks special is the different eyelashes color, and also that beautiful eyes design. as for the character design matter, it doesn't really stand out, most of them resembles some other ones in different series (at least for me) but it is still well done though....and cute. there are some little details that bothered me while watching the show too, like that over brightness in the whole scenes, everything is too bright! or the background drawing that looks kinda old, it just doesn't match with the characters. but i guess all that is because the animation it self was not made to be realistic. it will be nice if it did~~\\n\\n\r\nfor the characters part, it was deceiving. when expecting some different turns of events that will make the show stands out of his harem genre, in the end it's always the same way. 5 or 6 girls of differents types surrounding the main protagonist, who can't make a goddamn decision and choose one heroine. and of course his one and only unpopular friend who helps in bringing the comedy mood. yeah, it's just you're cliche sets of characters that lack development. the worst is it felt like the whole 12 episode were forming a circle because everything in the end got back to the way it was from the beginning, in other word.\"initialization\"\\n\r\nof course it's not only about bad things. there's also that interesting change in the protagonist throughout the series, while trying to choose between his old loner self that only looks for peace, and someone who sacrifices himself to save people and guarantee their happiness. and the reason behind this change has a relation with the shepherd and magic thing again (no spoil desu) and also because of his new friends that changed the world around him.\\n\r\nanyhow, the characters aspect was good enough for a series like this. it had some surprising plot twist sometimes (discovering his sister was....) and didn't ruin the show at all. it was just ....normal.\\n\\n\r\nto be honest, the main reason i choose to watch Daitoshokan no Hitsujikai was because of kakei voice actor. did anyone watch \"is this a zombie\" ? if yea then remember the voice of aikawa ayumu, he is the same as this one.\\n\r\nthe BGM was nice and fitting, but not to the point that ill download it and listen to it, it's not memorable after all. it felt the same way as the visual novel adaptation.  same for the OP and END.\\n\\n\r\nwhen looking back at the whole show with his different aspect it surprises me that it's the least popular one in it's season not to mention the score it was given in myanimelist 7.08. it's kinda disappointing since it deserves more than this. personally i didn't expect a romcom harem show to be this enjoyable at all, even though the adaptation was a little bit faster than it should compared to the visual novel. but yea, adapting 5 different route in 12 episodes is not that easy.\\n\r\noverall i recommend Daitoshokan no Hitsujikai to any romcom harem fan as it feature different aspects in a limited number of episodes.\\n\r\nto end up this review am giving it a score of 7.8 out of 10.\\n\r\nstory 8- animation and arts 8 - sounds 7 -character -7 enjoyment 9.\\n\r\n(this is the first time am posting an anime review^^ so i hope helped some of you make a decision after reading this)\\n\\n\\n\\n\\n",
            "date": "2015-08-03T06:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 195060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4085373.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/reizenchuu",
                "username": "reizenchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=195060"
        },
        {
            "content": "Ah, harems.  One of the most subjective anime genres that exists, as well as one of those that can be both hit or miss.  On this review, I'll b talking about Daitohokan no Hitsujikai which...falls into the latter.\r\nStory (5.11/10): The story of Daitoshokan, or \"A good librarian like a good shepherd\", a boy by the name of Kakei Kyotaro enters a prestigious school with the thought of going to school and sort of delving into the crowd, spending his time in his books.  However, one day, he meets a girl by the name of Shirasaki Tsugumi, and gets invited to her littleplan called the \"Shiomi Happy Project\", in attempt to make the school a wonderful place.\\n\\n\r\nI'll be blunt here.  The story is shit.  And that's kinda putting it lightly.  Like a lot of anime, the show does have a bit of a decent start to it, as well as some pretty interesting story concepts, really, it doesn't really deliver on anything.  There are a couple pluses to this story, but there are a lot more negatives to counterbalance it.\\n\\n\r\nWhat really gives this show something to make it interesting is the concept of the shepherd.  The shepherd is what made the show interesting.  But in addition, it's also a double edged sword.  In the beginning of the series, the shepherd was introduced to be a mysterious character and concept of sorts that gripped the audience.  It was mystery element that made the show a lot more interesting than it was, which, after being told what it was, kinda brought the show to rock bottom.  The shepherd when fully explained, well, \"fully explained\" felt incredibly forced and amateurly done because after the groundwork was placed, the show essentially uproots itself and makes up things in its place, making everything the show created, irrelevant.\\n\\n\r\nAside from the idea of the shepherd, there's really not much story.  Every event in the story feels horrendously forced and it plays out like a generic harem in the sense of all the girls having their own little \"arc\" that doesn't really add up to anything, before going into a story that was even more poorly written.  \\n\\n\r\nIn the end, the show really didn't end up to be more than a gigantic mess.  The ending really didn't do more than bring a happy ending of sorts for this show, which does give it a somewhat positive not on account of the sweetness that the ending did have, but the poorly done story and the show basically rewriting its own plot ideas and previous groundwork put the nail in the coffin to a very, very poorly made show.\\n\\n\r\nOverview:\\n\r\n+/-  Good mystery element at the beginning\\n\r\n-  Awful storytelling\\n\r\n-  Show basically rewriting its own rules\\n\\n\r\nCharacters (5.00/10): Oh boy.  If the story was bad, the characters put the topping on the cake.  While harem shows aren't necessarily known for good characters, there comes a limit as to how bad they can be.\\n\\n\r\nKyotaro Kakei is our main protagonist, and as a harem protagonist, he's not really much to look at.  Kakei simply just wants to write books.  That's kinda it.  He agrees to become part of the Happy project, but aside from that and the so-called \"development\" he gets, which is so cliched and forced that it hurts, there's nothing significant about him.  His goals and his actions often times come into great conflict with one another and it just turns the show into a very big mess.  Not to mention this guy has the personality of a brick.  Do anime chicks like bricks or something?  Cause this guy got like 5-7 girls easy without trying, no problem.\\n\\n\r\nAside from him in the main cast, there is Kodachi, who really should be the main girl and not Shirisaki because comparatively speaking, Kodachi is a much better character.  While formally introduced a little later than all the other characters, Kodachi definitely proves to be the show's best character on account of the fact that she has more personality than everyone combined, as well as her own goals that separate from all the others.  However, she does suffer from the same problems as all the other girls, gaining a very forced feeling backstory that really does things half-assed, as you really only get a tiny, tiny amount of information, leading you to want more, thus making the character incomplete.  She's an interesting character, and really saves the show a bit by being more interesting, but still fails to be anything more than that since there are other girls who take the spotlight.\\n\\n\r\nSpeaking of the other girls, how about them?  Kanasuke, Senri, Tamamo, and Tsugumi are the token harem girls of this series, Tsugumi being the \"main girl\" and the \"end girl\" seeing as how the show apparently took her route.  Nonetheless, I'll just be blunt here.  They suck.  There all have \"personality\", by which I mean stereotypes seeing as how they all reflect on a harem girl stereotype that they don't really depart from.  And, as I have mentioned before, all four of them get an little, ity-bity backstory that doesn't really add very much.  (Like seriously, talking about a character's important moment for like three minutes doesn't count as a backstory.  You need more than that.  Or at least something more than just one of the girls suddenly wanting to tell their problems to  guy they just met a couple weeks ago.)\\n\\n\r\nIn addition, there are two characters that serve roles so stereotypical that it really just hurts to watch, because even they know it themselves.  And those are Takamine, and the cat, King Gaza.  Which serve as the \"best friend character that doesn't get a girl\" and the \"mascot\".  Honestly, it would've been better to just oust these two because they don't even serve as comedic relief.  (Sunohara would be ashamed.)\\n\\n\r\nAs for side characters, well, you can forget them.  Side characters in those show mean nothing, as the amount of screentime combined out of the entire supporting cast equates to about 20 or so minutes.  You don't really understand them, you don't get why they do what they do, they just serve as confusion for the audience because it's obvious that the show didn't even try to incorporate them into the story well, opting just to throw them in at random times.\\n\\n\r\nOverview:\\n\r\n-  Awful MC protagonist (even by harem protagonist standards)\\n\r\n-  Harem troupe girls that aren't very interesting\\n\r\n-  Useless stereotype characters that didn't serve much purpose\\n\r\n-  basically unknown supporting cast\\n\\n\r\nArt and Sound (7.11/10 and 6.99/10):  Honestly, the aesthetics are the only real high point of the show, and that's not a good thing when taking a look at the individual category scores.  \\n\\n\r\nThe art is bright, it's whimsical, it's...meh.  There's not really much to look at, really.  The art serves its purpose by being pervert bait, as the show does often enough show off its jiggle physics with Kodachi and Tsugumi.  In addition, the show, being drawn in a cutesy moe style, doesn't really do much beyond well, being a cutesy moe style.  The art serves its purpose, giving a decent visual experience to the viewer, but really nothing else\\n\\n\r\nThe music is also meh.  The opening while yes, has gotten stuck in my head on some occasions, doesn't have anything to offer, period.  It's a generic track, kinda like its ending, and are just these nice to listen to, but not memorable cutesy anime tracks.  If you want to skip them, go ahead, they're not really worth listening too.\\n\\n\r\nOverview:\\n\r\n+/-  Meh art\\n\r\n+/-  Meh music\\n\\n\r\nPersonal Enjoyment (5.99/10):  I love harem.  There, I said it.  I really enjoy harem shows.  The ludicrous idea of having a bunch of girls surrounding one guy just makes me smile for some reason.  However, there does come a breaking point where a show that can be tolerable to watch (since I have a decently high resistance to the amount of crap I can watch) to something that's just honestly, quite unbearable.\\n\\n\r\nDid I like this anime?\\n\\n\r\nIn the beginning, I admit, I was enthralled to some extent.  I knew at the time, it was going to turn into a generic harem, but I thought the idea of the shepherd was going to save the show to some extent.  It didn't.  It only confused me even more and gave me a bad feeling.  Although, I admit to liking Kanasuke as a character.  I dunno, characters like that appeal to me.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nLet's run through the list here.  The entire plot, how they screwed up their own \"Shepherd\" idea, the characters.  What did I miss?  Oh yeah, the pacing was awful.  In the beginning, the show as kinda slow.  But towards the end, the show rushed by so many things, that the entire thing fell into the realm of mediocrity.  Not to mention how forced the development, the story, and the romance was, making the entire thing so much less enjoyable to watch.\\n\\n\r\nWould I recommend this show to anyone?\\n\\n\r\nDaitoshokan is the Fall 2014 equivalent of Glasslip.  (Now you may shriek in terror.)  While compared to Glasslip, the show trades aesthetics and a decent soundtrack for a somewhat easier to follow story, in the end, it's still not worth your time.  I seriously want the time I spent watching this back.  So...don't even put this one on the list, folks.  It ain't worth it.\\n\\n\r\nOverall Score: 5.48/10",
            "date": "2014-12-26T03:44:00+00:00",
            "helpful_count": 8,
            "mal_id": 174349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=174349"
        },
        {
            "content": "Feliz Navidad, muchachos! You know the moment I've watched this.................thing, well, I could say plot wise it was good. It kinda have some similarities with the movie \"The Adjustment Bureau\" where shepherds does the job of guys with hats and that instead of a door to another portal , in this anime it was books. Here the main protagonist Kakei is a just a regular guy who is just another one of those bookworm characters who somehow got involve with  Shirasaki's \"Happy Project\" and where his simple  and ordinary life starts to go upside-down and he and his club members/ harem wonders aboutthe mystery behind the messages left by a certain individual called the \"Shepherd,\" thought Kakei doesn't know yet, he is an unwilling player of the 'Shepherd\" which is also initiated by his half sister and Shepherd wannabe, Nagi, which for me it does add something good for the anime's plot, but, most of the time, everything were just utter random cliche situations where the main focus was on the members of the Library Club and  Shirasaki's \"Happy Project\" than anything else. So, my ratings:\\n\\n\\n\r\nStory\\n\\n\r\nI'm gonna go with 5 and just refer to the explanation above.\\n\\n\\n\r\nArt\\n\\n\\n\r\nI'm gonna apologize to everyone, cu'z this anime's art was basically just cliche eye candy, there maybe some limited fanservice, but realistically this anime or manga where just banking on such eye candy thing, so it's a 5 for the art. \\n\\n\\n\r\nSound\\n\\n\r\nWhat I like about it:\\n\\n\r\n-  The VA's who did the voices of; Shirasaki, Kodachi, Sakuraba, Kakei, Kana and Ikkei. \\n\\n\r\n- I like the opening and closing theme\\n\\n\r\n- I also like the VA who did Misono's voice, but not when she is doing opera.\\n\\n\r\nBut:\\n\\n\r\n-The cat Gizaemon, should have just meow, than to have some one line speaking lines. \\n\\n\r\n-My rating, a good 7.\\n\\n\\n\r\nCharacter:\\n\\n\r\nOk let's go to some of the characters, btw, I gonna give this part an 8:\\n\\n\\n\r\nKyoutarou Kakei, ok, so he maybe the usual harem guy, but he is one usual harem guy that I like, though a joy killer, I really like that he get's int situation where he has to this dark horse who has to help people that the library has set him to do. Also, , I like the short moment where he and Shirasaki where intimate.\\n\\n\\n\r\nTsugumi Shirasaki, ok, she is this usual pesky nice girl who gets into the guy's life and turns it upside down, but then again, I like her. I like the way how she diligently tries her best to make her happy project to help others in a way that she has this sweet touch where everyone feels a certain comfort around her. Despite of her being a klutz, it is that thing which gives her character a certain charisma.\\n\\n\r\nNagi Kodachi, as much as I hate to say it, she is one heck of a train wreck where her character is a mystery, where at one point she isn't gonna be a shepherd and in the end she becomes one, also detail about her in the manga seemingly conflicts her character in the anime (btw, I've only gone to just  couple of chapters in the manga), never the less, she the quintessential girl who should have a brocon on Kakei.\\n\\n\\n\r\nMisono, Kana and Tamamo, well they're just the usual harem member, that I kind like.\\n\\n\\n\r\n Ikkei Takamine, I kinda pity that character for not having a slice of the harem pie, if he can have one he should be with Tamamo or with Maho.\\n\\n\\n\r\nEnjoyment\\n\\n\\n\r\nBasically it was enjoyable when I see the harem members competed for the guys affection, also the intimated moment that Shirasaki has with Kakei and how Kakei saves Shirasaki from a death flag. But most of all,  the sweet moment when the two met back stage where Kakei seemingly is saying goodbye to Sjirasaki, where I'm giving this a 7.\\n\\n\\n\r\nOverall\\n\\n\r\nTbh, it's a 1, since the concept having somekind of secret magic library in school whose functions has some similarities with the 2011 movie \"Adjustment Bureau\" was just too fancy for an anime whose plot revolves around the members of the \"Library Club\" and Shirasaki's Happy Project. To add some kind of magic element in this anime was more like a miscellaneous thing that just adds to some complications with the anime's story. So amigos, have fun watching the eye candy that this anime provides.   \\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-12-25T10:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 174249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4212159.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 1,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tres_Bandidas",
                "username": "Tres_Bandidas"
            },
            "url": "https://myanimelist.net/reviews.php?id=174249"
        },
        {
            "content": "In my anime List I rated 9 but overall objectivly I think its an 8.\r\nThis will be the most simple review that I will do in any anime I personaly reviewed.\r\nSo when I finished this anime wich was a few minutes when Im done with this review my first thoughts on it were \"How did I missed this\" cause it was just that good IMO. The story is interesting I think it focuses on some Japanese Folklore probably other cultures but lets say its Japanese on something called the Sheperd, and the Sheperd consists on some Transcendent Being that helps people be happy while takingcontrol of theyr fate, cause they can see the future, past and everything a person has done when something is about to go wrong lets say an accident, the Sheperd takes action to save that person. All that Information are in books and our MC is a Bookworm wich makes him a Sheperd Candidate, so for 12 episodes its his \"persona adventure\" where he meets people and cultivates his friendships with them learning about theyr pasts and stuff. But for one to became a Sheperd a sacrifice has to be made and that is to became an existance who everyone forgets. So find out if he becames one or not you wont regret watching this. At least consider adding this to your planning to watch list when you have the time.\\n\\n\\n\r\nAbout the Characters each character is unique, the girls, wich made me not feal bored and distinguish each and every one of them. Also the MC is pretty smooth like a persona MC and goes along with some stuff and says funny stuff to get a reaction from the girls. Also im sure he is not stupid, like not at all he is top student in a prestige school or whatever and is pretty sharp as well, I think he just acts dumb towards the girls or has you progress and learn more about him trust issues. Yes this is a Harem one.\\n\\n\\n\r\nThe Art is nice made by Funanimation but I dont think that has to do with anything but Im ignorant towards that stuff so Ill apologise and get back on the subject. The art is well done and the humour with the characters its funny as well when they make the expressions and stuff like that.\\n\\n\\n\r\nI thought this was gonna be a simple review but it turned quite long, As for my personal enjoyment and recommendation:\\n\\n\\n\r\nYes! I do recommend this and as I said it before at least consider adding this to you Planning to watch List as for the enjoyment Yes! I did quite enjoyed it myself giving it a nice round 9. This deserves a sequel!\\n\\n\r\nSorry for the bad english hope that this Helps when your looking for a good one to pass the time at least.",
            "date": "2017-12-31T09:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 266989,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4911515.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Slivko",
                "username": "Slivko"
            },
            "url": "https://myanimelist.net/reviews.php?id=266989"
        },
        {
            "content": "Its been a while since I wrote another \"review\". Oh well...\r\nThere is nothing wrong or right about this anime. Its another harem where MC is being liked by everyone and is the best because the writers said so. The story is sort of interesting and there is potential here, though I feel its squandered on the harem genre.\r\nI liked the characters though there is nothing special about them. The MC is also nothing special, maybe the whole reading books is kind of cute, in a nerdy way. I like it, its nothing special.\r\nYou aren't missing much by not watching this, but its a cushion anime- made to comfortably fit around your fat ass. Its a comfort zone thing, like a bowl of chicken soup. Can't critique a bowl of hot soup for being bland when you got a cold right? I feel this anime is the same way. If you feel kind of down, this anime should make you shamefully admit you kind of like it. And I guess that is its purpose.\\n\\n\r\nI like, I recommend others watch it.",
            "date": "2017-03-22T16:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 243180,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=243180"
        },
        {
            "content": "Even if the Sepherd thing spices up the story, there was no good connection between this and the realife those students follow. \r\nMaybe that happened because the anime is 12 ep long, and the only option was to cram it all up and make it shallow.\r\nPros:\r\n  The harem it was, I expected girls with a variety of personalities, just flirting with the main character, not evolving. Most of them learnt something with their interaction with him, and developed.\r\n  The main character wasn't a wuss, but a normal intellectual, although after the 3rd episode he started behaving like a typical boring, clueless,harem protagonist.\\n\r\nCons:\\n\r\n  The library environment was warm and cute, but there wasn't enough screen time to feel like you were there with them, even if the place was precious to them. So it ended up being just a backround for their meetings, which I didn't appreciate.\\n\r\n  The sound and art were mediocre, except from the singing girl, which again didn't have an impact because it wasn't developed correctly. \\n\r\n  None of the characters had an impact on me in general. Their personalities were weak, or so they seemed to me.\\n\\n\r\nI don't consider this anime a must watch.\\n",
            "date": "2018-11-18T00:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 294273,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3975607.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ReikaUchiha",
                "username": "ReikaUchiha"
            },
            "url": "https://myanimelist.net/reviews.php?id=294273"
        },
        {
            "content": "a story simply curious but in the end a rather big disappointment, from a neutral point of view if the story had risen what it raised in the end would have been more interesting, the story begins with a fairly common development but progressing begins little by little to improve good until the chapter 7 where we put that lighting with such mediocre results that I hurt to see it, the series has enough decency in animation as soundtrack I find it very good people are quite direct but as they fall in love with our protagonist I found it easily bad, in conclusion aseries of romance with comedy with an acceptable but demagrated story in my opinion would say that it has been a series of the heap",
            "date": "2018-11-05T14:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 293457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7275466.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/theotakuparade",
                "username": "theotakuparade"
            },
            "url": "https://myanimelist.net/reviews.php?id=293457"
        },
        {
            "content": "This series made me realize just how many harem series I've watched, to the point of knowing what the series was gonna end in just a few episodes. But for some reason, I enjoyed it a lot.\r\nThis was perhaps because of its concept of \"having the ability to see the future\" without anything relating to time travel. Also, its idea of becoming a being who can change the fate of a person to create a better world is not something anyone can come up of on the fly. I swear, this series had potential... if only it didn't become a harem series.\r\nThe reason why Ithink harem broke my interest for this series is because it didn't even need to have a harem tag in the first place. It would've been fine as simply \"a boy who had the ability to change the fate of humans\". But no, they just had to add that tag. Personally, it would've done well even without the harem tag. There was already romance, so bringing in other girls to the story just makes it a nuisance. \\n\\n\r\nI gotta say though, the animation and art style was really smooth. It wasn't so rough or full of highlights or shades. Because of that, the show maintained a light atmosphere.\\n\\n\r\nOverall, it wasn't a bad series. I'm just pissed off that they placed a tag that shouldn't have to be there in the first place. Doesn't matter if you like or hate harems though, because when you watch it, you'll just want to become a shepherd.",
            "date": "2016-11-15T03:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 233784,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=233784"
        },
        {
            "content": "Story- Had potential but, the characters never get developed. The romance is terrible. All the girls like the MC but, are to pansy to say it. They try to give them compelling stories that i didn't care for. You feel like it's going to turn into a harem but, we don't even get that. The real story is barely explained and can be completely ignored. The ending is very cheap and unsatisfying. 4/10\r\nArt: Meh, slightly below average not amazing, but nothing to cry over. 4/10\r\nSound: Don't remember a single track (Just finished it 7 minutes ago) Sound effects were average. Great voice acting. 4/10\r\nCharacters: Theonly character's I found interesting were Nagi Kodachi,(Really funny and with a interesting past and Kyoutarou Kakei (Same) Every one else is to cookie cutter. Same boring tropes x10! MC's really irrelevant, comedic relief friend? Check!  Super serious girl? Check! Underclassmen who are always coming onto the MC? Check! 5/10\\n\\n\r\nEnjoyment: I enjoyed it at the beginning expecting it to get good later on because they kept hyping up these shepherds. Was super let down. At episode 11 was just rushing to finish this. 5/10\\n\\n\r\nTLDR: Don't waste your time on this anime. Instead I recommend Trinity seven, fruit of grisaia, haganai, my teen romantic comedy or even high school dxd, if you're into this type of anime. Just STAY AWAY FROM THIS ONE 4..2/10 IGN would not watch again.  \\n\\n\\n\\n",
            "date": "2018-02-05T01:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 270700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6505357.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheRealNormie",
                "username": "TheRealNormie"
            },
            "url": "https://myanimelist.net/reviews.php?id=270700"
        },
        {
            "content": "I watch this anime because I like anime about a bunch of cute schoolgirls with male lead as the center of attention. If you like Grisaia No Kajitsu you might like this but I doubt you will enjoying this because I think some of the episode are so so boring, and its totally different compared to serious Grisaia, this is a not-so-comedy anime. I intend to drop this anime since episode 10 but there is always something interesting happen towards the end so I cancel my decision and give this a try and to be honest its so tiresome. For me, a plot about abookworm who wants to be a shepherd, a shepherd here mean a person who hold a book of fate of all people in the world and they have a power to change the fate. This is what the MC have here but I think this suppose to be main plot is just a subplot because they are not really focused on that shepherd stuff, only a few episode cover it, other than that just some random episode about every girl problem that MC will help to solve. I love the hint of romance but I don't think shojo lover will come to love this anime because its totally just some another subplot, but sometime its cute. If you like harem-little ecchi anime you might like this, but you know you must try hard to love this anime because for me its really slow and boring sometime.",
            "date": "2015-02-12T16:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 180214,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4398513.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/esofdiamon",
                "username": "esofdiamon"
            },
            "url": "https://myanimelist.net/reviews.php?id=180214"
        },
        {
            "content": "Daitoshokan no Hitsujikai is a cute slice of life series with a very interesting topic that is unfortunately not expanded on enough.\r\nStory - 7/10\r\nThe story doesn't really develop much until the later episodes, and though it felt rushed I quite enjoyed the idea that the plot was trying to create. Unfortunately with as short as the show was, I felt like there wasn't enough time to fully enjoy it.\r\nArt - 5/10\r\nI must say that the artwork for the series did not stand out very much. Had it not been for the PV's I saw I might've skipped over the series without a second glance. There'snothing special about it.\\n\\n\r\nSound 6/10\\n\\n\r\nThe soundtrack also did not standout too much. The opening and ending songs were cute to say the least.\\n\\n\r\nCharacter - 6/10\\n\\n\r\nI give the characters a 6/10 because they were fairly generic and could have been pulled out of any other visual novel adaptation, but combined with the plot of the anime I feel like there was a lot of untapped potential for character development.\\n\\n\r\nEnjoyment - 8/10\\n\\n\r\nThe show is definitely a decent watch. The characters, though uninspired, were cute to watch, and the plot makes you think a little.\\n\\n\r\nOverall - 7/10\\n\\n\r\nOverall, the show is decent. Not much can be said about a show that had its plot rushed within the second half of a series that is only 12 episodes. Its a decent slice of life series at the most.",
            "date": "2016-08-22T15:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 227358,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5357154.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WhipQueen",
                "username": "WhipQueen"
            },
            "url": "https://myanimelist.net/reviews.php?id=227358"
        },
        {
            "content": "What would you do if you could sense the future? I don't mean the fake future as in Glasslip but the real future like in Kara no Kyoukai Mirai Fukuin. Well, in the world of Daitoshokan there is a secret Men In Black type organization that wields magic and can guide people to a \"good\" future. This organization of \"shepherds\" takes an interest in our particular protagonist, a bookworm named Kyoutarou, who happens to save an innocent bystander from a horrific future, and ends up conveniently fondling her in front of a massive crowd just for good measure.\r\nDaitoshokan is the latest August work to beturned into an anime following Fortune Arterial. While the shows share some similarities (harem and school based slice of life elements), the story in Daitoshokan is much less organized and builds to a not-so-interesting climax. If you're looking for anything above an average slice of life show this is going to disappoint. The overall work is passable but quickly forgettable.\\n\\n\r\nAnimation:\\n\r\nThe animation quality is only average at best. The animation isn't particularly crisp and backgrounds are bland and have a characteristically painted style. The characters themselves are drawn well with a style that focuses more on moe than maturity. Tsugumi sometimes has this happy carefree look that reminds me of Tenma from School Rumble. Expressions are fair overall but nothing out of the ordinary. The standout character in this show is actually probably the cat. Seriously, the cat has more personality than over half of the supporting cast.\\n\\n\r\nThere isn't much action in this show though, as alluded to in the introduction, there is a fair amount of light ecchi. There isn't enough to really tag this overall as ecchi but expect a few suggestive scenes and conversations nonetheless.\\n\\n\r\nSound:\\n\r\nThe show opens with a light and relatively quick-paced pop piece though the melody isn't anything special. The ED is a slightly more memorable piece with a good beat and melody. The BGM is composed of standard fare supportive but forgettable pieces.\\n\\n\r\nThe VA cast is mixed on this one. Madoka Yonezawa comes from the lead in White Album 2, but unfortunately not in a singing role. A lot of the other VAs are relatively junior and don't give their characters a great deal of depth; it's not completely their fault though given the nature of the story.\\n\\n\r\nStory:\\n\r\nOur protagonist is a smart loner who prefers books to the trouble of dealing with others and their facades; he feels that everything to be learned is written in books. This ridiculously naive premise is quickly blown away when the girl he rescues and fondles suddenly asks him to join the \"Happy\" club. Not understanding what could possibly motivate her, Kyoutarou decides to humor her. A few small projects later, the club has grown into a fully-fledged harem for Kyoutarou, plus a useless but obligatory male friend. However, as he grows closer to this new group of friends, he struggles with whether or not to use his future-sight abilities to guide everyone to a \"happier\" future. Will he sacrifice himself to help everyone else?\\n\\n\r\nWhile not necessarily a bad premise to start on, this story tries to tackle too many genres and issues at the same time. Unlike Fortune Arterial where there was a clear, central plot and a primary heroine, this show has multiple tangential stories going on concurrently with different heroines. In addition, the entire secret organization and future-sight ability isn't developed in an appealing fashion and fails to involve the viewer to the same degree as the vampire concept in August's previous work.\\n\\n\r\nThe story is a mix between episodic character introductions and generic slice of life school events. There is a random tension introduced around half way through the series that eventually somehow develops into the very unnatural climax. The show then concludes in a copout manner; let's just say that I felt as betrayed as the ending to Shana 3.\\n\\n\r\nCharacter:\\n\r\nProtagonists in general have gotten a bit better about being slow and overly soft. However, they still are as slow as ever when it comes to love. To make matters worse, the heroines feel rather generic and shallow. Though they each get their own arc, their interactions with the protagonist never feel genuine, and relationship development is all but missing. There is a bit of character development but it's spread so thinly between the characters that the value is greatly diminished. As I said before, the cat is probably your best bet for entertainment.\\n\\n\r\nValue:\\n\r\nOverall, this is an average at best slice of life. The characters lack depth and the story is neither engaging nor focused. This series is one shepherd that the sheep will avoid, and you should too unless you are really out of things to watch.",
            "date": "2015-11-04T23:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 202709,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202709"
        }
    ],
    [
        {
            "content": "The idea in which equating popularity to greatness is disappointingly common in our modern world. Many people will claim that 50 Shades of Gray is high quality literature and many others will consider Drake to be a great rapper. They are blinded by the delusion that something being popular automatically makes it good. Obviously those people have never looked further into the media that they claim to be an aficionado of and have never read Infinite Jest or listened to Yung Lean before. This leads to Daitoshokan no Hitsujikai, an unfortunately overlooked show in the Fall 2014 season. It did not stand out and thepublicity was nearly nonexistent. However, if you were one of the people who decided to give the show a try, you were in for quite a treat. You would have experienced a coherent plot, enjoyable characters, entertaining drama, and an overall comfy feeling that viewers have not experienced since Non Non Biyori last Fall. The fact that people would rather discuss popular, yet mediocre shows is downright depressing. It brings back bad memories of last Summer when a terrible Adam Sandler movie beat out Pacific Rim in the box office for that weekend. Regardless, those of you who overlooked this show have a chance to redeem yourself if you change your ways and look to the less popular and more obscure things in life. Following that ideal will take lead you closer to the path of enlightenment.\\n\\n\r\nThe overall story for Daitoshokan no Hitsujikai was nothing extraordinary or groundbreaking. It compares to other typical club-type shows where you find both drama and comedy as the main ideas. A word that would describe the story would be “unoffensive”. It was rather soothing and made the viewer feel comfortable when watching it. The overall arching plot was a typical slice of life show with a bit of a supernatural twist added in, but that is once again typical for this genre of visual novel from which the show was adapted from. The story itself could have been more fleshed out, but that would not have been easily done with the time constraints of a 1 cour show. The pacing was also quite well done, it did not drag or feel boring at any time and gave the viewer a relaxed or comforting experience. The fact that the show was adapted from a visual and had such a comforting feel to it is rather unique. Many times visual novel adaptions are rather fanservice driven or focus mainly on the exciting action related parts of the game. That being said, Daitoshokan no Hitsujikai was not without fanservice (it had plenty), it just came off in a bit more subdued and enjoyable than the typical smut that you would expect to see. It did not feel out of place or forced into the story to sell more Blu Rays, it just had an overall natural feel due to how the story was told and how it was directed.\\n\\n\r\nOne aspect of this show that was rather interesting was the studio choice. Many people will remember Hoods Entertainment as a studio that did some of the most obscene fanservice shows that have aired on regular television. However, it seems that they have turned over a new leaf since their latest projects have not been lewd at all. It is a strange change of pace to go from doing Manyuu Hikenchou or Seikon no Qwaser which were over the top in terms of smut to the rather tame and pedestrian shows that they have done in recent history. Regardless, Daitoshokan no Hitsujikai was a rather pleasant show to look at. It featured a pastel color theme and the overall quality of the show was relatively high. Once again, the term that describes it best is “unoffensive”. That would also describe the sound for the show. The voice actors used were the same from the game which are commonly heard in visual novels. Experienced viewers will recognize a few voices, especially if they read visual novels. Regardless, the voice acting was well done and felt natural for the show. The OST and sound direction was also perfectly acceptable, it had that typical visual novel flair to it which fit the mood of the show perfectly. It definitely added to the comfortable feel that the show gave off.\\n\\n\r\nIn regards to characters, Daitoshokan no Hitsujikai did not feature anything special in particular. The cast was composed of rather cut and paste type characters with various back stories to give them some sort of depth. Obviously, the anime viewer would not see their full stories since it is not the original source material in which the reader would go through an entire route dedicated to all of the main characters, but it was easy to pick up on the various drama points and other traits from what was shown. However, what stood out for this show was the character interaction. That was top notch and it really felt like the characters had chemistry with each other. It was incredibly well done for this type of show and it really made it incredibly enjoyable to watch.\\n\\n\r\nWhen looking at the complete package of Daitoshokan no Hitsujikai, it is hard to consider it to be anything but enjoyable. The fact that it was one of the least popular and overlooked shows for the Fall 2014 season is rather disappointing. However, that may be for the better. The discussion and subsequent translation project for the visual novel were in part done due to the smaller and tight knit community that enjoyed watching this show. Regardless, if you are looking for something enjoyable that you can sit back and relax to, Daitoshokan no Hitsujikai would be an excellent choice. It goes to show that it does not matter if something is relatively overlooked, it could end up being better than many high profile options. That being said, the moral of this review is look in unlikely places and you will find true hidden gems. Worshiping nothing but mainstream media is a terrible habit and you should try to think outside the box more often. Once you do, you can appreciate more things and even find enjoyable stories in unlikely places. Or in terms more suited to Daitoshokan no Hitsujikai, don't judge a book by its cover. \\n",
            "date": "2014-12-25T11:56:00+00:00",
            "helpful_count": 92,
            "mal_id": 174263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/283056.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/McRib",
                "username": "McRib"
            },
            "url": "https://myanimelist.net/reviews.php?id=174263"
        },
        {
            "content": "Initially, I'd written a review halfway through the show, now that I've completed it, here's an updated version.\r\n Firstly, this is very much a slice of life show. If you're not a big fan of those, you may not want to watch this one. I enjoy slice of life, romance, comedy, fantasy, sci-fi, and other light-sided genre, so it appealed to me.\r\nThis show also incorporates a fantasy element - a magic library. I won't go into a lot of detail, so as not to ruin the story, but this library (while only briefly and periodically mentioned) is a theme that is important to everycharacter in the show (but two, specifically). Your Main Character, Kakei, is seen having premonitions right from the get-go. He has this strange, but imperfected, ability - which he uses mostly to save people. The First girl he saves using it (Shirasaki) was distributing flyers to start a club with the unspecific goal of 'making people happy' at the time, and later invites him to join her and her friend. The club grows in size and popularity as the show continues, as does the back story and magic library information. \\n\r\nThe characters are pretty fun to watch, their interactions are light-hearted and fluffy, but there are some tensions here and there between some of the side characters and the main characters. There is also the typical 'harem-style' anime theme of 'who does the MC really love?!' going on between the main female characters. The show doesn't have any naughty bits exposed, but there are some brief nudity scenes and some suggestive humor, but it is mostly a clean, happy romantic-style slice of life with little drama. Perfectly suited for sitting back on the couch or bed and relax while watching. You don't have to think too hard to follow the story.",
            "date": "2014-12-27T12:04:00+00:00",
            "helpful_count": 35,
            "mal_id": 174583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3798557.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gilder1985",
                "username": "gilder1985"
            },
            "url": "https://myanimelist.net/reviews.php?id=174583"
        },
        {
            "content": "everything about this anime was fine, just fine. the story was fine, the characters were fine, the art was fine. truly mediocre and the genre of this mediocre anime is school/harem/magic/slice of life. \r\nstory: kakei(the main character) reads books to not be scared of anything and his goal is to find the magic library. sounds somewhat interesting. nope it is not.\r\nart: average just average. \r\nsound: average.\r\n characters: typical harem.....their looks are average. also the MC is boring.\r\nenjoyment: average. i know i used that word a lot, but it perfectly describes this anime. never really laughed hard or smiled much or thought i cant wait tillnext episode.\\n\\n\r\noverall: do not recommend. its boring.\\n",
            "date": "2014-12-24T11:00:00+00:00",
            "helpful_count": 33,
            "mal_id": 174047,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ironcarrot2",
                "username": "ironcarrot2"
            },
            "url": "https://myanimelist.net/reviews.php?id=174047"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nDuring high school, it's a time to really start thinking about one's future: pursuing higher education, finding a part-time job, volunteer work, and extracurricular activities are all in the realm of setting one up for a successful life later down the road. Along the way, friends are made and decisions are chosen. Sometimes, though, teenagers need that tiny extra \"push\" to get them going down the right path. Daitoshokan no Hitsujikai will most definitely \"be telling this with a sigh\" that the path they took was \"the one less traveled by.\"\r\nSTORY\r\nDaitoshokan follows the life of Kakei, a younghigh school boy who, one day, saves Shirasaki from a fatal accident. Their newfound friendship causes them to form a group known as the Library Club.\\n\\n\r\nWhat's unfortunate with Daitoshokan is in its handling of the major plot device at play. Known as the \"Shepherd,\" it is designed to be an important aspect of the show. However, it is never perceived as such. The first half of the anime consists mainly of character introductions, which is perfectly reasonable. But the characters themselves are largely uninteresting, and coupled with the fact that the foreshadowing is handled so poorly causes the big reveal to be rather small. Even worse, it never elaborates much on the \"Shepherds\" either, making one not understand the full extent of their powers. When the second half of the season begins, it then fails to utilize this established plot device effectively. It is used quite sparingly, causing its use to hold no weight, drama, or emotional attachment. Simply put, this anime is exactly the same with or without the idea that is supposed to separate it from other shows.\\n\\n\r\nWhile Daitoshokan is considered a romance anime, it never tries to be. Instead, it's confused as to whether it wants to pursue a single, established relationship or have all the girls involved be potential suitors. In other words, it can't decide if it wants to be strictly romance or strictly harem. This causes a lot of the scenes to feel segmented; the continuity between differing events doesn't exist because the anime is always flip-flopping between both ideas, without coming to a clear solution.\\n\\n\r\nAt its core, the anime is about doing something for yourself versus doing something for others. It's an important life lesson that is usually learned at an early age. And there are similar ways to describe it: \"it's about giving, not receiving,\" \"treat others as you would want to be treated.\" The problem is that the show never really attempts to demonstrate such an idealistic message. It may come about as dialogue, but the actions that Kakei and the others take never fully demonstrates their movements as such. It all feels worthless, that the events taking place are neither for a single person or for a group of people; they're just there.\\n\\n\r\nANIMATION\\n\\n\r\nDaitoshokan continues its trend, having a tough time in the art and animation department.\\n\\n\r\nThe art style is wholly uninspired. It is boring, generic, lacking detail, plain, unadventurous, pretty much any adjective that places it in a negative light. The environments refrain from being enticing, and while the characters involved switch between \"realistic\" and \"comical\" in drawing, it does not save it from being hard to watch.\\n\\n\r\nThe character designs follow the same format as the art. That is to say, they are unappealing to say the least. The uniforms for the cast are forgettable, everyone's faces are eerily similar, and the only major difference between characters is their hair and bust size.\\n\\n\r\nAs for actual animation, it's average at best with a minimal amount of it existing. Character movements vary in complexity, but usually with one character moving on-screen at a time. To add salt to the wound, other avoidance techniques are incorporated, such as having dialogue with no one on screen or having the camera zoom out to a large degree.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe downward spiral continues; the cast of Daitoshokan completely fall flat, with zero qualities to separate them from other shows, let alone each other.\\n\\n\r\nAs the main character, Kakei is as generic as they come. Nice, calm, and trustworthy, he enjoys reading to talking any day of the week. Initially hesitant about joining the Library Club, the time he spends with his friends within it cause him to view life in a different way. He starts off being rather reclusive, but by the end, he's willing to help the people who have allowed him to break from his shell. He's as one-dimensional as protagonists go, with his sudden shift from being single to open-minded lost somewhere among the comedy, poor dialogue, and fan-service thrown his (and our) way.\\n\\n\r\nAs the leader of the \"Happy Project,\" Shirasaki is a clumsy yet affable girl. Her determination to make life filled with joy should be lauded. She is quick to be jealous, easily teased, and cute when she doesn't mean to be. The first to have feelings for Kakei, she is not the best at expressing such emotions. Nevertheless, she makes a good effort, making her the main romantic interest in the series. Outside of this, though, she does nothing else. She doesn't contribute to the narrative nor does she provide any insight that wasn't previously made available. She is, more or less, an object.\\n\\n\r\nSenri is arguably the most complex character within the show, but that isn't saying too much. Holding an elegant beauty, her voice is angelic, making her the center of attention even when she doesn't want to be. Her rigorous training and unfortunate past made her become an isolated person. Her development sees her going in the opposite direction as Kakei. That is, instead of doing something for everyone, she starts to do things for herself, proving that there should always be some room for \"me time.\" However, she somewhat rescinds on her new thought process, making it seem as if the realizations she had were for naught.\\n\\n\r\nKodachi is the resident jerk, looking to disrupt the flow of the Library Club. With a large bust and an even larger attitude, her sarcastic remarks and constant joking make her difficult to deal with. Her past and person are shrouded in mystery...with that mystery being discovered within the first episode or two. She is the shining example when it comes to the highly misused \"Shepherd\" idea. If anything, she provided the most laughs and sexiness to the show, making it at least somewhat tolerable.\\n\\n\r\nThe \"kid\" of the bunch, Kana is outgoing and not afraid to swing both ways. She normally refuses to wear her emotions on her sleeve, making her incapable of acting like her true self. She shares a love of books, just as Kakei does, giving her the opportunity to connect more easily with another person. Her past, while sad, provides the reasoning as to why she goes about doing what she does. Unfortunately, after her little and literal episode, she is relegated to the side, becoming another member of the unnecessary harem.\\n\\n\r\nThe last character to mention, since this process is beating a dead horse, is my personal favorite: Tamamo. The classic \"tsundere,\" she holds a trademark fan, both to conceal her embarrassment and to smack about the characters when needed. Among everyone, she tries the hardest (and fails the most) at getting Kakei to notice her properly. What's interesting is just how much she is tossed to the side. Her introduction early on, and sparingly over the course of the season, make it almost seem as if she isn't even a part of the cast at all. Surprisingly, she contributes even less than Shirasaki. Tamamo is just a trope to be filled, a last, lousy attempt to get viewers invested in the characters.\\n\\n\r\nSOUND\\n\\n\r\nThe OP has, like everything before it, a generic beat, making it quite unmemorable. The only good part attributed to the song is the rising and falling note effect, similar to swiping one's hand back-and-forth along the keys of a piano. Other than that, it's not worth hearing.\\n\\n\r\nThe ED is slightly better, with its very slow drumming and vocals. The vocalist is given the opportunity to demonstrate their chops a bit more, too. It's whimsical in nature due to the jingling bells and background singers.\\n\\n\r\nThe soundtrack contains appropriate pieces that fit the mood at hand. Melancholy piano playing and bass/guitar arrangements for more tense situations. Nothing to phone home about when all is said and done.\\n\\n\r\nThe voice acting for the anime is average, with no notable performances to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nI'd be the first one to tell you that romance is great and should be seen by everyone. This show does have these small moments, where the girls hug or otherwise get nervous when around Kakei. It can be cute and funny, depending on the girl involved, allowing for a reprieve that the show desperately needed.\\n\\n\r\nThe rest of the anime is mired in disconnected drama, strange sub-plots, and misshaped character backgrounds. Furthermore, the club's cat, Gizaemon, should never have been included. They try to use him for comedic relief, but it never got a laugh out of me. They never even explain his amazing ability to understand and communicate with speech, but I think at this point, it doesn't even matter.\\n\\n\r\nAs it stands, Daitoshokan no Hitsujikai does not do anything right, or even okay. When it comes to harems and supernatural abilities, other anime out there do it so much better. It's a wonder how this one got green-lit in the first place.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, inconsequential plot, romance trying to be a harem, lackluster theme\\n\\n\r\nAnimation: Bad, boring art style, generic character designs, slightly below average actual animation\\n\\n\r\nCharacters: Bad, cute girls with little development\\n\\n\r\nSound: Bad, bad OP, okay ED, bad soundtrack, average VA work\\n\\n\r\nEnjoyment: Bad, get that cat out of here\\n\\n\r\nFinal Score: 2/10",
            "date": "2014-12-27T11:50:00+00:00",
            "helpful_count": 26,
            "mal_id": 174581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=174581"
        },
        {
            "content": "A Good Librarian is a Good Shepherd:\r\nMINDSET:\r\nFirst glance: seems interesting. Second glance: it failed with the potent material and became Slice Of Life garbage.\r\nSYNOPSIS:\r\nBland protagonist was shown this random ticket from his Dad for no reason. Finds a chick to join her club, thought about it, then joins it with his newly found friends. Now do a bunch of random shtuff to apparently spread happiness for the school. And yeah, there's a supernatural element thrown for no reason.\r\nREVIEW:\r\nFortunately, there was a sense of risk in this project, or at least it tries to be interesting from the first episode with this girl trying to beless introverted with this club she runs. Now this opens up character development with theme for the whole cast, but she then magically loses timidness at the second episode. As if that trait never existed! The rest of the cast seemed to open up to the club too easily after the protagonist joined the party. All of the characters are archetypes, like the cool leader, Kudere, Moe, comic relief etc.\\n\\n\r\nNow the show isn't sold as a complete harem, you have an extra male. But that's it. Seriously, this guy has the least screen time and is completely useless in every aspect of the narrative, coming of as another comic relief cliché. I never cared about him, and the show was fine as a harem.\\n\\n\r\nAt the end of each of the early episodes, we see tid bits of mystery elements; like the school librarian has connections with this mysterious man who has a link to some supernatural thing to the plot. (does anyone notice a Key reference there?) Though it does try to keep the whole mystery aspect a \"mystery\" until the end of the earlier episodes, but does it seem interesting? Yes. Was it well presented? No. Because the show makes it a quirky back drop and its not like in Kokoro Connect when the whole show centres around it, and was used to create humour and drama. Ultimately, it is meaningless, and adds jack to the show.\\n\\n\r\nIf the show were to present the supernatural at some point, effectively, that makes the rest of these episodes (once the whole cast was introduced) seemed like filler. Though it seemed too late for it to have any real effect since you were trudging so many pointless episodes that lead to nothingness, making it poorly handled in that sense.\\n\\n\r\nSimply put, this makes it no more than just Slice of Life with failed elements to hook the critics interest. Since all these factors granting the show of higher value has failed, it does deliver its job well for just being used effectively as the day to day lives of a bunch of teenagers without realism to kill time with. Excluding that, its not worth the watch.\\n\\n\r\nLEGACY:\\n\r\nWhat else was there to say? It has the potential to become something \"a bit more\" but presented it badly. Let it be: Another Slice of Life High School show; that it may fade away to obscurity... Soon we are all hyped for the doushjins!\\n\\n\r\nCRITICAL SCORE:\\n\r\nCHARACTERS: 4/10 - Forgettable archetypes in the long run.\\n\r\nSTORY: 4/10 - Had potential at first. However, it took the safe route instead.\\n\r\nANIMATION: 5/10 - Mediocrity these days.\\n\r\nSOUND: 3/10 - I did not even heard the music, or even knew an OST for this sh*t even existed. OP = Skip it.\\n\\n\r\nFINALE: 4/10\\n\\n\r\nPERSONAL SCORE: (enjoyment)\\n\r\n3/10: I felt nothing as it became a pretty boring yet a watchable watch because of the supernatural tease.",
            "date": "2014-12-29T06:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 174991,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3904273.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Social_Elitist",
                "username": "Social_Elitist"
            },
            "url": "https://myanimelist.net/reviews.php?id=174991"
        },
        {
            "content": "Daitoshokan no Hitsujikai is an anime about Shirasaki, an introvert girl who wants to create the \"Happy Project\" with the help of Kakei who she met in an inconvenient accident with a boob grab in front of the school. The accident happened due to Kakei's seeing the future power. With Kakei and Shirasaki meeting, the two embark a typical school life journey towards the completion of \"Happy Project as they meet new friends. But here's the catch, a mysterious entity called the \"Sheppard\" stirs things up that either helps them or hinders them along the way.\r\nPros:\r\n- Slice of life and Supernatural genre blended well inthe plot\\n\r\n- fun characters (even the cat, which I think is the most interesting lol)\\n\r\n- minimal fanservice\\n\r\n- story pacing is smooth, not confusing\\n\r\n- a happy anime, you will always feel fuzzy inside\\n\\n\r\nCons:\\n\r\n- nothing groundbreaking in terms of story\\n\r\n- visuals are not as good compared to other modern day anime\\n\r\n- typical kindness will get you girls MC\\n\\n\r\nOverall, you can't hate this anime because of it's light-hearted atmosphere that gives you while you watch it. Though you might forget this anime in a month or two because to be frank there are no memorable moments here. If you want to take a break from fanservice or action anime you typically watch, this anime will give you a nice experience.",
            "date": "2014-12-29T05:33:00+00:00",
            "helpful_count": 12,
            "mal_id": 174983,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1550655.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Otaku_Buster",
                "username": "Otaku_Buster"
            },
            "url": "https://myanimelist.net/reviews.php?id=174983"
        },
        {
            "content": "before i start talking about the story i need to clear out something: out of my own experience am sure most of you guys will get the wrong idea of the show when you'll see the anime's cover up there. because the first impression i got of the show when i saw it was another romcom harem that will end up as every harem series. not like it's not true but, there's still a genres tag missing that makes the anime more entertaining. and it is the Supernatural tag.\r\nas most of you may know, the story is set in a prestigious high school academy withover 50000 students. and out of all this huge number, it follows our first main protagonist Kakei Kyoutarou a loner who enjoys reading books as his favorite passion.\\n\r\nhowever, he has a supernatural ability that lets him see the future of some people around him, and also that dragged him out of his peaceful book reading life.\\n\r\nthe nice aspect about the story here is the mystery theme that follows the events of his daily harem life, since our 6 club members get some weird mails from someone called a shepherd, mentioning something about their fate and life.\\n\r\nwhile getting into the story this shepherd secret will have a big impact in kakei's life, or rather his \"fate\" and that will make stuff a little bet complicated since it has a relation with his past self. \\n\r\nnow the one and only thing that didn't look right to me was rushing the events and especially in the last episode where everything will get settled down in the last minute rather than the whole episode. but the ending coveres this matter.\\n\r\n(i'm trying as hard as i could not to split any spoiler while writing~~)\\n\\n\r\nnow to the art and animation. i would like to say the art is unique but the only thing that makes it looks special is the different eyelashes color, and also that beautiful eyes design. as for the character design matter, it doesn't really stand out, most of them resembles some other ones in different series (at least for me) but it is still well done though....and cute. there are some little details that bothered me while watching the show too, like that over brightness in the whole scenes, everything is too bright! or the background drawing that looks kinda old, it just doesn't match with the characters. but i guess all that is because the animation it self was not made to be realistic. it will be nice if it did~~\\n\\n\r\nfor the characters part, it was deceiving. when expecting some different turns of events that will make the show stands out of his harem genre, in the end it's always the same way. 5 or 6 girls of differents types surrounding the main protagonist, who can't make a goddamn decision and choose one heroine. and of course his one and only unpopular friend who helps in bringing the comedy mood. yeah, it's just you're cliche sets of characters that lack development. the worst is it felt like the whole 12 episode were forming a circle because everything in the end got back to the way it was from the beginning, in other word.\"initialization\"\\n\r\nof course it's not only about bad things. there's also that interesting change in the protagonist throughout the series, while trying to choose between his old loner self that only looks for peace, and someone who sacrifices himself to save people and guarantee their happiness. and the reason behind this change has a relation with the shepherd and magic thing again (no spoil desu) and also because of his new friends that changed the world around him.\\n\r\nanyhow, the characters aspect was good enough for a series like this. it had some surprising plot twist sometimes (discovering his sister was....) and didn't ruin the show at all. it was just ....normal.\\n\\n\r\nto be honest, the main reason i choose to watch Daitoshokan no Hitsujikai was because of kakei voice actor. did anyone watch \"is this a zombie\" ? if yea then remember the voice of aikawa ayumu, he is the same as this one.\\n\r\nthe BGM was nice and fitting, but not to the point that ill download it and listen to it, it's not memorable after all. it felt the same way as the visual novel adaptation.  same for the OP and END.\\n\\n\r\nwhen looking back at the whole show with his different aspect it surprises me that it's the least popular one in it's season not to mention the score it was given in myanimelist 7.08. it's kinda disappointing since it deserves more than this. personally i didn't expect a romcom harem show to be this enjoyable at all, even though the adaptation was a little bit faster than it should compared to the visual novel. but yea, adapting 5 different route in 12 episodes is not that easy.\\n\r\noverall i recommend Daitoshokan no Hitsujikai to any romcom harem fan as it feature different aspects in a limited number of episodes.\\n\r\nto end up this review am giving it a score of 7.8 out of 10.\\n\r\nstory 8- animation and arts 8 - sounds 7 -character -7 enjoyment 9.\\n\r\n(this is the first time am posting an anime review^^ so i hope helped some of you make a decision after reading this)\\n\\n\\n\\n\\n",
            "date": "2015-08-03T06:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 195060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4085373.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/reizenchuu",
                "username": "reizenchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=195060"
        },
        {
            "content": "Ah, harems.  One of the most subjective anime genres that exists, as well as one of those that can be both hit or miss.  On this review, I'll b talking about Daitohokan no Hitsujikai which...falls into the latter.\r\nStory (5.11/10): The story of Daitoshokan, or \"A good librarian like a good shepherd\", a boy by the name of Kakei Kyotaro enters a prestigious school with the thought of going to school and sort of delving into the crowd, spending his time in his books.  However, one day, he meets a girl by the name of Shirasaki Tsugumi, and gets invited to her littleplan called the \"Shiomi Happy Project\", in attempt to make the school a wonderful place.\\n\\n\r\nI'll be blunt here.  The story is shit.  And that's kinda putting it lightly.  Like a lot of anime, the show does have a bit of a decent start to it, as well as some pretty interesting story concepts, really, it doesn't really deliver on anything.  There are a couple pluses to this story, but there are a lot more negatives to counterbalance it.\\n\\n\r\nWhat really gives this show something to make it interesting is the concept of the shepherd.  The shepherd is what made the show interesting.  But in addition, it's also a double edged sword.  In the beginning of the series, the shepherd was introduced to be a mysterious character and concept of sorts that gripped the audience.  It was mystery element that made the show a lot more interesting than it was, which, after being told what it was, kinda brought the show to rock bottom.  The shepherd when fully explained, well, \"fully explained\" felt incredibly forced and amateurly done because after the groundwork was placed, the show essentially uproots itself and makes up things in its place, making everything the show created, irrelevant.\\n\\n\r\nAside from the idea of the shepherd, there's really not much story.  Every event in the story feels horrendously forced and it plays out like a generic harem in the sense of all the girls having their own little \"arc\" that doesn't really add up to anything, before going into a story that was even more poorly written.  \\n\\n\r\nIn the end, the show really didn't end up to be more than a gigantic mess.  The ending really didn't do more than bring a happy ending of sorts for this show, which does give it a somewhat positive not on account of the sweetness that the ending did have, but the poorly done story and the show basically rewriting its own plot ideas and previous groundwork put the nail in the coffin to a very, very poorly made show.\\n\\n\r\nOverview:\\n\r\n+/-  Good mystery element at the beginning\\n\r\n-  Awful storytelling\\n\r\n-  Show basically rewriting its own rules\\n\\n\r\nCharacters (5.00/10): Oh boy.  If the story was bad, the characters put the topping on the cake.  While harem shows aren't necessarily known for good characters, there comes a limit as to how bad they can be.\\n\\n\r\nKyotaro Kakei is our main protagonist, and as a harem protagonist, he's not really much to look at.  Kakei simply just wants to write books.  That's kinda it.  He agrees to become part of the Happy project, but aside from that and the so-called \"development\" he gets, which is so cliched and forced that it hurts, there's nothing significant about him.  His goals and his actions often times come into great conflict with one another and it just turns the show into a very big mess.  Not to mention this guy has the personality of a brick.  Do anime chicks like bricks or something?  Cause this guy got like 5-7 girls easy without trying, no problem.\\n\\n\r\nAside from him in the main cast, there is Kodachi, who really should be the main girl and not Shirisaki because comparatively speaking, Kodachi is a much better character.  While formally introduced a little later than all the other characters, Kodachi definitely proves to be the show's best character on account of the fact that she has more personality than everyone combined, as well as her own goals that separate from all the others.  However, she does suffer from the same problems as all the other girls, gaining a very forced feeling backstory that really does things half-assed, as you really only get a tiny, tiny amount of information, leading you to want more, thus making the character incomplete.  She's an interesting character, and really saves the show a bit by being more interesting, but still fails to be anything more than that since there are other girls who take the spotlight.\\n\\n\r\nSpeaking of the other girls, how about them?  Kanasuke, Senri, Tamamo, and Tsugumi are the token harem girls of this series, Tsugumi being the \"main girl\" and the \"end girl\" seeing as how the show apparently took her route.  Nonetheless, I'll just be blunt here.  They suck.  There all have \"personality\", by which I mean stereotypes seeing as how they all reflect on a harem girl stereotype that they don't really depart from.  And, as I have mentioned before, all four of them get an little, ity-bity backstory that doesn't really add very much.  (Like seriously, talking about a character's important moment for like three minutes doesn't count as a backstory.  You need more than that.  Or at least something more than just one of the girls suddenly wanting to tell their problems to  guy they just met a couple weeks ago.)\\n\\n\r\nIn addition, there are two characters that serve roles so stereotypical that it really just hurts to watch, because even they know it themselves.  And those are Takamine, and the cat, King Gaza.  Which serve as the \"best friend character that doesn't get a girl\" and the \"mascot\".  Honestly, it would've been better to just oust these two because they don't even serve as comedic relief.  (Sunohara would be ashamed.)\\n\\n\r\nAs for side characters, well, you can forget them.  Side characters in those show mean nothing, as the amount of screentime combined out of the entire supporting cast equates to about 20 or so minutes.  You don't really understand them, you don't get why they do what they do, they just serve as confusion for the audience because it's obvious that the show didn't even try to incorporate them into the story well, opting just to throw them in at random times.\\n\\n\r\nOverview:\\n\r\n-  Awful MC protagonist (even by harem protagonist standards)\\n\r\n-  Harem troupe girls that aren't very interesting\\n\r\n-  Useless stereotype characters that didn't serve much purpose\\n\r\n-  basically unknown supporting cast\\n\\n\r\nArt and Sound (7.11/10 and 6.99/10):  Honestly, the aesthetics are the only real high point of the show, and that's not a good thing when taking a look at the individual category scores.  \\n\\n\r\nThe art is bright, it's whimsical, it's...meh.  There's not really much to look at, really.  The art serves its purpose by being pervert bait, as the show does often enough show off its jiggle physics with Kodachi and Tsugumi.  In addition, the show, being drawn in a cutesy moe style, doesn't really do much beyond well, being a cutesy moe style.  The art serves its purpose, giving a decent visual experience to the viewer, but really nothing else\\n\\n\r\nThe music is also meh.  The opening while yes, has gotten stuck in my head on some occasions, doesn't have anything to offer, period.  It's a generic track, kinda like its ending, and are just these nice to listen to, but not memorable cutesy anime tracks.  If you want to skip them, go ahead, they're not really worth listening too.\\n\\n\r\nOverview:\\n\r\n+/-  Meh art\\n\r\n+/-  Meh music\\n\\n\r\nPersonal Enjoyment (5.99/10):  I love harem.  There, I said it.  I really enjoy harem shows.  The ludicrous idea of having a bunch of girls surrounding one guy just makes me smile for some reason.  However, there does come a breaking point where a show that can be tolerable to watch (since I have a decently high resistance to the amount of crap I can watch) to something that's just honestly, quite unbearable.\\n\\n\r\nDid I like this anime?\\n\\n\r\nIn the beginning, I admit, I was enthralled to some extent.  I knew at the time, it was going to turn into a generic harem, but I thought the idea of the shepherd was going to save the show to some extent.  It didn't.  It only confused me even more and gave me a bad feeling.  Although, I admit to liking Kanasuke as a character.  I dunno, characters like that appeal to me.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nLet's run through the list here.  The entire plot, how they screwed up their own \"Shepherd\" idea, the characters.  What did I miss?  Oh yeah, the pacing was awful.  In the beginning, the show as kinda slow.  But towards the end, the show rushed by so many things, that the entire thing fell into the realm of mediocrity.  Not to mention how forced the development, the story, and the romance was, making the entire thing so much less enjoyable to watch.\\n\\n\r\nWould I recommend this show to anyone?\\n\\n\r\nDaitoshokan is the Fall 2014 equivalent of Glasslip.  (Now you may shriek in terror.)  While compared to Glasslip, the show trades aesthetics and a decent soundtrack for a somewhat easier to follow story, in the end, it's still not worth your time.  I seriously want the time I spent watching this back.  So...don't even put this one on the list, folks.  It ain't worth it.\\n\\n\r\nOverall Score: 5.48/10",
            "date": "2014-12-26T03:44:00+00:00",
            "helpful_count": 8,
            "mal_id": 174349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=174349"
        },
        {
            "content": "Feliz Navidad, muchachos! You know the moment I've watched this.................thing, well, I could say plot wise it was good. It kinda have some similarities with the movie \"The Adjustment Bureau\" where shepherds does the job of guys with hats and that instead of a door to another portal , in this anime it was books. Here the main protagonist Kakei is a just a regular guy who is just another one of those bookworm characters who somehow got involve with  Shirasaki's \"Happy Project\" and where his simple  and ordinary life starts to go upside-down and he and his club members/ harem wonders aboutthe mystery behind the messages left by a certain individual called the \"Shepherd,\" thought Kakei doesn't know yet, he is an unwilling player of the 'Shepherd\" which is also initiated by his half sister and Shepherd wannabe, Nagi, which for me it does add something good for the anime's plot, but, most of the time, everything were just utter random cliche situations where the main focus was on the members of the Library Club and  Shirasaki's \"Happy Project\" than anything else. So, my ratings:\\n\\n\\n\r\nStory\\n\\n\r\nI'm gonna go with 5 and just refer to the explanation above.\\n\\n\\n\r\nArt\\n\\n\\n\r\nI'm gonna apologize to everyone, cu'z this anime's art was basically just cliche eye candy, there maybe some limited fanservice, but realistically this anime or manga where just banking on such eye candy thing, so it's a 5 for the art. \\n\\n\\n\r\nSound\\n\\n\r\nWhat I like about it:\\n\\n\r\n-  The VA's who did the voices of; Shirasaki, Kodachi, Sakuraba, Kakei, Kana and Ikkei. \\n\\n\r\n- I like the opening and closing theme\\n\\n\r\n- I also like the VA who did Misono's voice, but not when she is doing opera.\\n\\n\r\nBut:\\n\\n\r\n-The cat Gizaemon, should have just meow, than to have some one line speaking lines. \\n\\n\r\n-My rating, a good 7.\\n\\n\\n\r\nCharacter:\\n\\n\r\nOk let's go to some of the characters, btw, I gonna give this part an 8:\\n\\n\\n\r\nKyoutarou Kakei, ok, so he maybe the usual harem guy, but he is one usual harem guy that I like, though a joy killer, I really like that he get's int situation where he has to this dark horse who has to help people that the library has set him to do. Also, , I like the short moment where he and Shirasaki where intimate.\\n\\n\\n\r\nTsugumi Shirasaki, ok, she is this usual pesky nice girl who gets into the guy's life and turns it upside down, but then again, I like her. I like the way how she diligently tries her best to make her happy project to help others in a way that she has this sweet touch where everyone feels a certain comfort around her. Despite of her being a klutz, it is that thing which gives her character a certain charisma.\\n\\n\r\nNagi Kodachi, as much as I hate to say it, she is one heck of a train wreck where her character is a mystery, where at one point she isn't gonna be a shepherd and in the end she becomes one, also detail about her in the manga seemingly conflicts her character in the anime (btw, I've only gone to just  couple of chapters in the manga), never the less, she the quintessential girl who should have a brocon on Kakei.\\n\\n\\n\r\nMisono, Kana and Tamamo, well they're just the usual harem member, that I kind like.\\n\\n\\n\r\n Ikkei Takamine, I kinda pity that character for not having a slice of the harem pie, if he can have one he should be with Tamamo or with Maho.\\n\\n\\n\r\nEnjoyment\\n\\n\\n\r\nBasically it was enjoyable when I see the harem members competed for the guys affection, also the intimated moment that Shirasaki has with Kakei and how Kakei saves Shirasaki from a death flag. But most of all,  the sweet moment when the two met back stage where Kakei seemingly is saying goodbye to Sjirasaki, where I'm giving this a 7.\\n\\n\\n\r\nOverall\\n\\n\r\nTbh, it's a 1, since the concept having somekind of secret magic library in school whose functions has some similarities with the 2011 movie \"Adjustment Bureau\" was just too fancy for an anime whose plot revolves around the members of the \"Library Club\" and Shirasaki's Happy Project. To add some kind of magic element in this anime was more like a miscellaneous thing that just adds to some complications with the anime's story. So amigos, have fun watching the eye candy that this anime provides.   \\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-12-25T10:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 174249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4212159.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 1,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tres_Bandidas",
                "username": "Tres_Bandidas"
            },
            "url": "https://myanimelist.net/reviews.php?id=174249"
        },
        {
            "content": "In my anime List I rated 9 but overall objectivly I think its an 8.\r\nThis will be the most simple review that I will do in any anime I personaly reviewed.\r\nSo when I finished this anime wich was a few minutes when Im done with this review my first thoughts on it were \"How did I missed this\" cause it was just that good IMO. The story is interesting I think it focuses on some Japanese Folklore probably other cultures but lets say its Japanese on something called the Sheperd, and the Sheperd consists on some Transcendent Being that helps people be happy while takingcontrol of theyr fate, cause they can see the future, past and everything a person has done when something is about to go wrong lets say an accident, the Sheperd takes action to save that person. All that Information are in books and our MC is a Bookworm wich makes him a Sheperd Candidate, so for 12 episodes its his \"persona adventure\" where he meets people and cultivates his friendships with them learning about theyr pasts and stuff. But for one to became a Sheperd a sacrifice has to be made and that is to became an existance who everyone forgets. So find out if he becames one or not you wont regret watching this. At least consider adding this to your planning to watch list when you have the time.\\n\\n\\n\r\nAbout the Characters each character is unique, the girls, wich made me not feal bored and distinguish each and every one of them. Also the MC is pretty smooth like a persona MC and goes along with some stuff and says funny stuff to get a reaction from the girls. Also im sure he is not stupid, like not at all he is top student in a prestige school or whatever and is pretty sharp as well, I think he just acts dumb towards the girls or has you progress and learn more about him trust issues. Yes this is a Harem one.\\n\\n\\n\r\nThe Art is nice made by Funanimation but I dont think that has to do with anything but Im ignorant towards that stuff so Ill apologise and get back on the subject. The art is well done and the humour with the characters its funny as well when they make the expressions and stuff like that.\\n\\n\\n\r\nI thought this was gonna be a simple review but it turned quite long, As for my personal enjoyment and recommendation:\\n\\n\\n\r\nYes! I do recommend this and as I said it before at least consider adding this to you Planning to watch List as for the enjoyment Yes! I did quite enjoyed it myself giving it a nice round 9. This deserves a sequel!\\n\\n\r\nSorry for the bad english hope that this Helps when your looking for a good one to pass the time at least.",
            "date": "2017-12-31T09:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 266989,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4911515.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Slivko",
                "username": "Slivko"
            },
            "url": "https://myanimelist.net/reviews.php?id=266989"
        },
        {
            "content": "Its been a while since I wrote another \"review\". Oh well...\r\nThere is nothing wrong or right about this anime. Its another harem where MC is being liked by everyone and is the best because the writers said so. The story is sort of interesting and there is potential here, though I feel its squandered on the harem genre.\r\nI liked the characters though there is nothing special about them. The MC is also nothing special, maybe the whole reading books is kind of cute, in a nerdy way. I like it, its nothing special.\r\nYou aren't missing much by not watching this, but its a cushion anime- made to comfortably fit around your fat ass. Its a comfort zone thing, like a bowl of chicken soup. Can't critique a bowl of hot soup for being bland when you got a cold right? I feel this anime is the same way. If you feel kind of down, this anime should make you shamefully admit you kind of like it. And I guess that is its purpose.\\n\\n\r\nI like, I recommend others watch it.",
            "date": "2017-03-22T16:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 243180,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=243180"
        },
        {
            "content": "Even if the Sepherd thing spices up the story, there was no good connection between this and the realife those students follow. \r\nMaybe that happened because the anime is 12 ep long, and the only option was to cram it all up and make it shallow.\r\nPros:\r\n  The harem it was, I expected girls with a variety of personalities, just flirting with the main character, not evolving. Most of them learnt something with their interaction with him, and developed.\r\n  The main character wasn't a wuss, but a normal intellectual, although after the 3rd episode he started behaving like a typical boring, clueless,harem protagonist.\\n\r\nCons:\\n\r\n  The library environment was warm and cute, but there wasn't enough screen time to feel like you were there with them, even if the place was precious to them. So it ended up being just a backround for their meetings, which I didn't appreciate.\\n\r\n  The sound and art were mediocre, except from the singing girl, which again didn't have an impact because it wasn't developed correctly. \\n\r\n  None of the characters had an impact on me in general. Their personalities were weak, or so they seemed to me.\\n\\n\r\nI don't consider this anime a must watch.\\n",
            "date": "2018-11-18T00:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 294273,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3975607.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ReikaUchiha",
                "username": "ReikaUchiha"
            },
            "url": "https://myanimelist.net/reviews.php?id=294273"
        },
        {
            "content": "a story simply curious but in the end a rather big disappointment, from a neutral point of view if the story had risen what it raised in the end would have been more interesting, the story begins with a fairly common development but progressing begins little by little to improve good until the chapter 7 where we put that lighting with such mediocre results that I hurt to see it, the series has enough decency in animation as soundtrack I find it very good people are quite direct but as they fall in love with our protagonist I found it easily bad, in conclusion aseries of romance with comedy with an acceptable but demagrated story in my opinion would say that it has been a series of the heap",
            "date": "2018-11-05T14:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 293457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7275466.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/theotakuparade",
                "username": "theotakuparade"
            },
            "url": "https://myanimelist.net/reviews.php?id=293457"
        },
        {
            "content": "This series made me realize just how many harem series I've watched, to the point of knowing what the series was gonna end in just a few episodes. But for some reason, I enjoyed it a lot.\r\nThis was perhaps because of its concept of \"having the ability to see the future\" without anything relating to time travel. Also, its idea of becoming a being who can change the fate of a person to create a better world is not something anyone can come up of on the fly. I swear, this series had potential... if only it didn't become a harem series.\r\nThe reason why Ithink harem broke my interest for this series is because it didn't even need to have a harem tag in the first place. It would've been fine as simply \"a boy who had the ability to change the fate of humans\". But no, they just had to add that tag. Personally, it would've done well even without the harem tag. There was already romance, so bringing in other girls to the story just makes it a nuisance. \\n\\n\r\nI gotta say though, the animation and art style was really smooth. It wasn't so rough or full of highlights or shades. Because of that, the show maintained a light atmosphere.\\n\\n\r\nOverall, it wasn't a bad series. I'm just pissed off that they placed a tag that shouldn't have to be there in the first place. Doesn't matter if you like or hate harems though, because when you watch it, you'll just want to become a shepherd.",
            "date": "2016-11-15T03:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 233784,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=233784"
        },
        {
            "content": "Story- Had potential but, the characters never get developed. The romance is terrible. All the girls like the MC but, are to pansy to say it. They try to give them compelling stories that i didn't care for. You feel like it's going to turn into a harem but, we don't even get that. The real story is barely explained and can be completely ignored. The ending is very cheap and unsatisfying. 4/10\r\nArt: Meh, slightly below average not amazing, but nothing to cry over. 4/10\r\nSound: Don't remember a single track (Just finished it 7 minutes ago) Sound effects were average. Great voice acting. 4/10\r\nCharacters: Theonly character's I found interesting were Nagi Kodachi,(Really funny and with a interesting past and Kyoutarou Kakei (Same) Every one else is to cookie cutter. Same boring tropes x10! MC's really irrelevant, comedic relief friend? Check!  Super serious girl? Check! Underclassmen who are always coming onto the MC? Check! 5/10\\n\\n\r\nEnjoyment: I enjoyed it at the beginning expecting it to get good later on because they kept hyping up these shepherds. Was super let down. At episode 11 was just rushing to finish this. 5/10\\n\\n\r\nTLDR: Don't waste your time on this anime. Instead I recommend Trinity seven, fruit of grisaia, haganai, my teen romantic comedy or even high school dxd, if you're into this type of anime. Just STAY AWAY FROM THIS ONE 4..2/10 IGN would not watch again.  \\n\\n\\n\\n",
            "date": "2018-02-05T01:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 270700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6505357.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheRealNormie",
                "username": "TheRealNormie"
            },
            "url": "https://myanimelist.net/reviews.php?id=270700"
        },
        {
            "content": "I watch this anime because I like anime about a bunch of cute schoolgirls with male lead as the center of attention. If you like Grisaia No Kajitsu you might like this but I doubt you will enjoying this because I think some of the episode are so so boring, and its totally different compared to serious Grisaia, this is a not-so-comedy anime. I intend to drop this anime since episode 10 but there is always something interesting happen towards the end so I cancel my decision and give this a try and to be honest its so tiresome. For me, a plot about abookworm who wants to be a shepherd, a shepherd here mean a person who hold a book of fate of all people in the world and they have a power to change the fate. This is what the MC have here but I think this suppose to be main plot is just a subplot because they are not really focused on that shepherd stuff, only a few episode cover it, other than that just some random episode about every girl problem that MC will help to solve. I love the hint of romance but I don't think shojo lover will come to love this anime because its totally just some another subplot, but sometime its cute. If you like harem-little ecchi anime you might like this, but you know you must try hard to love this anime because for me its really slow and boring sometime.",
            "date": "2015-02-12T16:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 180214,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4398513.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/esofdiamon",
                "username": "esofdiamon"
            },
            "url": "https://myanimelist.net/reviews.php?id=180214"
        },
        {
            "content": "Daitoshokan no Hitsujikai is a cute slice of life series with a very interesting topic that is unfortunately not expanded on enough.\r\nStory - 7/10\r\nThe story doesn't really develop much until the later episodes, and though it felt rushed I quite enjoyed the idea that the plot was trying to create. Unfortunately with as short as the show was, I felt like there wasn't enough time to fully enjoy it.\r\nArt - 5/10\r\nI must say that the artwork for the series did not stand out very much. Had it not been for the PV's I saw I might've skipped over the series without a second glance. There'snothing special about it.\\n\\n\r\nSound 6/10\\n\\n\r\nThe soundtrack also did not standout too much. The opening and ending songs were cute to say the least.\\n\\n\r\nCharacter - 6/10\\n\\n\r\nI give the characters a 6/10 because they were fairly generic and could have been pulled out of any other visual novel adaptation, but combined with the plot of the anime I feel like there was a lot of untapped potential for character development.\\n\\n\r\nEnjoyment - 8/10\\n\\n\r\nThe show is definitely a decent watch. The characters, though uninspired, were cute to watch, and the plot makes you think a little.\\n\\n\r\nOverall - 7/10\\n\\n\r\nOverall, the show is decent. Not much can be said about a show that had its plot rushed within the second half of a series that is only 12 episodes. Its a decent slice of life series at the most.",
            "date": "2016-08-22T15:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 227358,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5357154.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WhipQueen",
                "username": "WhipQueen"
            },
            "url": "https://myanimelist.net/reviews.php?id=227358"
        },
        {
            "content": "What would you do if you could sense the future? I don't mean the fake future as in Glasslip but the real future like in Kara no Kyoukai Mirai Fukuin. Well, in the world of Daitoshokan there is a secret Men In Black type organization that wields magic and can guide people to a \"good\" future. This organization of \"shepherds\" takes an interest in our particular protagonist, a bookworm named Kyoutarou, who happens to save an innocent bystander from a horrific future, and ends up conveniently fondling her in front of a massive crowd just for good measure.\r\nDaitoshokan is the latest August work to beturned into an anime following Fortune Arterial. While the shows share some similarities (harem and school based slice of life elements), the story in Daitoshokan is much less organized and builds to a not-so-interesting climax. If you're looking for anything above an average slice of life show this is going to disappoint. The overall work is passable but quickly forgettable.\\n\\n\r\nAnimation:\\n\r\nThe animation quality is only average at best. The animation isn't particularly crisp and backgrounds are bland and have a characteristically painted style. The characters themselves are drawn well with a style that focuses more on moe than maturity. Tsugumi sometimes has this happy carefree look that reminds me of Tenma from School Rumble. Expressions are fair overall but nothing out of the ordinary. The standout character in this show is actually probably the cat. Seriously, the cat has more personality than over half of the supporting cast.\\n\\n\r\nThere isn't much action in this show though, as alluded to in the introduction, there is a fair amount of light ecchi. There isn't enough to really tag this overall as ecchi but expect a few suggestive scenes and conversations nonetheless.\\n\\n\r\nSound:\\n\r\nThe show opens with a light and relatively quick-paced pop piece though the melody isn't anything special. The ED is a slightly more memorable piece with a good beat and melody. The BGM is composed of standard fare supportive but forgettable pieces.\\n\\n\r\nThe VA cast is mixed on this one. Madoka Yonezawa comes from the lead in White Album 2, but unfortunately not in a singing role. A lot of the other VAs are relatively junior and don't give their characters a great deal of depth; it's not completely their fault though given the nature of the story.\\n\\n\r\nStory:\\n\r\nOur protagonist is a smart loner who prefers books to the trouble of dealing with others and their facades; he feels that everything to be learned is written in books. This ridiculously naive premise is quickly blown away when the girl he rescues and fondles suddenly asks him to join the \"Happy\" club. Not understanding what could possibly motivate her, Kyoutarou decides to humor her. A few small projects later, the club has grown into a fully-fledged harem for Kyoutarou, plus a useless but obligatory male friend. However, as he grows closer to this new group of friends, he struggles with whether or not to use his future-sight abilities to guide everyone to a \"happier\" future. Will he sacrifice himself to help everyone else?\\n\\n\r\nWhile not necessarily a bad premise to start on, this story tries to tackle too many genres and issues at the same time. Unlike Fortune Arterial where there was a clear, central plot and a primary heroine, this show has multiple tangential stories going on concurrently with different heroines. In addition, the entire secret organization and future-sight ability isn't developed in an appealing fashion and fails to involve the viewer to the same degree as the vampire concept in August's previous work.\\n\\n\r\nThe story is a mix between episodic character introductions and generic slice of life school events. There is a random tension introduced around half way through the series that eventually somehow develops into the very unnatural climax. The show then concludes in a copout manner; let's just say that I felt as betrayed as the ending to Shana 3.\\n\\n\r\nCharacter:\\n\r\nProtagonists in general have gotten a bit better about being slow and overly soft. However, they still are as slow as ever when it comes to love. To make matters worse, the heroines feel rather generic and shallow. Though they each get their own arc, their interactions with the protagonist never feel genuine, and relationship development is all but missing. There is a bit of character development but it's spread so thinly between the characters that the value is greatly diminished. As I said before, the cat is probably your best bet for entertainment.\\n\\n\r\nValue:\\n\r\nOverall, this is an average at best slice of life. The characters lack depth and the story is neither engaging nor focused. This series is one shepherd that the sheep will avoid, and you should too unless you are really out of things to watch.",
            "date": "2015-11-04T23:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 202709,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202709"
        }
    ]
]