[
    [
        {
            "content": "The problem with the anime industry is the continuous failure to capitalise on titles that are actually good, and instead redirect time and resources to producing shows that leave you as empty as a tectonic bowel movement. Every genre has suffered this iniquity, but while most bounce back with other, much better offerings (comparatively speaking), comedy continues to prove the medium's \"Achilles heel\". Those of you who are fans of Gintama may disagree with that perception, but consider for a moment the number of anime released during the last year that have borne the \"comedy\" label.\r\nNow have a think about whether they made you laugh,or simply made you smile (or in the worst case scenario, made you want to punch the people who made it in alphabetical order).\\n\\n\r\nBased on the manga by Anbe Masahiro, Shinryaku! Ika Musume (Invasion! Squid Girl), tells the story of Ika Musume, who has come from the sea to exact revenge on humanity for polluting the waters of Earth, and she plans to do this by conquering the world.\\n\\n\r\nUnfortunately her first foray onto land doesn't go as planned ...\\n\\n\r\nThe series is presented in the style of a sketch show rather than as a continuous narrative, with each episode split into three independent stories. Normally this approach would present several problems where plot and character development are concerned, but thankfully that isn't the case here as each tale is well crafted and paced, with little time wasted on pointless trivialities (which is ironic as there are people who would consider the whole show to be trivial). In addition to this, there is an autonomy to each chapter that allows for a variety of themes over the course of one episode, and this makes for some decent storytelling and visual gags.\\n\\n\r\nAs an aside, one thing that should be pointed out is the rather obvious homage to the first ten minutes or so of Up! that occurs in episode five. The nice thing about this particular chapter is that there has been a conscious effort to follow Pixar's example and simply use music, sound effects and imagery to tell the story, and the result is something ... rare, especially in terms of audio/visual choreography.\\n\\n\r\nWhich brings up an interesting point.\\n\\n\r\nOn the surface Shinryaku! Ika Musume looks a lot like the common or garden moe based \"comedies\" that abound these days, but as everyone knows, one should never judge a book by it's cover. The design principle verges on the generic at times, and this rather simplistic approach to the characters is reflected in the backgrounds and settings as well. The animation is generally decent, with nice movements and some interesting ways to use tentacles (I never thought I would ever use that sentence in an anime review), but the initial perception may be that Diomedea simply didn't try hard enough to make the series look great.\\n\\n\r\nThere is something that should be taken in to account though, and that's the fact that Ika Musume wasn't only made to make you smile. The main purpose of the series is to make you laugh, and that it does. The \"generic\" look of the show allows for a number of well executed visual gags and parodies, as well as some creative moments like the Mini Ika Musume chapter. In addition to that, the style of humour actually works better when the viewer is comfortable with the imagery, which may be the reason why Diomedea opted for a look that many people will already be familiar with.\\n\\n\r\nAfter all, it's reasonable to assume that the majority of viewers would find the slapstick comedy aspect out of place in a series series featured stunning scenery and beautiful characters, no matter how funny the show was.\\n\\n\r\nOne thing that is slightly annoying about Ika Musume is the devilishly catchy opening theme (Let's Invade by ULTRA PRISM featuring Kanemoto Hisako), which may have been designed to loiter in the viewers head, waiting for the opportune moment to strike. That doesn't mean it's a great song though, as it's a very typical example of the \"cute\" J-Pop anime introduction - with everything that entails.\\n\\n\r\nOn the other hand the ending theme, Metamerism by Ito Kanae, is a melodic ballad that's rather pleasant on the ears (even if it is a tad generic), but seems a little out of place in a comedy show. As for the incidental pieces, they range from slightly ditzy jazz styled jingles to the slow piano piece of the Mini Ika Musume chapter. Unlike many other shows though, the music is only pushed to the fore when the occasion demands, and one will generally hear it as a very subtle accompaniment to the on screen action (it should be pointed out though, that a good portion of the series features no music whatsoever).\\n\\n\r\nAs with any comedy, delivery is everything, and it's here where the seiyuu really shine. While the voice acting may sometimes be a little on the bland side, the characters really come alive when there's something quirky or funny going on. Kanemoto Hisako's performance as the precocious invader from the sea is actually pretty good, especially as her only other main roles are in Sora no Woto and Kore wa Zombie Desu ka. Her coordination with the other voice actors, especially Fujimura Ayumi and Tanaka Rie (the Aizawa sisters, Eiko and Chizuru), allows for some nice comedy set pieces.\\n\\n\r\nWhich brings up another point.\\n\\n\r\nBy its very nature, comedy isn't the greatest tool for characterisation or development, especially as the usual methods can seem out of place amongst all the slapstick. Ika Musume neatly sidesteps the issue by inserting a few choice tales that highlight a particular bond or personality trait, but it does this by creating a metaphor which can sometimes change the whole tone of the series. That said, any growth is sporadic, and there are occasions where viewers may find themselves wondering what the point of a particular chapter was.\\n\\n\r\nThere is a plus though, as the series creates comedy pairings between disparate, and sometimes unlikely, characters, which adds to the whimsical nature of the show. Eiko and Ika-Musume represent the primary straight and funny \"men\", but in truth there are multiple parings, trios and groups that form over the course of the series, all of which is only achievable because the characterisation is actually pretty decent for a comedy anime.\\n\\n\r\nNow I will be honest here, as I didn't expect to like this series as much as I did. That's not to say it's a classic, as there are definitely better purebred comedies out there, but when compared to many of the more recent offerings in that genre, the charm, quirkiness and feelgood atmosphere of Shinryaku! Ika Musume is definitely a step in the right direction. The series bears a few similarities in terms of style, content and layout to such comedy worthies as Potemayo and Jungle wa Itsumo Hale Nochi Guu (but without as much insanity), whilst Mini Ika-Musume didn't simply remind me of Pixar's Up!, but also of Binchou-tan.\\n\\n\r\nThere is something to bear in mind if you decide to give this show a try though. Comedy is probably the most subjective genre in any medium as it requires far more investment from the viewer in order for it to work, and one of the things that we in the West often forget is that the vast majority of anime are made for the Japanese markets. Because of that it becomes difficult for Westerners to relate to certain aspects of the humour, but that doesn't automatically mean a series is bad just because we don't understand it.\\n\\n\r\nBesides, after some of the debacles that have been produced over the last few years by an industry that's trying a bit too hard, it's a welcome change to watch something a little bit silly.\\n",
            "date": "2011-01-13T11:03:00+00:00",
            "helpful_count": 348,
            "mal_id": 33723,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=33723"
        },
        {
            "content": "I would never imagine, in my lifetime, to see a squid this adorable!\r\nIm telling ya, after years experiencing Squidward from SpongeBob Squarepants, I started to give up hope for all squids in the world... \r\nThat is until I met little Ika-Chan...\r\nSo what's so special about another failure invader anime? Don't we already have a frog for that? \r\nHow can you say that! Squid>Frog anytime!\r\nAnyways, the story isn't very deep and there's no much of a plot buildup however the comedy and cuteness is enjoyable nevertheless. You'll have a drama episode, a horror episode (Oh damn that doll was scaaaaary) and also a tearjerker moment (Ilove you Chibi Ika!)\\n\\n\r\nThe artwork was exceptional. It was able to portray the scenery of a beach perfectly to go along with little Ika's antics. The characters are well drawn especially in the expressions department.\\n\\n\r\nSound? Who doesn't like the sound of the beach! Great choice of background music to enhance the surrounding. I especially liked the squeeky sound you get when the tentacle rubbed against each other. (Reminds me of rubbing two pickles with each other)\\n\\n\r\nIka's character is developed nicely (Even though it's mostly appealing to lolicons). However she's still a kid at heart. But thats just the way we all like it. Coupled along with a \"geso\" at the end of every sentence, and WHAM! Try to resist that awesome cuteness! Other characters support her well (both her and her mischiefs)\\n\\n\r\nThis anime definitely has a considerable amount of re-watch value. The comedy doesn't get old easily. And I guess people would of course want to see my Chibi Ika! (But not those puppets.. That thing gave me nightmares!)\\n\\n\r\nOverall, it's a must watch for all you who adores cute and lovable things! If you dont? Then the comedy would still entertain you nicely. Personally, my favorite part about this anime is Ika's assimilation into the human world. It's nice when an invader understand how not all humans like us are bad. What? You think you're good too? Heck no... If you're watching this anime, chances are you're a sick pervert like me who was expecting tentacle rape.. \\n\r\nNah.. Im just kidding..\\n\\n\r\nHaremu Kingu,\\n\r\nSigning out!\\n\\n\\n\\n",
            "date": "2010-12-26T20:12:00+00:00",
            "helpful_count": 86,
            "mal_id": 33106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=33106"
        },
        {
            "content": "Adaption success? Adaption success. Unlike that of Dance in the Vampire Bund I had meant to do with a long time back with, among other things. Don't pay attention to my scores as my writing, as I tend to rate most things highly.\r\nThis is a simple show that does what it is supposed to, but is a big deal because shows like these can have a lot of expecation behind them from the manga fans like me. Could you imagine how much expectation you would have if someone animated Yotsuba&!? Exactly.\r\nShinraku! Ika Musume, is another Slice of Life Comedy show. A very good one. They'rebecoming very popular in recent year, so one may ask, why watch Shinraku Ika Musume? Because it is by no means below sub par. Many of these within the genre are kind of lacking in either the anime or manga. Shinraku Ika Musume started with a very solid manga beginning, and I believe that the first episode, is in fact, that the entire series will be successful in portray the charm that is Ika.\\n\\n\r\nAnd because I feel this way I am writing a review early to garner positivity for the show.\\n\\n\r\nYou get the premise of a girl who is trying to take over the world, because of ecological and animal rights type of reasons, and is practically a walking embodiment of Radical Ecologist Greens in moe form. So you won't find her accomplishing much of her goal to conquer the world, aside from her financial gains working at a restaurant. It is a Slice of Life comedy. It is episodic, not much changes.\\n\\n\r\nAnd Slice of Life and Comedy are not bad genres, just because what many people who prefer anime find exceptional about the genre, is Fantasy Action and Philosophy. And to someone who wants a good example of the sort of thing the genre should aspire to, can read some of the modern greats such as Calvin and Hobbes and of course Yotsuba&! Shinraku! Ika Musume, does the best job of keeping along in the tradition of better Slice of Life comedy shows. By one, having just enough and not too much moe focus, and having equally as good comedy situations. \\n\\n\r\nIka, is herself, a moeblob. But unlike a lot of Slice of Life shows, Ika Musume still takes a lot of effort in crafting good comedic situations in the form of short. The show does not once suffer in terms of comedy from the fact that Ika is a moe personification of Deep Ecology. I cannot stress well enough how well balanced the different things that lie in this manga and anime are, and how amusing I find it's comedy. Something that has carried me through chapter to chapter, begging for more.\\n\\n\r\nIf you are an anime fan because you like Fantasy scenarios, from the high ends of production and quality to the lower, because that is your taste, while having little interest in comedy and simple like Calvin and Hobbes like shorts, reminiscent of your Sunday Newspaper, Slice of Life anime, and as well, Shinryaku! Ika Musume is not for your.\\n\\n\r\nHowever, if you have just caught up with the very newest Yotsuba&!, Chi's Sweet Home, taking up Shinryaku! Ika Musume may even do a better job of an addition to such shows than the likes of K-On and Lucky Star have been. Simply because it's format, as interpreted in my mind, is a better balance of moe, the slapstick, and other comedy situations. And those comedy situations themselves, in my mind, being very amusing.\\n\\n\r\nClearly it is something that came off refreshing to me. And I hope that is has, or will be for you as well. Give it a try. Give it a try if you like this kind of material. For if you do, it is well worth your time.",
            "date": "2010-10-07T06:20:00+00:00",
            "helpful_count": 66,
            "mal_id": 31170,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64644.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ukonkivi",
                "username": "ukonkivi"
            },
            "url": "https://myanimelist.net/reviews.php?id=31170"
        },
        {
            "content": "I’m not going to lie, this show is a weird one to talk about. Not solely on the actual premise, although it does add a little to it, but on the way it’s structured. It reminded me of my own childhood shows that had three separate story arcs that had a basic theme to it. With an anime plot involving a cute squid girl trying to invade the entire planet by herself only to be undermined by a bunch of people who own a food court near a beach, you’d think that would speak of random hijinks that will only appeal to prepubescent girls. Fortunatelythere can be some merits in here that could speak to any age group.\\n\\n\r\nFor starters, Squid Girl has a plot that is hardly focused or has any substance to the original goal that the squid character, named Ike, intended on doing. It mostly involves her trying to learn about humanity and the culture of Japan that she is settling in. It’s essentially a show based around culture shock and how foreigners try to adapt to a different country that they have no idea about. With the tone of the series being light-hearted and comedic, they handle it pretty well without hampering on the basic premise being in conflict with the comedy. It’s fairly entertaining to watch and at times funny to see Ike acting very holier than thou upon the people she meets, when in fact she has no power over the others whatsoever.\\n\\n\r\nWith a show like Squid Girl, you need to supply with great characters that are both funny and memorable to watch. While there are definitely some that garner a lot of entertainment, others are not fully realized and don’t add much depth with the comedy. The best ones that I ended up liking the most were Ike, Eiko, and Chizuru. They all have so much great chemistry together and make a lot of great gags work perfectly. Chizuru herself provides some of the best scenes involving her having a nice personality but once something bad happens to her or the workplace she turns menacing to the person doing the trouble-making. Ike herself, voiced by the always charming Hisako Kanemoto, gives the show a great sense of passion towards making this Slice of life atmosphere into an entertaining comedy with her constant alluring presence in every scene.\\n\\n\r\nUnfortunately not all of the cast hits the level of greatness along with our three main characters. Sanae, Takeru, and Goro all don’t have the same great chemistry with Ike as she does with Eiko and Chizuru. That’s not to say they’re terrible, or even bad, they do have some funny moments but it’s essentially just them acting very googly eyed over Ike’s presence in the world that quickly doesn’t have much to go for in the grand scheme of things.  For example, Sanae’s only gag for existing in the show is to be all lovey-dovey over Ike and nothing else. Sure it does get a few laughs but after a while the joke just falls flat and gets old quickly. If it wasn’t Kanae Itou’s adorable voice playing Sanae I would probably think lesser of Sanae to be honest.\\n\\n\r\nAnother problem I had with the show was how each of the plot arcs end so abruptly. There are times when a plot arc would end and it didn’t feel like that particular scene felt any kind of closure for it. It ends relatively quickly and we’re brought up into a different scene. The problem being that the way they interlude between a different arc is by showing a cut of arrows that are supposed tell us that we’re doing a different arc but it happens so fast that you barely even notice it because of the fact the arc beforehand had barely an ending. In turn, some of the arcs felt like they were rushed or they weren’t finished in the writing process during production.\\n\\n\r\nIn short, I thought there wasn’t really anything special to be found in Squid Girl. It might be something that you might show to your younger daughter to have some fun with, but on the other hand there are actually some nice humor for adults as well. It might be a stretch to say that this is Japan’s answer to Spongebob, the only difference is that Spongebob actually had a lot of great memorable characters while Squid Girl only had three that are even worth discussing over. It’s a harmless show for what it is, a decent entertaining show for older kids. Even with some of the adult innuendo thrown in, but hey that’s at least that's something that most kids shows are hardly about these days.\\n\\n\r\nGrade: B-",
            "date": "2013-06-07T23:27:00+00:00",
            "helpful_count": 49,
            "mal_id": 100183,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=100183"
        },
        {
            "content": "That's right de geso!  I have come to tie you in my tentacles and make you my undersquid de geso!  Don't even THINK of trying to escape from my wrath DE GESO!\r\nShinryaku! Ika Musume is quite a refreshing retake of the slice-of-life comedy scene.  It was really nice to finally get one that didn't cop out and take the way-too-overused (high) school setting.  The premise is actually quite creative and leads for some equally creative little stories and jokes as well.  (Who knew the idea of a squid girl could be so interesting?)\r\nThe series is really the only thing I'veheard of to use tentacles so innocently.  When most people think of tentacles, they obviously think of hentai, and all the various disturbing images that stirs up to go along with it.  Well, this show is definitely PG-safe.  Tentacles are used for USEFUL things--like serving half a dozen tables at once, or playing beach volleyball, or swatting your stalker away from you like a fly, or...\\n\\n\r\n...Wait, what?  Oh yeah.  Slap stick. =D\\n\\n\r\nOn the note of PG-safeness, I'm happy to inform you that there is zero fan service, so you pedophiles lurking around looking for pervy loli-fests or mindless moeblobs should GTFO.  Right now.  Hell, if it weren't for a few instances of light profanity (\"damn\"), the show probably could garner a G rating.  (I don't see what the point of even including any profanity at all was.)\\n\\n\r\nWhen writers decide to incorporate moe into their works, they always have to be careful to observe the line between moe and moeblob--that is, if you overdo the moe, they lack any other definable traits--physically or character-wise.  They become defined strictly as MOE.  (Oh gawd K-On!)  Well, I'm pleased to report that Ika Musume does not cross that line (although there are a few precarious instances when that line is flirted with far too intimately).\\n\\n\r\nIka is moe, yes, but moe mostly in terms of her personality.  She is laughably curious about everyday things we don't think much of, like umbrellas, birthdays, and fireworks.  She's afraid of inflatable killer whales and sharks, but thinks nothing of walking through cemetaries at night, nor is she even scared of ghosts.  She came to \"invade\" the surface world, but her good nature keeps getting the better of her and pushing her goal farther away.  She acts menacing, but it's obviously a bluff, as she obviously cares about the well-being of those around her.  She even has a couple funny speech naunces to top it all off.\\n\\n\r\nThe show really IS all about Ika.  She is, by far, the character with the most colorful personality, range of emotion, and variety of facial expression.  The supporting cast isn't bad, though; some of them actually have some depth and undergo development, but equally as many are just flat in terms of personality.  (This isn't to say they don't add anything or aren't entertaining, though; quite the contrary.)\\n\\n\r\nAnimation and art are quite crisp, clean, and clear: the show is quite pleasing to look at.  Bright and vibrant colors make up the vast majority of the spectrum utilized, and scenes are mostly sunny and light-hearted.  Animation is pretty well-done as well, with no real problems or corner-cutting I could see.  Facial expressions--particularly those of Ika--are great.  All in all, quite effective and above average.\\n\\n\r\nThe OP is alright, sung by Hisako Kanemoto (Ika's seiyuu) although it begins by chanting \"Shinryaku!\" over and over again, in the most annoying pitch possible, at a volume twice as loud as the rest of the show.  (Don't get me wrong; I have no problem with her voice; that part is just really annoying.)  And it starts as soon as the episode begins, so you'll have to be really fast to avoid getting your ears blasted.  The ED is actually a pretty touching piece that I would call Ika's theme song, since the lyrics fit her so well.  The voice acting is pretty great, but Kanemoto definitely steals the show: she acts the squidding INK out of her role. ;)\\n\\n\r\nShinryaku! Ika Musume is quite the enjoyable break from the hum drum stereotypical school comedy scene.  It deserves a chance just for daring to be different and breaking from the mold.  It even incorporates some pretty emotionally touching moments in there as well.\\n\\n\r\nNow, I'm off to conquer the rest of this thing you humans call MAL de geso!",
            "date": "2012-03-12T12:17:00+00:00",
            "helpful_count": 30,
            "mal_id": 55843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DraconisMarch",
                "username": "DraconisMarch"
            },
            "url": "https://myanimelist.net/reviews.php?id=55843"
        },
        {
            "content": "I was eating instant ramen while watching the first episode... I never thought I'd start a review with that sentence, but it leads to a point. I almost threw up when Ika Musume did you-know-what to the pasta, but then I was choking from laughter by the time the episode ended. The entire series left me a similar impression, from disgust and rejection to appreciation and attachment.\r\n'Shinryaku! Ika Musume (Invasion! Squid Girl)' is an anime series that appears to be flawed in almost every way imaginable, but somehow... somehow, I found this series to be extremely enjoyable and memorable. Ika Musume has invaded my mind.\r\nCase1: Premise.\\n\r\nIncompetent invader from another world appears, and gets her butt kicked in the very first encounter with human beings. After that, the \"invader\" joins the family, but still plans for world invasion while easily getting distracted by all the unfamiliar things on Earth. It's baffling how similar the premise of this series is to 'Keroro Gunsou'. In fact, if they toned down Sanae and violence by a bit, it would totally pass for a children's show. While nothing can excuse the show's lack of originality and the fact that nothing makes sense with the premise, 'Ika Musume' has a lot going for it that makes it different from an average show.\\n\\n\r\nCase 2: Lack of Direction.\\n\r\nOne would expect a simple friendship comedy from such a premise. Ika Musume bonds with family members and others in town, then gets inspired by their kindness, right? While that's one of the themes of 'Ika Musume', there are also a lot of other things going on. A lot of actual battle scenes with Ika Musume's tentacles, a lot of slapstick comedy, a lot of depth in some episodes (Mankind's triumph over nature? Bonding with the mini-Ika Musume? The umbrella episode?), a lot of romance, and slice of life? Loli moe-blob? Other than comedy, it's hard to say what this series is, as it's packed with themes despite the triple episodic chapter format. Ironically, the lack of direction (central theme) in the story was offset by the direction (presentation by the director). It didn't exactly feel like this series went all over the place and got nowhere, it felt like I got to see many sides of Ika Musume's story.\\n\\n\r\nCase 3: Characters\\n\r\nAt first, Ika Musume seems like nothing more than a moe-blob dewa naika? A deliberate attempt for cuteness de geso. The squid hat, the dress, and over-sized eyes seem like obvious moe ploys de geso. However, her appearance is actually a part of the story ja naika? Her character really grows on you dewa naika? Other characters were also stereotypical cardboard cutouts de geso. Especially the way they random appear in different episode limits their character development ja naika? Still, they somehow manage to leave an impression, and their personalities are very distinct ja naika? What all characters possessed, was inherent charm that makes you care about them de geso. Despite how incompetent she is at invasion, you would find yourself rooting for her dewa naika?\\n\\n\r\nCase 4: Buildup\\n\r\nYes, every one of Ika Musume's sentence ends with \"jana/dewana-Ika(Squid)?\", homophone of \"Isn't it? / Don't you think?\", or \"de-geso(tentacle)\", a cuter(?) version of \"desu\". It was kind of cute at first, but gets annoying very quickly... and this persists for almost the entire duration of the show. However, she stops just when you're totally sick of it, and just like the supporting cast in this show, I felt like it's not her without her quirky speech. I actually missed it. That chapter would've never worked unless you're certain the audience would be emotionally attached by then, and I was attached despite finding her speech to be very annoying. The director has done an excellent job in building up for moments like this, also mixing in a couple of slow and emotional chapters with fast-paced slapstick chapters.\\n\\n\r\nCase 5: Retro\\n\r\nThe physical and pun-heavy comedy in this series is really old fashioned, but I found myself laughing through the stupid and predictable jokes nonetheless.\\n\r\nThe character design other than Ika Musume, and the atmosphere also had a really retro anime feel to it. The way Ika Musume, the Invader From the Bottom of the Sea, and the action/scary scenes stood out from the rest of the show was really wonderful. This is my first series with Diomedea as main animation studio, and I have to say I'm really impressed. Color specification and consistency of drawings were particularly stunning.\\n\\n\r\nCase 6: OP\\n\r\nThe OP 'Shinryaku no Susume (Advance the Invasion)' is SUCH a bad otagei song with strained anime voice, but the way it starts and the beat is just so addictive. I found myself skipping it after the second episode, but drawn back and listening to the whole thing by second half of the season. ED was a poignant song that makes you reflect back on the story, and had a nice simple touch with an object variation added to each episode.\\n\r\nBGM was rather ordinary , and didn't play a big part in the show.\\n\r\nIka Musume's voice by Kanemoto Hisako was absolutely perfect, which made her character all the more adorable. Everyone else also sounded like they should.\\n\\n\r\nI was very skeptical about this series, but I've been captured by the tentacles of Ika Musume.\\n\r\nDream and magic is what traditional anime is supposed to be all about, and this series takes it back to the roots. I can't guarantee you would like it, but 'Shinryaku! Ikamusume' is definitely worth a shot if you haven't seen it already.",
            "date": "2011-01-09T11:15:00+00:00",
            "helpful_count": 17,
            "mal_id": 33596,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=33596"
        },
        {
            "content": "This is the kind of show that you could just watch and enjoy.\r\nThe story itself is quite original and simple. It gives a nice setting for a comedy like this, but there's still not much to it. To be fair though, you wouldn't expect much from the story anyway, so you probably wouldn't be disappointed at all.\r\nThe comedy however, is simple and funny. It doesn't need much cultural reference to understand, and its jokes aren't forced or awkward. It has a comedic style similar to Azumanga Daioh, and maybe also like a crazier version of Yotsuba, which also applies to the art style.\r\nThe charactersall follow a common archetype, but it doesn't make the show feel cliche and boring. Though Ika Musume is the center of the comedy, each character has their own comedic traits, and are all combined in a very balanced manner.\\n\\n\r\nAll in all this makes a great comedy, and a very enjoyable slice of life. But, if you're looking for something with a great story, tear dropping drama, or maybe some gorgeous art, this is definitely not something you should watch.\\n\\n\r\nI take that back, after watching episode 5, I must say, there is actually some tear dropping scenes.  And some very heart warming moments.",
            "date": "2010-11-02T15:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 31785,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403302.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AppleBread",
                "username": "AppleBread"
            },
            "url": "https://myanimelist.net/reviews.php?id=31785"
        },
        {
            "content": "Ok, so just 2 more episodes and this anime is already nearing its end, so what can I say about this anime? Well, let's put it this way according to how I rate this anime:\r\nSTORY:\r\nOriginally, the plot of this story is about nature fighting back against humans who pollute the seas with garbage and with the help of squid girl Ika Masume and her so called invasion force of half human and half squid, which,by the way she seems to had forgotten bring it along with her at the start of the anime- talking about letting a girl do a grown-up's job. But,only to getsidetracked by working in a seaside eatery, fumbling around as she learns with the everyday life on the surface and having a  relationship (including harassment from 2 lesbians Cindy and Sanae)  with the surface dwellers, though, the comic side of it is cliche, I thinks that it still deserve a fair score of 6.\\n\\n\r\nART:\\n\\n\r\nI have nothing to say about the art of the anime,but the artist's impression on how the characters and the background were drawn would literally give one an impression as to what the anime is without telling the audience about its synopsis. Then again, there were some awkward parts of the character's appearance e.g. the sharp ends that were sticking out on the left side of Eiko and Chizuru's hair,the design of Ika's tentacles and the baseball team were Ika participated. But in fairness one can simply just forgive it, so, a fair number 6 it is.\\n\\n\\n\r\nSOUND:\\n\\n\r\nNo comment for the sound, and I like the opening theme of the anime, so it deserves the number 6th spot for its rating.\\n\\n\r\nCHARACTER:\\n\\n\r\nI don't have much comment for most of the cast, but for Gorou to be called \"Life Saver,\" kinda make the term an awkward definition of his occupation, I don't know for sure if it is the fault of the author or is it the translation, but the proper noun for the said character's role is \"Life- Guard.\" Also,I'm no marine biologist, but,if Ika Masume is a squid girl then she belongs to the species of cephalopod and should only have 8 tentacle instead of 10, she should also swim using jet propulsion instead of using her tentacle and she should also have    chromatophores  that enables her to either hide,glow or communicate with other squids in the water and depending on the species of Cephalopod an ordinary squid can live only about 10 years in captivity . I guess both the author and artist don't know anything about squids except when eating it as sushi. Then again,who cares? As long as the character entertains,then it is decent enough to rate it as number 4. \\n\\n\r\nOVERALL AND ENJOYMENT:\\n\\n\r\nDecent enough to be viewed by all ages, so number 4 it is.\\n\\n\\n\r\nTrivia: Humboldt Squids can grow as much as 30 feet.\\n\\n\r\nIt is  estimated that there are at least 1000 tons of non biodegradable garbage floating around the world's oceans.  \\n\\n\r\nJapan is a known consumer of Whale meat , according to Greenpeace data. \\n\\n\\n",
            "date": "2010-12-10T13:31:00+00:00",
            "helpful_count": 14,
            "mal_id": 32638,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=32638"
        },
        {
            "content": "Squid girl was something I found while just browsing around for something to watch. Its intriguing title led me to watch over the weekend and I feel glad that I watched it.\r\nStory 3/10\r\nStory in itself is not very great at all. It is one of those short animes but it does not do much with its story though thats mainly the fact that it is for the most part a comedic anime. The line, \"I am Squid Girl, emissary of the sea,\" would make you think what else could Squid Girl do with herself besides spit ink and use her tentacles. \r\nArt 8/10\r\nIts a prettygeneric art style but yet its not overdone. Some of its realistic art skits are really amazing and it made me laugh a lot. Its as simple as that.\\n\\n\r\nSound 9/10\\n\r\nThe music is really good. The opening is very loud and takes a little to adjust too but it really grew upon towards the end of the anime. The credits are very soothing at the very end of each episode. Overall  I would say the sound in general describes this anime very well. Its not too overpowering but at the same time its very relaxing in general.\\n\\n\r\nCharacter 8/10\\n\r\nI find many of the supporting characters in this to be rather \"prop-like\" in the sense they are generally used as comedic relief. However many of the main characters such as Eiko and Chizuru show that average \"grown upon attitude over annoying main character\" as the anime progresses on. However I don't find this very bad at all, in fact it actually kept very hidden which in turn makes it really interesting. As for our main character Squid Girl [aka Ika] she has the style of an annoying but also comedic main character role within the anime. Though I really like her as a whole and she reallly grew upon mea s the show went on. She was always there to make you laugh with her llack on human knowledge which makes her quite unique.\\n\\n\r\nOverall 7/10 \\n\r\nI really enjoyed this anime but the lack of story made me feel like there was something missing from it. Though thats not to say its a bad anime. If you enjoy many small comedic skits and very semi-realistic events yu will love this anime. There are not many spots it will make burst out in pure laughter but yet you will never be in a bad mood when watching this anime. I feel if you really want to enjoy this anime watch it in small parts when your feeling sad or down and I assure you it will make your day better.",
            "date": "2014-11-16T12:12:00+00:00",
            "helpful_count": 13,
            "mal_id": 168841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4131017.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheAfroNinja",
                "username": "TheAfroNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=168841"
        },
        {
            "content": "The story is pretty simple, its about a girl who comes from the see and proclaims to be a squid and has come to invade earth because she believes earth is responsible for polluting the ocean, the show does mention this a few times as if trying to send an obvious yet subtle hint at real world problems.\r\nIts a great slice of life and spends most of its time on the beach in a cafe hut and its surroundings and is just brilliant at how it uses its comedy, which mostly comes from Ika Musume out lead girls over active imagination and thus always comesup with new jokes while recycling some jokes multiple times as well.\\n\\n\r\nEach episode is split up into three parts and focuses on something different each time and after each part it seems to have reset itself as if the previous actions never happened but does reference past events, a beach hut magically is completley rebuilt by the next episode.\\n\\n\r\nThe opening theme song is a typical catchy tune you expect from these type of comedies and is sung by one of the side characters and has a few cute visuals accompanying it. The ending is a slow song compared to the opening and is decent as it a nice comparison. Voice acting is ok, they do there job in making each character adorable especially Ika whose ~de gezo is addictive.\\n\\n\r\nArt is simple, the character designs are really simple and not a lot of detail goes into them, there actions however are well drawn and animated and some unatural parts can be forgiven like the sisters hair. Backgrounds are simple as well but they don't require super high detail, one thing i didn't like and never like in any show is lack of movement in those backgrounds, some wide shots including people on the beach are completely static.\\n\\n\r\nCharacters the most important part of this show as i makes up for the simple art and sound. Ika Musume or protagonist is the messenger from see who want to take revenge for the pollution of her home, the ocean, things don't quite go as planned as she is soon forced into working off her debt, the comedy of her imagination and her love of shrimp are the driving force for this show. Eiko is the one that forces Ika into working at her beachhouse and does not hold back when Ika screws up. Chizuru is Eikos sister and on the surface is the most caring of the two and really cares for Ika but deeper inside lies a more darker Chizuru and is one of the things that Ika is terrified of and she seems to always come to the rescue in various events. All side characters are great though are used to repeat jokes, we have a lifesaver who has a crush on chizuru, a girl who is stalkeresque towards Ika, a group of MIT graduates that believe Ika is an alien and wish to study her but get on your nerves no end. The sisters little brother and Nagisa a girl terrified of Ika make up the cast.\\n\\n\r\nShinryaku! Ika Musume is a very sweet show that is incredibly funny and even throws in a little tear jerkiness during one of the parts of an episode and its wide variety of characters will keep you laughing.",
            "date": "2010-12-22T13:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 32968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/265292.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NoblesseOblige3",
                "username": "NoblesseOblige3"
            },
            "url": "https://myanimelist.net/reviews.php?id=32968"
        },
        {
            "content": "I know this might sound a little girly coming from me, but this is one of the  cutest animes I have seen. The is that a girl called Ika Musume, which I think is japanese for Squid Girl, comes to the surface to invade the human race for polluting the ocean. However she knows nothing about the human world and when she busts a hole in the resterant called Lemon (I think), she ends up working at the place with to a group of two sisters and a brother to pay for the damages.\r\nCharacters are the best I seen in any other anime composingof Ika Musume, the family of siblings, a lifeguard, a girl crazy for Ika, a person afriad of her, a American scientist lady and her three weird companions, and a middle school girl Ika becomes friends with. There are a few more, but it's hard to label every character's personalitiy.\\n\\n\r\nLove the art, it shows you that this is a cute and happy and funny anime. It mostly takes place on the beach, still it's cute.\\n\\n\r\nSound and music are great. I love the beginning theme that goes \"Squid girl,Squid girl, Squid girl, Squid girl invade!\" Love it! It matches the kind of anime Ika Musume is!\\n\\n\r\nEnjoyment should be over 10! Lot of humorous scenes, story lines, etc! Overall this is an anime is worth watching! Unless you're not into cute stuff. But still watch and be amazed!\\n\\n",
            "date": "2011-04-23T14:05:00+00:00",
            "helpful_count": 12,
            "mal_id": 36365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326384.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/trishoverman47",
                "username": "trishoverman47"
            },
            "url": "https://myanimelist.net/reviews.php?id=36365"
        },
        {
            "content": "First episode was kind of rough in my opinion. It gave me an idea of what the show was gonna be like and i was not liking it. Thankfully episode 2 i got really into it and enjoyed the rest of the show. \r\nSquid Girl herself is pretty awesome and kind of adorable in her own way. I always liked the idea that she is some ancient being from the sea but just has the body of a middle school girl and isn't the brightest. \r\nEach episode i found myself laughing. Even the 1st episode that i didn't think was the greatest. There is evenone episode that is more like a side story that the crazy girl made up that is actually kind of sad. They even changed the color pallet to be more grey and less colorful. It's kind of weird with it being in this comedy show but it is nice.\\n\\n\r\nEasily for me the thing i dislike the most is the Scientist group. They aren't fun, They're boring and most of all they're annoying. I kind of like the blonde chick of the group. But i feel she is kind of wasted on them. \\n\\n\r\nI also don't like at the start how much everyone seems to shit on Squid Girl. \\n\\n\r\nThe little boy of the group i'm not a big fan of either. As soon as i saw him on screen i was immediately thinking i wasn't gonna like him for the entire season and i was  right. But he's not that bad in the end i guess. He did have some moments that made me laugh.\\n\\n\r\nThe art is nice and charming in it's own way. Kind of has a look of 2006 anime mixed with a modern look to it. \\n\\n\r\nThe music i like. The OP is goofy and funny while the ED has a kind of nice laid back tone to it.\\n\\n\r\nOverall a good show with a somewhat of a rough start.",
            "date": "2018-04-11T21:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 277804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=277804"
        },
        {
            "content": "Shinryaku Ika Musume is the story of a squid girl who invades the surface because humans are ruthlessly polluting the sea. She subsequently gets side-tracked and ends up working at a beachside restaurant stall. The story, while creative, is essentially just a framing device for the zany comedy. So the real important question is: does the comedy work?  The answer is an ardent yes. The situations Ika Musume ends up in are generally pretty mundane but her involvement adds a surrealistic element that works very well. The result is pure hilarity. One of the best aspects of the humour is that it never fallsinto the realm of using random pop culture references as jokes, which so many inferior comedies do. The humour is also very natural. It always arises from the situation and feels very natural for the characters.\\n\\n\r\nThe characters are really what makes the comedy work. They have just the right blend of major and minor characters to make any potential situation humorous. The major characters are also well developed. Which is surprising, since comedies have a tendency to use stock characters.\\n\\n\r\nThe art is decent. the backgrounds tend to be really vibrant and detailed. When they draw normal sea creatures they do it very well. The only real art issue is that the characters all have similar faces.  \\n\\n\r\nThe voice work is decent. It doesn't really stand out, but it's suitable for the characters and emotions are expressed well. The music is really hyperactive and upbeat. It suits the series perfectly. \\n\\n\r\nThe yuri factor is an 7/10. Sanae loves Ika. Ika has a thing for Nagisa and Ika and Eiko share some really homoerotic moments. The only issue I have with the yuri in this is that some of it, specifically those with Sanae, seems pretty exploitative. To put it simply, it seems like it's put in, not because it works for the characters, but because the writer finds it funny. \\n\\n\r\nMy final rating for Shinryaku Ika Musume is an 8/10. It has a few issues, but it's hilarious and a lot of fun to watch. The humour isn't forced or based on random pop culture references. If you enjoy zany comedy like Galaxy Angel, Kanamemo or All Purpose Cultural Cat Girl Nuku Nuku, you'll probably enjoy this as well.",
            "date": "2011-09-21T10:53:00+00:00",
            "helpful_count": 10,
            "mal_id": 43889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=43889"
        },
        {
            "content": "Sometimes in the anime world, there are a lot of sub-genres that are very subjective, depending on what kind of anime you’re watching and one of the other subjective forms of media is comedy. For example, some people can like Love Hina for being some new turn of the Harem genre but most of them (including me) hated it for how annoying and juvenile it is. Others like Azumanga Daioh & K-On! For being innocently enough funny to entertain people for all ages without being too edgy and for others, they find it either too boring or moe for their taste. For me, comedy isone of other favorite mediums of today, simply because I like to laugh at some good humor material and the keyword being GOOD.\\n\\n\r\nSquid Girl has come to the land from the depths of the sea to conquer humanity for its pollution of the ocean. Unfortunately she ruins the first house she uses as an invasion base and has to work to pay for repairs. Of course, she can't overcome the Aizawa sisters who manage the house, so who know whether she can subjugate humankind.\\n\\n\r\nThe premise is the fish-out-of-water plot with a lot of comedic scope and while watching it, I enjoyed some of the antics that Squid Girl gets herself and a few others into. The show goes by showing 3 part episode, with the segments being 7-8 minutes, much like American cartoons in the past, present and future, so I can see a little inspiration from that and for those who love to use puns a lot, this show has plenty of squid puns to go around, even the episode’s title cards uses them. \\n\\n\r\nI really enjoyed the characters and their interactions with each other, especially the main character of Squid Girl, who really wants to be taken seriously as an invader but is not up to the task of that, considering she can’t even conquer a local eatery shop but for her character development, she plays it as being a cute mascot-like character without being overly annoying and grating and she never once toss aside her plans for world domination for no reason but it’s not like she’s going to invade any time soon with the Aikawa sisters, with Eiko as the strong-minded and no-nonsense sister who always need to keep Squid Girl in check and there’s Chizuru, who I think if Brock from Pokemon & Sakura Matou from Fate/Stay Night had a baby with the mindset of Ryoko Asakura from Haruhi Suzumiya and it’s her and she was even more of a bizarre character in the show than the title character and the sister’s little brother Takeru, who is more akin to Squid Girl as a playmate; Sanae, Eiko’s neighborhood friend who is very obsessed with Squid Girl, so much that is frightening and enters into Hentai territory; Nagisa, a surfer girl who is actually afraid of Squid Girl and she’s very paranoid about it. Plus, Squid can use her fear for her advantage but mostly it’s just to mess with her. There are other characters including the American scientist Cindy Campbell (not the one from Scary Movie), who and her three fellow scientists from MIT want to study Squid Girl to see if she’s an alien; Kiyomi Sakura, a minor character later on in the show whom Squid has become close friends to and Goro, the lifeguard who Squid riles up every now and then and also has a crush on Chizuru.\\n\\n\r\nThe animation was done by Diomedea (or previously Studio Barcelona), whose only known project I have heard from them is…..Kodama No Jikan….okay, not the best title to be represented but this was some great animation, especially when it came to animating Squid’s tentacle movement. Also, since this is a gag-based anime show and for that, it was acceptable for doing that, maybe not on par with Azumanga Daioh & Sgt. Frog but it’s very good nevertheless. Now, I didn’t mind the music here that much but it was rather fitting and appropriate for the show, although if you ever sing this to somebody’s ears real loud, you are most likely to get punched.\\n\\n\r\nNow, I know there are two seasons of this show but I just been commenting strictly on Season 1 and their dub done by Bang Zoom Entertainment and was released by Media Blasters and I thought about the voices on that. Christine Marie Cabanos has been one anime VA rookie that I personally want to succeed in the business, (to me she’s a younger version of Stephanie Sheh), and her performance as Squid Girl fits the criteria of her cute and upbeat nature. I will say for Cristina Vee in her role as Nagisa is very similar to her role as Mio in K-On! (very paranoid and easily frightened) but then again, I don’t know if the K-On!! dub was produced before or after Squid Girl but it’s hit or miss and I really enjoy the dub.\\n\\n\r\nFINAL VERDICT: While not being something I would add to my top ten lists, this is a very fun and energetic show that never gets too boring or too hostile. I enjoyed all the characters, even the minor ones who can manage an impact into the series and the gags can be very funny although the squid puns did get too old too quick in my opinion. I do wish that Season 2 will get dubbed someday since Media Blasters no longer has the license to that one and possibly get Sentai Filmworks to license it and get the original cast back on that.\\n",
            "date": "2013-04-13T13:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 93633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1028709.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HybridMedia",
                "username": "HybridMedia"
            },
            "url": "https://myanimelist.net/reviews.php?id=93633"
        },
        {
            "content": "This anime at the first glance shows that this is one of those anime for comical and funnies. From what I heard, the director who made \"Hare and Guu\" is in charge of this, so this already kind of gives it away that this is going to be a fun one.\r\nMuch like Hare and Guu and other animes, it only goes up to certain quality of story and art, but what matters is the characters, and the anime does a good job giving a brief character description in the first episode and still be fun while elaborating it.\r\nSo for those of people who want seriousaction, drama or love, there won't be much here (or much from what I saw), and those of who wants light, relaxed and just enjoyable entertaining and valuing funnies more, then this will be good.",
            "date": "2010-10-06T09:48:00+00:00",
            "helpful_count": 9,
            "mal_id": 31152,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/392309.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DVTClark",
                "username": "DVTClark"
            },
            "url": "https://myanimelist.net/reviews.php?id=31152"
        },
        {
            "content": "What's not to love about an anime with the english tidetle, \"The Squid Girl: The Invader Comes from the Bottom of the Sea\". In truth, I was inkspecting this anime to be trash, and I was not dissapointed. It is trash; simply the best kind of trash. If you were to look at my ratings you would see a wall of 7s followed by a 9 for enjoyment. This is because my enjoyment of Shinryaku! Ika Musume massively exceeded the show's actual quality. There were moments where I was laughing uncontrollably, but the fact remains that in terms of actual quality the show is fairlysimplistink.\\n\\n\r\nShinryaku! Ika Musume sinks or swims on its main character, Ika. All the other characters feel a squiddle one-note with the inkception of the other major character, Eiko. However, Eiko's role as the \"Mature one\" limits the enjoyment of her character. Therefore; the show's enjoyment stems primarily from Ika, with other characters providing entertainment through inkteraction with her. This means that if you don't like Ika, you won't like the show. However, I think this is a moot point, as Ika hershelf is such a vibrant and eninkmatic character that it doesn't really matter.\\n\\n\r\nTo conchclude, while Shinryaku! Ika Musume is hardly a masterpiece, it is most certainly a lot of fun. If you're worried that it seems a bit fishy, why not give it a watch and see for yourshellf. I highly reccomend it if you're after something entertaining. It is inkredible how much joy can be developed from such simplistink execution.",
            "date": "2018-12-14T15:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 295772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DiscordLexia",
                "username": "DiscordLexia"
            },
            "url": "https://myanimelist.net/reviews.php?id=295772"
        },
        {
            "content": "For decades, mankind has taken the vast, epic ocean environment for granted. As our technology has advanced, so has the scale our pollution, with oil, garbage and toxic waste killing millions upon millions of innocent aquatic life forms. But now, the world below the surface has finally taken enough abuse from the world above, and they’re sending their most powerful, most terrifying soldier to deal with us.\r\nAll 1,000 of us.\r\nOkay, so it’s information may be a bit dated, but it’s desire to enslave us and force us to pay for our crimes is no laughing matter. She’s coming, and we have no choice to prepareourselves... For the most adorable invasion of mankind since Night of the Lepus.\\n\\n\r\nYes, it’s not Godzilla, it’s Squidgirl, a vertically challenged moppet who looks almost human, save for the series of blue tentacles that make up her hair. Or Ika Musume, as Japan calls her.She comes ashore one day, bursts into the Lemon Beach House, and announces to the first gathering of humans she sees that this world... And all the people in it... Now belong to her!\\n\\n\r\nUnfortunately for her, this declaration is met with laughter, and she soon winds up working a low level job at the very beach house she just threatened. Like Ika, this beach house is owned run by a small family of siblings... They have no parents, because it’s an anime. The most important of the three is Eiko, a high school student who acts as a foil for all of Ika’s hare brained schemes and delusions. Takeru is a little boy who... genuinely acts like a child, surprisingly. He gets along very well with Ika, as he’s more than willing to play along with her. And their oldest sister, Chizuru... Well, telling you about her personality would spoil one of the greatest moments of the series, even though it happens in episode 1, so I’ll just leave it at ‘she’s awesome.’\\n\\n\r\nThe animation is nothing special, but it’s a little above average by Slice of Life standards. There are a lot of key frames, but when it wants to impress you, it will not hesitate to do so, saving it’s budget for moments that really need it. Yes, the allocation of the budget may be a little too noticeable for some people, but you can’t argue with results, because whenever there’s action or physical comedy going on, there’s really nothing to complain about. Aside from the main character, the character designs are a little on the bland side, but they still have kind of a natural feel to them. Well, natural by anime standards.\\n\\n\r\nAnd speaking of our hero, the animation style works particularly well in favor of the Squid Girl herself, whose various cephalopod abilities make up the bulk of that action and physical comedy. For a good idea of how her tentacles work, think of her as a really mean parody of Lucy from Elfen Lied... the four deadly vectors have been swapped out for ten mostly harmless hair-tentacles that seem to have even more impressive abilities than Ika herself has. They’re powerful enough to break through a wall, strong enough to lift heavy objects, and fast enough to create a sonic boom, yet they’re also delicate enough to thread a sewing needle. And they can seemingly stretch indefinitely. On top of this, she can breathe underwater and use bioluminescence to glow in the dark.\\n\\n\r\nAnd yet, beyond these abilities, Ika herself is... Well, I don’t want to say stupid... Perhaps ‘naive and gullible’ would be better. Her knowledge of the human world seems very arbitrary and inconsistent. She’s able to do complicated math problems in her head, but she doesn’t know that she can’t eat the images on a 3D TV. It’s odd, but hey, it’s an episodic children’s show. Even My Little Pony had problems like that. And for what it’s worth, while Ika may be a little inconsistent, she’s a very entertaining little pain in the ass.\\n\\n\r\nAs enjoyable as the title character may be... Your choice of dub or sub will influence this, but more on that later... I can’t really say as much about the supporting cast. I wouldn’t go as far as calling them bad or unlikeable... Okay, maybe a few of them are... They’re just not all that interesting on their own. They’re mostly used as props for Ika to interact with, and to be fair, this is done to great effect. They support her, as a supporting cast should, but none of them ever really stand out, as they either get too little screen time to justify their presence or so much screen time that their best qualities become Flanderized. The only one that ever really rubs anybody the wrong way is Sanae, Eiko’s childhood friend, who has a lesbian crush on Ika... Which would be fine, if she weren’t so damn creepy and obsessed about it. Honestly, she’s the only real element of the series that I wouldn’t call kid friendly.\\n\\n\r\nThe English dub, for the most part, is pretty underwhelming. It’s a parade of no names and small timers, with the only big actors being Carrie Savage and the increasingly impressive Christina Vee. for the most part, the performances are either bland or adequate, although nobody really bombs it. What really surprised me was the performance behind Ika, who’s played by Christine Marie Cabanos. I’ve never really liked her as an actor... I thought she was miss-cast in K-ON!! and Madoka Magica, and while I didn’t mention it in my review, I freaking HATED her in Oblivion Island. But here, she was actually kind of good. She won’t be winning any Oscars any time soon, but her “every ridiculous thing I say sounds completely normal to me” delivery was a pretty good approach to take.\\n\\n\r\nThe Japanese track is infinitely better than the dub, however, and Hisako Kanemoto blows Cabanos completely out of the water. Actually, the performances are better all around, even if you can’t understand the language. Which I can’t. The dub isn’t horrible, and it should be enough to please those who insist on watching it, but unless you’re eager to hear a barrage of fish-related puns, the Japanese track is definitely recommended.\\n\\n\r\nI mentioned earlier that, aside from Sanae, this show is pretty kid-friendly, and I meant it. The stories are simple enough for a kid to comprehend, without ever really feeling too dumbed down. It’s episodic, split into threes like a Nickelodeon cartoon, but there’s still a sense of progress and development with the characters. It’s set on a beach, so there’s naturally a lot of scantily clad bodies walking around, but aside from that, there’s barely any traditional fan-service at all. It’s the story of an incompetent Invader losing touch with their origins as they adapt to human culture, and while we’ve seen that about a million times, it’s done pretty well here, with the constant otaku pandering that almost ruined Sgt. Frog left completely out of the equation.\\n\\n\r\nThe writing can get corny, and the characters can get a little stale at times, but it still smells of genuine effort and imagination. It never stays in a rut for too long, and there’s always a good laugh waiting around the corner. Actually, the writing in this show is a lot like the animation... It;’s hit or miss, but when it hits, it REALLY hits, and it doesn’t always need to rely on comedy to be enjoyable. There are some surprisingly touching scenes, including a chibi segment in episode five that’s so brilliant and creative that, with different music, it probably wouldn’t feel out of place in a Fantasia movie.\\n\\n\r\nSquid girl is available from Media Blasters, surprisingly. They’ve released the first season stateside. You can stream it legally on Crunchyroll, buy the DVDs on amazon, or just watch the whole thing for free on Netflix. There’s a second season, but it hasn’t been licensed, and I haven’t seen it yet. I will see it eventually, and when I do, I have some pretty high hopes for it... I want to see Ika’s home world be explored and explained a little more, I want a few certain characters to get some more screen time, and I want a few other certain characters to die in a fire.\\n\\n\r\nIn the end, Squidgirl is kind of a mixed bag. It’s a bit of an underachiever in almost every category, but it still makes for some great light-hearted, mostly family friendly fun. I guess the base breaker for most people will be Ika herself., seeing as how the best points of the series Some of you may find her unconscionably annoying, and I can understand that sentiment completely. This show is not for you. For the rest of us, myself included, she is nothing sort of adorable and charming, and if the rest of the cast has to act as her props, then good job... This show is hilarious. It’s not one of the best comedies out there, and repeated viewings over a short period of time may leave you feeling cold... Once or twice a year at best is advised... But for what it is, I loved it.\\n\\n\r\nI give Squidgirl a 7/10.",
            "date": "2014-05-23T11:48:00+00:00",
            "helpful_count": 6,
            "mal_id": 144247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=144247"
        },
        {
            "content": "Usually I'm not a fan of comedies, animes or otherwise. However this one was different, all the jokes were genuinely funny and the story surrounding the whole series was (while admittedly silly) well put together and enjoyable to watch. \r\nUnlike most anime this one follows a non-linear style where story is episodic, where each episode is a self-contained story that is loosely connected to the larger story as a whole. I feel like it adds to the atmosphere as well as helps to make the jokes that much more funny. It allows the writers to focus on how to make each individual episode good ratherthan to make the series have an overarching plot that keeps the viewer watching each episode. By using this style there is no need to watch it all in one go and you can watch it in pieces whenever you have the time.\\n\r\nIn this anime, there is no great evil threatening to take over the land, nor is there a need for our hero to find some sort of hidden power from within. This anime simply revels in each episode and makes the most out of what it has, and it really show. It makes for a fun and entertaining ride as you watch the series progress. \\n\r\nIka Masume, or squid girl, is a comical and sometimes outright dimwitted character that is always the focus of each episode. The way she interacts with the world that surrounds her, or more frequently how the world interacts with her, makes for a fantastic time.\\n\r\nWhether your looking for a lighthearted anime or just looking for a good laugh this anime is definitely worth checking out. Its definitely an anime I'd recommend and one that I'd re-watch any day.",
            "date": "2013-09-22T10:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 113811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3174645.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Redd396",
                "username": "Redd396"
            },
            "url": "https://myanimelist.net/reviews.php?id=113811"
        },
        {
            "content": "This show is so good, that after doing the math I found out that if we were to gather a squid girl body pillow, and the blu ray disc for shrinryaku ika musume, and send it back in time, we could give it to Hitler and prevent the holocaust. Once I reached episode 4 I realized just how powerful the tunes that play in the soundtrack are, whenever the opening song played my life flashed before my eyes and I was taken to heaven, that's right, this show is in fact heaven. There is no afterlife, once we die our spirits are sent to theshores of Japan and the reaper gives us the option to watch either this show, or attack on titan. Those who have chosen attack on titan are forced to watch the endless stream of meaningless dialogue and overbudgeted fighting scenes which hold no comparison to the Squid Girl vs Squid bot mk 2 3 and 4 fights.",
            "date": "2015-12-29T23:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 207274,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5086744.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bigjoesemporium",
                "username": "Bigjoesemporium"
            },
            "url": "https://myanimelist.net/reviews.php?id=207274"
        },
        {
            "content": "I've known about this anime for a long time know and I'll would always pass it by or say is this a gross hentai. One day in the App Store I was looking at the crunchyroll apps and stumbled upon the squid girl one. For some reason I was drawn to this one and the blue exorcist one, BUT I DIDN'T USE THE BLUE EXROCIST. Watching episode instantaneously drew me in. Squid girl is a very funny anime about a girl who tries to \"invade\" the surface to punish humans for polluting the sea. While trying to do so she becomes drawn to human customsand forgets to invade, fails to try to invade, or even being distracted by something while trying to invade. It like the anime keroro gunso/Sgt.Frog but less about the invading. Though I praise it so highly some people might not like it's humor because we all had different things that are funny. I laughed like crazy when I was 7 from seeing a bird on Saturday night live and the bird did nothing. Mind you watching squid girl will always let you have a good time and make you smile.",
            "date": "2012-11-11T19:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 77277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1757443.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BrigadeHamtaro",
                "username": "BrigadeHamtaro"
            },
            "url": "https://myanimelist.net/reviews.php?id=77277"
        }
    ],
    [
        {
            "content": "The problem with the anime industry is the continuous failure to capitalise on titles that are actually good, and instead redirect time and resources to producing shows that leave you as empty as a tectonic bowel movement. Every genre has suffered this iniquity, but while most bounce back with other, much better offerings (comparatively speaking), comedy continues to prove the medium's \"Achilles heel\". Those of you who are fans of Gintama may disagree with that perception, but consider for a moment the number of anime released during the last year that have borne the \"comedy\" label.\r\nNow have a think about whether they made you laugh,or simply made you smile (or in the worst case scenario, made you want to punch the people who made it in alphabetical order).\\n\\n\r\nBased on the manga by Anbe Masahiro, Shinryaku! Ika Musume (Invasion! Squid Girl), tells the story of Ika Musume, who has come from the sea to exact revenge on humanity for polluting the waters of Earth, and she plans to do this by conquering the world.\\n\\n\r\nUnfortunately her first foray onto land doesn't go as planned ...\\n\\n\r\nThe series is presented in the style of a sketch show rather than as a continuous narrative, with each episode split into three independent stories. Normally this approach would present several problems where plot and character development are concerned, but thankfully that isn't the case here as each tale is well crafted and paced, with little time wasted on pointless trivialities (which is ironic as there are people who would consider the whole show to be trivial). In addition to this, there is an autonomy to each chapter that allows for a variety of themes over the course of one episode, and this makes for some decent storytelling and visual gags.\\n\\n\r\nAs an aside, one thing that should be pointed out is the rather obvious homage to the first ten minutes or so of Up! that occurs in episode five. The nice thing about this particular chapter is that there has been a conscious effort to follow Pixar's example and simply use music, sound effects and imagery to tell the story, and the result is something ... rare, especially in terms of audio/visual choreography.\\n\\n\r\nWhich brings up an interesting point.\\n\\n\r\nOn the surface Shinryaku! Ika Musume looks a lot like the common or garden moe based \"comedies\" that abound these days, but as everyone knows, one should never judge a book by it's cover. The design principle verges on the generic at times, and this rather simplistic approach to the characters is reflected in the backgrounds and settings as well. The animation is generally decent, with nice movements and some interesting ways to use tentacles (I never thought I would ever use that sentence in an anime review), but the initial perception may be that Diomedea simply didn't try hard enough to make the series look great.\\n\\n\r\nThere is something that should be taken in to account though, and that's the fact that Ika Musume wasn't only made to make you smile. The main purpose of the series is to make you laugh, and that it does. The \"generic\" look of the show allows for a number of well executed visual gags and parodies, as well as some creative moments like the Mini Ika Musume chapter. In addition to that, the style of humour actually works better when the viewer is comfortable with the imagery, which may be the reason why Diomedea opted for a look that many people will already be familiar with.\\n\\n\r\nAfter all, it's reasonable to assume that the majority of viewers would find the slapstick comedy aspect out of place in a series series featured stunning scenery and beautiful characters, no matter how funny the show was.\\n\\n\r\nOne thing that is slightly annoying about Ika Musume is the devilishly catchy opening theme (Let's Invade by ULTRA PRISM featuring Kanemoto Hisako), which may have been designed to loiter in the viewers head, waiting for the opportune moment to strike. That doesn't mean it's a great song though, as it's a very typical example of the \"cute\" J-Pop anime introduction - with everything that entails.\\n\\n\r\nOn the other hand the ending theme, Metamerism by Ito Kanae, is a melodic ballad that's rather pleasant on the ears (even if it is a tad generic), but seems a little out of place in a comedy show. As for the incidental pieces, they range from slightly ditzy jazz styled jingles to the slow piano piece of the Mini Ika Musume chapter. Unlike many other shows though, the music is only pushed to the fore when the occasion demands, and one will generally hear it as a very subtle accompaniment to the on screen action (it should be pointed out though, that a good portion of the series features no music whatsoever).\\n\\n\r\nAs with any comedy, delivery is everything, and it's here where the seiyuu really shine. While the voice acting may sometimes be a little on the bland side, the characters really come alive when there's something quirky or funny going on. Kanemoto Hisako's performance as the precocious invader from the sea is actually pretty good, especially as her only other main roles are in Sora no Woto and Kore wa Zombie Desu ka. Her coordination with the other voice actors, especially Fujimura Ayumi and Tanaka Rie (the Aizawa sisters, Eiko and Chizuru), allows for some nice comedy set pieces.\\n\\n\r\nWhich brings up another point.\\n\\n\r\nBy its very nature, comedy isn't the greatest tool for characterisation or development, especially as the usual methods can seem out of place amongst all the slapstick. Ika Musume neatly sidesteps the issue by inserting a few choice tales that highlight a particular bond or personality trait, but it does this by creating a metaphor which can sometimes change the whole tone of the series. That said, any growth is sporadic, and there are occasions where viewers may find themselves wondering what the point of a particular chapter was.\\n\\n\r\nThere is a plus though, as the series creates comedy pairings between disparate, and sometimes unlikely, characters, which adds to the whimsical nature of the show. Eiko and Ika-Musume represent the primary straight and funny \"men\", but in truth there are multiple parings, trios and groups that form over the course of the series, all of which is only achievable because the characterisation is actually pretty decent for a comedy anime.\\n\\n\r\nNow I will be honest here, as I didn't expect to like this series as much as I did. That's not to say it's a classic, as there are definitely better purebred comedies out there, but when compared to many of the more recent offerings in that genre, the charm, quirkiness and feelgood atmosphere of Shinryaku! Ika Musume is definitely a step in the right direction. The series bears a few similarities in terms of style, content and layout to such comedy worthies as Potemayo and Jungle wa Itsumo Hale Nochi Guu (but without as much insanity), whilst Mini Ika-Musume didn't simply remind me of Pixar's Up!, but also of Binchou-tan.\\n\\n\r\nThere is something to bear in mind if you decide to give this show a try though. Comedy is probably the most subjective genre in any medium as it requires far more investment from the viewer in order for it to work, and one of the things that we in the West often forget is that the vast majority of anime are made for the Japanese markets. Because of that it becomes difficult for Westerners to relate to certain aspects of the humour, but that doesn't automatically mean a series is bad just because we don't understand it.\\n\\n\r\nBesides, after some of the debacles that have been produced over the last few years by an industry that's trying a bit too hard, it's a welcome change to watch something a little bit silly.\\n",
            "date": "2011-01-13T11:03:00+00:00",
            "helpful_count": 348,
            "mal_id": 33723,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=33723"
        },
        {
            "content": "I would never imagine, in my lifetime, to see a squid this adorable!\r\nIm telling ya, after years experiencing Squidward from SpongeBob Squarepants, I started to give up hope for all squids in the world... \r\nThat is until I met little Ika-Chan...\r\nSo what's so special about another failure invader anime? Don't we already have a frog for that? \r\nHow can you say that! Squid>Frog anytime!\r\nAnyways, the story isn't very deep and there's no much of a plot buildup however the comedy and cuteness is enjoyable nevertheless. You'll have a drama episode, a horror episode (Oh damn that doll was scaaaaary) and also a tearjerker moment (Ilove you Chibi Ika!)\\n\\n\r\nThe artwork was exceptional. It was able to portray the scenery of a beach perfectly to go along with little Ika's antics. The characters are well drawn especially in the expressions department.\\n\\n\r\nSound? Who doesn't like the sound of the beach! Great choice of background music to enhance the surrounding. I especially liked the squeeky sound you get when the tentacle rubbed against each other. (Reminds me of rubbing two pickles with each other)\\n\\n\r\nIka's character is developed nicely (Even though it's mostly appealing to lolicons). However she's still a kid at heart. But thats just the way we all like it. Coupled along with a \"geso\" at the end of every sentence, and WHAM! Try to resist that awesome cuteness! Other characters support her well (both her and her mischiefs)\\n\\n\r\nThis anime definitely has a considerable amount of re-watch value. The comedy doesn't get old easily. And I guess people would of course want to see my Chibi Ika! (But not those puppets.. That thing gave me nightmares!)\\n\\n\r\nOverall, it's a must watch for all you who adores cute and lovable things! If you dont? Then the comedy would still entertain you nicely. Personally, my favorite part about this anime is Ika's assimilation into the human world. It's nice when an invader understand how not all humans like us are bad. What? You think you're good too? Heck no... If you're watching this anime, chances are you're a sick pervert like me who was expecting tentacle rape.. \\n\r\nNah.. Im just kidding..\\n\\n\r\nHaremu Kingu,\\n\r\nSigning out!\\n\\n\\n\\n",
            "date": "2010-12-26T20:12:00+00:00",
            "helpful_count": 86,
            "mal_id": 33106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=33106"
        },
        {
            "content": "Adaption success? Adaption success. Unlike that of Dance in the Vampire Bund I had meant to do with a long time back with, among other things. Don't pay attention to my scores as my writing, as I tend to rate most things highly.\r\nThis is a simple show that does what it is supposed to, but is a big deal because shows like these can have a lot of expecation behind them from the manga fans like me. Could you imagine how much expectation you would have if someone animated Yotsuba&!? Exactly.\r\nShinraku! Ika Musume, is another Slice of Life Comedy show. A very good one. They'rebecoming very popular in recent year, so one may ask, why watch Shinraku Ika Musume? Because it is by no means below sub par. Many of these within the genre are kind of lacking in either the anime or manga. Shinraku Ika Musume started with a very solid manga beginning, and I believe that the first episode, is in fact, that the entire series will be successful in portray the charm that is Ika.\\n\\n\r\nAnd because I feel this way I am writing a review early to garner positivity for the show.\\n\\n\r\nYou get the premise of a girl who is trying to take over the world, because of ecological and animal rights type of reasons, and is practically a walking embodiment of Radical Ecologist Greens in moe form. So you won't find her accomplishing much of her goal to conquer the world, aside from her financial gains working at a restaurant. It is a Slice of Life comedy. It is episodic, not much changes.\\n\\n\r\nAnd Slice of Life and Comedy are not bad genres, just because what many people who prefer anime find exceptional about the genre, is Fantasy Action and Philosophy. And to someone who wants a good example of the sort of thing the genre should aspire to, can read some of the modern greats such as Calvin and Hobbes and of course Yotsuba&! Shinraku! Ika Musume, does the best job of keeping along in the tradition of better Slice of Life comedy shows. By one, having just enough and not too much moe focus, and having equally as good comedy situations. \\n\\n\r\nIka, is herself, a moeblob. But unlike a lot of Slice of Life shows, Ika Musume still takes a lot of effort in crafting good comedic situations in the form of short. The show does not once suffer in terms of comedy from the fact that Ika is a moe personification of Deep Ecology. I cannot stress well enough how well balanced the different things that lie in this manga and anime are, and how amusing I find it's comedy. Something that has carried me through chapter to chapter, begging for more.\\n\\n\r\nIf you are an anime fan because you like Fantasy scenarios, from the high ends of production and quality to the lower, because that is your taste, while having little interest in comedy and simple like Calvin and Hobbes like shorts, reminiscent of your Sunday Newspaper, Slice of Life anime, and as well, Shinryaku! Ika Musume is not for your.\\n\\n\r\nHowever, if you have just caught up with the very newest Yotsuba&!, Chi's Sweet Home, taking up Shinryaku! Ika Musume may even do a better job of an addition to such shows than the likes of K-On and Lucky Star have been. Simply because it's format, as interpreted in my mind, is a better balance of moe, the slapstick, and other comedy situations. And those comedy situations themselves, in my mind, being very amusing.\\n\\n\r\nClearly it is something that came off refreshing to me. And I hope that is has, or will be for you as well. Give it a try. Give it a try if you like this kind of material. For if you do, it is well worth your time.",
            "date": "2010-10-07T06:20:00+00:00",
            "helpful_count": 66,
            "mal_id": 31170,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64644.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ukonkivi",
                "username": "ukonkivi"
            },
            "url": "https://myanimelist.net/reviews.php?id=31170"
        },
        {
            "content": "I’m not going to lie, this show is a weird one to talk about. Not solely on the actual premise, although it does add a little to it, but on the way it’s structured. It reminded me of my own childhood shows that had three separate story arcs that had a basic theme to it. With an anime plot involving a cute squid girl trying to invade the entire planet by herself only to be undermined by a bunch of people who own a food court near a beach, you’d think that would speak of random hijinks that will only appeal to prepubescent girls. Fortunatelythere can be some merits in here that could speak to any age group.\\n\\n\r\nFor starters, Squid Girl has a plot that is hardly focused or has any substance to the original goal that the squid character, named Ike, intended on doing. It mostly involves her trying to learn about humanity and the culture of Japan that she is settling in. It’s essentially a show based around culture shock and how foreigners try to adapt to a different country that they have no idea about. With the tone of the series being light-hearted and comedic, they handle it pretty well without hampering on the basic premise being in conflict with the comedy. It’s fairly entertaining to watch and at times funny to see Ike acting very holier than thou upon the people she meets, when in fact she has no power over the others whatsoever.\\n\\n\r\nWith a show like Squid Girl, you need to supply with great characters that are both funny and memorable to watch. While there are definitely some that garner a lot of entertainment, others are not fully realized and don’t add much depth with the comedy. The best ones that I ended up liking the most were Ike, Eiko, and Chizuru. They all have so much great chemistry together and make a lot of great gags work perfectly. Chizuru herself provides some of the best scenes involving her having a nice personality but once something bad happens to her or the workplace she turns menacing to the person doing the trouble-making. Ike herself, voiced by the always charming Hisako Kanemoto, gives the show a great sense of passion towards making this Slice of life atmosphere into an entertaining comedy with her constant alluring presence in every scene.\\n\\n\r\nUnfortunately not all of the cast hits the level of greatness along with our three main characters. Sanae, Takeru, and Goro all don’t have the same great chemistry with Ike as she does with Eiko and Chizuru. That’s not to say they’re terrible, or even bad, they do have some funny moments but it’s essentially just them acting very googly eyed over Ike’s presence in the world that quickly doesn’t have much to go for in the grand scheme of things.  For example, Sanae’s only gag for existing in the show is to be all lovey-dovey over Ike and nothing else. Sure it does get a few laughs but after a while the joke just falls flat and gets old quickly. If it wasn’t Kanae Itou’s adorable voice playing Sanae I would probably think lesser of Sanae to be honest.\\n\\n\r\nAnother problem I had with the show was how each of the plot arcs end so abruptly. There are times when a plot arc would end and it didn’t feel like that particular scene felt any kind of closure for it. It ends relatively quickly and we’re brought up into a different scene. The problem being that the way they interlude between a different arc is by showing a cut of arrows that are supposed tell us that we’re doing a different arc but it happens so fast that you barely even notice it because of the fact the arc beforehand had barely an ending. In turn, some of the arcs felt like they were rushed or they weren’t finished in the writing process during production.\\n\\n\r\nIn short, I thought there wasn’t really anything special to be found in Squid Girl. It might be something that you might show to your younger daughter to have some fun with, but on the other hand there are actually some nice humor for adults as well. It might be a stretch to say that this is Japan’s answer to Spongebob, the only difference is that Spongebob actually had a lot of great memorable characters while Squid Girl only had three that are even worth discussing over. It’s a harmless show for what it is, a decent entertaining show for older kids. Even with some of the adult innuendo thrown in, but hey that’s at least that's something that most kids shows are hardly about these days.\\n\\n\r\nGrade: B-",
            "date": "2013-06-07T23:27:00+00:00",
            "helpful_count": 49,
            "mal_id": 100183,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=100183"
        },
        {
            "content": "That's right de geso!  I have come to tie you in my tentacles and make you my undersquid de geso!  Don't even THINK of trying to escape from my wrath DE GESO!\r\nShinryaku! Ika Musume is quite a refreshing retake of the slice-of-life comedy scene.  It was really nice to finally get one that didn't cop out and take the way-too-overused (high) school setting.  The premise is actually quite creative and leads for some equally creative little stories and jokes as well.  (Who knew the idea of a squid girl could be so interesting?)\r\nThe series is really the only thing I'veheard of to use tentacles so innocently.  When most people think of tentacles, they obviously think of hentai, and all the various disturbing images that stirs up to go along with it.  Well, this show is definitely PG-safe.  Tentacles are used for USEFUL things--like serving half a dozen tables at once, or playing beach volleyball, or swatting your stalker away from you like a fly, or...\\n\\n\r\n...Wait, what?  Oh yeah.  Slap stick. =D\\n\\n\r\nOn the note of PG-safeness, I'm happy to inform you that there is zero fan service, so you pedophiles lurking around looking for pervy loli-fests or mindless moeblobs should GTFO.  Right now.  Hell, if it weren't for a few instances of light profanity (\"damn\"), the show probably could garner a G rating.  (I don't see what the point of even including any profanity at all was.)\\n\\n\r\nWhen writers decide to incorporate moe into their works, they always have to be careful to observe the line between moe and moeblob--that is, if you overdo the moe, they lack any other definable traits--physically or character-wise.  They become defined strictly as MOE.  (Oh gawd K-On!)  Well, I'm pleased to report that Ika Musume does not cross that line (although there are a few precarious instances when that line is flirted with far too intimately).\\n\\n\r\nIka is moe, yes, but moe mostly in terms of her personality.  She is laughably curious about everyday things we don't think much of, like umbrellas, birthdays, and fireworks.  She's afraid of inflatable killer whales and sharks, but thinks nothing of walking through cemetaries at night, nor is she even scared of ghosts.  She came to \"invade\" the surface world, but her good nature keeps getting the better of her and pushing her goal farther away.  She acts menacing, but it's obviously a bluff, as she obviously cares about the well-being of those around her.  She even has a couple funny speech naunces to top it all off.\\n\\n\r\nThe show really IS all about Ika.  She is, by far, the character with the most colorful personality, range of emotion, and variety of facial expression.  The supporting cast isn't bad, though; some of them actually have some depth and undergo development, but equally as many are just flat in terms of personality.  (This isn't to say they don't add anything or aren't entertaining, though; quite the contrary.)\\n\\n\r\nAnimation and art are quite crisp, clean, and clear: the show is quite pleasing to look at.  Bright and vibrant colors make up the vast majority of the spectrum utilized, and scenes are mostly sunny and light-hearted.  Animation is pretty well-done as well, with no real problems or corner-cutting I could see.  Facial expressions--particularly those of Ika--are great.  All in all, quite effective and above average.\\n\\n\r\nThe OP is alright, sung by Hisako Kanemoto (Ika's seiyuu) although it begins by chanting \"Shinryaku!\" over and over again, in the most annoying pitch possible, at a volume twice as loud as the rest of the show.  (Don't get me wrong; I have no problem with her voice; that part is just really annoying.)  And it starts as soon as the episode begins, so you'll have to be really fast to avoid getting your ears blasted.  The ED is actually a pretty touching piece that I would call Ika's theme song, since the lyrics fit her so well.  The voice acting is pretty great, but Kanemoto definitely steals the show: she acts the squidding INK out of her role. ;)\\n\\n\r\nShinryaku! Ika Musume is quite the enjoyable break from the hum drum stereotypical school comedy scene.  It deserves a chance just for daring to be different and breaking from the mold.  It even incorporates some pretty emotionally touching moments in there as well.\\n\\n\r\nNow, I'm off to conquer the rest of this thing you humans call MAL de geso!",
            "date": "2012-03-12T12:17:00+00:00",
            "helpful_count": 30,
            "mal_id": 55843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DraconisMarch",
                "username": "DraconisMarch"
            },
            "url": "https://myanimelist.net/reviews.php?id=55843"
        },
        {
            "content": "I was eating instant ramen while watching the first episode... I never thought I'd start a review with that sentence, but it leads to a point. I almost threw up when Ika Musume did you-know-what to the pasta, but then I was choking from laughter by the time the episode ended. The entire series left me a similar impression, from disgust and rejection to appreciation and attachment.\r\n'Shinryaku! Ika Musume (Invasion! Squid Girl)' is an anime series that appears to be flawed in almost every way imaginable, but somehow... somehow, I found this series to be extremely enjoyable and memorable. Ika Musume has invaded my mind.\r\nCase1: Premise.\\n\r\nIncompetent invader from another world appears, and gets her butt kicked in the very first encounter with human beings. After that, the \"invader\" joins the family, but still plans for world invasion while easily getting distracted by all the unfamiliar things on Earth. It's baffling how similar the premise of this series is to 'Keroro Gunsou'. In fact, if they toned down Sanae and violence by a bit, it would totally pass for a children's show. While nothing can excuse the show's lack of originality and the fact that nothing makes sense with the premise, 'Ika Musume' has a lot going for it that makes it different from an average show.\\n\\n\r\nCase 2: Lack of Direction.\\n\r\nOne would expect a simple friendship comedy from such a premise. Ika Musume bonds with family members and others in town, then gets inspired by their kindness, right? While that's one of the themes of 'Ika Musume', there are also a lot of other things going on. A lot of actual battle scenes with Ika Musume's tentacles, a lot of slapstick comedy, a lot of depth in some episodes (Mankind's triumph over nature? Bonding with the mini-Ika Musume? The umbrella episode?), a lot of romance, and slice of life? Loli moe-blob? Other than comedy, it's hard to say what this series is, as it's packed with themes despite the triple episodic chapter format. Ironically, the lack of direction (central theme) in the story was offset by the direction (presentation by the director). It didn't exactly feel like this series went all over the place and got nowhere, it felt like I got to see many sides of Ika Musume's story.\\n\\n\r\nCase 3: Characters\\n\r\nAt first, Ika Musume seems like nothing more than a moe-blob dewa naika? A deliberate attempt for cuteness de geso. The squid hat, the dress, and over-sized eyes seem like obvious moe ploys de geso. However, her appearance is actually a part of the story ja naika? Her character really grows on you dewa naika? Other characters were also stereotypical cardboard cutouts de geso. Especially the way they random appear in different episode limits their character development ja naika? Still, they somehow manage to leave an impression, and their personalities are very distinct ja naika? What all characters possessed, was inherent charm that makes you care about them de geso. Despite how incompetent she is at invasion, you would find yourself rooting for her dewa naika?\\n\\n\r\nCase 4: Buildup\\n\r\nYes, every one of Ika Musume's sentence ends with \"jana/dewana-Ika(Squid)?\", homophone of \"Isn't it? / Don't you think?\", or \"de-geso(tentacle)\", a cuter(?) version of \"desu\". It was kind of cute at first, but gets annoying very quickly... and this persists for almost the entire duration of the show. However, she stops just when you're totally sick of it, and just like the supporting cast in this show, I felt like it's not her without her quirky speech. I actually missed it. That chapter would've never worked unless you're certain the audience would be emotionally attached by then, and I was attached despite finding her speech to be very annoying. The director has done an excellent job in building up for moments like this, also mixing in a couple of slow and emotional chapters with fast-paced slapstick chapters.\\n\\n\r\nCase 5: Retro\\n\r\nThe physical and pun-heavy comedy in this series is really old fashioned, but I found myself laughing through the stupid and predictable jokes nonetheless.\\n\r\nThe character design other than Ika Musume, and the atmosphere also had a really retro anime feel to it. The way Ika Musume, the Invader From the Bottom of the Sea, and the action/scary scenes stood out from the rest of the show was really wonderful. This is my first series with Diomedea as main animation studio, and I have to say I'm really impressed. Color specification and consistency of drawings were particularly stunning.\\n\\n\r\nCase 6: OP\\n\r\nThe OP 'Shinryaku no Susume (Advance the Invasion)' is SUCH a bad otagei song with strained anime voice, but the way it starts and the beat is just so addictive. I found myself skipping it after the second episode, but drawn back and listening to the whole thing by second half of the season. ED was a poignant song that makes you reflect back on the story, and had a nice simple touch with an object variation added to each episode.\\n\r\nBGM was rather ordinary , and didn't play a big part in the show.\\n\r\nIka Musume's voice by Kanemoto Hisako was absolutely perfect, which made her character all the more adorable. Everyone else also sounded like they should.\\n\\n\r\nI was very skeptical about this series, but I've been captured by the tentacles of Ika Musume.\\n\r\nDream and magic is what traditional anime is supposed to be all about, and this series takes it back to the roots. I can't guarantee you would like it, but 'Shinryaku! Ikamusume' is definitely worth a shot if you haven't seen it already.",
            "date": "2011-01-09T11:15:00+00:00",
            "helpful_count": 17,
            "mal_id": 33596,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=33596"
        },
        {
            "content": "This is the kind of show that you could just watch and enjoy.\r\nThe story itself is quite original and simple. It gives a nice setting for a comedy like this, but there's still not much to it. To be fair though, you wouldn't expect much from the story anyway, so you probably wouldn't be disappointed at all.\r\nThe comedy however, is simple and funny. It doesn't need much cultural reference to understand, and its jokes aren't forced or awkward. It has a comedic style similar to Azumanga Daioh, and maybe also like a crazier version of Yotsuba, which also applies to the art style.\r\nThe charactersall follow a common archetype, but it doesn't make the show feel cliche and boring. Though Ika Musume is the center of the comedy, each character has their own comedic traits, and are all combined in a very balanced manner.\\n\\n\r\nAll in all this makes a great comedy, and a very enjoyable slice of life. But, if you're looking for something with a great story, tear dropping drama, or maybe some gorgeous art, this is definitely not something you should watch.\\n\\n\r\nI take that back, after watching episode 5, I must say, there is actually some tear dropping scenes.  And some very heart warming moments.",
            "date": "2010-11-02T15:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 31785,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403302.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AppleBread",
                "username": "AppleBread"
            },
            "url": "https://myanimelist.net/reviews.php?id=31785"
        },
        {
            "content": "Ok, so just 2 more episodes and this anime is already nearing its end, so what can I say about this anime? Well, let's put it this way according to how I rate this anime:\r\nSTORY:\r\nOriginally, the plot of this story is about nature fighting back against humans who pollute the seas with garbage and with the help of squid girl Ika Masume and her so called invasion force of half human and half squid, which,by the way she seems to had forgotten bring it along with her at the start of the anime- talking about letting a girl do a grown-up's job. But,only to getsidetracked by working in a seaside eatery, fumbling around as she learns with the everyday life on the surface and having a  relationship (including harassment from 2 lesbians Cindy and Sanae)  with the surface dwellers, though, the comic side of it is cliche, I thinks that it still deserve a fair score of 6.\\n\\n\r\nART:\\n\\n\r\nI have nothing to say about the art of the anime,but the artist's impression on how the characters and the background were drawn would literally give one an impression as to what the anime is without telling the audience about its synopsis. Then again, there were some awkward parts of the character's appearance e.g. the sharp ends that were sticking out on the left side of Eiko and Chizuru's hair,the design of Ika's tentacles and the baseball team were Ika participated. But in fairness one can simply just forgive it, so, a fair number 6 it is.\\n\\n\\n\r\nSOUND:\\n\\n\r\nNo comment for the sound, and I like the opening theme of the anime, so it deserves the number 6th spot for its rating.\\n\\n\r\nCHARACTER:\\n\\n\r\nI don't have much comment for most of the cast, but for Gorou to be called \"Life Saver,\" kinda make the term an awkward definition of his occupation, I don't know for sure if it is the fault of the author or is it the translation, but the proper noun for the said character's role is \"Life- Guard.\" Also,I'm no marine biologist, but,if Ika Masume is a squid girl then she belongs to the species of cephalopod and should only have 8 tentacle instead of 10, she should also swim using jet propulsion instead of using her tentacle and she should also have    chromatophores  that enables her to either hide,glow or communicate with other squids in the water and depending on the species of Cephalopod an ordinary squid can live only about 10 years in captivity . I guess both the author and artist don't know anything about squids except when eating it as sushi. Then again,who cares? As long as the character entertains,then it is decent enough to rate it as number 4. \\n\\n\r\nOVERALL AND ENJOYMENT:\\n\\n\r\nDecent enough to be viewed by all ages, so number 4 it is.\\n\\n\\n\r\nTrivia: Humboldt Squids can grow as much as 30 feet.\\n\\n\r\nIt is  estimated that there are at least 1000 tons of non biodegradable garbage floating around the world's oceans.  \\n\\n\r\nJapan is a known consumer of Whale meat , according to Greenpeace data. \\n\\n\\n",
            "date": "2010-12-10T13:31:00+00:00",
            "helpful_count": 14,
            "mal_id": 32638,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=32638"
        },
        {
            "content": "Squid girl was something I found while just browsing around for something to watch. Its intriguing title led me to watch over the weekend and I feel glad that I watched it.\r\nStory 3/10\r\nStory in itself is not very great at all. It is one of those short animes but it does not do much with its story though thats mainly the fact that it is for the most part a comedic anime. The line, \"I am Squid Girl, emissary of the sea,\" would make you think what else could Squid Girl do with herself besides spit ink and use her tentacles. \r\nArt 8/10\r\nIts a prettygeneric art style but yet its not overdone. Some of its realistic art skits are really amazing and it made me laugh a lot. Its as simple as that.\\n\\n\r\nSound 9/10\\n\r\nThe music is really good. The opening is very loud and takes a little to adjust too but it really grew upon towards the end of the anime. The credits are very soothing at the very end of each episode. Overall  I would say the sound in general describes this anime very well. Its not too overpowering but at the same time its very relaxing in general.\\n\\n\r\nCharacter 8/10\\n\r\nI find many of the supporting characters in this to be rather \"prop-like\" in the sense they are generally used as comedic relief. However many of the main characters such as Eiko and Chizuru show that average \"grown upon attitude over annoying main character\" as the anime progresses on. However I don't find this very bad at all, in fact it actually kept very hidden which in turn makes it really interesting. As for our main character Squid Girl [aka Ika] she has the style of an annoying but also comedic main character role within the anime. Though I really like her as a whole and she reallly grew upon mea s the show went on. She was always there to make you laugh with her llack on human knowledge which makes her quite unique.\\n\\n\r\nOverall 7/10 \\n\r\nI really enjoyed this anime but the lack of story made me feel like there was something missing from it. Though thats not to say its a bad anime. If you enjoy many small comedic skits and very semi-realistic events yu will love this anime. There are not many spots it will make burst out in pure laughter but yet you will never be in a bad mood when watching this anime. I feel if you really want to enjoy this anime watch it in small parts when your feeling sad or down and I assure you it will make your day better.",
            "date": "2014-11-16T12:12:00+00:00",
            "helpful_count": 13,
            "mal_id": 168841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4131017.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheAfroNinja",
                "username": "TheAfroNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=168841"
        },
        {
            "content": "The story is pretty simple, its about a girl who comes from the see and proclaims to be a squid and has come to invade earth because she believes earth is responsible for polluting the ocean, the show does mention this a few times as if trying to send an obvious yet subtle hint at real world problems.\r\nIts a great slice of life and spends most of its time on the beach in a cafe hut and its surroundings and is just brilliant at how it uses its comedy, which mostly comes from Ika Musume out lead girls over active imagination and thus always comesup with new jokes while recycling some jokes multiple times as well.\\n\\n\r\nEach episode is split up into three parts and focuses on something different each time and after each part it seems to have reset itself as if the previous actions never happened but does reference past events, a beach hut magically is completley rebuilt by the next episode.\\n\\n\r\nThe opening theme song is a typical catchy tune you expect from these type of comedies and is sung by one of the side characters and has a few cute visuals accompanying it. The ending is a slow song compared to the opening and is decent as it a nice comparison. Voice acting is ok, they do there job in making each character adorable especially Ika whose ~de gezo is addictive.\\n\\n\r\nArt is simple, the character designs are really simple and not a lot of detail goes into them, there actions however are well drawn and animated and some unatural parts can be forgiven like the sisters hair. Backgrounds are simple as well but they don't require super high detail, one thing i didn't like and never like in any show is lack of movement in those backgrounds, some wide shots including people on the beach are completely static.\\n\\n\r\nCharacters the most important part of this show as i makes up for the simple art and sound. Ika Musume or protagonist is the messenger from see who want to take revenge for the pollution of her home, the ocean, things don't quite go as planned as she is soon forced into working off her debt, the comedy of her imagination and her love of shrimp are the driving force for this show. Eiko is the one that forces Ika into working at her beachhouse and does not hold back when Ika screws up. Chizuru is Eikos sister and on the surface is the most caring of the two and really cares for Ika but deeper inside lies a more darker Chizuru and is one of the things that Ika is terrified of and she seems to always come to the rescue in various events. All side characters are great though are used to repeat jokes, we have a lifesaver who has a crush on chizuru, a girl who is stalkeresque towards Ika, a group of MIT graduates that believe Ika is an alien and wish to study her but get on your nerves no end. The sisters little brother and Nagisa a girl terrified of Ika make up the cast.\\n\\n\r\nShinryaku! Ika Musume is a very sweet show that is incredibly funny and even throws in a little tear jerkiness during one of the parts of an episode and its wide variety of characters will keep you laughing.",
            "date": "2010-12-22T13:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 32968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/265292.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NoblesseOblige3",
                "username": "NoblesseOblige3"
            },
            "url": "https://myanimelist.net/reviews.php?id=32968"
        },
        {
            "content": "I know this might sound a little girly coming from me, but this is one of the  cutest animes I have seen. The is that a girl called Ika Musume, which I think is japanese for Squid Girl, comes to the surface to invade the human race for polluting the ocean. However she knows nothing about the human world and when she busts a hole in the resterant called Lemon (I think), she ends up working at the place with to a group of two sisters and a brother to pay for the damages.\r\nCharacters are the best I seen in any other anime composingof Ika Musume, the family of siblings, a lifeguard, a girl crazy for Ika, a person afriad of her, a American scientist lady and her three weird companions, and a middle school girl Ika becomes friends with. There are a few more, but it's hard to label every character's personalitiy.\\n\\n\r\nLove the art, it shows you that this is a cute and happy and funny anime. It mostly takes place on the beach, still it's cute.\\n\\n\r\nSound and music are great. I love the beginning theme that goes \"Squid girl,Squid girl, Squid girl, Squid girl invade!\" Love it! It matches the kind of anime Ika Musume is!\\n\\n\r\nEnjoyment should be over 10! Lot of humorous scenes, story lines, etc! Overall this is an anime is worth watching! Unless you're not into cute stuff. But still watch and be amazed!\\n\\n",
            "date": "2011-04-23T14:05:00+00:00",
            "helpful_count": 12,
            "mal_id": 36365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326384.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/trishoverman47",
                "username": "trishoverman47"
            },
            "url": "https://myanimelist.net/reviews.php?id=36365"
        },
        {
            "content": "First episode was kind of rough in my opinion. It gave me an idea of what the show was gonna be like and i was not liking it. Thankfully episode 2 i got really into it and enjoyed the rest of the show. \r\nSquid Girl herself is pretty awesome and kind of adorable in her own way. I always liked the idea that she is some ancient being from the sea but just has the body of a middle school girl and isn't the brightest. \r\nEach episode i found myself laughing. Even the 1st episode that i didn't think was the greatest. There is evenone episode that is more like a side story that the crazy girl made up that is actually kind of sad. They even changed the color pallet to be more grey and less colorful. It's kind of weird with it being in this comedy show but it is nice.\\n\\n\r\nEasily for me the thing i dislike the most is the Scientist group. They aren't fun, They're boring and most of all they're annoying. I kind of like the blonde chick of the group. But i feel she is kind of wasted on them. \\n\\n\r\nI also don't like at the start how much everyone seems to shit on Squid Girl. \\n\\n\r\nThe little boy of the group i'm not a big fan of either. As soon as i saw him on screen i was immediately thinking i wasn't gonna like him for the entire season and i was  right. But he's not that bad in the end i guess. He did have some moments that made me laugh.\\n\\n\r\nThe art is nice and charming in it's own way. Kind of has a look of 2006 anime mixed with a modern look to it. \\n\\n\r\nThe music i like. The OP is goofy and funny while the ED has a kind of nice laid back tone to it.\\n\\n\r\nOverall a good show with a somewhat of a rough start.",
            "date": "2018-04-11T21:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 277804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=277804"
        },
        {
            "content": "Shinryaku Ika Musume is the story of a squid girl who invades the surface because humans are ruthlessly polluting the sea. She subsequently gets side-tracked and ends up working at a beachside restaurant stall. The story, while creative, is essentially just a framing device for the zany comedy. So the real important question is: does the comedy work?  The answer is an ardent yes. The situations Ika Musume ends up in are generally pretty mundane but her involvement adds a surrealistic element that works very well. The result is pure hilarity. One of the best aspects of the humour is that it never fallsinto the realm of using random pop culture references as jokes, which so many inferior comedies do. The humour is also very natural. It always arises from the situation and feels very natural for the characters.\\n\\n\r\nThe characters are really what makes the comedy work. They have just the right blend of major and minor characters to make any potential situation humorous. The major characters are also well developed. Which is surprising, since comedies have a tendency to use stock characters.\\n\\n\r\nThe art is decent. the backgrounds tend to be really vibrant and detailed. When they draw normal sea creatures they do it very well. The only real art issue is that the characters all have similar faces.  \\n\\n\r\nThe voice work is decent. It doesn't really stand out, but it's suitable for the characters and emotions are expressed well. The music is really hyperactive and upbeat. It suits the series perfectly. \\n\\n\r\nThe yuri factor is an 7/10. Sanae loves Ika. Ika has a thing for Nagisa and Ika and Eiko share some really homoerotic moments. The only issue I have with the yuri in this is that some of it, specifically those with Sanae, seems pretty exploitative. To put it simply, it seems like it's put in, not because it works for the characters, but because the writer finds it funny. \\n\\n\r\nMy final rating for Shinryaku Ika Musume is an 8/10. It has a few issues, but it's hilarious and a lot of fun to watch. The humour isn't forced or based on random pop culture references. If you enjoy zany comedy like Galaxy Angel, Kanamemo or All Purpose Cultural Cat Girl Nuku Nuku, you'll probably enjoy this as well.",
            "date": "2011-09-21T10:53:00+00:00",
            "helpful_count": 10,
            "mal_id": 43889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=43889"
        },
        {
            "content": "Sometimes in the anime world, there are a lot of sub-genres that are very subjective, depending on what kind of anime you’re watching and one of the other subjective forms of media is comedy. For example, some people can like Love Hina for being some new turn of the Harem genre but most of them (including me) hated it for how annoying and juvenile it is. Others like Azumanga Daioh & K-On! For being innocently enough funny to entertain people for all ages without being too edgy and for others, they find it either too boring or moe for their taste. For me, comedy isone of other favorite mediums of today, simply because I like to laugh at some good humor material and the keyword being GOOD.\\n\\n\r\nSquid Girl has come to the land from the depths of the sea to conquer humanity for its pollution of the ocean. Unfortunately she ruins the first house she uses as an invasion base and has to work to pay for repairs. Of course, she can't overcome the Aizawa sisters who manage the house, so who know whether she can subjugate humankind.\\n\\n\r\nThe premise is the fish-out-of-water plot with a lot of comedic scope and while watching it, I enjoyed some of the antics that Squid Girl gets herself and a few others into. The show goes by showing 3 part episode, with the segments being 7-8 minutes, much like American cartoons in the past, present and future, so I can see a little inspiration from that and for those who love to use puns a lot, this show has plenty of squid puns to go around, even the episode’s title cards uses them. \\n\\n\r\nI really enjoyed the characters and their interactions with each other, especially the main character of Squid Girl, who really wants to be taken seriously as an invader but is not up to the task of that, considering she can’t even conquer a local eatery shop but for her character development, she plays it as being a cute mascot-like character without being overly annoying and grating and she never once toss aside her plans for world domination for no reason but it’s not like she’s going to invade any time soon with the Aikawa sisters, with Eiko as the strong-minded and no-nonsense sister who always need to keep Squid Girl in check and there’s Chizuru, who I think if Brock from Pokemon & Sakura Matou from Fate/Stay Night had a baby with the mindset of Ryoko Asakura from Haruhi Suzumiya and it’s her and she was even more of a bizarre character in the show than the title character and the sister’s little brother Takeru, who is more akin to Squid Girl as a playmate; Sanae, Eiko’s neighborhood friend who is very obsessed with Squid Girl, so much that is frightening and enters into Hentai territory; Nagisa, a surfer girl who is actually afraid of Squid Girl and she’s very paranoid about it. Plus, Squid can use her fear for her advantage but mostly it’s just to mess with her. There are other characters including the American scientist Cindy Campbell (not the one from Scary Movie), who and her three fellow scientists from MIT want to study Squid Girl to see if she’s an alien; Kiyomi Sakura, a minor character later on in the show whom Squid has become close friends to and Goro, the lifeguard who Squid riles up every now and then and also has a crush on Chizuru.\\n\\n\r\nThe animation was done by Diomedea (or previously Studio Barcelona), whose only known project I have heard from them is…..Kodama No Jikan….okay, not the best title to be represented but this was some great animation, especially when it came to animating Squid’s tentacle movement. Also, since this is a gag-based anime show and for that, it was acceptable for doing that, maybe not on par with Azumanga Daioh & Sgt. Frog but it’s very good nevertheless. Now, I didn’t mind the music here that much but it was rather fitting and appropriate for the show, although if you ever sing this to somebody’s ears real loud, you are most likely to get punched.\\n\\n\r\nNow, I know there are two seasons of this show but I just been commenting strictly on Season 1 and their dub done by Bang Zoom Entertainment and was released by Media Blasters and I thought about the voices on that. Christine Marie Cabanos has been one anime VA rookie that I personally want to succeed in the business, (to me she’s a younger version of Stephanie Sheh), and her performance as Squid Girl fits the criteria of her cute and upbeat nature. I will say for Cristina Vee in her role as Nagisa is very similar to her role as Mio in K-On! (very paranoid and easily frightened) but then again, I don’t know if the K-On!! dub was produced before or after Squid Girl but it’s hit or miss and I really enjoy the dub.\\n\\n\r\nFINAL VERDICT: While not being something I would add to my top ten lists, this is a very fun and energetic show that never gets too boring or too hostile. I enjoyed all the characters, even the minor ones who can manage an impact into the series and the gags can be very funny although the squid puns did get too old too quick in my opinion. I do wish that Season 2 will get dubbed someday since Media Blasters no longer has the license to that one and possibly get Sentai Filmworks to license it and get the original cast back on that.\\n",
            "date": "2013-04-13T13:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 93633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1028709.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HybridMedia",
                "username": "HybridMedia"
            },
            "url": "https://myanimelist.net/reviews.php?id=93633"
        },
        {
            "content": "This anime at the first glance shows that this is one of those anime for comical and funnies. From what I heard, the director who made \"Hare and Guu\" is in charge of this, so this already kind of gives it away that this is going to be a fun one.\r\nMuch like Hare and Guu and other animes, it only goes up to certain quality of story and art, but what matters is the characters, and the anime does a good job giving a brief character description in the first episode and still be fun while elaborating it.\r\nSo for those of people who want seriousaction, drama or love, there won't be much here (or much from what I saw), and those of who wants light, relaxed and just enjoyable entertaining and valuing funnies more, then this will be good.",
            "date": "2010-10-06T09:48:00+00:00",
            "helpful_count": 9,
            "mal_id": 31152,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/392309.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DVTClark",
                "username": "DVTClark"
            },
            "url": "https://myanimelist.net/reviews.php?id=31152"
        },
        {
            "content": "What's not to love about an anime with the english tidetle, \"The Squid Girl: The Invader Comes from the Bottom of the Sea\". In truth, I was inkspecting this anime to be trash, and I was not dissapointed. It is trash; simply the best kind of trash. If you were to look at my ratings you would see a wall of 7s followed by a 9 for enjoyment. This is because my enjoyment of Shinryaku! Ika Musume massively exceeded the show's actual quality. There were moments where I was laughing uncontrollably, but the fact remains that in terms of actual quality the show is fairlysimplistink.\\n\\n\r\nShinryaku! Ika Musume sinks or swims on its main character, Ika. All the other characters feel a squiddle one-note with the inkception of the other major character, Eiko. However, Eiko's role as the \"Mature one\" limits the enjoyment of her character. Therefore; the show's enjoyment stems primarily from Ika, with other characters providing entertainment through inkteraction with her. This means that if you don't like Ika, you won't like the show. However, I think this is a moot point, as Ika hershelf is such a vibrant and eninkmatic character that it doesn't really matter.\\n\\n\r\nTo conchclude, while Shinryaku! Ika Musume is hardly a masterpiece, it is most certainly a lot of fun. If you're worried that it seems a bit fishy, why not give it a watch and see for yourshellf. I highly reccomend it if you're after something entertaining. It is inkredible how much joy can be developed from such simplistink execution.",
            "date": "2018-12-14T15:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 295772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DiscordLexia",
                "username": "DiscordLexia"
            },
            "url": "https://myanimelist.net/reviews.php?id=295772"
        },
        {
            "content": "For decades, mankind has taken the vast, epic ocean environment for granted. As our technology has advanced, so has the scale our pollution, with oil, garbage and toxic waste killing millions upon millions of innocent aquatic life forms. But now, the world below the surface has finally taken enough abuse from the world above, and they’re sending their most powerful, most terrifying soldier to deal with us.\r\nAll 1,000 of us.\r\nOkay, so it’s information may be a bit dated, but it’s desire to enslave us and force us to pay for our crimes is no laughing matter. She’s coming, and we have no choice to prepareourselves... For the most adorable invasion of mankind since Night of the Lepus.\\n\\n\r\nYes, it’s not Godzilla, it’s Squidgirl, a vertically challenged moppet who looks almost human, save for the series of blue tentacles that make up her hair. Or Ika Musume, as Japan calls her.She comes ashore one day, bursts into the Lemon Beach House, and announces to the first gathering of humans she sees that this world... And all the people in it... Now belong to her!\\n\\n\r\nUnfortunately for her, this declaration is met with laughter, and she soon winds up working a low level job at the very beach house she just threatened. Like Ika, this beach house is owned run by a small family of siblings... They have no parents, because it’s an anime. The most important of the three is Eiko, a high school student who acts as a foil for all of Ika’s hare brained schemes and delusions. Takeru is a little boy who... genuinely acts like a child, surprisingly. He gets along very well with Ika, as he’s more than willing to play along with her. And their oldest sister, Chizuru... Well, telling you about her personality would spoil one of the greatest moments of the series, even though it happens in episode 1, so I’ll just leave it at ‘she’s awesome.’\\n\\n\r\nThe animation is nothing special, but it’s a little above average by Slice of Life standards. There are a lot of key frames, but when it wants to impress you, it will not hesitate to do so, saving it’s budget for moments that really need it. Yes, the allocation of the budget may be a little too noticeable for some people, but you can’t argue with results, because whenever there’s action or physical comedy going on, there’s really nothing to complain about. Aside from the main character, the character designs are a little on the bland side, but they still have kind of a natural feel to them. Well, natural by anime standards.\\n\\n\r\nAnd speaking of our hero, the animation style works particularly well in favor of the Squid Girl herself, whose various cephalopod abilities make up the bulk of that action and physical comedy. For a good idea of how her tentacles work, think of her as a really mean parody of Lucy from Elfen Lied... the four deadly vectors have been swapped out for ten mostly harmless hair-tentacles that seem to have even more impressive abilities than Ika herself has. They’re powerful enough to break through a wall, strong enough to lift heavy objects, and fast enough to create a sonic boom, yet they’re also delicate enough to thread a sewing needle. And they can seemingly stretch indefinitely. On top of this, she can breathe underwater and use bioluminescence to glow in the dark.\\n\\n\r\nAnd yet, beyond these abilities, Ika herself is... Well, I don’t want to say stupid... Perhaps ‘naive and gullible’ would be better. Her knowledge of the human world seems very arbitrary and inconsistent. She’s able to do complicated math problems in her head, but she doesn’t know that she can’t eat the images on a 3D TV. It’s odd, but hey, it’s an episodic children’s show. Even My Little Pony had problems like that. And for what it’s worth, while Ika may be a little inconsistent, she’s a very entertaining little pain in the ass.\\n\\n\r\nAs enjoyable as the title character may be... Your choice of dub or sub will influence this, but more on that later... I can’t really say as much about the supporting cast. I wouldn’t go as far as calling them bad or unlikeable... Okay, maybe a few of them are... They’re just not all that interesting on their own. They’re mostly used as props for Ika to interact with, and to be fair, this is done to great effect. They support her, as a supporting cast should, but none of them ever really stand out, as they either get too little screen time to justify their presence or so much screen time that their best qualities become Flanderized. The only one that ever really rubs anybody the wrong way is Sanae, Eiko’s childhood friend, who has a lesbian crush on Ika... Which would be fine, if she weren’t so damn creepy and obsessed about it. Honestly, she’s the only real element of the series that I wouldn’t call kid friendly.\\n\\n\r\nThe English dub, for the most part, is pretty underwhelming. It’s a parade of no names and small timers, with the only big actors being Carrie Savage and the increasingly impressive Christina Vee. for the most part, the performances are either bland or adequate, although nobody really bombs it. What really surprised me was the performance behind Ika, who’s played by Christine Marie Cabanos. I’ve never really liked her as an actor... I thought she was miss-cast in K-ON!! and Madoka Magica, and while I didn’t mention it in my review, I freaking HATED her in Oblivion Island. But here, she was actually kind of good. She won’t be winning any Oscars any time soon, but her “every ridiculous thing I say sounds completely normal to me” delivery was a pretty good approach to take.\\n\\n\r\nThe Japanese track is infinitely better than the dub, however, and Hisako Kanemoto blows Cabanos completely out of the water. Actually, the performances are better all around, even if you can’t understand the language. Which I can’t. The dub isn’t horrible, and it should be enough to please those who insist on watching it, but unless you’re eager to hear a barrage of fish-related puns, the Japanese track is definitely recommended.\\n\\n\r\nI mentioned earlier that, aside from Sanae, this show is pretty kid-friendly, and I meant it. The stories are simple enough for a kid to comprehend, without ever really feeling too dumbed down. It’s episodic, split into threes like a Nickelodeon cartoon, but there’s still a sense of progress and development with the characters. It’s set on a beach, so there’s naturally a lot of scantily clad bodies walking around, but aside from that, there’s barely any traditional fan-service at all. It’s the story of an incompetent Invader losing touch with their origins as they adapt to human culture, and while we’ve seen that about a million times, it’s done pretty well here, with the constant otaku pandering that almost ruined Sgt. Frog left completely out of the equation.\\n\\n\r\nThe writing can get corny, and the characters can get a little stale at times, but it still smells of genuine effort and imagination. It never stays in a rut for too long, and there’s always a good laugh waiting around the corner. Actually, the writing in this show is a lot like the animation... It;’s hit or miss, but when it hits, it REALLY hits, and it doesn’t always need to rely on comedy to be enjoyable. There are some surprisingly touching scenes, including a chibi segment in episode five that’s so brilliant and creative that, with different music, it probably wouldn’t feel out of place in a Fantasia movie.\\n\\n\r\nSquid girl is available from Media Blasters, surprisingly. They’ve released the first season stateside. You can stream it legally on Crunchyroll, buy the DVDs on amazon, or just watch the whole thing for free on Netflix. There’s a second season, but it hasn’t been licensed, and I haven’t seen it yet. I will see it eventually, and when I do, I have some pretty high hopes for it... I want to see Ika’s home world be explored and explained a little more, I want a few certain characters to get some more screen time, and I want a few other certain characters to die in a fire.\\n\\n\r\nIn the end, Squidgirl is kind of a mixed bag. It’s a bit of an underachiever in almost every category, but it still makes for some great light-hearted, mostly family friendly fun. I guess the base breaker for most people will be Ika herself., seeing as how the best points of the series Some of you may find her unconscionably annoying, and I can understand that sentiment completely. This show is not for you. For the rest of us, myself included, she is nothing sort of adorable and charming, and if the rest of the cast has to act as her props, then good job... This show is hilarious. It’s not one of the best comedies out there, and repeated viewings over a short period of time may leave you feeling cold... Once or twice a year at best is advised... But for what it is, I loved it.\\n\\n\r\nI give Squidgirl a 7/10.",
            "date": "2014-05-23T11:48:00+00:00",
            "helpful_count": 6,
            "mal_id": 144247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=144247"
        },
        {
            "content": "Usually I'm not a fan of comedies, animes or otherwise. However this one was different, all the jokes were genuinely funny and the story surrounding the whole series was (while admittedly silly) well put together and enjoyable to watch. \r\nUnlike most anime this one follows a non-linear style where story is episodic, where each episode is a self-contained story that is loosely connected to the larger story as a whole. I feel like it adds to the atmosphere as well as helps to make the jokes that much more funny. It allows the writers to focus on how to make each individual episode good ratherthan to make the series have an overarching plot that keeps the viewer watching each episode. By using this style there is no need to watch it all in one go and you can watch it in pieces whenever you have the time.\\n\r\nIn this anime, there is no great evil threatening to take over the land, nor is there a need for our hero to find some sort of hidden power from within. This anime simply revels in each episode and makes the most out of what it has, and it really show. It makes for a fun and entertaining ride as you watch the series progress. \\n\r\nIka Masume, or squid girl, is a comical and sometimes outright dimwitted character that is always the focus of each episode. The way she interacts with the world that surrounds her, or more frequently how the world interacts with her, makes for a fantastic time.\\n\r\nWhether your looking for a lighthearted anime or just looking for a good laugh this anime is definitely worth checking out. Its definitely an anime I'd recommend and one that I'd re-watch any day.",
            "date": "2013-09-22T10:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 113811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3174645.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Redd396",
                "username": "Redd396"
            },
            "url": "https://myanimelist.net/reviews.php?id=113811"
        },
        {
            "content": "This show is so good, that after doing the math I found out that if we were to gather a squid girl body pillow, and the blu ray disc for shrinryaku ika musume, and send it back in time, we could give it to Hitler and prevent the holocaust. Once I reached episode 4 I realized just how powerful the tunes that play in the soundtrack are, whenever the opening song played my life flashed before my eyes and I was taken to heaven, that's right, this show is in fact heaven. There is no afterlife, once we die our spirits are sent to theshores of Japan and the reaper gives us the option to watch either this show, or attack on titan. Those who have chosen attack on titan are forced to watch the endless stream of meaningless dialogue and overbudgeted fighting scenes which hold no comparison to the Squid Girl vs Squid bot mk 2 3 and 4 fights.",
            "date": "2015-12-29T23:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 207274,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5086744.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bigjoesemporium",
                "username": "Bigjoesemporium"
            },
            "url": "https://myanimelist.net/reviews.php?id=207274"
        },
        {
            "content": "I've known about this anime for a long time know and I'll would always pass it by or say is this a gross hentai. One day in the App Store I was looking at the crunchyroll apps and stumbled upon the squid girl one. For some reason I was drawn to this one and the blue exorcist one, BUT I DIDN'T USE THE BLUE EXROCIST. Watching episode instantaneously drew me in. Squid girl is a very funny anime about a girl who tries to \"invade\" the surface to punish humans for polluting the sea. While trying to do so she becomes drawn to human customsand forgets to invade, fails to try to invade, or even being distracted by something while trying to invade. It like the anime keroro gunso/Sgt.Frog but less about the invading. Though I praise it so highly some people might not like it's humor because we all had different things that are funny. I laughed like crazy when I was 7 from seeing a bird on Saturday night live and the bird did nothing. Mind you watching squid girl will always let you have a good time and make you smile.",
            "date": "2012-11-11T19:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 77277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1757443.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BrigadeHamtaro",
                "username": "BrigadeHamtaro"
            },
            "url": "https://myanimelist.net/reviews.php?id=77277"
        }
    ],
    [
        {
            "content": "When I first read about Shinryaku! Ika Musume, I became incredibly interested. It was great: an original premise, incredbile art, and seemingly exciting characters made it seem like an above average show. Thankfully, the actual anime did not disappoint completely.\r\nStory:\r\nThere is not much wrong with the story, but there is also not much amazing. The whole \"I want revenge against humans because of pollution\" thing is never really taken farther than a several jokes an episode. Each episode simply covers Squid Girl discovering new things with comedic outcomes  which isn't that bad.\r\nArt:\r\nOther than characters, this is probably the most outstanding aspect of this show.There is incredible attention-to-detail in virtually every scene, and the characters' artwork is adorable. The only negative comment I have to say about the art is the incredibly cheesy sub-titles that pop up two to three times an episode. They look exactly like the shitty WordArt that's included in Microsoft Office.\\n\\n\r\nSound:\\n\\n\r\nWinner of the \"Fucking Great Opening, but Awful Ending\" award. Seriously, the opening theme is catchy as hell and fits Squid Girl's personality to a T. On the other hand, I disliked the ending a lot. I abhorred hearing that screeching voice right after the show ended.\\n\\n\r\nCharacter:\\n\\n\r\nLike I mentioned before, the characters are wonderful. Each and every one has their own interesting personality. And, of course, the main character is a squid which is just awesome. My only complaint with the characters is that there ISN'T ENOUGH CHIZURU.\\n\\n\r\nEnjoyment:\\n\\n\r\nI enjoyed this as much as most shows, but it was not completely in love with it, per se. Some episodes dragged on, and I saw myself pausing and coming back later to finish them. This was not the case with every episode, though, just one or two. \\n\\n\r\nOverall:\\n\\n\r\nShows like this need to be made more. I'm not speaking specifically about squid-girl shows, but about  anime with new concepts and premises. In an ideal world, production companies would take chances like this more often. Support this show and others like it, so we can watch anime that isn't shit, fucking real world.",
            "date": "2011-08-04T16:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 40767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/507507.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/WoodRespecter",
                "username": "WoodRespecter"
            },
            "url": "https://myanimelist.net/reviews.php?id=40767"
        },
        {
            "content": "Shinkryaku! Ika Msusme is an anime about a squid girl called Ika Musume who has came out of the ocean to terrify human beings so that she can dominate the world!\r\nStory: 6\r\nThe story? Ika Musue is a squid who notices pollution in the ocean from things such as cans and wrappers left from human beings. She then decides to get out of the ocean and try and take over the world and teach the humans a lesson!\r\nShe then bumps into two girls called Eiko Aizawa and Chizuru Aizawa, and it turns out they they are sisters who own a small cafe/restaurant right outside the beach.Ika Musume ends up breaking a wall of the restaurant and she ends up working in the restaurant with the two sisters. From there on, Ika Musume has many different adventures and half of the time she forgets that she's on the surface to invade!\\n\\n\r\nI gave the story an overall 6 because I really enjoyed the story with its comedy, however I feel as if it could still be improved. I'm not saying that's it's a terrible story, I love the story, it's just that I feel there could be improvement.\\n\\n\r\nArt: 8\\n\r\nThe character art and the scenery, in my opinion, is great! It might not be as detailed as other anime, but the simpleness of the character art really shows the genre of the anime; comedy and just plain fun. The scenery is amazing, they have really captured the beauty of the sea and sand at the beach in the best way possible.\\n\\n\r\nThere's not much that I can say about the art, but it really is nice. I gave it an 8 since the art is stunningly nice, the character art has such character (literally!) and the scenery of the different areas is magnificent.\\n\\n\r\nSound: 9\\n\r\nNow, I don't really pay attention to the sound in anime, but the sound in the anime really works well. Every funny scene, sad scene, scary scene etc has wonderful music to accompany it with, and the music basically goes hand-in-hand with each other. The sound quality is just great, and the character voices really suit the characters and their personalities.\\n\\n\r\nI gave the sound 9 because I honestly felt like the sound worked great. Nothing else to say.\\n\\n\r\nCharacter: 8\\n\r\nI love all the characters in this anime, especially Ika Musume. Her character really makes me happy since she's just adorable and cute. She tries to act tough about taking over the world, but she really doesn't know what she's doing!\\n\\n\r\nEiko is the type of girl who will force her employers to work hard. She usually gets angry at Ika Musume because Ika likes to fool around and other things. She also doesn't care much about Ika's safety when she makes Ika do things in the restaurant.\\n\\n\r\nAizawa is Eiko's sister and she is very polite and kind to everyone, including Ika Musume. Unlike her sister, Aizawa cares more for Ika and her safety, and she has grown a liking to her fellow squid friend. However, annoy Aizawa in any way and she'll unleash her fury, and it's very scary!\\n\\n\r\nI gave the character section an 8 because I just love how all of the characters have completely different personalities. A sign of that in an anime is great, since you don't want many characters and those characters have the same personality, because that's boring.\\n\\n\r\nEnjoyment: 7\\n\r\nWhat can I say in this section, really? I just loved the anime so much. It's different than the other anime that is currently out there, mostly because it involves a squid girl! I really enjoyed this anime a lot, but the reason why I gave enjoyment a 7 is because I think that the anime in some aspects can be improved.\\n\\n\r\nOverall, I have gave this anime an 8. I have gave this anime an 8 overall because of how I have rated the different categories throughout the entire review. It's a great anime, and I would recommend everyone to watch it, especially if you like funny anime involving a squid girl. \\n\\n\r\nThank you very much for reading my review.",
            "date": "2012-11-14T07:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 77507,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1183207.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilentSuicide",
                "username": "SilentSuicide"
            },
            "url": "https://myanimelist.net/reviews.php?id=77507"
        },
        {
            "content": "All these terrible tentacle jokes and I can't decide on one...\r\nStory:\r\nThis is a very episodic Anime and doesn't really follow a story, so all I can rate here is the premise and how it is dealt with. Ika Musume is a squid who is fed up with humans who throw their trash into the ocean, so she decides to conquer the humans. Too bad she is just a little girl with no knowledge about the human world. The idea is very interesting and reminds me a little of Yostuba&!, though the main characters are quite different. The premise is often made fun of, as itis a mere excuse for all the comedy. This show never takes itself very seriously and it shouldn't. I would've liked for some more conquering failure, but I'm okay with what we got.\\n\r\n8/10 (Premise & Usage)\\n\\n\r\nArt:\\n\r\nThe artwork is very simplistic like in most comedies. This allows for better focus on the characters and the gags. On occassion it showed us what is could be capable of, but never did it really inspire awe. It still works quite well, so I won't go to hard on this category.\\n\r\n6/10\\n\\n\r\nSound:\\n\r\nThat opening...it will be stuck in your head for days. This is Ducktales level catchy. Sure, it's a very stereotypical cutesy song, but it's just so damn good! The ending is very calm and relaxing, almost like a heavy axe coming down to end the wacky ride, but I like it. The Anime itself doesn't use much music, the sound effects work well. Nothing spectacular, but nothing terrible + a good ending song + a really, really catchy theme tune.\\n\r\n9/10 (it's really that catchy)\\n\\n\r\nCharacters:\\n\r\nAre these characters bland? Maybe a little. Does it hurt? Not at all. They all fill out their roles perfectly and combine to an eccentric cast with great chemistry. The hothead, the secretly scary one, the innocent boy, his mean friend, the Ika addict, the scared one, the alien believer...they all work and that's what counts. Ika herself is easily the best written character of the show. She does not fall into a stereotype, she's not brave, not completely dumb, not a tsundere, not innocent, not even a bad luck magnet. She's a little of everything, almost like a real person. Sure, she isn't very deep, but did you expect or even want that? No, you don't.\\n\r\n9/10\\n\\n\r\nEnjoyment:\\n\r\nI had a lot of fun. 12 episodes is a perfect length for this show. Long enough to provide you with lots of good comedy, but just short enough to not bore you if you marathon it. I gotta admit, at times I wasn't too pleased with its episodic nature (there's 3 mini episodes per episode), but I never got bored by it. I expected mindless, lighthearted fun and that's exactly what I got. I know there's a second season and I will very likely watch it.\\n\r\n9/10\\n\\n\r\nOverall:\\n\r\n8.2/10",
            "date": "2015-06-18T11:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 190551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=190551"
        },
        {
            "content": "So, short, simple, to the point...\r\nvery childish\r\nthis show is cute and stupidly funny. I did actually laugh at a few parts so it's not all horrible. If you like cute, you'll like squid girl.\r\nOne thing about this show I found EXTREMELY annoying was the ocean puns. soooo many of them didn't even make sense and weren't put in the right contexts. they were dumb and awful to put it into simpler terms. I could rant for so long about the puns...lol anyway\r\nthe last episode she also says \"you know\" WAAAAAAAAY too much. So many phrases are repeated and it obviously did not take much thoughtto produce this anime\\n\r\noverall a sucky anime unless you like cutesy anime or anime you don't have to think much for...",
            "date": "2013-06-05T21:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 99939,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2653725.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NHK_FanGirl",
                "username": "NHK_FanGirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=99939"
        },
        {
            "content": "What can i say about Squid Girl? It's cute, funny and just down right odd, but in a good way. It's nothing great by any means, but it does have decent animation, an adorable protagonist, and some pretty funny moments. Most of the lead cast besides Squid Girl herself, are pretty boring and one dimensional however, they all have good moments at least once. The story is nothing to be looked into, but it does fit the tone of the show. This show kind of reminds me of a softer, weirder japanese version of Invader Zim in a way. With the main protagonist trying totake over the world and failing in comedic fashion. Something i just don't understand is why they had to add small scenes of weird sexual innuendos into a children's anime, but okay. If you can do it without being blatant and obvious, go for it, but two scenes really stood out of place. With what was given and while taking into account that this wasn't meant to be the greatest show ever, it did it's job. It made me laugh. I had fun.",
            "date": "2015-07-05T05:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 192369,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3590203.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Cliffjumper217",
                "username": "Cliffjumper217"
            },
            "url": "https://myanimelist.net/reviews.php?id=192369"
        },
        {
            "content": "Ika Musume is one of the few very moe comedy shows that I have managed to enjoy. To be honest I rarely can appreciate jokes and gags in anime, so I am very harsh critic. Yet, I must admit that Ika musume had managed to tickle me pink on a few different occasions. They took a simple idea, and made it work well.\r\nIka musume follows… well Ika Musume as she attempts to conquer land to take revenge on the atrocities humanity commits on the seas. However, due to unfortunate circumstances she damages the frightening Aizawa Chizuru's precious shop. Thus, in order to protect herself fromChizuru she ends up working off her debt in their beachside restaurant.\\n\\n\r\nIn reality I have no issues with the deliver of the comedy, or content of the skits. While the majority of them are rather slice of life style jokes the addition of Ika Musume's ocean born naivety and abilities makes the content pretty silly. Her original purpose of conquering humanity isn't typically the focus of the skits, but they don't forget to make her act the part when she should. However, I found that the episodes at the beginning of the show were a bit boring, and that the later episodes are a decent improvement in quality as the characters build better relationships with one another. \\n\\n\r\nThe majority of the characters don't feel particularly distinguishable, but their relationship and interactions with ika musume is what makes them interesting. I think nobody can explain this better than Aizawa Eiko, Chizuru's younger sister. She really has no unique character traits at all, but she looks out for Ika-chan and makes sure to tsukkomi whenever possible. However, the comedy takes advantage of this 'simple' character and manages to deliver the jokes in an extremely satisfying way. The characters do have their unique way of interpreting Ika-chan whether it be something to dress up in cute clothes, an alien specimen, or a advertisement tool.\\n\\n\r\nThe show is a moe comedy in reality though. Take for example the 'moe' chapters of mini Ika Musume where nothing really happens except Ika being miniature size and acting cute. That being said I don't think that having a really moe segment actually makes the show better; although, i admit it can be adorable. Ika Musume is in actuality a genius (for example, a living calculator), but cannot seem to escape the short end of the stick every skit. For me it was a combination of frustration, and amusement as Ika-chan proceeded to be ruthlessly teased on throughout the show. The skits were well done, but I have always had a disdane for main characters who do everything right yet can't get a break. \\n\\n\r\nOverall, I think that if you are looking for a lighthearted comedy Ika Musume does it right, and does it pretty well. My score is somewhat low due to my unusually dull sense of humor, but I won't say that this will have you laughing your ass of either. However, if you are in the mood for some strange slice of life comedies with moe squids then I don't think you have to look any further.",
            "date": "2013-02-01T11:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 85529,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=85529"
        },
        {
            "content": "Invader from the Sea turned to a waitress at a beach shack! ~geso.\r\nWe've seen in anime that even the devil gets a part time job to psychics wanting a mundane life to the perfect classmate's awesome antics and all, this rendition is not different, character jabbing and GREAT comedy to go along with it ~geso.\r\nShinryaku! Ika Musume is one of those comedies LA has been on LA's comedy anime bucket list for a great deal of time and really the anime didn't disappoint by the end of it. Let's DIVE right in shall we? ~geso.\r\nShinryaku! Ika Musume's narrative structure is that of the typical comedicset piece lasting roughly 5 minutes each, rounding up to 3 or 4 large skits within one episode, largely following Ika Musume's daily life in trying to take over the world or those surrounding her and this plot structure though simple, pays off quite well due to the comedy given ~geso.\\n\\n\r\nThis being a character-centralized kind of sitcom, LA might as well start talking about the characters before even talking about the comedy. Let's start with the titular character herself Ika Musume (or Squid Girl) voiced by Hisako Kanemoto, she is the narrative focus of the anime (to be expected) as we see her interacting with the human civilization as well as her plans for world domination through mundane ways made funny, Chizuru and Eiko Aizawa (Rie Tanaka and Ayumi Fujimura respectively) are both the tsukommi to Ika Musume's antics as well as keeping everyone in line, Eiko more to Ika Musume, Chizuru to EVERYONE. Sanae Nagatsuki voiced by Kanae Ito is an utter fangirl on borderline stalking to Ika Musume. Takeru Aizawa voiced by Miki Ootani is the younger brother of Aizawa sisters and is generally the character to involve Ika Musume in the mundane world domination plans. Nagisa Saitou voiced by Azusa Enoki is the only \"sane\" one of the cast, actually fearing Ika Musume's plan for world domination, which in turn Ika Musume likes to tease her with because she likes being feared. Gorou Arashiyama voiced by Yuuichi Nakamura is a lifeguard but has a crush on Chizuru, he normally is involved when Chizuru, Eiko or Nagisa is involved. Finally Cyndi Campbell voiced by Hitome Nabatame is an investigator trying to get Ika Musume into her lab so Ika Musume can be experimented as an alien. LA's favourite character though she doesn't get as much screentime and is an odd \"main character status\" but satellite character to Eiko (but later episodes gives full focus to Chizuru breaking her status as a satellite character), Chizuru was LA's favourite, well because of her being the MOST badass character in the entire series ~geso.\\n\\n\r\nReally all these diverse and wacky characters really drives the comedy for this anime. Ika Musume being the centralized comedic focus of the entire anime, Ika Musume either is the catalyst starting things off like her running gag of wanting world domination, or her mundane fascination of human culture through whenever she encounters Takeru doing something, new powers or talents Ika Musume taken to either over the top results or again, her not being taken seriously, instead being used for mundane chores or Ika Musume gets involved later in other situations only to make it even crazier or evolve the other comedic skits in the process of her \"intervention\" ~geso.\\n\\n\r\nMany of the character-focused skits do have their running gags such as Nagisa's fear of Ika Musume, Eiko's boke to tskuommi routine with Ika Musume as well as any of the other wacky cast, Sanae and Gorou's obsession with Ika Musume and Chizuru respectively and Cyndi's obsession in trying to get Ika Musume into the lab, but where it makes the comedy and running gags not as stale from it's conception onwards is Ika Musume's involvement and just making the running gags evolve along with Ika Musume's involvement with it all, from Eiko and Ika Musume's relationship grows as Ika Musume gets integrated to Eiko's home to Nagisa's relationship and how she feels about Ika Musume's presences. Add in the fact that the pre-established comedic skits LA already mentioned gets combined in the later episodes due to certain wacky characters meeting up with one another giving almost unpredictable results on the matter as well as some of the more genre-switching \"silent comedy\" like the Ika-tan skit to \"slice of life\" like Ika Musume gaining an \"accidental\" best friend of Kiyomi Sakura voiced by Kokoro Kikuchi (which later gets a sports genre skit) to \"scary-horror\" with \"supernatural phenomenon\" which is linked to Ika Musume's fascination of human culture taken in the more scary superstitious route (which is ironic due to Ika Musume essentially being an anomaly herself) in between the largely comedic nature of the anime and you got a really good slapstick yet wide ranging comedy about a Squid Girl who isn't taken seriously with goal of world domination with oddballs and wackjobs surrounding her. LA's favourite skits would go to anytime Ika Musume finds out a new power about herself, the entire deal with Nagisa's fear of Ika Musume (as it changes things up of Ika Musume not being the boke to Eiko's tsukommi, instead Ika Musume is the tsukommi to Nagisa's boke), the combined skits due to the obvious wacky hilarity that ensues and finally Ika Musume's attempts at world domination through mundane ways were some of LA's favourite comedic skits ~geso.\\n\\n\r\nThough LA said that the comedic running gags do evolve, the majority of them goes back to status quo is some ways or another, (though in a slightly deviated stance, same skit, differing results) those being Cyndi's obsession of wanting to get Ika Musume as a test subject, Sanae's obsession with Ika Musume to Gorou's crush with Chizuru, these skits though sometimes deviating from it's typical running gags, it ends nearly the same way it does though sometimes the great punchlines does mask this, but even with that, it's easily compensated with the variety of comedic skits, newer and older or characters you just didn't expect to meet up and start interacting with one other (be it similar goals to Ika Musume or just weird meetups in general) as well as some of developed comedic skits really changing things anyways ~geso.\\n\\n\r\nIn terms of animation done by diomedea, the character designs are very standardized, the only exception being Ika Musume herself who has probably the most unique character designs, obviously what with her being a squid girl and all. The backgrounding is overall nothing much to talk about, but the more \"overexagerrated\" animations given can bring more variety to the animation as well. LA's most prominence in the animation would go to the character designs as Ika Musume herself was a memorable character designs further helped with the wacky antics she gets up to, the other cast members are rather noticeable usually because of their hair color or their wacky behaviour but nonetheless even that's helped due to their screentime and all ~geso.\\n\\n\r\nIn terms of voice acting, the voice acting is decent to say the least with some notable performances from Kanae Ito with her borderline yandere vocals, Rie Tanaka's dual vocals of her sweet to red-eyed with anger vocals were pretty well done. LA's favorite voice actor would actually go to Ika Musume's voice actor, Hisako Kanemoto. Why?, because of Hisako constantly being in character with her \"squid\" accenting of \"~geso\" at the end of her sentences. It may not be much and some people might found it annoying, due to Ika Musume going through several \"whining moments\" within the anime, but Hisako Kanemoto is the only one with this kind of accenting and her \"in-character\" quite honestly made Hisako Kanemoto deserves this spot, \"annoying\" or otherwise ~geso.\\n\\n\r\nShinryaku! Ika Musume is a very well done sitcom which is greatly helped by our titular character of Ika Musume, LA said it before but she's the glue that holds this anime together, both comedically as well as relationship-wise towards the other main cast as well, which was perfectly shown the last episode. Shinryaku! Ika Musume is one of those comedy animes where it has a simple setup but it pays off soo well due to the wacky character chemistry towards one another, the variety of comedy from straight up slapstick to character jabbing to it's great punchlines. Even though Shinryaku! Ika Musume has a bit of the \"status quo is god\" syndrome (and it does stay even during it's more unpredictable times), Shinryaku! Ika Musume nonetheless does evolve from it typical comedic skits, bringing us funnier comedic skits in the manner of combining skits together through it's characters or one-off skits different from it's own genre to give us something new which in itself makes it a VERY good character-centralized sitcom about one squid girl trying to take over the world ~GESO!!!!!!!!",
            "date": "2017-01-04T13:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 237419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=237419"
        },
        {
            "content": "Similar to many shows of the same genre, Ika Musume is episodic with multiple stories within each episode.  This, coupled with the writer’s ability to keep each and every section independent of repeat humor, kept the anime fresh from episode to episode, which is especially important given the fact that I watched this anime while it was airing.  Nothing hurts my attention to an anime more than watching an anime with an overall plot weekly; since I’m usually watching multiple shows at the same time, it’s hard to keep track of what’s going on, when and where.  With Ika Musume, I couldkick back for my weekly 30 minutes and enjoy good laughs and fuzzy feelings.\\n\\n\r\nGraphics\\n\r\nThe graphics of this show are pretty generic, with the soft colors and simple designs.  One thing I was appreciative of was the consistency of art throughout the episodes.\\n\\n\r\nPlot\\n\r\nAs stated before, I really loved how each skit was unique in humor and didn’t rely on older jokes to generate laughs.  You can pretty much pick up any episode in any order and still find yourself enjoying Ika-chan’s ridiculous gullibility.  The only reason I don’t give the plot a full 10 is because of the final episode.  \\n\r\n*SPOILER*\\n\r\nWhereas the previous episodes are episodic and don’t really cling to any serious ideas of character or purpose, the last episode suddenly throws in a very serious loss of self.  With reasons unknown, and never given, Ika-chan suddenly loses all her squid abilities: tentacle power, glow, and squid ink.  Her subsequent disappearance doesn’t amount to anything, as she comes back without regaining her skills, nor any hint about why she’s lost them.  This makes her sudden recovery, with the endangerment to Eiko’s life, all the more unbelievable.  I guess I’m supposed to assume that she regains everything because of a sudden realization of her affections for humanity, for the friendships that she has made?\\n\\n\r\nCharacters\\n\r\nShinryaku! Ika Musume boasts a relatively small cast of characters.  Ika-chan and Chizuru were my favorite characters by far; their weirdness and coolness were in completely different leagues, but still memorable in ways their fellow characters were not.  While Eiko was one of the first introduced characters, I never felt much attachment to her–she lacked any twists to her personality.  However, I didn’t feel any need for more from her.  She was just…there.  The same goes for Takeru.  In fact, I had to look up his name just to talk about him here >.< Cute? Sure, he had his moments.  Memorable? Obviously not.  Cyndi, Sanae, Nagisa, and Ayumi all feel pretty much on the same level; they serve the purpose of promoting Ika-chan’s cuteness.  As such, any attachment I have to them is an attachment to the scenes they share with Ika-chan.\\n\\n\r\nSound\\n\r\nI always have a hard time commenting on sound.  Unless the music was truly unique enough to catch my attention, I don’t really pay attention to it.  The same goes with sound effects.\\n\\n",
            "date": "2011-01-12T23:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 33708,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/50946.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Marina27",
                "username": "Marina27"
            },
            "url": "https://myanimelist.net/reviews.php?id=33708"
        },
        {
            "content": "I give this anime an 88/100\r\nFor some of you who know my taste in anime, I've never really watched a PURE comedy series. The only true comedy series I've really seen was Ouran High School Host Club, and that was long ago. But even so, Ouran is still technically a romantic comedy (though I really love it!), and I've never really encountered a PURE comedy anime that I really liked...that is, until Shinryaku! Ika Musume came around.\r\nI mean, how can you resist a story about a cute little squid girl who claims she wants to take over the world, but doesn't know beans about thehuman world nor does anyone take her seriously!? I read the premise of this before it came out and approached it with caution, and much to my surprise, the show is soooooo adorable in the best of ways! Even though Ika Musume came to earth because of her anger about ocean pollution and littering, this isn't really the theme behind the series. Then again, I don't know the whole point of this series at all! But who cares!?\\n\\n\r\nAlright, I'm gonna start off with talking about the soundtrack first. The soundtrack fits the series very well, and I often found BGMs that ALMOST sound similar to the soundtrack for 07-Ghost (especially during the scene where Chizuru attacks Ika Musume at the end of the first episode and karate chops her tentacles)! Plus the show has the catchiest theme song EVER! It's so wonderfully catchy that its almost impossible to get it out of your head!\\n\\n\r\nNow, onto the characters. The main cast are what really make this series shine. Ika Musume, our favorite little squid girl, is just adorable and wonderfully developed throughout the series. Her innocence regarding the human world is so endearing, especially when you consider she's a sea creature who wants nothing more than to rule the world! The other characters are nice too, and the best part? They're not stereotypes at all! They're actually ordinary people with a few quirks here and there. In my opinion, Eiko is kind of like the voice of reason for Ika Musume, Chizuru is basically the friendly older sister with a possibly deadly alter ego sleeping inside of her, Sanae, albeit being a bit too fangirly over Ika Musume most of the time, can be sane and normal when she wants to be, and this is shown in the final episode. But my favorite minor character has to be Kiyomi, the little girl whom Ika Musume is friends with. She's soooo adorable!\\n\\n\r\nI would've rated this series a bit higher, but my reason for this? Well...I thought Cindy Campbell and her scientist friends were a bit too weirdly portrayed and overly obsessive about aliens. I especially didn't like the scientists. They were the only bad thing about the series. I loved it when Chizuru rebuked them and stripped them and made them beg for her mercy in that one episode.\\n\\n\r\nBut I honestly feel that the #1 best thing about Ika Musume is the 7 minute segment featuring \"mini\" Ika Musume at the end of episode five. I would give that single segment a 97/100 if it were just a standard anime since it's short but so adorable, cute, endearing, sad, and just plain simple and to the point. That particular segment seriously MADE the series for me. And it made the series for a lot of other people too, especially since it's inspired the creators to include segments in later DVDs!\\n\\n\r\nAll in all, if you're looking for a cute and refreshing comedy anime with good characters, a nice atmosphere, and mildly great comedy, than Shinryaku! Ika Musume is the one for you! I know I really liked it! In fact, it's the ONLY fall 2010 anime I ever watched! The other ones didn't interest me. You should try it! You'll really be surprised!",
            "date": "2011-01-06T16:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 33513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/355846.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Firechick12012",
                "username": "Firechick12012"
            },
            "url": "https://myanimelist.net/reviews.php?id=33513"
        },
        {
            "content": "ignorant people who disrespect the sea, meet your doom.... yea, thats how it basically starts out. there tends to be at least 1 dramaish moment an episode, that really makes this series drag, but despite that its probably one of the better, if not the best, anime of 2010.  \r\nthis is based off manga who chapters feel like a 4koma, but in full manga form. as of chapter 46 (i have no idea what its up to in japan, but im at the very least doubleling it) none of the parts in the anime that tend to drag along for to long are inthe manga, im hesitant to call it filler... because i don't know. but even with them this is a great show for just fun watching it, as almost every episode is standalone.\\n\\n\r\nthe art, its almost like they went to great lengths to make the anime the exact same artstyle as the manga, and it works. not many anime put this much effort into making the manga -> anime conversion work right, in most you can find them lacking in some way, but i personally cant with this one. \\n\\n\r\nthe characters are the main reason that this anime turns out to be so enjoyable. there isnt much depth in them at all, what you see is what you get, and the parts that drag on are the ones that try to make them have depth. \\n\\n\r\nover all i can recommend this one to anyone who can stand comedy, as i have recently met people who cant.",
            "date": "2011-01-06T01:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 33489,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24683.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/alidan",
                "username": "alidan"
            },
            "url": "https://myanimelist.net/reviews.php?id=33489"
        },
        {
            "content": "Squid Girl, I want to eat you.\r\nAUTHOR'S NOTE:\r\nI picked up Shinryaku! Ika Musume after watching a particular .gif that made me laugh my ass off. At first, I was very hesitant in watching such a show due to its childish animation. It looks like a show for kids. I was wrong. Ika Musume's cover might look innocent on the outside, but it also has a very disturbing comedic undertone that many may look past on. I hope this review will give you a inkling of what I'm talking about, de geso.\r\nSTORY (7/10):\r\nShinryaku! Ika Musume begins as environmental propaganda. When humans begin abusing their existence andtreat Mother Nature like trash, she tends to strike back with tremendous force. So, Mother Nature threw up Ika Musume from the sea to land, in order to set mankind straight. The mysterious creature that ascended from the depths arrives to Japan and initiates an invasion that will enslave all land dwellers. However, our tentacled cephalopod realizes that an invasion would be impossible when she encounters friends, thus hilarity ensues. Pretty simple storyline, isn't? Borrowing from the popular Nickelodeon cartoon, Invader Zim, Ika Musume attempts to invade Earth, though ignorant to the fact that the Earth is a bigger place than she had initially thought. Nevertheless, the storyline transforms into a story about a innocent girl with sinister plans that lives in a world that is not of her own. She is forced to play the \"rules\" (social norms) and is slowly introduced to the world of mankind, starting from the very bottom. Certainly, Ika Musume does in fact \"invade\" our world, but in a totally different way. Instead of conquering the land, she ends up conquering the hearts of the characters and viewers alike.\\n\\n\r\nART (7/10):\\n\r\nQuite colorful and spontaneous, the anime doesn't let the viewers peel their eyes away for a second. From episode one to the final episode, the background moves with the characters. Every emotion that is felt from a character is noticeable. Although the animation does not stimulates your eyes with exquisite visuals, viewers will not be interrupted and confused. Many of the characters have similar facial designs and eyes, but due to their unique personalities, each animated face give a refreshing quality depending on their character.\\n\\n\r\nSOUND (7/10):\\n\r\nThe OP \"Shinryaku no Susume\" by Ultra-Prism has a fiery sound, much like a superhero theme song. On the contrary, the fast-paced melody is quite fitting to the anime. The EP \"Metamerism\" by Kanae Itō sets a lullaby that becomes a tranquilizer for all the comedy and ridiculousness that this anime tosses at the viewers. Slow, yet catchy, it is a satisfying end for any action-packed anime that wants to bring the curtain down to a close.\\n\\n\r\nCHARACTERS (9/10):\\n\r\nThis is where it gets really weird. I swear every ounce of comedy, whether it is dark or light-hearted, is squeezed out of the characters. It is interesting to note, that every character have their own unique comedy effect towards viewers, due to their salient personalities. Ika Musume, is our anti-hero/heroine, who has come from the sea to invade Earth. Her innocence, curiosity, and many times, her ignorance becomes a staple comedy factor to the anime which can only be satisfied through irony. The anime is also split into \"mini-fillers\" which stars a chibi Squid Girl, who entertains our viewers with outrageous adventures that is both hilarious and moe. The Aizawa family (from oldest to youngest), Chizuru, Eiko, and Takeru, are the caretakers and victims to Ika Musume's menace. Their relationship with Ika Musume is a cycle of heart-warming comedic scenes as they learn from each other what it means to be a lost child in a foreign world, and what it means to have a loving, caring family. Sanae Nagatsuki fills the disturbing comedy void that this anime shamelessly exposes, which is one reason why Shinryaku! Ika Musume is NOT an anime for kids. At first, Sanae is a friend and classmate of Eiko who has a mutual relationship with her pet dog. Until Sanae is introduced to Ika Musume, the girl turns into a creepy stalker and a obsessed pursuer for Squid Girl's love, and don't ask me if she's into yuri or has a plain rapist mentality. Sanae engrosses the viewers using dark comedy with her \"M\" personality.\\n\\n\r\nThe supporting characters also have their own unique personalities that I wish to delve on, but I don't think I want to go on any further. It doesn't mean they are garbage characters, as they fulfill their duties quite well and turns the spice of the comedy to high, depending on their screen time they get in the anime. You just have to watch the anime yourself.\\n\\n\r\nOVERALL (8/10):\\n\r\nHonestly, I've enjoyed Ika Musume to the fullest. It is difficult for me to say this anime is a revolutionary work in the making, but I do encourage you to take a stab at it. I must admit that Ika Musume is slapstick comedy at its finest, ranging from plain ridiculousness to classical. I definitely had some moments where I could not stop laughing at how ludicrous some scenes were and would feel really guilty at how fucked up it was. Anyhow, I highly recommend anyone with a sense of humor to entangle their tentacles into this anime and enjoy it as much as I have.",
            "date": "2013-12-26T22:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 125775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3374685.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/trillshit",
                "username": "trillshit"
            },
            "url": "https://myanimelist.net/reviews.php?id=125775"
        },
        {
            "content": "I started watching this sereis out of boredom but its fairly entertaining. Yes the overall story is pretty bad the characters are underdeveloped and the style of them feels rather american, but for some reason I cant stop watching, the way Squid girly is so oblivious of human life and all the squid related puns are amusing. I will defiantly continue watching but there has to be no way she will ever take over the world.",
            "date": "2011-10-12T15:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 45415,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/381551.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/neonmoo",
                "username": "neonmoo"
            },
            "url": "https://myanimelist.net/reviews.php?id=45415"
        },
        {
            "content": "An anime that brought me particular enjoyment. Not to due it splendiferous comedic value alone, but the fact that the comedy worked in flawless tandem with the evolution of the main character Ika, culminating in the beautiful final episode.\r\nNow i praise the characterization, due to the growth I got to Ika as the season progressed. \r\nNow as for the story, i found it to be old hat, but it worked very well, and was surprised to see how engaging it was kept with such a limiting setting such as the beach.\r\nIn all this anime is worth the watch if just for humor alone.",
            "date": "2013-05-09T19:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 96569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2536867.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mrsnow---bunny",
                "username": "Mrsnow---bunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=96569"
        },
        {
            "content": "If you like cute things mixed in with slice of life and comedy, than this is the anime for you!\r\nShinryaku! ika musume(侵略!イカ娘) is by far one of my favorite animes. It is cute, there are many recurring characters who you'll love the instant you meet them and the show is funny too. What more do you want?\r\nStory 8/10\r\nEach episode is divided into 3 smaller episodes. The episodes themselves are, in my opinion, so easily thought of that even a child could come up with it. For example(mind you, this does not happen in the show itself): >Ika-chan goes to the supermarket because she has tobuy some things for dinner. Instead of buying the needed suplies she buys some icecream. The money is now gone and she is in trouble, because Chizuru is going to kick her behind<\\n\\n\r\nThis could be an episode of Shinryaku Ika Musume, it's that easy. Does that mean that Shinryaku Ika Musume story is boring? NO, NOT AT ALL! Altough the stories are easy to come up with, they are well written and unless you've seen Shinryaku Ika Musume a couple of times like I have, you won't think about how simple the plot line is, you just go with the flow and enjoy it. Mainly because Shinryaku Ika Musume is so funny that your attention is diverted from the simple plotline. For that reason, I give the story an 8.\\n\\n\r\nArt 7/10\\n\\n\r\nThere's not a lot I can say about the art. I think most people would give it a 6 since the art is like any other regular anime. To me, however, because I like regular anime art, I gave it a 7. That is the sole reason. The art is definately not outstanding.\\n\\n\\n\r\nSound 6/10\\n\\n\r\nExpect a lot of sea in your ears. That's all folks!\\n\\n\\n\r\nCharacter 9/10\\n\\n\r\nThe characters are in one word: AWESOME. All the recurring characters are something special. You'll bond with them the moment you meet them. Every character has their own little quirks which makes this comedy so good. You'll meet Ika-chan who finishes her sentences with Geso, the san baka(three stooges) who destroy more than Ika-chan ever will, scary Chizuru and many more lovable characters.\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nI have watched this anime 3 times and I'm planning on watching this one for a fourth time pretty soon! Before I watch Shinryaku Ika Musume I tend to watch tons of action and psychological anime so afterwards I can relax with Ika-chan and her friend.\\n\\n\r\nI enjoy every episode, even after watching it 3 times. This show is simply amazing. For me, it's definately a 10 out of 10.\\n\\n\\n\r\nI recommend this anime to anyone who likes cute things, the slice of life genre and likes a slow paced, relaxed anime. This is not an anime for people who crave action, because you won't find that here.",
            "date": "2016-06-29T14:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 222368,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5128868.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Razovy",
                "username": "Razovy"
            },
            "url": "https://myanimelist.net/reviews.php?id=222368"
        },
        {
            "content": "This anime is about a girl that is part squid and came to the land of Japan to take vengeance on the humans. The series is episodic in its story lines and it is the type of anime were you can enjoy it with out a brain. The main character herself seemed to me the child of a tentacle hentai, if you know what I mean. But other than that it is an anime in which is enjoyable for most audiences. It is more of a comedy than anything else but it is some thing to watch in between dramatic anime or just some thingto make you awkwardly smile.",
            "date": "2014-05-10T20:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 142943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3742633.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Devilgirl3",
                "username": "Devilgirl3"
            },
            "url": "https://myanimelist.net/reviews.php?id=142943"
        },
        {
            "content": "Summer is supposedly a good time for swimsuits, swimming in pools and oceans, seasonal work, tanning, the air conditioner, and mainly having fun. (Also for \"getting laid.\") And we humans still need to remind ourselves that our environment is not something you can mindlessly throw in the trash can.\r\nSaid trash can is where latter message went; with this \"comedy\" called Shinryaku Ika Musume. This anime is about the plight of a \"moe-tized\" squid as she tries to exact her revenge against us \"evil humans\" yet can't even defeat those humans who run and frequent a seaside restaurant.\r\nTwo issues I have with this title:\r\n1) The InvincibleChizuru. She has no weak spot or exploitable weakness. She just cuts anybody down to size. Despite her sweetness, her character's NO GOOD.\\n\\n\r\n2) Japan's blatant anti-American, \"non-Asians are stupid / the bad guys (if they're not hot chicks or cute jailbaits)\" strikes once again here. (I mean... Media Blasters had license this for Western release, right?)\\n\\n\r\nI held my tongue about the lack of good male lead in this anime. (Takeru is a little boy and Goro is in his 20s.) But DAMN, animu industry! Summer's mainly about having fun! Why does YOUR idea of \"having fun\" need to ruin it for everybody else?!",
            "date": "2011-07-02T01:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 38578,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=38578"
        },
        {
            "content": "This anime is very light hearted and simple to enjoy. For starters, the show is about a squid girl who wants to invade the surface. Nothing to get confused with here. Much like something like spongebob, it's structured where there's a general plot and setting introduced into the first episode, and afterwards each episode is made with multiple story arcs that can introduce characters, develop characters, and make you laugh your butt off. The art was quite pleasing to the eye. Bubbly and fun. Bright and colorful. Nothing too out of the ordinary. The characters are nice and cheerful. I would describe most of thecharacters as being 2D without much more to them besides that they're all unique. This includes Alex, the dog. As for enjoyment, I would rate this a 8. Most comedy genre titles won't make even make me smirk. However multiple times throughout this anime, its just too funny not to laugh. There are way too many times I had to close the door to my room while watching this anime just so I don't creep out the rest of my family.\\n\\n\r\nI would definitely recommend this anime to any anime fan. Whether you're just starting to watch anime or need a nice comedy to sit down and laugh to after a long day.",
            "date": "2015-08-29T18:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 197445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4696487.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yobibear",
                "username": "yobibear"
            },
            "url": "https://myanimelist.net/reviews.php?id=197445"
        },
        {
            "content": "Well, basically the story is about a very cute squid girl who wants to invade earth and punish humanity for polluting the sea. And that’s it! There is no specific or complicated plot whatsoever. It is just about the everyday life of the protagonist and other characters. It can be so funny and touching as well. Every now and then it’s good to rest from complicated storylines and plots. It is also nice to see some light stories sometimes. \r\nEveryone has their own fair share of uniqueness or weirdness. And the weirdest of all is Sanae with her very creepy yet hilarious obsession with Ika-chan.Most of the characters are adorable and interesting. But of course, the most adorable and interesting of all is Ika Musume. Everything about Ika-chan is just so damn adorable and cute; from appearance to personality to the way she talks and to her unusual antics. Her naivety to almost everything is making her even cuter. Because of her naivety, she’s easily fooled or people make fun of her which is no doubt giving her more cuteness. Let’s not forget her unique abilities and weird antics which are just so adorable. With her suppose devil plan, she’s sure is very simple-minded and can be air-headed sometimes. She’s also so easy to satisfy. And the mini version is even cuter.\\n\\n\r\nThe animation and artworks is unique on its own way. The characters’ design is what making all the difference. But of course, the most nicely done is Ika Musume herself. She’s one of the cutest and most adorable characters I’ve ever seen. Her dress, shoes, and very squid-like head are making it a complete package. And my goodness! Her tentacles are just irresistible. Her “geso” at every end of her sentences just completes the whole cuteness of Ika-chan.\\n\\n\r\nIt may not be the most exciting and amazing series out there. It doesn’t even have a spectacular yet complicated plot that others have. However, it is definitely not boring and there is absolutely no dull moments. It is fun, nice, and heart-warming series.\\n",
            "date": "2012-12-10T05:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 79788,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79788"
        },
        {
            "content": "A solid comedy to the end with some pretty funny sub-episodes, and enough of a emotional ending to not feel like it just stopped. I thought it kind of overplayed everyone's distinguishing characteristic (like Chizuru's martial arts) to the point where season 2 might be a strained pale parody of the original which outstays its welcome, but that's not a big problem if you stop with season 1.",
            "date": "2013-05-11T17:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 96795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/419845.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gwern",
                "username": "gwern"
            },
            "url": "https://myanimelist.net/reviews.php?id=96795"
        },
        {
            "content": "Konnichi-wa! It's my first anime review on MAL, and since I've completed this series just recently, I'd like to do my impressions for it before going back to other series I've watched earlier. \r\nSTORY:\r\nShinryaku Ika-Musume does not have any real plot, rather every episode is made up of three short skits that illustrates the humorous everyday life of Ika-chan (the protagonist) and her 'adoptive' family. Just like other similarly structured comedies such as Crayon Shin-Chan and Seitokai Yakuindomo, each skit is either a hit or miss: you either have a good laugh at the end of every seven minutes or you go 'jeez~'. \r\nHowever, letme assure you that Shinryaku Ika-Musume will definitely have you ROFL at the end of every skit. At least I do. Unlike a lot of other comedies which usually consists of repeating the same old joke every episode until you are totally bored, Shinryaku Ika-Musume doesn't. You can see Ika-chan playing with her friends in one skit, and the next you see her fooling the three MID scientists. The same joke rarely repeats itself. Every skit is well-crafted, and it brings you a broad smile on your face at the end.\\n\\n\r\nART:\\n\r\nShinryaku Ika-Musume sports some good character designs, most unforgettable of all includes Ika-chan and of course the three MID scientists. Other than that, the art throughout the whole series is pretty standard. \\n\\n\r\nSOUND:\\n\r\nI wonder why slice-of-life comedy series seldom gets awesome soundtrack. Probably because it's a 'slice-of-life' series, it's meant to emphasize the everyday lives, not some epic story or things like that. That being said, the soundtrack of Ika-Musume is also not something you would look out for. \\n\\n\r\nOn the other hand, the OP and ED of the series are quite good. The OP, 'Shinryaku no Susume' is catchy and fits the overall mood of the series. The ED, 'Metamerism' was a weird choice for such a lively show, but nevertheless it was a decent song.\\n\\n\r\nWhat I particularly enjoy most about Shinryaku Ika-Musume's sound is the voice acting. Ika-chan's voice actress was obviously a correct choice - she managed to inject life into the cute character. Another character who had a great voice was Chizuru (I call her Brock Ver. Female, just to let you know). \\n\\n\r\nCHARACTER:\\n\r\nBecause it was a show made up of character-driven skits, the character development was done quite well. Each character had enough screentime and had good development. As the show progresses, we see more and more different perspectives of the characters. Obviously the one who got the most development was Ika-chan. Other people, such as Eiko and Sanae, was developed well too. However, Chizuru still remains my favorite character.\\n\\n\r\nOVERALL:\\n\r\nAll in all, Shinryaku Ika-Musume is one good comedic series that I would recommend to even my friends who don't watch anime. The well-written humor mixed with the slice-of-lifeness would make you want to watch it again and again.\\n",
            "date": "2011-10-14T04:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 45513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/664003.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mrghost_00",
                "username": "mrghost_00"
            },
            "url": "https://myanimelist.net/reviews.php?id=45513"
        }
    ],
    [
        {
            "content": "Story: The Story of Shinryaku! Ika Musume is about a Squid Girl who wants to take over mankind for polluting the ocean. When she submerges from the sea, she deices to take over a beach house called the Lemon. While showing off she tries to kill a mosquito she breaks one of the beach house's walls. She is then force to work until she pays of the damage she caused.\r\nArt: The art style of Shinryaku! Ika Musume was pretty good. I quite liked how scenery and the beach were styled in each episode.\r\nSoundtrack: The soundtrack for Shinryaku! Ika Musume is awesome. They really chose theright music to suit the right times in the anime\\n\\n\r\nCharacters: I loved all Characters because they all had a different appeal to them. But I think, I like Squid Girl the most for just being so damn cute and funny at the same time\\n\\n\r\nOverall: I give Shinryaku! Ika Musume a 10",
            "date": "2013-01-13T04:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 83531,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1776867.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Neku_Tennyson",
                "username": "Neku_Tennyson"
            },
            "url": "https://myanimelist.net/reviews.php?id=83531"
        },
        {
            "content": "Let's just say... my friends say that I am most likely to grow up and start a religion called \"Squidgirlism\"\r\nStory:\r\nIka Musume features short, cute stories (3 per episode) and most of them are stand-alone.  There really is no plot, aside from Squid Girl wanting to invade humanity and failing, but it is incredibly entertaining and I loved every minute of it.  It is one of the few comedy anime to make me burst out in laughter many times over.\r\nArt/Sound:\r\nThe art is, again, cute, and Squid Girl's design is very memorable.  Both the Japanese dub and the English dub are good (quite surprising),and the OP \"Shinryaku, Ika Musume!\"/\"Let's invade!\" is probably one of the most comedic and memorable OPs that I have ever seen.  I loved it!\\n\\n\r\nCharacter:\\n\r\nThough there is little character development, each character has a distinct personality, and you can always count on them to follow their norm.  It's enjoyable to see them thrown into odd and funny situations again and again.\\n\\n\r\nI love Ika Musume, and I'm sure you will too.  ;)",
            "date": "2014-04-05T14:38:00+00:00",
            "helpful_count": 0,
            "mal_id": 138815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3536825.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Darkgreenwoods",
                "username": "Darkgreenwoods"
            },
            "url": "https://myanimelist.net/reviews.php?id=138815"
        },
        {
            "content": "This anime almost made me spit up ink... unfortunatly though I'm not a squid... yet. Any who, This anime is wraped around Squid Girl (or Ika Musume in the Japanese anime), who intends on ink-vading the Earth to protect the sea. To be honest... when I first saw this anime I thought it was going to be about a hippy trying to get mankind to take better care of the ecosystem, but it actually isn't like that very muchat all. The show's a comedy about a freaking Cthulu (H.P. Lovecraft) wanna be trying to gain the control of the land for squid sake.",
            "date": "2012-08-15T12:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 69845,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/oath-keeper95",
                "username": "oath-keeper95"
            },
            "url": "https://myanimelist.net/reviews.php?id=69845"
        }
    ]
]