[
    [
        {
            "content": "Made by Studio Trigger who were famously behind Kill la Kill, comes another piece of work as absurd as the former. To sum it up, Uchuu Patrol Luluco is like opening a box full of colorful chocolates which would burst open once put in the mouth. \r\nOgikubo is a fictional place set far in the future time where aliens and humans and come terms with each other and live together. Uchuu Patrol Luluco follows Luluco, a seemingly normal teenage human girl who seeks a normal lifestyle herself in this crazy city filled with mysterious creatures. But of course that isn't the case as Luluco isappointed as the newest member of the Uchuu/Space Patrol Agency, an organization fighting against crimes and serving justice in the world of Ogikubo! \\n\\n\r\nUchuu Patrol Luluco specializes in slapstick over-the-top humor and comedy with its cartoon-ish animation. It's flashy all the time and oozes extravagant visuals which is eye candy. \\n\\n\r\nThe music is as absurd as the anime itself. Techno-like soundtracks keep interchanging during the episodes which go hand in hand with the excessive and highly exaggerated dialogues. Among these attributes, the two very opposite opening and ending themes can be added as well. \"CRY MAX Do-Heijitsu\" by Fujirokyu (Kari) has some of the ridiculous vocals I've heard to date. The song changes lyrics as the show progresses as well. One heck of a composing that is. Standing to the exact opposite of that is the soothing \"Pipo Password\" by Teddyloid ft. Bonjour Suzuki. Amazing mixture of sensual vocals and a use of ambient tunes. It also has very good visuals to add to that. It turns out as my favorite ending song of the season and it shouldn't come as a surprise to who've heard it as well. \\n\\n\r\nLuluco is the main character of the series. She's cute and has feelings for Nova, another member of the Space Patrol Agency accompanying Luluco. Luluco secretly loves him. He's calm, rational knows what he is doing. Nothing is shown as such that he has feelings responding to Luluco's feelings for him. Midori is the last one of the three members of the agency, she is caught as a criminal first but inadvertently becomes a member! The one who makes her the member is the chief of Space Patrol Agency, Over-Justice. His name implies his very exact characteristics. Someone who is hell bent on giving a little too much justice! There is an assistant of Over-Justice who never speaks during the show, so little is known about her. Lastly, Luluco's father Keijo and her mother Lalaco Godspeed. Her father is a veteran member of the agency and her mother is surprisingly a Space Pirate who re-unites with Luluco under extremely abnormal (Pun intended) circumstances. \\n\\n\r\nUchuu Patrol Luluco racks up points for the sheer enjoyment and laughs it gives off, even if there is literally nothing that keeps progressing as a storyline. Heck, between one of the episodes, they even mention that the script is still incomplete and they're doing it simultaneously as it airs. There's one thing that I never understood though; there's a tagline between every three episodes which implies that this thirteen-episode series in fact is divided between four seasons with a couple or three episodes each. That was something I never understood. Oh, that might be just Trigger being themselves. \\n\\n\r\nUchuu Patrol Luluco is best enjoyed when you've watched Kill la Kill, as it uses a lot of references from that show. In fact it also uses several other characters from shows done by Trigger. All in all, Uchuu Patrol Luluco is like a family gathering of Studio Trigger. It's just a shame that this is a short worth only seven minutes, but perhaps that is where it truly shines and achieves something a show with that duration rarely ever achieves.\\n",
            "date": "2016-06-24T10:17:00+00:00",
            "helpful_count": 133,
            "mal_id": 221743,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903513.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/karlstein12",
                "username": "karlstein12"
            },
            "url": "https://myanimelist.net/reviews.php?id=221743"
        },
        {
            "content": "\"And we realized that a reckless, ignorant middle schooler's foolish first love was the most worthless, trashy garbage in the universe.\" - Blackholeian.\r\nFunny. \r\nCrazy.\r\nUnapologetic.\r\nFresh.\r\nSavvy.\r\nNuanced.\r\nRidiculous.\r\nHow does one even begin to describe Luluco? I can give it many definitions, and yet it seems as though none of them can truly define it. There have been, and will be many synonyms for the word crazy used to attempt to encompass Luluco's uninhibited originality- insane, unhinged, verrückt, loco, おかしい (okashii), rabiosus, gek, mad, bonkers, nutso- it could go on forever, and still never truly capture the idea. \r\nOne could also call Luluco perhaps the best \"lore\" show ever made,transforming a disparate set of series and franchises into a single universe- a million, million worlds. (Move over, Carnival Phantasm!) \\n\r\nFor the Hiroyuki Imaishi fans, Luluco represents yet another of his unfettered, unrestricted creative explosions, bursting at the seams with referential details and a sense of wildness that he's become known for.\\n\r\nOthers still may think of Luluco as a breath of fresh air in the stale scape of the anime industry in the spring of 2016, bringing with it an \"air\" of lighthearted humor and silliness that also manages to be exquisitely captivating. \\n\\n\r\nHiroyuki Imaishi has done it again. What he can do in 7 short minutes with a seemingly nonsensical, three beers too many plot tops what a thousand other anime cannot touch in 13, 24, or 50 full episodes. Going way over the top, reaching ever higher beyond the walls of conventionalism- Luluco takes a leap for the mythical, and lands among the fantastical. If Luluco does one thing right- it's that it has a plot. It manages to weave in a tale of first, innocent love, coming of age narrative, a metric long ton of references, cameos, homage, and Great Justice into a cohesive story amid the chaotic presentation of the show. Truly impressive is the amount of content mashed into the all-too-brief runtime of Luluco- and it must be seen to be believed. \\n\\n\r\nFans of Imaishi and Trigger will find a lot to love about Space Patrol Luluco, as the show gives us fanservice in the best possible way- the original definition of fanservice. (For those who have forgotten and thinks that this is comprised entirely of vaguely underage girls exposing themselves- you're wrong. It's a practice as old as literature itself- with meta references to other works). Luluco is stuffed full of the aforementioned references and cameos from nearly Trigger's entire catalog, in addition to their penchant for making a boatload of references to other series. Trigger fans, start drooling now- because none of your favorites are excluded from this referencextravaganza, not even Sex and Violence with Machspeed. \\n\\n\r\nThe show itself has a rather quirky art style, rather westernized, like Panty and Stocking- though it also combines (or morphs into) the styles of the many anime that it borrows from, at will. With a pulsating, pounding soundtrack from Kenichiro Suehiro and the more well known TeddyLoid (Panty and Stocking OST), the music keeps up with the frenetic pace of the show well, and accentuates the highs as well as the lows. There is also a lot of sampling of tunes used in other Trigger shows- one of which reduced me to a screeching, blubbering moron upon hearing. (I'll not reveal which). \\n\r\nOnce again, Trigger's casting is near perfection- with some old and new faces alike. They even drug Mayumi Shintani (Haruko, FLCL- Nonon, KLK) out of retirement! \\n\\n\r\nIn closing- there's a lot to love about Luluco. (Yeah, I know I've said Luluco like 12 times in this review.) Let it be said though, that if you despise Trigger and all they've created- stay far away from this one, unless you're just a masochist- but then again, there's honestly no reason for anyone who's not a fan to watch this, as it's as I stated above- fanservice in its most pure form. Anyone who's found anything to like in a production of theirs up until this point in history will find something to like here. For those wanting a lighthearted, quick witted, frenetic tempo'd, universe sized explosion of a show- you've come to the right place. Prepare to be blown away. \\n\\n\r\nFOR GREAT JUSTICE!\\n",
            "date": "2016-06-24T10:39:00+00:00",
            "helpful_count": 118,
            "mal_id": 221749,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=221749"
        },
        {
            "content": "Space Patrol Luluco is incredibly flashy and weird (in a japanese fashion), yet somehow it feels uninteresting and average, almost boring.\r\nFrom its cute and immediate presentation to the almost hip-hop montage during its peak moments, I've never felt so disarmed by an anime: everything on the screen stays for about five seconds before dying, moving, or screaming. All goes faster, then slower - because there's a character we need to introduce, so here's the camera pan from the bottom to the top and a shiny sound effect - before going crazy again. All of this in seven minutes per episode, which, at one point, becomesunbearable.\\n\r\nIt's understandable that Trigger may have went for a crazy approach with the series: \"Luluco's a tame girl in a town. But there's aliens, so that changes everything, and it's funny!\", filling the market with some other content, some other merchandise, something meaningless on which people will talk and thrive on about. The introduction is average, the music is average, the characters are... there. They do stuff. They look pretty. Something weird happens. They look even prettier when they move, and that's all.\\n\r\nSpace Patrol Luluco is the fast food equivalent of anime: get a fix of quirky content, chew onto something, but not for the quality, just for sake of it.\\n\\n\r\nTrigger says \"style over substance\", I say it's time to stop.",
            "date": "2016-06-26T11:25:00+00:00",
            "helpful_count": 82,
            "mal_id": 222050,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5487221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ambaradan",
                "username": "Ambaradan"
            },
            "url": "https://myanimelist.net/reviews.php?id=222050"
        },
        {
            "content": "Space Patrol Luluco is essentially one giant fan service vehicle if you're a big fan of most of studio Trigger's works and it stands pretty well as its own thing too.\r\nThe story, like most of Trigger's works, is over the top, flashy and loud but instead, unlike Kill la Kill, this insanity is compressed into short seven minute episodes and is one of the best anime of this format I've seen in a while. The story revolves around our main character, Luluco, an ordinary girl in a not-so ordinary world filled with aliens and space travel and the such. While her father accidentally freezes himself,Luluco takes him to the space patrol station in which Inferno Cops' sensei (I'm not making this up, this is canon) called 'Over Justice' makes Luluco part of the team to stop crime.\\n\\n\r\nAs part of the space patrol, she can now turn her own body into a gun thus ruining her hopes of ever having a normal life. I'd go a little more in depth but I don't want to go into spoiler territory but surprisingly, the anime does have an over arching plot, which, because of the run time doesn't contain anything smart or thought provoking but because the anime is so much fun and the story is so over the top, it doesn't matter. You get the same kind of feeling of story telling as you do with shows such as Kill la kill, but only on a much smaller scale.\\n\\n\r\nThere are plenty of great action sequences with great character designs and action, it's easy to be entertained. Its art style reminds me a lot of the series 'Panty and stocking with Garterbelt' since at times it resembles more so a western cartoon than anime. The sound is great and the world feels vibrant, loud and colourful.\\n\\n\r\nThe characters are all fun, stupid and great to watch with Midori being the best girl and no shortage of funny moments between the characters. The anime also features a whole bunch of cross overs between different shows that Trigger has made, and if, like me, you like these shows then this is a massive treat.\\n\\n\r\nOverall, this show is stupid, fun and over the top. It has nothing in the way of deep symbolism or ground breaking story telling, but its very entertaining and one I would recommend watching. \\n\r\n(video version coming soon!)\\n",
            "date": "2016-06-24T12:58:00+00:00",
            "helpful_count": 57,
            "mal_id": 221763,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=221763"
        },
        {
            "content": "A short anime made with little effort deserves a short review written with little effort.\r\nThere exists a principle in economics called diminishing returns. It also applies to comedy and art. Remember Inferno Cop? Remember how funny and different it was? You first saw it and your jaw dropped. You just HAD to share it with friends. Then we got Ninja Slayer and it was the same fucking thing, but it was still funny. Much like Hangover 2 was still funny. Luluco is Inferno Cop 3 and while not as bad as Hangover 3, it's still pretty bad. I honestly found myself laughing very sparsely bythis point. They changed NOTHING and expect us to still keep laughing at the same joke. I'm sorry Mr. Imaishi, but this horse is dead. You killed it. It's time to stop beating it and move on to something else.",
            "date": "2018-09-02T20:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 287996,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=287996"
        },
        {
            "content": "Oh man, Trigger has done it again.\r\nWhat I loved best about space patrol Luluco is that at the moment Trigger seems like they have found what direction they want to go in. Magical girls, transformations, supernatural and comedy. Right now it is as if Trigger is sticking with their roots for this title. I love how they are still able to do whatever they want with their shows. They like being innovative with their titles, I respect that.\r\nThe story is really simple but is purposely made crazy because you know, trigger... gainax.. Uchuu Patrol Luluco follows the life of Luluco, a.. you know what, youcan actually get this information from the reading the description of the show.. anywho, I liked the story. I thought it was pretty interesting in all honesty. Before I get into it I'd like to say that I don't think Luluco is the best thing to come out of Trigger however it definitely had the potential to be something greater. Because the show was about 6-7 minutes 6 minutes of actual story lots of the plot for episodes and other related details are rush to the point where it sort of felt displeasing. I did find the whole \"Seasons\" thing unique. I think it was actually a smart idea to have them make like 3 episodes, end of season 1, 3 episodes end of season 2 etc because Luluco's not getting a \"Real\" second season simply because the show only has Thirteen episodes. Maybe net animations, hell maybe even an OVA here or there however with the presentation of the story and the rush, I don't see this series a long term thing.\\n\\n\r\nArt was choppy & sloppy, yet creative. Character designs were unique, however they lacked a certain charm to them. This isn't a bad thing however simply because the characters seemed as if they were designed to fit their characters personalities. Luluco for example is an ordinary girl, so she's a little plain in terms of designs however, she's given a cute little perks in her personality to make up for what she lacks in design or appeal. With animation however, I simply was not too impressed with the work Triggs put into the show. \\n\\n\r\nPipo Password was perhaps the best song composed for the entire soundtrack. It was beautiful, and really fit the theme for the series.  Bonjour Suzuki's vocals, her voice was so soft and soothing, and really complemented the beat produced by Teddyloid, who has done lots of work on shows for NAX before.. like  P&S with G-Belt. The voice actors were pretty good delivering both serious and non-serious lines.  The actors did an amazing job with adding speed & energy with lines that required it. I beleieve that is a reqiurement when auditions for a role for characters in a Studio Trigger title... but then again I probably just made that up.. do I suck or what? :)\\n\\n\r\nCharacters are as bizarre, odd, and  insane.. Like any other trigger or Gainax title. They had energy, and I like that. Character developments were pretty strange, espeically when it came to Gun Morphing however it was still funny too watch. If there was any real reason to watch this series I'd say it's to see what becomes of the characters later in the series. \\n\\n\r\nOverall I was impressed with what the team came up with because again, I do feel like Trigger has the talent to make really interesting shows with more than unique and bizarre stories and characters. Following the life of the adorable Luluco as she tries to save her Papa and find true love was certainly something I did enjoy re-watching. I gave the show a 7/10 simply because it wasn't too good nor was it awful. It's like right in the middle. \\n\\n",
            "date": "2016-08-12T12:43:00+00:00",
            "helpful_count": 16,
            "mal_id": 226576,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=226576"
        },
        {
            "content": "As a short, thirteen-episode series, Space Patrol Luluco redefines what it means to be “fan service” by existing as a vibrant amalgamation of Trigger’s expansive catalog of series, all centered around a middle-schooler seeking normalcy in an unlikely place.\r\nWill you like it?\r\nYou may enjoy Space Patrol Luluco if you…\r\n-- consider yourself a fan of the animation studio Trigger\r\n-- enjoy content that focuses on referencing other content\r\n-- seek a short, casual series that doesn’t take itself seriously\r\nYou may not enjoy Space Patrol Luluco if you…\r\n-- don’t have a taste for off-the-wall types of series\r\n-- largely dislike repetition within episodes\r\n-- expect a high volume of maturity\r\nStory\r\nSpace PatrolLuluco concerns itself with the eponymous main character, a young girl that wants nothing more than to live a normal life. This ambition proves challenging as she lives in Ogikubo, a futuristic metropolis inhabited by both humans and aliens. One normal day, as she and her father are eating breakfast, the latter consumes a pill that freezes him completely, leading Luluco to seek assistance at her father’s work, the Space Patrol. As a way to pay for the seemingly expensive defrosting process, the Over Justice Director-General conscripts Luluco into the Space Patrol so that she may help fight space crime at the local middle school. Later accompanied by comrades Alpha Omega Nova and Midori, Luluco sets off to fight for justice and ultimately free her dad so that she may secure stability in her otherwise hectic life.\\n\\n\r\nThough it’s mostly a silly plot with little thematic merit outside of Trigger’s patented madness, there’s still some narratives that help provide some substance to an otherwise “just-for-fun” series. The strive for normalcy in abnormal circumstances and the consequences and ambiguity of one’s “first love” dominate much of Luluco’s path throughout the series. At only seven minutes per episode and thirteen episodes in total, Space Patrol Luluco is a very short series, and it’s hard to tell much of a thought provoking story in that time. With that in mind, it effectively told its intended story while presenting us with enough extra content to leave us satisfied after its conclusion.\\n\\n\r\nGenre & Characteristics\\n\\n\r\nWhile there is an original story at play within Space Patrol Luluco, much of the series revolves around references to other Trigger series, such as Kill la Kill, Little Witch Academia, and Inferno Cop. Some characters from the aforementioned make even make cameos throughout the series, interacting with Luluco on her quest to achieve normality. It’s hard to experience the full effect of the anime without having seen many of these series, so it’s advisable to complete a few of them first before watching this series. At times, you might find yourself lost or not getting what’s being presented to you, which could possibly dissuade you from continuing further. With a knowledge of Trigger’s compendium, however, you’ll notice how Space Patrol Luluco plays off a lot of the tropes and cliches set forth through their other series. It’s definitely enjoyable to see, and you’ll find yourself guessing what next they’re going to satirize.\\n\\n\r\nThere are also elements of space and science-fiction that help bind the universe together. As the series is largely focused on the characters, references, and plot, these elements are more or less utilized by the plot rather than representative of the story. Nothing really makes sense, and I think that’s the way it’s supposed to be. Abductions of entire cities, beings comprised of black holes, and combative suits that transform you into firearms generally aren’t grounded in much logic, no?\\n\\n\r\nAnimation\\n\\n\r\nYou’re watching a Trigger animation. Honestly, that’s the best way to describe the erratic, one-of-a-kind aesthetics you’d come to expect from a Trigger series. Between the bright colors, rapidly animated bodies, and personalized facial expressions, you either love it or you hate it, and there’s very few who lie in-between. I am a fan of the style, however, and found the series’ animation to fit the universe it’s depicting perfectly.\\n\\n\r\nSound\\n\\n\r\nWhile the soundtrack was likely the least memorable part of the series, it’s not to be discredited. There’s a heavy bubble-pop and techno influence, aptly representative and respectful of the setting and protagonists, so fans of such music will enjoy what’s to come. I never found the music irritating or improperly utilized, so I say they did well in this area.\\n\\n\r\nFor the most part, I was pleased with the performances of the seiyuu, and only one voice (Keiji, Luluco’s father) really grated on me. Luluco and Nova’s voices personified their respective characters into believable roles, always a welcome trait any main character. A few of the seiyuu have previously participated in other Trigger titles, such as Midori’s (Nonon Jakuzure from Kill la Kill), Over Justice Director-General’s (Ira Gamagoori from Kill la Kill), and Inferno Cop’s (as Inferno Cop). I found their presence familiar and enjoyable, and it was nice to have a mix of both the new and old in such a series.\\n\\n\r\nSurprisingly enough, both the opening and ending for this series are fairly nice. I always enjoyed the energetic opening as a perfect introduction to the madness that was to come. The ending stands out quite a bit considering how chill of a finisher it is for an otherwise wacky experience.\\n\\n\r\nCharacters\\n\\n\r\nThe main characters of the series are three Space Patrol agents, Luluco, our charming and bright protagonist, Alpha Omega Nova, a handsome agent full of apathy, and Midori, rebellious youth and hands-down best girl. They are accompanied by a variety of secondary characters I found largely humorous, with many of them serving as caricatures of certain character archetypes or representations of previous Trigger characters (Lalaco w/ Ragyo Kiryuin of Kill la Kill, Over Justice Director-General w/ Inferno Cop, etc.) Respectively, they are not the deepest characters, save maybe for Luluco, but a good majority are loveable and will earn your attention as the series progresses. I’ve never come to understand the importance of “JUSTICE!” before experiencing the adventures of the Space Patrol.\\n\\n\r\nConclusion\\n\\n\r\nIt’s cute, it’s silly, and it’s great, though not without some issues. The bottom line is that you shouldn’t watch Space Patrol Luluco is you either don’t enjoy the Trigger style, aesthetic, or humor or are going in blind and unaware of it. If you fall into the latter category, watch a couple Trigger series first before diving into this short adventure. Space Patrol Luluco is for Trigger fans. It doesn’t stand very strongly on its own, but as a supplement to quite a bustling universe (dubbed affectionately as the Triggerverse by fans), it soars the skies.\\n\\n\r\n“It’s a miracle of justice. Justice is a miracle!” – Over Justice Director-General",
            "date": "2017-03-10T14:02:00+00:00",
            "helpful_count": 10,
            "mal_id": 242267,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5660253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Valenthyne",
                "username": "Valenthyne"
            },
            "url": "https://myanimelist.net/reviews.php?id=242267"
        },
        {
            "content": "Top tier garbage, the only reason I gave it a 2/10 instead of 1/10 is because it managed to make me laugh once or twice. It's just that those times it made me laugh, it was with jokes that were only funny once yet was re-used to the point where they were beating a dead horse with vigor and ferocity that would make one question whether that particular horse had previously murdered all their friends and family in front of them.\r\nIt's a show with half-arsed jokes made with no thoughts, everything they thought of went into the show. Rather than comedy, the only thing thisshould be doing well, it seems more focused on offering a wacky art style that isn't interesting or good in any way. Well, one can see what to expect from these people if you look at kill la kill, it's all about the art while the actual content is skimped on, however, at least kill la kill was a bit better than this and managed to be worthy of an average score (5/10).\\n\\n\r\nIt's just stupid, but not in a funny way. If I were 10-16 years old and hadn't experienced much manga, anime or novels, this would probably be a fair bit more enjoyable. Sadly, I nowadays expect at least some measures of quality and effort even for a nonsense comedy show. I love nonsense comedy, high-paced comedy, ridiculous comedy and stupidity when it's done right. However, this was just so badly done that I am almost amazed. There are no even remotely clever or good jokes except for the fact that they even made this garbage in the first place. It doesn't deserve to be placed amongst other comedy shows of similar nature. Seriously, I wonder if I've ever seen a show that has such minimal effort put into it before. Just putting in random nonsense doesn't make it good even if it's a comedy.\\n\\n\r\nSome people shouldn't write stories/shows at all, the people who wrote this is a great example of that. They also need to stop their focus on the art style and start to actually care more about the contents, right now it's kinda like those games with awesome graphics but horrible game mechanics, full of bugs and with a retarded story. Although I personally hate the \"graphics\" of these people, a lot of people seems to love it for some reason. The graphics was actually never a part of why I judge an anime and it wasn't part of the reason for my score. \\n\\n\r\nSo, I recommend you not to waste your time watching this. There's plenty out there to watch and if you don't have anything more to watch right now, just find some manga or novels, especially novels are endless, chinese, korean and japanese, there's so many and it never ends. Anything is better than watching this unless you're very young or love the art style to the point where nothing else matters.",
            "date": "2018-09-25T17:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 289993,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=289993"
        },
        {
            "content": "Space Patrol Luluco, it's a disorganized and chaotic mess. It's not to be taken seriously by no regards. Being a short anime of seven minutes run time, but lasting the equivalent of four to five minutes since the ending ost takes a majority of run time. It's a fun short nothing more than that.\r\nThe show premise is a unique one taking place in a future were humans live side by side with aliens. Luluco wants to be ordinary, in this by disorderly world were anything can and will happen and it does. It start us off with Luluco eating breakfast with her dad Keiji amember of Space Patrol, which is a future law enforcement. Anyhow, mistakenly he chows down a substance that freezes his body solid. Unmistakably, Luluco drop him causing him to break into multiples pieces. The only solution in getting him back into one piece is going to the Space Patrol but in mix ends up join the Space Patrol, thus beginning the crazy and wacky adventure. \\n\\n\r\nSpace Patrol get many members including Alpha Omega Nova, long name, I know. Instantly Luluco falls head over heels for him, due to his mysterious backstory and strong sense of justice. Not to long after his introduction they meet Midori an small criminal that when captured join Space Control just because of Alpha charming charisma. Afterwards, comes Lalaco Godspeed who other then Luluco mother that's been missing for sometime reveals herself as a antagonist.\\n\\n\r\nThe characters are nothing to depth at all. What you get from the is all there is to them, sure they'll have a crazy characteristic to advance the plot forward. It's a fun premise with nice cartoon animation which has the closest resemblance to Panty and Stocking. It really shows that at times, the clunky non-moving characters designs which get dragged along the screen. At times it can even look so amazing with mind-blowing gorgeous scenes and action packed scenes. The music wasn't something that stuck out to per-say in my opinion beside ending ost which had an great ending sequence.\\n\\n\r\nEven so it's a wacky anime with balls to the wall adventure, randomness and explosives always happening. Always pulling something from out nowhere, causing  the stakes to be an all-time high. Furthermore it has tributes to other of Studio Trigger other works if your able to identify. Lots of parallel and universe jumping seeing many characters from our many loved anime, Kill La Kill and Little Witch Academia . If that sounds like something like, you'll be in for a ride.",
            "date": "2017-01-14T14:44:00+00:00",
            "helpful_count": 7,
            "mal_id": 238297,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3061047.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hedgie",
                "username": "Hedgie"
            },
            "url": "https://myanimelist.net/reviews.php?id=238297"
        },
        {
            "content": "Welp, didn't think I'd write a review for this \"show\", of all the things i could write about.\r\nwoaaah, even hitting the lower limit for characters is a drag... Sigh... well, might as well get this out of the way, and i'll fill the limit later on:\r\nTHIS IS TRIGGER COMMERCIAL. 13 segments of shameless auto-promotion using sparkly, simple animations. huh? \"unconventional and original plot progression\"? try \"no plot, and a lot of crossovers with other triggers works\". Original content is wrapped up in the first 2 episodes, than it's all \"he-heeeey! that from kill-la-kill\" and \"oooh, that's inferno cop!\" and so on. \r\nI mean, fuck, theyeven call MC Trigger-chan at the end, it's a fucking studio mascot.\\n\r\nThere's nothing wrong with auto-promotion, it's just sad seeing you all going crazy over what a masterpiece this is when it's nothing more than a commercial in a shiny wrapping. \\n\r\nI just wonder what you guys see with those eyes of yours that you elevate this show so much.\\n\\n\r\nAnd yeah, as I said. It's a commercial. No watching value, no rewatching value, no nothing. Cool as a collectible for trigger fans, i guess, but that's about as useful as it gets.",
            "date": "2017-01-28T17:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 239354,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1472429.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/XanWasting",
                "username": "XanWasting"
            },
            "url": "https://myanimelist.net/reviews.php?id=239354"
        },
        {
            "content": "I will neither say it's underrated nor overrated. But i enjoyed it so much. I don't know how to describe my feeling from it. Haven't seen pure soul, pure mind, pure love like this for a little while.\r\nLuluco must be protected at all cost! I liked her character so much. I want to be like her. She does everything carelessly, doesn't know what rudeness is. Such an innocent girl. \r\nIn addition, ending song and its video were extremely chilling & aesthetic. \r\nIf you liked Kill la Kill, you would probably like this one too. Some stuffs are lame, but overall is good.",
            "date": "2018-05-10T06:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 280196,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7245263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bendey",
                "username": "Bendey"
            },
            "url": "https://myanimelist.net/reviews.php?id=280196"
        },
        {
            "content": "I cried. OK yeah the title might put you off, might make you think, oh it's like one of those magic girl shabbadibidoodah anime but like seriously. Don't underestimate this anime.\r\nDuring this review, I will try to make it nice and easy to understand/snappy-n-short and SPOILER-FREE so whenever I say \"plot\" it's just something I don't want to spoil.\r\nSo this anime is 7 mins long which is long enough to have a little plot and at first you're gonna be like cool. This has the humour, the arts really really rEALLY FLASHy and you enjoy it. And then the last two episodes come along and...whoopsyou're crying. \\n\\n\r\nIf I was to say anything about my thoughts on this anime, in a couple of words I'd say \"it was really cute and funny and made me cry\" but lol no I'm reviewing this properly and thats not enough to be a good review so I will say...that the way the \"plot\" moved was actually really fast, but seeing the \"plot\" change this way makes you feel like parents watching their children grow. (Not-that-I-have-any-children,-I-just-have parents-who-when-they-want-to-make-conversation-with you-or-others-always-go-back-to-the-same-story.) so you could really see how things progressed.\\n\\n\r\nThis story is about a girl who lives in a mixed up place where both humans and aliens live together. She doesn't really like the town and she just wants to be \"normal\". One day, her father gets in a hard situation, she ends up being dragged into part of the Space Patrol (like the police) to arrest people at her school who goes against justice within school. But the Space Patrol suit that automatically changes when it detects someone going against justice isn't making her live her desired norm life. But that's what makes the show funny so it's cool. She meets *other* beings and lots happen again I don't wanna spoil but I can say that even though the whole series is about an hour an a half long altogether, it was better than ANY OTHER short anime I have EVER seen (btw I'm still on the quest to conquer/watch all the short anime and fine the best and this is by far the best) and can rival a lot of anime.\\n\\n\r\nThank you for taking your time to read this if you did:)\\n\\n\r\nI hope you do enjoy the anime like I did!",
            "date": "2016-12-31T11:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 237100,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337786.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/nArUtOaSt",
                "username": "nArUtOaSt"
            },
            "url": "https://myanimelist.net/reviews.php?id=237100"
        },
        {
            "content": "A series from Studio Trigger and directed by Hiroyuki Imaishi, Space Patrol Luluco is kind of what you would expect: being over-the-top fun. \r\n13-year old Luluco lives in a town where humans and aliens live together. Her father accidentally freezes himself, which brings her in contact with the Space Patrol, who recruits her with little explanation needed. Now she has to deal with all the unfolding crazy hijinks. Although the 13 episodes are only 7 to 8 minutes in length, there is an overarching story tying everything together, with the Space Patrol crew going on an adventure, running into all kinds of things. Usually, thesethings are quite unrealistic, but this is the kind of story where it doesn’t need to be very believable. Besides, the ridiculousness can result in some pretty funny moments, whether it’s some piece of dialogue or goofy visuals. It’s style over substance, and it’s fun, while substance that’s there contains both emotion and heart. I’ll try not to give away spoilers, but near the end the emotion in the story has grown big. \\n\\n\r\nIf you know any of Trigger's previous work, you'll probably notice the heavy references, that result in crossovers and borderline parodies, existing in some episodes from the second half. This is handled pretty well, because while it's fan-service for those who enjoyed Kill la Kill, Little Witch Academia, and/or Inferno Cop, it also serves to progress the story. \\n\\n\r\nAs for the characters, they are zany and entertaining. Main character Luluco is the most normal one, trying to deal with the absurdity of the world she lives in. She makes for a decent protagonist because of this. Personally I also found her kind of adorable. Then there is her love interest Alpha Omega Nova, a calm, handsome but apathetic boy, who is not responding to her feelings. Although her love for him came across as a bit weak sometimes, it develops into something stronger as the show progresses. However, I think the initial weakness was due to the over-the-top nature of the show, and that it was meant to be a little funny. \\n\\n\r\nFurthermore, there is the cynical Midori, who simply works well in the cast. More noticeably is Chief General Over Justice, obviously inspired by Inferno Cop, who has an extreme sense of Justice, hilariously spouting the word \"JUSTICE\" every few lines, and who always, I mean ALWAYS, has his fingers pointed up like a gun. On top of that, he has a design that’s comically flat like cardboard. He’s easily one of the funniest characters.\\n\\n\r\nMultiple villains appear, but I will talk about the most recurring one: Lalaco Godspeed, or Space Pirate Empress, who is a space pirate, and Luluco’s mom. She is mostly a foil for the characters and story, but her having a devilish personality and being the MC’s mother brings a little more to it than that. Also, I can’t forget to mention that I have a love-hate relationship with her design. It’s ridiculously sexual, basically showing her near-naked aside from her large coat. Seriously, she barely even wears underwear, while her breasts are like balloons with little cloths under them, and those tits are so big that when she is looking down on others, they cannot really see her face, and she cannot really see them. I wonder what made her think to wear this costume. However, the absurdity of her design actually seems to fit in the context of this show. \\n\\n\r\nAs I said before, Space Patrol Luluco is over-the-top and absurd, which can especially be seen in its hyper-active, fun and stylish animation. If I had to compare it to something else, I would say Kill la Kill. The bright-colour art is simple but effective, the action looks cool and exciting and the wacky visual jokes are well-executed. \\n\\n\r\nThe soundtrack is not particularly memorable, which can also be said about the yet decent OP, while the ED has a more memorable soft tone and interestingly cute aesthetic. Soundtracks from previous Trigger-works like Kill la Kill and Little Witch Academia are used effectively when making references. \\n\\n\r\nFor the negatives of this show, it isn’t exactly the best or in any way a masterpiece. It mostly just comes down to your tastes. If you don’t like anime that are over-the-top and ridiculous, or studio Trigger in general, then you would better skip this one. Otherwise, not much to worry about, but don’t go in with really high expectations. \\n\\n\r\nIn the end, I had a blast with this series. It delivers a lot of coloured fun, and in the end I have to admit I felt the strong emotion behind it. Unfortunately I can’t really expand on that because I don’t want to talk about spoilers. Furthermore, the shortness of the episodes makes it easy to binge-watch. I’ll recommend this one, and if you enjoyed any of Trigger’s or Imaishi’s shows, then I’ll strongly recommend it. \\n",
            "date": "2018-01-12T09:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 268304,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6527508.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/maartens31",
                "username": "maartens31"
            },
            "url": "https://myanimelist.net/reviews.php?id=268304"
        },
        {
            "content": "\"One of mankind's greatest gifts... are internal jokes, cameos and references.\" ~ Jesus Christ\r\nJesus Christ. You're right, man.\r\nTengen Toppa meets Kill la Kill meets stupidity.\r\nIf you didn't watch Tengen Toppa nor Kill la Kill, this will lose at least 85% of the fun. If you didn't watch Little Witch Academia, this will lose one episode of fun.\r\nDon't take it seriously. This is a joke. This is a very, very stupid, nonsensical joke. Luluco is basically Trigger Studio goofing around, making a bunch of references and homages to the couple of their (modern) most acclaimed shows & sporadic references to their lesser popular stuff, like forinstance Inferno Cop. That's the entire objective of this anime.\\n\\n\r\nStory: there simply isn't. Sure, there is a \"plot\", but it's not serious, it's a joke. Not \"Kill la Kill\" level, even worst. However, the logic, plot devices, and several things are borrowed from TTGL. Which will either make you feel really pissed or put you on the edge of the seat, thinking, \"oh my GOD, THAT'S JUST LIKE TTGL!!!!\".\\n\\n\r\nArt: Reminds me of Panty & Stocking but is less goofy and more leaning to regular \"animeness\". Everything is very colorful (just like Paint & Stocking), everything's absurdly dynamic (just like KLK) and there are static shots of dynamism and energy (just like TTGL). \\n\\n\r\nSound: really loud, my god\\n\\n\r\nCharacter: yes, the police chief is LITERALLY Tengen Toppa Gurren Lagann. Those ARE Kamina's glasses. No, this is not a spoiler.\\n\\n\r\nTry to guess who each character is supposed to be. \\n\\n\r\nEnjoyment & Overall: started out as \"duh goofy and stupid but lighthearted anime\". Ended up as \"PIERCE THE HEAVENS WITH JUSTICE!\".\\n\\n\r\nIf you liked TTGL or KLK watch this. It's gonna be funny, I promise.",
            "date": "2017-12-13T14:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 265143,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5906223.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Luqueasaur",
                "username": "Luqueasaur"
            },
            "url": "https://myanimelist.net/reviews.php?id=265143"
        },
        {
            "content": "This review is spolier-free...\r\nUchuu Patrol Luluco is a colorful, funny, crazy, and overall fun anime to watch. It only has 13 episodes, each being about 7-8 mins, so it is perfect to binge watch. If you liked other TRIGGER Animation animes like Kill la Kill, Gurren Lagann, and/or Little Witch Academia, then you will definitely like Uchuu Patrol Luluco. On the other hand, this anime may be not as enjoyable if you have not seen any TRIGGER Animation animes since you will not be able to understand the abundance of references made. Definitely watch this anime if you are a fan of TRIGGER Animation. Ifyou don't like TRIGGER (for whatever reason) then you can skip this anime.\\n\\n\r\nStory - 7 - A decent story, but it is a little bit disorganized.\\n\\n\r\nArt- 10 - The art colorful, vibrant, and eye-catching (as expected from TRIGGER).\\n\\n\r\nSound - 10 - The soundtrack is upbeat and fun (as expected from TRIGGER).\\n\\n\r\nCharacter- 9 - All the characters were compelling and lovable, but it is not 10/10 because some characters seem to not have developed much from beginning to end.\\n\\n\r\nEnjoyment- 10 - I like TRIGGER Animation, adventure, action, and the quirky personality of the main character. Can't ask for anything more.\\n\\n\r\nOverall- 9 - Great\\n\\n\\n\\n",
            "date": "2017-10-05T16:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 259795,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4663883.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Raymond_Fermin",
                "username": "Raymond_Fermin"
            },
            "url": "https://myanimelist.net/reviews.php?id=259795"
        },
        {
            "content": "trigger got me again.\r\ni love the story how it turned from school girl to space and all that but.\r\nTRIGGER STOP MAKING SOMETHING HAPPEN TO YOUR BLONDE CHARACTERS LIKE WTH. i will not say what that something is\r\nIn all seriousness this is my new favorite anime. It's a trigger animation so I already had high hopes. The colors and animation are fluid as ever and the irony is strong as ever. The characters really grab me and the unexpected always comes. Short but it really made me cry a lot. And the outro and music is just.. Omg.. I tear up when ever I hear it'sjust so pretty!! Trigger did a good job with this even with that wtf ending as usual.",
            "date": "2019-01-29T21:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 300362,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7005450.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TokkiSparten",
                "username": "TokkiSparten"
            },
            "url": "https://myanimelist.net/reviews.php?id=300362"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nSpace Patrol Luluco is essentially the culmination of all of Studio Triggers past works, but doesn't do any of them justice. It doesn't hit the mark of any past Studio Trigger works. But if your looking for a ridiculous comedy that is just fun for the sake of having fun, then you should definitely watch the show, even if your not a fan of the studio already.  If you are interested in more that I have to say, then click the link to my full discussion video on the series as a whole, which includes spoilers: \r\nTHIS VIDEO CONTAINS SPOILERS: https://www.youtube.com/watch?v=ErjkFEKFyog",
            "date": "2016-08-07T11:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 226147,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5074276.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pegeras",
                "username": "Pegeras"
            },
            "url": "https://myanimelist.net/reviews.php?id=226147"
        },
        {
            "content": "Capturing the attention of the audience is quite difficult when creating an animation short. There are a few things to consider such as an original concept, strong script, appealing characters, well executed comedy, and visual allure. Needless to say, Uchuu Patrol Luluco executes these concepts quite well. Furthermore, the repertoire of the creator, Hiroyuki Imaishi, has worked on a considerable amount of anime throughout his career that many anime fans may give him credit to where it’s due. From the person who has worked on titles such as “Kill la Kill”, “Tengen Toppa Gurren Lagann”, “Nihon Animator Mihonichi”, “FLCL”, “Neon Genesis Evangelion”, and “Panty &Stocking with Garterbelt”, Hiroyuki Imaishi presents a 7 minute animation short called “Uchuu Patrol Luluco” (also known as “Space Patrol Luluco”).\\n\\n\r\nThe story of Uchuu Patrol Luluco is quite simplistic. Uchuu Patrol Luluco is about a middle school girl, living in a co-existing planet with aliens, who wants to live a “normal” life. However, all of that changes after her dad, who is a part of the Space Patrol, is frozen solid after eating a dangerous capsule leaving Luluco to go to his office for help. Little did she know, her “normal” life is changed forever after the chief, Over Justice, makes her a part of the Space Patrol. With that being said, even though it’s straightforward, it’s not as predictable as viewers may thought of it to be – surprising viewers with awe-struck moments and intense animation. To describe the story in further detail, Uchuu Patrol Luluco is like sweet and sour sauce. Part of the anime is innocent and charming while the other half is intense and wild. The story combines these two elements making the overall show not too boring and overly exaggerated. By the end of each episode, the story will resolve, but also introduce something new, leaving viewers to anticipate what is to happen in the forth-coming episode.\\n\\n\r\nA small cast isn’t bad as long as the creators know how to utilize them correctly. Needless to say, Uchuu Patrol Luluco features a small cast of characters that have enough air time for the viewers to care about them. Each character plays a role that adds something towards the anime. Furthermore, the characters act their age when there is interaction between them and it is shown throughout the dialogue. For example, when one of the characters, Midori, goes on a rocket ship with Alpha Omega Nova to stop a massive meteorite from crashing into Ogikubo. Midori starts taunting Luluco by making her jealous, forcing her to go onboard with them. This creates a love triangle between the characters. However, it’s not affection what Midori is yearning for, it’s wanting what someone else wants. \\n\\n\r\nOne thing that should be noted is the unique art style that is done throughout this anime. The atmosphere consists of a cool color scheme that gives the anime an overall relaxing vibe. The artists has also intentionally used a warm color palette – in certain scenes – to make things stand out. \\n\r\nAnother thing that should be noted are the character designs. Some of the character designs resemble previous material that Imaishi has worked on such as such as “Nihon Animator Mihonichi”, “Kill la Kill”, “Inferno Cop”, and “Tengen Toppa Gurren Lagann”. It’s quite clear that these had some type of influence in the development of the show. Besides the influenced character designs, backgrounds of the show appear to be real life photos. With this in mind, it’s clear that Uchuu Patrol Luluco is set on a fixed budget. However, it’s not noticeable enough to break story immersion. \\n\\n\r\nThe opening intro track, “CRY Max Do-Heijitsu by Fujirokkyuu (Kari)”, is this energetic, wacky, and action packed song that fits this bizarre show. For those familiar with the artist, Teddyloid, fans may notice some of the tracks he has done such as “MEMEME!”, “D City Rock”, and “Fly Away” from “Panty & Stocking with Garterbelt”. Bonjour Suzuki, on the other hand, is an up and coming dream pop artist that has worked on a few new anime, but hasn’t done any major titles. With Teddyloid’s track composition and Bonjour Suzuki’s voice, the ending theme, “Pipo Password,” is this soft, melodic, upbeat song that fits with the tone of the show. \\n\\n\r\nTo reiterate, Uchuu Patrol Luluco strays away from being a run-of-the-mill short animation. Uchuu Patrol Luluco is this short, sweet, sincere, and action packed adventure of an anime that’s full of surprises. Ride along the – not so normal – journey of a “normal” middle schooler and witness the experiences she has as she is forced to become a part of the Space Patrol.",
            "date": "2016-06-27T21:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 222210,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4550811.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuJKP",
                "username": "OtakuJKP"
            },
            "url": "https://myanimelist.net/reviews.php?id=222210"
        },
        {
            "content": "This was an interesting one.\r\nWhen I first heard about this anime, it was when I read about a post about Trigger's new anime, this and Kiznaiver. What compelled me to watch Luluco beside it being made by the same studio as Kill La Kill one of my favorite anime but the art style and I'll tell you I wasn't disappointing.\r\nFirst off the story. The plot is all over the place. It's very random and has scenes that jump out at you. With a plot like that most anime would be hard to watch but somehow with Luluco it works. No matter how absurd the scenesare, there's always the show's main focus. Luluco just wants a normal life as a 13 year old middle school. But watching her in situations far from normal makes the randomness and nonsensical parts of the show work. It pulls us into her world in her shoes. not to mention all the awesome references to Trigger's previous works.\\n\\n\r\nThe art isn't anything special besides it reminding me of KLK. But with the way the show is setup, the art style doesn't have to be a masterpiece. In my opinion the art style is perfect for this type of anime. As for the sound, the voice acting is great. The voices of the characters are perfect. The voices really bring the characters to life and I enjoyed much of the dialogue between them. As for the music, I like the opening but it's not something that will stick with me as other openings too. the ending song is beautiful and light and the animation that goes with is fits the music perfectly.\\n\\n\r\nI love the characters. Luluco is a very likable character and relatable. There's always a time in our lives where we wish for things to be normal just as luluco does. Even the villains like Midori and Lalaco  are just as likable and have great character. The only character I had a problem with was Nova but after watching he's not as bad as I though he was.\\n\\n\r\nAs much as I did enjoy this anime, I didn't have a few problems with it. Like i said before, the plot is all over the place and it was a bit hard to keep track. There were lots of times I asked myself \"what the heck just happened\" but it's not a major issue.  I also wish the episodes were long. Being 8 minutes per episode it ends just a quickly as it begins. This also cases the fast pace of the show.\\n\\n\r\nOverall I'd recommend this to someone who likes weird and fast paced anime. It has comedy, romance and bit of action so I think it's pretty well rounded. Even though the series seems to not take itself seriously, it does have is serious moments and if you've watch KLK, inferno cop and other of Trigger's previous works, you'll enjoy this anime even more. If you can get pass the randomness, you should give it a go!",
            "date": "2016-06-24T12:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 221757,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5495074.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SynTheOtaku1",
                "username": "SynTheOtaku1"
            },
            "url": "https://myanimelist.net/reviews.php?id=221757"
        },
        {
            "content": "JUDGEMENT REVIEW MORPHING!!!\r\nSo what do you get when a Middle School girl named Luluco just wants to live a normal life, but finds herself living in a city full of aliens and drafted into the Space Patrol? Well, you get Space Patrol Luluco. \r\nThe first thing that needs to be said about the story and the show in general, is that it's INCREDIBLY short. Each episode runs about 7.5min long and that's INCLUDING the OP and ED...so you will burn through 13 episodes very very fast. The story is meant to be just like the speed of the anime, fast paced, exciting, and sort ofconfusing. The show reminds me of the Nickelodeon cartoons from way back in the day, like Ren and Stimpy, that had many random and wacky plot twists around a central purpose that is usually pretty flimsy on its own. It is what it is and it can lack consistency, but this is really meant to be comical and fast-paced, so taking this too seriously is a mistake. Despite its random nature, it still deserves the 8 that it gets for its originality. \\n\\n\r\nThe artwork is standard-fare anime style, but that's only if you're paying attention to the foreground alone. The backgrounds and other artwork are pretty intense, and you can tell THAT'S where the lion's share of effort went into. A lot of the ships and cityscapes are really well done, so you have to pay attention in this fast-paced anime or you could miss it. A lot of the action shots will have great effects and artwork on them as well, but again you have to stay on it to catch a lot of this. Because of that fact, it falls short of being a 9. \\n\\n\r\nOn sound, the theme song was pretty catchy and got you in the mood for the show. The voice acting seemed good and suited the characters. Not much else you can say about it, it was good but nothing I'd call groundbreaking. \\n\\n\r\nThe characters were really hard to get a feel for because of the fast pace of the show. You felt like you were just getting to know Luluco and the show was over. The more outrageous the characters, the better you understood them. The Chief was AWESOME and Midori was pretty cool as well. Nova was rather bleh, but the ending makes sense and explains why he's that way. Luluco was cute as could be, you can't help but love her and her lame middle school lovey dovey obsession. \\n\\n\r\nThis was a very enjoyable anime, but the lack of slower pacing made it seem like it was over too quick and didn't make much of an impact compared to other anime. Don't let that keep you from watching it though! It was a genuinely good anime and I wish there was just MORE of it. I get that it enables Studio Trigger to put more into the artwork when the show is not so long, but at the same time it felt like a series of cartoons they play between shows on other networks. You could sit down and blaze through this whole series in one sitting, EASILY. Redeeming factor is, you'll have fun doing it :)\\n\\n\\n\r\nI'd check it out if you like fast-paced anime and something with cute humor to it. I think a few swigs of Mountain Dew or Redbull are in order beforehand though, you may blink and miss half the episode ;-)",
            "date": "2017-05-15T21:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 247782,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5731480.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Plucky-San",
                "username": "Plucky-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=247782"
        }
    ],
    [
        {
            "content": "Made by Studio Trigger who were famously behind Kill la Kill, comes another piece of work as absurd as the former. To sum it up, Uchuu Patrol Luluco is like opening a box full of colorful chocolates which would burst open once put in the mouth. \r\nOgikubo is a fictional place set far in the future time where aliens and humans and come terms with each other and live together. Uchuu Patrol Luluco follows Luluco, a seemingly normal teenage human girl who seeks a normal lifestyle herself in this crazy city filled with mysterious creatures. But of course that isn't the case as Luluco isappointed as the newest member of the Uchuu/Space Patrol Agency, an organization fighting against crimes and serving justice in the world of Ogikubo! \\n\\n\r\nUchuu Patrol Luluco specializes in slapstick over-the-top humor and comedy with its cartoon-ish animation. It's flashy all the time and oozes extravagant visuals which is eye candy. \\n\\n\r\nThe music is as absurd as the anime itself. Techno-like soundtracks keep interchanging during the episodes which go hand in hand with the excessive and highly exaggerated dialogues. Among these attributes, the two very opposite opening and ending themes can be added as well. \"CRY MAX Do-Heijitsu\" by Fujirokyu (Kari) has some of the ridiculous vocals I've heard to date. The song changes lyrics as the show progresses as well. One heck of a composing that is. Standing to the exact opposite of that is the soothing \"Pipo Password\" by Teddyloid ft. Bonjour Suzuki. Amazing mixture of sensual vocals and a use of ambient tunes. It also has very good visuals to add to that. It turns out as my favorite ending song of the season and it shouldn't come as a surprise to who've heard it as well. \\n\\n\r\nLuluco is the main character of the series. She's cute and has feelings for Nova, another member of the Space Patrol Agency accompanying Luluco. Luluco secretly loves him. He's calm, rational knows what he is doing. Nothing is shown as such that he has feelings responding to Luluco's feelings for him. Midori is the last one of the three members of the agency, she is caught as a criminal first but inadvertently becomes a member! The one who makes her the member is the chief of Space Patrol Agency, Over-Justice. His name implies his very exact characteristics. Someone who is hell bent on giving a little too much justice! There is an assistant of Over-Justice who never speaks during the show, so little is known about her. Lastly, Luluco's father Keijo and her mother Lalaco Godspeed. Her father is a veteran member of the agency and her mother is surprisingly a Space Pirate who re-unites with Luluco under extremely abnormal (Pun intended) circumstances. \\n\\n\r\nUchuu Patrol Luluco racks up points for the sheer enjoyment and laughs it gives off, even if there is literally nothing that keeps progressing as a storyline. Heck, between one of the episodes, they even mention that the script is still incomplete and they're doing it simultaneously as it airs. There's one thing that I never understood though; there's a tagline between every three episodes which implies that this thirteen-episode series in fact is divided between four seasons with a couple or three episodes each. That was something I never understood. Oh, that might be just Trigger being themselves. \\n\\n\r\nUchuu Patrol Luluco is best enjoyed when you've watched Kill la Kill, as it uses a lot of references from that show. In fact it also uses several other characters from shows done by Trigger. All in all, Uchuu Patrol Luluco is like a family gathering of Studio Trigger. It's just a shame that this is a short worth only seven minutes, but perhaps that is where it truly shines and achieves something a show with that duration rarely ever achieves.\\n",
            "date": "2016-06-24T10:17:00+00:00",
            "helpful_count": 133,
            "mal_id": 221743,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903513.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/karlstein12",
                "username": "karlstein12"
            },
            "url": "https://myanimelist.net/reviews.php?id=221743"
        },
        {
            "content": "\"And we realized that a reckless, ignorant middle schooler's foolish first love was the most worthless, trashy garbage in the universe.\" - Blackholeian.\r\nFunny. \r\nCrazy.\r\nUnapologetic.\r\nFresh.\r\nSavvy.\r\nNuanced.\r\nRidiculous.\r\nHow does one even begin to describe Luluco? I can give it many definitions, and yet it seems as though none of them can truly define it. There have been, and will be many synonyms for the word crazy used to attempt to encompass Luluco's uninhibited originality- insane, unhinged, verrückt, loco, おかしい (okashii), rabiosus, gek, mad, bonkers, nutso- it could go on forever, and still never truly capture the idea. \r\nOne could also call Luluco perhaps the best \"lore\" show ever made,transforming a disparate set of series and franchises into a single universe- a million, million worlds. (Move over, Carnival Phantasm!) \\n\r\nFor the Hiroyuki Imaishi fans, Luluco represents yet another of his unfettered, unrestricted creative explosions, bursting at the seams with referential details and a sense of wildness that he's become known for.\\n\r\nOthers still may think of Luluco as a breath of fresh air in the stale scape of the anime industry in the spring of 2016, bringing with it an \"air\" of lighthearted humor and silliness that also manages to be exquisitely captivating. \\n\\n\r\nHiroyuki Imaishi has done it again. What he can do in 7 short minutes with a seemingly nonsensical, three beers too many plot tops what a thousand other anime cannot touch in 13, 24, or 50 full episodes. Going way over the top, reaching ever higher beyond the walls of conventionalism- Luluco takes a leap for the mythical, and lands among the fantastical. If Luluco does one thing right- it's that it has a plot. It manages to weave in a tale of first, innocent love, coming of age narrative, a metric long ton of references, cameos, homage, and Great Justice into a cohesive story amid the chaotic presentation of the show. Truly impressive is the amount of content mashed into the all-too-brief runtime of Luluco- and it must be seen to be believed. \\n\\n\r\nFans of Imaishi and Trigger will find a lot to love about Space Patrol Luluco, as the show gives us fanservice in the best possible way- the original definition of fanservice. (For those who have forgotten and thinks that this is comprised entirely of vaguely underage girls exposing themselves- you're wrong. It's a practice as old as literature itself- with meta references to other works). Luluco is stuffed full of the aforementioned references and cameos from nearly Trigger's entire catalog, in addition to their penchant for making a boatload of references to other series. Trigger fans, start drooling now- because none of your favorites are excluded from this referencextravaganza, not even Sex and Violence with Machspeed. \\n\\n\r\nThe show itself has a rather quirky art style, rather westernized, like Panty and Stocking- though it also combines (or morphs into) the styles of the many anime that it borrows from, at will. With a pulsating, pounding soundtrack from Kenichiro Suehiro and the more well known TeddyLoid (Panty and Stocking OST), the music keeps up with the frenetic pace of the show well, and accentuates the highs as well as the lows. There is also a lot of sampling of tunes used in other Trigger shows- one of which reduced me to a screeching, blubbering moron upon hearing. (I'll not reveal which). \\n\r\nOnce again, Trigger's casting is near perfection- with some old and new faces alike. They even drug Mayumi Shintani (Haruko, FLCL- Nonon, KLK) out of retirement! \\n\\n\r\nIn closing- there's a lot to love about Luluco. (Yeah, I know I've said Luluco like 12 times in this review.) Let it be said though, that if you despise Trigger and all they've created- stay far away from this one, unless you're just a masochist- but then again, there's honestly no reason for anyone who's not a fan to watch this, as it's as I stated above- fanservice in its most pure form. Anyone who's found anything to like in a production of theirs up until this point in history will find something to like here. For those wanting a lighthearted, quick witted, frenetic tempo'd, universe sized explosion of a show- you've come to the right place. Prepare to be blown away. \\n\\n\r\nFOR GREAT JUSTICE!\\n",
            "date": "2016-06-24T10:39:00+00:00",
            "helpful_count": 118,
            "mal_id": 221749,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=221749"
        },
        {
            "content": "Space Patrol Luluco is incredibly flashy and weird (in a japanese fashion), yet somehow it feels uninteresting and average, almost boring.\r\nFrom its cute and immediate presentation to the almost hip-hop montage during its peak moments, I've never felt so disarmed by an anime: everything on the screen stays for about five seconds before dying, moving, or screaming. All goes faster, then slower - because there's a character we need to introduce, so here's the camera pan from the bottom to the top and a shiny sound effect - before going crazy again. All of this in seven minutes per episode, which, at one point, becomesunbearable.\\n\r\nIt's understandable that Trigger may have went for a crazy approach with the series: \"Luluco's a tame girl in a town. But there's aliens, so that changes everything, and it's funny!\", filling the market with some other content, some other merchandise, something meaningless on which people will talk and thrive on about. The introduction is average, the music is average, the characters are... there. They do stuff. They look pretty. Something weird happens. They look even prettier when they move, and that's all.\\n\r\nSpace Patrol Luluco is the fast food equivalent of anime: get a fix of quirky content, chew onto something, but not for the quality, just for sake of it.\\n\\n\r\nTrigger says \"style over substance\", I say it's time to stop.",
            "date": "2016-06-26T11:25:00+00:00",
            "helpful_count": 82,
            "mal_id": 222050,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5487221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ambaradan",
                "username": "Ambaradan"
            },
            "url": "https://myanimelist.net/reviews.php?id=222050"
        },
        {
            "content": "Space Patrol Luluco is essentially one giant fan service vehicle if you're a big fan of most of studio Trigger's works and it stands pretty well as its own thing too.\r\nThe story, like most of Trigger's works, is over the top, flashy and loud but instead, unlike Kill la Kill, this insanity is compressed into short seven minute episodes and is one of the best anime of this format I've seen in a while. The story revolves around our main character, Luluco, an ordinary girl in a not-so ordinary world filled with aliens and space travel and the such. While her father accidentally freezes himself,Luluco takes him to the space patrol station in which Inferno Cops' sensei (I'm not making this up, this is canon) called 'Over Justice' makes Luluco part of the team to stop crime.\\n\\n\r\nAs part of the space patrol, she can now turn her own body into a gun thus ruining her hopes of ever having a normal life. I'd go a little more in depth but I don't want to go into spoiler territory but surprisingly, the anime does have an over arching plot, which, because of the run time doesn't contain anything smart or thought provoking but because the anime is so much fun and the story is so over the top, it doesn't matter. You get the same kind of feeling of story telling as you do with shows such as Kill la kill, but only on a much smaller scale.\\n\\n\r\nThere are plenty of great action sequences with great character designs and action, it's easy to be entertained. Its art style reminds me a lot of the series 'Panty and stocking with Garterbelt' since at times it resembles more so a western cartoon than anime. The sound is great and the world feels vibrant, loud and colourful.\\n\\n\r\nThe characters are all fun, stupid and great to watch with Midori being the best girl and no shortage of funny moments between the characters. The anime also features a whole bunch of cross overs between different shows that Trigger has made, and if, like me, you like these shows then this is a massive treat.\\n\\n\r\nOverall, this show is stupid, fun and over the top. It has nothing in the way of deep symbolism or ground breaking story telling, but its very entertaining and one I would recommend watching. \\n\r\n(video version coming soon!)\\n",
            "date": "2016-06-24T12:58:00+00:00",
            "helpful_count": 57,
            "mal_id": 221763,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=221763"
        },
        {
            "content": "A short anime made with little effort deserves a short review written with little effort.\r\nThere exists a principle in economics called diminishing returns. It also applies to comedy and art. Remember Inferno Cop? Remember how funny and different it was? You first saw it and your jaw dropped. You just HAD to share it with friends. Then we got Ninja Slayer and it was the same fucking thing, but it was still funny. Much like Hangover 2 was still funny. Luluco is Inferno Cop 3 and while not as bad as Hangover 3, it's still pretty bad. I honestly found myself laughing very sparsely bythis point. They changed NOTHING and expect us to still keep laughing at the same joke. I'm sorry Mr. Imaishi, but this horse is dead. You killed it. It's time to stop beating it and move on to something else.",
            "date": "2018-09-02T20:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 287996,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=287996"
        },
        {
            "content": "Oh man, Trigger has done it again.\r\nWhat I loved best about space patrol Luluco is that at the moment Trigger seems like they have found what direction they want to go in. Magical girls, transformations, supernatural and comedy. Right now it is as if Trigger is sticking with their roots for this title. I love how they are still able to do whatever they want with their shows. They like being innovative with their titles, I respect that.\r\nThe story is really simple but is purposely made crazy because you know, trigger... gainax.. Uchuu Patrol Luluco follows the life of Luluco, a.. you know what, youcan actually get this information from the reading the description of the show.. anywho, I liked the story. I thought it was pretty interesting in all honesty. Before I get into it I'd like to say that I don't think Luluco is the best thing to come out of Trigger however it definitely had the potential to be something greater. Because the show was about 6-7 minutes 6 minutes of actual story lots of the plot for episodes and other related details are rush to the point where it sort of felt displeasing. I did find the whole \"Seasons\" thing unique. I think it was actually a smart idea to have them make like 3 episodes, end of season 1, 3 episodes end of season 2 etc because Luluco's not getting a \"Real\" second season simply because the show only has Thirteen episodes. Maybe net animations, hell maybe even an OVA here or there however with the presentation of the story and the rush, I don't see this series a long term thing.\\n\\n\r\nArt was choppy & sloppy, yet creative. Character designs were unique, however they lacked a certain charm to them. This isn't a bad thing however simply because the characters seemed as if they were designed to fit their characters personalities. Luluco for example is an ordinary girl, so she's a little plain in terms of designs however, she's given a cute little perks in her personality to make up for what she lacks in design or appeal. With animation however, I simply was not too impressed with the work Triggs put into the show. \\n\\n\r\nPipo Password was perhaps the best song composed for the entire soundtrack. It was beautiful, and really fit the theme for the series.  Bonjour Suzuki's vocals, her voice was so soft and soothing, and really complemented the beat produced by Teddyloid, who has done lots of work on shows for NAX before.. like  P&S with G-Belt. The voice actors were pretty good delivering both serious and non-serious lines.  The actors did an amazing job with adding speed & energy with lines that required it. I beleieve that is a reqiurement when auditions for a role for characters in a Studio Trigger title... but then again I probably just made that up.. do I suck or what? :)\\n\\n\r\nCharacters are as bizarre, odd, and  insane.. Like any other trigger or Gainax title. They had energy, and I like that. Character developments were pretty strange, espeically when it came to Gun Morphing however it was still funny too watch. If there was any real reason to watch this series I'd say it's to see what becomes of the characters later in the series. \\n\\n\r\nOverall I was impressed with what the team came up with because again, I do feel like Trigger has the talent to make really interesting shows with more than unique and bizarre stories and characters. Following the life of the adorable Luluco as she tries to save her Papa and find true love was certainly something I did enjoy re-watching. I gave the show a 7/10 simply because it wasn't too good nor was it awful. It's like right in the middle. \\n\\n",
            "date": "2016-08-12T12:43:00+00:00",
            "helpful_count": 16,
            "mal_id": 226576,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=226576"
        },
        {
            "content": "As a short, thirteen-episode series, Space Patrol Luluco redefines what it means to be “fan service” by existing as a vibrant amalgamation of Trigger’s expansive catalog of series, all centered around a middle-schooler seeking normalcy in an unlikely place.\r\nWill you like it?\r\nYou may enjoy Space Patrol Luluco if you…\r\n-- consider yourself a fan of the animation studio Trigger\r\n-- enjoy content that focuses on referencing other content\r\n-- seek a short, casual series that doesn’t take itself seriously\r\nYou may not enjoy Space Patrol Luluco if you…\r\n-- don’t have a taste for off-the-wall types of series\r\n-- largely dislike repetition within episodes\r\n-- expect a high volume of maturity\r\nStory\r\nSpace PatrolLuluco concerns itself with the eponymous main character, a young girl that wants nothing more than to live a normal life. This ambition proves challenging as she lives in Ogikubo, a futuristic metropolis inhabited by both humans and aliens. One normal day, as she and her father are eating breakfast, the latter consumes a pill that freezes him completely, leading Luluco to seek assistance at her father’s work, the Space Patrol. As a way to pay for the seemingly expensive defrosting process, the Over Justice Director-General conscripts Luluco into the Space Patrol so that she may help fight space crime at the local middle school. Later accompanied by comrades Alpha Omega Nova and Midori, Luluco sets off to fight for justice and ultimately free her dad so that she may secure stability in her otherwise hectic life.\\n\\n\r\nThough it’s mostly a silly plot with little thematic merit outside of Trigger’s patented madness, there’s still some narratives that help provide some substance to an otherwise “just-for-fun” series. The strive for normalcy in abnormal circumstances and the consequences and ambiguity of one’s “first love” dominate much of Luluco’s path throughout the series. At only seven minutes per episode and thirteen episodes in total, Space Patrol Luluco is a very short series, and it’s hard to tell much of a thought provoking story in that time. With that in mind, it effectively told its intended story while presenting us with enough extra content to leave us satisfied after its conclusion.\\n\\n\r\nGenre & Characteristics\\n\\n\r\nWhile there is an original story at play within Space Patrol Luluco, much of the series revolves around references to other Trigger series, such as Kill la Kill, Little Witch Academia, and Inferno Cop. Some characters from the aforementioned make even make cameos throughout the series, interacting with Luluco on her quest to achieve normality. It’s hard to experience the full effect of the anime without having seen many of these series, so it’s advisable to complete a few of them first before watching this series. At times, you might find yourself lost or not getting what’s being presented to you, which could possibly dissuade you from continuing further. With a knowledge of Trigger’s compendium, however, you’ll notice how Space Patrol Luluco plays off a lot of the tropes and cliches set forth through their other series. It’s definitely enjoyable to see, and you’ll find yourself guessing what next they’re going to satirize.\\n\\n\r\nThere are also elements of space and science-fiction that help bind the universe together. As the series is largely focused on the characters, references, and plot, these elements are more or less utilized by the plot rather than representative of the story. Nothing really makes sense, and I think that’s the way it’s supposed to be. Abductions of entire cities, beings comprised of black holes, and combative suits that transform you into firearms generally aren’t grounded in much logic, no?\\n\\n\r\nAnimation\\n\\n\r\nYou’re watching a Trigger animation. Honestly, that’s the best way to describe the erratic, one-of-a-kind aesthetics you’d come to expect from a Trigger series. Between the bright colors, rapidly animated bodies, and personalized facial expressions, you either love it or you hate it, and there’s very few who lie in-between. I am a fan of the style, however, and found the series’ animation to fit the universe it’s depicting perfectly.\\n\\n\r\nSound\\n\\n\r\nWhile the soundtrack was likely the least memorable part of the series, it’s not to be discredited. There’s a heavy bubble-pop and techno influence, aptly representative and respectful of the setting and protagonists, so fans of such music will enjoy what’s to come. I never found the music irritating or improperly utilized, so I say they did well in this area.\\n\\n\r\nFor the most part, I was pleased with the performances of the seiyuu, and only one voice (Keiji, Luluco’s father) really grated on me. Luluco and Nova’s voices personified their respective characters into believable roles, always a welcome trait any main character. A few of the seiyuu have previously participated in other Trigger titles, such as Midori’s (Nonon Jakuzure from Kill la Kill), Over Justice Director-General’s (Ira Gamagoori from Kill la Kill), and Inferno Cop’s (as Inferno Cop). I found their presence familiar and enjoyable, and it was nice to have a mix of both the new and old in such a series.\\n\\n\r\nSurprisingly enough, both the opening and ending for this series are fairly nice. I always enjoyed the energetic opening as a perfect introduction to the madness that was to come. The ending stands out quite a bit considering how chill of a finisher it is for an otherwise wacky experience.\\n\\n\r\nCharacters\\n\\n\r\nThe main characters of the series are three Space Patrol agents, Luluco, our charming and bright protagonist, Alpha Omega Nova, a handsome agent full of apathy, and Midori, rebellious youth and hands-down best girl. They are accompanied by a variety of secondary characters I found largely humorous, with many of them serving as caricatures of certain character archetypes or representations of previous Trigger characters (Lalaco w/ Ragyo Kiryuin of Kill la Kill, Over Justice Director-General w/ Inferno Cop, etc.) Respectively, they are not the deepest characters, save maybe for Luluco, but a good majority are loveable and will earn your attention as the series progresses. I’ve never come to understand the importance of “JUSTICE!” before experiencing the adventures of the Space Patrol.\\n\\n\r\nConclusion\\n\\n\r\nIt’s cute, it’s silly, and it’s great, though not without some issues. The bottom line is that you shouldn’t watch Space Patrol Luluco is you either don’t enjoy the Trigger style, aesthetic, or humor or are going in blind and unaware of it. If you fall into the latter category, watch a couple Trigger series first before diving into this short adventure. Space Patrol Luluco is for Trigger fans. It doesn’t stand very strongly on its own, but as a supplement to quite a bustling universe (dubbed affectionately as the Triggerverse by fans), it soars the skies.\\n\\n\r\n“It’s a miracle of justice. Justice is a miracle!” – Over Justice Director-General",
            "date": "2017-03-10T14:02:00+00:00",
            "helpful_count": 10,
            "mal_id": 242267,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5660253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Valenthyne",
                "username": "Valenthyne"
            },
            "url": "https://myanimelist.net/reviews.php?id=242267"
        },
        {
            "content": "Top tier garbage, the only reason I gave it a 2/10 instead of 1/10 is because it managed to make me laugh once or twice. It's just that those times it made me laugh, it was with jokes that were only funny once yet was re-used to the point where they were beating a dead horse with vigor and ferocity that would make one question whether that particular horse had previously murdered all their friends and family in front of them.\r\nIt's a show with half-arsed jokes made with no thoughts, everything they thought of went into the show. Rather than comedy, the only thing thisshould be doing well, it seems more focused on offering a wacky art style that isn't interesting or good in any way. Well, one can see what to expect from these people if you look at kill la kill, it's all about the art while the actual content is skimped on, however, at least kill la kill was a bit better than this and managed to be worthy of an average score (5/10).\\n\\n\r\nIt's just stupid, but not in a funny way. If I were 10-16 years old and hadn't experienced much manga, anime or novels, this would probably be a fair bit more enjoyable. Sadly, I nowadays expect at least some measures of quality and effort even for a nonsense comedy show. I love nonsense comedy, high-paced comedy, ridiculous comedy and stupidity when it's done right. However, this was just so badly done that I am almost amazed. There are no even remotely clever or good jokes except for the fact that they even made this garbage in the first place. It doesn't deserve to be placed amongst other comedy shows of similar nature. Seriously, I wonder if I've ever seen a show that has such minimal effort put into it before. Just putting in random nonsense doesn't make it good even if it's a comedy.\\n\\n\r\nSome people shouldn't write stories/shows at all, the people who wrote this is a great example of that. They also need to stop their focus on the art style and start to actually care more about the contents, right now it's kinda like those games with awesome graphics but horrible game mechanics, full of bugs and with a retarded story. Although I personally hate the \"graphics\" of these people, a lot of people seems to love it for some reason. The graphics was actually never a part of why I judge an anime and it wasn't part of the reason for my score. \\n\\n\r\nSo, I recommend you not to waste your time watching this. There's plenty out there to watch and if you don't have anything more to watch right now, just find some manga or novels, especially novels are endless, chinese, korean and japanese, there's so many and it never ends. Anything is better than watching this unless you're very young or love the art style to the point where nothing else matters.",
            "date": "2018-09-25T17:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 289993,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=289993"
        },
        {
            "content": "Space Patrol Luluco, it's a disorganized and chaotic mess. It's not to be taken seriously by no regards. Being a short anime of seven minutes run time, but lasting the equivalent of four to five minutes since the ending ost takes a majority of run time. It's a fun short nothing more than that.\r\nThe show premise is a unique one taking place in a future were humans live side by side with aliens. Luluco wants to be ordinary, in this by disorderly world were anything can and will happen and it does. It start us off with Luluco eating breakfast with her dad Keiji amember of Space Patrol, which is a future law enforcement. Anyhow, mistakenly he chows down a substance that freezes his body solid. Unmistakably, Luluco drop him causing him to break into multiples pieces. The only solution in getting him back into one piece is going to the Space Patrol but in mix ends up join the Space Patrol, thus beginning the crazy and wacky adventure. \\n\\n\r\nSpace Patrol get many members including Alpha Omega Nova, long name, I know. Instantly Luluco falls head over heels for him, due to his mysterious backstory and strong sense of justice. Not to long after his introduction they meet Midori an small criminal that when captured join Space Control just because of Alpha charming charisma. Afterwards, comes Lalaco Godspeed who other then Luluco mother that's been missing for sometime reveals herself as a antagonist.\\n\\n\r\nThe characters are nothing to depth at all. What you get from the is all there is to them, sure they'll have a crazy characteristic to advance the plot forward. It's a fun premise with nice cartoon animation which has the closest resemblance to Panty and Stocking. It really shows that at times, the clunky non-moving characters designs which get dragged along the screen. At times it can even look so amazing with mind-blowing gorgeous scenes and action packed scenes. The music wasn't something that stuck out to per-say in my opinion beside ending ost which had an great ending sequence.\\n\\n\r\nEven so it's a wacky anime with balls to the wall adventure, randomness and explosives always happening. Always pulling something from out nowhere, causing  the stakes to be an all-time high. Furthermore it has tributes to other of Studio Trigger other works if your able to identify. Lots of parallel and universe jumping seeing many characters from our many loved anime, Kill La Kill and Little Witch Academia . If that sounds like something like, you'll be in for a ride.",
            "date": "2017-01-14T14:44:00+00:00",
            "helpful_count": 7,
            "mal_id": 238297,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3061047.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hedgie",
                "username": "Hedgie"
            },
            "url": "https://myanimelist.net/reviews.php?id=238297"
        },
        {
            "content": "Welp, didn't think I'd write a review for this \"show\", of all the things i could write about.\r\nwoaaah, even hitting the lower limit for characters is a drag... Sigh... well, might as well get this out of the way, and i'll fill the limit later on:\r\nTHIS IS TRIGGER COMMERCIAL. 13 segments of shameless auto-promotion using sparkly, simple animations. huh? \"unconventional and original plot progression\"? try \"no plot, and a lot of crossovers with other triggers works\". Original content is wrapped up in the first 2 episodes, than it's all \"he-heeeey! that from kill-la-kill\" and \"oooh, that's inferno cop!\" and so on. \r\nI mean, fuck, theyeven call MC Trigger-chan at the end, it's a fucking studio mascot.\\n\r\nThere's nothing wrong with auto-promotion, it's just sad seeing you all going crazy over what a masterpiece this is when it's nothing more than a commercial in a shiny wrapping. \\n\r\nI just wonder what you guys see with those eyes of yours that you elevate this show so much.\\n\\n\r\nAnd yeah, as I said. It's a commercial. No watching value, no rewatching value, no nothing. Cool as a collectible for trigger fans, i guess, but that's about as useful as it gets.",
            "date": "2017-01-28T17:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 239354,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1472429.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/XanWasting",
                "username": "XanWasting"
            },
            "url": "https://myanimelist.net/reviews.php?id=239354"
        },
        {
            "content": "I will neither say it's underrated nor overrated. But i enjoyed it so much. I don't know how to describe my feeling from it. Haven't seen pure soul, pure mind, pure love like this for a little while.\r\nLuluco must be protected at all cost! I liked her character so much. I want to be like her. She does everything carelessly, doesn't know what rudeness is. Such an innocent girl. \r\nIn addition, ending song and its video were extremely chilling & aesthetic. \r\nIf you liked Kill la Kill, you would probably like this one too. Some stuffs are lame, but overall is good.",
            "date": "2018-05-10T06:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 280196,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7245263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bendey",
                "username": "Bendey"
            },
            "url": "https://myanimelist.net/reviews.php?id=280196"
        },
        {
            "content": "I cried. OK yeah the title might put you off, might make you think, oh it's like one of those magic girl shabbadibidoodah anime but like seriously. Don't underestimate this anime.\r\nDuring this review, I will try to make it nice and easy to understand/snappy-n-short and SPOILER-FREE so whenever I say \"plot\" it's just something I don't want to spoil.\r\nSo this anime is 7 mins long which is long enough to have a little plot and at first you're gonna be like cool. This has the humour, the arts really really rEALLY FLASHy and you enjoy it. And then the last two episodes come along and...whoopsyou're crying. \\n\\n\r\nIf I was to say anything about my thoughts on this anime, in a couple of words I'd say \"it was really cute and funny and made me cry\" but lol no I'm reviewing this properly and thats not enough to be a good review so I will say...that the way the \"plot\" moved was actually really fast, but seeing the \"plot\" change this way makes you feel like parents watching their children grow. (Not-that-I-have-any-children,-I-just-have parents-who-when-they-want-to-make-conversation-with you-or-others-always-go-back-to-the-same-story.) so you could really see how things progressed.\\n\\n\r\nThis story is about a girl who lives in a mixed up place where both humans and aliens live together. She doesn't really like the town and she just wants to be \"normal\". One day, her father gets in a hard situation, she ends up being dragged into part of the Space Patrol (like the police) to arrest people at her school who goes against justice within school. But the Space Patrol suit that automatically changes when it detects someone going against justice isn't making her live her desired norm life. But that's what makes the show funny so it's cool. She meets *other* beings and lots happen again I don't wanna spoil but I can say that even though the whole series is about an hour an a half long altogether, it was better than ANY OTHER short anime I have EVER seen (btw I'm still on the quest to conquer/watch all the short anime and fine the best and this is by far the best) and can rival a lot of anime.\\n\\n\r\nThank you for taking your time to read this if you did:)\\n\\n\r\nI hope you do enjoy the anime like I did!",
            "date": "2016-12-31T11:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 237100,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337786.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/nArUtOaSt",
                "username": "nArUtOaSt"
            },
            "url": "https://myanimelist.net/reviews.php?id=237100"
        },
        {
            "content": "A series from Studio Trigger and directed by Hiroyuki Imaishi, Space Patrol Luluco is kind of what you would expect: being over-the-top fun. \r\n13-year old Luluco lives in a town where humans and aliens live together. Her father accidentally freezes himself, which brings her in contact with the Space Patrol, who recruits her with little explanation needed. Now she has to deal with all the unfolding crazy hijinks. Although the 13 episodes are only 7 to 8 minutes in length, there is an overarching story tying everything together, with the Space Patrol crew going on an adventure, running into all kinds of things. Usually, thesethings are quite unrealistic, but this is the kind of story where it doesn’t need to be very believable. Besides, the ridiculousness can result in some pretty funny moments, whether it’s some piece of dialogue or goofy visuals. It’s style over substance, and it’s fun, while substance that’s there contains both emotion and heart. I’ll try not to give away spoilers, but near the end the emotion in the story has grown big. \\n\\n\r\nIf you know any of Trigger's previous work, you'll probably notice the heavy references, that result in crossovers and borderline parodies, existing in some episodes from the second half. This is handled pretty well, because while it's fan-service for those who enjoyed Kill la Kill, Little Witch Academia, and/or Inferno Cop, it also serves to progress the story. \\n\\n\r\nAs for the characters, they are zany and entertaining. Main character Luluco is the most normal one, trying to deal with the absurdity of the world she lives in. She makes for a decent protagonist because of this. Personally I also found her kind of adorable. Then there is her love interest Alpha Omega Nova, a calm, handsome but apathetic boy, who is not responding to her feelings. Although her love for him came across as a bit weak sometimes, it develops into something stronger as the show progresses. However, I think the initial weakness was due to the over-the-top nature of the show, and that it was meant to be a little funny. \\n\\n\r\nFurthermore, there is the cynical Midori, who simply works well in the cast. More noticeably is Chief General Over Justice, obviously inspired by Inferno Cop, who has an extreme sense of Justice, hilariously spouting the word \"JUSTICE\" every few lines, and who always, I mean ALWAYS, has his fingers pointed up like a gun. On top of that, he has a design that’s comically flat like cardboard. He’s easily one of the funniest characters.\\n\\n\r\nMultiple villains appear, but I will talk about the most recurring one: Lalaco Godspeed, or Space Pirate Empress, who is a space pirate, and Luluco’s mom. She is mostly a foil for the characters and story, but her having a devilish personality and being the MC’s mother brings a little more to it than that. Also, I can’t forget to mention that I have a love-hate relationship with her design. It’s ridiculously sexual, basically showing her near-naked aside from her large coat. Seriously, she barely even wears underwear, while her breasts are like balloons with little cloths under them, and those tits are so big that when she is looking down on others, they cannot really see her face, and she cannot really see them. I wonder what made her think to wear this costume. However, the absurdity of her design actually seems to fit in the context of this show. \\n\\n\r\nAs I said before, Space Patrol Luluco is over-the-top and absurd, which can especially be seen in its hyper-active, fun and stylish animation. If I had to compare it to something else, I would say Kill la Kill. The bright-colour art is simple but effective, the action looks cool and exciting and the wacky visual jokes are well-executed. \\n\\n\r\nThe soundtrack is not particularly memorable, which can also be said about the yet decent OP, while the ED has a more memorable soft tone and interestingly cute aesthetic. Soundtracks from previous Trigger-works like Kill la Kill and Little Witch Academia are used effectively when making references. \\n\\n\r\nFor the negatives of this show, it isn’t exactly the best or in any way a masterpiece. It mostly just comes down to your tastes. If you don’t like anime that are over-the-top and ridiculous, or studio Trigger in general, then you would better skip this one. Otherwise, not much to worry about, but don’t go in with really high expectations. \\n\\n\r\nIn the end, I had a blast with this series. It delivers a lot of coloured fun, and in the end I have to admit I felt the strong emotion behind it. Unfortunately I can’t really expand on that because I don’t want to talk about spoilers. Furthermore, the shortness of the episodes makes it easy to binge-watch. I’ll recommend this one, and if you enjoyed any of Trigger’s or Imaishi’s shows, then I’ll strongly recommend it. \\n",
            "date": "2018-01-12T09:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 268304,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6527508.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/maartens31",
                "username": "maartens31"
            },
            "url": "https://myanimelist.net/reviews.php?id=268304"
        },
        {
            "content": "\"One of mankind's greatest gifts... are internal jokes, cameos and references.\" ~ Jesus Christ\r\nJesus Christ. You're right, man.\r\nTengen Toppa meets Kill la Kill meets stupidity.\r\nIf you didn't watch Tengen Toppa nor Kill la Kill, this will lose at least 85% of the fun. If you didn't watch Little Witch Academia, this will lose one episode of fun.\r\nDon't take it seriously. This is a joke. This is a very, very stupid, nonsensical joke. Luluco is basically Trigger Studio goofing around, making a bunch of references and homages to the couple of their (modern) most acclaimed shows & sporadic references to their lesser popular stuff, like forinstance Inferno Cop. That's the entire objective of this anime.\\n\\n\r\nStory: there simply isn't. Sure, there is a \"plot\", but it's not serious, it's a joke. Not \"Kill la Kill\" level, even worst. However, the logic, plot devices, and several things are borrowed from TTGL. Which will either make you feel really pissed or put you on the edge of the seat, thinking, \"oh my GOD, THAT'S JUST LIKE TTGL!!!!\".\\n\\n\r\nArt: Reminds me of Panty & Stocking but is less goofy and more leaning to regular \"animeness\". Everything is very colorful (just like Paint & Stocking), everything's absurdly dynamic (just like KLK) and there are static shots of dynamism and energy (just like TTGL). \\n\\n\r\nSound: really loud, my god\\n\\n\r\nCharacter: yes, the police chief is LITERALLY Tengen Toppa Gurren Lagann. Those ARE Kamina's glasses. No, this is not a spoiler.\\n\\n\r\nTry to guess who each character is supposed to be. \\n\\n\r\nEnjoyment & Overall: started out as \"duh goofy and stupid but lighthearted anime\". Ended up as \"PIERCE THE HEAVENS WITH JUSTICE!\".\\n\\n\r\nIf you liked TTGL or KLK watch this. It's gonna be funny, I promise.",
            "date": "2017-12-13T14:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 265143,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5906223.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Luqueasaur",
                "username": "Luqueasaur"
            },
            "url": "https://myanimelist.net/reviews.php?id=265143"
        },
        {
            "content": "This review is spolier-free...\r\nUchuu Patrol Luluco is a colorful, funny, crazy, and overall fun anime to watch. It only has 13 episodes, each being about 7-8 mins, so it is perfect to binge watch. If you liked other TRIGGER Animation animes like Kill la Kill, Gurren Lagann, and/or Little Witch Academia, then you will definitely like Uchuu Patrol Luluco. On the other hand, this anime may be not as enjoyable if you have not seen any TRIGGER Animation animes since you will not be able to understand the abundance of references made. Definitely watch this anime if you are a fan of TRIGGER Animation. Ifyou don't like TRIGGER (for whatever reason) then you can skip this anime.\\n\\n\r\nStory - 7 - A decent story, but it is a little bit disorganized.\\n\\n\r\nArt- 10 - The art colorful, vibrant, and eye-catching (as expected from TRIGGER).\\n\\n\r\nSound - 10 - The soundtrack is upbeat and fun (as expected from TRIGGER).\\n\\n\r\nCharacter- 9 - All the characters were compelling and lovable, but it is not 10/10 because some characters seem to not have developed much from beginning to end.\\n\\n\r\nEnjoyment- 10 - I like TRIGGER Animation, adventure, action, and the quirky personality of the main character. Can't ask for anything more.\\n\\n\r\nOverall- 9 - Great\\n\\n\\n\\n",
            "date": "2017-10-05T16:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 259795,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4663883.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Raymond_Fermin",
                "username": "Raymond_Fermin"
            },
            "url": "https://myanimelist.net/reviews.php?id=259795"
        },
        {
            "content": "trigger got me again.\r\ni love the story how it turned from school girl to space and all that but.\r\nTRIGGER STOP MAKING SOMETHING HAPPEN TO YOUR BLONDE CHARACTERS LIKE WTH. i will not say what that something is\r\nIn all seriousness this is my new favorite anime. It's a trigger animation so I already had high hopes. The colors and animation are fluid as ever and the irony is strong as ever. The characters really grab me and the unexpected always comes. Short but it really made me cry a lot. And the outro and music is just.. Omg.. I tear up when ever I hear it'sjust so pretty!! Trigger did a good job with this even with that wtf ending as usual.",
            "date": "2019-01-29T21:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 300362,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7005450.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TokkiSparten",
                "username": "TokkiSparten"
            },
            "url": "https://myanimelist.net/reviews.php?id=300362"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nSpace Patrol Luluco is essentially the culmination of all of Studio Triggers past works, but doesn't do any of them justice. It doesn't hit the mark of any past Studio Trigger works. But if your looking for a ridiculous comedy that is just fun for the sake of having fun, then you should definitely watch the show, even if your not a fan of the studio already.  If you are interested in more that I have to say, then click the link to my full discussion video on the series as a whole, which includes spoilers: \r\nTHIS VIDEO CONTAINS SPOILERS: https://www.youtube.com/watch?v=ErjkFEKFyog",
            "date": "2016-08-07T11:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 226147,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5074276.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pegeras",
                "username": "Pegeras"
            },
            "url": "https://myanimelist.net/reviews.php?id=226147"
        },
        {
            "content": "Capturing the attention of the audience is quite difficult when creating an animation short. There are a few things to consider such as an original concept, strong script, appealing characters, well executed comedy, and visual allure. Needless to say, Uchuu Patrol Luluco executes these concepts quite well. Furthermore, the repertoire of the creator, Hiroyuki Imaishi, has worked on a considerable amount of anime throughout his career that many anime fans may give him credit to where it’s due. From the person who has worked on titles such as “Kill la Kill”, “Tengen Toppa Gurren Lagann”, “Nihon Animator Mihonichi”, “FLCL”, “Neon Genesis Evangelion”, and “Panty &Stocking with Garterbelt”, Hiroyuki Imaishi presents a 7 minute animation short called “Uchuu Patrol Luluco” (also known as “Space Patrol Luluco”).\\n\\n\r\nThe story of Uchuu Patrol Luluco is quite simplistic. Uchuu Patrol Luluco is about a middle school girl, living in a co-existing planet with aliens, who wants to live a “normal” life. However, all of that changes after her dad, who is a part of the Space Patrol, is frozen solid after eating a dangerous capsule leaving Luluco to go to his office for help. Little did she know, her “normal” life is changed forever after the chief, Over Justice, makes her a part of the Space Patrol. With that being said, even though it’s straightforward, it’s not as predictable as viewers may thought of it to be – surprising viewers with awe-struck moments and intense animation. To describe the story in further detail, Uchuu Patrol Luluco is like sweet and sour sauce. Part of the anime is innocent and charming while the other half is intense and wild. The story combines these two elements making the overall show not too boring and overly exaggerated. By the end of each episode, the story will resolve, but also introduce something new, leaving viewers to anticipate what is to happen in the forth-coming episode.\\n\\n\r\nA small cast isn’t bad as long as the creators know how to utilize them correctly. Needless to say, Uchuu Patrol Luluco features a small cast of characters that have enough air time for the viewers to care about them. Each character plays a role that adds something towards the anime. Furthermore, the characters act their age when there is interaction between them and it is shown throughout the dialogue. For example, when one of the characters, Midori, goes on a rocket ship with Alpha Omega Nova to stop a massive meteorite from crashing into Ogikubo. Midori starts taunting Luluco by making her jealous, forcing her to go onboard with them. This creates a love triangle between the characters. However, it’s not affection what Midori is yearning for, it’s wanting what someone else wants. \\n\\n\r\nOne thing that should be noted is the unique art style that is done throughout this anime. The atmosphere consists of a cool color scheme that gives the anime an overall relaxing vibe. The artists has also intentionally used a warm color palette – in certain scenes – to make things stand out. \\n\r\nAnother thing that should be noted are the character designs. Some of the character designs resemble previous material that Imaishi has worked on such as such as “Nihon Animator Mihonichi”, “Kill la Kill”, “Inferno Cop”, and “Tengen Toppa Gurren Lagann”. It’s quite clear that these had some type of influence in the development of the show. Besides the influenced character designs, backgrounds of the show appear to be real life photos. With this in mind, it’s clear that Uchuu Patrol Luluco is set on a fixed budget. However, it’s not noticeable enough to break story immersion. \\n\\n\r\nThe opening intro track, “CRY Max Do-Heijitsu by Fujirokkyuu (Kari)”, is this energetic, wacky, and action packed song that fits this bizarre show. For those familiar with the artist, Teddyloid, fans may notice some of the tracks he has done such as “MEMEME!”, “D City Rock”, and “Fly Away” from “Panty & Stocking with Garterbelt”. Bonjour Suzuki, on the other hand, is an up and coming dream pop artist that has worked on a few new anime, but hasn’t done any major titles. With Teddyloid’s track composition and Bonjour Suzuki’s voice, the ending theme, “Pipo Password,” is this soft, melodic, upbeat song that fits with the tone of the show. \\n\\n\r\nTo reiterate, Uchuu Patrol Luluco strays away from being a run-of-the-mill short animation. Uchuu Patrol Luluco is this short, sweet, sincere, and action packed adventure of an anime that’s full of surprises. Ride along the – not so normal – journey of a “normal” middle schooler and witness the experiences she has as she is forced to become a part of the Space Patrol.",
            "date": "2016-06-27T21:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 222210,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4550811.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuJKP",
                "username": "OtakuJKP"
            },
            "url": "https://myanimelist.net/reviews.php?id=222210"
        },
        {
            "content": "This was an interesting one.\r\nWhen I first heard about this anime, it was when I read about a post about Trigger's new anime, this and Kiznaiver. What compelled me to watch Luluco beside it being made by the same studio as Kill La Kill one of my favorite anime but the art style and I'll tell you I wasn't disappointing.\r\nFirst off the story. The plot is all over the place. It's very random and has scenes that jump out at you. With a plot like that most anime would be hard to watch but somehow with Luluco it works. No matter how absurd the scenesare, there's always the show's main focus. Luluco just wants a normal life as a 13 year old middle school. But watching her in situations far from normal makes the randomness and nonsensical parts of the show work. It pulls us into her world in her shoes. not to mention all the awesome references to Trigger's previous works.\\n\\n\r\nThe art isn't anything special besides it reminding me of KLK. But with the way the show is setup, the art style doesn't have to be a masterpiece. In my opinion the art style is perfect for this type of anime. As for the sound, the voice acting is great. The voices of the characters are perfect. The voices really bring the characters to life and I enjoyed much of the dialogue between them. As for the music, I like the opening but it's not something that will stick with me as other openings too. the ending song is beautiful and light and the animation that goes with is fits the music perfectly.\\n\\n\r\nI love the characters. Luluco is a very likable character and relatable. There's always a time in our lives where we wish for things to be normal just as luluco does. Even the villains like Midori and Lalaco  are just as likable and have great character. The only character I had a problem with was Nova but after watching he's not as bad as I though he was.\\n\\n\r\nAs much as I did enjoy this anime, I didn't have a few problems with it. Like i said before, the plot is all over the place and it was a bit hard to keep track. There were lots of times I asked myself \"what the heck just happened\" but it's not a major issue.  I also wish the episodes were long. Being 8 minutes per episode it ends just a quickly as it begins. This also cases the fast pace of the show.\\n\\n\r\nOverall I'd recommend this to someone who likes weird and fast paced anime. It has comedy, romance and bit of action so I think it's pretty well rounded. Even though the series seems to not take itself seriously, it does have is serious moments and if you've watch KLK, inferno cop and other of Trigger's previous works, you'll enjoy this anime even more. If you can get pass the randomness, you should give it a go!",
            "date": "2016-06-24T12:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 221757,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5495074.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SynTheOtaku1",
                "username": "SynTheOtaku1"
            },
            "url": "https://myanimelist.net/reviews.php?id=221757"
        },
        {
            "content": "JUDGEMENT REVIEW MORPHING!!!\r\nSo what do you get when a Middle School girl named Luluco just wants to live a normal life, but finds herself living in a city full of aliens and drafted into the Space Patrol? Well, you get Space Patrol Luluco. \r\nThe first thing that needs to be said about the story and the show in general, is that it's INCREDIBLY short. Each episode runs about 7.5min long and that's INCLUDING the OP and ED...so you will burn through 13 episodes very very fast. The story is meant to be just like the speed of the anime, fast paced, exciting, and sort ofconfusing. The show reminds me of the Nickelodeon cartoons from way back in the day, like Ren and Stimpy, that had many random and wacky plot twists around a central purpose that is usually pretty flimsy on its own. It is what it is and it can lack consistency, but this is really meant to be comical and fast-paced, so taking this too seriously is a mistake. Despite its random nature, it still deserves the 8 that it gets for its originality. \\n\\n\r\nThe artwork is standard-fare anime style, but that's only if you're paying attention to the foreground alone. The backgrounds and other artwork are pretty intense, and you can tell THAT'S where the lion's share of effort went into. A lot of the ships and cityscapes are really well done, so you have to pay attention in this fast-paced anime or you could miss it. A lot of the action shots will have great effects and artwork on them as well, but again you have to stay on it to catch a lot of this. Because of that fact, it falls short of being a 9. \\n\\n\r\nOn sound, the theme song was pretty catchy and got you in the mood for the show. The voice acting seemed good and suited the characters. Not much else you can say about it, it was good but nothing I'd call groundbreaking. \\n\\n\r\nThe characters were really hard to get a feel for because of the fast pace of the show. You felt like you were just getting to know Luluco and the show was over. The more outrageous the characters, the better you understood them. The Chief was AWESOME and Midori was pretty cool as well. Nova was rather bleh, but the ending makes sense and explains why he's that way. Luluco was cute as could be, you can't help but love her and her lame middle school lovey dovey obsession. \\n\\n\r\nThis was a very enjoyable anime, but the lack of slower pacing made it seem like it was over too quick and didn't make much of an impact compared to other anime. Don't let that keep you from watching it though! It was a genuinely good anime and I wish there was just MORE of it. I get that it enables Studio Trigger to put more into the artwork when the show is not so long, but at the same time it felt like a series of cartoons they play between shows on other networks. You could sit down and blaze through this whole series in one sitting, EASILY. Redeeming factor is, you'll have fun doing it :)\\n\\n\\n\r\nI'd check it out if you like fast-paced anime and something with cute humor to it. I think a few swigs of Mountain Dew or Redbull are in order beforehand though, you may blink and miss half the episode ;-)",
            "date": "2017-05-15T21:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 247782,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5731480.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Plucky-San",
                "username": "Plucky-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=247782"
        }
    ],
    [
        {
            "content": "Pure chaos and madness.The only words i can use to describe this show and tbh knowing the studio im not sure what else i expected.Space Patrol Luluco is basically a love letter to every done by Studio trigger and even some parts of Gainax.Kill la kill and gurren lagann references up the ***,crazy action,crazy plot, all that comes with the name studio trigger is here and multiplied by 1000.However beneath the craziness and action theres a sweet plot about how not to give up on love and accept the abnorm as norm. Each episode is only 7 minutes and its only 13 episodes takes aboutan hour and i say if your a fan of off the wall craziness and or love studio trigger as much as i do you'll find some enjoyment here.",
            "date": "2017-03-19T15:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 242980,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5982530.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IceBreaker_XY",
                "username": "IceBreaker_XY"
            },
            "url": "https://myanimelist.net/reviews.php?id=242980"
        },
        {
            "content": "This isn't going to make sense... I know. (And keep in mind, I don't LOVE studio Trigger, I didn't really care for Kill La Kill). I rated Story/Art/Characters all 6s. But overall I loved it. Why?\r\nThe Characters are your typical anime tropes. The ditsy girl that just wants to be normal. The handsome boy that shows up and changes everything. The cynical side character/friend. \r\nThe place and time, future japan. \r\nOk, just imagine every basic anime trope and shove it into a satirical short anime series. That's Luluco. It's dumb, it's silly, it's fast. It doesn't take itself or the genre seriously. The art isrepetitive a lot, mocking the reuse of scenes. The magical transformation is awkward and looks painful, mocking the transformations of other shows. The shallow love is just that, shallow. They point out the flaws in anime with this adorable show. \\n\\n\r\nDo you want something deep, intriguing, life changing? This isn't it. \\n\\n\r\nSick of seeing the same overused themes in nearly every anime? This show will make fun of them with you, arm around you, laughing over beers. \\n\\n\r\nI enjoyed it. I also enjoyed Triggers more serious series Little Witch Academia, which shows me they can use these tropes to make something beautiful and wholesome.  So maybe once you're done laughing at Luluco and her dumb teen antics in space, go watch Little Witch. If you want your brain to wonder \"is this the same satire as luluco, or is this serious?\" go watch Kill La Kill. Either way, this is a win for Trigger.",
            "date": "2018-04-07T22:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 277339,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6070055.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MimikyuteAF",
                "username": "MimikyuteAF"
            },
            "url": "https://myanimelist.net/reviews.php?id=277339"
        },
        {
            "content": "WARNING: THIS REVIEW IS BIASED AND COULD CONTAIN SPOILERS. TAKE IT WITH THE GRAIN OF SALT.\r\nSpace Patrol Luluco is one of the shows that somehow never fail to make me smile. It is incredibly energetic and goofy, but at the same time charming. \r\nWhile story is fairly simple considering how short it is, it is so off the rails that it becomes so enjoyable. There are some twists that might not be expected when watching it. However, it's nothing groundbreaking that will forever change the anime industry. It's just a simple show after all. It's shortness is both a weakness and a strong point. Onone hand, it makes it easy to watch considering you are just gonna spend 7 minutes per episode. On other hand, shortness can hinder the pacing and character development, making everything feel rushed.\\n\\n\r\nThe art style is incredibly appealing with vibrant colors adding up to the already great character designs. Animation is a bit of a mixed bag, since sometimes it feels like entire episodes are animated like Kill La Kill episode 4 but then once the things in the show get real, animation suddenly becomes fluid and fast, just like in previous Imaishi projects (something like battle scenes, which the studio excels at). However, since the limited animation is used for the exaggeration and comedic effect, it can get a pass if you want.\\n\\n\r\nCharacters are also incredibly fun to watch, with Over Justice being the best girl. Luluco is also pretty cute too, with her \"ordinary\" nature conflicting with the insanity of the universe and her trying to win over Alpha Omega Nova. Some characters might appear as a surprise too. However, due the shortness (already brought that too much) and nature of the series, the characters couldn't get really developed that much. \\n\\n\r\nWhile the opening is eccentric and fun, it's the ending that is outstanding.It is calm and relaxing compared to the feel of the actual show. The contrast between real life backgrounds and paper cut outs of Luluco and Nova really make it look very aesthetically pleasing. Probably one of my favorite EDs in 2016 and maybe even to this day. \\n\\n\r\nHowever, the enjoyment of this show depends on how much you even like TRIGGER as a whole, since it is a love letter to the studio that gave it life. If you don't like TRIGGER, then yeah there's a chance you won't enjoy this show at all, which kinda works against it's favor. Fans of TRIGGER (such as myself) would probably get some enjoyment out of it.\\n\\n\r\nOne interesting way to look at this show is to see it as an allegory for Studio Trigger themselves, with Luluco representing studio itself and Nova representing the desire for \"normal\" anime, considering that Imaishi always makes something insane. This can create some interesting discussions and adds a layer of depth to a rather easygoing but fun show.\\n\\n\r\nIn conclusion, I really love this show. I know it's not a masterpiece at all but the sheer joy it provided me makes it one of my favorites. If you like goofy and crazy stuff that makes zero sense (from outside), then I recommend this show to you.",
            "date": "2018-02-23T06:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 272237,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6999691.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MonoSwoloBoi",
                "username": "MonoSwoloBoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=272237"
        },
        {
            "content": "I made a video: you can find it at my YouTube channel \"BasementOtaku\"\r\nSPACE PATROL LULUCO (9/10): That there is mah ratin, if ya want to know more about mah ratin system check the description down below. Time to take a tumble into my potentially spoiler filled review.\r\nThis show is balls to the wall craziness through and through, and that is what makes it such an entertaining watch. The first few four episodes are over the top crazy but they all feel confined to individual gags, some of which can drag on for a bit too long. An example of this is during the first episodestransformation where the amount of time spent with the class laughing at Luluco’s embarrassing situation dragged on far longer than it needed to. There are other instances of this in the first four episodes but after episode five the show kicks into high gear. The appearance of Luluco’s mother displays a level of over the top lunacy that doesn't feel the need to really take a breather, and that nonstop quality is what I love so much about this show. It is as if the over the top nature of Gurren Lagann was smooshed into five and a half minutes of budget-restricted creative animation. Later on the Studio Trigger cross overs are a blast to see and the conclusion is similarly over the top in the best way. I finished watching this show and I had the biggest dumb smile on my face that just stuck there. Grinning ear to ear I heartily recommend you watch Space Patrol Luluco.\\n\\n",
            "date": "2016-07-26T18:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 225100,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971297.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BasementOtaku",
                "username": "BasementOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=225100"
        },
        {
            "content": "WARNING: This review might contain minor spoilers. Also this is my first review.\r\nUchuu Patrol Luluco (Space Patrol Luluco) is an anime created by Studio Trigger, the ones that made some of the good anime titles such as Kill la Kill. I like the way that they made something that balance fanservice with an simple yet unique story. \r\nSTORY - 8/10\r\nThis about our main heroine, Luluco, live in a city filled with aliens and such. However with her father accidentally froze himself, our heroine was forced to work as a space patrol to get her father unfrozen. The premise is simple yet unique in an, veryodd way. And episode duration is about 7 min per episode. I'll give it 8 for the story.\\n\\n\r\nART - 9/10\\n\\n\r\nArt style for this anime is simple, well because often Trigger use western animation as inspiration for art style. This style is rather unique, but is mostly compared to Kill la Kill. The art may give small nostalgia to people that watch Kill la Kill and other such shows. I'll give that art portion a 9.\\n\\n\r\nSOUND - 7/10\\n\\n\r\nTo me, the sound is so crazy that I can't compute with it. But it take time to get use to it. Some great songs is in this anime. For the sound portion, i'll give it a 7.\\n\\n\r\nCHARACTER - 6/10\\n\\n\r\nThe characters is okay-ish, I guess. There is some characters I can relate with, Luluco is one of them. She in real life may be an introvert person trying to cope and adapt to an extrovert lifestyle. For that, I'll give it a 6.\\n\\n\r\nENJOYMENT - 9/10\\n\\n\r\nThe story have me on edge. Mix with fanservice that is unique, in a odd way. With other factors such as great art style, and a simply unique story. For this portion, I'll give it a 9, because anything is not perfect.\\n\\n\r\nOVERALL - 8/10\\n\\n\r\nWith nostalgic art style, a unique story, and a fanservice. I'll recommend over 91 minutes of your time to watch this show.",
            "date": "2016-07-03T11:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 222970,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MichiganReviewer",
                "username": "MichiganReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=222970"
        },
        {
            "content": "Ucchu Patrol Luluco has a very interesting conception: turn upside down the life of a normal girl who is a junior high school student 13 years old, called Luluco, in the midst of an universe full of megalomaniac and nonsense absurdities. Who likes nonsense and, mainly, very absurd comedies will hardly not like Ucchu Patrol Luluco. The director Hiroiyuki Imaishi and his team decided to make this anime a great mix of various ideas and even experimentations, as in one of the episodes in which the script was theoretically done intentionally through improvisation and i found the result genius. Hiroiyuki Imaishi really knows what hedoes. In this anime, he was extremely artistic to turn something pure and sincere into the pillar that supports all the megalomaniac and nonsense development of the work. Another very interesting thing about the anime is that it is also a great tribute to the previous TRIGGER's works as Inferno Cop, Little Witch Academia, Kill la Kill, Sex and Violence with Machspeed and even Gurren Lagann, which was made by the bankrupt studio GAINAX, from which came out part of the staff who founded the TRIGGER studio. This was an anime full of references to these series and even had episodes of crossover with almost all of them. And every reference and crossover was well embedded in the anime. These were some of the ideas of the conception of the work, but it's possible to speak of more conceptions contained in this anime.\\n\\n\r\nThe plot was simply sensational. The succession of events of episode to episode and also within each episode was a gigantic nonsense spatial madness with many exciting and funny action scenes. The pace of this anime is extremely fast; it's very difficult to track the speed of events and development of the series ideas, because even being nonsense the anime carries a good dose of meanings.\\n\\n\r\nThe story was also pretty cool. It was cool to see Luluco's growth; very comforting and inspiring.\\n\\n\r\nThe script was very well written. It's possible to understand everything easily and to follow a good logical line. However, as the plot, the script is also very fast. I had to pause and or return several times to be able to read everything.\\n\\n\r\nThe characters are all very good. Hiroiyuki Imaishi created its concepts very well. They are a great salad of weird and unforgettable characters. Each of them is very different, but the differences are exactly what complement each other to create a series of bizarre situations and interesting interrelationships. I especially found Midori-chan SO MUCH FUNNY!!! XDDD\\n\\n\r\nThe soundtrack was very competent as usual by TRIGGER. The opening and the ending of the anime perfectly match the conception of the work. The opening is very agitated and funny as the anime and the ending is rather relaxing and touching. The voice acting was also very professional and is a remarkable aspect of the anime!\\n\\n\r\nThe animation? Perfect. I was quite caricatured, beautiful, colorful and mainly quite experimental. Not at random, there are several completely surreal moments during the episodes. Fitted perfectly with the conception of the series.\\n\\n\r\nMy Final Grade to this anime was Good = 7/10.\\n\\n\r\nCongratulations and thanks a lot to all the TRIGGER's staff that worked in this anime for providing this unforgettable work!\\n\\n\r\nAnd here I finish. See ya.",
            "date": "2016-06-29T21:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 222393,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5093168.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/I_The13thApostle",
                "username": "I_The13thApostle"
            },
            "url": "https://myanimelist.net/reviews.php?id=222393"
        },
        {
            "content": "Space Patrol Luluco is essentially the essence of studio Trigger in 13 7-minute episodes, and it does a great job of that.\r\nThe show contains a plethora of references to Trigger's other work, which won't hinder your enjoyment if you don't get the references, but will certainly add to your enjoyment if you do. \r\nLuluco isn't for everyone, but it's a show with very clear goals that accomplishes what it is trying to do very well. For example, the characters are pretty one-note, but they almost have to be in order to support the show's breakneck pace and short runtime. The show even makes reference tothis itself, constantly using \"middle-schooler\" as a somewhat derogatory term to describe the protagonist, Luluco.\\n\\n\r\nSpace Patrol Luluco is so self aware, you can almost hear it talking to you: \"Luluco is a silly little girl with a crush, that's it. Onto the next gag!\"\\n\\n\r\nLuluco is a fun little show with a pretty, bright color palette and Trigger's flashy, fast-paced style. It's not the best or funniest show ever, but it's so short that if you like Trigger at all you might as well give it a go.",
            "date": "2017-09-16T17:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 257736,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049209.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jindraisland",
                "username": "jindraisland"
            },
            "url": "https://myanimelist.net/reviews.php?id=257736"
        },
        {
            "content": "Ever wondered if Studio Trigger's anime worlds were ever connected?\r\nUchuu Patrol Luluco is an anime short about the titular Luluco voiced by M.A.O wanting to be a normal highschool girl where she lives Ogikubo is an alien-filled city making things very abnormal. \r\nFor the first few seasons (what?) Uchuu Patrol Luluco establishes Luluco and the Space Patrol cast most especially ΑΩ Nova voiced by Junya Enoki, Luluco's love interest and Midori voiced by Maymi Shintani, a classmate of Luluco, all while paying some homages to Trigger's and by extension Gainax's works. But later on, it outright pays homages and makes cameos' of Trigger's other works(like Kill la Kill, Little Witch Academia, Inferno Cop and hell even Sex and Violence with Machspeed) through Luluco and the gang looking for Ogikubo in space (don't ask) and them finding these worlds in the process. The final season culminates into Luluco's character development and hidden lore about her to what she REALLY is in a meta-aspect while paying homage to Neon Genesis Evangelion and Gurren Lagann.\\n\\n\r\nSo what does LA mean by \"seasons\", well Uchuu Patrol Luluco is formatted with 5 seasons spanning 13 episodes each with 7 minutes.\\n\\n\r\nThe animation by Trigger is what is expected from Trigger, the only attention to detail is that the majority of animation has the same stylings of the anime's they are paying homages (to be expected from ex-Gainax to Trigger animators). Uchuu Patrol Luluco's animation is bombastic to say the very least and LA loves it if that isn't obvious.\\n\\n\r\nThe voice acting is just as bombastic, even with a 7 minute timespan, the majority of the cast talks quickly but that only adds to the bombastity of this anime short's nature. M.A.O does great as Luluco and Mayumi Shintani who voices Midori does the extremely snarky character which is Mayumi's forte. LA's favourite voice actor would go easily to M.A.O without a doubt but nonetheless the voice cast is bombastically great.\\n\\n\r\nIf there were any shortcomings to Uchuu Patrol Luluco it would be that due to how quickly things come and go every episode, with the exception to Luluco and ΑΩ Nova, the rest of the characters are glance over and are just tagged for the ride or are meant to be cameos and nothing more, but this is Uchuu Patrol LULUCO so LA can give this anime short some grace.\\n\\n\r\nUchuu Patrol Luluco is undeniably a massive love letter to Trigger and Gainax fans as well as Trigger itself paying homage to it's previous works all packaged into a 13 episode anime short and can attract in any Trigger/Gainax fan and bring in that nostalgia of watching the shows made by Trigger and this one anime short tying in Trigger's shows into one nice medium. Uchuu Patrol Luluco may be an anime \"short\", but it brought something BIG as Trigger's bombastic nature and crazy storytelling Trigger's original works are known for.",
            "date": "2017-09-09T00:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 257149,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=257149"
        },
        {
            "content": "I'm writing this after watching Luluco a second time, and realizing that there's no way I can accurately describe this show with words.\r\nI can break down various parts and give short descriptors, but there's no one episode that we can do without, no element that is gratuitous or that can be thrown out. \r\nUchuu Patrol Luluco: 10/10\r\nYou should watch this. It takes less than 104 minutes start to finish; shorter than most movies.\r\nThe pace is rapid, always moving forward, but Luluco never moves too fast or too short. The narration pieces feel more like the show talking it itself than to the audience- not dictatingwhat the audience needs to know, but rather helping the very characters involved with the show keep pace with an increasing ridiculous and overwhelming world.\\n\\n\r\nThe art is simple in design, but complex in execution, emphasizing the nature of each character. It pears together characters who are related, and places them into classes that simply work well together. Most art looks complicated but feels lazy in execution; Luluco, as with most things, turns that concept on its head. One of the best examples is the repeated use of multiple perspectives on the same scene, including, at many times, reverse lettering.\\n\\n\r\nThe sound is perhaps the least stunning part of Luluco. Still good, and still better than any use of sound in a non-trigger anime I've found, the short episodes combined with short sound bites mean that the end result is almost repetitive- though, by the time it becomes so, the show has already moved onto its final stages.\\n\\n\r\nPeople praise character development often as introducing an interesting or unique character, but this show takes a different route, and instead has the characters grow throughout the show. Each episode changes the dynamic between the characters, and builds into the next. \\n\\n\r\nThis show is courageous. It parodies itself, while simultaneously reinforcing its own importance. A show must say something to truly be rated a 10/10, and Uchuu Patrol Luluco says it with a happy frown, or a sad smile. Everything feeds into the paradoxical message \"everything is priceless\" in both meanings of priceless.\\n\\n\r\nUchuu Patrol Luluco similarly falls into both meanings of the term 'priceless'. On one hand, it looks and feels a vapid, feel-good short about a middle-school girl. And on the other, it is a true gem of anime that can be watched anytime, anywhere, for a story and presentation that is nothing less than astonishing.",
            "date": "2016-09-29T17:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 230577,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HarpyBane",
                "username": "HarpyBane"
            },
            "url": "https://myanimelist.net/reviews.php?id=230577"
        },
        {
            "content": "\"'So I should stay normal?' 'No, you should stay wonderful.'\"\r\n     This quote is between 13 year-old main character Luluco and \"1st middle school crush\" Nova. Luluco, in the beginning of the show, is preoccupied with being normal. As the show progresses, she grows with experience as a (initially unwilling) member of Space Patrol, and eventually, awakens her power, and claims her identity as \"Ms. Trigger\".\r\n     Luluco is a show that pays homage to past Trigger works and other projects director Hiroyuki Imaishi has worked on. Trigger is a company formed by former Gainax employees who when foundingthe company were looking to take on the burden of their \"creative risks\" instead of passing them on to other staff. Imaishi made Luluco, not just for love of animation, but to show what his ideas of animation are by showing his influences and former work.\\n\\n\r\n     And how do those things show up in Luluco? They are all over the place (warning: if you would rather these by a surprise then skip this paragraph). To name some of the most visible, the Space Patrol chief is a skull head with TTGL (Tengen Toppa Gurren Lagann) style glasses,  Luluco's father for most of the show is a disconnected head talking via machine, Luluco's mom is a FLCL-like space pirate looking not unlike Haruko, Inferno Cop's Inferno Cop makes an appearance, episode 9 has the world of Imaishi's Animator Expo entry \"Sex and Violence with Machspeed\", episode 7 has the life fibers from Kill la Kill, episode 8 has a cameo from Little Witch Academia's Sucy, and Nova has Kiznaiver's scars in episode 12.\\n\\n\r\n     But enough talk about the ideas behind the show, how is the show itself? The show has a style that is similar to 2010's Cartoon Network influenced Panty and Stocking both in the animation's look and its bombastic, slap stick comedy. The music is generally frenetic to match the pacing of the show. Teddyloid from the Panty and Stocking OST is a returning composer along with Mayumi Shichani. The show has great visuals, and more appealing then usual character designs.\\n\\n\r\n     If there is anything to complain about Space Patrol Luluco, it is its lack of feature depth. it is shorter then half a normal 13 episode cour and the plot is sporadic, not following any given idea for long. These facts taken together equate to a show that can feel light weight at times. The only real thread that ties the show together in the end is the relationship between Luluco and Nova.\\n\\n\r\n     If you have never seen any of the aforementioned shows before Space Patrol Luluco, it is still entirely likely you may enjoy Luluco as a standalone. However, if you disliked Panty and Stocking, which this show is probably closest to in style and form, you still might enjoy Luluco because the ecchi and potty mouthing is absent, but proceed with caution. Luluco is short, and not as substantiated as some past Imaishi projects, but it is still a whole lot of fun, and definitely a highlight of this anime season.",
            "date": "2016-07-04T20:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 223161,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4980435.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/roundbeats",
                "username": "roundbeats"
            },
            "url": "https://myanimelist.net/reviews.php?id=223161"
        },
        {
            "content": "First things first - if you've seen Inferno Cop or Ninja Slayer, you basically know what you're getting yourself into here - this is Studio Trigger's \"B-team\" at work again, and I don't mean that as an insult. In between their meatier shows (Kill la Kill, for example, or this season's Kiznaiver), Trigger seems to enjoy blowing off steam by making extremely silly, extremely fast-paced ONAs.\r\nUchuu Patrol Luluco does have an overarching plot, but it's barely visible through increasingly ludicrous visual gags and callbacks to other Trigger properties, all crammed into tiny seven-minute episodes. It's kind of like if you put Kill la Kill andTengen Toppa Gurren Lagann into a blender and poured the resulting slurry through an FLCL sieve. In fact, Luluco's embarrassing transformation into a human gun (\"Fight for Justice!\") recalls nothing so much as FLCL's puberty-adjacent head robots. Both shows touch on themes of first love and growing up, and the struggle of just wanting to be \"ordinary\" in a world gone mad. But whereas FLCL digs into and subverts these themes, Luluco mostly just plays them for laughs - which is fine, given its ultra-short runtime.\\n\\n\r\nThere is little substance in this show, but its irrepressible personality and endless conga line of self-referential material is an enjoyable treat for those who are familiar with Studio Trigger's corpus. Even if you aren't, there's a lot to like here. The visuals are impressive and the plot, when they bother cramming it in, is serviceable. If you've seen and enjoyed Panty & Stocking with Garterbelt, Kill la Kill, TTGL or any of Trigger's previous ONAs, you'll find familiar enjoyment here.",
            "date": "2016-07-04T00:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 223058,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4057559.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/stokesty",
                "username": "stokesty"
            },
            "url": "https://myanimelist.net/reviews.php?id=223058"
        },
        {
            "content": "If Trigger ever put all of their biggest animations on a box, Space Patrol Luluco would be that box.\r\nCompared to most of Trigger's animation, this anime series are just a few and bite-sized, or in other words, it's only 13 episode and 8 minutes in duration for each episode.\r\nThree words that can describe Space Patrol Luluco: Chaotic, Unexpected, and Wonderful.\r\nI don't really go on the anime for the story though, but the story is understandable and interesting. Since this anime is bite-sized, it gets weird and weirder every minutes over the show.\r\nThe characters are just funny and lovely - apart of the other Trigger animationthat have crossover here.\\n\\n\r\nYou can find most of Trigger animation references throughout the series, like Kill La Kill, Little Witch Academia, Inferno Cop, and pretty much other minor ones, but it's you who up to find it.",
            "date": "2019-01-26T07:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 300043,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7056884.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/maufirf",
                "username": "maufirf"
            },
            "url": "https://myanimelist.net/reviews.php?id=300043"
        },
        {
            "content": "This show is great. Even when you take away the hearty amount of references and homages to previous and upcoming works, the show is the shortest show that I've found to be as meaningful and impactful as another 26 episode trigger show.\r\nUchuu Patrol Luluco is a memorable ride of action, comedy and romance. As per usual, Trigger goes 100% in whatever direction it takes. Be it insane or heartwarming scene, there is no feeling that is not met unfelt. If you are looking for a show grounded in reality, gritty and with dramatic tension, you have come to the wrong show. To believe that thisshow is supposed to make sense or relatable is totally missing the point.\\n\\n\r\nThis show sounds great, catches the eye, has a beginning and an end, and is highly enjoyable whether you're looking for a fun thirteen seven minute episodes, but this anime truly shines with its characters and themes. Without spoiling anything, I believe I can say what this show says about what normal means, and the worthlessness of first loves is dealt with much care and is nuanced. You will find yourselves feeling what your characters are feeling, and rooting for Luluco to achieve her goals however juvenile they are.\\n\\n\r\nAs for why a gave this show a 9 instead of a 10 is because if you have watched another Trigger show, you will notice that this show carries many artistic and narrative similarities to other Trigger properties, and for every reference they pull, it reminds me how much I want to watch that show. It is like if you have three diamonds. As a whole very valuable, but if you lose one, at least you still have two diamonds. It may be a personal thing, but I figure that if Trigger took out each reference and instead added original content, the show would have been that last point better and gone from great to amazing. Either way, it is more of a taste thing, your mileage may vary.\\n\\n\r\nI hope I haven't messed this review up too much because I can happily recommend this show. You don't need to be a trigger fan to understand the story told here, and if you have an hour or two to spare, this show is an highly enjoyable watch.",
            "date": "2017-01-03T00:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 237318,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4909753.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ItsJustColton",
                "username": "ItsJustColton"
            },
            "url": "https://myanimelist.net/reviews.php?id=237318"
        },
        {
            "content": "A IMP Review of: Space Patrol Luluco (Dubbed edition)\r\n(IMP stands for “In My Prospective”, meaning if someone attempts to correct the way i see the show i have no intention of reading any “corrections”)\r\nStory: Have you ever wanted something very similar to panty and stocking? When the animation, story type, and characters are highly similar to panty and stocking but just don't cut in to be as good as Panty and stocking, so where most understand Panty and Stockings wacky type storyline this show didn't get close enough toit, 6/10. Ultimately story was not this shows strong suit. Yes it has one, but you dart in so many directions with what makes sense, where you are and what’s happening that you kind just give up on trying to grasp it all, when it comes to panty and stocking, it’s clear what they are basically doing throughout the show even if it gets wacky, here the base story one can get from the show is Luluco is trying to help her had after he got accidentally frozen, or she's looking for love, or... Yeah it kinda skimps on which event is the most important to follow. \\n\\n\r\nCharacters: Considering how the story goes throughout the show the characters aren’t terrible or anything but most are tropey so I’d say 7/10. Luluco is rather good, she acts like a typical anime school girl or a real anime school girl in some cases and her comedy works well throughout the show. The chief of space patrol is a complete dunce, the main male character does what he is meant to do and does it better than the usual anime protagonist (he places his part in the show well; it makes sense if you watch it). Lulucos parents are sort of unimportant really, her dad is gone for most of the show, her mom can’t decide if she’s good or the bad guy (sort of), and the space patrol secretary just keeps the space patrol chief in order. The other female character we see often is decent but she turns into an unimportant side character fast.\\n\\n\r\nArt: The art was extremely similar to Panty and Stocking, some bits seems not as good but others were more polished, I’d say a 9/10 is in order. The artist really had fun with the style from Panty and Stocking and it shows, too bad the show was composed of short episodes, it’s always a pleasure to see that art style used in an anime. \\n\\n\r\nSound: The overall soundtrack wasn’t terrible or anything but also didn’t standout much, it had some Panty and Stocking-esk type background music and such, but the opening wasn’t great. The ending sound was alright so I suppose it gets a 6/10.\\n\\n\r\nEnjoyment: As I keep saying, this show is highly like Panty and stocking, not completely but to an extent. It suffers from how short each episode is, and how ultimately long the series is as well. But I enjoyed watching it and it was a good time wasters so 8/10.\\n\\n\r\nOverall: It was pleasant to watch but the idea it gets a sequel is limited and it felt like eating a small ball of cotton candy, I wanted more, but I know I won’t get more. Don’t get me wrong, it had issues and it’s a show I might watch again in the future but ultimately it was enjoyable to watch once, unlike Pany and Stocking which I can watch again and again, 7/10.\\n\\n\r\nLet me tell others 2 things, 1: I will not tell you or encourage you to give the same rating, this is just my personal opinion on this show and 2: honestly I’m doing this review and other reviews as a hobby and for my own “anime records” so to speak, so if you see this and don’t like it just ignore it honestly because its more for me then to help others in the long run.",
            "date": "2018-04-05T01:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 276965,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049125.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SniperKnighter",
                "username": "SniperKnighter"
            },
            "url": "https://myanimelist.net/reviews.php?id=276965"
        },
        {
            "content": "In \"Space Patrol Luluco\", the emotions and love of a middle school girl is the strongest and most important thing in the entire universe, and the only people who would oppose this statement are cruel villains who live to see others in pain. Honestly, there's too many stories about characters having to put aside their emotions and see things as they are, get over themselves and do the right thing. This is treated as a good thing, as being mature and leaving behind childhood things, both in fiction and in real life. \r\nBut \"Luluco\" makes a point to show that a strong enough conviction, passion,and love can change the way the world works, it can make it so that we can save the people we love and can conquer any evil. This is presented with no irony, no caveat or anything. Even if its not realistic, \"Luluco\" allows it to be in the biggest and loudest way possible. It gives hope to the viewer, hope that what seem like naive and insignificant feelings are not actually those things, and should instead be held in high regard, treated just as seriously as whatever it is people \"should\" worry about.\\n\\n\r\nThe show accomplishes all this as a series of short episodes, being the natural evolution of Trigger's \"Inferno Cop\", that evolution being \"make it a little longer, and make it sincerely\". In a way, it's a celebration of what Trigger is, not only in its crossovers, but in its passion, its sense of humor, its entire attitude. If someone ever wanted to understand what Trigger is and what makes it special, I would point to \"Luluco\".",
            "date": "2017-10-02T19:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 259523,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5712022.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BansheeNeet",
                "username": "BansheeNeet"
            },
            "url": "https://myanimelist.net/reviews.php?id=259523"
        },
        {
            "content": "Space Patrol Luluco is further proof that Trigger is at its best when making short, succinct anime that are long enough to stuff with the studio’s unique brand of humor, but without overstaying its welcome. The humor never has a chance to become repetitive or overly gratuitous since the show isn’t long enough to have to constantly one-up itself. Likewise the story doesn’t have a chance to become serious enough for the convoluted mess that it is to begin waning on the mind of the audience. Much like Trigger’s previous works Inferno Cop and Little Witch Academia, Space Patrol Luluco is an extremely fun andsatisfying rump through a unique, little world jam packed with laughs.\\n\\n\r\nLike every humble story about a Japanese school girl, Space Patrol Luluco begins with a breakfast of champions. However, as our titular heroine chows down on some eggs and bacon whilst spouting a little bit of plot exposition, her single father bites into an ill-placed capsule that instantly freezes him in a block of ice. With his head/brain sliced in half in the ensuing panic, Luluco scrambles to get her crystalized father to work on time so as not to be late for school herself. After being arrested multiple times by a police chief who is WAY too eager to serve JUSTICE!!!... Luluco is forcefully recruited into the Space Patrol to deal with rampant space crime in place of her frozen father, with her 1st mission being a very awkward, yet successful, impediment of “Space Cheating” going on in her own middle school. This all happens in the span of 7 minutes.\\n\\n\r\n\tThe show often moves at a breakneck pace for the 1st half to what I believe is its own advantage. The less time you have to consider the things that are actually going on, the more fun you’ll have just going with the insane flow of it all. The only real slow parts happen when the show starts paying tribute to Trigger’s previous works. Towards the middle, the show takes a few episodes to visit the worlds of Little Witch Academia, Inferno Cop, and Kill La Kill. Though I have had the good fortune to have previously seen all of these works and found them very enjoyable, these parts seemed to contribute little to what was going on in the plot and could leave viewers new to studio Trigger lost and scratching their heads. The main villain also seemed kind of forgettable to me, but that’s a common thread in Trigger’s work.\\n\\n\r\n\tThe glue that holds this whole production together is, of course, Luluco. Words cannot describe what a joy Luluco is on screen. She is an absolute sweetheart with a very flexible range of emotion, quickly jumping from hyperactive, idiot tomboy to love-struck, awkward dandere to badass, space warrior. The way Luluco interacts with the worlds and characters around her are an absolute joy to behold. This is especially true for her interactions with her Space Patrol coworker, Alpha Omega Nova. Nova is a cute, blonde haired boy who instantly steals Luluco’s heart with his dashing good looks and a lackadaisical, yet strangely narcissistic attitude. Though the show could have just made him ‘Sasuke without the Anger and Despair’, Nova manages to provide a decent amount of humor and drama to the plot.\\n\\n\r\n\t There are too many fun characters in this show to keep on listing, but special recognition needs to be awarded to Over Justice, the boss of the Space Patrol. If you are a fan of Inferno Cop, then you will LOVE this character. Over Justice delivers some of the best lines in this entire show and injects some much needed Inferno Cop humor into every scene he’s in. The only character I was really disappointed with was Midori. Despite being listed on MAL as a main character, I am really struggling to remember her doing anything of note in this series. Though she is a fun, anarchistic character, in her own right, she feels rather underutilized.\\n\\n\r\n\tThe art and animation for this show can be summed up as Kill La Kill without the budget. Luluco has the same cartoony art style that was present throughout most of Kill La Kill, while the animation is very indicative of most scenes that involved Mako. It is a lot of cutely designed characters, with plentiful movement, but limited range of animation. It works really well for a series of this scale. Thankfully the show manages to avoid any questionable uses of CG characters or any noticeable laziness with regards to scenes lacking animation that one would find in Kill La Kill. \\n\\n\r\nOn the sound side, Luluco’s OP perfectly captures the insane, hyperactive silliness of the show. With its clamouring music and bizarre lyrics, the OP never failed to get me into the mood for another episode. The ED, however, is surprisingly mellow in comparison. With its soft, ambient music and laggard, whispering lyrics, it envelops the audience in a serene sense of calm that beautifully closes out each episode. Though nothing musical struck me as of note within the episodes themselves, Luluco should definitely be commended for its masterful and comedic use of Engrish.\\n\\n\r\n\tSpace Patrol Luluco is a wonderful culmination of all that Trigger learned from its previous works. It manages to boil down Trigger’s unique approach to visuals and story-telling without stepping on most of the pitfalls of its previous series. There is no overly gratuitous sexuallization of Kill La Kill. There is no distasteful humor that occasionally popped into Inferno Cop. And there is never too much of little going on as in Little Witch Academia. It is a series so purely distilled and so finely crafted, that I struggle to find any reason for why anyone shouldn’t experience this hour-long, hyperactive trip.\\n",
            "date": "2017-07-08T17:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 252311,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4682676.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dr_Sephiroth",
                "username": "Dr_Sephiroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=252311"
        },
        {
            "content": "Just a normal middle school girl trying to be normal in an abnormal setting. Nothing  could possibly go wrong, right? A short, lighthearted but hyper-active series to keep you entertained 100% of the time!\r\nStory\r\nThe plot is executed smoothly, with a lot of crazy, random shenanigans. It's calm in the beginning but after that I was mostly thinking \"what is going on?\" ...but in a good way, laughing along the way. It's all relevant and doesn't go too off-track.\r\nArt\r\nThe animation is where the shenanigans come from. When you have simple, stylized artwork for the entire show it's easier to animate and have creative freedom. StudioTrigger's animation is no joke and working with such short episodes gave them a lot of freedom to play around with the hyper, action-packed animation even with such a simple style. It's a lot to look at during some scenes but you will not be disappointed, because the animation stays consistent. Oh yeah, the overall colour scheme is great too, keeps up with the cute space setting.\\n\\n\r\nSound\\n\r\nOverall, appropriate music to maintain the spacey atmosphere. The energy in the soundtrack keeps up well with the animation and follows the mood of each scene. The ending song was catchy too.\\n\\n\r\nCharacter\\n\r\nEven with a handful of characters in tow, the only one that really develops is the main character Luluco. The story is centred around her so obviously she'd shine the brightest. Throughout her adventures, exploring and meeting new people helps her develop her self-realization. Nova is the second most developed character, but not without the help of Luluco. The side characters are all the funny, quirky abnormal beings that contrast with Luluco and support her growth.  \\n\\n\r\nEnjoyment\\n\r\nI appreciate these kinds of short series as in-betweeners for darker, more serious shows. I watched this all in one go, and I think I enjoyed it better that way. Just don't take it too seriously because it doesn't take itself seriously! Also really liked the surprise cameos and crossovers!\\n\\n\r\nIn summary, don't underestimate the power of a middle-school girl! \\n",
            "date": "2017-05-24T13:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 248442,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/152221.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/icyyyyy",
                "username": "icyyyyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=248442"
        }
    ]
]