[
    [
        {
            "content": "Literally you can get this show done in an hour.\r\nThe plot of \"I can't understand what my husband is saying\" is about Kauro, an office lady, and her husband Hajime, an otaku who makes money as a blogger, and their lives as a married couple. The show has decent humor in it making it very enjoyable. Not only that, it's kind of interesting how the show tells their lives as a couple in only about three to four minutes.\r\nIf want to watch a quick and very enjoyable anime. I recommend \"I can't understand what my husband is saying\".",
            "date": "2015-01-03T05:59:00+00:00",
            "helpful_count": 311,
            "mal_id": 175901,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3886845.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Anthony_DiGrande",
                "username": "Anthony_DiGrande"
            },
            "url": "https://myanimelist.net/reviews.php?id=175901"
        },
        {
            "content": "It can be quite easy to let your prejudices get the better of you. Opening your arms to something new, only to encounter the same things time and time again. Your expectations become lower and lower, until they become so low they no longer justify the effort of trying anything new in the first place. The reliance on the same old ideas and lack of creativity becomes so frustrating that even reading descriptions of new things annoys you. You have become a cynic.\r\nIf there were ever an anime to be cynical about, Danna ga Nani wo Itteiru ka Wakaranai Ken would be it. The seriesis about an office lady married to an otaku, and explores the conflict between these lifestyles in a light hearted and humorous way. There are quite literally no stories about otaku which do not deal with this conflict; it is the only thing which distinguishes them as a group from the rest of society. In practice it amounts to little more than perpetuating stereotypes now so sharply defined that any variation from them would subtract from their authenticity. There is nothing more that can be done in Otaku parody, and nothing about it that has been left unsaid. If that were not reason enough to be cynical about Denna, this isn't even the largest obstacle that it faces. Denna is not a full length tv series, or even an OVA: it is a series of thirteen five minute shorts. The limitations this creates are rather more intrinsic than the subject matter; producing something genuinely worthwhile in this format is an exceptionally difficult task, as is evident from previous examples. Most abandon all hope of telling any overarching story, and focus instead either on single scenes or random batches of gags. Productions in this format never amount to anything more than a minor distraction.\\n\\n\r\nWho'd have thought that being proven wrong could ever feel this gratifying?\\n\\n\r\nDenna ga Nani wo Itteiru ka Wakaranai Ken achieves more in its short running time than many full length series do across their entire run. It begins with an introduction to our leading characters, office lady Kaoru and her otaku husband Hajime. We expect that much will be made of their imagined lack of compatibility, and while not entirely wrong about this, there is evidence that there is more between them than meets the eye. That they are not paired for the sake of comic effect but there is a real connection between them.\\n\\n\r\nThe next episode introduces Tadashi, Hijeme's ambiguously gendered sibling. He has an incestuous attraction to his brother which brings the series a significant step closer to the dreaded otaku parody genre. His character appears again throughout the show, primarily as (unwanted) comic relief but also as a source of character development, providing an important link to Hajime's past and an overseer of their entire relationship.\\n\\n\r\nAs the series progresses, more and more time is focused on developing the relationship between Hijeme and Kaoru, which is interesting for a number of reasons. Romance stories about established couples are somewhat uncommon, as are those concerned with people in their late twenties and early thirties. Melodrama is sidestepped and instead we can examine the less often discussed process of two formerly independent people living together and eventually becoming a family, where far more is at stake and so much more can go wrong. \\n\\n\r\nThis isn't the only sign of a more mature romantic outlook in Denna. It would be incredibly temping for an anime like this, featuring a relationship between an 'otaku' and an ordinary person, to depict it as one sided. There is no shortage of anime which depict relationships as 'long suffering woman takes pity on unappealing male' or Hijeme as 'Almost unbearable man with a heart of gold'. While perhaps these scenarios provide some potential for comedy, they are completely removed from reality. Few people would consider marrying someone unless they believed they were in love with them. Denna recognises this and takes the time not only to explain what Kaoru sees in Hijeme, but the equally important question of what he sees in her. Because Kaoru has faults too. She smokes a lot. She drinks too much. She experiences loneliness. This focus on the emotional bond between Kaoru and Hijeme continues as the series edges toward its conclusion.\\n\\n\r\nThen something completely absurd happens. Something so unbelievable, I find myself struggling to even write it down. What happens at that point is basically this: a thirteen episode series of three minute long anime shorts taking a humorous and light-hearted take on the relationship between a hardworking office lady married to an otaku, caused a fully grown man to start trying to fight back the tears in his eyes.\\n\\n\r\nThough Denna's brilliance was not something I would ever have expected, fortunately it is something which can be explained rather easily: it treats its characters like people, and its audience like adults. The more these principles are followed, the more we shall get to enjoy those blissful moments. The human ones.",
            "date": "2015-02-04T20:12:00+00:00",
            "helpful_count": 199,
            "mal_id": 179689,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/233469.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnnoKano",
                "username": "AnnoKano"
            },
            "url": "https://myanimelist.net/reviews.php?id=179689"
        },
        {
            "content": "To establish a believable story is a difficult feat and yet this show manages to pull it off rather effortlessly. With a mere 3 minutes per episode, Danna ga Nani wo Itteiru ka Wakaranai Ken manages to accomplish what most other slice of life shows do not.\r\nWhile the premise, at first, seems tired and tedious the palpable chemistry between the contrasting protagonists leads to one of the most sincere representations of modern married life in anime. Their interaction feels real and wholesome, without being forced and unnatural. The characters have a sense of development, which helps give purpose to their lives, resulting in a surprisinglyimmersive experience.\\n\\n\r\nNow while the majority of the show can be thought of as an episodic endeavor, there are several over-arching narrative themes that are portrayed rather well, with an extremely gratifying conclusion. The show manages to remain comedic, without having to resort too much on tacky slapstick humor. \\n\\n\r\nThere are several elements of drama which are presented, without hindering the overall tone, that keep the show interesting. Otaku culture is also a prominent theme and as such there are several references to other real-world shows, which further enhance the experience.\\n\\n\r\nThe art-style and soundtrack are about average at best, however, considering the scope of the show it seems appropriate.\\n\\n\r\nThe show’s simplistic premise and execution make it extremely enjoyable, and while the comedy might not suit everyone’s tastes, it’s definitely one of the better shows the slice of life genre has to offer.",
            "date": "2015-03-30T09:49:00+00:00",
            "helpful_count": 58,
            "mal_id": 184096,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4383037.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dgtl13",
                "username": "dgtl13"
            },
            "url": "https://myanimelist.net/reviews.php?id=184096"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nIt's funny how compartmentalized life really is. When you get right down to it, it's a bunch of connected events that have a certain amount of significance. Being born, losing that first tooth, passing that big test, graduating college; there are endless but meaningful happenings that occur that shape the course of the life we take. A rather large one is the decision to bind oneself to another person \"until death do they part.\" Otherwise known as marriage, it is a day usually considered the biggest when it comes to a relationship. For I Can't Understand What MyHusband Is Saying, marriage is only the beginning.\\n\\n\r\nSTORY\\n\\n\r\nICU (need to shorten it at this point!) begins with Hajime and Kaoru's wedding day. After a short honeymoon, the show follows their life on a day-to-day basis.\\n\\n\r\nThis one isn't your typical anime; running at about three to four minutes per episode, it's incredibly short. One can sit down for less than an hour and finish the entire season. Sounds trivial, but that's part of its appeal. Not worrying about incredible world-building or intense drama, ICU opts for a healthy dose of comedy and heartfelt moments. And due to the length of the show, it works very well. It adopts referential humor, word-play, and dialogue jokes in very quick succession. The fast-paced comedy is owed to the time-constraint that the anime imposes on itself. It's executed nicely, causing a high amount of potential laughs from start to finish.\\n\\n\r\nWhat's strange about ICU is its ability to inject rather touching scenes throughout the season. The comedy is done well, and so are the more \"real\" sections. The show looks at differing aspects of what married life is like: finding a new job to support each other, caring for your loved one when she's sick, and reminiscing about that first date. They're simple \"Aww!\" moments, but they give Hajime's and Kaoru's relationship more significance than just \"otaku\" and \"hot chick.\" They're able to joke with one another because of the relationship they share. Simultaneously, they can demonstrate their love with the more sincere and simple actions that they take.\\n\\n\r\nAlluding back to my little preview, life is a series of events. Marriage is a big one, but it's not the last. There are other, rather obvious, developments that take place later on down the road, and ICU explores these as well. Having sex, changing habits, and thinking about having children are acts that take place because of what occurred before. Marriage does this; a person is no longer living for one's self anymore, but is instead living for each other. As a couple who completely \"get\" one another, they are able to progress through these new events not as individuals, but as one cohesive unit.\\n\\n\r\nANIMATION\\n\\n\r\nICU literally doesn't have much time to show off. The art style has this weird \"clouding\" effect on the edges of the scenes, making it appear is if what one is looking at isn't an anime so much as it is a thought taking place in the mind. The show incorporates an okay amount of differing locations, from the married couple's apartment to cities and restaurants. Nothing is too detailed, giving the anime a rather plain look. This doesn't necessarily hurt it, though; in fact, it adds to the already mellow and calm feeling that permeates the show.\\n\\n\r\nThe character designs are simple as well. Hajime's frazzled hair, foggy glasses, cat-mouth, and green t-shirt paint him as the every-man. Kaoru's pink sweater, blonde hair, and large bust make her out to be quite the attractive wife. The rest of the cast are given small details as well, such as Destiny Fucker's shades or Youta's ponytail.\\n\\n\r\nThe actual animation follows the same routine. With low animation quality, it uses this to its advantage by making the characters move in funny or non-fluid ways, adding to the comedy overall. The quickness of the show itself also allows such minimal animation to work, relying more on viewing or hearing the joke for that particular scene, as opposed to watching it play out.\\n\\n\r\nCHARACTERS\\n\\n\r\nICU understandably focuses on Hajime and Kaoru exclusively.\\n\\n\r\nAs the husband, Hajime is always looking out for Kaoru. An anime-watching, 2D-loving, manga-reading \"otaku,\" his description makes one wonder just how he managed to land a girl like Kaoru. But it's evident as to why: he's caring, thoughtful, loving, and willing to be the man that she needs. He loves kids and prefers to enjoy life with his wife rather than with anyone else. Having almost zero friends, outside of his darling and his younger brother, his tendency for anime-related products makes him a bit of an odd-ball. He does what he can to support Kaoru, making it clear just how great of a guy he really is.\\n\\n\r\nAs the wife, Kaoru is always listening to Hajime. Lacking confidence, bad at cooking, and a smoker, she also doesn't seem to be the kind of person who could be fallen for. But as the saying goes, \"opposites attract.\" By marrying Hajime, Kaoru receives a boost in her self-esteem, she betters herself by wanting to cook more, and drops her bad habit in order to keep her healthy and Hajime happy. Apologetic at times but a sexual deviant when drunk, she's a sweet woman who is eternally grateful to have the love of her life next to her. Despite the show's fast-paced feel, the audience gets to witness her ascent from a lonely, brooding, in-denial mess into the happy, content, and understanding wife that she is today.\\n\\n\r\nThe rest of the cast are technically forgettable, but on purpose. Youta is the \"trap\" brother used for sexual jokes, Destiny Fucker has a ridiculous name, Rino's shortness is teased, and Hajime's mother and Kaoru's father are overbearing. There are a few more, but they all follow the same trend: a simple quirk that is joked about once or twice. Not utilizing the side characters extensively actually aids the ensuing hilarity, because they never feel overused or old. They show up, make their joke, and leave.\\n\\n\r\nEarlier, the word \"understanding\" was used in conjunction with Kaoru's development. It's an important word; after all, it's literally in the title. And it's an interesting one at that, too. \"I can't understand what my husband is saying\" isn't really a famous phrase so much as it is a statement about liking a hobby. Anime, sports, and cars may be examples where the wife utters this. But isn't that bad? The wife not being able to understand what her husband is saying, what her husband enjoys, seems rather rude. And to an extent, it is. But the purpose here isn't that Kaoru can't communicate with him, it's about her trying to. She may think he is speaking gibberish, but she listens, interprets, and reacts to what he says rather than flat out ignoring him. It works the other way as well; Hajime's caring and support for his wife shines through despite him naming off Evangelion character names. For both, the adage \"actions speak louder than words\" rings true.\\n\\n\r\nSOUND\\n\\n\r\nThere actually isn't an OP for ICU. This is the right choice; an OP would make the episodes too short to even consider it a product worth watching.\\n\\n\r\nThe ED is really not that good. It's somewhat cute, with Hajime and Kaoru singing alongside one another and in unison. The beat, unfortunately, is generic and the instruments are loud, making it rather unpleasant to hear.\\n\\n\r\nThe soundtrack contains hard guitar segments for the scarier moments, fun little beats for the comedic ones, and chime-filled, violin pieces for those touching scenes. A fine soundtrack for what it is, but nothing worth listening to outside of the show itself.\\n\\n\r\nVoice-acting sees average to above-average performances across the board. Special shout-out to Kenichi Suzumura as Hajime.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one is actually quite appealing to the adult crowd (myself included). Marriage talks, sex, kids, work, familial issues; it contains an assortment of dilemmas that the older crowd generally have to deal with that the vast majority of anime watchers do not. It's always an interesting gamble when a show decides to forego flashy effects and super sexualized females in favor of having the couple visit the wife's father for cooking lessons. Luckily, in this case, the risk pays off.\\n\\n\r\nI'll admit that I didn't understand every single reference that the show threw out at me, but for the ones that I got, it was quite funny. This, in tandem with the word-play and other gags, usually had me laughing a bit for each episode. Youta's incessant incest, Kaoru's drunken \"jackhammer,\" and Hajime forced to go with \"hand over hole\" were good comedic moments. Each of these is small and quick, making the experience never a dull one.\\n\\n\r\nAs a final note, my favorite episode was number eleven. With the different art style, character exploration, and ultimate message given, it not only sticks out from among the comedy that the show offers, but also is incredibly heartfelt to see.\\n\\n\r\nI Can't Understand What My Husband Is Saying is the start of a family. It's swift, it's cute, and it warms the soul. There really is no reason to not give Hajime and Kaoru just a few minutes of your time.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, comedic, touching, mature\\n\\n\r\nAnimation: Good, art and animation are simple but work\\n\\n\r\nCharacters: Good, Hajime and Kaoru make a cute couple, side cast utilized appropriately\\n\\n\r\nSound: Fine, no OP, bad ED, okay soundtrack, average VA work\\n\\n\r\nEnjoyment: Good, adult-oriented, quirky, and sometimes profound\\n\\n\r\nFinal Score: 7/10",
            "date": "2015-01-01T19:25:00+00:00",
            "helpful_count": 41,
            "mal_id": 175649,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=175649"
        },
        {
            "content": "I'm not a fan of shorts, but when this show came along, I didn't know what to expect, but damn, now I feel more positive about shorts after watching this, this is gonna be quick review since shorts don't portray much in its categories of story, characters and art. Mainly they're here as an enjoyment, like a break between watching shows. Usually these shorts are streamed multiple times in a week in Japan, while outside of Japan usually we just see it, and usually wait for the next short.\r\nStory: 7/10\r\nSo the story follows the story of a Business Lady named Kaouru who marries an Otakunamed Hajime. The idea is really damn smart, Imagine it, you're hardworking mothatrucka who marries a lazy ass motrucka (no offence). It makes up for some interesting ideas and sounds like a TV show, welp only if this was one. The episodes are usually a singular story per episode where the couple discover something new in their relationship or progress something. Really, there's not much of a story here, but there is good use of it.\\n\\n\r\nCharacters: 7/10\\n\r\nFirst, you got Hajime, our Otaku, a really damn relatable and hilarious character, mainly to his relatbleness (I don't know if thats a word) he's not always lazy, but we do see him at times trying to help out his wife for the better or the worse, sometimes in serious problems and sometimes in some pretty simple and hilarious problems like drinking. \\n\\n\r\nThen we have Kaoru, who usually has problems that Hajime usually help out with, she's usually the sector of the problems but she isn't really useless, she is hardworking but thats what we know.\\n\\n\r\nArt: 9/10\\n\r\nThe animation is really well done here and is pretty artistic, especially one episode where the whole art style is changed into a sketchy animation style which really shows off the show's art style.\\n\\n\r\nSound: 8/10\\n\r\nThe music here is pretty calming and nice, the ending theme is the couple singing to a nice smooth of tune in a slice of life.\\n\\n\r\nEnjoyment: 8/10\\n\r\nThe jokes here are well done and at times outright crazy, it is very well done  and creative, each problem will usually end up in a good way and if not still has some heart to it. It really shines here.\\n\\n\r\nOverall: 7.5/10\\n\r\nThis show is pretty well done and gets it story going. A 2nd season has been announced and will be a full TV series, just what we wanted.The ending is really damn sweet and signifies more thats coming. If you want something heartwarming, short and sweet to watch, ICUWMHIS has got ya covered.",
            "date": "2014-12-27T14:57:00+00:00",
            "helpful_count": 15,
            "mal_id": 174621,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4188619.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JKinky88",
                "username": "JKinky88"
            },
            "url": "https://myanimelist.net/reviews.php?id=174621"
        },
        {
            "content": "Let’s review *I Can't Understand What My Husband Is Saying (Danna ga Nani wo Itteru ka Wakaranai Ken)*. \r\nDanna ga Nani's humor revolves around Otaku jokes and mature humor. Being that the Otaku comedy genre is one of my favorite sub-genres, Danna ga Nani is a series that satisfies my interest in the genre. As with most comedies, Danna ga Nani is often hit and miss; sometimes the jokes hit the mark, while others miss completely. With that said, the more mature humor and marriage jokes are not something you often see in anime, even if many of the jokes involving Hajime’s fushoji obsessed youngerbrother often fall flat. \\n\\n\r\nAn anime revolving around a married couple is a rarity in anime, and Kaoru and Hajime are certainly a cute and entertaining couple to watch. A few episodes even give the characters develop with the final episode leaving us on an unexpected cliffhanger, which the upcoming season is sure to resolve. After thinking about it, I am a lot like Hajime, almost to a scary degree! It is surprising how relatable he is at times, especially with most of his friends being on the internet (the above gif is my life, haha), although he is more hardcore.\\n\\n\r\nStudio Seven’s animation is simple, yet effective, for a short, and the ending song, \"Iikagen ni Shite, Anata,\" fits the series well with the full version being even more fun (watch it in the full post).\\n\\n\r\nWith a total runtime around 40 minutes, I Can't Understand What My Husband Is Saying is an easy watch if you want a quick laugh. My recommendation is to watch the first episode, and if you like, watch the entire series. \\n\r\n_Watch if you like:_ Otaku Comedies, Mature humor, Marriage jokes,\\n\r\n*-7.0/10*\\n",
            "date": "2015-04-02T06:02:00+00:00",
            "helpful_count": 12,
            "mal_id": 184474,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3578061.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JamestheReviewer",
                "username": "JamestheReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=184474"
        },
        {
            "content": "How often do you see an anime that revolves around a married couple? (And no, don't get me started on that SAO teenage marriage nonsense.) \"ICUWMHIS\" is one of the funniest, most refreshing anime I've seen in a long time, even if the episodes are only around three minutes in length.\r\nThe protagonists, Kaoru and Hajime, are worlds apart personality and lifestyle wise, but they find a way to make it work regardless. As the theme of the show is love and tolerance, each episode chronicles how they get through the hurdles of life together. There's a surprising amount of character development, despite of the showsshort length. This is attributed to the show's great writing and characterization. \\n\\n\r\nThe often hilarious writing is often intertwined with visual and even sound gags. Many of the visual gags pay homage to other anime and manga, which will make for a great Easter egg game for veteran anime fans. The sounds from this show have been put to great use as well. Whether it's parodying a musical score from popular culture, to the sounds of a jackhammer (!?!) during sexy time. It's a funny show regardless, but there may be some jokes that fly over your head if you're not a hardcore anime fan. \\n\\n\r\n\"ICUWMHIS\" is a fantastic show and a definite forerunner for all the 3-minute anime shorts. It's easily recommendable to adults, especially those in a relationship, but I believe everyone should give this show a chance. It's just too good to pass on!\\n\\n\r\nStory: 9\\n\r\nArt: 6\\n\r\nSound: 9\\n\r\nCharacter: 9\\n\r\nEnjoyment: 10\\n\r\nOverall: 9\\n",
            "date": "2015-04-17T13:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 185820,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3826737.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Flexicute",
                "username": "Flexicute"
            },
            "url": "https://myanimelist.net/reviews.php?id=185820"
        },
        {
            "content": "To start this review off, in my standard of what i like, or what i claimed to think that a certain comedy is prolly the funniest for me. The pervy ones gets me. This is probably why i rated this anime so high at a 9 out of a fucking 10. However, since two years ago, i was not this kind of a guy who likes pervy jokes, sign jokes that implicates sexual things, and so forth. But once i step foot into the world of Otaku, or the hentai fest. I found myself lusting over 2d girls more than 3d girls (girls irl). Soi found myself finding real life girls not so attractive as the 2d ones. Since 2d tend to be more perfect than a 3d girl. And yeah, i just, for some reason, told you my life story as to how i became perverted, and getting into loving 2d girls more than 3d girls. BUT, NONE THE FUCKING LESS!\\n\\n\r\nI would personally give this anime a 6/10 if i was new to the overall pervy jokes, lolicons that have such a very strong sex drive (both yaoi, and incest...), facts about \"6 hours of sexuality, and hand signs for sexual jokes. But since I adapted into the environment of what most anime tend to bring along with their ecchi, and pervy fest. I could pretty much resonate this anime with how an otaku may actually lead their daily lives, doing sex, and play computer all day long (like a neet, or a lazy unemployed man), but still deep down cares for his own wife or his loved intimates. Some otaku can ofc be overly dependent on their intimates to take care of them, while some are actually pretty reliable, and hardworking (in term of minority maybe). And I could understands how their psychology goes, given the ways the author (otaku that's writing the story) feels about the feeling of loliness, and feeling loss as to who they are in life and existence. And we all know about Otaku's devotion of their idol and waifu right? Their loyalty are pretty hardcore if you actually sees how they lead their lives. So i could actually picture them showing great loyalty, and devotion to their actually love ones. Even if they have Mashiro-tan/or any other ones (MC's waifu) in their 2d world. And btw our MC is a lolicon hehe xd. But since this anime is 217 second per episodes. (217second/1episodes)*13 episodes = 2821 seconds.\\n\\n\r\n 2821seconds / (60 seconds /1min) = 47 minute. Oh shit wait. The ED is 37 second-ish. So let's do more math. (37seconds/1 episodes) * 13 episodes = 481 seconds.\\n\\n\r\n2821 seconds - 481 seconds = 2340 seconds.  2340 seconds/ (60 seconds/1min) = 39 minute.\\n\\n\r\nOH SHIT. THAT WAS EXACTLY 39 FUCKING MINUTE XD. It was a perfect whole number. Oh wait. I think the ending song was originally 37 seconds. FML ASJDISAJDIPAJWIPOEJQPIEJIODJSAIDJSAKLDJ. All these fucking maths just because i didn't realize it while i do the calculation. ffs\\n\\n\r\nSo Yeah, this season 1 has 39 minute of an actual content. But it's worth it. \\n\\n\r\nShort but cute, funny, entertaining, unexpected, pervy jokes that will make people laugh, or some european, and those that are unfamiliar with these sorts of entertainment in our society today may find this offensives. So they despise the anime for it. I mean standup comedian does those kind of jokes all the time. Was that influences by the japanese otaku culture? HELL NAH. For those that might get creep out by this anime. Please look at all of those disgusting, and stupid horror movies in many different sort of film, stupid high school college (which usually lead to sex with some hot girls), unnecessary sex scene that has nothing to do with the story, and romance involving S&M, or purely by carnal desires and lust. It's in our human nature. It's a part of us. It might seem animalistic, but according to everything we do as a human. It's all an animalistic senses of \"survival of the fittest\" and shit like that.Eating animal for survival that's one. Killing one another out of pure hate, or rape one another out of pure lust is more. While the feeling of wanting to kill a person, no matter how you hate them is animalistic. But since it's not allowed to do so by the law of humanity (which states that no animalistic act should be committed to one another). We tend to avoid to those indulgence and savage thoughts. And we even find savagery, evil, badboy, bad girl, or even satan as somethings that one might say that they are cool, or worth the time creating a cult over it. It's simple. \\n\\n\r\nBut since this anime is just a simple 3 min per episode. There's really not much of a story within it. However, there're character development just like in any other anime. But i would personally enjoy seeing a 24 minute episode of this anime just for the sake of watching it for fun, and for entertainment. Like for real man... But to sum it up, this is a pretty funny show to watch. It has both emotional moment, comedy that some people who aren't familiar with references of Japanese puns, sexual/pervy jokes and hand movement, anime, or hentai (ones in ep1. One of the black girl in ep1 was from Kuroinu hentai btw ;)). \\n\\n\r\nIf you're a standard, or new to these pervy joke and cuteness in most of things that you tend to see on the internet, anime, or the media. Then an anime of this rating would range around 6-9.\\n\\n\r\nBut if you're familiar with those kind of things, and find those kind of jokes funny as well. This anime has done its jobs pretty well. And my personal score of it would be 9/10 based and according to my personal enjoyment of the show. An anime of these kinds are not usually measured by the story. But rather focused more towards character development and relationship, rather than the core of what makes a story, a story orientated plotline dependent. Just check it out tbh. Dont think of it as being forced, but as an excuse to check an anime out. And btw, people who are lonely tend to want to have sex with one another tons of times. That's why most otakus are perverted in nature they're not familiar with women, nor socialized with other people. So they tend to value their relationship, in a way of satisfying their lust. Because, Otaku faps alot. Lonely people does so too <3",
            "date": "2016-08-12T23:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 226622,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=226622"
        },
        {
            "content": "Since this serial has only 3-minute episodes i'll make a short review\r\nFirst: this show is realy enjoyable, short and i would recommend it to basically anybody\r\nIts funny and simply has a good feeling.\r\nThe art isnt outstanding at all but the art bascially doenst matter \r\nThe Characters are really well done, especially both main char's\r\nThe girl is looking good but is kinda bored of life and alone \r\nThe boy is an otaku ( speaking for itself) he doenst realy have many friends etc\r\nThroughout the show you'll notice that not only one characters likes the other one but both realy LOVE eachother. its not like these simpleteenie loves. its a realistic love where both can rely on eachother and thats why its so nice to spectate their development.\\n\\n\r\n9/10 obviously 3 minutes, sound not outstanding but realy give this a shot.",
            "date": "2015-05-07T07:30:00+00:00",
            "helpful_count": 9,
            "mal_id": 187291,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486457.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zurku",
                "username": "Zurku"
            },
            "url": "https://myanimelist.net/reviews.php?id=187291"
        },
        {
            "content": "After watching the last episode, I can finally say that this anime was just fine. I think it would have been better if it had a longer running time comparative to a 12 episode anime to really flesh things out. It does things so fast that you don't have enough time to really get to know or at least enjoy the characters. The story was interesting, but was far too short to really get much out of it, except the last episode and the one primarily involving the wife's past. Art is generic moe-esque. Sound.....I don't really remember hearing any music, everything else is theusual background or sound effects. The characters were a fine change of pace compared to other anime, or at least most of the time, ones you get further and further down the ladder of characters, they all seem to just be 1 dimensional (the wife of this guy, the husband of that lady, the friend of that one dude, etc etc). I enjoyed it fine. Overall I give this episode a 6 out of 10.",
            "date": "2015-01-04T23:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 176279,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2113377.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tempest_Wing",
                "username": "Tempest_Wing"
            },
            "url": "https://myanimelist.net/reviews.php?id=176279"
        },
        {
            "content": "This anime is like a roller coaster to me, bringing me happiness and lots of laugh while feeling a sad aura to it. Why? Let me explain. I Can't Understand What My Husband is Saying is about a woman named Kaoru with her otaku husband Hajime. No matter how eccentric Hajime is, Kaoru still loves him, no matter what. And although Hajime is known to have an obsession with anime, he still has his heart with Kaoru. They stay in synch together despite having ups and downs and differences. They accept each others quirks and habits and I know we would all consider that agreat relationship. Despite how goofy this anime is, it really depicted the love these two share, and how (spoiler) Hajime is the greatest thing that has happened to Kaoru, since she had been an alcoholic and been depressed. It shows how love is such a great thing and how significant others are like a big ray of sunshine guarding our meadows. I may be over analyzing such a comedic anime, but this is what it had made me feel.",
            "date": "2015-06-01T05:21:00+00:00",
            "helpful_count": 8,
            "mal_id": 189330,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4649031.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/araphernalia",
                "username": "araphernalia"
            },
            "url": "https://myanimelist.net/reviews.php?id=189330"
        },
        {
            "content": "Most likely one of the best 3-minute anime you will ever lay your eyes upon. It only takes 36 minutes to finish this and it's very well worth it.\r\nNot only is this anime one of many comedy masterpieces I have ever seen, it also addresses problems such as anxiety, addiction to smoking/drinking and many more. I didn't expect to see these kind of attributes in it, but I can't say it ruined the anime since it didn't.\r\nIf we focus on the comedy side, this anime has many jokes and references that would warm any otaku's heart with joy, simply because we can all relate tothe husband of this anime... Not only that but it has a gay brother who looks like a girl and quirky parents, the characters are amazing in this anime. Simply amazing. I could almost say the characters in this anime are better than most people i know in real life. (Yes, I said it.)\\n\\n\r\nAs the wise husband of a slice of life anime once said: '' A SLICE OF LIFE SERIES IS LIKE AN OASIS FOR ME SINCE I DON'T HAVE ANY FRIENDS ''.\\n\\n\r\nAmen.",
            "date": "2015-09-06T07:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 197948,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2684279.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KittyNom",
                "username": "KittyNom"
            },
            "url": "https://myanimelist.net/reviews.php?id=197948"
        },
        {
            "content": "This series asks the question: Can an anime otaku and an office lady find happiness in something as annoying as a \"marriage?\"\r\nWell; depending on how a person views marriage, mileages may vary. But I can think of only a few people in the world who can make it as entertaining as Yukari Tamura (Nanoha \"White Devil\" Takamichi, When They Cry's Rika) and Kenichi Suzumura (Seed Destiny's Shinn Asuka, Tsukihime's Shiki Touno).\r\nAlthought I think the show had been killed by Youta, Hajime's little brother. This \"little boy wanting to be a little girl\" just took that show over and \"spanked it until it became useless.\" (Idon't know which is worse anymore. Kids in the US shooting themselves and getting shot by others, or gender confusion?)",
            "date": "2014-12-25T17:37:00+00:00",
            "helpful_count": 7,
            "mal_id": 174297,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=174297"
        },
        {
            "content": "The major downside many people likely see with this work is that they are shorts (-5 min in length) as opposed to full length episodes (~30 Min). I find that this is one of the more appealing points of the show seeing as how this is based on a the manga which is comprised almost entirely of shorts.\r\nGenerally speaking however, the lack of a solid (or more obvious) central story is a major point that will put a lot of people off making them feel like they just wasted the last hour of their lives. Couple this with more or less average sound and artworkthat seems to take a bit of a dip during some of the 'Flashback' episodes and you've got yourself a slightly less than average animation.\\n\\n\r\nDespite all of these short comings the show is still a great one. The character design and voice acting is perfect for this show and to me, that along with the humor brought by nature of what the show is based off of makes this a show worth watching.",
            "date": "2015-04-05T11:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 184843,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1064441.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mugetsu13",
                "username": "mugetsu13"
            },
            "url": "https://myanimelist.net/reviews.php?id=184843"
        },
        {
            "content": "Now Fully watched!\r\nAnd why 10? Because it is, in its simplicity, simply delicious! And in my case, well, you see, I am married, and my wife is so NOT into anime it was an issue at first (now solved, as she even helps me tender my figure collection! Though she cracks jokes about \"oppai\" sizes and such XD) so in some parts I could just see my wife there,it was just hilarious! Also the ending song is s sweet and engrossing as well.\r\nThe situations they depict are not only in Japan anyway in regards as how anime fans are seen, and the jokes and thefeel of every episode is just tender, hilarious and even when with sexual inuendo or \"direct message approach\" it is nos gross nor disturbing, but really funny to see.\\n\\n\r\nOf course my personal view has its own spice due real life experience, and that adds a ton to it XD\\n\\n\r\nArt is cool and cute, conveying the right feel to the story.\\n\\n\r\nSometimes simplicity is the key to absolute success!\\n\\n\\n\r\nAnyway that is my impression after watching 7 little eps, and I am now eagerly awaiting the rest. A Gem in any Anime Collector who seriously love Anime and all related to it!\\n\\n\r\nReviewed as before as my opinion held from first to last episode. \\n\\n\r\nThis is, in its simplicity and conduction, a real masterpiece!",
            "date": "2015-01-02T10:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 175753,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/135660.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/VoidHawk",
                "username": "VoidHawk"
            },
            "url": "https://myanimelist.net/reviews.php?id=175753"
        },
        {
            "content": "FULL DISCLOSURE: I have not read the original 4-koma. I strongly recommend watching this as it is really short and enjoyable.\r\nART+ANIMATION:\r\nIt’s a 4-koma based anime, so the art won’t be amazing. That being said, everything looks purposeful and there are no outstanding omissions. There are moments within the story with strongly different art / animation to match the situational comedy and they all work well.\r\nThe animation is standard-issue for this genre. However, there is one episode that uses its own dreary feeling animation style for a character development flashback - I think its use was well-suited. There are even a few scenes where the animationfunctions well as a metaphor for the situation.\\n\\n\r\nNothing worth mentioning about sound or music. As is the norm, the music merely fits the moods.\\n\\n\r\nSTORY:\\n\r\nThe story is about a mid-20’s couple consisting of a nerdy guy and a ‘normal’ girl. Thankfully, the husband’s nerdiness for the most part only influences his personality so that it doesn’t get too old too quickly. It’s very episodic with the general contents of each episode not having much effect on the others, but there is also a lot of continuous building of the plot. \\n\\n\r\nOf course most of the episodes are about their antics or daily life activities, no surprise there. What’s new at least to me is that the situations are much more interesting than the plethora of middle-/high-school student SOL, thanks to the mid-20’s couple. Being in that stage of life, many of the situations are relatable to me personally.\\n\\n\r\nCHARACTERS:\\n\r\nThe character design in a SOL 4-koma is very basic, but I like the faces and expressions. Definitely moe-style but here it’s not a bad thing.\\n\\n\r\nAs fitting for a 4-koma, many of the supporting characters exist only to suit a certain running gag or two, but nothing is too overdone. There are some other good, normal interactions within them and the main characters.\\n\\n\r\nDespite being episodic, there is some real character development going on, and some of it really hits home hard. Both husband and wife have real life problems, and you learn that the wife is not nearly as normal as you were earlier led to believe.\\n\\n\r\nKugimiya Rie is a voice actor in the show (not too often) – I like her in case you can’t tell. Aaanyways… the voice acting is well-fitting to the characters, so no bad marks there.\\n\\n\r\nENJOYMENT:\\n\r\nThere are some pretty good jokes and references included, and the way some of them are portrayed in such a mundane setting makes it even more entertaining. Of course, some references fly right over my head either since I’m not Japanese or familiar with many of the reference material, but thankfully I don’t feel too left out. \\n\\n\r\nDespite the episodes only lasting three minutes each, they are not sped way up to fit everything which was the right decision for the content and mood. Having a show of this format include some pretty serious character development was a welcome surprise.\\n\\n\r\nOVERALL:\\n\r\nGreat short story with some good character development. The humor is right up my alley. The art is nothing special but the focus is more on the main characters than anything else.\\n\\n\r\nTL;DR:\\n\r\nCute, funny, with some deeper, young couple topics. Watch it.\\n",
            "date": "2016-12-10T11:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 235203,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235203"
        },
        {
            "content": "I started watching this anime for being small, I thought the story would be boring, that not give attention to the anime, but it was quite the contrary, this is one of the best novels I've ever seen, tells Hajime story that did not have a girlfriend and I did not know how to get one and Kaoru who was afraid to stay sosinha forever, if you think what happened that beautiful marriage proposal, it was actually a very simple thing, it just asks her to marry him and she accepts, very simple, funny.\r\nHajime is not a husband for example, that has a decent joband be presentable to friends, but he always does everything to Kaoru, always trying to be a better husband, they will have a funny story of romance, although he was funny and always be on the computer, it's attention to his wife, she realizes that he is the best for her and the romance at first thought it would be just to spend time becomes one of the best attended, a novel that is exemplary and can be better than many huge anime that has around, 100% recommend you watch, will not take very little of your time and you realize that it was worth.\\n\\n\r\nSorry if I was not clear on something, my English is not entirely fluent. =)",
            "date": "2016-07-16T13:49:00+00:00",
            "helpful_count": 5,
            "mal_id": 224179,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4923924.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KaiqueCW",
                "username": "KaiqueCW"
            },
            "url": "https://myanimelist.net/reviews.php?id=224179"
        },
        {
            "content": "Overall, the story has an interesting concept, and regardless of being short it's an enjoyable series. Throughout the entire story, we see Kaoru dealing with her otaku husband, who only seems to be interested in the anime world. It's funny how we see Kaoru's reaction, to her husband's somewhat addiction to anime, and it's quite adorable, how she tries her best to distract him, and bring him back to reality, through various means. I'm yet to watch the entire series, but I will certainly watch it till then end. This is defiantly, an anime that is worth watching, if you want something quick and funnyto watch.",
            "date": "2018-05-07T03:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 279984,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178075.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hime-han",
                "username": "Hime-han"
            },
            "url": "https://myanimelist.net/reviews.php?id=279984"
        },
        {
            "content": "Even though there are a lot of other reviews already, after watching this show and really enjoying it, I felt a little obliged to write if only but a few lines about it.\r\nThis is quite a funny series of short episodes based on an idea of an otaku actually marring someone and having his own kind of a family life. It turned out to be really funny with it's simple and straightforward humor and parodies, yet the show has an actual plot line with a logical and solid conclusion. \r\nThe artwork is really cute and nice looking, having it's own style. Though, being a short,it's not surprising to see most backgrounds reused and often blurred, although the are a few quite detailed ones. The other aspects are just decent, witch is acceptable for such type of a show.\\n\\n\r\nThe VA is satisfying, as for the music, aside from the ED, there isn't much of it. Sound effects are okay too. \\n\\n\r\nSpeaking of characters, they are fine too, though just a cardboards, aside from two main characters, that get some development and backdrop. Then again, it's mostly a simple comedy, so it'd be rude to ask for much.\\n\\n\r\nIn the end, this is a comedy slice of life show, and I did enjoy it and laughed during almost every episode. It was over before I knew it.\\n\\n\\n\r\nSTORY: 6/10\\n\r\nPremise: 1/2 — A cool and simple idea.\\n\r\nPacing: 2/2 — Really good.\\n\r\nComplexity: 1/2 — None whatsoever.\\n\r\nPlausibility: 1/2 — There is a reason when they're not joking around.\\n\r\nConclusion: 1/2 — Not explicitly stated, but satisfying.\\n\\n\r\nARTWORK: 6/10 \\n\r\nGeneral Artwork: 2/2 — Good production values.\\n\r\nCharacter Figures: 1/2 — Cute and basic.\\n\r\nBackgrounds: 1/2 — Simple with a few detailed ones.\\n\r\nAnimation: 1/2— Basic, though works well.\\n\r\nVFX: 1/2 — Nothing too impressing.\\n\\n\r\nSOUND: 4/10 \\n\r\nVoice Acting: 2/3 — Pleasant to the ear.\\n\r\nMusic Themes: 1/4 — Not much of it, just the ending theme.\\n\r\nSFX: 1/3 — They're there.\\n\\n\r\nCHARACTER: 4/10 \\n\r\nPresence: 1/2 — Nice cardboards.\\n\r\nPersonality: 1/2 — Simple.\\n\r\nBackdrop: 0/2 — A minimum of it.\\n\r\nDevelopment: 1/2 — There is some for the main pair.\\n\r\nCatharsis: 1/2 — A little one.\\n\\n\r\nVALUE: 4/10 \\n\r\nImportance: 1/3 — A good short that can be recommended in some cases.\\n\r\nRewatch value: 1/3 — It's funny and short and well-done.\\n\r\nMemorability: 2/4 — Good work for it's medium.\\n\\n\r\nENJOYMENT: 7/10 \\n\r\nI really laughed a lot at its simple humor and enjoyed the few touching scenes. \\n\\n\r\nVERDICT: 5/10 (5.16)",
            "date": "2018-05-05T16:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 279858,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6726462.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/N0Mi0",
                "username": "N0Mi0"
            },
            "url": "https://myanimelist.net/reviews.php?id=279858"
        },
        {
            "content": "I've made it a habit this year to watch at least one TV short series each season, and I definitely plan on keeping this pattern going because you never know what exactly you're going to get out of a short series other than time well spent. From the creative nonsense of Tonari no Seki-kun to the bone-chilling terror of Yamishibai: Japanese Ghost Stories, there is a surprising amount of variety to be found in the TV shorts category of your anime listings. So, how did my TV short pick for this season turn out?Our story is fairly simple: a woman named Kaoru fell in love with and married an otaku named Hajime, and the series focuses on some of the quirkier moments of their life together, sort of like a better written Insufficient Direction. Within these four-minute episodes are two general types of comedy: otaku-themed humor and general married life humor, both of which are executed surprisingly well. I extracted quite a bit of enjoyment out of an extremely unsubtle Evangelion reference, but also found the home life confusions of a newlywed couple to be both charming and sometimes even a bit heartwarming. Both Kaoru and Hajime are solid characters as far as TV shorts go, and the only real annoyance I found was with one of Hajime's siblings, whose introduction was...stereotypical in anime style for this character's personality.\\n\\n\r\n          The animation was produced by Studio Seven (Inugami-san to Nekoyama-san), and is played off as very cutesy and basic without ever seeming like the budget was being stretched. I also noticed that there seemed to be a bit of a glow to each frame that made it feel almost welcoming like the doorway to a new home. The soundtrack was composed by G-angle and...it was there I guess. Nothing spectacular, but it filled in the silence well. There was no opening theme, but the ending theme \"Iikagen ni shite, Anata,\" as sung by the two lead VAs, was excessively cute and catchy.\\n\\n\r\n          Overall, this is definitely one of the better short series I've seen this year, and I can't wait for the second season to come out next spring.",
            "date": "2014-12-25T22:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 174321,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3337767.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/emberreviews",
                "username": "emberreviews"
            },
            "url": "https://myanimelist.net/reviews.php?id=174321"
        }
    ],
    [
        {
            "content": "Literally you can get this show done in an hour.\r\nThe plot of \"I can't understand what my husband is saying\" is about Kauro, an office lady, and her husband Hajime, an otaku who makes money as a blogger, and their lives as a married couple. The show has decent humor in it making it very enjoyable. Not only that, it's kind of interesting how the show tells their lives as a couple in only about three to four minutes.\r\nIf want to watch a quick and very enjoyable anime. I recommend \"I can't understand what my husband is saying\".",
            "date": "2015-01-03T05:59:00+00:00",
            "helpful_count": 311,
            "mal_id": 175901,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3886845.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Anthony_DiGrande",
                "username": "Anthony_DiGrande"
            },
            "url": "https://myanimelist.net/reviews.php?id=175901"
        },
        {
            "content": "It can be quite easy to let your prejudices get the better of you. Opening your arms to something new, only to encounter the same things time and time again. Your expectations become lower and lower, until they become so low they no longer justify the effort of trying anything new in the first place. The reliance on the same old ideas and lack of creativity becomes so frustrating that even reading descriptions of new things annoys you. You have become a cynic.\r\nIf there were ever an anime to be cynical about, Danna ga Nani wo Itteiru ka Wakaranai Ken would be it. The seriesis about an office lady married to an otaku, and explores the conflict between these lifestyles in a light hearted and humorous way. There are quite literally no stories about otaku which do not deal with this conflict; it is the only thing which distinguishes them as a group from the rest of society. In practice it amounts to little more than perpetuating stereotypes now so sharply defined that any variation from them would subtract from their authenticity. There is nothing more that can be done in Otaku parody, and nothing about it that has been left unsaid. If that were not reason enough to be cynical about Denna, this isn't even the largest obstacle that it faces. Denna is not a full length tv series, or even an OVA: it is a series of thirteen five minute shorts. The limitations this creates are rather more intrinsic than the subject matter; producing something genuinely worthwhile in this format is an exceptionally difficult task, as is evident from previous examples. Most abandon all hope of telling any overarching story, and focus instead either on single scenes or random batches of gags. Productions in this format never amount to anything more than a minor distraction.\\n\\n\r\nWho'd have thought that being proven wrong could ever feel this gratifying?\\n\\n\r\nDenna ga Nani wo Itteiru ka Wakaranai Ken achieves more in its short running time than many full length series do across their entire run. It begins with an introduction to our leading characters, office lady Kaoru and her otaku husband Hajime. We expect that much will be made of their imagined lack of compatibility, and while not entirely wrong about this, there is evidence that there is more between them than meets the eye. That they are not paired for the sake of comic effect but there is a real connection between them.\\n\\n\r\nThe next episode introduces Tadashi, Hijeme's ambiguously gendered sibling. He has an incestuous attraction to his brother which brings the series a significant step closer to the dreaded otaku parody genre. His character appears again throughout the show, primarily as (unwanted) comic relief but also as a source of character development, providing an important link to Hajime's past and an overseer of their entire relationship.\\n\\n\r\nAs the series progresses, more and more time is focused on developing the relationship between Hijeme and Kaoru, which is interesting for a number of reasons. Romance stories about established couples are somewhat uncommon, as are those concerned with people in their late twenties and early thirties. Melodrama is sidestepped and instead we can examine the less often discussed process of two formerly independent people living together and eventually becoming a family, where far more is at stake and so much more can go wrong. \\n\\n\r\nThis isn't the only sign of a more mature romantic outlook in Denna. It would be incredibly temping for an anime like this, featuring a relationship between an 'otaku' and an ordinary person, to depict it as one sided. There is no shortage of anime which depict relationships as 'long suffering woman takes pity on unappealing male' or Hijeme as 'Almost unbearable man with a heart of gold'. While perhaps these scenarios provide some potential for comedy, they are completely removed from reality. Few people would consider marrying someone unless they believed they were in love with them. Denna recognises this and takes the time not only to explain what Kaoru sees in Hijeme, but the equally important question of what he sees in her. Because Kaoru has faults too. She smokes a lot. She drinks too much. She experiences loneliness. This focus on the emotional bond between Kaoru and Hijeme continues as the series edges toward its conclusion.\\n\\n\r\nThen something completely absurd happens. Something so unbelievable, I find myself struggling to even write it down. What happens at that point is basically this: a thirteen episode series of three minute long anime shorts taking a humorous and light-hearted take on the relationship between a hardworking office lady married to an otaku, caused a fully grown man to start trying to fight back the tears in his eyes.\\n\\n\r\nThough Denna's brilliance was not something I would ever have expected, fortunately it is something which can be explained rather easily: it treats its characters like people, and its audience like adults. The more these principles are followed, the more we shall get to enjoy those blissful moments. The human ones.",
            "date": "2015-02-04T20:12:00+00:00",
            "helpful_count": 199,
            "mal_id": 179689,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/233469.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnnoKano",
                "username": "AnnoKano"
            },
            "url": "https://myanimelist.net/reviews.php?id=179689"
        },
        {
            "content": "To establish a believable story is a difficult feat and yet this show manages to pull it off rather effortlessly. With a mere 3 minutes per episode, Danna ga Nani wo Itteiru ka Wakaranai Ken manages to accomplish what most other slice of life shows do not.\r\nWhile the premise, at first, seems tired and tedious the palpable chemistry between the contrasting protagonists leads to one of the most sincere representations of modern married life in anime. Their interaction feels real and wholesome, without being forced and unnatural. The characters have a sense of development, which helps give purpose to their lives, resulting in a surprisinglyimmersive experience.\\n\\n\r\nNow while the majority of the show can be thought of as an episodic endeavor, there are several over-arching narrative themes that are portrayed rather well, with an extremely gratifying conclusion. The show manages to remain comedic, without having to resort too much on tacky slapstick humor. \\n\\n\r\nThere are several elements of drama which are presented, without hindering the overall tone, that keep the show interesting. Otaku culture is also a prominent theme and as such there are several references to other real-world shows, which further enhance the experience.\\n\\n\r\nThe art-style and soundtrack are about average at best, however, considering the scope of the show it seems appropriate.\\n\\n\r\nThe show’s simplistic premise and execution make it extremely enjoyable, and while the comedy might not suit everyone’s tastes, it’s definitely one of the better shows the slice of life genre has to offer.",
            "date": "2015-03-30T09:49:00+00:00",
            "helpful_count": 58,
            "mal_id": 184096,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4383037.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dgtl13",
                "username": "dgtl13"
            },
            "url": "https://myanimelist.net/reviews.php?id=184096"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nIt's funny how compartmentalized life really is. When you get right down to it, it's a bunch of connected events that have a certain amount of significance. Being born, losing that first tooth, passing that big test, graduating college; there are endless but meaningful happenings that occur that shape the course of the life we take. A rather large one is the decision to bind oneself to another person \"until death do they part.\" Otherwise known as marriage, it is a day usually considered the biggest when it comes to a relationship. For I Can't Understand What MyHusband Is Saying, marriage is only the beginning.\\n\\n\r\nSTORY\\n\\n\r\nICU (need to shorten it at this point!) begins with Hajime and Kaoru's wedding day. After a short honeymoon, the show follows their life on a day-to-day basis.\\n\\n\r\nThis one isn't your typical anime; running at about three to four minutes per episode, it's incredibly short. One can sit down for less than an hour and finish the entire season. Sounds trivial, but that's part of its appeal. Not worrying about incredible world-building or intense drama, ICU opts for a healthy dose of comedy and heartfelt moments. And due to the length of the show, it works very well. It adopts referential humor, word-play, and dialogue jokes in very quick succession. The fast-paced comedy is owed to the time-constraint that the anime imposes on itself. It's executed nicely, causing a high amount of potential laughs from start to finish.\\n\\n\r\nWhat's strange about ICU is its ability to inject rather touching scenes throughout the season. The comedy is done well, and so are the more \"real\" sections. The show looks at differing aspects of what married life is like: finding a new job to support each other, caring for your loved one when she's sick, and reminiscing about that first date. They're simple \"Aww!\" moments, but they give Hajime's and Kaoru's relationship more significance than just \"otaku\" and \"hot chick.\" They're able to joke with one another because of the relationship they share. Simultaneously, they can demonstrate their love with the more sincere and simple actions that they take.\\n\\n\r\nAlluding back to my little preview, life is a series of events. Marriage is a big one, but it's not the last. There are other, rather obvious, developments that take place later on down the road, and ICU explores these as well. Having sex, changing habits, and thinking about having children are acts that take place because of what occurred before. Marriage does this; a person is no longer living for one's self anymore, but is instead living for each other. As a couple who completely \"get\" one another, they are able to progress through these new events not as individuals, but as one cohesive unit.\\n\\n\r\nANIMATION\\n\\n\r\nICU literally doesn't have much time to show off. The art style has this weird \"clouding\" effect on the edges of the scenes, making it appear is if what one is looking at isn't an anime so much as it is a thought taking place in the mind. The show incorporates an okay amount of differing locations, from the married couple's apartment to cities and restaurants. Nothing is too detailed, giving the anime a rather plain look. This doesn't necessarily hurt it, though; in fact, it adds to the already mellow and calm feeling that permeates the show.\\n\\n\r\nThe character designs are simple as well. Hajime's frazzled hair, foggy glasses, cat-mouth, and green t-shirt paint him as the every-man. Kaoru's pink sweater, blonde hair, and large bust make her out to be quite the attractive wife. The rest of the cast are given small details as well, such as Destiny Fucker's shades or Youta's ponytail.\\n\\n\r\nThe actual animation follows the same routine. With low animation quality, it uses this to its advantage by making the characters move in funny or non-fluid ways, adding to the comedy overall. The quickness of the show itself also allows such minimal animation to work, relying more on viewing or hearing the joke for that particular scene, as opposed to watching it play out.\\n\\n\r\nCHARACTERS\\n\\n\r\nICU understandably focuses on Hajime and Kaoru exclusively.\\n\\n\r\nAs the husband, Hajime is always looking out for Kaoru. An anime-watching, 2D-loving, manga-reading \"otaku,\" his description makes one wonder just how he managed to land a girl like Kaoru. But it's evident as to why: he's caring, thoughtful, loving, and willing to be the man that she needs. He loves kids and prefers to enjoy life with his wife rather than with anyone else. Having almost zero friends, outside of his darling and his younger brother, his tendency for anime-related products makes him a bit of an odd-ball. He does what he can to support Kaoru, making it clear just how great of a guy he really is.\\n\\n\r\nAs the wife, Kaoru is always listening to Hajime. Lacking confidence, bad at cooking, and a smoker, she also doesn't seem to be the kind of person who could be fallen for. But as the saying goes, \"opposites attract.\" By marrying Hajime, Kaoru receives a boost in her self-esteem, she betters herself by wanting to cook more, and drops her bad habit in order to keep her healthy and Hajime happy. Apologetic at times but a sexual deviant when drunk, she's a sweet woman who is eternally grateful to have the love of her life next to her. Despite the show's fast-paced feel, the audience gets to witness her ascent from a lonely, brooding, in-denial mess into the happy, content, and understanding wife that she is today.\\n\\n\r\nThe rest of the cast are technically forgettable, but on purpose. Youta is the \"trap\" brother used for sexual jokes, Destiny Fucker has a ridiculous name, Rino's shortness is teased, and Hajime's mother and Kaoru's father are overbearing. There are a few more, but they all follow the same trend: a simple quirk that is joked about once or twice. Not utilizing the side characters extensively actually aids the ensuing hilarity, because they never feel overused or old. They show up, make their joke, and leave.\\n\\n\r\nEarlier, the word \"understanding\" was used in conjunction with Kaoru's development. It's an important word; after all, it's literally in the title. And it's an interesting one at that, too. \"I can't understand what my husband is saying\" isn't really a famous phrase so much as it is a statement about liking a hobby. Anime, sports, and cars may be examples where the wife utters this. But isn't that bad? The wife not being able to understand what her husband is saying, what her husband enjoys, seems rather rude. And to an extent, it is. But the purpose here isn't that Kaoru can't communicate with him, it's about her trying to. She may think he is speaking gibberish, but she listens, interprets, and reacts to what he says rather than flat out ignoring him. It works the other way as well; Hajime's caring and support for his wife shines through despite him naming off Evangelion character names. For both, the adage \"actions speak louder than words\" rings true.\\n\\n\r\nSOUND\\n\\n\r\nThere actually isn't an OP for ICU. This is the right choice; an OP would make the episodes too short to even consider it a product worth watching.\\n\\n\r\nThe ED is really not that good. It's somewhat cute, with Hajime and Kaoru singing alongside one another and in unison. The beat, unfortunately, is generic and the instruments are loud, making it rather unpleasant to hear.\\n\\n\r\nThe soundtrack contains hard guitar segments for the scarier moments, fun little beats for the comedic ones, and chime-filled, violin pieces for those touching scenes. A fine soundtrack for what it is, but nothing worth listening to outside of the show itself.\\n\\n\r\nVoice-acting sees average to above-average performances across the board. Special shout-out to Kenichi Suzumura as Hajime.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one is actually quite appealing to the adult crowd (myself included). Marriage talks, sex, kids, work, familial issues; it contains an assortment of dilemmas that the older crowd generally have to deal with that the vast majority of anime watchers do not. It's always an interesting gamble when a show decides to forego flashy effects and super sexualized females in favor of having the couple visit the wife's father for cooking lessons. Luckily, in this case, the risk pays off.\\n\\n\r\nI'll admit that I didn't understand every single reference that the show threw out at me, but for the ones that I got, it was quite funny. This, in tandem with the word-play and other gags, usually had me laughing a bit for each episode. Youta's incessant incest, Kaoru's drunken \"jackhammer,\" and Hajime forced to go with \"hand over hole\" were good comedic moments. Each of these is small and quick, making the experience never a dull one.\\n\\n\r\nAs a final note, my favorite episode was number eleven. With the different art style, character exploration, and ultimate message given, it not only sticks out from among the comedy that the show offers, but also is incredibly heartfelt to see.\\n\\n\r\nI Can't Understand What My Husband Is Saying is the start of a family. It's swift, it's cute, and it warms the soul. There really is no reason to not give Hajime and Kaoru just a few minutes of your time.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, comedic, touching, mature\\n\\n\r\nAnimation: Good, art and animation are simple but work\\n\\n\r\nCharacters: Good, Hajime and Kaoru make a cute couple, side cast utilized appropriately\\n\\n\r\nSound: Fine, no OP, bad ED, okay soundtrack, average VA work\\n\\n\r\nEnjoyment: Good, adult-oriented, quirky, and sometimes profound\\n\\n\r\nFinal Score: 7/10",
            "date": "2015-01-01T19:25:00+00:00",
            "helpful_count": 41,
            "mal_id": 175649,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=175649"
        },
        {
            "content": "I'm not a fan of shorts, but when this show came along, I didn't know what to expect, but damn, now I feel more positive about shorts after watching this, this is gonna be quick review since shorts don't portray much in its categories of story, characters and art. Mainly they're here as an enjoyment, like a break between watching shows. Usually these shorts are streamed multiple times in a week in Japan, while outside of Japan usually we just see it, and usually wait for the next short.\r\nStory: 7/10\r\nSo the story follows the story of a Business Lady named Kaouru who marries an Otakunamed Hajime. The idea is really damn smart, Imagine it, you're hardworking mothatrucka who marries a lazy ass motrucka (no offence). It makes up for some interesting ideas and sounds like a TV show, welp only if this was one. The episodes are usually a singular story per episode where the couple discover something new in their relationship or progress something. Really, there's not much of a story here, but there is good use of it.\\n\\n\r\nCharacters: 7/10\\n\r\nFirst, you got Hajime, our Otaku, a really damn relatable and hilarious character, mainly to his relatbleness (I don't know if thats a word) he's not always lazy, but we do see him at times trying to help out his wife for the better or the worse, sometimes in serious problems and sometimes in some pretty simple and hilarious problems like drinking. \\n\\n\r\nThen we have Kaoru, who usually has problems that Hajime usually help out with, she's usually the sector of the problems but she isn't really useless, she is hardworking but thats what we know.\\n\\n\r\nArt: 9/10\\n\r\nThe animation is really well done here and is pretty artistic, especially one episode where the whole art style is changed into a sketchy animation style which really shows off the show's art style.\\n\\n\r\nSound: 8/10\\n\r\nThe music here is pretty calming and nice, the ending theme is the couple singing to a nice smooth of tune in a slice of life.\\n\\n\r\nEnjoyment: 8/10\\n\r\nThe jokes here are well done and at times outright crazy, it is very well done  and creative, each problem will usually end up in a good way and if not still has some heart to it. It really shines here.\\n\\n\r\nOverall: 7.5/10\\n\r\nThis show is pretty well done and gets it story going. A 2nd season has been announced and will be a full TV series, just what we wanted.The ending is really damn sweet and signifies more thats coming. If you want something heartwarming, short and sweet to watch, ICUWMHIS has got ya covered.",
            "date": "2014-12-27T14:57:00+00:00",
            "helpful_count": 15,
            "mal_id": 174621,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4188619.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JKinky88",
                "username": "JKinky88"
            },
            "url": "https://myanimelist.net/reviews.php?id=174621"
        },
        {
            "content": "Let’s review *I Can't Understand What My Husband Is Saying (Danna ga Nani wo Itteru ka Wakaranai Ken)*. \r\nDanna ga Nani's humor revolves around Otaku jokes and mature humor. Being that the Otaku comedy genre is one of my favorite sub-genres, Danna ga Nani is a series that satisfies my interest in the genre. As with most comedies, Danna ga Nani is often hit and miss; sometimes the jokes hit the mark, while others miss completely. With that said, the more mature humor and marriage jokes are not something you often see in anime, even if many of the jokes involving Hajime’s fushoji obsessed youngerbrother often fall flat. \\n\\n\r\nAn anime revolving around a married couple is a rarity in anime, and Kaoru and Hajime are certainly a cute and entertaining couple to watch. A few episodes even give the characters develop with the final episode leaving us on an unexpected cliffhanger, which the upcoming season is sure to resolve. After thinking about it, I am a lot like Hajime, almost to a scary degree! It is surprising how relatable he is at times, especially with most of his friends being on the internet (the above gif is my life, haha), although he is more hardcore.\\n\\n\r\nStudio Seven’s animation is simple, yet effective, for a short, and the ending song, \"Iikagen ni Shite, Anata,\" fits the series well with the full version being even more fun (watch it in the full post).\\n\\n\r\nWith a total runtime around 40 minutes, I Can't Understand What My Husband Is Saying is an easy watch if you want a quick laugh. My recommendation is to watch the first episode, and if you like, watch the entire series. \\n\r\n_Watch if you like:_ Otaku Comedies, Mature humor, Marriage jokes,\\n\r\n*-7.0/10*\\n",
            "date": "2015-04-02T06:02:00+00:00",
            "helpful_count": 12,
            "mal_id": 184474,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3578061.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JamestheReviewer",
                "username": "JamestheReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=184474"
        },
        {
            "content": "How often do you see an anime that revolves around a married couple? (And no, don't get me started on that SAO teenage marriage nonsense.) \"ICUWMHIS\" is one of the funniest, most refreshing anime I've seen in a long time, even if the episodes are only around three minutes in length.\r\nThe protagonists, Kaoru and Hajime, are worlds apart personality and lifestyle wise, but they find a way to make it work regardless. As the theme of the show is love and tolerance, each episode chronicles how they get through the hurdles of life together. There's a surprising amount of character development, despite of the showsshort length. This is attributed to the show's great writing and characterization. \\n\\n\r\nThe often hilarious writing is often intertwined with visual and even sound gags. Many of the visual gags pay homage to other anime and manga, which will make for a great Easter egg game for veteran anime fans. The sounds from this show have been put to great use as well. Whether it's parodying a musical score from popular culture, to the sounds of a jackhammer (!?!) during sexy time. It's a funny show regardless, but there may be some jokes that fly over your head if you're not a hardcore anime fan. \\n\\n\r\n\"ICUWMHIS\" is a fantastic show and a definite forerunner for all the 3-minute anime shorts. It's easily recommendable to adults, especially those in a relationship, but I believe everyone should give this show a chance. It's just too good to pass on!\\n\\n\r\nStory: 9\\n\r\nArt: 6\\n\r\nSound: 9\\n\r\nCharacter: 9\\n\r\nEnjoyment: 10\\n\r\nOverall: 9\\n",
            "date": "2015-04-17T13:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 185820,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3826737.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Flexicute",
                "username": "Flexicute"
            },
            "url": "https://myanimelist.net/reviews.php?id=185820"
        },
        {
            "content": "To start this review off, in my standard of what i like, or what i claimed to think that a certain comedy is prolly the funniest for me. The pervy ones gets me. This is probably why i rated this anime so high at a 9 out of a fucking 10. However, since two years ago, i was not this kind of a guy who likes pervy jokes, sign jokes that implicates sexual things, and so forth. But once i step foot into the world of Otaku, or the hentai fest. I found myself lusting over 2d girls more than 3d girls (girls irl). Soi found myself finding real life girls not so attractive as the 2d ones. Since 2d tend to be more perfect than a 3d girl. And yeah, i just, for some reason, told you my life story as to how i became perverted, and getting into loving 2d girls more than 3d girls. BUT, NONE THE FUCKING LESS!\\n\\n\r\nI would personally give this anime a 6/10 if i was new to the overall pervy jokes, lolicons that have such a very strong sex drive (both yaoi, and incest...), facts about \"6 hours of sexuality, and hand signs for sexual jokes. But since I adapted into the environment of what most anime tend to bring along with their ecchi, and pervy fest. I could pretty much resonate this anime with how an otaku may actually lead their daily lives, doing sex, and play computer all day long (like a neet, or a lazy unemployed man), but still deep down cares for his own wife or his loved intimates. Some otaku can ofc be overly dependent on their intimates to take care of them, while some are actually pretty reliable, and hardworking (in term of minority maybe). And I could understands how their psychology goes, given the ways the author (otaku that's writing the story) feels about the feeling of loliness, and feeling loss as to who they are in life and existence. And we all know about Otaku's devotion of their idol and waifu right? Their loyalty are pretty hardcore if you actually sees how they lead their lives. So i could actually picture them showing great loyalty, and devotion to their actually love ones. Even if they have Mashiro-tan/or any other ones (MC's waifu) in their 2d world. And btw our MC is a lolicon hehe xd. But since this anime is 217 second per episodes. (217second/1episodes)*13 episodes = 2821 seconds.\\n\\n\r\n 2821seconds / (60 seconds /1min) = 47 minute. Oh shit wait. The ED is 37 second-ish. So let's do more math. (37seconds/1 episodes) * 13 episodes = 481 seconds.\\n\\n\r\n2821 seconds - 481 seconds = 2340 seconds.  2340 seconds/ (60 seconds/1min) = 39 minute.\\n\\n\r\nOH SHIT. THAT WAS EXACTLY 39 FUCKING MINUTE XD. It was a perfect whole number. Oh wait. I think the ending song was originally 37 seconds. FML ASJDISAJDIPAJWIPOEJQPIEJIODJSAIDJSAKLDJ. All these fucking maths just because i didn't realize it while i do the calculation. ffs\\n\\n\r\nSo Yeah, this season 1 has 39 minute of an actual content. But it's worth it. \\n\\n\r\nShort but cute, funny, entertaining, unexpected, pervy jokes that will make people laugh, or some european, and those that are unfamiliar with these sorts of entertainment in our society today may find this offensives. So they despise the anime for it. I mean standup comedian does those kind of jokes all the time. Was that influences by the japanese otaku culture? HELL NAH. For those that might get creep out by this anime. Please look at all of those disgusting, and stupid horror movies in many different sort of film, stupid high school college (which usually lead to sex with some hot girls), unnecessary sex scene that has nothing to do with the story, and romance involving S&M, or purely by carnal desires and lust. It's in our human nature. It's a part of us. It might seem animalistic, but according to everything we do as a human. It's all an animalistic senses of \"survival of the fittest\" and shit like that.Eating animal for survival that's one. Killing one another out of pure hate, or rape one another out of pure lust is more. While the feeling of wanting to kill a person, no matter how you hate them is animalistic. But since it's not allowed to do so by the law of humanity (which states that no animalistic act should be committed to one another). We tend to avoid to those indulgence and savage thoughts. And we even find savagery, evil, badboy, bad girl, or even satan as somethings that one might say that they are cool, or worth the time creating a cult over it. It's simple. \\n\\n\r\nBut since this anime is just a simple 3 min per episode. There's really not much of a story within it. However, there're character development just like in any other anime. But i would personally enjoy seeing a 24 minute episode of this anime just for the sake of watching it for fun, and for entertainment. Like for real man... But to sum it up, this is a pretty funny show to watch. It has both emotional moment, comedy that some people who aren't familiar with references of Japanese puns, sexual/pervy jokes and hand movement, anime, or hentai (ones in ep1. One of the black girl in ep1 was from Kuroinu hentai btw ;)). \\n\\n\r\nIf you're a standard, or new to these pervy joke and cuteness in most of things that you tend to see on the internet, anime, or the media. Then an anime of this rating would range around 6-9.\\n\\n\r\nBut if you're familiar with those kind of things, and find those kind of jokes funny as well. This anime has done its jobs pretty well. And my personal score of it would be 9/10 based and according to my personal enjoyment of the show. An anime of these kinds are not usually measured by the story. But rather focused more towards character development and relationship, rather than the core of what makes a story, a story orientated plotline dependent. Just check it out tbh. Dont think of it as being forced, but as an excuse to check an anime out. And btw, people who are lonely tend to want to have sex with one another tons of times. That's why most otakus are perverted in nature they're not familiar with women, nor socialized with other people. So they tend to value their relationship, in a way of satisfying their lust. Because, Otaku faps alot. Lonely people does so too <3",
            "date": "2016-08-12T23:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 226622,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=226622"
        },
        {
            "content": "Since this serial has only 3-minute episodes i'll make a short review\r\nFirst: this show is realy enjoyable, short and i would recommend it to basically anybody\r\nIts funny and simply has a good feeling.\r\nThe art isnt outstanding at all but the art bascially doenst matter \r\nThe Characters are really well done, especially both main char's\r\nThe girl is looking good but is kinda bored of life and alone \r\nThe boy is an otaku ( speaking for itself) he doenst realy have many friends etc\r\nThroughout the show you'll notice that not only one characters likes the other one but both realy LOVE eachother. its not like these simpleteenie loves. its a realistic love where both can rely on eachother and thats why its so nice to spectate their development.\\n\\n\r\n9/10 obviously 3 minutes, sound not outstanding but realy give this a shot.",
            "date": "2015-05-07T07:30:00+00:00",
            "helpful_count": 9,
            "mal_id": 187291,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486457.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zurku",
                "username": "Zurku"
            },
            "url": "https://myanimelist.net/reviews.php?id=187291"
        },
        {
            "content": "After watching the last episode, I can finally say that this anime was just fine. I think it would have been better if it had a longer running time comparative to a 12 episode anime to really flesh things out. It does things so fast that you don't have enough time to really get to know or at least enjoy the characters. The story was interesting, but was far too short to really get much out of it, except the last episode and the one primarily involving the wife's past. Art is generic moe-esque. Sound.....I don't really remember hearing any music, everything else is theusual background or sound effects. The characters were a fine change of pace compared to other anime, or at least most of the time, ones you get further and further down the ladder of characters, they all seem to just be 1 dimensional (the wife of this guy, the husband of that lady, the friend of that one dude, etc etc). I enjoyed it fine. Overall I give this episode a 6 out of 10.",
            "date": "2015-01-04T23:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 176279,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2113377.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tempest_Wing",
                "username": "Tempest_Wing"
            },
            "url": "https://myanimelist.net/reviews.php?id=176279"
        },
        {
            "content": "This anime is like a roller coaster to me, bringing me happiness and lots of laugh while feeling a sad aura to it. Why? Let me explain. I Can't Understand What My Husband is Saying is about a woman named Kaoru with her otaku husband Hajime. No matter how eccentric Hajime is, Kaoru still loves him, no matter what. And although Hajime is known to have an obsession with anime, he still has his heart with Kaoru. They stay in synch together despite having ups and downs and differences. They accept each others quirks and habits and I know we would all consider that agreat relationship. Despite how goofy this anime is, it really depicted the love these two share, and how (spoiler) Hajime is the greatest thing that has happened to Kaoru, since she had been an alcoholic and been depressed. It shows how love is such a great thing and how significant others are like a big ray of sunshine guarding our meadows. I may be over analyzing such a comedic anime, but this is what it had made me feel.",
            "date": "2015-06-01T05:21:00+00:00",
            "helpful_count": 8,
            "mal_id": 189330,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4649031.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/araphernalia",
                "username": "araphernalia"
            },
            "url": "https://myanimelist.net/reviews.php?id=189330"
        },
        {
            "content": "Most likely one of the best 3-minute anime you will ever lay your eyes upon. It only takes 36 minutes to finish this and it's very well worth it.\r\nNot only is this anime one of many comedy masterpieces I have ever seen, it also addresses problems such as anxiety, addiction to smoking/drinking and many more. I didn't expect to see these kind of attributes in it, but I can't say it ruined the anime since it didn't.\r\nIf we focus on the comedy side, this anime has many jokes and references that would warm any otaku's heart with joy, simply because we can all relate tothe husband of this anime... Not only that but it has a gay brother who looks like a girl and quirky parents, the characters are amazing in this anime. Simply amazing. I could almost say the characters in this anime are better than most people i know in real life. (Yes, I said it.)\\n\\n\r\nAs the wise husband of a slice of life anime once said: '' A SLICE OF LIFE SERIES IS LIKE AN OASIS FOR ME SINCE I DON'T HAVE ANY FRIENDS ''.\\n\\n\r\nAmen.",
            "date": "2015-09-06T07:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 197948,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2684279.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KittyNom",
                "username": "KittyNom"
            },
            "url": "https://myanimelist.net/reviews.php?id=197948"
        },
        {
            "content": "This series asks the question: Can an anime otaku and an office lady find happiness in something as annoying as a \"marriage?\"\r\nWell; depending on how a person views marriage, mileages may vary. But I can think of only a few people in the world who can make it as entertaining as Yukari Tamura (Nanoha \"White Devil\" Takamichi, When They Cry's Rika) and Kenichi Suzumura (Seed Destiny's Shinn Asuka, Tsukihime's Shiki Touno).\r\nAlthought I think the show had been killed by Youta, Hajime's little brother. This \"little boy wanting to be a little girl\" just took that show over and \"spanked it until it became useless.\" (Idon't know which is worse anymore. Kids in the US shooting themselves and getting shot by others, or gender confusion?)",
            "date": "2014-12-25T17:37:00+00:00",
            "helpful_count": 7,
            "mal_id": 174297,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=174297"
        },
        {
            "content": "The major downside many people likely see with this work is that they are shorts (-5 min in length) as opposed to full length episodes (~30 Min). I find that this is one of the more appealing points of the show seeing as how this is based on a the manga which is comprised almost entirely of shorts.\r\nGenerally speaking however, the lack of a solid (or more obvious) central story is a major point that will put a lot of people off making them feel like they just wasted the last hour of their lives. Couple this with more or less average sound and artworkthat seems to take a bit of a dip during some of the 'Flashback' episodes and you've got yourself a slightly less than average animation.\\n\\n\r\nDespite all of these short comings the show is still a great one. The character design and voice acting is perfect for this show and to me, that along with the humor brought by nature of what the show is based off of makes this a show worth watching.",
            "date": "2015-04-05T11:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 184843,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1064441.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mugetsu13",
                "username": "mugetsu13"
            },
            "url": "https://myanimelist.net/reviews.php?id=184843"
        },
        {
            "content": "Now Fully watched!\r\nAnd why 10? Because it is, in its simplicity, simply delicious! And in my case, well, you see, I am married, and my wife is so NOT into anime it was an issue at first (now solved, as she even helps me tender my figure collection! Though she cracks jokes about \"oppai\" sizes and such XD) so in some parts I could just see my wife there,it was just hilarious! Also the ending song is s sweet and engrossing as well.\r\nThe situations they depict are not only in Japan anyway in regards as how anime fans are seen, and the jokes and thefeel of every episode is just tender, hilarious and even when with sexual inuendo or \"direct message approach\" it is nos gross nor disturbing, but really funny to see.\\n\\n\r\nOf course my personal view has its own spice due real life experience, and that adds a ton to it XD\\n\\n\r\nArt is cool and cute, conveying the right feel to the story.\\n\\n\r\nSometimes simplicity is the key to absolute success!\\n\\n\\n\r\nAnyway that is my impression after watching 7 little eps, and I am now eagerly awaiting the rest. A Gem in any Anime Collector who seriously love Anime and all related to it!\\n\\n\r\nReviewed as before as my opinion held from first to last episode. \\n\\n\r\nThis is, in its simplicity and conduction, a real masterpiece!",
            "date": "2015-01-02T10:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 175753,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/135660.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/VoidHawk",
                "username": "VoidHawk"
            },
            "url": "https://myanimelist.net/reviews.php?id=175753"
        },
        {
            "content": "FULL DISCLOSURE: I have not read the original 4-koma. I strongly recommend watching this as it is really short and enjoyable.\r\nART+ANIMATION:\r\nIt’s a 4-koma based anime, so the art won’t be amazing. That being said, everything looks purposeful and there are no outstanding omissions. There are moments within the story with strongly different art / animation to match the situational comedy and they all work well.\r\nThe animation is standard-issue for this genre. However, there is one episode that uses its own dreary feeling animation style for a character development flashback - I think its use was well-suited. There are even a few scenes where the animationfunctions well as a metaphor for the situation.\\n\\n\r\nNothing worth mentioning about sound or music. As is the norm, the music merely fits the moods.\\n\\n\r\nSTORY:\\n\r\nThe story is about a mid-20’s couple consisting of a nerdy guy and a ‘normal’ girl. Thankfully, the husband’s nerdiness for the most part only influences his personality so that it doesn’t get too old too quickly. It’s very episodic with the general contents of each episode not having much effect on the others, but there is also a lot of continuous building of the plot. \\n\\n\r\nOf course most of the episodes are about their antics or daily life activities, no surprise there. What’s new at least to me is that the situations are much more interesting than the plethora of middle-/high-school student SOL, thanks to the mid-20’s couple. Being in that stage of life, many of the situations are relatable to me personally.\\n\\n\r\nCHARACTERS:\\n\r\nThe character design in a SOL 4-koma is very basic, but I like the faces and expressions. Definitely moe-style but here it’s not a bad thing.\\n\\n\r\nAs fitting for a 4-koma, many of the supporting characters exist only to suit a certain running gag or two, but nothing is too overdone. There are some other good, normal interactions within them and the main characters.\\n\\n\r\nDespite being episodic, there is some real character development going on, and some of it really hits home hard. Both husband and wife have real life problems, and you learn that the wife is not nearly as normal as you were earlier led to believe.\\n\\n\r\nKugimiya Rie is a voice actor in the show (not too often) – I like her in case you can’t tell. Aaanyways… the voice acting is well-fitting to the characters, so no bad marks there.\\n\\n\r\nENJOYMENT:\\n\r\nThere are some pretty good jokes and references included, and the way some of them are portrayed in such a mundane setting makes it even more entertaining. Of course, some references fly right over my head either since I’m not Japanese or familiar with many of the reference material, but thankfully I don’t feel too left out. \\n\\n\r\nDespite the episodes only lasting three minutes each, they are not sped way up to fit everything which was the right decision for the content and mood. Having a show of this format include some pretty serious character development was a welcome surprise.\\n\\n\r\nOVERALL:\\n\r\nGreat short story with some good character development. The humor is right up my alley. The art is nothing special but the focus is more on the main characters than anything else.\\n\\n\r\nTL;DR:\\n\r\nCute, funny, with some deeper, young couple topics. Watch it.\\n",
            "date": "2016-12-10T11:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 235203,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235203"
        },
        {
            "content": "I started watching this anime for being small, I thought the story would be boring, that not give attention to the anime, but it was quite the contrary, this is one of the best novels I've ever seen, tells Hajime story that did not have a girlfriend and I did not know how to get one and Kaoru who was afraid to stay sosinha forever, if you think what happened that beautiful marriage proposal, it was actually a very simple thing, it just asks her to marry him and she accepts, very simple, funny.\r\nHajime is not a husband for example, that has a decent joband be presentable to friends, but he always does everything to Kaoru, always trying to be a better husband, they will have a funny story of romance, although he was funny and always be on the computer, it's attention to his wife, she realizes that he is the best for her and the romance at first thought it would be just to spend time becomes one of the best attended, a novel that is exemplary and can be better than many huge anime that has around, 100% recommend you watch, will not take very little of your time and you realize that it was worth.\\n\\n\r\nSorry if I was not clear on something, my English is not entirely fluent. =)",
            "date": "2016-07-16T13:49:00+00:00",
            "helpful_count": 5,
            "mal_id": 224179,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4923924.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KaiqueCW",
                "username": "KaiqueCW"
            },
            "url": "https://myanimelist.net/reviews.php?id=224179"
        },
        {
            "content": "Overall, the story has an interesting concept, and regardless of being short it's an enjoyable series. Throughout the entire story, we see Kaoru dealing with her otaku husband, who only seems to be interested in the anime world. It's funny how we see Kaoru's reaction, to her husband's somewhat addiction to anime, and it's quite adorable, how she tries her best to distract him, and bring him back to reality, through various means. I'm yet to watch the entire series, but I will certainly watch it till then end. This is defiantly, an anime that is worth watching, if you want something quick and funnyto watch.",
            "date": "2018-05-07T03:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 279984,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178075.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hime-han",
                "username": "Hime-han"
            },
            "url": "https://myanimelist.net/reviews.php?id=279984"
        },
        {
            "content": "Even though there are a lot of other reviews already, after watching this show and really enjoying it, I felt a little obliged to write if only but a few lines about it.\r\nThis is quite a funny series of short episodes based on an idea of an otaku actually marring someone and having his own kind of a family life. It turned out to be really funny with it's simple and straightforward humor and parodies, yet the show has an actual plot line with a logical and solid conclusion. \r\nThe artwork is really cute and nice looking, having it's own style. Though, being a short,it's not surprising to see most backgrounds reused and often blurred, although the are a few quite detailed ones. The other aspects are just decent, witch is acceptable for such type of a show.\\n\\n\r\nThe VA is satisfying, as for the music, aside from the ED, there isn't much of it. Sound effects are okay too. \\n\\n\r\nSpeaking of characters, they are fine too, though just a cardboards, aside from two main characters, that get some development and backdrop. Then again, it's mostly a simple comedy, so it'd be rude to ask for much.\\n\\n\r\nIn the end, this is a comedy slice of life show, and I did enjoy it and laughed during almost every episode. It was over before I knew it.\\n\\n\\n\r\nSTORY: 6/10\\n\r\nPremise: 1/2 — A cool and simple idea.\\n\r\nPacing: 2/2 — Really good.\\n\r\nComplexity: 1/2 — None whatsoever.\\n\r\nPlausibility: 1/2 — There is a reason when they're not joking around.\\n\r\nConclusion: 1/2 — Not explicitly stated, but satisfying.\\n\\n\r\nARTWORK: 6/10 \\n\r\nGeneral Artwork: 2/2 — Good production values.\\n\r\nCharacter Figures: 1/2 — Cute and basic.\\n\r\nBackgrounds: 1/2 — Simple with a few detailed ones.\\n\r\nAnimation: 1/2— Basic, though works well.\\n\r\nVFX: 1/2 — Nothing too impressing.\\n\\n\r\nSOUND: 4/10 \\n\r\nVoice Acting: 2/3 — Pleasant to the ear.\\n\r\nMusic Themes: 1/4 — Not much of it, just the ending theme.\\n\r\nSFX: 1/3 — They're there.\\n\\n\r\nCHARACTER: 4/10 \\n\r\nPresence: 1/2 — Nice cardboards.\\n\r\nPersonality: 1/2 — Simple.\\n\r\nBackdrop: 0/2 — A minimum of it.\\n\r\nDevelopment: 1/2 — There is some for the main pair.\\n\r\nCatharsis: 1/2 — A little one.\\n\\n\r\nVALUE: 4/10 \\n\r\nImportance: 1/3 — A good short that can be recommended in some cases.\\n\r\nRewatch value: 1/3 — It's funny and short and well-done.\\n\r\nMemorability: 2/4 — Good work for it's medium.\\n\\n\r\nENJOYMENT: 7/10 \\n\r\nI really laughed a lot at its simple humor and enjoyed the few touching scenes. \\n\\n\r\nVERDICT: 5/10 (5.16)",
            "date": "2018-05-05T16:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 279858,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6726462.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/N0Mi0",
                "username": "N0Mi0"
            },
            "url": "https://myanimelist.net/reviews.php?id=279858"
        },
        {
            "content": "I've made it a habit this year to watch at least one TV short series each season, and I definitely plan on keeping this pattern going because you never know what exactly you're going to get out of a short series other than time well spent. From the creative nonsense of Tonari no Seki-kun to the bone-chilling terror of Yamishibai: Japanese Ghost Stories, there is a surprising amount of variety to be found in the TV shorts category of your anime listings. So, how did my TV short pick for this season turn out?Our story is fairly simple: a woman named Kaoru fell in love with and married an otaku named Hajime, and the series focuses on some of the quirkier moments of their life together, sort of like a better written Insufficient Direction. Within these four-minute episodes are two general types of comedy: otaku-themed humor and general married life humor, both of which are executed surprisingly well. I extracted quite a bit of enjoyment out of an extremely unsubtle Evangelion reference, but also found the home life confusions of a newlywed couple to be both charming and sometimes even a bit heartwarming. Both Kaoru and Hajime are solid characters as far as TV shorts go, and the only real annoyance I found was with one of Hajime's siblings, whose introduction was...stereotypical in anime style for this character's personality.\\n\\n\r\n          The animation was produced by Studio Seven (Inugami-san to Nekoyama-san), and is played off as very cutesy and basic without ever seeming like the budget was being stretched. I also noticed that there seemed to be a bit of a glow to each frame that made it feel almost welcoming like the doorway to a new home. The soundtrack was composed by G-angle and...it was there I guess. Nothing spectacular, but it filled in the silence well. There was no opening theme, but the ending theme \"Iikagen ni shite, Anata,\" as sung by the two lead VAs, was excessively cute and catchy.\\n\\n\r\n          Overall, this is definitely one of the better short series I've seen this year, and I can't wait for the second season to come out next spring.",
            "date": "2014-12-25T22:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 174321,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3337767.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/emberreviews",
                "username": "emberreviews"
            },
            "url": "https://myanimelist.net/reviews.php?id=174321"
        }
    ],
    [
        {
            "content": "This is a cute, humorous, and ultimately heart-warming tale about the daily life of an otaku and his normal wife. This show has pretty strong sexually suggestive content so is probably best served to those over 16. It's an extremely short show, following the recently-popular 4-koma based approach with each episode taking three minutes, end credits excluded. Though simplistic in its execution and animation style, the story is pretty nice and the message even more so. Go ahead and give it a try, a sampling will only take you three minutes!\r\nAnimation:\r\nAs expected from shows of this length, don't expect the same quality as what you'dget in a full-length show. Backgrounds are grainy and characters are drawn with very simplistic shading. Despite the slightly comic-book based animation, this work is definitely targeted towards a more mature audience. Expect lots of suggestive references and even some tile mosaics.\\n\\n\r\nSound:\\n\r\nThe show is heavily dialogue drive and uses BGM sparingly. It ends with a fitting and melodic ED as the couple enjoys each other's company in the tub. Surprisingly, the show has strong voice talent as we have Yukari Tamura voicing Kaoru. You even get Rie Kugimiya voicing a supporting character as well.\\n\\n\r\nStory:\\n\r\nEach episode has a specific theme related to the particular title, but most of them revolve around a fairly ordinary daily event. What supposedly differentiates this show is that the husband is an otaku. All this really means though is that he will occasionally drop references that only anime veterans will understand (and obviously this doesn't include his wife). The story gets a large boost in the last few episodes as the story of how the two met and how much they mean to each other is revealed.\\n\\n\r\nThough short, this is a well executed and engaging story.\\n\\n\r\nCharacter:\\n\r\nBoth protagonists are pretty well explicated especially considering the length of the show. Expect some pretty good interactions and an especially nice surprise at the very of the show.\\n\\n\r\nValue:\\n\r\nThere have been a lot of short, 4-koma shows of late. This is probably one of the most engaging and interesting one so far. Though I won't go as far as saying that it has an analogous effect on the viewer as Usagi Drop, it is pretty positive nonetheless. Well worth the ~40 minutes to watch.",
            "date": "2015-11-05T00:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 202712,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202712"
        },
        {
            "content": "This was a really fun anime to watch. It’s all about a couple that just became married without really knowing a lot about each other. One is just a standard business woman while the other is an otaku with an extremely high power level. The first season is them learning more about each other as well as their friends and family members. All of the characters introduced are funny in their own way and it's really fun to watch Tsunashi and Kaoru learn more about each other throughout the course of the show. It’s a lot of short funny episodes that are worth your timenormally and definitely worth your time if you’ve got an hour free. \\n\r\n\tThere’s also a trap for those that are interested.\\n",
            "date": "2017-02-07T15:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 240120,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450186.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kryhelm",
                "username": "kryhelm"
            },
            "url": "https://myanimelist.net/reviews.php?id=240120"
        },
        {
            "content": "“I can’t understand what my husband is saying” is a real little gem of an anime. The first season aired during the fall season of 2014, and the 2nd season aired during the summer season of 2015. I watched both when they were released, and just earlier today decided to rewatch the series. With each episode being only 3 minutes long it only takes a little over an hour to watch both seasons.\r\nThe dynamic between an otaku and a non-otaku is a routine gag, but it’s not the focal point of this show. It’s a real heartwarming series about some very believable characters. Obviously somethings are hammed up for a laugh, but if I was told this was based on actual experience with a couple of real people, I would easily believe it. \\n\\n\r\nThat believably is what makes this show so great in my opinion. It’s like watching a bunch of your friends deal with their jobs, romances, and lives. It’s something I feel to be one of the rarer anime experiences. Sure, there’s always tons of slice of life anime but they usually either star teenagers, or there’s a sort of fantastical element to them. It’s rare to find an anime starring a bunch of late 20-somethings living borderline realistic lives, and I think this one really hits it out of the park in that regard. Talking openly and normally about birth control, having a sex life, problems with work, still not feeling exactly like a grown up even though you certainly are one, all of these things are topics that you’ll find covered by this anime.\\n\\n\r\nEven though each episode is only 3 minutes and 30 seconds long, including the credits, you can really get a sense of attachment to the handful of regulars that pop in and out. I applaud the talent that it must have took to be able to craft stories so well and have them all play out within only 3 minutes, but never once leaving me feeling as though the plot was rushed. Each 3 minute episode may as well have been a standard 24 minutes, they just utilized their 3 minutes to tell a story that well. \\n\\n\r\nI guess what I’m saying is that, if you’re an adult anime fan that would like to see a story you can easily relate to, you should go watch this. If you’re an anime fan in general, I think you should go watch this. If nothing else, watch this just to see how it’s possible to tell a fulfilling story in such a short amount of time.",
            "date": "2016-06-26T19:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 222106,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/166567.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Spooty",
                "username": "Spooty"
            },
            "url": "https://myanimelist.net/reviews.php?id=222106"
        },
        {
            "content": "I can't understand what he's saying either. I don't speak Japanese though.\r\nStory:\r\nA married couple and their everyday antics. The husband is a hardcore otaku, the wife is not. Does not sound like much to work with, but for an anime that runs 39 minutes in total, it worked fine. It relies heavily on references, which may lessen your enjoyment, depending on how many you get. The parts when the two show true affection towards each other were very cute and heartwarming, especially the last episode.\r\n8/10\r\nArt:\r\nThis anime is VERY simplistic, to a degree where I must say it doesn't look very pretty. Sometimes it is morenoticeable than others, but for a comedy short it doesn't hurt too much. Episode 11 goes slightly into bizarre territory, which was interesting.\\n\r\n6/10\\n\\n\r\nSound:\\n\r\nThe anime doesn't have an opening, the ending is kinda cute, fitting for the odd but loving couple. Voice acting was pretty good, though of course they don't have much time to shine.\\n\r\n8/10\\n\\n\r\nCharacters:\\n\r\nHajime and Kaoru are very cute together, even when they totally talk at cross purposes (I don't know if that's the correct English version of \"aneinander vorbeireden\", so I apologize if it isn't). I could also sympathize with Kaorus backstory, as most people probably will (if they passed their teens). The side characters weren't that strong, I would have preferred to see more couple time instead of them.\\n\r\n7/10\\n\\n\r\nEnjoyment:\\n\r\nThere's only one thing I'd say this anime could do better and that would have been to have longer episodes. I guess there wasn't enough source material, but there is a second season, which is at least something. The best about this wasn't necessarily the comedy but the cute moments (which made me a little envious). I was happy to see them happy and the ending was a wonderful conclusion.\\n\r\n9/10\\n\\n\r\nOverall:\\n\r\n7.6/10",
            "date": "2016-08-23T19:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 227464,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=227464"
        },
        {
            "content": "A nice story that's not trying hard to be funny, it's funny\r\nMoe girl doing moe stuffs\r\nOtaku guy doing Otaku stuffs\r\nYou want some protagonist with strong characteristic and training for great power, then you came to the wrong place\r\nYou want girls with boobs and great body with some hot action, then you came to the almost right place\r\nWith enough amount of fan-service to keep you with this show and nice story will make you feel relax after a hard day\r\nNow I will proceed to make this review long enough so I can post it\r\nThat's all folks",
            "date": "2016-05-11T03:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 218347,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5401730.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/namv22",
                "username": "namv22"
            },
            "url": "https://myanimelist.net/reviews.php?id=218347"
        },
        {
            "content": "A series that you could probably finish in less than an hour. Story revolves a unlikely couple, an Otaku and an office lady going about their everyday life. Despite the episodes being extremely short, I believe they were well animated and never boring since there were no fillers.\r\nI enjoy the interaction between many of the characters including those of the protagonist alongside acquaintances of his/her spouse. In some way you could see a little of what Japanese society today is like and laugh a little in how silly certain issues are like.\r\nThe series include intimate desires, trolling and disappointment by others of being an Otaku...andother moments. Not much to say about this except it was enjoyable.",
            "date": "2016-05-10T09:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 218305,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5358080.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fake_Williams",
                "username": "Fake_Williams"
            },
            "url": "https://myanimelist.net/reviews.php?id=218305"
        },
        {
            "content": "Danna ga Nani is just fun.  That's really all there is to it.  This is a series of short (~4 minutes each) episodes about a young couple of newlyweds: an otaku husband and his \"normie\" wife.  It probably bears mentioning that I don't think the purpose of this show is to shame or make fun at the expense of anime fans.  Rather, I look at it as an optimistic and heartwarming portrayal of a couple who deals with each other's idiosyncrasies and finds love in it. Despite being a \"normal\" girl, Kaoru has her own quirks that Hajime has to dealwith as well.  \\n\\n\r\nThe characters in this show are great.  They're all quite distinct and interact with each other in amusing ways.  Which is good, considering that this show is completely about character interaction.  There's not exactly a plot, in the same way you wouldn't say that a real life has a \"plot\" either, but things do happen and progress between episodes.  \\n\\n\r\nHonestly, you stand to lose nothing by trying it out.  You can get through all of it in an evening easily.  There's a lot of anime references, so the more shows you've seen, the more jokes you'll get.  That said, as someone relatively new to the anime scene, even the jokes that referenced things I haven't seen (like Neon Genesis) were amusing, so odds are you won't feel too left out.",
            "date": "2015-11-09T21:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 203090,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4779587.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/darkarcher117",
                "username": "darkarcher117"
            },
            "url": "https://myanimelist.net/reviews.php?id=203090"
        },
        {
            "content": "I Can’t Understand What My Husband is Saying is a series of three minute episodes obviously based on a comic strip. Each episode is either a variety of gags or a single story that compounds to create a quick, cute slice-of-life. Kaoru is a diligent businesswoman who smokes and drinks a lot, a complete opposite to her otaku husband Hajime. Despite this, they enjoy life together, getting out of their comfort zones in order to better understand and love each other more.\r\nThe main draw of the series are the newlyweds. Kaoru is a wonderful, funny character who is obviously meant to be the ideal womanfor any otaku. Hajime is a funny supernerd, meant to represent we, the people who write anime reviews or read them or watch anime nonstop. Surrounding Kaoru and Hajime are a bevy of entertaining secondary characters from a creepy guy/girl who draws inappropriate manga and wants to fuck Hajime, to Kaoru’s hilarious father.\\n\\n\r\nThe humor boils down to sex jokes and anime references which are both handled pretty well. The series shines in the short, tender moments of romance; especially an episode where Kaoru and Hajime babysit and start seeing that maybe they’d like to have a child. It all culminates in an emotional ending that leaves you wanting more.\\n\\n\r\nDespite I Can’t Understand What My Husband is Saying having only thirty-nine minutes of content, you’ll find it does everything right. The animation and music aren’t strong, but the characters are funny and likeable and the overall show is charming.",
            "date": "2015-05-22T09:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 188411,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188411"
        },
        {
            "content": "rarely do shorts catch my attention, but I had heard in passing about a heartwarming show about a married couple with a total otaku and a more down to earth wife. After seeing that each episode was only 3 minutes long I decided,\"what the heck? I'm just going to watch it.\" and so I did. And what I got was well.... a heartwarming show with some very nice relatable characters.\r\nstory: \r\nI liked the story. It was simple, and it felt like a realistic situation for the most part. Even though each episode was only 3 minutes long, I felt like each episode had a worthwhilelesson or gave me some good laughs. Speaking of laughs, this show was really pretty funny. I wasn't expecting it to be particularly funny actually, but I found myself laughing at the husbands otaku loner life, and the wife's random odd moments. Sometimes when I watch shows, it feels like the comedy is trying to be forced in, but in this show, it felt very relaxed and free which I enjoyed. It was truly heartwarming to see the little surprises in their lives that made their relationship better, or their little sweet moments.\\n\\n\r\nBasically, the story is simple (this is slice of life) but enjoyable, and the comedy was good.\\n\\n\r\ncharacters: For me, the characters is where this show really shined. They were some of the most relatable characters I have ever come across in anime. A lot of the MAL community probably has at least some minor inner otaku in them, so its easy to imagine and empathize with the husband. The wife is a hard working woman, who just gets thrown off by her husband and life in general sometimes. And her situations also seem very realistic. A few of the side characters will a little weird and almost confusing in a few situations, but they were pretty funny, so it's ok.\\n\\n\r\nSound: nothing stood out about the sound in particular\\n\\n\r\nArt/animation: While the art and animation was not the most beautiful that I have ever seen, I didn't mind because the simplicity and style of it fit the show, and I actually rather enjoyed it.\\n\\n\r\nenjoyment: I really did enjoy it a lot. It was funny, it was sweet, it was relatable. enough said.\\n\\n\r\nOverall: I really did enjoy the show. Really. Which might make you wonder \"why is it only rated a 7?\" and the answer is because well... it was short, and while I enjoyed it, I for some reason, could not bring myself to rate in any higher than a 7. It definitely is no worse than a 7. It is on the higher end of the 7 ratings. But at the end of the day, it just wasn't knock your socks off amazing. However that is not to say you shouldn't watch it. I highly recommend watching it. It takes about 40 minutes, and it is worth it for sure.",
            "date": "2016-01-30T20:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 209750,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4609409.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/snapeftw",
                "username": "snapeftw"
            },
            "url": "https://myanimelist.net/reviews.php?id=209750"
        },
        {
            "content": "(Warning first review it will in fact suck.) Danna ga Nani wo Itteriu ka Wakaranai Ken is a heartwarming short anime. At first when I read the synopsis I wasn't sure what to expect. Well I can sure say overall I got a pretty good anime. It took it's 3 minute run time, and made it work to it's advantage by filling it with humor, and a lot of character development. The episode flew right by, and it was one of the only anime I have marathoned through in one whole sitting. Now I am not just saying that for it's very short runtime. Theonly thing I could possibly say is a \"negative\", and to be quite honest it isn't even a negative. The art quality could have been better. That being said I really enjoy the character design for Kaoru it was simple, and the character looked appealing overall. \\n\\n\r\nOverall I give this anime a 9/10. Would I recommend it? Yes I would. It's easy to sit through, and has some great characters.",
            "date": "2016-02-24T20:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 211647,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5221513.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PX",
                "username": "PX"
            },
            "url": "https://myanimelist.net/reviews.php?id=211647"
        },
        {
            "content": "This show is pretty much a romantic comedy show,but its one if the nest ones i have watched so far.\r\n It has a slice of life vibe and its really good if you want a quick laughter, especially since each episode is about 3 minutes long(even season 2).\r\n The characters in this story are pretty good, helping their main characters with their relationship, and the music is pretty good also.\r\n The enjoyment is just amazing,and it makes me to just re watch an episode, and any since is an episodic show.\r\n The art is pretty creative,especially when the characters show expression throughout the series.\r\n Overall,it's an amazing show, and i recommend you all for watching it.",
            "date": "2018-11-09T14:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 293704,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322269.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ZeroZero0",
                "username": "ZeroZero0"
            },
            "url": "https://myanimelist.net/reviews.php?id=293704"
        },
        {
            "content": "If I ever marry some random casual, this anime would probably be accurate as to what would go down. Except minus the weird younger brother who draws manga and looks like a 12 year old girl. And all the other weird shit that happens in the anime. I guess this wasn't that good of a comparison, come to think about it. Anyways, its a pretty good anime, and you can literally watch it within an hour, as each episode is only 3-4 minutes long, so thats good, I guess. This anime is basically total moeshit otaku + casual grill = this anime. 9/10.",
            "date": "2016-08-16T19:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 226899,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5600974.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/supah_mama_luigi",
                "username": "supah_mama_luigi"
            },
            "url": "https://myanimelist.net/reviews.php?id=226899"
        },
        {
            "content": "Story:\r\nIt's cute. Do more.\r\nArt:\r\nIt's cute. Do more.\r\nSound:\r\nIt's cute. Do more.\r\nCharacters:\r\nThey're cute. Have more, and have some more of each.\r\nEnjoyment:\r\nI wanted more.\r\nOn a bit more serious note this is too non-ambitious to get a serious critique. An otaku and his wife live together and try to deal with the differences between an otaku's world and a normie's world.\r\nIt's too short, and oftentimes passing from one scene to the next without even a transition is kind of jarring, so maybe a bit more effort into making something more cohesive would help.\r\nNo backstories, or little of it, and not much in the way of progression, but still, allI can say is that it's cute and that it deserves more.\\n\\n\r\nOverall:\\n\\n\r\nOkawari kudasai/More please",
            "date": "2016-07-26T10:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 225054,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5389960.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/KingHarkinian",
                "username": "KingHarkinian"
            },
            "url": "https://myanimelist.net/reviews.php?id=225054"
        },
        {
            "content": "What a nice feeling it is to see these two losers managing to have an healthy marriage. This anime might be incredibly cathartic to many anime fans who are not used to be in love or in a relationship. Usually anime as a medium shies away from talking about intimacy between two people, we always see neet who have their \"2d wifus\" but we never get to see a marriage between two real people. This anime is short and lovely because it tries to pass the message that you don't have to change yourself or your hobbies to be in a relationship, you don't haveto be like everyone else, you can just be yourself. This anime also has one of the most beautiful episodes ever, despite being only 3 minutes (which is episode 11 if i remember correctly) that paints being single in your middle 20s in an almost perfect way.\\n\\n\r\nIt had his bad moments, at a point i wanted to rate this a 1/10 for a stupid joke that was made and that i hated it to disgust. But i can overlook those all thanks to episode 11 and the ending of season 1, which was beautiful. I stll haven't seen season 2 and I probably won't because this season ended at a perfect moment and i'm scared it'll be ruined.\\n\\n\r\nAnimation, sound, and art were all pretty basic since this is a 3 minutes show.\\n\r\noverall 7/10",
            "date": "2018-01-13T06:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 268385,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6763422.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/agahtha",
                "username": "agahtha"
            },
            "url": "https://myanimelist.net/reviews.php?id=268385"
        }
    ]
]