[
    [
        {
            "content": "Jigoku Shoujo Futakomori is the sequel Jigoku Shoujo. Its basically where the previous story left off. Enma Ai continuing her work as Jigoku Shoujo. The same job she has had for the past 400 years. This time around, it appears that the staff has listened to the fans of this show and pretty much made a brand new show. It still follows the same formula as part one, plot, retribution, and conculsion, but this time around they seem to mix it up alot more often this time around. Some episodes they progress it normally, in other ep\\'s they tarintino it and start from the middleor at the end and work from there. For a show like this its just what the doctor ordered. Each ep doesnt feel like you just watched the same ep over and over again. Even the stories are alot more contraversial this time around as well. There are alot more stories that conflict between the worlds of good and evil and really challange the player on a &quot;what would you do if&quot; basis.\\n\\n\r\nAnother update is the introduction of Kikuri. Nothing much is known about her except for the fact that she acts the complete opposite of Enma Ai. She\\'s mainly the show\\'s comic relief/lolicon. Which is another improvement... you\\'ll see Enma and Kikuri (and company) in alot more different costumes than before. You\\'ll see Enma and Kikuri in so many cute costumes you\\'ll most likely get a kawaii overdose!\\n\\n\r\nWith more variety in charcaters clothing, the next natural step was to give more tv time for Ren and Onna. Wanyuudou was the only one doing the work before, now that has been more evenly distrubuted between the other 2 demons. You also get to understand how and why they end up helping Enma. the artwork is also looks like a huge improvement as well, showing different angles of Enma\\'s home, and different &quot;kawaii situations.&quot; Enma cutting her toenails sounds gross yet it was amazingly cute. Personally i think Kikuri almost stole the show, she definitely grows on you. Lolicon alert: enma and kikuri get nekkid more often in this series.\\n\\n\r\nOverall i really enjoyed this show alot more than before. Its like the series did a complete creative 180, totally redoing everything than before. More money is probably the culprit here. Regardless, the viewers win out because this is a much higher quality product. There is a large warning tho, if you cant stomach sensitive situations like incest, insanity, and mob brutality than steer clear of this show.\\n\r\nIf you even thought JIGOKU SHOUJO should have been better, watch this show! This is what the first season should have been like. Even the ending will leave you speechless...\\n\r\n9/10 (would have been a 10/10 except for the yaoi episode)",
            "date": "2007-07-26T20:11:00+00:00",
            "helpful_count": 183,
            "mal_id": 608,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=608"
        },
        {
            "content": "Title: Jigoku Shoujo Futakomori\r\nAnime: Jigoku Shoujo Futakomori continues to be directed by Takahiro Omori and produced by Studio Deen.  It is twenty-six episodes long and ran from October 7th, 2006 to April 6th, 2007.  Futakomori has yet to be licensed Stateside.\r\nStory: There is a rumor that if there's someone giving you absolute hell and you want to get revenge on them, there's a website that you can access only at midnight, known as Hell Correspondence. Once the name is submitted, Ai Enma (aka Jigoku Shoujo/Hell Girl) will appear to the client and give them a straw doll with a red string wrapped aroundits neck. If the client wishes to take revenge, then all they have to do is pull the string and Ai and her helpers will ferry the person to hell. However, there is a small catch to all this: Once the compact is made with Ai, the person who took revenge will go to hell once they've died as well.\\n\\n\r\nNotice no change in the plot summary?  That's because Futakomori is pretty much more of what we saw back in season one; Revenge of the Week, same episode format, which is disappointing in and of itself.  \\n\\n\r\nThere are some pretty good stories in this season, yes; but the ratio of good episodes to mediocre decreases this season. And they finally get around to telling us the background of Ai's helpers, but the added backgrounds are all that are given in terms of development for Ai and her helpers, and don't even add all that much to the fairly one-note personalities that we saw in the last season.  We do have a recurring character who, thank god, is not as annoying as Tsugumi and Hajime (who do make a cameo appearance in the second-to-last episode of the show), but is introduced about halfway through, and then dropped until about three-quarters of the way through, as if the writers suddenly remembered that they needed something resembling an overarching plot. \\n\\n\r\nThe additional background added for the helpers and the better episodes of the bunch do add some redeeming aspects to the plot, as does the last episode of the series, which more than makes up for what came before it.  But, still, you're left with a bitter taste in your mouth at the end of this season, especially with the little caveat that's tagged on after the end credits.\\n\\n\r\nThere is a third season, Jigoku Shoujo Mitsuganae, which is supposed to start airing October 4th of this year (2008), which will maybe wrap things up once and for all.  Will it?  Probably not, but let me have my optimism, kthnxbye.\\n\\n\r\nArt: The art is just as good as last season, if not better, especially in terms of character design in the individual episodes, and in clips which are frequently used as stock footage.\\n\\n\r\nNo major changes in style, so what I said last season pretty much applies here as well; rich colors, beautiful designs, combining for a stunning effect.\\n\\n\r\nMusic: Again, pretty much the same as what we heard last season, which was well-done and a good mix of Western orchestration, rock, and traditional instrumentation.  The OP and ED are done by the same people and. while they're new, the things I said about them last season still pretty much apply here; upbeat, catchy female J-Pop OP and ED with more traditional instrumentation and lyrics that very directly relate to the show.\\n\\n\r\nSeiyuu: No changes.  Good performances by all, and Ai's lines are still unvaried; at least it's an easy job?\\n\\n\r\nLength: Again, they could've cut this down to thirteen episodes or so and it would've still had the time to tell its story and get some good Revenge of the Weeks in, even more so since the real story doesn't start till the three-quarter's mark.\\n\\n\r\nOverall: It's pretty much what you saw last season, all across the board, with a few new things thrown in here and there.  So, really, if you liked what you saw last season, and don't mind the monotony, you'll like this just fine.  But if you wanted more from this season... well, you might not want to watch this.  Possibly redeemable in the third season (Mitsuganae), but given it's track record, it's probably not going to happen.\\n\\n\r\nStory: 6\\n\r\nArt: 9\\n\r\nMusic: 9\\n\r\nSeiyuu: 7\\n\r\nLength: 6\\n\\n\r\nOverall: 37/50; 74% (C)",
            "date": "2008-09-18T20:12:00+00:00",
            "helpful_count": 68,
            "mal_id": 8053,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14299.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Venneh",
                "username": "Venneh"
            },
            "url": "https://myanimelist.net/reviews.php?id=8053"
        },
        {
            "content": "Jigoku Shoujo Futakomori, being the direct sequel to Jigoku Shoujo, offers more of the same but does everything much better. \r\nThe story centers around a website called Jigoku Tsuushin (Hotline to Hell), which can only be visited at midnight. If you type in a person that you hate's name and your hate is fierce enough, the red-eyed, black-clad Enma Ai will appear before you and offer you a straw doll. If you pull off the red string attached to the doll, your antagonist will be sent immediately to hell (after being punished for his/her sins if she/he has any). However, by doing this, you automaticallycondemn you own soul, and when you die, you will be going to a hot place as well.\\n\\n\r\nThe first and second series are similar in many ways; the first 10-15 episodes are strongly episodic and introduce new characters all the time, most of which you will never see again after that particular episode. All the stories are, naturally, dramatic and sad, showing the worst traits that mankind is equipped with. In the first series, the episodes followed a chronologic formula: first a couple of scenes showing the conflict between two persons, then the victim visiting Jigoku Tsuushin, receiving the straw doll and then pulling the string. Aftar that, the culprit receives his/her punishment and is ferried to hell by Enma Ai.\\n\\n\r\nIt became a bit repetitive and annoying after a while. In Futakomori, the scenarios are much more varied, presenting different points of view on the conflicts and many twists and turns. We also get much more information on the three demons accompanying Ai, helping her with investigating the conflicts: during what eras they lived, what they were back then, why they couldn't die in peace and how their pasts affect their present actions. Those four, Ai included, are all very intriguing characters, and the more you know about them, the more you like them.\\n\\n\r\nNew to the series is a little girl called Kikuri, who apparently lives together with Ai and often shows up in the middle of the conflicts, causing mischief. She is rather evil and her big blue eyes are, simply put, scary. I didn't really like her, but she has her moments.\\n\\n\r\nThere are not many new melodies in the music deparment; almost all music is recycled from the first season and is still going strong, enhancing the sad and violent scenes wonderfully. As for the art, it's great as well and Ai is as beautiful as ever.\\n\\n\r\nAround episode 20, the story starts getting really interesting. I will not spoil anything, but the ending is great and I can't wait to see what happens in Mitsuganae, the third season. \\n\\n\r\nJigoku Shoujo Futakomori beats its predecessor in all categories, sports great visuals, fitting music, excellent characters and a dark, twisted sense of humour. The only thing I can complain about is that Hajime and Tsugumi from the first season got next to no screentime at all, which is a bit sad since I liked them a lot. Apart from that, this is one of the best animes I've ever seen. Highly recommended, especially if you thought the first season had potential but was too repetitive.",
            "date": "2008-03-30T08:51:00+00:00",
            "helpful_count": 52,
            "mal_id": 3483,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24106.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tenchio",
                "username": "Tenchio"
            },
            "url": "https://myanimelist.net/reviews.php?id=3483"
        },
        {
            "content": "So, you people thirsty for a second round of Ai Enma action want to know if it's worth it, right?  Well, the answer is: maybe.  Read below and find out.\r\n*I'm going to make a lot of references/comparisons to the first season (which I've also reviewed), so this review may not make a lot of sense if you haven't seen it.  (Watching Futakomori without watching season one would be pretty stupid anyway.)\r\nStory: 9.  This time around, we're treated to the refreshing perspective of Ai and her helpers--as opposed to only the viewpoint of the victim resorting to desperate measures.  The tradeoffhere, though, is that we lose basically all of the mystery and intrigue present in the first season.  Ai appearances are much more frequent, and there's really no more excitement when she shows up behind people.  We get to see what it's like for the gang as they gather information about their clients and targets.  Just imagine this:  Ai in a restaurant uniform, taking your order.  Interested?  I thought so.  We're shown their reactions to those involved, their conclusions, and their emotional responses.  They take much more active and hands-on roles in the dealings of their clients.  We also get the back stories of each of Ai's helpers, which were very much needed.  The boring, formulaic nature of the first season is basically scrapped in favor of a lot more diversity and flexibility.  There's really no predictibility anymore:  You really can't say for sure what'll happen in any given episode.  But again, like in the first season, the only real continuous story occurs in the last 5 episodes.  But when it DOES, it's pretty frickin' sweet.\\n\\n\r\nArt: 8.  Definitely upgraded from the last season.  It's kind of like the art quality of everything else caught up to Ai.  (Although, this DOES mean that she doesn't stand out as more.  Sad me.)  The facial expressions are a LOT better, and the side characters are more creatively done--they don't suffer from the epic laziness of the characters made last season, who hardly looked different at all.  They also use some stock footage again in the same place (Ai departing to \"fetch\" the target), and they even had the nerve to copy Wanyuudo and the chariot pixel-for-pixel from the first season.  However, the length of footage repeated is shorter--maybe 5 seconds as opposed to 15-20--and it's only used a few times.\\n\\n\r\nSound: 8.  Some of the tracks from season one's OST are recycled, some are revamped, and many more are mixed in.  It's okay, though:  It wouldn't really be the same without some of these memorable trademarks.  The OST for the franchise is pretty impressive in general, and the tracks fit on-screen events like gloves.  The OP is a little better than season one's, but the opening sequence kind of makes it look like it'll be a slice of life series or something like that.  But we know better, don't we?  I really miss \"Basting,\" the ED from season one, but this one's alright too.  Speaking of missing things, I REALLY miss the English dub.  Brina Palencia as Ai... *sob*.  And she gets considerably more lines now, too!  Damn you, Funimation...\\n\\n\r\nCharacter: 8.  Like I said above, the character designs have vastly improved from the last season.  (The characters don't look like they were all made from the same generic template.)  Ren, Hone Onna, and Wanyuudo get character development, and their back stories are revealed.  The supporting cast is pretty good in general; however, there are times where you may find yourself facepalming at the stupidity of some of them.\\n\\n\r\nEnjoyment: 8.  (As you can see, lower than my score for season one.)  In some ways, it's more enjoyable:  Seeing the gang more and their activities is definitely fun (especially Ai; more Ai screentime is ALWAYS good), and so is learning about them as characters.  But in others, it's not:  If you enjoyed watching people suffer for their sins in the first season, you'll be woefully disappointed here.  You get to see very little of that.  Like I mentioned, a lot of the mystery, suspense, and intrigue is gone, since it's told from the perspective of Ai's gang, and the supernatural elements have very little gravity anymore.  Even Ai appearing behind people isn't nearly as cool and eerie. =(\\n\\n\r\nThe first season served the much more basic purpose of focusing on people being wronged and their desires for revenge.  Season two, however, serves as much more of a social commentary--focusing less on vengeance itself and more on the situation and circumstances surrounding the characters (the monsters of hate, envy, deception, and anger; politics and social and family life aren't uncommon).  HERE is where it's better to ask the question if revenge is really the best option.  (The last season was NOT the place; as I mentioned in that review, all evidence pointed to revenge as being the best choice.  Basically, it's less one-sided.)\\n\\n\r\nWe aren't shown nearly as many of the actual torture sequences the targets are put through, which I was very disappointed by.  (The first two, however, are more intense than the ones in the first season, and I loved them.)  The sadistic appeal of the first season is gone; instead, you're forced to question yourself and how you think about things.\\n\\n\r\nOverall: 8.  In the end, you'll have to decide for yourself if you like the changes or not.  As you can see, my ratings for each category are a lot more balanced than the first season.  Personally, I enjoyed the justice/vengeance focused first season more; however, this season improves upon the last in the art, story, and character departments.  You also don't have to deal with the formulaic-ness all over again.\\n\\n\r\nAll in all:  If you liked season one, I recommend Futakomori.  Just be prepared to have a little bit of an open mind, 'cuz it's a little different.\\n\\n\r\nAnd now, the decision rests with you~",
            "date": "2011-12-17T22:02:00+00:00",
            "helpful_count": 37,
            "mal_id": 49461,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557765.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DraconisMarch",
                "username": "DraconisMarch"
            },
            "url": "https://myanimelist.net/reviews.php?id=49461"
        },
        {
            "content": "\"Hey, did you hear about Hell Correspondence? They say if you submit someone's name there you can send that person to hell\". These ever spreading rumors have given Enma Ai the chance to fill the pits of Hell with many a soul hardening her heart with every request sent to her.\r\nThe second season continues with more hatred and suffering as this well designed story advances revealing details about the main characters in an endless chain that mimics reality, it proves to us over and over again what hatred does to us, it turns us into something inhuman.\r\nOne of the various improvements made since the firstseason are the way episodes start and progress that way you don't have the feeling you've seen this before.Also something I have appreciated about this anime is that it slowly presents you everything, rather than suddenly dropping it on you. Another improvement is the introduction of Kikuri which you soon realize, is the complete opposite of Enma Ai with her playful personality and mischievous acts. The fact that makes her intriguing is that nothing is revealed about her until the final episode.\\n\\n\r\nOh look it's 00:00 am... what are you going to do?",
            "date": "2013-05-27T05:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 98595,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=98595"
        },
        {
            "content": "The Story - It's actually pretty, well, not clear. Actually, Jigoku Shoujo's story line is about a girl who sends people to hell. Actually, The story plot only applies at episode 18 + or so. I'll give it a 9, though.\r\nThe Art -Are you kidding? The graphic rocks! It actually made it 3d like, kinda like the Haruhi Suzumiya graphics. It actually is believable, ah. I wish the Hell Girl exist. :<. Anyways, I'll give it a 10.\r\nSound -The Sound is fantastic. Indigo Dye actually got Ai's emotion coming and going. The Opening song is pretty good, too. 10.\r\nCharacter -It clears all Ai's assistant's erm,past. So it's pretty good. And to think for 26 okay, 42 PEOPLE's situation! Whoa. 10 points for that.\\n\\n\r\nEnjoyment -It's really enjoyable. I mean, it's really scary, it's enjoyable. I really love the ending, and It's the best ending I have ever seen so far. Okay, I know two more, but I don't really want to mention it. 10.\\n\\n\r\nOverall -If you like the original Jigoku Shoujo, then you'll love this. Even if you don't or haven't watched Jigoku SHoujo Futakomori, I'm pretty sure you'll fall in love with this, too. 10.\\n\\n\\n",
            "date": "2008-03-27T00:44:00+00:00",
            "helpful_count": 10,
            "mal_id": 3421,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21064.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/underMebius",
                "username": "underMebius"
            },
            "url": "https://myanimelist.net/reviews.php?id=3421"
        },
        {
            "content": "\"Ima Nanji Ka Oshiete Yume To Itte Dakishimete\" sounds familiar, right?\r\nThe new Hate Cycle has improved & is better, faster & stronger.\r\nIT'S THE BEST SEASON OF JIGOKU SHOUJO.  \r\nit truly is\r\nThe scenarios in most episodes are more well thought of than the previous season and this where we see how Hell Girl really feels for the humans. The \"Shibata needs to stop Hell Girl\" Team is\r\nnot present anymore and it's actually new to me ( well kinda ) because no one tries to stop Hell Girl & no one was actually able to stop Hell Girl in this time around. \r\nStory - 9\r\nAs Isaid, the scenarios were more thought of than it's previous season and \\n\r\nonce you watch an episode, it makes you want to watch more. Aside from the episodes being \\n\r\nbetter, the last arc of the show really made it have such a nice ending. -no spoilers you'll have to watch it yourself to find out- :p heehee\\n\\n\r\nArt & Sound - 8\\n\r\nThe Art is still great and the Sound is still the same \\n\\n\r\nCharacter - 9\\n\r\nEvery Main Character is the same except for Enma Ai because this season shows us Ai's -pity on the humans- side and it's really nice that even if she tried to lock her feelings, some are still breaking free.\\n\\n\r\nEnjoyment - 9\\n\r\nI enjoyed it alot & I hope the next season would totally kill. \\n\\n\r\nOverall - 9 \\n\r\nWell, now you know why. :)\\n\\n\\n\\n\\n\r\nAnd as they say, Haters gon' Hate.",
            "date": "2012-05-14T05:31:00+00:00",
            "helpful_count": 8,
            "mal_id": 61179,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gdjdelacruz",
                "username": "gdjdelacruz"
            },
            "url": "https://myanimelist.net/reviews.php?id=61179"
        },
        {
            "content": "The Second Season of Jigoku Shoujo has a few different names: Futakomori, Two Cages, Two Mirrors and my favorite Jigoku Shoujo 2: Electric Boogaloo. Ok I’m kidding on that last one, though Ai sending people to hell via break dancing would be entertaining .Regardless of what it is called it’s still the much improved second season of Jigoku Shoujo, so let’s dive right in.\r\nThe stories are the first big improvement, dropping the first season’s clear cut black and white morality for a more realistic grey morality. Gone is the pure innocent victim who is tortured by the big bad tormenter. Now both the victim andthe receiver of the revenge usually have blood on their hands so to speak. As a result they stories feel somewhat more believable, though they do occasionally throw in someone who is just plain horrible to remind us that some people are really just assholes.  The revenges themselves are cut down dramatically but it does make each one we do get much more special and fun.  Also it abandons having a more overarching story till about episode 14 and even then it doesn’t pick up until episode 22 but again less is more and it ends wonderfully. The episodes move at much better pace than the first season's and I found myself breezing through this series once I picked it up again after a hiatus.\\n\\n\r\nThe main cast gets a new addition in the form of Kikuri, who flirts between gosh darn adorable to holy hell that was scary; she’s a nice foil to the very serious AI. The original 3 helpers now get a more expanded backstories and you get a better feel for the characters. Wanyuudou and Ren’s episodes are fairly good without really detracting from the main revenge plot and Ren’s is probably one of my favorite episodes of the season. Hone Onna is a fine character however; I’m not sure what it is but the 2 episodes that feature her prominently felt very contrived and were probably the worst of the season. As mentioned above characters specific to each story feel more realistic and manage to pull a few tear jerkers for those sent to hell. It also helps that Ai and her group are much more involved with each target giving us that allows for said character development. \\n\\n\r\nThe sound and the art were both amazing, the music added to the creepy vibe of the series and it’s always nice to hear Sakasama no Chou again in random places. As usual I’m never quite sure what to say about the art, it looks good and flows nicely. Also special mention should go to Kikuri’s eyes which help the cute to creepy transition though they have a habit of falling in to the uncanny valley when not scaring the hell out of me. Same with the music as mentioned above it builds atmosphere nicely and it’s good not much I can really say.\\n\\n\r\nOverall it’s a great series that plays and subverts the established formula from season one with better character development. It’s a ton fun and shouldn’t be missed especially if you loved the first season and even if you don’t or didn’t watch the first season watches it anyway. \\n",
            "date": "2011-04-28T12:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 36539,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/405377.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Pink_Princess",
                "username": "Pink_Princess"
            },
            "url": "https://myanimelist.net/reviews.php?id=36539"
        },
        {
            "content": "Before we get to my actual review, I would like the viewers to understand that I AM NOT A SUMMARIZER. If you want to know what's the plot, read the SUMMARY, and don't mark me down for not saying anything about the story. I tell you what elements are impacting in the story and what my opinion is. ANYWAYS...\r\nThe Second season of Jigoku Shoujo lived up to it's expectations and once again, delivered that supernatural and eerie feel that we love it for. Enma Ai's return to the business was gracefully reinstated after the ending of the first season and was even more \"scary.\" Plusthe new mini-stories were fantastic and didn't have that repeating feeling that occurred in the first season. The anime really fixed all its errors from the previous season. BUT of course there was a new problem that occurred. Unlike the first season, I main plot failed to appear until you are three quarters of the way through the anime.\\n\\n\r\nOverall 9/10. This anime really put out all it had and had that phenomenal ending that I so enjoy. Only real problem was pace, but the short background stories on Enma Ai's servants made up for that easily.",
            "date": "2009-04-11T14:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 14049,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=14049"
        },
        {
            "content": "Story (7.7) - Well, this aspect is like the first season of this anime. Each episode has an own story, and theres almost no sequence till the last episodes. However, in this season the episodes are much less formulatic, i mean, in this one they give us new situations and the end is not always the same, i mean, there are some that dont seal the contract for several reasons, by other words there are more diferrences between the episodes..i gave 7.2 to the first season, and i gave +0.5 pts since it got slighty better.\r\nArt (8.3) - Art is good, the design is nice,the characters look good..not so different from the first season. I also like some details that make the graphics look better, so an 8 fits well here.\\n\\n\r\nSound (7.3) - Nothing special, just enough to make it quite enjoyable.\\n\\n\r\nCharacter (8.3) - Much better in the second season. Finally i start to know more details of the mains characters, we finally start to know about their past..and a final aspect, they now start to show more emotions in each cases, that makes the anime much more interesting.\\n\\n\r\nEnjoyment (8.4) - Like the first season i think it is very entretaining, because it has a lot os suspense and psychological aspects. There is also some action (another good thing) that wasnt common in the first season.\\n\\n\r\nOverall (8.4) - Better than season 1. Not enough to give it a 9, but very close to it, and that means very good one. i recommend to someone who likes the first season.\\n",
            "date": "2008-04-01T14:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 3532,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25161.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/fr0z3nshad3",
                "username": "fr0z3nshad3"
            },
            "url": "https://myanimelist.net/reviews.php?id=3532"
        },
        {
            "content": "Yami ni madoishi awarena kage ---Shade lost in darkness\r\nhito wo kizutsuke otoshimete ---you hurt people\r\ntsumi ni oboreshi gou no tama ---soul full of sins\r\nippen shinde miru? ---Would die once?\r\nIf you watched not dubbed version these words are probably got carved into your head. Enma Ai also known as Jigoku Shoujo is a girl keeping a huge hate herself deeply shut in her heart, mercilessly fulfills her duty. This time she continues to fulfill her duties of Jigoku Shoujo the same way, mercilessly, emotionlessly, decisively, washing people down into the hell.\r\nJigoku Shoujo Futakomori again follows the same pattern as prequel continuing episodic stories, but now storiesare a little less straightforward and less predictable. Though you will still hear the phrase I put in the beginning many times as it is like a gist of the series. However they add more details about her company, her servants, helping her do the \"job\". Now narration is shifted to the perspective of Ai with her group. So you will see her cold face more often.\\n\\n\r\nIn episodes the death of people and other reasons for unhappiness are featured in extent great enough to make people go mad to use the service of Jigoku Shoujo, sending people to hell immediately at cost of being send to hell themselves in afterlife \"shinda ato no hanashi dakedo\". In some stories you can see a significant motive and in other it is just a fickle. Human lives are ruined, despite it was avoidable. For some ends you can see like it is just better for them to be in hell.\\n\\n\r\nEvery time person is sent to hell appears a scene with Ai in kimono pushing the boat with a doomed person to the gates of hell. Actually you often may notice elusive emotions of that girl, even though she has to do her job with her feelings shut deep into her heart, she releases some emotions. But it is not up to her to decide what is wrong and what is right, she does her job whatever happens, crying inside or being overfilled with rage. Yet she can't do anything about it being not allowed to interfere.\\n\\n\r\nArt is not much of difference compared to prequel, some improvements are noticeable so if you liked that art here it is. As I mentioned that it follows the same pattern, dark atmosphere and dark scenes are put with an exquisite manner. But I must say that Ai's kimono in previous season was more appealing to me, that dark purple, am I the only one so?\\n\\n\r\nFor the music I'd say quite the same, not many changes, some improvements. Awesome OP and ED soundtracks never skipped those. For a few times you may notice OP soundtrack from the first season playing at the background, nice reminiscence. Seiyuu staff is great, you can well known voices even for episodic characters, I think I heard Yukana at ep. 19, but she is not mentioned at MAL to have a role here.\\n\\n\r\nI was deeply impressed by the first season of Jigoku Shoujo and even though second season has the same concept they did a good job keeping it interesting. Closer to the end of the season episodes are getting more tense to making the perfect final impression.\\n\\n\r\nSono urami wo jigoku he nagashimasu ---I wash this hate down to hell",
            "date": "2016-12-08T06:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 235070,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4090177.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/highfeel",
                "username": "highfeel"
            },
            "url": "https://myanimelist.net/reviews.php?id=235070"
        },
        {
            "content": "The direct sequel to Jigoku Shoujo, and Enma Ai is back. Ai and her followers continue the job of sending off people to hell, but this time a new, mysterious character is introduced and another incredible season starts again.\r\nUpgraded story, upgraded characters and upgraded tragedy! The Futakomori will show the horrifying evil sides within you. Again like the first season, the second season comes back with more stories full of remorse. It won't let viewers down and the story is AMAZING!!! The series is similar to its prequel and instead of the Shibata family, a new family will be involved deeply with Hell Girl.\r\nThe charactersare same as the prequel, except for a mysterious girl in the team: Kikuri. Personally I really hate her... she gives me the creeps. The three other loyal followers are now more active, gathering information by disguising as humans. Their own pasts are revealed as well. A boy will also recur in the series since he will be the victim of THE ultimate prejudice one can possibly imagine. The series will develop into the climax after the 20th episode and I assure you that the (tiny spoiler!) Lovely Hills Arc will blow your mind away. Also, you will briefly see an old face from the prequel.\\n",
            "date": "2010-10-01T02:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 30953,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/hangbin9",
                "username": "hangbin9"
            },
            "url": "https://myanimelist.net/reviews.php?id=30953"
        },
        {
            "content": "“Hell still lingers around”\r\nThe Story...\r\nAfter Enma Ai knowing her past, the Hell Hotline still give services to people who have grudges growing in their hearts. As she continues working as the Hell Girl, there are lot more tales to see along the way. \r\nIt is a continuation of the preceding series which still focuses on taking revenge, giving chances, second thoughts, and bringing entertainment on its mystery, supernatural, and horror with better drama on it. As the story moves along, there are a lot of changes and slightly improvement happened, as making the short tales pleasing by putting better depth on it, which becomes entertainingto watch than before. Although there aren’t quite changes on what method they use on fulfilling someone’s desires, they put more emphasis on the tale that they're telling about. \\n\\n\r\nWith the nice development of the story which is even better now – Adding new arcs & concepts to the story, surely it is quite a different experience than before.\\n\\n\r\nArt & Animation...\\n\\n\r\nAll is wonderful now as they made a different improvement in the art & animation. It became more attractive by putting some new lively colors that surely blends on its theme. The effects and design is more appropriate, and it gives more impact to the ambiance of the story. Also with a less repetitive actions throughout the show, it becomes even worthy to watch.\\n\\n\r\nSound...\\n\\n\r\nThe sounds are quite similar as before, the voice delivery of the main characters and the sound effects that gives a chilling feeling. Nothing particular changed on how they perform it, but maybe the difference about the sounds and BGM is that they somewhat organize the sequence of inserting it throughout the show for it to be more effective. Also with the new OP & ED song, it surely gives a quite new melody to hear.\\n\\n\r\nCharacters…\\n\\n\r\nSame as before, nothing changed on the appearances of the main characters rather improving and revealing their true feelings and identity merely gives quite entertainment to view on. As a new main character appeared in this series, it quite adds up some twist and mystery throughout the show. Also with a new batch of characters to be involved, it somewhat helps on improving the insight of the show.\\n\\n\r\nEnjoyment…\\n\\n\r\nOn its first series which is kind of dull, eventually this time it is a lot enjoyable than before as they made a lot of improvement and changes along the way with the animation, art, characters, and most of the entire story telling.\\n\\n\r\nOverall…\\n\\n\r\nAfter watching the first series which is quite frustrating, now this series may turn up your frustration to a new view into its story telling procedure, as many changes happened and new arcs to watch on. It is definitely a lot different & wonderful sequel to follow.",
            "date": "2010-04-16T01:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 25117,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=25117"
        },
        {
            "content": "The second season of Hell Girl is a great improvement over the first season. While it is still marred with the repetitious developments with the victim and tormentor at a number of points, many of the character stories that Ai and her companions become entangled in are a bit more grey in their developments this time around. Characters among both victim and tormentor in many episodes for this season do come off as flawed this time around where the victim doesn't always come as righteous in their justifications of wanting to banish their tormentor and the tormentor does come off as having redeemable traits thatdo not make them off as a shallow baddie like many of the foes you would come across from the first season. Ai's three companions even get their backgrounds explored in this season as you get to know what their lives were like before being killed and meeting with Ai.\\n\\n\r\nThe character arc involving Takuma made for the best material I seen come out of Hell Girl thus far. It digs deep in exploring just how low people will go in caring for their own well-being, particularly with the suffering that the character of Takuma has to endure when things in his hometown get messy. This hits hard with Ai as the problems that Takuma is dealing with mirror her own tragic past and it pushes her to her breaking point, as well as creating some major developments for her character. The end result of the whole mess creates a bittersweet outcome that is sure to be a touching and worthwhile payoff for those that watch it.\\n\\n\r\nVisuals to the series are about on par with the last season having gorgeous scenery and character designs that have a great amount of detail with some clever moments of animation coming from Ai and her companions tormenting the episode's antagonist though there are reused animation clips during Ai's banishing of the episode's antagonist.\\n\\n\r\nThis season is still not without its faults. Other than still being marred with its repetitious plot developments, some episodes still have antagonists with irredeemable traits and there isn't much that we get to learn of new character Kikuri when she joins up with Ai and her companions later in the series.\\n\\n\r\nWhile still marred with some of the flaws that plagued it in the first season, Hell Girl: The Two Mirrors is still better in the quality of its plotting taking a more grey moral approach with exploring the tensions between victim and tormentor that Ai's group comes across, learning about Ai's three companions and an intense character arc that keeps you hooked on it from start to finish.",
            "date": "2011-06-05T21:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 37616,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=37616"
        },
        {
            "content": "So... this is what disappointemt tastes like. Like piss-soaked cardboard, if you ask me.\r\nIf you're already familiar with my earlier review of the first season of Hell Girl, you should already know, that I loved the first season. It had it's annoyances, yes, but overall, it was very good piece of work. So, with no doubt, I was generally excited to hear that there indeed was a second season for one of my favourite animes... with original japanese voices, what whatever! I looked it up, watched it... and afterwards, I was so disappointed, that I actually cried blood! \r\nAs for a short recap... in thefirst season of Hell Girl, the Hell Link was just about this urban myth about a website where you can in the stroke of midnight write down a name of the person that you wish being sented to Hell - of course, no one knows anything about the subject of payment... which is stupid, but to me, it gives a really nice edge. No one took the rumors seriously, until our victim of the week had someone they truly wished for a revenge, and oh boy did they deserve to be punished - in the first season, mind you... not in this one! We had bullies stuffing that one girl's... undercarriage with a glass pipe, and threathening to brake it! We had that one crazy lady, that inherited big cash, killed her family, and took that one girl as a hostage, and killed her puppies, just for funcies, and that crazy family, with obsession for dolls... just to name the view! All royally fucked up people, and I just loved to see them being sented to Hell! What did we got in this season? Well... some dude spilled some coffee on top of some other dude, and scratched his car. Wow... that's hardcore (read my loud sarcasm).\\n\\n\r\nThe formula of the plot stays pretty much the same, as it was in the first season, but only in this season, the pay-up isn't even closely as satisfying, as it was in the first season. The Hell Link isn't anymore as much as some silly urban legend, but almost like some basic common knolewdge, as simply and freguently used, as facebook, or twitter! When the first season showed us some actual predicaments, with victims and true despair, this season gives us just some pesky nuicanses, with shallow means and little to no meaning, all easily removed by simply opening this one website, and sending that nuicanse to the Hell! I like revenge as a way to tell the stroy, or as a plot point, but only, if the revenge is deserved... and, in here, it really isn't! At some point, we do get this weird side story about this one kid, being called the Devil's child by his entire village, and soon afterwards, the whole town starts sending each other to the Hell... for whatever reasons they can come up on that day! Maybe the laundry isn't done! Maybe the rice is cold! Maybe he can't sing! Maybe I don't like her hair! It's all the same to me! \"It's not like my grievance is brought to me by some psycho murderer, or a false marriage, or a rape baby... I'm just gonna use this link I wound from the internet, and send my neighbor to Hell, because his face makes my baby cry!\" Is it already obvious, of why I hate this season so much?! It took that one thing, that it should have been kept the same, and it ruined it... in so many ways!\\n\\n\r\nAnother thing, that I wasn't so keen on, was the side stories of the Hell Girl's helpers - that old guy, hottie in japanese style, and and steaming-hot honey in kimono. As I said in my earlier review, I saw them more appealing to me, when I knew the absolute minimun out of them... which in return contradicts my absolute love and passion for deep, multi-dimensional characters. I didn't need to know, who they were, where they came from, or what kind of people they were... or are, for that matter - it was more scarier to me, when the victims were dealing with something that even I couldn't quite understand. In this season, we do get to know a whole lot more about all of them, who they were and how they came to serve Ai Enma in her guest - which could be a huge plus to someone else - but it really didn't bring anything interesting, or absolutely essetial to the story! I don't want these characters to be people, but some morally grey entities, that'll send me to Hell, if I happen to live in this looney-ville full of crazy people, and my happen to step on someone's shoes! And, oh... just to get this out of my system... I really did hate Kikuri! I really did! Brat...\\n\\n\r\nBut, since I don't wish any of the fans to write my name down to the Hell link, I guess I have to say something nice... about this season, that is. The art was indeed marvellous, and the music was beautiful - especially the ending song... so lovely! But, other than that, the merits end there. The stroy wasn't any good, the characters were given the time of day that I never ever asked for them to have, thus cutting down the energy to create actually interesting revenge-stories, and the enjoyment was... Well, let's just say that I still taste the piss-soaked cardboard! It was lazy, it was stupid, and that whole \"town becoming crazy\"- storyline was just laughably absurd, that I was just waiting, when the whole town sets itself to fire, thus sending them all to Hell all in once! Now that would've been funny... instead of drowning children in the lake!\\n\\n\r\nI would have gladly skipped this season, and not miss a thing, if I would've known for the advance, what was coming to me! If I'd have to recommend this sequel to somebody... I couldn't do it, even if I'm being sented to Hell for it. It isn't any good, and if you already liked the first season, skip this and start with the third. Trust me... you don't wannt to cry blood!\\n\\n\r\nStory: 3\\n\r\nArt: 9\\n\r\nSound: 9\\n\r\nCharacter: 4\\n\r\nEnjoyment: 2\\n\r\nOverall: 4",
            "date": "2016-09-24T02:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 229979,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5422211.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Pahatar",
                "username": "Pahatar"
            },
            "url": "https://myanimelist.net/reviews.php?id=229979"
        },
        {
            "content": "The following review is for both seasons of Hell Girl, because they are really part of the same story;\r\nOk, so we've all read the Lord of the Rings.We all know the trick to it: as soon as a description passage starts, skip 5 pages and continue reading.Same is true for this anime: if you're not prepared, you'd be in serious danger of dropping it, because both seasons , at least for their first halves are so awfully repetitive: Person hates somebody, person contacts Hell Girl, Hell Girl sends said somebody to hell, black mark appears on the contractor's chest in order to remind them thatthey're due to hell as well, after they die.Wash, rinse, repeat ( i'm not 100% sure, but I think one or two episodes of the second season were direct remakes of episodes of the first season).For god's sake, 90% of the words spoken by Enma Ai are reapeated in EVERY single episode.Also some of the situations are quite unrealistic ( way too many little girls going to hell in order to avenge their pets ).\\n\\n\r\nSo why am I giving a &quot;boring&quot; series so high scores you might ask?\\n\r\nWell, because apart from the abovementioned problem, everything else is perfect.The art is beautiful, the music is terrific ( i still have the closing song of the second season stuck in my head ).Each individual episode, if taken separately presents a touching story.And the precious few episodes of each season that are actually relevant to the main story (or at least present the backgrounds of the characters of Enma Ai's entourage) are sure to grab your attention.The characters are very well developped, considering their screen time: rule of the thumb is that if a character appers in more than one episode he/she is sure to make a lasting impression.\\n\\n\r\nSo there you have it.Do check this show out, it's worth it.IMO, if the plot was condensed into one season instead of two (which would have been quite easy), this anime would easily have made it into the top 10.",
            "date": "2008-06-25T21:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 5804,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20177.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Emilio_Rodo",
                "username": "Emilio_Rodo"
            },
            "url": "https://myanimelist.net/reviews.php?id=5804"
        },
        {
            "content": "While this is a continuation of the first Jigoku Shoujo, it is quite different.\r\nFor one, the main character from the last season isn't here (not really surprising), and the story is told predominantly from Jigoku Shoujo's point of view.\r\nTwo, the authors were obviously annoyed with the one-story-per-episode format from before, so... they kept it, and toyed and played with it (very successfully, I might add).\r\nThree, this series is noticeably darker that the previous, and if the previous depressing stories mostly ended in happy endings (of sorts), then these ones don't always follow that rule. \r\nThis is pretty much everything you need to know about Futakomori",
            "date": "2012-03-12T20:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 55889,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fourklift",
                "username": "Fourklift"
            },
            "url": "https://myanimelist.net/reviews.php?id=55889"
        },
        {
            "content": "Jigoku Shoujo Futakomori or Jigoku Shoujo Season 2 does some things better than its predecessor and some things worse but in the end I think Futakomori is a worthy successor to the first season. I am still not sure myself if season 1 or season 2 is better but maybe at the end of this review I can make up my mind.\r\nStory: 8\r\nI gave the first season an 8 for story and given that the general formula does not change in season 2 I see no reason not to also give Futakomori an 8. Once again an episodic format is used and once again itis largely done well. In fact I could almost liken a season of Jigoku Shoujo to a season of Walking Dead in that there are many good episodes, some meh episodes, and a few really great episodes. In retrospect I think season 1 had more great episodes than season 2 but Futakomori still held its own. One criticism that I do think is warranted though is that there is slightly less variety in Futakomori as there was in season 1. What I mean by that is that many episodes have very similar set ups with things like neglect, selfishness, greed, and rape being repeated themes among the villains. Also some of the episodic characters feel recycled but I will save that for the character section. Overall the stories in Futakomori as well as the finale are not quite as strong as those in season 1 but are still good enough to warrant an 8 in my opinion.\\n\\n\r\nArt: 8 \\n\r\nIt felt like there was some sort of slight budget upgrade between season 1 and 2 because Futakomori's art and animation is slightly improved over season 1. Background and landscapes see the biggest improvement along with slight improvements to character animations. Honestly the art improvements are hard to notice unless you watch season 1 and season 2 back to back (like I just finished doing) but it is there. \\n\\n\r\nSound: 8\\n\r\nI remember griping about the music and soundtrack of season 1 for not being as good as it could be. For the most part all of these gripes were addressed in Futakomori. The opening and closing credit songs are well done and fit well with the show. Also the background and incidental music compliments the mood in each episode pretty well. However nothing in the soundtrack really wowed me. The voice acting as usual is excellent and the voice actress for Kikuri should be especially proud of herself for creeping me the heck out in almost every episode that she speaks.\\n\\n\r\nCharacter: 8\\n\r\nThe biggest area where Futakomori is inferior to season 1 in my opinion is character. Futakomori wins some points by fleshing out the backstories of Ren, Wanyuudo, and Hone Onna as well as introducing the delightfully creepy Kikuri, but there is a cost to this. The episodes that add backstories for Ren, Wanyuudo, and Hone Onna were, in my opinion some of the weakest of the season because the writers tried to tell their stories in parallel with a modern day story which for the most part did not work. When the plot is stretched between backstory and trying to have a traditional Hell Girl episode then it starts to tear and we end up with some shallow backstory along with cookie cutter episodic characters who could have been more interesting if the episode devoted more time to them instead. Frankly it would have been much better to have each of Ai's three assistants get their own episode and make up the space by cutting an episode or two out of the finale which does tend to drag on just a bit too long. Without spoiling the finale of Season 2 it is excellent and very heartening however it isn't quite as strong as the finale of Season 1. Besides being a few episodes longer, the Season 2 finale attempts to do a modern recreation of the events that led to Ai becoming Hell Girl but doesn't quite drive this point home as well as it could. Also the character of Takuma (while tragic) is not nearly as interesting as the duo of Hajime and Tsugumi. Takuma is himself just a tragic innocent who is used as a scapegoat. Hajime and Tsugumi were both strong characters with deep backstories who argued about the morality of revenge and finally had their plot lines more or less resolved. Takuma's plot line just sort of ends. Furthermore as much as I loved Kikuri the final episode reveals something that raises questions about how many of her antics were her own. \\n\\n\r\nEnjoyment: 8\\n\r\nI think in retrospect I enjoyed season 1 a bit more than I enjoyed season 2. Season 1 had a large variety of episodic plots that ran well in parallel with an overarching plot. Season 2 in contrast had a smaller variety of episodic plots and an overarching plot that was crammed into about 5 episodes instead of being stretched out over the course of half a season. Also less time is spent asking deep questions about things like revenge than in season 1 and overall there were too many characters that were just evil because someone needed to be the villain.\\n\\n\r\nOverall: 8\\n\r\nWhile season 2 isn't quite as good as season 1, Futakomori is still a very good anime series that fans of season 1 will definitely still enjoy. It is almost like someone consumed season 1 of Jigoku Shoujo, asked for seconds and got seconds...yes the meal isn't quite as good the second time around but its still good.",
            "date": "2017-07-04T09:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 251922,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20390.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/seekster",
                "username": "seekster"
            },
            "url": "https://myanimelist.net/reviews.php?id=251922"
        },
        {
            "content": "I was really becoming tedious by the time I watched this series. Having barely finished Season 1, I thought this series was getting really repetitive, but still, I decided to give it a chance... And I ain't regretting it for a lifetime! Seriously, the story development is simply amazing. It's the only series of Jigoku Shoujo that is actually worth in my opinion, because the changes in the characters' personalities are really surprising, besides non-superficial at all.\r\n      The plot takes long to develop, but when it does, you simply won't take your eyesoff the series anymore. I don't remember in which episode it begins to get interesting because it's been a long time I've watched it, but I guess it's from 12 onwards. And you won't regret continuing if you reach there!\\n\\n\r\n       The first season, however, proves to be necessary to understand some points of its sequel, mainly about that guy called Hajime Shibata, the journalist investigating Enma. \\n\\n\r\n        I give the story aspect a 7/10, because it takes reaaally long to develop. It almost kills you in boredom before finally starting to develop. But when it does, you really won't regret it!\\n\\n\r\n        Overall, though, I give it a 9/10. All of it really is amazing, and when the plot begins to develop, it'll really surprise you. Give it a chance, you won't regret it!",
            "date": "2017-05-06T09:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 247066,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6227650.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RulezAPower",
                "username": "RulezAPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=247066"
        },
        {
            "content": "Well, basically this is the sequel of Jigoku Shoujo, so I bet everyone who watched the first part is expecting a much better story, with deeper characters. Was the plot any better? Honestly, I cannot answer that question.\r\nThere are these episodes in the beginning that kind of irritate me. I mean, as soon as I started watching Jigoku Shoujo, I figured that Ai's companions are just mythical creatures, made up so they can fit the action. I wasn't really expecting any explanation as for what were they, where they came from, why they were helping Ai and such. Just like when you read a fairytaleand suddenly agree with the existence of mermaids, because the story kind of requires you to. The sudden involvement of the three in human life was unexpected. It kind of bothered me a bit, but then I realised it was totaly needed for adding a bit of depth to the characters. So yeah, more points for character building.\\n\\n\r\nThe final part, however, is quite brilliant (much better than the Shibata chase). It covers the brutally realistic subject we were faced to even from the very beginning (hate among human beings), adding a drop of tragedy to the scene of the misunderstood \"Lovely Hills\" town. Just for this single part, I am ready to award the series a perfect score for the storyline.\\n\\n\r\nThe artwork is really enjoyable and catchy (it caught me, that's for sure). \\n\\n\r\nAs for the sound, what can I say? The voice actors were as wisely chosen as in the prequel, and theOP/ED songs were beautiful. \\n\\n\r\nAll in all, I really really enjoyed the anime. I may or may not have cried in the end, but I am too curious about what it will happen next to make this review longer. I am really saddened at the thought that the series is going to end as soon as I finish the next 26 episodes, because this is one of the best animes I have ever had the pleasure to watch.",
            "date": "2013-06-27T08:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 102633,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2754167.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AkiyeHanasaki",
                "username": "AkiyeHanasaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=102633"
        }
    ],
    [
        {
            "content": "Jigoku Shoujo Futakomori is the sequel Jigoku Shoujo. Its basically where the previous story left off. Enma Ai continuing her work as Jigoku Shoujo. The same job she has had for the past 400 years. This time around, it appears that the staff has listened to the fans of this show and pretty much made a brand new show. It still follows the same formula as part one, plot, retribution, and conculsion, but this time around they seem to mix it up alot more often this time around. Some episodes they progress it normally, in other ep\\'s they tarintino it and start from the middleor at the end and work from there. For a show like this its just what the doctor ordered. Each ep doesnt feel like you just watched the same ep over and over again. Even the stories are alot more contraversial this time around as well. There are alot more stories that conflict between the worlds of good and evil and really challange the player on a &quot;what would you do if&quot; basis.\\n\\n\r\nAnother update is the introduction of Kikuri. Nothing much is known about her except for the fact that she acts the complete opposite of Enma Ai. She\\'s mainly the show\\'s comic relief/lolicon. Which is another improvement... you\\'ll see Enma and Kikuri (and company) in alot more different costumes than before. You\\'ll see Enma and Kikuri in so many cute costumes you\\'ll most likely get a kawaii overdose!\\n\\n\r\nWith more variety in charcaters clothing, the next natural step was to give more tv time for Ren and Onna. Wanyuudou was the only one doing the work before, now that has been more evenly distrubuted between the other 2 demons. You also get to understand how and why they end up helping Enma. the artwork is also looks like a huge improvement as well, showing different angles of Enma\\'s home, and different &quot;kawaii situations.&quot; Enma cutting her toenails sounds gross yet it was amazingly cute. Personally i think Kikuri almost stole the show, she definitely grows on you. Lolicon alert: enma and kikuri get nekkid more often in this series.\\n\\n\r\nOverall i really enjoyed this show alot more than before. Its like the series did a complete creative 180, totally redoing everything than before. More money is probably the culprit here. Regardless, the viewers win out because this is a much higher quality product. There is a large warning tho, if you cant stomach sensitive situations like incest, insanity, and mob brutality than steer clear of this show.\\n\r\nIf you even thought JIGOKU SHOUJO should have been better, watch this show! This is what the first season should have been like. Even the ending will leave you speechless...\\n\r\n9/10 (would have been a 10/10 except for the yaoi episode)",
            "date": "2007-07-26T20:11:00+00:00",
            "helpful_count": 183,
            "mal_id": 608,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=608"
        },
        {
            "content": "Title: Jigoku Shoujo Futakomori\r\nAnime: Jigoku Shoujo Futakomori continues to be directed by Takahiro Omori and produced by Studio Deen.  It is twenty-six episodes long and ran from October 7th, 2006 to April 6th, 2007.  Futakomori has yet to be licensed Stateside.\r\nStory: There is a rumor that if there's someone giving you absolute hell and you want to get revenge on them, there's a website that you can access only at midnight, known as Hell Correspondence. Once the name is submitted, Ai Enma (aka Jigoku Shoujo/Hell Girl) will appear to the client and give them a straw doll with a red string wrapped aroundits neck. If the client wishes to take revenge, then all they have to do is pull the string and Ai and her helpers will ferry the person to hell. However, there is a small catch to all this: Once the compact is made with Ai, the person who took revenge will go to hell once they've died as well.\\n\\n\r\nNotice no change in the plot summary?  That's because Futakomori is pretty much more of what we saw back in season one; Revenge of the Week, same episode format, which is disappointing in and of itself.  \\n\\n\r\nThere are some pretty good stories in this season, yes; but the ratio of good episodes to mediocre decreases this season. And they finally get around to telling us the background of Ai's helpers, but the added backgrounds are all that are given in terms of development for Ai and her helpers, and don't even add all that much to the fairly one-note personalities that we saw in the last season.  We do have a recurring character who, thank god, is not as annoying as Tsugumi and Hajime (who do make a cameo appearance in the second-to-last episode of the show), but is introduced about halfway through, and then dropped until about three-quarters of the way through, as if the writers suddenly remembered that they needed something resembling an overarching plot. \\n\\n\r\nThe additional background added for the helpers and the better episodes of the bunch do add some redeeming aspects to the plot, as does the last episode of the series, which more than makes up for what came before it.  But, still, you're left with a bitter taste in your mouth at the end of this season, especially with the little caveat that's tagged on after the end credits.\\n\\n\r\nThere is a third season, Jigoku Shoujo Mitsuganae, which is supposed to start airing October 4th of this year (2008), which will maybe wrap things up once and for all.  Will it?  Probably not, but let me have my optimism, kthnxbye.\\n\\n\r\nArt: The art is just as good as last season, if not better, especially in terms of character design in the individual episodes, and in clips which are frequently used as stock footage.\\n\\n\r\nNo major changes in style, so what I said last season pretty much applies here as well; rich colors, beautiful designs, combining for a stunning effect.\\n\\n\r\nMusic: Again, pretty much the same as what we heard last season, which was well-done and a good mix of Western orchestration, rock, and traditional instrumentation.  The OP and ED are done by the same people and. while they're new, the things I said about them last season still pretty much apply here; upbeat, catchy female J-Pop OP and ED with more traditional instrumentation and lyrics that very directly relate to the show.\\n\\n\r\nSeiyuu: No changes.  Good performances by all, and Ai's lines are still unvaried; at least it's an easy job?\\n\\n\r\nLength: Again, they could've cut this down to thirteen episodes or so and it would've still had the time to tell its story and get some good Revenge of the Weeks in, even more so since the real story doesn't start till the three-quarter's mark.\\n\\n\r\nOverall: It's pretty much what you saw last season, all across the board, with a few new things thrown in here and there.  So, really, if you liked what you saw last season, and don't mind the monotony, you'll like this just fine.  But if you wanted more from this season... well, you might not want to watch this.  Possibly redeemable in the third season (Mitsuganae), but given it's track record, it's probably not going to happen.\\n\\n\r\nStory: 6\\n\r\nArt: 9\\n\r\nMusic: 9\\n\r\nSeiyuu: 7\\n\r\nLength: 6\\n\\n\r\nOverall: 37/50; 74% (C)",
            "date": "2008-09-18T20:12:00+00:00",
            "helpful_count": 68,
            "mal_id": 8053,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14299.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Venneh",
                "username": "Venneh"
            },
            "url": "https://myanimelist.net/reviews.php?id=8053"
        },
        {
            "content": "Jigoku Shoujo Futakomori, being the direct sequel to Jigoku Shoujo, offers more of the same but does everything much better. \r\nThe story centers around a website called Jigoku Tsuushin (Hotline to Hell), which can only be visited at midnight. If you type in a person that you hate's name and your hate is fierce enough, the red-eyed, black-clad Enma Ai will appear before you and offer you a straw doll. If you pull off the red string attached to the doll, your antagonist will be sent immediately to hell (after being punished for his/her sins if she/he has any). However, by doing this, you automaticallycondemn you own soul, and when you die, you will be going to a hot place as well.\\n\\n\r\nThe first and second series are similar in many ways; the first 10-15 episodes are strongly episodic and introduce new characters all the time, most of which you will never see again after that particular episode. All the stories are, naturally, dramatic and sad, showing the worst traits that mankind is equipped with. In the first series, the episodes followed a chronologic formula: first a couple of scenes showing the conflict between two persons, then the victim visiting Jigoku Tsuushin, receiving the straw doll and then pulling the string. Aftar that, the culprit receives his/her punishment and is ferried to hell by Enma Ai.\\n\\n\r\nIt became a bit repetitive and annoying after a while. In Futakomori, the scenarios are much more varied, presenting different points of view on the conflicts and many twists and turns. We also get much more information on the three demons accompanying Ai, helping her with investigating the conflicts: during what eras they lived, what they were back then, why they couldn't die in peace and how their pasts affect their present actions. Those four, Ai included, are all very intriguing characters, and the more you know about them, the more you like them.\\n\\n\r\nNew to the series is a little girl called Kikuri, who apparently lives together with Ai and often shows up in the middle of the conflicts, causing mischief. She is rather evil and her big blue eyes are, simply put, scary. I didn't really like her, but she has her moments.\\n\\n\r\nThere are not many new melodies in the music deparment; almost all music is recycled from the first season and is still going strong, enhancing the sad and violent scenes wonderfully. As for the art, it's great as well and Ai is as beautiful as ever.\\n\\n\r\nAround episode 20, the story starts getting really interesting. I will not spoil anything, but the ending is great and I can't wait to see what happens in Mitsuganae, the third season. \\n\\n\r\nJigoku Shoujo Futakomori beats its predecessor in all categories, sports great visuals, fitting music, excellent characters and a dark, twisted sense of humour. The only thing I can complain about is that Hajime and Tsugumi from the first season got next to no screentime at all, which is a bit sad since I liked them a lot. Apart from that, this is one of the best animes I've ever seen. Highly recommended, especially if you thought the first season had potential but was too repetitive.",
            "date": "2008-03-30T08:51:00+00:00",
            "helpful_count": 52,
            "mal_id": 3483,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24106.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tenchio",
                "username": "Tenchio"
            },
            "url": "https://myanimelist.net/reviews.php?id=3483"
        },
        {
            "content": "So, you people thirsty for a second round of Ai Enma action want to know if it's worth it, right?  Well, the answer is: maybe.  Read below and find out.\r\n*I'm going to make a lot of references/comparisons to the first season (which I've also reviewed), so this review may not make a lot of sense if you haven't seen it.  (Watching Futakomori without watching season one would be pretty stupid anyway.)\r\nStory: 9.  This time around, we're treated to the refreshing perspective of Ai and her helpers--as opposed to only the viewpoint of the victim resorting to desperate measures.  The tradeoffhere, though, is that we lose basically all of the mystery and intrigue present in the first season.  Ai appearances are much more frequent, and there's really no more excitement when she shows up behind people.  We get to see what it's like for the gang as they gather information about their clients and targets.  Just imagine this:  Ai in a restaurant uniform, taking your order.  Interested?  I thought so.  We're shown their reactions to those involved, their conclusions, and their emotional responses.  They take much more active and hands-on roles in the dealings of their clients.  We also get the back stories of each of Ai's helpers, which were very much needed.  The boring, formulaic nature of the first season is basically scrapped in favor of a lot more diversity and flexibility.  There's really no predictibility anymore:  You really can't say for sure what'll happen in any given episode.  But again, like in the first season, the only real continuous story occurs in the last 5 episodes.  But when it DOES, it's pretty frickin' sweet.\\n\\n\r\nArt: 8.  Definitely upgraded from the last season.  It's kind of like the art quality of everything else caught up to Ai.  (Although, this DOES mean that she doesn't stand out as more.  Sad me.)  The facial expressions are a LOT better, and the side characters are more creatively done--they don't suffer from the epic laziness of the characters made last season, who hardly looked different at all.  They also use some stock footage again in the same place (Ai departing to \"fetch\" the target), and they even had the nerve to copy Wanyuudo and the chariot pixel-for-pixel from the first season.  However, the length of footage repeated is shorter--maybe 5 seconds as opposed to 15-20--and it's only used a few times.\\n\\n\r\nSound: 8.  Some of the tracks from season one's OST are recycled, some are revamped, and many more are mixed in.  It's okay, though:  It wouldn't really be the same without some of these memorable trademarks.  The OST for the franchise is pretty impressive in general, and the tracks fit on-screen events like gloves.  The OP is a little better than season one's, but the opening sequence kind of makes it look like it'll be a slice of life series or something like that.  But we know better, don't we?  I really miss \"Basting,\" the ED from season one, but this one's alright too.  Speaking of missing things, I REALLY miss the English dub.  Brina Palencia as Ai... *sob*.  And she gets considerably more lines now, too!  Damn you, Funimation...\\n\\n\r\nCharacter: 8.  Like I said above, the character designs have vastly improved from the last season.  (The characters don't look like they were all made from the same generic template.)  Ren, Hone Onna, and Wanyuudo get character development, and their back stories are revealed.  The supporting cast is pretty good in general; however, there are times where you may find yourself facepalming at the stupidity of some of them.\\n\\n\r\nEnjoyment: 8.  (As you can see, lower than my score for season one.)  In some ways, it's more enjoyable:  Seeing the gang more and their activities is definitely fun (especially Ai; more Ai screentime is ALWAYS good), and so is learning about them as characters.  But in others, it's not:  If you enjoyed watching people suffer for their sins in the first season, you'll be woefully disappointed here.  You get to see very little of that.  Like I mentioned, a lot of the mystery, suspense, and intrigue is gone, since it's told from the perspective of Ai's gang, and the supernatural elements have very little gravity anymore.  Even Ai appearing behind people isn't nearly as cool and eerie. =(\\n\\n\r\nThe first season served the much more basic purpose of focusing on people being wronged and their desires for revenge.  Season two, however, serves as much more of a social commentary--focusing less on vengeance itself and more on the situation and circumstances surrounding the characters (the monsters of hate, envy, deception, and anger; politics and social and family life aren't uncommon).  HERE is where it's better to ask the question if revenge is really the best option.  (The last season was NOT the place; as I mentioned in that review, all evidence pointed to revenge as being the best choice.  Basically, it's less one-sided.)\\n\\n\r\nWe aren't shown nearly as many of the actual torture sequences the targets are put through, which I was very disappointed by.  (The first two, however, are more intense than the ones in the first season, and I loved them.)  The sadistic appeal of the first season is gone; instead, you're forced to question yourself and how you think about things.\\n\\n\r\nOverall: 8.  In the end, you'll have to decide for yourself if you like the changes or not.  As you can see, my ratings for each category are a lot more balanced than the first season.  Personally, I enjoyed the justice/vengeance focused first season more; however, this season improves upon the last in the art, story, and character departments.  You also don't have to deal with the formulaic-ness all over again.\\n\\n\r\nAll in all:  If you liked season one, I recommend Futakomori.  Just be prepared to have a little bit of an open mind, 'cuz it's a little different.\\n\\n\r\nAnd now, the decision rests with you~",
            "date": "2011-12-17T22:02:00+00:00",
            "helpful_count": 37,
            "mal_id": 49461,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557765.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DraconisMarch",
                "username": "DraconisMarch"
            },
            "url": "https://myanimelist.net/reviews.php?id=49461"
        },
        {
            "content": "\"Hey, did you hear about Hell Correspondence? They say if you submit someone's name there you can send that person to hell\". These ever spreading rumors have given Enma Ai the chance to fill the pits of Hell with many a soul hardening her heart with every request sent to her.\r\nThe second season continues with more hatred and suffering as this well designed story advances revealing details about the main characters in an endless chain that mimics reality, it proves to us over and over again what hatred does to us, it turns us into something inhuman.\r\nOne of the various improvements made since the firstseason are the way episodes start and progress that way you don't have the feeling you've seen this before.Also something I have appreciated about this anime is that it slowly presents you everything, rather than suddenly dropping it on you. Another improvement is the introduction of Kikuri which you soon realize, is the complete opposite of Enma Ai with her playful personality and mischievous acts. The fact that makes her intriguing is that nothing is revealed about her until the final episode.\\n\\n\r\nOh look it's 00:00 am... what are you going to do?",
            "date": "2013-05-27T05:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 98595,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=98595"
        },
        {
            "content": "The Story - It's actually pretty, well, not clear. Actually, Jigoku Shoujo's story line is about a girl who sends people to hell. Actually, The story plot only applies at episode 18 + or so. I'll give it a 9, though.\r\nThe Art -Are you kidding? The graphic rocks! It actually made it 3d like, kinda like the Haruhi Suzumiya graphics. It actually is believable, ah. I wish the Hell Girl exist. :<. Anyways, I'll give it a 10.\r\nSound -The Sound is fantastic. Indigo Dye actually got Ai's emotion coming and going. The Opening song is pretty good, too. 10.\r\nCharacter -It clears all Ai's assistant's erm,past. So it's pretty good. And to think for 26 okay, 42 PEOPLE's situation! Whoa. 10 points for that.\\n\\n\r\nEnjoyment -It's really enjoyable. I mean, it's really scary, it's enjoyable. I really love the ending, and It's the best ending I have ever seen so far. Okay, I know two more, but I don't really want to mention it. 10.\\n\\n\r\nOverall -If you like the original Jigoku Shoujo, then you'll love this. Even if you don't or haven't watched Jigoku SHoujo Futakomori, I'm pretty sure you'll fall in love with this, too. 10.\\n\\n\\n",
            "date": "2008-03-27T00:44:00+00:00",
            "helpful_count": 10,
            "mal_id": 3421,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21064.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/underMebius",
                "username": "underMebius"
            },
            "url": "https://myanimelist.net/reviews.php?id=3421"
        },
        {
            "content": "\"Ima Nanji Ka Oshiete Yume To Itte Dakishimete\" sounds familiar, right?\r\nThe new Hate Cycle has improved & is better, faster & stronger.\r\nIT'S THE BEST SEASON OF JIGOKU SHOUJO.  \r\nit truly is\r\nThe scenarios in most episodes are more well thought of than the previous season and this where we see how Hell Girl really feels for the humans. The \"Shibata needs to stop Hell Girl\" Team is\r\nnot present anymore and it's actually new to me ( well kinda ) because no one tries to stop Hell Girl & no one was actually able to stop Hell Girl in this time around. \r\nStory - 9\r\nAs Isaid, the scenarios were more thought of than it's previous season and \\n\r\nonce you watch an episode, it makes you want to watch more. Aside from the episodes being \\n\r\nbetter, the last arc of the show really made it have such a nice ending. -no spoilers you'll have to watch it yourself to find out- :p heehee\\n\\n\r\nArt & Sound - 8\\n\r\nThe Art is still great and the Sound is still the same \\n\\n\r\nCharacter - 9\\n\r\nEvery Main Character is the same except for Enma Ai because this season shows us Ai's -pity on the humans- side and it's really nice that even if she tried to lock her feelings, some are still breaking free.\\n\\n\r\nEnjoyment - 9\\n\r\nI enjoyed it alot & I hope the next season would totally kill. \\n\\n\r\nOverall - 9 \\n\r\nWell, now you know why. :)\\n\\n\\n\\n\\n\r\nAnd as they say, Haters gon' Hate.",
            "date": "2012-05-14T05:31:00+00:00",
            "helpful_count": 8,
            "mal_id": 61179,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gdjdelacruz",
                "username": "gdjdelacruz"
            },
            "url": "https://myanimelist.net/reviews.php?id=61179"
        },
        {
            "content": "The Second Season of Jigoku Shoujo has a few different names: Futakomori, Two Cages, Two Mirrors and my favorite Jigoku Shoujo 2: Electric Boogaloo. Ok I’m kidding on that last one, though Ai sending people to hell via break dancing would be entertaining .Regardless of what it is called it’s still the much improved second season of Jigoku Shoujo, so let’s dive right in.\r\nThe stories are the first big improvement, dropping the first season’s clear cut black and white morality for a more realistic grey morality. Gone is the pure innocent victim who is tortured by the big bad tormenter. Now both the victim andthe receiver of the revenge usually have blood on their hands so to speak. As a result they stories feel somewhat more believable, though they do occasionally throw in someone who is just plain horrible to remind us that some people are really just assholes.  The revenges themselves are cut down dramatically but it does make each one we do get much more special and fun.  Also it abandons having a more overarching story till about episode 14 and even then it doesn’t pick up until episode 22 but again less is more and it ends wonderfully. The episodes move at much better pace than the first season's and I found myself breezing through this series once I picked it up again after a hiatus.\\n\\n\r\nThe main cast gets a new addition in the form of Kikuri, who flirts between gosh darn adorable to holy hell that was scary; she’s a nice foil to the very serious AI. The original 3 helpers now get a more expanded backstories and you get a better feel for the characters. Wanyuudou and Ren’s episodes are fairly good without really detracting from the main revenge plot and Ren’s is probably one of my favorite episodes of the season. Hone Onna is a fine character however; I’m not sure what it is but the 2 episodes that feature her prominently felt very contrived and were probably the worst of the season. As mentioned above characters specific to each story feel more realistic and manage to pull a few tear jerkers for those sent to hell. It also helps that Ai and her group are much more involved with each target giving us that allows for said character development. \\n\\n\r\nThe sound and the art were both amazing, the music added to the creepy vibe of the series and it’s always nice to hear Sakasama no Chou again in random places. As usual I’m never quite sure what to say about the art, it looks good and flows nicely. Also special mention should go to Kikuri’s eyes which help the cute to creepy transition though they have a habit of falling in to the uncanny valley when not scaring the hell out of me. Same with the music as mentioned above it builds atmosphere nicely and it’s good not much I can really say.\\n\\n\r\nOverall it’s a great series that plays and subverts the established formula from season one with better character development. It’s a ton fun and shouldn’t be missed especially if you loved the first season and even if you don’t or didn’t watch the first season watches it anyway. \\n",
            "date": "2011-04-28T12:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 36539,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/405377.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Pink_Princess",
                "username": "Pink_Princess"
            },
            "url": "https://myanimelist.net/reviews.php?id=36539"
        },
        {
            "content": "Before we get to my actual review, I would like the viewers to understand that I AM NOT A SUMMARIZER. If you want to know what's the plot, read the SUMMARY, and don't mark me down for not saying anything about the story. I tell you what elements are impacting in the story and what my opinion is. ANYWAYS...\r\nThe Second season of Jigoku Shoujo lived up to it's expectations and once again, delivered that supernatural and eerie feel that we love it for. Enma Ai's return to the business was gracefully reinstated after the ending of the first season and was even more \"scary.\" Plusthe new mini-stories were fantastic and didn't have that repeating feeling that occurred in the first season. The anime really fixed all its errors from the previous season. BUT of course there was a new problem that occurred. Unlike the first season, I main plot failed to appear until you are three quarters of the way through the anime.\\n\\n\r\nOverall 9/10. This anime really put out all it had and had that phenomenal ending that I so enjoy. Only real problem was pace, but the short background stories on Enma Ai's servants made up for that easily.",
            "date": "2009-04-11T14:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 14049,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=14049"
        },
        {
            "content": "Story (7.7) - Well, this aspect is like the first season of this anime. Each episode has an own story, and theres almost no sequence till the last episodes. However, in this season the episodes are much less formulatic, i mean, in this one they give us new situations and the end is not always the same, i mean, there are some that dont seal the contract for several reasons, by other words there are more diferrences between the episodes..i gave 7.2 to the first season, and i gave +0.5 pts since it got slighty better.\r\nArt (8.3) - Art is good, the design is nice,the characters look good..not so different from the first season. I also like some details that make the graphics look better, so an 8 fits well here.\\n\\n\r\nSound (7.3) - Nothing special, just enough to make it quite enjoyable.\\n\\n\r\nCharacter (8.3) - Much better in the second season. Finally i start to know more details of the mains characters, we finally start to know about their past..and a final aspect, they now start to show more emotions in each cases, that makes the anime much more interesting.\\n\\n\r\nEnjoyment (8.4) - Like the first season i think it is very entretaining, because it has a lot os suspense and psychological aspects. There is also some action (another good thing) that wasnt common in the first season.\\n\\n\r\nOverall (8.4) - Better than season 1. Not enough to give it a 9, but very close to it, and that means very good one. i recommend to someone who likes the first season.\\n",
            "date": "2008-04-01T14:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 3532,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25161.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/fr0z3nshad3",
                "username": "fr0z3nshad3"
            },
            "url": "https://myanimelist.net/reviews.php?id=3532"
        },
        {
            "content": "Yami ni madoishi awarena kage ---Shade lost in darkness\r\nhito wo kizutsuke otoshimete ---you hurt people\r\ntsumi ni oboreshi gou no tama ---soul full of sins\r\nippen shinde miru? ---Would die once?\r\nIf you watched not dubbed version these words are probably got carved into your head. Enma Ai also known as Jigoku Shoujo is a girl keeping a huge hate herself deeply shut in her heart, mercilessly fulfills her duty. This time she continues to fulfill her duties of Jigoku Shoujo the same way, mercilessly, emotionlessly, decisively, washing people down into the hell.\r\nJigoku Shoujo Futakomori again follows the same pattern as prequel continuing episodic stories, but now storiesare a little less straightforward and less predictable. Though you will still hear the phrase I put in the beginning many times as it is like a gist of the series. However they add more details about her company, her servants, helping her do the \"job\". Now narration is shifted to the perspective of Ai with her group. So you will see her cold face more often.\\n\\n\r\nIn episodes the death of people and other reasons for unhappiness are featured in extent great enough to make people go mad to use the service of Jigoku Shoujo, sending people to hell immediately at cost of being send to hell themselves in afterlife \"shinda ato no hanashi dakedo\". In some stories you can see a significant motive and in other it is just a fickle. Human lives are ruined, despite it was avoidable. For some ends you can see like it is just better for them to be in hell.\\n\\n\r\nEvery time person is sent to hell appears a scene with Ai in kimono pushing the boat with a doomed person to the gates of hell. Actually you often may notice elusive emotions of that girl, even though she has to do her job with her feelings shut deep into her heart, she releases some emotions. But it is not up to her to decide what is wrong and what is right, she does her job whatever happens, crying inside or being overfilled with rage. Yet she can't do anything about it being not allowed to interfere.\\n\\n\r\nArt is not much of difference compared to prequel, some improvements are noticeable so if you liked that art here it is. As I mentioned that it follows the same pattern, dark atmosphere and dark scenes are put with an exquisite manner. But I must say that Ai's kimono in previous season was more appealing to me, that dark purple, am I the only one so?\\n\\n\r\nFor the music I'd say quite the same, not many changes, some improvements. Awesome OP and ED soundtracks never skipped those. For a few times you may notice OP soundtrack from the first season playing at the background, nice reminiscence. Seiyuu staff is great, you can well known voices even for episodic characters, I think I heard Yukana at ep. 19, but she is not mentioned at MAL to have a role here.\\n\\n\r\nI was deeply impressed by the first season of Jigoku Shoujo and even though second season has the same concept they did a good job keeping it interesting. Closer to the end of the season episodes are getting more tense to making the perfect final impression.\\n\\n\r\nSono urami wo jigoku he nagashimasu ---I wash this hate down to hell",
            "date": "2016-12-08T06:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 235070,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4090177.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/highfeel",
                "username": "highfeel"
            },
            "url": "https://myanimelist.net/reviews.php?id=235070"
        },
        {
            "content": "The direct sequel to Jigoku Shoujo, and Enma Ai is back. Ai and her followers continue the job of sending off people to hell, but this time a new, mysterious character is introduced and another incredible season starts again.\r\nUpgraded story, upgraded characters and upgraded tragedy! The Futakomori will show the horrifying evil sides within you. Again like the first season, the second season comes back with more stories full of remorse. It won't let viewers down and the story is AMAZING!!! The series is similar to its prequel and instead of the Shibata family, a new family will be involved deeply with Hell Girl.\r\nThe charactersare same as the prequel, except for a mysterious girl in the team: Kikuri. Personally I really hate her... she gives me the creeps. The three other loyal followers are now more active, gathering information by disguising as humans. Their own pasts are revealed as well. A boy will also recur in the series since he will be the victim of THE ultimate prejudice one can possibly imagine. The series will develop into the climax after the 20th episode and I assure you that the (tiny spoiler!) Lovely Hills Arc will blow your mind away. Also, you will briefly see an old face from the prequel.\\n",
            "date": "2010-10-01T02:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 30953,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/hangbin9",
                "username": "hangbin9"
            },
            "url": "https://myanimelist.net/reviews.php?id=30953"
        },
        {
            "content": "“Hell still lingers around”\r\nThe Story...\r\nAfter Enma Ai knowing her past, the Hell Hotline still give services to people who have grudges growing in their hearts. As she continues working as the Hell Girl, there are lot more tales to see along the way. \r\nIt is a continuation of the preceding series which still focuses on taking revenge, giving chances, second thoughts, and bringing entertainment on its mystery, supernatural, and horror with better drama on it. As the story moves along, there are a lot of changes and slightly improvement happened, as making the short tales pleasing by putting better depth on it, which becomes entertainingto watch than before. Although there aren’t quite changes on what method they use on fulfilling someone’s desires, they put more emphasis on the tale that they're telling about. \\n\\n\r\nWith the nice development of the story which is even better now – Adding new arcs & concepts to the story, surely it is quite a different experience than before.\\n\\n\r\nArt & Animation...\\n\\n\r\nAll is wonderful now as they made a different improvement in the art & animation. It became more attractive by putting some new lively colors that surely blends on its theme. The effects and design is more appropriate, and it gives more impact to the ambiance of the story. Also with a less repetitive actions throughout the show, it becomes even worthy to watch.\\n\\n\r\nSound...\\n\\n\r\nThe sounds are quite similar as before, the voice delivery of the main characters and the sound effects that gives a chilling feeling. Nothing particular changed on how they perform it, but maybe the difference about the sounds and BGM is that they somewhat organize the sequence of inserting it throughout the show for it to be more effective. Also with the new OP & ED song, it surely gives a quite new melody to hear.\\n\\n\r\nCharacters…\\n\\n\r\nSame as before, nothing changed on the appearances of the main characters rather improving and revealing their true feelings and identity merely gives quite entertainment to view on. As a new main character appeared in this series, it quite adds up some twist and mystery throughout the show. Also with a new batch of characters to be involved, it somewhat helps on improving the insight of the show.\\n\\n\r\nEnjoyment…\\n\\n\r\nOn its first series which is kind of dull, eventually this time it is a lot enjoyable than before as they made a lot of improvement and changes along the way with the animation, art, characters, and most of the entire story telling.\\n\\n\r\nOverall…\\n\\n\r\nAfter watching the first series which is quite frustrating, now this series may turn up your frustration to a new view into its story telling procedure, as many changes happened and new arcs to watch on. It is definitely a lot different & wonderful sequel to follow.",
            "date": "2010-04-16T01:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 25117,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=25117"
        },
        {
            "content": "The second season of Hell Girl is a great improvement over the first season. While it is still marred with the repetitious developments with the victim and tormentor at a number of points, many of the character stories that Ai and her companions become entangled in are a bit more grey in their developments this time around. Characters among both victim and tormentor in many episodes for this season do come off as flawed this time around where the victim doesn't always come as righteous in their justifications of wanting to banish their tormentor and the tormentor does come off as having redeemable traits thatdo not make them off as a shallow baddie like many of the foes you would come across from the first season. Ai's three companions even get their backgrounds explored in this season as you get to know what their lives were like before being killed and meeting with Ai.\\n\\n\r\nThe character arc involving Takuma made for the best material I seen come out of Hell Girl thus far. It digs deep in exploring just how low people will go in caring for their own well-being, particularly with the suffering that the character of Takuma has to endure when things in his hometown get messy. This hits hard with Ai as the problems that Takuma is dealing with mirror her own tragic past and it pushes her to her breaking point, as well as creating some major developments for her character. The end result of the whole mess creates a bittersweet outcome that is sure to be a touching and worthwhile payoff for those that watch it.\\n\\n\r\nVisuals to the series are about on par with the last season having gorgeous scenery and character designs that have a great amount of detail with some clever moments of animation coming from Ai and her companions tormenting the episode's antagonist though there are reused animation clips during Ai's banishing of the episode's antagonist.\\n\\n\r\nThis season is still not without its faults. Other than still being marred with its repetitious plot developments, some episodes still have antagonists with irredeemable traits and there isn't much that we get to learn of new character Kikuri when she joins up with Ai and her companions later in the series.\\n\\n\r\nWhile still marred with some of the flaws that plagued it in the first season, Hell Girl: The Two Mirrors is still better in the quality of its plotting taking a more grey moral approach with exploring the tensions between victim and tormentor that Ai's group comes across, learning about Ai's three companions and an intense character arc that keeps you hooked on it from start to finish.",
            "date": "2011-06-05T21:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 37616,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=37616"
        },
        {
            "content": "So... this is what disappointemt tastes like. Like piss-soaked cardboard, if you ask me.\r\nIf you're already familiar with my earlier review of the first season of Hell Girl, you should already know, that I loved the first season. It had it's annoyances, yes, but overall, it was very good piece of work. So, with no doubt, I was generally excited to hear that there indeed was a second season for one of my favourite animes... with original japanese voices, what whatever! I looked it up, watched it... and afterwards, I was so disappointed, that I actually cried blood! \r\nAs for a short recap... in thefirst season of Hell Girl, the Hell Link was just about this urban myth about a website where you can in the stroke of midnight write down a name of the person that you wish being sented to Hell - of course, no one knows anything about the subject of payment... which is stupid, but to me, it gives a really nice edge. No one took the rumors seriously, until our victim of the week had someone they truly wished for a revenge, and oh boy did they deserve to be punished - in the first season, mind you... not in this one! We had bullies stuffing that one girl's... undercarriage with a glass pipe, and threathening to brake it! We had that one crazy lady, that inherited big cash, killed her family, and took that one girl as a hostage, and killed her puppies, just for funcies, and that crazy family, with obsession for dolls... just to name the view! All royally fucked up people, and I just loved to see them being sented to Hell! What did we got in this season? Well... some dude spilled some coffee on top of some other dude, and scratched his car. Wow... that's hardcore (read my loud sarcasm).\\n\\n\r\nThe formula of the plot stays pretty much the same, as it was in the first season, but only in this season, the pay-up isn't even closely as satisfying, as it was in the first season. The Hell Link isn't anymore as much as some silly urban legend, but almost like some basic common knolewdge, as simply and freguently used, as facebook, or twitter! When the first season showed us some actual predicaments, with victims and true despair, this season gives us just some pesky nuicanses, with shallow means and little to no meaning, all easily removed by simply opening this one website, and sending that nuicanse to the Hell! I like revenge as a way to tell the stroy, or as a plot point, but only, if the revenge is deserved... and, in here, it really isn't! At some point, we do get this weird side story about this one kid, being called the Devil's child by his entire village, and soon afterwards, the whole town starts sending each other to the Hell... for whatever reasons they can come up on that day! Maybe the laundry isn't done! Maybe the rice is cold! Maybe he can't sing! Maybe I don't like her hair! It's all the same to me! \"It's not like my grievance is brought to me by some psycho murderer, or a false marriage, or a rape baby... I'm just gonna use this link I wound from the internet, and send my neighbor to Hell, because his face makes my baby cry!\" Is it already obvious, of why I hate this season so much?! It took that one thing, that it should have been kept the same, and it ruined it... in so many ways!\\n\\n\r\nAnother thing, that I wasn't so keen on, was the side stories of the Hell Girl's helpers - that old guy, hottie in japanese style, and and steaming-hot honey in kimono. As I said in my earlier review, I saw them more appealing to me, when I knew the absolute minimun out of them... which in return contradicts my absolute love and passion for deep, multi-dimensional characters. I didn't need to know, who they were, where they came from, or what kind of people they were... or are, for that matter - it was more scarier to me, when the victims were dealing with something that even I couldn't quite understand. In this season, we do get to know a whole lot more about all of them, who they were and how they came to serve Ai Enma in her guest - which could be a huge plus to someone else - but it really didn't bring anything interesting, or absolutely essetial to the story! I don't want these characters to be people, but some morally grey entities, that'll send me to Hell, if I happen to live in this looney-ville full of crazy people, and my happen to step on someone's shoes! And, oh... just to get this out of my system... I really did hate Kikuri! I really did! Brat...\\n\\n\r\nBut, since I don't wish any of the fans to write my name down to the Hell link, I guess I have to say something nice... about this season, that is. The art was indeed marvellous, and the music was beautiful - especially the ending song... so lovely! But, other than that, the merits end there. The stroy wasn't any good, the characters were given the time of day that I never ever asked for them to have, thus cutting down the energy to create actually interesting revenge-stories, and the enjoyment was... Well, let's just say that I still taste the piss-soaked cardboard! It was lazy, it was stupid, and that whole \"town becoming crazy\"- storyline was just laughably absurd, that I was just waiting, when the whole town sets itself to fire, thus sending them all to Hell all in once! Now that would've been funny... instead of drowning children in the lake!\\n\\n\r\nI would have gladly skipped this season, and not miss a thing, if I would've known for the advance, what was coming to me! If I'd have to recommend this sequel to somebody... I couldn't do it, even if I'm being sented to Hell for it. It isn't any good, and if you already liked the first season, skip this and start with the third. Trust me... you don't wannt to cry blood!\\n\\n\r\nStory: 3\\n\r\nArt: 9\\n\r\nSound: 9\\n\r\nCharacter: 4\\n\r\nEnjoyment: 2\\n\r\nOverall: 4",
            "date": "2016-09-24T02:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 229979,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5422211.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Pahatar",
                "username": "Pahatar"
            },
            "url": "https://myanimelist.net/reviews.php?id=229979"
        },
        {
            "content": "The following review is for both seasons of Hell Girl, because they are really part of the same story;\r\nOk, so we've all read the Lord of the Rings.We all know the trick to it: as soon as a description passage starts, skip 5 pages and continue reading.Same is true for this anime: if you're not prepared, you'd be in serious danger of dropping it, because both seasons , at least for their first halves are so awfully repetitive: Person hates somebody, person contacts Hell Girl, Hell Girl sends said somebody to hell, black mark appears on the contractor's chest in order to remind them thatthey're due to hell as well, after they die.Wash, rinse, repeat ( i'm not 100% sure, but I think one or two episodes of the second season were direct remakes of episodes of the first season).For god's sake, 90% of the words spoken by Enma Ai are reapeated in EVERY single episode.Also some of the situations are quite unrealistic ( way too many little girls going to hell in order to avenge their pets ).\\n\\n\r\nSo why am I giving a &quot;boring&quot; series so high scores you might ask?\\n\r\nWell, because apart from the abovementioned problem, everything else is perfect.The art is beautiful, the music is terrific ( i still have the closing song of the second season stuck in my head ).Each individual episode, if taken separately presents a touching story.And the precious few episodes of each season that are actually relevant to the main story (or at least present the backgrounds of the characters of Enma Ai's entourage) are sure to grab your attention.The characters are very well developped, considering their screen time: rule of the thumb is that if a character appers in more than one episode he/she is sure to make a lasting impression.\\n\\n\r\nSo there you have it.Do check this show out, it's worth it.IMO, if the plot was condensed into one season instead of two (which would have been quite easy), this anime would easily have made it into the top 10.",
            "date": "2008-06-25T21:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 5804,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20177.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Emilio_Rodo",
                "username": "Emilio_Rodo"
            },
            "url": "https://myanimelist.net/reviews.php?id=5804"
        },
        {
            "content": "While this is a continuation of the first Jigoku Shoujo, it is quite different.\r\nFor one, the main character from the last season isn't here (not really surprising), and the story is told predominantly from Jigoku Shoujo's point of view.\r\nTwo, the authors were obviously annoyed with the one-story-per-episode format from before, so... they kept it, and toyed and played with it (very successfully, I might add).\r\nThree, this series is noticeably darker that the previous, and if the previous depressing stories mostly ended in happy endings (of sorts), then these ones don't always follow that rule. \r\nThis is pretty much everything you need to know about Futakomori",
            "date": "2012-03-12T20:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 55889,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fourklift",
                "username": "Fourklift"
            },
            "url": "https://myanimelist.net/reviews.php?id=55889"
        },
        {
            "content": "Jigoku Shoujo Futakomori or Jigoku Shoujo Season 2 does some things better than its predecessor and some things worse but in the end I think Futakomori is a worthy successor to the first season. I am still not sure myself if season 1 or season 2 is better but maybe at the end of this review I can make up my mind.\r\nStory: 8\r\nI gave the first season an 8 for story and given that the general formula does not change in season 2 I see no reason not to also give Futakomori an 8. Once again an episodic format is used and once again itis largely done well. In fact I could almost liken a season of Jigoku Shoujo to a season of Walking Dead in that there are many good episodes, some meh episodes, and a few really great episodes. In retrospect I think season 1 had more great episodes than season 2 but Futakomori still held its own. One criticism that I do think is warranted though is that there is slightly less variety in Futakomori as there was in season 1. What I mean by that is that many episodes have very similar set ups with things like neglect, selfishness, greed, and rape being repeated themes among the villains. Also some of the episodic characters feel recycled but I will save that for the character section. Overall the stories in Futakomori as well as the finale are not quite as strong as those in season 1 but are still good enough to warrant an 8 in my opinion.\\n\\n\r\nArt: 8 \\n\r\nIt felt like there was some sort of slight budget upgrade between season 1 and 2 because Futakomori's art and animation is slightly improved over season 1. Background and landscapes see the biggest improvement along with slight improvements to character animations. Honestly the art improvements are hard to notice unless you watch season 1 and season 2 back to back (like I just finished doing) but it is there. \\n\\n\r\nSound: 8\\n\r\nI remember griping about the music and soundtrack of season 1 for not being as good as it could be. For the most part all of these gripes were addressed in Futakomori. The opening and closing credit songs are well done and fit well with the show. Also the background and incidental music compliments the mood in each episode pretty well. However nothing in the soundtrack really wowed me. The voice acting as usual is excellent and the voice actress for Kikuri should be especially proud of herself for creeping me the heck out in almost every episode that she speaks.\\n\\n\r\nCharacter: 8\\n\r\nThe biggest area where Futakomori is inferior to season 1 in my opinion is character. Futakomori wins some points by fleshing out the backstories of Ren, Wanyuudo, and Hone Onna as well as introducing the delightfully creepy Kikuri, but there is a cost to this. The episodes that add backstories for Ren, Wanyuudo, and Hone Onna were, in my opinion some of the weakest of the season because the writers tried to tell their stories in parallel with a modern day story which for the most part did not work. When the plot is stretched between backstory and trying to have a traditional Hell Girl episode then it starts to tear and we end up with some shallow backstory along with cookie cutter episodic characters who could have been more interesting if the episode devoted more time to them instead. Frankly it would have been much better to have each of Ai's three assistants get their own episode and make up the space by cutting an episode or two out of the finale which does tend to drag on just a bit too long. Without spoiling the finale of Season 2 it is excellent and very heartening however it isn't quite as strong as the finale of Season 1. Besides being a few episodes longer, the Season 2 finale attempts to do a modern recreation of the events that led to Ai becoming Hell Girl but doesn't quite drive this point home as well as it could. Also the character of Takuma (while tragic) is not nearly as interesting as the duo of Hajime and Tsugumi. Takuma is himself just a tragic innocent who is used as a scapegoat. Hajime and Tsugumi were both strong characters with deep backstories who argued about the morality of revenge and finally had their plot lines more or less resolved. Takuma's plot line just sort of ends. Furthermore as much as I loved Kikuri the final episode reveals something that raises questions about how many of her antics were her own. \\n\\n\r\nEnjoyment: 8\\n\r\nI think in retrospect I enjoyed season 1 a bit more than I enjoyed season 2. Season 1 had a large variety of episodic plots that ran well in parallel with an overarching plot. Season 2 in contrast had a smaller variety of episodic plots and an overarching plot that was crammed into about 5 episodes instead of being stretched out over the course of half a season. Also less time is spent asking deep questions about things like revenge than in season 1 and overall there were too many characters that were just evil because someone needed to be the villain.\\n\\n\r\nOverall: 8\\n\r\nWhile season 2 isn't quite as good as season 1, Futakomori is still a very good anime series that fans of season 1 will definitely still enjoy. It is almost like someone consumed season 1 of Jigoku Shoujo, asked for seconds and got seconds...yes the meal isn't quite as good the second time around but its still good.",
            "date": "2017-07-04T09:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 251922,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20390.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/seekster",
                "username": "seekster"
            },
            "url": "https://myanimelist.net/reviews.php?id=251922"
        },
        {
            "content": "I was really becoming tedious by the time I watched this series. Having barely finished Season 1, I thought this series was getting really repetitive, but still, I decided to give it a chance... And I ain't regretting it for a lifetime! Seriously, the story development is simply amazing. It's the only series of Jigoku Shoujo that is actually worth in my opinion, because the changes in the characters' personalities are really surprising, besides non-superficial at all.\r\n      The plot takes long to develop, but when it does, you simply won't take your eyesoff the series anymore. I don't remember in which episode it begins to get interesting because it's been a long time I've watched it, but I guess it's from 12 onwards. And you won't regret continuing if you reach there!\\n\\n\r\n       The first season, however, proves to be necessary to understand some points of its sequel, mainly about that guy called Hajime Shibata, the journalist investigating Enma. \\n\\n\r\n        I give the story aspect a 7/10, because it takes reaaally long to develop. It almost kills you in boredom before finally starting to develop. But when it does, you really won't regret it!\\n\\n\r\n        Overall, though, I give it a 9/10. All of it really is amazing, and when the plot begins to develop, it'll really surprise you. Give it a chance, you won't regret it!",
            "date": "2017-05-06T09:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 247066,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6227650.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RulezAPower",
                "username": "RulezAPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=247066"
        },
        {
            "content": "Well, basically this is the sequel of Jigoku Shoujo, so I bet everyone who watched the first part is expecting a much better story, with deeper characters. Was the plot any better? Honestly, I cannot answer that question.\r\nThere are these episodes in the beginning that kind of irritate me. I mean, as soon as I started watching Jigoku Shoujo, I figured that Ai's companions are just mythical creatures, made up so they can fit the action. I wasn't really expecting any explanation as for what were they, where they came from, why they were helping Ai and such. Just like when you read a fairytaleand suddenly agree with the existence of mermaids, because the story kind of requires you to. The sudden involvement of the three in human life was unexpected. It kind of bothered me a bit, but then I realised it was totaly needed for adding a bit of depth to the characters. So yeah, more points for character building.\\n\\n\r\nThe final part, however, is quite brilliant (much better than the Shibata chase). It covers the brutally realistic subject we were faced to even from the very beginning (hate among human beings), adding a drop of tragedy to the scene of the misunderstood \"Lovely Hills\" town. Just for this single part, I am ready to award the series a perfect score for the storyline.\\n\\n\r\nThe artwork is really enjoyable and catchy (it caught me, that's for sure). \\n\\n\r\nAs for the sound, what can I say? The voice actors were as wisely chosen as in the prequel, and theOP/ED songs were beautiful. \\n\\n\r\nAll in all, I really really enjoyed the anime. I may or may not have cried in the end, but I am too curious about what it will happen next to make this review longer. I am really saddened at the thought that the series is going to end as soon as I finish the next 26 episodes, because this is one of the best animes I have ever had the pleasure to watch.",
            "date": "2013-06-27T08:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 102633,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2754167.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AkiyeHanasaki",
                "username": "AkiyeHanasaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=102633"
        }
    ],
    [
        {
            "content": "They are so back! This time more exciting and the characters are nastier and more irritating than ever. With some revelations about our beloved main characters.\r\nEvery story is a lot more exciting. It is made more complicating and so every each story is anticipating. There are even more twists and details in every story which makes it a lot more exciting that the previous season. Serving the revenge by the main characters is a little bit different and more exciting. It is more theatrical and more dramatic. There are more important revelations. The truth is gradually unveiling. We get to see how our lovely yetterrifying “OJOU” recruited her companions in Jigoku Tsuushin. The disgusting side of human beings is shown and so the profanity is even nastier. And even if there’s too much profanity, it is not overly done to the point of being so disgusting. I just love how the plot at the end of the series is made. Though it is sad and irritating, it is exciting how it unfolds. We see how twisted people can be and how unfortunate chains of events leads to the suffering of a single child. \\n\\n\r\nThe bad guys are nastier and a lot more irritating which makes the revenge a lot more exciting as well. The main characters are explored more. If in the previous season, Enma Ai’s past was revealed, this season her colleagues’ pasts are tackled as well. We get to see how and why they became Enma Ai’s companions. Enma Ai and her companions are seen a lot more together and you can see very well how close they are together. Much more, how they respect and treasure Enma Ai. They are even more investigative when it comes to their “clients”. They are the ones who gather information on why the clients are requesting their help. You could say, they are even more involve to the characters rather than just appears during the revenge itself. Let’s not forget the new addition to their group who I think is way creepier than any of them. I even think her character is more appropriate to be a hell girl with her very creepy face and nasty personality. And for some reason, she’s afraid of Enma Ai. Revelations shows that the main characters are not bad at all. Enma Ai is still as calm and poker face as ever. But strangely there are even times when she can really become funny while investigating clients and while doing their very theatrical revenge. It’s weird yet funny that while investigating, the whole main characters looks like a family. There’s also a new character whose situation is much like what Enma Ai’s had before with her village. Somehow you can really blame Jigoku Tsuushin because his character is being blame for their work. Well, I guess at the end of all, it is still people’s fault. \\n\\n\r\nThe animation is a little bit better and that includes Enma Ai’s new KIMONO which becomes a lot more beautiful. Ren and Hone Onna are not only very beautiful looking characters but they are very fashionable as well. As always, the sounds are so great. In fact, I think it is even better. It is really appropriate with the style and theme of the series. The ending them is really beautiful as well.\\n\\n\r\nI do believe that it definitely live up to the greatness of the previous season. I think it even surpasses it. It is no longer about the revenge like the main focus of season one. There are more twists in the series which make it even more amazing and so exciting. I am so looking forward to the next season!\\n",
            "date": "2012-12-09T08:14:00+00:00",
            "helpful_count": 0,
            "mal_id": 79682,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79682"
        }
    ]
]