[
    [
        {
            "content": "When my sisters enter high school, there are things I'll want them to know, and there are anime I'll want them to watch. One of those is Madoka, because it's about giving yourself the power of happy endings. One of those is this show.\r\nThe girls on this show talk about their bodies. They talk about it lewdly, naming specific parts, but also honestly and realistically, in a way I would expect from highschoolers. They don't have big sit-down speeches with older family members about periods; they talk about breast size and water physics. They don't make fun of the size of those breasts, either-- thegirls only mention it in good fun, and the boys point out their differing body types without putting them down about it; the worst they say about any of them is that they simply aren't their type.\\n\\n\r\nThese girls also break their archetypes. The \"party girl\" can be an utter otaku, the nerd can have fun teasing her friends, and the percieved airhead can have lots of hobbies. And, all of these girls can be friends without a clear explanation-- they're just in close proximity and get along, and that's how so many friendships start.",
            "date": "2017-02-27T18:53:00+00:00",
            "helpful_count": 73,
            "mal_id": 241561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5847057.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Amazing_Grace",
                "username": "Amazing_Grace"
            },
            "url": "https://myanimelist.net/reviews.php?id=241561"
        },
        {
            "content": "Absolutely loved it! Perhaps one of the best underrated shows of winter season, Galko-chan totally came out and dominated the other shorts this season.\r\nNow, Oshiete! Galko-chan isn't as wild other shows that discuss boobs, sex, etc and I think that works out fine because with Galko-chan it has a more natural feel to it. None of the episodes feels like its' going to be too over the top or just plain ridiculous, although it does have it moments of course.\r\nStory/Plot- 7.5/10\r\nHonestly, the show really doesn't have much to offer in story/plot. I mean everything is explained in the intro song so you pretty much getthe idea of what the story is right then and there.\\n\\n\r\nArt -7.5/10\\n\\n\r\nI think the style used in the show is pretty good to look at. The style used really pays its' respects to the original manga which I think is pretty cool. Character designs were fan-friggin-tastic. I loved Galko, I mean, perfect in all portions! Awesome pair of chest-ticles, great body, and so nice to look at. I think she is the best, well drawn and animated character on the show.. I mean, it does make sense though since she is the main character.. The others ladies are also pretty hott too.\\n\\n\r\nSoundtrack- 6/10 \\n\\n\r\nWas alright I guess. I didn't pay too much attention to the BGM nor the horrible yet catchy intro song. There's not much else for me to touch on  with the music, however the voice actors were pretty great. I noticed that they are new, or somewhat new to voice acting. Some of the seiyuu's have very few to little roles, however they are getting experience which is a good thing. I hope to see... or in this case hear more work from them soon.\\n\\n\r\nCharacters- 9/10\\n\\n\r\nI was so impressed with the characters. The show has VARIETY! lots of it. I love it when shows like Galko-chan comes out because I rarely get to watch shows in which I can go gaga over all the girls and get into crazy arguments about the best one(s) (Galko.) I loved just about all, well almost all the girls even sonic meat had some great looks to her. This is one of the many shows where I find it impossible for myself to hate or dislike any of the characters.\\n\\n\\n\r\nOverall I really enjoyed Oshiete! Galko-chan! It was a real pleasure to watch. I mean I could not have asked for any better characters. I'd have to say again that Oshiete! Galko-chan is totally a hidden gem.\\n\\n\r\nFinal thoughts- \\n\\n\r\nI would recommend it, highly recommend it if you need a break from serious shows or maybe you just want to watch something to kill some time, I'd totally tell you to check out Oshiete! Galko-chan! I would have to say that it is worth the watch. Overall I gave Oshiete! Galko-chan 9.2/10 because while it lacked in certain departments or elements, it made up for those mistakes with its characters... its' sexy, sexy characters....",
            "date": "2016-03-25T08:48:00+00:00",
            "helpful_count": 98,
            "mal_id": 214033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=214033"
        },
        {
            "content": "Where do I begin with how impressed I am by this short comedy? \r\nI admit, I'm biased-I like shows where cute girls do cute things. Though these certainly aren't Lucky Star moeblobs. It's basically the same concept, but the stuff these girls talk about remind me of what I would talk about with friends. Bodies are weird, okay, and there's nothing wrong with wondering if curtains always match the carpet. \r\nStory: Not much real story. But there was a moment that surprised me-in the middle of the silly skits you'd expect out of a short SoL comedy, there was a surprisingly real moment. It wasdeep, yo. The character learned something, and tried to change for the better afterwards. A+\\n\\n\r\nArt: Not my favorite, but it's passable.\\n\\n\r\nSound: NGL I hate the opening song. It's annoyingly catchy but not actually a good song?\\n\\n\r\nCharacter: Character personalities are great. Even by looking at their names you can tell what archetype they are, and then they, especially Galko, go on to defy those stereotypes.\\n\r\nI will say one thing though: Galko's hair is effing ridiculous. \\n\\n\r\nEnjoyment: 11/10 short enough to keep my equally short attention span. \\n\\n\r\nOverall: Bottom line, if you like eavesdropping on cute girls having mildly vulgar conversations, watch this anime, you voyeur. Those in search of plot or true fanservice or action... what are you even on Galko's page for?",
            "date": "2016-02-04T08:32:00+00:00",
            "helpful_count": 68,
            "mal_id": 210081,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731968.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RilakkuLina",
                "username": "RilakkuLina"
            },
            "url": "https://myanimelist.net/reviews.php?id=210081"
        },
        {
            "content": "~Multilingual review, English & Español: Please tell me! Galko-chan~\r\nLong enough to cover everything that need to be covered and short enough to be interesting, that's the 'mini-skirt rule', and this anime follows it perfectly. However you're still behind a school's desk, or you already left them far behind in your past, I'm pretty sure you all overhead, at least once, a \"girl's talk\" your slutty girl-classmates did. Leaving aside the disappointment developed when you find out your crush wasn't as pure as you thought, it was sure an embarrassing moment overall.\r\nI once overhead my girls classmates talk about how big a famous singer's genitals were,what would they do with both him and his boyfriend (yes, you read right), among few other things I'd have wished to never hear. That particular event was engraved in my mind so whenever I listen to the word \"girl's talk\" that unpleasant memory comes to my mind giving me shivers down my spine.\\n\\n\r\nAnyway.. Even if the girls in Anime doesn't represent exactly real high school girls (fortunately), 'Please Tell me! Galko-chan' is one of those few anime who gets closer and manages to recreate a genuine girl's talk while leaving aside how disgusting could turn out to be.. if the girls were to be my classmates, that's it.\\n\\n\r\nFortunately our protagonists are adorable, simple innocent girls and the arguments of such talks, a bit \"stimulating\" whiteout reaching plain vulgarity, turn out to be interesting and cute at the same time due to the girls reactions when they get embarrassed even by their own conversations, even pushing the viewers to ask themselves 'How will they react to this?'.\\n\\n\r\nThe anime develops around 3 kind of stereotypes of High School girls. The 'gyaru', Galko-chan, a busty fashionable blonde girl which surprisingly is, contrary to her looks and behavior, a very kind and inexperienced innocent girl. The 'otaku', Otako, a small girl with glasses who likes to tease Galko with suggestive questions and arguments, with the risk of ending flustered herself sometimes, however she cares about Galko a lot. The 'princess', Oujou, a total airhead rich girl which hangs out often with the previous two ones.\\n\\n\r\nThere are also minor characters, don't forget the anime develops mainly inside a classroom, they didn't shine that much but their presence really give off a genuine \"classroom environment\". When I mentioned the 'mini-skirt rule' it was referred to the episode's duration, 7 minutes each one. I found the duration quite on mark, short enough to be interesting whiteout the risk of being boring. That was the main quality of this show.\\n\\n\r\nI really liked the characters, specially Galko, and how the main cast argued about such suggestive themes with such cute tones, it turned out to be really nice and refreshing. If you're searching for a short anime, maybe with nice girls and lot of humor, you can hardly find any better than this.\\n\\n\r\n[Español]\\n\\n\r\nLarga suficiente para cubrir todo lo que tenga que ser cubierto, y corta, suficiente para ser interesante, esa es la 'regla de la mini-falda', y este anime la sigue a la perfección. Independientemente de que si todavía te encuentras detrás de un pupitre escolar, o los dejaste ya atrás en el pasado, estoy bastante seguro que, al menos una vez, has escuchado por casualidad una 'charla de chicas' que hicieron tus -no tan inocentes- compañeras. Dejando al lado la decepción al descubrir que tú amorío no era tan \"pura\" como pensabas, fue de verdad un momento vergonzoso.\\n\\n\r\nUna vez escuché hablar a mis compañeras sobre cuánto grande eran los genitales de un famoso cantante, que cosa le harían a él y a su novio (sí, leíste bien), entre otras cosas que desearía nunca haber escuchado. El particular momento se imprimió en mi mente, así que todas las veces que escucho 'charla de chicas', ese desagradable recuerdo revive dándome escalofríos por todo el cuerpo.\\n\\n\r\nDe todos modos.. Aunque si las chicas en el Anime están bastante lejos de representar exactamente con perfecta afinidad el modelo de chicas en el mundo real (afortunadamente), 'Please tell me! Galko-chan' es uno de los pocos que realmente se avecina y que logra recrear una genuina 'charla de chicas' dejando a un lado cuán desagradable pueden llegar a ser... Si las chicas en cuestión son como mis compañeras de clase, eso sí.\\n\\n\r\nPor suerte nuestras protagonistas son simples e inocentes chicas, y los argumentos de tales charlas, algo \"estimulantes\" pero sin rozar la vacía vulgaridad, llegan a ser interesantes y adorables al mismo tiempo debido a las reacciones de las chicas cuando se avergüenza hasta de sus propias conversaciones, empujando al espectador a preguntarse 'Y ahora cómo reaccionarán a esto?'.\\n\\n\r\nEl anime de desarrolla al rededor de 3 clases de estereotipos de chicas. La 'gyaru', Galko-chan, una chica rubia, siempre a la moda, y con dos buenos melones qué sorprendentemente, contrario a su vestuario y comportamiento, es bastante inocente y amable. La 'otaku', Otako, una chica con lentes de pequeñas proporciones que le encanta molestar a Galko con preguntas y argumentos sugestivos, aunque si a veces corre el riesgo de quedar avergonzada ella misma. La 'princesa', Oujou, una cabeza hueca total que se junta siempre con las otras dos.\\n\\n\r\nEstán presentes también algunos personajes menores, sin olvidar que este anime se desarrolla principalmente adentro de un salón de clases, aunque si no brillaron de modo particular, la presencia de estos personajes le dieron un aire genuino de ambiente escolar a la serie. Cuando mencione la 'regla de la mini-falda' estaba referido a la duración de cada episodio, 7 minutos cada uno. La encontré de verdad acertada, corta suficiente para ser interesante, y sin el riesgo de caer aburrida. Esa fue la mejor cualidad de este anime.\\n\\n\r\nMe gustaron bastante los personajes, especialmente Galko, y también como las chicas protagonistas afrontaban los sugestivos temas con tan adorables tonos, al final se revelo ser bastante refrescante. Si estás en busca de algo corto, tal vez con lindas chicas y mucho humor, difícilmente encontrarás algo mejor que esto.",
            "date": "2016-03-25T09:26:00+00:00",
            "helpful_count": 46,
            "mal_id": 214043,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214227.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Vene",
                "username": "Vene"
            },
            "url": "https://myanimelist.net/reviews.php?id=214043"
        },
        {
            "content": "*Completed for the 2018 Anime Watching Challenge: (89) Watch an anime adapted from a Digital Manga*\r\nGoing into Galko-chan, I had zero expectations. I was expecting another mediocre slice of life anime. Thankfully, despite my incredibly low expectations, the show turned out to be pretty damn funny.\r\nI think the primary reason the show works so well lies in the length of its episodes. One of the biggest problems with the slice of life genre is that trying to make mundane, everyday interactions entertaining enough to keep the audience's interest for 20 minutes is a difficult feat. With Galko, each episode is approximately 7 minutes, meaning thatepisodes don't get a chance to wear out their welcome.\\n\\n\r\nOf course, this quick pacing isn't enough to carry a show, and for Galko-chan to succeed, it needs a strong sense of humor and a memorable cast of characters. As mentioned before, I found the show to be really funny. By no means is the humor in this show 'high-brow', in fact most of the jokes focus on some rather raunchy subject matter. Yet, by some miracle, the jokes never came across as tired or forced.\\n\\n\r\nIn terms of characters, the cast is another one of Galko's strengths. Every character was likeable, and their interactions with each other were great. In particular, I really enjoyed the dynamic between Galko's spunkiness and Otako's no-nonsense attitude. On top of that, Ojuo fits perfectly between the duo with her oblivious nature.\\n\\n\r\nTo top it off, the art direction is beautiful with some bright, colorful designs, and the voice acting is very well done.\\n\\n\r\nOverall, it's a solid show that's worth your time, especially if you're a slice of life fan.\\n\\n\r\n8/10",
            "date": "2018-02-11T01:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 271253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820073.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SomeMoron",
                "username": "SomeMoron"
            },
            "url": "https://myanimelist.net/reviews.php?id=271253"
        },
        {
            "content": "Oshiete! Galko-chan is something I, admittedly, would've never watched if I hadn't heard so many people raving about it. And boy, am I glad I finally got off my high horse and gave this hidden gem a try.\r\nIt's so, so hard for me to fully explain this show without making it sound like another ecchi mess, which it REALLY isn't.\r\nBasically, the plot is just Galko and her friends discussing various things about the human (particularly the female) body and things that you wouldn't see any other highschool girl in an anime say without dying of embarrassment, because that's how anime tends to portray it's girls,more often than not.\\n\\n\r\nBut the way they go about it isn't all that lewd. They go at it from a more clinical or even innocent way, making it less of a one-off fanservice thing and more...realistic, and damn endearing. \\n\\n\r\nThe anime also has a pretty relevant message of 'Don't judge a book by it's cover', with Galko's classmates assuming she's promiscuous, mean, and shallow because she embodies what a Gyaru is. Then, they end up being completely wrong and look at Galko in a different way, eventually coming to like her for the genuine person she is. \\n\\n\r\nGalko is just...cute. Really damn cute, fun to watch, and the perfect main character for this show. Her friends are both fantastic too, and I was surprised by how immediately I adored their chemistry together. \\n\\n\r\nThe art of this anime is downright gorgeous. The character designs, and I mean EVERY design, were unique and damn beautiful and made me wish her classmates got more screentime. Even in the few handful of times they're shown in-depth, Galko's classmates are filled to the brim with unique personalities, diverse bodies, and incredible designs.\\n\\n\r\n I've come to really respect the mangaka, and one of the reasons is because of how much effort was obviously put in designing each and every character, and giving them their own unique personality. \\n\\n\r\nGalko does a ton of things differently, and all of it lands so well and makes this show an endearing, adorably fun time. Believe me, if you think this show isn't your thing, give it an episode first. It may just surprise you with how it goes about things :D\\n\\n\r\nI would be absolutely overjoyed if this show got a season 2, and I'm probably gonna rewatch it as soon as I finish writing this review. The show was, as a whole, a treat to watch and the definition of a hidden gem. \\n\\n\r\nTo anyone considering watching this and reading reviews before you do, I implore you to give this anime a try. I'm almost certain you'll be pleasantly surprised!",
            "date": "2017-12-08T16:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 264795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6432107.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/evolvingweeb",
                "username": "evolvingweeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264795"
        },
        {
            "content": "THIS REVIEW MAY CONTAIN SPOILERS\r\nOkay, so looking at the top review of this anime made me laugh really hard because I've never seen such garbage.\r\nAnyway. I enjoyed this anime, hence the high score. It's the kind of anime I wished I'd watched at a younger age, not because it's completely accurate (not completely, but it's close to what high school was like) but because it would have helped me understand something sooner. Something that is the very heart of this little anime.\r\nAppearances don't matter and who you are perceived to don't matter either. It's up to YOU who you are and you don't have tobe like anything - the one thing that you have in common is being a human in the same society and doing your own thing. If this anime promotes ANYTHING, it's that of individuality. \\n\\n\r\nSure it's gratuitous, but I accepted that it was going to be like that from the very first episode. So yeah, I'm going to gloss over it so to speak, because my feelings on it are clear enough. \\n\\n\r\nStory - I didn't feel like there was much story, to be honest. The story of Ojou, Otako and Galko becoming friends was right at the very end of the season and to be frank, there's only so much you can fit in an 8-minute episode. That being said I felt that obviously, the narrative focused largely on Galko and her friendship with Ojou and Otako. So taking that into consideration I'd say the storyline did well because I was invested, but it wasn't groundbreaking.\\n\\n\r\nArt - The art was vibrant and cheerful. General happy-feeling kinda art that I genuinely enjoyed. As I don't pay much attention to art (sorry art fans) then I can't really make a real great guess on what I feel about it. I just genuinely liked the art and really enjoyed seeing anime girls and guys of all different shapes and sizes. It was nice to see and I applaud Oshiete! Galko-chan for this.\\n\\n\r\nSound - Again I didn't think the sound was anything groundbreaking. The little sounds they made when certain characters walked (namely Galko, lol) was humorous but it wasn't anything to go home about. Made me smile and laugh a few times, so rating it 6 seemed fair.\\n\\n\r\nCharacter - This is the strongest element of the series. Galko is seen as a typical gyaru and a lot of the characters make jokes about her being promiscuous. However, as the series progresses we learn that is FAR from the truth. She's just a normal, average gal who likes makeup, boys (though some of her interactions with Otako made me wonder otherwise), anime and cooking. More than anything the series states that Galko wants to be a mother. And it is shown in how she cares for everyone around her. When she saves Otako from her period embarrassment (something I can very much relate to) and gives her pills, she apologises for her behaviour about judging Otako before actually knowing her. Earlier on in the series a lot of the other characters end up in a bit of trouble (bed-hair, chipped nails, etc) and Galko goes out of her WAY to HELP THEM. For like, no reason apart from she's so nice? 10 points for Galko. Regardless of her looks and what people may think of her, she's an overall nice person and it's refreshing to see her in this light. \\n\\n\r\nOtako was also another favourite character of mine. I could relate to the whole 'silent loner head stuck in a book' kind of character, and yet when I found my friend group in high school I was also the one who would make perverse, lewd jokes just to get everyone's reaction. So I understood Otako and even though I feel as though her jokes towards Galko were a bit too far sometimes (something Otako herself acknowledges) she does genuinely care for Galko and it made me smile.\\n\\n\r\nOjou aka beware of the quiet ones! Ojou is a rich, air-head that doesn't really seem to match up to that description. Sure she's a bit ditzy sometimes, but she's also an honour roll student. So perhaps naive would be a better way of describing her. Either way, there is this one scene that made me really think of my perception of Ojou. She hears Otako and Galko discussing movies and wants to join in the conversation, but in doing so she speaks differently in order to imitate the way Otako talks. Both Otako and Galko look confused and then say to Ojou 'just be yourself'. And that...was kind of beautiful. It showed an insecurity of Ojou that I didn't think was there and it really changed how I viewed her significance to the trio.\\n\\n\r\nOf course there are tons of other characters, but the main three were my favourites so only they get a lengthy paragraph about them. ;)\\n\\n\r\nI don't think I have to go into much detail about my enjoyment. I really did enjoy it a lot and hope there's a season 2 as the series itself just made my day that little bit brighter. :)\\n",
            "date": "2017-11-24T15:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 263872,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6547053.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/captainrivaini",
                "username": "captainrivaini"
            },
            "url": "https://myanimelist.net/reviews.php?id=263872"
        },
        {
            "content": "Reading some of the other reviews actually makes me wonder what the fuck even is this community that I'm a part of. But whatever, although the story is nonexistant and pretty much everything is average - 10/10 best anime ever! Saw only 1 episode :)\r\nNah, what I really mean is that this show is very average and not worth your time. The only enjoyment you could ever have from this is looking at some really awkward poses that the characters are drawn in for some reason. Then again - their soulless eyes will dry up your life energy, so maybe not the best idea. \r\nIguess some 14 year old girls might relate to some of it, especially towards the end where they talk about how hard is dealing with first few years of menstruation. But everyone else will forget about the show in 5 minutes.",
            "date": "2016-09-09T18:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 228664,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5676075.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Alan_Albatross",
                "username": "Alan_Albatross"
            },
            "url": "https://myanimelist.net/reviews.php?id=228664"
        },
        {
            "content": "Galko is not a bad show and I certainly enjoyed it. It was funny and broke taboo and sterotype alike! But I couldn't help but feel it was a little gaudy. The art style is varied and pretty, but it isn't put to stupendous use. The jokes, while kinda informative and wholesome, got stale after a bit. I think this is one of the better short anime out there, but nothing you can't pass on. \r\nThat being said, it is good to see shows willing to tackle a broader variety of topics including things that are usually hushed up as inappropriate. While the topics didn'treally resound in me, I do find value in that this show was made and I hope others like it come along. \\n\\n\r\nThe friendship of the 3 girls is interesting, but doesn't evolve much until the last episode. I do like the way they end the series, as there is no *great* stopping point in short shows like this, so it makes sense to round it off with a 'how they all met' sort of story that a.) gives us a lasting impression of the characters and b.) hammers home all the ideas the show has posited the whole time. \\n\\n\r\nThe score is largely a reflection of my general enjoyment; I don't regret watching it, it was worth my time. But not something that will linger in my mind or alter who I am or anything.",
            "date": "2019-01-23T16:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 299873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IvivinPigeon",
                "username": "IvivinPigeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=299873"
        },
        {
            "content": "Review: Oshiete! Galko-chan\r\nStory (4/10): This anime has no framework or a single plot to follow on but rather focuses on the daily lives of a gyaru, an otaku, and an airhead. However, the characters and their use of comedic relief in each episode is quite entertaining to watch. Each episode is episodic filled with humor of the female genitalia. The jokes were dirty and playful and every once and a while, a smirk or two came across my face when watching. Putting humor aside, each episode was amusingly very informative when learning about female genitalia. With humor mixed in with educational facts, those two factorsis what this make this anime unique.\\n\\n\r\nArt (8/10): The art is fresh. Colorful and eye-catching. From the quirky character designs and to the vivid animation, everything was done well from Studio feel. The studios who made the infamous Kiss x Sis, the brilliant Yahari Ore no Seishun Love Comedy wa Machigatteiru, and unfortunately one of the most disappointing winter shows this season, Dagashi Kashi. Surprisingly, studio Feel hasn't gotten the recognition they deserved yet. Mainly, it is due to the lack of reputation most of the anime made from their studios. With Galko-chan however, the art Studio feel made has not yet to fail. If there a downside to this anime however, it would be many of the female characters oversized breasts. An overused anime trope, in result, a nuisance. But overall, the art is great and is overall one of its strongpoints in this anime. \\n\\n\r\nSound (3/10): Since this anime had a duration of seven minutes, Studio Feel managed to fit in at least an opening theme. The opening theme coming into the anime was bright and energetic. But unfortunately, it wasn't catchy to make it rememberable. Overall, the soundtrack was one of it's downsides as it lacked any music at all.\\n\\n\r\nCharacter (8/10): The characters are original in sense despite using most of the anime tropes in the book. Despite using some of the anime tropes, most of the characters personalities were unique making it want to learn about them more. Story is essential when it comes to character development and such. But unfortunately, leaving a solid plot for the characters to build on and despite the duration of each episode left the characters unfilled. They lacked the respect they deserved despite having great personalities. Budget cuts, sigh.\\n\\n\r\nEnjoyment (8/10): Managed to binge watch this anime despite having a constrained time schedule. But, it only took me an hour and a half to watch. Oddly enough, this anime was surprisingly entertaining to watch. If only it were longer.\\n\\n\r\nOverall (7/10): This anime had so much potential if there was some sort of plot to follow on with all these characters in hand. Shame that they didn't get developed on. But despite of all of that, this anime was surely entertaining to watch. The art is fresh, colorful and eye-catching. The daily lives of an unusual bunch of high schoolers and their use of humor on female genitalia was quite amusing to watch. Wouldn't say this anime is overrated but lacked the attention it deserved. But overall, do not look for the story but for the comedic relief this anime has to offer. It only takes an hour or two to watch the entire anime. Worth a watch and definitely recommend this anime for those who want to watch due to a constrained time schedule or just for fun in general. Give it a try!\\n\\n\r\nRAW SCORE: 6.5/10.0\\n\\n\r\nOVERALL SCORE: 7.0/10.0\\n\\n\r\n-8.0/10.0 (Generous score)\\n\\n",
            "date": "2016-08-24T20:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 227540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006714.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/_LorDNiCo_",
                "username": "_LorDNiCo_"
            },
            "url": "https://myanimelist.net/reviews.php?id=227540"
        },
        {
            "content": "I was watching this for the 2019 Anime Challenge while still a Novice as I found this series short to watch. \r\n'Oshiete! Galko-chan' is a slice of life, comedy and school anime and you can expect what's it going to be about. I thought it would be a good way to kill time (While procrastinating) to watch this show. Actually, the teaser of this show caught my attention.\r\nThis anime is good for early teens as most of the characters portray them. This comedy series revolves around their nature and how they discover themselves. As a guy, there were few things I learnt about the oppositesex. Some Japanese culture is also shown.\\n\r\nThe story is about a girl names Galko, a popular girl who is referred as a 'gyaru' and party animal despite being innocent. She is friends with Otako (Who is an otaku) and Ojou (a wealthy young lady who tries to fit in Galko and Otako's conversations and ends up being an airhead). It describes their life as students and their struggles. I would say it rightly describes the situations as teens appear to be curious.\\n\r\nFurther more, the anime includes lewd talks about general curiosity and superstitions which adds spice to it along with some humor.\\n\r\nI think it's a good anime. The animation is done quite well and I think the characters go nicely with their personalities.\\n",
            "date": "2019-01-09T23:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 298611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7515300.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rasta687",
                "username": "Rasta687"
            },
            "url": "https://myanimelist.net/reviews.php?id=298611"
        },
        {
            "content": "Best described as \"a nice little anime\", with the focus on \"little\" due to episode length. The characters are pretty lovable, colorful and well thought out, but the lack of good comedy (and by that i mean stuff that actually make you laugh and not just smile or chuckle), story (and therefor its progression), relationships and romance as well as each episode being only 7 minutes long kind of ruins it.\r\nOn top of it all there's more fanservice than the short episodes can or should be made to handle, but its mostly well placed so it doesn't stand out like a sore thumb as insome other titles. Best compared with \"Seitokai Yakuindomo\", this anime doesn't really hold its ground too well, still, its kind of fun and definitely worth a watch.",
            "date": "2016-03-25T15:15:00+00:00",
            "helpful_count": 6,
            "mal_id": 214103,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3297153.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/mkzxwing",
                "username": "mkzxwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=214103"
        },
        {
            "content": "I didn't expect an anime about girls talking about their genitalia to be this good.\r\nStory: This anime is episodic, so it doesn't really have story (unless you count \"3 girls talk about their bodies\" as one.) This works really well though, because the episodes are only 7 minutes long. Trying to put plot development in a 7 minute episode is like trying to put your dick in someone's clenched butthole. If you force it in, you might be able to cram it in. However, you will never be able to put it in properly (amazing comparison, I know). 7/10\r\nArt: It looks decent. I think evenbrighter colours would've worked better. 6/10\\n\\n\r\nSound: This anime barely has a soundtrack. The only song I remember is the OP (and the jingle played every time a question is asked by the narrator if that counts), which was meh. 5/10\\n\\n\r\nCharacter: Galko is the extrovert that pretty much every boy in the anime has a crush on, Otako is the otaku that makes up bullshit to tell to Galko and Ojou is the airhead that often is the third wheel. You would never think that these three characters could be friends together, but they are. I think that that's the underlying message of this anime. That just because someone is very different from you, doesn't mean you can't be friends with them. Otako says pretty much the exact same thing in the last episode of this anime. 9/10\\n\\n\r\nEnjoyment: I enjoyed this show a lot, mostly because of the hilarious questions they have about their bodies (like \"Is it true that virgins use pads, and non-virgins use tampons?\"). However, I recommend you to watch this anime in short bursts (around 2 episodes a day). This anime is pretty repetitive, so binge watching this anime will make you bored quick. 8/10\\n\\n\r\nOverall: I give this anime an 8/10. I definitely recommend it.",
            "date": "2017-07-03T14:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 251867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6207861.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nuttygardentree",
                "username": "nuttygardentree"
            },
            "url": "https://myanimelist.net/reviews.php?id=251867"
        },
        {
            "content": "I'm gonna be honest: The moment I saw those tiddie graphics I thought this was gonna be cliche and it was gonna suck ass. I was wrong as hell\r\nThis show takes it's characters and bases them of of cliche tropes on first sight, going as far as naming them after their tropes. Then the shows SHITS ON THE TROPES. It writes it's characters like real ass people, who are more to the eye than their appearance. They have little quirks, backgrounds, experiences. They aren't just an idea of a character, they're presented as human. And, honestly it's amazing. It's some anime breakfast club shit\r\n((also itbreaks the norms that women's bodies have to be \"\"\"\"\"\"\"perfect\"\"\"\"\"\"\"\"\" in order to be beautiful))",
            "date": "2017-05-01T16:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 246768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/emily_addler",
                "username": "emily_addler"
            },
            "url": "https://myanimelist.net/reviews.php?id=246768"
        },
        {
            "content": "NOTE: This MAY contain spoilers!\r\nStory 5/10: No plot. High school friends hanging out with each other.\r\nCharacters 6/10: No character development. But you get a sense of how they are and how they interact with each other. There are some funny and perverted/sexual moments of references. Galko is constantly late for class and laid back. She is known to have large assets. Ojou is kind, and bubbly. Otako is a bit monotone but chilled. \r\nOverall enjoyment 5/10: It was okay. It can be boring at times, but in the beginning of the anime, they introduced some of the other characters and gives them a brief introduction.With an anime that doesn't have a lot to work with, it is less than 10 minutes. The questions that the anime asks in the beginning of each episode also makes the audience curious as well. It is basically an anime full of pillow talk for girls who have these types of conversations.",
            "date": "2016-06-01T18:49:00+00:00",
            "helpful_count": 5,
            "mal_id": 219808,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=219808"
        },
        {
            "content": "I don't know how to write a review, so I'll jump right into it. Note that I use a weighted system, as follows:\r\nStory: x/10 * 2\r\nCharacters: x/10 *2\r\nVisuals: x/10 * 1.5\r\nEnjoyment: x/10 * 1.5\r\nSound: x/10 * 1\r\nTotal: x/80\r\nStory - 4/10 * 2 = 8/20\r\nThere's very little story to this. Most episodes revolve around some sort of rumor that is introduced at the beginning by the narrator. Later, there is an attempt at an actual story, but it is executed too late, and fails quite miserably. \r\nCharacters - 3/10 * 2 = 6/20\r\nThe characters are almost all extremely one-dimensional, except for Otako. Galko is defined byjust two traits, her large breasts and her being a gyaru. Ojou is defined by her naivety and her implied wealth. Otako, however, is a bit different. Although Galko and Ojou simply accept the world around them, Otako questions her surroundings and fools around with Galko in an almost intellectual way. There are several minor characters that are introduced, and they're even more bland. They are often defined by not two, but just a single trait. Don't expect character development, the writers didn't think of that.\\n\\n\r\nVisuals - 4/10 * 1.5 = 6/15\\n\r\nThe visuals are, for the most part, not too bad. The backgrounds are occasionally bright cheerful colors, as is our protagonist's outfit and appearance. However, besides this, the visual quality is not very good. Characters are plagued by having QUALITY faces often, and there are many scenes where corners are cut in terms of visuals, with lips not moving with the chin, mouth covered by an object, and other things of that nature. This occurs in almost every anime, however, so there is a bit of slack for that. Character designs are average, with Galko obviously being the most thought-out character in terms of her appearance. Besides that, the characters are very indistinguishable.\\n\\n\r\nSound - 4/10 * 1 = 4/10\\n\r\nThe sound is of average quality, by every meaning of the word. Nothing too bad or too good in this regard.\\n\\n\r\nEnjoyment - 8/10 * 1.5 = 12/15\\n\r\nIt's a funny show. I will give it that. The humor is very feminine, but despite that, I still managed to laugh, as it is a nice change of pace from regular comedies that cater to a predominantly male audience. The jokes are dirty to an extent, but at the end of the day it's nothing too spectacularly over-the-top.\\n\\n\r\nOverall: 36/80 = ~4.5(5)/10\\n\r\nWatch it if you want to relax with a decent show that shows high school life from the perspectives of girls.",
            "date": "2017-02-15T11:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 240643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3558373.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Abnf",
                "username": "Abnf"
            },
            "url": "https://myanimelist.net/reviews.php?id=240643"
        },
        {
            "content": "Overall - 5:\r\nThis anime is the kind of anime that looks good in gifs because the art and character design look good. The show, unfortunately doesn't live up to the expectations these gifs create.\r\nStory - 4:\r\nNothing really special here, for the most part the mini stories aren't all that interesting.\r\nArt - 7:\r\nLike I said before, this show looks good. It's not trying to animate anything too complicated, a lot of it is pretty simple talking scenes, but it does a good job at making those scenes look good.\r\nSound - 4:\r\nThe soundtrack is boring, kinda like the show. The tracks fit well into the show, sothis isn't rated too low, but there's nothing too good about the sound.\\n\\n\r\nCharacters - 7:\\n\r\nThis is probably this show's strong suit. The characters each have their own little quirks that make them stand out, not only from other characters, but the stereotypes they represent as well. Most of the show is getting to know these characters, which is a good thing.\\n\\n\r\nEnjoyment - 5:\\n\r\nI liked the characters, and the occasional scene was pretty good, but a lot of the time it was just kinda boring.",
            "date": "2017-11-28T20:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 264146,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6767999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dualsaga184",
                "username": "Dualsaga184"
            },
            "url": "https://myanimelist.net/reviews.php?id=264146"
        },
        {
            "content": "Girls talking about their bodies and it's has some comedic charm to it?\r\nOshiete! Galko-chan is an anime short mainly about Galko voiced by Azumi Waki the gyaru, Otako voiced by Miyu Tomita the otaku and Ojou...the ojou voiced by Minami Takahashi and they for the most part get into conversations about their bodies. Oddly enough this actually works as the three main cast members of the gyaru, otaku and ojou have somewhat \"playing against the type\" sterotypes of their sterotypes. Galko is actually shy and gets nervous when talking about ecchi things, Otaku is actually very talkative and teases Galko ALOT with comedic misunderstandings andOjou is rather aloof and most of the time comedically missing the point.\\n\\n\r\nThe relationship between these three characters really do make this anime short worth it even beyond the vulgar girl talk.\\n\\n\r\nThe other minor characters do get thier time in the limelight though they are primarily used with a punchline to Galko, Otako and Ojou's conversations at times.\\n\\n\r\nThe comedy for this anime short comes from either extremely witty teasing humor between the characters or just vulgar talk with a good punchline by the end of the episode.\\n\\n\r\nThe animation by studio feel, the character designs are decent enough though some of the clique characters do come off as slightly generic, there are a few \"unique\" character design choices, as for background is moderately ok. The animation isn't something to brag or talk about in detail, but overall the animation is managable and consistent with no blatant errors considering this is an anime short.\\n\\n\r\nThe last episode however does bring in a VERY good theme of \"don't look at a book by it's cover\" and it's blatantly and cleverly shown through the interactions of Galko and Otako and brings this anime short from merely talking about girl's bodies and being ecchi and witty about it to talking about the stereotypical archetypes of anime and saying \"who cares about the stereotype?\"...the anime characters can be something beyond just \"gyaru\", \"otaku\" or \"ojou\". (Note: LA isn't saying it's a HUGE revelation or taking huge steps to bring this theme into play, but it's subtle and somewhat low key in HOW they portray it).\\n\\n\r\nOshiete! Galko-chan is one of the hidden gems of the Winter 2016 anime shorts (the best hidden anime short gem goes to Sekkou Boys by the way) and LA will say this like the theme of this anime short, \"don't look at a book by it's cover\", this anime short is NOT just about vulgar girl's bodies talk...it has something more, just...how about opening the book?",
            "date": "2016-06-06T20:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 220173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=220173"
        },
        {
            "content": "Hey folks, this will be a review for Oshiete! Galko-chan. You know when you have a craving for some food and then pig out on it until the thought of eating any more sickens you? That's what this show does to sexual interest.\r\nThe story is really straightforward. Three girls attend a high school class in which they will talk about something perverted. Generally they will be presented with a question like, \"is it true that girls with larger boobs have larger areolas?\". The girls will then discuss it as if it came up in natural conversation. Generally Otako uses the topic to pick on Galko,who in turn generally gets embarrassed and responds loud enough for her class to hear, rinse and repeat.\\n\\n\r\nThe characters are strange. Galko is a gyaru who is actually innocent and not perverted. Otako is a nerdy girl who loves picking on Galko. She is in general funny, and interesting, if only because she is the only character really. Ojou is the third wheel character who every now and again will amplify a joke because she comes in during the middle, or misunderstands it.\\n\\n\r\nHonestly I wasn't expecting what I watched. I thought it might be a little more clever or not as direct. At first the explicitness of the topics was interesting and amusing but it quickly became repetitive. Unlike Seitokai Yakuindomo, I quickly became bored. Its a strange thing to feel tired of lewd things, not sure I'm happy with this outcome.\\n\\n\r\nTLDR: Even though its a short I still wouldn't recommend it. If you want sexual jokes and haven't seen Seitokai Yakuindomo, then go watch that.",
            "date": "2016-10-19T18:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 232120,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=232120"
        },
        {
            "content": "A show about a bunch of cute girls, who embody stereotypes, hanging out at school? Sounds boring!\r\nBut wait, they're all subversions of their own archetypes by being deliberately cliche on the surface, with unique personalities underneath? Oh great, another edgy deconstruction!\r\nFortunately, Oshiete Galko-chan isn't just another deconstruction of X genre; it plays the gimmick of each character being named after and seeming like one specific character archetype, while actually being deeper than they seem, but they aren't deliberately NOT those things, either. Otako is a shy otaku who reads a bunch of manga, but she's still an interesting person with her own tastes, who doesn'teven see herself as an otaku, but rather someone interested in all kinds of books. Ojou is the prim-and-proper rich girl, but she's also kind of an airhead with her own unique set of quirks. Galko is a true gyaru, but she's interested in everything and can't resist getting involved with everyone.\\n\\n\r\nOshiete Galko-chan isn't filled with gripping character drama or even particularly hilarious humor, but it is engaging and memorable for its complex characters, who interact with each other believably and manage to form real relationships with one another over the short ~90 minute run-time of the series.\\n\\n\r\nIf you're like me and have grown cynical and tired from countless shows where everyone is absolutely pure-hearted and naive, Galko-chan is a refreshing change of pace, with each character being good-natured while maintaining a reasonable amount of selfishness and a lack of sensitivity, as is expected of a high school student. They have legitimate interests in sex and relationships, and their curiosity about the opposite sex makes for some really sincere and interesting character interactions. Oshiete Galko-chan doesn't treat taboo subjects like jokes or shock-factor, it explores them through the minds of curious, nervous adolescents, and it just feels refreshing and realistic to see characters in anime actually talking about them like reasonable people instead of gasping and getting nosebleeds at the mere thought of sex.\\n\\n\r\nOverall, Oshiete Galko-chan is heartwarming, funny, and engaging. All I can ask for in a show is that it doesn't bore me, and the surprisingly broad cast of memorable, believable characters made for some excellent banter and drama. Every moment of the show brought more depth to its characters, by showing them in new situations, reacting in ways that were often unexpected and yet never felt out of character. It's not much of a commitment to pick up, as it's only twelve eight-minute episodes, and it's absolutely worth the time",
            "date": "2017-08-25T19:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 256254,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1364157.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/anaract",
                "username": "anaract"
            },
            "url": "https://myanimelist.net/reviews.php?id=256254"
        }
    ],
    [
        {
            "content": "When my sisters enter high school, there are things I'll want them to know, and there are anime I'll want them to watch. One of those is Madoka, because it's about giving yourself the power of happy endings. One of those is this show.\r\nThe girls on this show talk about their bodies. They talk about it lewdly, naming specific parts, but also honestly and realistically, in a way I would expect from highschoolers. They don't have big sit-down speeches with older family members about periods; they talk about breast size and water physics. They don't make fun of the size of those breasts, either-- thegirls only mention it in good fun, and the boys point out their differing body types without putting them down about it; the worst they say about any of them is that they simply aren't their type.\\n\\n\r\nThese girls also break their archetypes. The \"party girl\" can be an utter otaku, the nerd can have fun teasing her friends, and the percieved airhead can have lots of hobbies. And, all of these girls can be friends without a clear explanation-- they're just in close proximity and get along, and that's how so many friendships start.",
            "date": "2017-02-27T18:53:00+00:00",
            "helpful_count": 73,
            "mal_id": 241561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5847057.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Amazing_Grace",
                "username": "Amazing_Grace"
            },
            "url": "https://myanimelist.net/reviews.php?id=241561"
        },
        {
            "content": "Absolutely loved it! Perhaps one of the best underrated shows of winter season, Galko-chan totally came out and dominated the other shorts this season.\r\nNow, Oshiete! Galko-chan isn't as wild other shows that discuss boobs, sex, etc and I think that works out fine because with Galko-chan it has a more natural feel to it. None of the episodes feels like its' going to be too over the top or just plain ridiculous, although it does have it moments of course.\r\nStory/Plot- 7.5/10\r\nHonestly, the show really doesn't have much to offer in story/plot. I mean everything is explained in the intro song so you pretty much getthe idea of what the story is right then and there.\\n\\n\r\nArt -7.5/10\\n\\n\r\nI think the style used in the show is pretty good to look at. The style used really pays its' respects to the original manga which I think is pretty cool. Character designs were fan-friggin-tastic. I loved Galko, I mean, perfect in all portions! Awesome pair of chest-ticles, great body, and so nice to look at. I think she is the best, well drawn and animated character on the show.. I mean, it does make sense though since she is the main character.. The others ladies are also pretty hott too.\\n\\n\r\nSoundtrack- 6/10 \\n\\n\r\nWas alright I guess. I didn't pay too much attention to the BGM nor the horrible yet catchy intro song. There's not much else for me to touch on  with the music, however the voice actors were pretty great. I noticed that they are new, or somewhat new to voice acting. Some of the seiyuu's have very few to little roles, however they are getting experience which is a good thing. I hope to see... or in this case hear more work from them soon.\\n\\n\r\nCharacters- 9/10\\n\\n\r\nI was so impressed with the characters. The show has VARIETY! lots of it. I love it when shows like Galko-chan comes out because I rarely get to watch shows in which I can go gaga over all the girls and get into crazy arguments about the best one(s) (Galko.) I loved just about all, well almost all the girls even sonic meat had some great looks to her. This is one of the many shows where I find it impossible for myself to hate or dislike any of the characters.\\n\\n\\n\r\nOverall I really enjoyed Oshiete! Galko-chan! It was a real pleasure to watch. I mean I could not have asked for any better characters. I'd have to say again that Oshiete! Galko-chan is totally a hidden gem.\\n\\n\r\nFinal thoughts- \\n\\n\r\nI would recommend it, highly recommend it if you need a break from serious shows or maybe you just want to watch something to kill some time, I'd totally tell you to check out Oshiete! Galko-chan! I would have to say that it is worth the watch. Overall I gave Oshiete! Galko-chan 9.2/10 because while it lacked in certain departments or elements, it made up for those mistakes with its characters... its' sexy, sexy characters....",
            "date": "2016-03-25T08:48:00+00:00",
            "helpful_count": 98,
            "mal_id": 214033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=214033"
        },
        {
            "content": "Where do I begin with how impressed I am by this short comedy? \r\nI admit, I'm biased-I like shows where cute girls do cute things. Though these certainly aren't Lucky Star moeblobs. It's basically the same concept, but the stuff these girls talk about remind me of what I would talk about with friends. Bodies are weird, okay, and there's nothing wrong with wondering if curtains always match the carpet. \r\nStory: Not much real story. But there was a moment that surprised me-in the middle of the silly skits you'd expect out of a short SoL comedy, there was a surprisingly real moment. It wasdeep, yo. The character learned something, and tried to change for the better afterwards. A+\\n\\n\r\nArt: Not my favorite, but it's passable.\\n\\n\r\nSound: NGL I hate the opening song. It's annoyingly catchy but not actually a good song?\\n\\n\r\nCharacter: Character personalities are great. Even by looking at their names you can tell what archetype they are, and then they, especially Galko, go on to defy those stereotypes.\\n\r\nI will say one thing though: Galko's hair is effing ridiculous. \\n\\n\r\nEnjoyment: 11/10 short enough to keep my equally short attention span. \\n\\n\r\nOverall: Bottom line, if you like eavesdropping on cute girls having mildly vulgar conversations, watch this anime, you voyeur. Those in search of plot or true fanservice or action... what are you even on Galko's page for?",
            "date": "2016-02-04T08:32:00+00:00",
            "helpful_count": 68,
            "mal_id": 210081,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731968.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RilakkuLina",
                "username": "RilakkuLina"
            },
            "url": "https://myanimelist.net/reviews.php?id=210081"
        },
        {
            "content": "~Multilingual review, English & Español: Please tell me! Galko-chan~\r\nLong enough to cover everything that need to be covered and short enough to be interesting, that's the 'mini-skirt rule', and this anime follows it perfectly. However you're still behind a school's desk, or you already left them far behind in your past, I'm pretty sure you all overhead, at least once, a \"girl's talk\" your slutty girl-classmates did. Leaving aside the disappointment developed when you find out your crush wasn't as pure as you thought, it was sure an embarrassing moment overall.\r\nI once overhead my girls classmates talk about how big a famous singer's genitals were,what would they do with both him and his boyfriend (yes, you read right), among few other things I'd have wished to never hear. That particular event was engraved in my mind so whenever I listen to the word \"girl's talk\" that unpleasant memory comes to my mind giving me shivers down my spine.\\n\\n\r\nAnyway.. Even if the girls in Anime doesn't represent exactly real high school girls (fortunately), 'Please Tell me! Galko-chan' is one of those few anime who gets closer and manages to recreate a genuine girl's talk while leaving aside how disgusting could turn out to be.. if the girls were to be my classmates, that's it.\\n\\n\r\nFortunately our protagonists are adorable, simple innocent girls and the arguments of such talks, a bit \"stimulating\" whiteout reaching plain vulgarity, turn out to be interesting and cute at the same time due to the girls reactions when they get embarrassed even by their own conversations, even pushing the viewers to ask themselves 'How will they react to this?'.\\n\\n\r\nThe anime develops around 3 kind of stereotypes of High School girls. The 'gyaru', Galko-chan, a busty fashionable blonde girl which surprisingly is, contrary to her looks and behavior, a very kind and inexperienced innocent girl. The 'otaku', Otako, a small girl with glasses who likes to tease Galko with suggestive questions and arguments, with the risk of ending flustered herself sometimes, however she cares about Galko a lot. The 'princess', Oujou, a total airhead rich girl which hangs out often with the previous two ones.\\n\\n\r\nThere are also minor characters, don't forget the anime develops mainly inside a classroom, they didn't shine that much but their presence really give off a genuine \"classroom environment\". When I mentioned the 'mini-skirt rule' it was referred to the episode's duration, 7 minutes each one. I found the duration quite on mark, short enough to be interesting whiteout the risk of being boring. That was the main quality of this show.\\n\\n\r\nI really liked the characters, specially Galko, and how the main cast argued about such suggestive themes with such cute tones, it turned out to be really nice and refreshing. If you're searching for a short anime, maybe with nice girls and lot of humor, you can hardly find any better than this.\\n\\n\r\n[Español]\\n\\n\r\nLarga suficiente para cubrir todo lo que tenga que ser cubierto, y corta, suficiente para ser interesante, esa es la 'regla de la mini-falda', y este anime la sigue a la perfección. Independientemente de que si todavía te encuentras detrás de un pupitre escolar, o los dejaste ya atrás en el pasado, estoy bastante seguro que, al menos una vez, has escuchado por casualidad una 'charla de chicas' que hicieron tus -no tan inocentes- compañeras. Dejando al lado la decepción al descubrir que tú amorío no era tan \"pura\" como pensabas, fue de verdad un momento vergonzoso.\\n\\n\r\nUna vez escuché hablar a mis compañeras sobre cuánto grande eran los genitales de un famoso cantante, que cosa le harían a él y a su novio (sí, leíste bien), entre otras cosas que desearía nunca haber escuchado. El particular momento se imprimió en mi mente, así que todas las veces que escucho 'charla de chicas', ese desagradable recuerdo revive dándome escalofríos por todo el cuerpo.\\n\\n\r\nDe todos modos.. Aunque si las chicas en el Anime están bastante lejos de representar exactamente con perfecta afinidad el modelo de chicas en el mundo real (afortunadamente), 'Please tell me! Galko-chan' es uno de los pocos que realmente se avecina y que logra recrear una genuina 'charla de chicas' dejando a un lado cuán desagradable pueden llegar a ser... Si las chicas en cuestión son como mis compañeras de clase, eso sí.\\n\\n\r\nPor suerte nuestras protagonistas son simples e inocentes chicas, y los argumentos de tales charlas, algo \"estimulantes\" pero sin rozar la vacía vulgaridad, llegan a ser interesantes y adorables al mismo tiempo debido a las reacciones de las chicas cuando se avergüenza hasta de sus propias conversaciones, empujando al espectador a preguntarse 'Y ahora cómo reaccionarán a esto?'.\\n\\n\r\nEl anime de desarrolla al rededor de 3 clases de estereotipos de chicas. La 'gyaru', Galko-chan, una chica rubia, siempre a la moda, y con dos buenos melones qué sorprendentemente, contrario a su vestuario y comportamiento, es bastante inocente y amable. La 'otaku', Otako, una chica con lentes de pequeñas proporciones que le encanta molestar a Galko con preguntas y argumentos sugestivos, aunque si a veces corre el riesgo de quedar avergonzada ella misma. La 'princesa', Oujou, una cabeza hueca total que se junta siempre con las otras dos.\\n\\n\r\nEstán presentes también algunos personajes menores, sin olvidar que este anime se desarrolla principalmente adentro de un salón de clases, aunque si no brillaron de modo particular, la presencia de estos personajes le dieron un aire genuino de ambiente escolar a la serie. Cuando mencione la 'regla de la mini-falda' estaba referido a la duración de cada episodio, 7 minutos cada uno. La encontré de verdad acertada, corta suficiente para ser interesante, y sin el riesgo de caer aburrida. Esa fue la mejor cualidad de este anime.\\n\\n\r\nMe gustaron bastante los personajes, especialmente Galko, y también como las chicas protagonistas afrontaban los sugestivos temas con tan adorables tonos, al final se revelo ser bastante refrescante. Si estás en busca de algo corto, tal vez con lindas chicas y mucho humor, difícilmente encontrarás algo mejor que esto.",
            "date": "2016-03-25T09:26:00+00:00",
            "helpful_count": 46,
            "mal_id": 214043,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214227.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Vene",
                "username": "Vene"
            },
            "url": "https://myanimelist.net/reviews.php?id=214043"
        },
        {
            "content": "*Completed for the 2018 Anime Watching Challenge: (89) Watch an anime adapted from a Digital Manga*\r\nGoing into Galko-chan, I had zero expectations. I was expecting another mediocre slice of life anime. Thankfully, despite my incredibly low expectations, the show turned out to be pretty damn funny.\r\nI think the primary reason the show works so well lies in the length of its episodes. One of the biggest problems with the slice of life genre is that trying to make mundane, everyday interactions entertaining enough to keep the audience's interest for 20 minutes is a difficult feat. With Galko, each episode is approximately 7 minutes, meaning thatepisodes don't get a chance to wear out their welcome.\\n\\n\r\nOf course, this quick pacing isn't enough to carry a show, and for Galko-chan to succeed, it needs a strong sense of humor and a memorable cast of characters. As mentioned before, I found the show to be really funny. By no means is the humor in this show 'high-brow', in fact most of the jokes focus on some rather raunchy subject matter. Yet, by some miracle, the jokes never came across as tired or forced.\\n\\n\r\nIn terms of characters, the cast is another one of Galko's strengths. Every character was likeable, and their interactions with each other were great. In particular, I really enjoyed the dynamic between Galko's spunkiness and Otako's no-nonsense attitude. On top of that, Ojuo fits perfectly between the duo with her oblivious nature.\\n\\n\r\nTo top it off, the art direction is beautiful with some bright, colorful designs, and the voice acting is very well done.\\n\\n\r\nOverall, it's a solid show that's worth your time, especially if you're a slice of life fan.\\n\\n\r\n8/10",
            "date": "2018-02-11T01:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 271253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820073.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SomeMoron",
                "username": "SomeMoron"
            },
            "url": "https://myanimelist.net/reviews.php?id=271253"
        },
        {
            "content": "Oshiete! Galko-chan is something I, admittedly, would've never watched if I hadn't heard so many people raving about it. And boy, am I glad I finally got off my high horse and gave this hidden gem a try.\r\nIt's so, so hard for me to fully explain this show without making it sound like another ecchi mess, which it REALLY isn't.\r\nBasically, the plot is just Galko and her friends discussing various things about the human (particularly the female) body and things that you wouldn't see any other highschool girl in an anime say without dying of embarrassment, because that's how anime tends to portray it's girls,more often than not.\\n\\n\r\nBut the way they go about it isn't all that lewd. They go at it from a more clinical or even innocent way, making it less of a one-off fanservice thing and more...realistic, and damn endearing. \\n\\n\r\nThe anime also has a pretty relevant message of 'Don't judge a book by it's cover', with Galko's classmates assuming she's promiscuous, mean, and shallow because she embodies what a Gyaru is. Then, they end up being completely wrong and look at Galko in a different way, eventually coming to like her for the genuine person she is. \\n\\n\r\nGalko is just...cute. Really damn cute, fun to watch, and the perfect main character for this show. Her friends are both fantastic too, and I was surprised by how immediately I adored their chemistry together. \\n\\n\r\nThe art of this anime is downright gorgeous. The character designs, and I mean EVERY design, were unique and damn beautiful and made me wish her classmates got more screentime. Even in the few handful of times they're shown in-depth, Galko's classmates are filled to the brim with unique personalities, diverse bodies, and incredible designs.\\n\\n\r\n I've come to really respect the mangaka, and one of the reasons is because of how much effort was obviously put in designing each and every character, and giving them their own unique personality. \\n\\n\r\nGalko does a ton of things differently, and all of it lands so well and makes this show an endearing, adorably fun time. Believe me, if you think this show isn't your thing, give it an episode first. It may just surprise you with how it goes about things :D\\n\\n\r\nI would be absolutely overjoyed if this show got a season 2, and I'm probably gonna rewatch it as soon as I finish writing this review. The show was, as a whole, a treat to watch and the definition of a hidden gem. \\n\\n\r\nTo anyone considering watching this and reading reviews before you do, I implore you to give this anime a try. I'm almost certain you'll be pleasantly surprised!",
            "date": "2017-12-08T16:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 264795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6432107.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/evolvingweeb",
                "username": "evolvingweeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264795"
        },
        {
            "content": "THIS REVIEW MAY CONTAIN SPOILERS\r\nOkay, so looking at the top review of this anime made me laugh really hard because I've never seen such garbage.\r\nAnyway. I enjoyed this anime, hence the high score. It's the kind of anime I wished I'd watched at a younger age, not because it's completely accurate (not completely, but it's close to what high school was like) but because it would have helped me understand something sooner. Something that is the very heart of this little anime.\r\nAppearances don't matter and who you are perceived to don't matter either. It's up to YOU who you are and you don't have tobe like anything - the one thing that you have in common is being a human in the same society and doing your own thing. If this anime promotes ANYTHING, it's that of individuality. \\n\\n\r\nSure it's gratuitous, but I accepted that it was going to be like that from the very first episode. So yeah, I'm going to gloss over it so to speak, because my feelings on it are clear enough. \\n\\n\r\nStory - I didn't feel like there was much story, to be honest. The story of Ojou, Otako and Galko becoming friends was right at the very end of the season and to be frank, there's only so much you can fit in an 8-minute episode. That being said I felt that obviously, the narrative focused largely on Galko and her friendship with Ojou and Otako. So taking that into consideration I'd say the storyline did well because I was invested, but it wasn't groundbreaking.\\n\\n\r\nArt - The art was vibrant and cheerful. General happy-feeling kinda art that I genuinely enjoyed. As I don't pay much attention to art (sorry art fans) then I can't really make a real great guess on what I feel about it. I just genuinely liked the art and really enjoyed seeing anime girls and guys of all different shapes and sizes. It was nice to see and I applaud Oshiete! Galko-chan for this.\\n\\n\r\nSound - Again I didn't think the sound was anything groundbreaking. The little sounds they made when certain characters walked (namely Galko, lol) was humorous but it wasn't anything to go home about. Made me smile and laugh a few times, so rating it 6 seemed fair.\\n\\n\r\nCharacter - This is the strongest element of the series. Galko is seen as a typical gyaru and a lot of the characters make jokes about her being promiscuous. However, as the series progresses we learn that is FAR from the truth. She's just a normal, average gal who likes makeup, boys (though some of her interactions with Otako made me wonder otherwise), anime and cooking. More than anything the series states that Galko wants to be a mother. And it is shown in how she cares for everyone around her. When she saves Otako from her period embarrassment (something I can very much relate to) and gives her pills, she apologises for her behaviour about judging Otako before actually knowing her. Earlier on in the series a lot of the other characters end up in a bit of trouble (bed-hair, chipped nails, etc) and Galko goes out of her WAY to HELP THEM. For like, no reason apart from she's so nice? 10 points for Galko. Regardless of her looks and what people may think of her, she's an overall nice person and it's refreshing to see her in this light. \\n\\n\r\nOtako was also another favourite character of mine. I could relate to the whole 'silent loner head stuck in a book' kind of character, and yet when I found my friend group in high school I was also the one who would make perverse, lewd jokes just to get everyone's reaction. So I understood Otako and even though I feel as though her jokes towards Galko were a bit too far sometimes (something Otako herself acknowledges) she does genuinely care for Galko and it made me smile.\\n\\n\r\nOjou aka beware of the quiet ones! Ojou is a rich, air-head that doesn't really seem to match up to that description. Sure she's a bit ditzy sometimes, but she's also an honour roll student. So perhaps naive would be a better way of describing her. Either way, there is this one scene that made me really think of my perception of Ojou. She hears Otako and Galko discussing movies and wants to join in the conversation, but in doing so she speaks differently in order to imitate the way Otako talks. Both Otako and Galko look confused and then say to Ojou 'just be yourself'. And that...was kind of beautiful. It showed an insecurity of Ojou that I didn't think was there and it really changed how I viewed her significance to the trio.\\n\\n\r\nOf course there are tons of other characters, but the main three were my favourites so only they get a lengthy paragraph about them. ;)\\n\\n\r\nI don't think I have to go into much detail about my enjoyment. I really did enjoy it a lot and hope there's a season 2 as the series itself just made my day that little bit brighter. :)\\n",
            "date": "2017-11-24T15:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 263872,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6547053.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/captainrivaini",
                "username": "captainrivaini"
            },
            "url": "https://myanimelist.net/reviews.php?id=263872"
        },
        {
            "content": "Reading some of the other reviews actually makes me wonder what the fuck even is this community that I'm a part of. But whatever, although the story is nonexistant and pretty much everything is average - 10/10 best anime ever! Saw only 1 episode :)\r\nNah, what I really mean is that this show is very average and not worth your time. The only enjoyment you could ever have from this is looking at some really awkward poses that the characters are drawn in for some reason. Then again - their soulless eyes will dry up your life energy, so maybe not the best idea. \r\nIguess some 14 year old girls might relate to some of it, especially towards the end where they talk about how hard is dealing with first few years of menstruation. But everyone else will forget about the show in 5 minutes.",
            "date": "2016-09-09T18:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 228664,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5676075.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Alan_Albatross",
                "username": "Alan_Albatross"
            },
            "url": "https://myanimelist.net/reviews.php?id=228664"
        },
        {
            "content": "Galko is not a bad show and I certainly enjoyed it. It was funny and broke taboo and sterotype alike! But I couldn't help but feel it was a little gaudy. The art style is varied and pretty, but it isn't put to stupendous use. The jokes, while kinda informative and wholesome, got stale after a bit. I think this is one of the better short anime out there, but nothing you can't pass on. \r\nThat being said, it is good to see shows willing to tackle a broader variety of topics including things that are usually hushed up as inappropriate. While the topics didn'treally resound in me, I do find value in that this show was made and I hope others like it come along. \\n\\n\r\nThe friendship of the 3 girls is interesting, but doesn't evolve much until the last episode. I do like the way they end the series, as there is no *great* stopping point in short shows like this, so it makes sense to round it off with a 'how they all met' sort of story that a.) gives us a lasting impression of the characters and b.) hammers home all the ideas the show has posited the whole time. \\n\\n\r\nThe score is largely a reflection of my general enjoyment; I don't regret watching it, it was worth my time. But not something that will linger in my mind or alter who I am or anything.",
            "date": "2019-01-23T16:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 299873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IvivinPigeon",
                "username": "IvivinPigeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=299873"
        },
        {
            "content": "Review: Oshiete! Galko-chan\r\nStory (4/10): This anime has no framework or a single plot to follow on but rather focuses on the daily lives of a gyaru, an otaku, and an airhead. However, the characters and their use of comedic relief in each episode is quite entertaining to watch. Each episode is episodic filled with humor of the female genitalia. The jokes were dirty and playful and every once and a while, a smirk or two came across my face when watching. Putting humor aside, each episode was amusingly very informative when learning about female genitalia. With humor mixed in with educational facts, those two factorsis what this make this anime unique.\\n\\n\r\nArt (8/10): The art is fresh. Colorful and eye-catching. From the quirky character designs and to the vivid animation, everything was done well from Studio feel. The studios who made the infamous Kiss x Sis, the brilliant Yahari Ore no Seishun Love Comedy wa Machigatteiru, and unfortunately one of the most disappointing winter shows this season, Dagashi Kashi. Surprisingly, studio Feel hasn't gotten the recognition they deserved yet. Mainly, it is due to the lack of reputation most of the anime made from their studios. With Galko-chan however, the art Studio feel made has not yet to fail. If there a downside to this anime however, it would be many of the female characters oversized breasts. An overused anime trope, in result, a nuisance. But overall, the art is great and is overall one of its strongpoints in this anime. \\n\\n\r\nSound (3/10): Since this anime had a duration of seven minutes, Studio Feel managed to fit in at least an opening theme. The opening theme coming into the anime was bright and energetic. But unfortunately, it wasn't catchy to make it rememberable. Overall, the soundtrack was one of it's downsides as it lacked any music at all.\\n\\n\r\nCharacter (8/10): The characters are original in sense despite using most of the anime tropes in the book. Despite using some of the anime tropes, most of the characters personalities were unique making it want to learn about them more. Story is essential when it comes to character development and such. But unfortunately, leaving a solid plot for the characters to build on and despite the duration of each episode left the characters unfilled. They lacked the respect they deserved despite having great personalities. Budget cuts, sigh.\\n\\n\r\nEnjoyment (8/10): Managed to binge watch this anime despite having a constrained time schedule. But, it only took me an hour and a half to watch. Oddly enough, this anime was surprisingly entertaining to watch. If only it were longer.\\n\\n\r\nOverall (7/10): This anime had so much potential if there was some sort of plot to follow on with all these characters in hand. Shame that they didn't get developed on. But despite of all of that, this anime was surely entertaining to watch. The art is fresh, colorful and eye-catching. The daily lives of an unusual bunch of high schoolers and their use of humor on female genitalia was quite amusing to watch. Wouldn't say this anime is overrated but lacked the attention it deserved. But overall, do not look for the story but for the comedic relief this anime has to offer. It only takes an hour or two to watch the entire anime. Worth a watch and definitely recommend this anime for those who want to watch due to a constrained time schedule or just for fun in general. Give it a try!\\n\\n\r\nRAW SCORE: 6.5/10.0\\n\\n\r\nOVERALL SCORE: 7.0/10.0\\n\\n\r\n-8.0/10.0 (Generous score)\\n\\n",
            "date": "2016-08-24T20:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 227540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006714.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/_LorDNiCo_",
                "username": "_LorDNiCo_"
            },
            "url": "https://myanimelist.net/reviews.php?id=227540"
        },
        {
            "content": "I was watching this for the 2019 Anime Challenge while still a Novice as I found this series short to watch. \r\n'Oshiete! Galko-chan' is a slice of life, comedy and school anime and you can expect what's it going to be about. I thought it would be a good way to kill time (While procrastinating) to watch this show. Actually, the teaser of this show caught my attention.\r\nThis anime is good for early teens as most of the characters portray them. This comedy series revolves around their nature and how they discover themselves. As a guy, there were few things I learnt about the oppositesex. Some Japanese culture is also shown.\\n\r\nThe story is about a girl names Galko, a popular girl who is referred as a 'gyaru' and party animal despite being innocent. She is friends with Otako (Who is an otaku) and Ojou (a wealthy young lady who tries to fit in Galko and Otako's conversations and ends up being an airhead). It describes their life as students and their struggles. I would say it rightly describes the situations as teens appear to be curious.\\n\r\nFurther more, the anime includes lewd talks about general curiosity and superstitions which adds spice to it along with some humor.\\n\r\nI think it's a good anime. The animation is done quite well and I think the characters go nicely with their personalities.\\n",
            "date": "2019-01-09T23:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 298611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7515300.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rasta687",
                "username": "Rasta687"
            },
            "url": "https://myanimelist.net/reviews.php?id=298611"
        },
        {
            "content": "Best described as \"a nice little anime\", with the focus on \"little\" due to episode length. The characters are pretty lovable, colorful and well thought out, but the lack of good comedy (and by that i mean stuff that actually make you laugh and not just smile or chuckle), story (and therefor its progression), relationships and romance as well as each episode being only 7 minutes long kind of ruins it.\r\nOn top of it all there's more fanservice than the short episodes can or should be made to handle, but its mostly well placed so it doesn't stand out like a sore thumb as insome other titles. Best compared with \"Seitokai Yakuindomo\", this anime doesn't really hold its ground too well, still, its kind of fun and definitely worth a watch.",
            "date": "2016-03-25T15:15:00+00:00",
            "helpful_count": 6,
            "mal_id": 214103,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3297153.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/mkzxwing",
                "username": "mkzxwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=214103"
        },
        {
            "content": "I didn't expect an anime about girls talking about their genitalia to be this good.\r\nStory: This anime is episodic, so it doesn't really have story (unless you count \"3 girls talk about their bodies\" as one.) This works really well though, because the episodes are only 7 minutes long. Trying to put plot development in a 7 minute episode is like trying to put your dick in someone's clenched butthole. If you force it in, you might be able to cram it in. However, you will never be able to put it in properly (amazing comparison, I know). 7/10\r\nArt: It looks decent. I think evenbrighter colours would've worked better. 6/10\\n\\n\r\nSound: This anime barely has a soundtrack. The only song I remember is the OP (and the jingle played every time a question is asked by the narrator if that counts), which was meh. 5/10\\n\\n\r\nCharacter: Galko is the extrovert that pretty much every boy in the anime has a crush on, Otako is the otaku that makes up bullshit to tell to Galko and Ojou is the airhead that often is the third wheel. You would never think that these three characters could be friends together, but they are. I think that that's the underlying message of this anime. That just because someone is very different from you, doesn't mean you can't be friends with them. Otako says pretty much the exact same thing in the last episode of this anime. 9/10\\n\\n\r\nEnjoyment: I enjoyed this show a lot, mostly because of the hilarious questions they have about their bodies (like \"Is it true that virgins use pads, and non-virgins use tampons?\"). However, I recommend you to watch this anime in short bursts (around 2 episodes a day). This anime is pretty repetitive, so binge watching this anime will make you bored quick. 8/10\\n\\n\r\nOverall: I give this anime an 8/10. I definitely recommend it.",
            "date": "2017-07-03T14:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 251867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6207861.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nuttygardentree",
                "username": "nuttygardentree"
            },
            "url": "https://myanimelist.net/reviews.php?id=251867"
        },
        {
            "content": "I'm gonna be honest: The moment I saw those tiddie graphics I thought this was gonna be cliche and it was gonna suck ass. I was wrong as hell\r\nThis show takes it's characters and bases them of of cliche tropes on first sight, going as far as naming them after their tropes. Then the shows SHITS ON THE TROPES. It writes it's characters like real ass people, who are more to the eye than their appearance. They have little quirks, backgrounds, experiences. They aren't just an idea of a character, they're presented as human. And, honestly it's amazing. It's some anime breakfast club shit\r\n((also itbreaks the norms that women's bodies have to be \"\"\"\"\"\"\"perfect\"\"\"\"\"\"\"\"\" in order to be beautiful))",
            "date": "2017-05-01T16:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 246768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/emily_addler",
                "username": "emily_addler"
            },
            "url": "https://myanimelist.net/reviews.php?id=246768"
        },
        {
            "content": "NOTE: This MAY contain spoilers!\r\nStory 5/10: No plot. High school friends hanging out with each other.\r\nCharacters 6/10: No character development. But you get a sense of how they are and how they interact with each other. There are some funny and perverted/sexual moments of references. Galko is constantly late for class and laid back. She is known to have large assets. Ojou is kind, and bubbly. Otako is a bit monotone but chilled. \r\nOverall enjoyment 5/10: It was okay. It can be boring at times, but in the beginning of the anime, they introduced some of the other characters and gives them a brief introduction.With an anime that doesn't have a lot to work with, it is less than 10 minutes. The questions that the anime asks in the beginning of each episode also makes the audience curious as well. It is basically an anime full of pillow talk for girls who have these types of conversations.",
            "date": "2016-06-01T18:49:00+00:00",
            "helpful_count": 5,
            "mal_id": 219808,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=219808"
        },
        {
            "content": "I don't know how to write a review, so I'll jump right into it. Note that I use a weighted system, as follows:\r\nStory: x/10 * 2\r\nCharacters: x/10 *2\r\nVisuals: x/10 * 1.5\r\nEnjoyment: x/10 * 1.5\r\nSound: x/10 * 1\r\nTotal: x/80\r\nStory - 4/10 * 2 = 8/20\r\nThere's very little story to this. Most episodes revolve around some sort of rumor that is introduced at the beginning by the narrator. Later, there is an attempt at an actual story, but it is executed too late, and fails quite miserably. \r\nCharacters - 3/10 * 2 = 6/20\r\nThe characters are almost all extremely one-dimensional, except for Otako. Galko is defined byjust two traits, her large breasts and her being a gyaru. Ojou is defined by her naivety and her implied wealth. Otako, however, is a bit different. Although Galko and Ojou simply accept the world around them, Otako questions her surroundings and fools around with Galko in an almost intellectual way. There are several minor characters that are introduced, and they're even more bland. They are often defined by not two, but just a single trait. Don't expect character development, the writers didn't think of that.\\n\\n\r\nVisuals - 4/10 * 1.5 = 6/15\\n\r\nThe visuals are, for the most part, not too bad. The backgrounds are occasionally bright cheerful colors, as is our protagonist's outfit and appearance. However, besides this, the visual quality is not very good. Characters are plagued by having QUALITY faces often, and there are many scenes where corners are cut in terms of visuals, with lips not moving with the chin, mouth covered by an object, and other things of that nature. This occurs in almost every anime, however, so there is a bit of slack for that. Character designs are average, with Galko obviously being the most thought-out character in terms of her appearance. Besides that, the characters are very indistinguishable.\\n\\n\r\nSound - 4/10 * 1 = 4/10\\n\r\nThe sound is of average quality, by every meaning of the word. Nothing too bad or too good in this regard.\\n\\n\r\nEnjoyment - 8/10 * 1.5 = 12/15\\n\r\nIt's a funny show. I will give it that. The humor is very feminine, but despite that, I still managed to laugh, as it is a nice change of pace from regular comedies that cater to a predominantly male audience. The jokes are dirty to an extent, but at the end of the day it's nothing too spectacularly over-the-top.\\n\\n\r\nOverall: 36/80 = ~4.5(5)/10\\n\r\nWatch it if you want to relax with a decent show that shows high school life from the perspectives of girls.",
            "date": "2017-02-15T11:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 240643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3558373.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Abnf",
                "username": "Abnf"
            },
            "url": "https://myanimelist.net/reviews.php?id=240643"
        },
        {
            "content": "Overall - 5:\r\nThis anime is the kind of anime that looks good in gifs because the art and character design look good. The show, unfortunately doesn't live up to the expectations these gifs create.\r\nStory - 4:\r\nNothing really special here, for the most part the mini stories aren't all that interesting.\r\nArt - 7:\r\nLike I said before, this show looks good. It's not trying to animate anything too complicated, a lot of it is pretty simple talking scenes, but it does a good job at making those scenes look good.\r\nSound - 4:\r\nThe soundtrack is boring, kinda like the show. The tracks fit well into the show, sothis isn't rated too low, but there's nothing too good about the sound.\\n\\n\r\nCharacters - 7:\\n\r\nThis is probably this show's strong suit. The characters each have their own little quirks that make them stand out, not only from other characters, but the stereotypes they represent as well. Most of the show is getting to know these characters, which is a good thing.\\n\\n\r\nEnjoyment - 5:\\n\r\nI liked the characters, and the occasional scene was pretty good, but a lot of the time it was just kinda boring.",
            "date": "2017-11-28T20:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 264146,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6767999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dualsaga184",
                "username": "Dualsaga184"
            },
            "url": "https://myanimelist.net/reviews.php?id=264146"
        },
        {
            "content": "Girls talking about their bodies and it's has some comedic charm to it?\r\nOshiete! Galko-chan is an anime short mainly about Galko voiced by Azumi Waki the gyaru, Otako voiced by Miyu Tomita the otaku and Ojou...the ojou voiced by Minami Takahashi and they for the most part get into conversations about their bodies. Oddly enough this actually works as the three main cast members of the gyaru, otaku and ojou have somewhat \"playing against the type\" sterotypes of their sterotypes. Galko is actually shy and gets nervous when talking about ecchi things, Otaku is actually very talkative and teases Galko ALOT with comedic misunderstandings andOjou is rather aloof and most of the time comedically missing the point.\\n\\n\r\nThe relationship between these three characters really do make this anime short worth it even beyond the vulgar girl talk.\\n\\n\r\nThe other minor characters do get thier time in the limelight though they are primarily used with a punchline to Galko, Otako and Ojou's conversations at times.\\n\\n\r\nThe comedy for this anime short comes from either extremely witty teasing humor between the characters or just vulgar talk with a good punchline by the end of the episode.\\n\\n\r\nThe animation by studio feel, the character designs are decent enough though some of the clique characters do come off as slightly generic, there are a few \"unique\" character design choices, as for background is moderately ok. The animation isn't something to brag or talk about in detail, but overall the animation is managable and consistent with no blatant errors considering this is an anime short.\\n\\n\r\nThe last episode however does bring in a VERY good theme of \"don't look at a book by it's cover\" and it's blatantly and cleverly shown through the interactions of Galko and Otako and brings this anime short from merely talking about girl's bodies and being ecchi and witty about it to talking about the stereotypical archetypes of anime and saying \"who cares about the stereotype?\"...the anime characters can be something beyond just \"gyaru\", \"otaku\" or \"ojou\". (Note: LA isn't saying it's a HUGE revelation or taking huge steps to bring this theme into play, but it's subtle and somewhat low key in HOW they portray it).\\n\\n\r\nOshiete! Galko-chan is one of the hidden gems of the Winter 2016 anime shorts (the best hidden anime short gem goes to Sekkou Boys by the way) and LA will say this like the theme of this anime short, \"don't look at a book by it's cover\", this anime short is NOT just about vulgar girl's bodies talk...it has something more, just...how about opening the book?",
            "date": "2016-06-06T20:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 220173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=220173"
        },
        {
            "content": "Hey folks, this will be a review for Oshiete! Galko-chan. You know when you have a craving for some food and then pig out on it until the thought of eating any more sickens you? That's what this show does to sexual interest.\r\nThe story is really straightforward. Three girls attend a high school class in which they will talk about something perverted. Generally they will be presented with a question like, \"is it true that girls with larger boobs have larger areolas?\". The girls will then discuss it as if it came up in natural conversation. Generally Otako uses the topic to pick on Galko,who in turn generally gets embarrassed and responds loud enough for her class to hear, rinse and repeat.\\n\\n\r\nThe characters are strange. Galko is a gyaru who is actually innocent and not perverted. Otako is a nerdy girl who loves picking on Galko. She is in general funny, and interesting, if only because she is the only character really. Ojou is the third wheel character who every now and again will amplify a joke because she comes in during the middle, or misunderstands it.\\n\\n\r\nHonestly I wasn't expecting what I watched. I thought it might be a little more clever or not as direct. At first the explicitness of the topics was interesting and amusing but it quickly became repetitive. Unlike Seitokai Yakuindomo, I quickly became bored. Its a strange thing to feel tired of lewd things, not sure I'm happy with this outcome.\\n\\n\r\nTLDR: Even though its a short I still wouldn't recommend it. If you want sexual jokes and haven't seen Seitokai Yakuindomo, then go watch that.",
            "date": "2016-10-19T18:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 232120,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=232120"
        },
        {
            "content": "A show about a bunch of cute girls, who embody stereotypes, hanging out at school? Sounds boring!\r\nBut wait, they're all subversions of their own archetypes by being deliberately cliche on the surface, with unique personalities underneath? Oh great, another edgy deconstruction!\r\nFortunately, Oshiete Galko-chan isn't just another deconstruction of X genre; it plays the gimmick of each character being named after and seeming like one specific character archetype, while actually being deeper than they seem, but they aren't deliberately NOT those things, either. Otako is a shy otaku who reads a bunch of manga, but she's still an interesting person with her own tastes, who doesn'teven see herself as an otaku, but rather someone interested in all kinds of books. Ojou is the prim-and-proper rich girl, but she's also kind of an airhead with her own unique set of quirks. Galko is a true gyaru, but she's interested in everything and can't resist getting involved with everyone.\\n\\n\r\nOshiete Galko-chan isn't filled with gripping character drama or even particularly hilarious humor, but it is engaging and memorable for its complex characters, who interact with each other believably and manage to form real relationships with one another over the short ~90 minute run-time of the series.\\n\\n\r\nIf you're like me and have grown cynical and tired from countless shows where everyone is absolutely pure-hearted and naive, Galko-chan is a refreshing change of pace, with each character being good-natured while maintaining a reasonable amount of selfishness and a lack of sensitivity, as is expected of a high school student. They have legitimate interests in sex and relationships, and their curiosity about the opposite sex makes for some really sincere and interesting character interactions. Oshiete Galko-chan doesn't treat taboo subjects like jokes or shock-factor, it explores them through the minds of curious, nervous adolescents, and it just feels refreshing and realistic to see characters in anime actually talking about them like reasonable people instead of gasping and getting nosebleeds at the mere thought of sex.\\n\\n\r\nOverall, Oshiete Galko-chan is heartwarming, funny, and engaging. All I can ask for in a show is that it doesn't bore me, and the surprisingly broad cast of memorable, believable characters made for some excellent banter and drama. Every moment of the show brought more depth to its characters, by showing them in new situations, reacting in ways that were often unexpected and yet never felt out of character. It's not much of a commitment to pick up, as it's only twelve eight-minute episodes, and it's absolutely worth the time",
            "date": "2017-08-25T19:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 256254,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1364157.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/anaract",
                "username": "anaract"
            },
            "url": "https://myanimelist.net/reviews.php?id=256254"
        }
    ],
    [
        {
            "content": "I really like short anime because they are straight to the point. \r\nThis anime is just a time waster, and that isn't a bad thing. I really liked getting to know all of the characters in the series, even the perverted boys. \r\nGalko is funny, and literally physical appearance goals! (but that's just me), and Otako is extremely relatable. She's snarky, smart, and cunning! And Ojou reminded me of Osaka from Azumanga Daioh. \r\nAnyways, this anime is just a lot of fun. A great example of stereotypes, friendship, and even a bit of sex ed. \r\nI recommend this anime to anyone wanting to just killa half an hour or so, and see a bunch of cute girls so on cute adventures together! \\n\\n",
            "date": "2016-03-27T19:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 214470,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5263688.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MissOtaku1997",
                "username": "MissOtaku1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=214470"
        },
        {
            "content": "Oshiete! Galko-chan is probably one of the weirdest anime-related experiences I've ever had, for this show is pretty unique and unusual and there is nothing I can compare it to. Slice of life as a genre is not new and has been exploited constantly for years, which is why it is hard to create a slice of life anime that will manage to surprise the audience and, most importantly, make people want to watch it from start to finish. So what makes this series so interesting and unusual regardless of what one thinks of it?\r\nStory: 6/10.\r\nOshiete! Galko-chan consists of several short episodes (approximately 7 minutes,sometimes a bit longer) in which the main three characters discuss their daily life, problems and random things. Pretty simple, however, sometimes they bring up themes that are pretty embarrassing and, perhaps, should not be discussed in public. That's the reason why my rating for this aspect of the anime cannot be higher than 6, risky and suggestive subjects are to blame. Call me conservative, if you please, but most of their conversation subjects were beyond my understanding. However, what saved the story from failing is proper execution, so let's move on to other parts of this anime, shall we?\\n\\n\r\nArt: 9/10.\\n\r\nThe art style and character designs are pretty appealing and vibrant colors only make it better, and all that makes the art of Oshiete! Galko chan perfect for a typical comedy/slice of life anime. Perhaps, I'd appreciate it if Galko's features were less exaggerated, but that is my personal preference as I've already seen quite a lot of female characters with unrealistically big breasts. But overall, this anime has art that is nice to look at and that's good enough for me.\\n\\n\r\nSound: 7/10.\\n\r\nWhile I can't really say anything about the soundtrack as it was pretty forgettable, I want to point out that the voice acting in this anime is spot on (as always, I have yet to encounter serious cases of horrible voice acting), which is why this aspect deserves 7 out of 10.\\n\\n\r\nCharacter: 9/10.\\n\r\nOh, here comes my favorite part of this show. The characters. Why? Because, despite being obvious examples of particular parts of the Japanese modern culture, they manage to break stereotypes and their personalities feel like a breath of fresh air, especially when most shows nowadays are filled with characters that are nothing but embodiments of certain archetypes and have little to no unique traits.\\n\r\nThere are three main characters in this anime: Galko, Otako and Ojou. No, these are not their real names. In fact, later on you find out that they gave each other nicknames that fit them and their nature quite well.\\n\r\nGalko is the character this show is focused on. She is a gyaru (a Japanese transliteration of the English word 'gal') and, as a result, most people think of her as an airhead and an easy lay, which is not even remotely true. Galko herself states that no one has to act in accordance with stereotypes just because this person is a gyaru, an otaku or anybody else. She is a surprisingly innocent and emotional person, not to mention that she is kind-hearted and frienly as she is always ready to help her friends and classmates. Long story short, one should never judge a book by its cover and Galko's attitude is what makes her likable not only as a character, but as a person too.\\n\r\nOtako is one of Galko's best friends, a bookwork and, as her nickname suggests, an otaku (a female otaku = Otako). While Galko is friendly, Otako is more reserved and introverted, which is why sometimes Galko's habits and behavior annoy her to a certain extent. However, they get along very well. Otako seems to be a knowledgeable person as she is the one who shares certain facts with her friends, be it something innocent or suggestive.\\n\r\nOjou is a proper lady from a rich family and, as a result, some of the subjects and things her friends discuss are beyond her understanding and she tends to misinterpret them. She is a bit of an airhead, but her friendly and polite attitude make up for it.\\n\r\nThe rest of the cast consists of random people, classmates and teachers and their interactions and misunderstandings are the main source of jokes and funny situations in this anime. Unfortunately, their personalities are not as solid and clear as those of the main three characters, which is why, after some consideration, I had to lower my rating for the cast of this series just a bit.\\n\\n\r\nEnjoyment: 8/10.\\n\r\nI didn't know how to rate this anime. I do not mind fanservice or a few lewd jokes here and there as long as they do not feel out of place, but I did not see that coming when I decided to watch Oshiete! Galko-chan. But, much to my surprise, I managed to enjoy this anime despite my mixed feelings about suggestive subjects as a source of entertainment, thanks to Galko and her friends because they made this anime fun to watch and easy to enjoy.\\n\\n\r\nThis is not the kind of anime everyone will enjoy without a doubt due to things Galko and her friends talk about. To each their own and in this particular case I cannot guarantee that you will enjoy this show for sure. But, if you are not afraid of lewd jokes and silly suggestive themes, you might as well enjoy this show.",
            "date": "2017-07-09T07:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 252362,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5260988.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Waffle_Empress",
                "username": "Waffle_Empress"
            },
            "url": "https://myanimelist.net/reviews.php?id=252362"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nWhen people look at me, they cannot believe that I love to listen to heavy metal.\r\nThe most recent disbelief actually came from someone close: my brother-in-law. We were talking about bands and music in general when I brought up Metallica, both my favorite heavy-metal band and my favorite music group ever. I rattled off some of my favorite songs – “Disposable Heroes,” “Blackened,” and so on – and he was taken aback at my adoration.\r\nI don’t blame him for his surprise because, as an unassuming nerdy white guy, I don’t “appear to be” a fanof that kind of music. But that’s why we talk and listen to others in order to really understand them. In other words, interests, personality, and actions mean more than some jeans and a polo ever could.\\n\\n\r\nAnd Oshiete! Galko-chan agrees.\\n\\n\r\nSTORY\\n\\n\r\nOshiete! (for short) takes a somewhat unconventional route: girl talk.\\n\\n\r\nMake-up, breast sizes, and periods are the norm from episode to episode. For example, one scene has the girls checking out whether they should purchase pads or tampons while a later conversation has them discussing the difficulties associated with bra purchasing. Embarrassing discussions (usually posed as an opening question), but they provide a peek into a part of life that does not usually get publicly paraded.\\n\\n\r\nOf course, the topics, while still stemming from the girls’ talk, do not strictly stick to just them. Earlobes aligning with nipples. The reason for varied bladder sizes between sexes. The absence of melanin in private places. All examples of Oshiete! continuing with the girl-centric motif while also broadening its reach into more semi-educational material.\\n\\n\r\nIn what can only be called a clever move, the anime also introduces a group of boys. They not only mix up the formula but also provide an outside perspective. Much of that perspective revolves around their libido-driven imaginations – they get excited when Galko talks about breasts being as soft as bread dough – but they help to accentuate the girl talk from the boy talk in a simple yet direct manner.\\n\\n\r\nSimultaneously, much of the content, while serious or factual in its presentation, aims for comedy. Galko taking a euphemistic psychological test becomes a comedic scene when she gives her answer in an obliviously sultry way. Or Ojou mistaking a “rubber” for a bracelet as opposed to a condom puts her in quite the promiscuous-sounding situation.\\n\\n\r\nAnd as can be gleaned from almost every example, sex has a lot of prevalence. Otako bringing up a “long-held belief that lips represent a person’s genitals,” an intense love scene during a movie, and one of the boys seeing the (to them ironic) white panties of Galko when she bends over to pick up a dropped pen. Sexual but contextual – these are boys and girls going through high school. So having material related to their natural, hormonal feelings only makes sense.\\n\\n\r\nBesides the motif, the comedy, and the sex, Oshiete! even contains a prominent theme: It’s what’s on the inside that matters most.\\n\\n\r\nBomuo, the bedhead boy, views Galko as nothing short of annoying for her incessant hair-care complaining. But, once she helps him out, he develops a small crush on her. Similarly, Iinchou, the student council president, initially believed Galko to be too carefree. But, after watching Galko take part in an essay-writing contest, Iinchou partially regrets thinking of Galko in that way.\\n\\n\r\nThe final episode of the season cements this idea as the show’s main focus. Galko and Otako first meet here in high school. However, they do not originally get along – mostly because Otako prematurely judges Galko, going so far as to insult her. But when Otako finds herself in a personal dilemma, Galko arrives to aid her without a moment’s notice. Afterwards, they make up and become best friends – with Ojou joining their group in an unexpected, comedic fashion and these nicknames for all.\\n\\n\r\nThe entire narrative is not exactly complex, but it’s consistent in its content and surprisingly smart in its presentation. Plus, at roughly eight minutes an episode, the show is quick and to the point.\\n\\n\r\nOne can’t ask for much more.\\n\\n\r\nANIMATION\\n\\n\r\nOshiete! stays mostly within its school setting, leaving little room for experimentation in terms of its art. Other places, like a public pool or Galko’s house or the local mall are visited, but those places are definitely not the norm.\\n\\n\r\nInstead, the norm consists of a feminine color palette to fit the feminine show. Lots of pinks, yellows, and lighter variations of greens, purples, and blues paint and dot the anime. More specifically, they make up the anime’s common technique of turning the backgrounds into more stylistic drawings of lines and shapes.\\n\\n\r\nIt’s also worth pointing out that the OP’s visuals are reused scenes (with a small handful of original material) from the season itself. An unfortunate decision that only hurts the show.\\n\\n\r\nThe character designs, however, receive a nice amount of attention. Galko’s long, blonde hard, big bust, and tallness, with many accessories ranging from earrings to bracelets, paints her as the gyaru she is. Otako’s unkempt hair, glasses, and short figure, plus her plain clothing and freckles, give her an otaku look. And Ojou’s straight-and-braided hair, proper attire, and beaming smile make her out as the likable, wealthy airhead.\\n\\n\r\nTo put it differently, Oshiete! designed the cast (including the side characters) with an “all types” mentality. In this way, the anime adds variety to its jokes and its ideas in a natural fashion.\\n\\n\r\nAs for the animation, it does not hold up as well as it could. Characters often stand around as they make their quips without much body movement. Episode four has a particularly slow-moving and un-animated basketball – an indicator of the anime’s low level of actual animation.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe main girls of Oshiete! – Galko, Otako, and Ojou – are usually pigeonholed into their respective, encompassing trait for comedic purposes. For example, the class misunderstands Galko when she calls her father “Papa,” believing that she prostitutes herself. Otako brings up niche, old wives tales whenever she can. And Ojou joins conversations halfway through, misinterpreting most of what was said.\\n\\n\r\nIn other words, the characters behave in a manner that their appearances would seemingly dictate. Surprisingly, however, the characters manage to successfully tackle a sweet, if not cliché, theme that goes against this notion. A theme seen throughout the events of the story: It’s what’s on the inside that matters most.\\n\\n\r\nThis theme is readily apparent just by describing the characters. Galko is classified as gyaru – gaudy looks and a penchant for debauchery. While she does put extra care towards her appearance, she, more often than not, takes part in recreational activities. She likes to cook. She enjoys watching films and anime. She hangs out with her friends in class and at the pool and mall.\\n\\n\r\nBeyond her interests, her personality also contrasts with how people may see her. She lends her materials out to those that need them. She is extremely friendly to everyone, even strangers. And she has a tender side when it comes to romance and motherhood.\\n\\n\r\nOtako is similar. Deemed an otaku, many people view her as someone too entrenched in her personal hobby. Namely, books. But those bindings and pages say very little about Otako as a person. She likes to tease (especially Galko). She cares deeply for the close relationships she shares, making sure to think before she speaks in a given situation. She gets the most embarrassed about sexual topics despite her allusions to them.\\n\\n\r\nAnd, perhaps obviously, the same can be said for Ojou. As an airhead, she has trouble keeping up with Galko and Otako’s banter. And her wealthy status, where chefs and tailors wait on her hand and foot, only continues the idea that she is not independently strong. Yet she does not let this direction deter her. With childlike wonder and happiness, she constantly seeks to learn more, giving her a set of observational skills that the others do not necessarily have.\\n\\n\r\nWhile the cast all represent the same theme, a negative does manifest: Otako and Ojou (and the majority of the side characters) hardly get to demonstrate this idea. While the anime is titled Oshiete! Galko-chan, everybody but Galko rarely gets to act differently from their supposed stereotypes. Especially so in Ojou’s case since she has a smaller amount of screen time than both Galko and Otako. As such, the characters’ theme ends up only moderately strong.\\n\\n\r\nSOUND\\n\\n\r\nWhile the opening track for Oshiete! is quite quick and upbeat, even catchy, it tends to be too long. The show is short, so when the OP sometimes lasts upwards of two minutes, it takes up precious time that the anime could be using to provide more of its comedy and scenes.\\n\\n\r\nThe ending track consists of (mostly) just an acoustic guitar. It’s short, sweet, and simple. Exactly what the ED needed to be for this kind of anime.\\n\\n\r\nPerhaps expectedly, the rest of the original soundtrack is nothing to praise, consisting mainly of simple slice-of-life tunes that fit the silly and laidback nature of Oshiete!. But while the OST may be lacking, the other sound-effects are not.\\n\\n\r\nMany times, the anime includes silly sounds, like a whip cracking to censor a dirty word or a tiny bell for each major question asked. The anime even uses narration for a lot of the sound-effects, like when the boys whiff the scent of the girls as they walked by or the bouncing of breasts when Galko was running, adding further to the comedy of the anime.\\n\\n\r\nLastly, voice acting performances are slightly above average. Azumi Waki as Galko, in one of her first main roles, gives the girl a sexy and energetic voice. Miyu Tomita as Otako, also in one of her first main roles, uses a quieter, tomboyish voice for the small girl. And Minami Takahashi as Ojou nails that airhead way of speaking.\\n\\n\r\nENJOYMENT\\n\\n\r\nI was pleasantly surprised by how much I liked this one.\\n\\n\r\nGalko, Otako, and Ojou were fun to watch on-screen. Galko blushing at the prospect of reading a kissing scene in a literature book. Otako reading up on areolae to cheer up her best friend. Ojou being amazed at everything that happened in front of her. They each had their moments, and they each made me laugh.\\n\\n\r\nOther segments had me smiling wide or nodding my head in approval. The small aside when Bomuo dreams about living out the rest of his life with the sea urchins, and the sea urchin not empathizing with him, made it obvious how snappy and funny the anime could be. Or when one of the boys had his hand used by Galko to prove how small her hands were brought even more hilarity.\\n\\n\r\nMy favorite moment from the whole season, though, comes from Galko in episode seven where she, Otako, and Ojou go to the pool. A couple of girls heckle a young boy because his mother dotes on him. Que Galko wrapping her arm around the kid, pulling him close, and staring directly at the hecklers. They storm off (a later scene implies that one of them has a crush on the boy – hence the heckling) thanks to her quick thinking. She read the situation perfectly, making her and that tiny scene awesome to watch.\\n\\n\r\nOshiete! Galko-chan winds up being a rather solid experience. Music and animation may have troubles, but the unconventional topic, the thematic cast, and the nice character designs make the show a simple yet fun outing – even without any heavy metal.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, girl talk galore that contains different perspectives, nice comedy, sexually relevant material, and a theme about “it’s what’s on the inside that matters most”\\n\\n\r\nAnimation: Fine, colorful art, nice character designs, and below-average actual animation\\n\\n\r\nCharacters: Fine, Galko, Otako, and Ojou continue the theme about “it’s what’s on the inside that matters most” but only mostly with Galko\\n\\n\r\nSound: Fine, bad OP, okay ED, bad OST, nice sound-effects, slightly above-average VA performances\\n\\n\r\nEnjoyment: Good, silly characters, fun comedy, and some awesome moments\\n\\n\r\nFinal Score: 6/10",
            "date": "2017-02-23T17:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 241232,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=241232"
        },
        {
            "content": "Story-\r\nOshiete! Galko-chan follows three girls that talk about \"dirty\" and \"perverted\" subjects yet still remain very innocent. \r\nArt- \r\nI really love the art style of Oshiete! Galko-chan. It's a really nice, bright art style that fits the mood of the show.\r\nSound-\r\nThe sound is good, but nothing stuck out to me.\r\nCharacter-\r\nI really love the characters in the show. They stay likable, but also hate-able. Except Otako, she's always great.\r\nEnjoyment-\r\nI all binged this in about 3 hours with breaks and such and I enjoyed myself the whole time. \r\nOverall-\r\nAll the points I've stated above, plus the opening theme. It introduces the characters in the OP. But, theymake it more interesting by changing the bios based on the segment before the OP. It's refreshing.\\n\\n\\n\r\nWatch this show.",
            "date": "2016-07-31T20:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 225577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4175441.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NinjaThingy",
                "username": "NinjaThingy"
            },
            "url": "https://myanimelist.net/reviews.php?id=225577"
        },
        {
            "content": "I read a review in a magazine (OtakuUSA) that sparked my interest in this series and it delivered! I was that kid who was never afraid to talk about any dirty, deviant or perverse topic, so I really related to this series. But it's about more than that. It's about how we share the basic of human existence despite our personalities and differences. The show then introduces the supporting cast that play so well with their unique personalities. The art is bright and bubbly yet simple and plain. I'm starting to really dig these short raunchy shows. I literally have no complaints about this one.It hits a home run with exactly what it's trying to deliver. Plus it's short, so you can get through it in a day or two. I say of course watch it. I eagerly await a second season.",
            "date": "2017-10-22T20:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 261463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=261463"
        },
        {
            "content": "This review probably will be hella short or just short in general so lets get into it \r\nStory: this anime story honestly is about Galko, Otako, and Ojou who talk about there body like having there period and there boobs and stuff like that honestly not much too the story\r\nArt: art is pretty good has a different style to it than most anime Ive seen\r\nSound: OP is decent but there really isn't a ED at all otherwise the sound is good.\r\nCharacter: Galko is one of the main girls she is a pretty busty woman also for her appearance one would think she a total cheapslut but she isn't she is actually pretty nice and what not. Ojou honestly nothing really too say about she basically a rich girl but also nice. Otako is last main for it and also is the one that usually starts the cameo about the different topic of there body and such and what not nothing else 2 say.\\n\\n\r\nEnjoyment: so this anime really wasn't THAT funny too me giggled a bit here and there but really this anime for was like \"sit back relax and enjoy the show\".\\n\\n\r\nOverall: giving this a 7 some people might be shocked by me giving this that kind of a rating but i did enjoy it for what it was.\\n",
            "date": "2017-05-17T22:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 247957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=247957"
        }
    ]
]