[
    [
        {
            "content": "Alongside the frequent harem and superpower shows, anime involving cute girls (generally of the loli variety) living their daily lives has become a common sight in the industry over recent years. If you have watched even one cute slice-of-life before, you already know what kind of anime Gochiusa is going to be. But that isn't necessarily a bad thing.\r\nGochiusa finds a sort of equilibrium in its plainness. It is nothing that anime veterans and newcomers will find to be anything too special, but it is not as though every anime needs to be a life-changing experience. Something that merely allows you to relax and forgetthe troubles of the real world is also an equally valid (though perhaps less important) source of entertainment... especially when it contains cute girls. \\n\\n\r\nThe set-up can be explained in just a few words: \"Girl starts working for café and makes new friends over time.\" There is no exposition, no infodump, no profound characterisation - it is simply a light-hearted story of a young group of girls living their daily lives and joking around along the way. I suppose the setting is a bit different from the norm (just how many high-school themed anime are there, anyway... ?) as it is focused almost entirely on the café itself, but it still follows the genre's trend of 'been there, done that'. That being said, if you enjoy the genre and don't mind feeling a bit of deja vu every now and then, Gochiusa can be a surprisingly pleasant experience. \\n\\n\r\nAnyone looking for a cast of cute characters to fawn and giggle over will find just what they are looking for in Gochiusa. None of them are especially fleshed-out, but that's actually OK here. Gochiusa is not concerned with climaxes and drama. It is simply comprised of a few chapters in Cocoa's and Chino's daily life. Rather than focus entirely on creating sentimental value, it instead crafts a believable (somewhat- the talking rabbit is pretty weird!) world that the audience can identify with. There are no superheroes, no end-of-the-world scenarios. And that's fine. \\n\\n\r\nThe main cast comprises of Cocoa, the ditzy sort of protagonist found in nearly every slice-of-life show; Chino, an adorable, quiet girl that will get your heart pounding on more than a few occasions; Sharo, the timid worker of the rival café (who also wears a maid uniform!); Chiya, the ojou-sama and the sole source of reason in the story; and Rize, the most beautiful girl this world has ever known. \\n\\n\r\nRize is by far the most interesting character in the story. She is somewhat of a military otaku (ミリオタ), obsessed with guns, combat and all things violence. Her father brought her up in such an environment and consequently she does not have a great understanding of how 'normal' girls behave. The moments where Rize misunderstands completely ordinary things as something military-related are often hilarious, and the moments where she reveals her tender side, desperate for human attention, are unbearably cute. Her military background makes her a type of character that has not really been seen in slice-of-life anime, so her presence is very much appreciated. I am just not quite sure whether she looks better with her usual twintails or her hair down. Either way, her cuteness is probably enough to immediately send any human being into cardiac arrest.\\n\\n\r\nThe format of the show is structured similar to Aria the Animation and its sequels. There is a subtle Italian vibe to the setting and the episodes usually succeed in putting a smile on your face by the end. There are certainly episodes that are more exciting and more boring than others, though, and the blatant fanservice during the bathhouse episode is a bit on the pandering side. For a show so innocent and so heart-warming, close-up shots of the characters' ass and titties felt quite unnecessary. It didn't need to stoop itself down to that level. It could have done without. \\n\\n\r\nAnd where was the episode focusing on Rize's father and home situation? I was waiting, waiting for it to happen and received nothing of the sort. It could have been a great source of comedy, a way to portray Rize's military obsession as something genuine rather than a simple joke. It's nothing so severe as to lower the quality of the anime, but it definitely feels like a missed opportunity. \\n\\n\r\nGochiusa impresses with its audio. Many of the tracks evoke a sort of carnival theme, while others (again similar to Aria) are simply quiet orchestral pieces existing to create a sense of peace and tranquillity. The opening theme is lively and catchy, so catchy that it is likely to stick in your head for some days afterwards. It's one of few anime that time the opening track with appropriate visuals, rather than just pan over the protagonist's face or him/her walking for half the sequence. Seriously, what's up with that?\\n\\n\r\nThe artwork on the other hand is about average. Gochiusa is not a high-budget project and it shows. It's never offensive to the eye but it is never quite pleasant either. Sometimes the anatomy can get a bit wonky or the faces static and lazily drawn, but these scenes don't occur with too much frequency. Gochiusa is usually capable of hiding its modest budget. \\n\\n\r\nGochiusa isn't the kind of show that I would hold in high regard critically, but it is what keeps me entertained with the medium during the slow times where there is nothing better to occupy myself with. With all the battle shounen and harem titles dominating each season, I would much rather relax and watch a group of cute girls sipping tea and having fun with their day-to-day lives. And therein lies the appeal of Gochiusa. It is not sophisticated entertainment, but it is fine entertainment nonetheless. \\n\\n\r\nJust do be prepared for more of the same. There isn't much to set Gochiusa apart from its contenders aside from the fact that it has Rize-chan. Actually, doesn't she make the show an easy sell... ?",
            "date": "2014-06-27T21:15:00+00:00",
            "helpful_count": 276,
            "mal_id": 149033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=149033"
        },
        {
            "content": "As you would expect, Gochuumon is a slice of life anime about cute girls doing cute things. However, the emphasis on actual humor puts it well above many others in the slice of life category.\r\nStory: N/A\r\nIt's a slice of life show, so there is no real story to speak of. Cocoa moves into the cafe that Chino's family owns during the first episode, and that's about it. Besides very small character development don't expect much more than this.\r\nArt: 9\r\nWith a show like this you have to make cute girls, and yes, they are cute. The colors of the girls pop out and the animation rarelyfalters.  Everyone is very detailed.  I actually prefer this look in this type of anime rather than the moe blob or ultra deformed types I've seen.  The outfits change often and all look nice. The backgrounds are not bad either, and the scenes change often letting you see more of the town they live in. Not much else I can say about them besides they look nice and they are obviously not in Japan.\\n\\n\r\nSound: 7\\n\r\nThe music in Gochuumon fits well with the show. While there was nothing extremely memorable a la Clannad or Bakemonogatari, it still felt pretty strongly tied to the show. While I can't think of a song now after finishing the show, I remember often getting songs stuck in my head while it aired.  The voice acting was well done and everyone fit their characters.  I don't remember a time telling myself \"Wow this voice actor is amazing and playing out this role so well!\" but I also never thought anyone was out of place.  The voices fit the characters and there's not much else to say.\\n\\n\r\nCharacters: 8\\n\r\nWhat's a good slice of life anime without good characters? Or rather, characters that are fun together?  The Gochuumon cast is a tightly knit group with everyone able to play off of others situations.  While Chino is a shy younger girl who has a hard time talking, Cocoa is older and is kind of a siscon. This plays throughout the show as she tries to get Chino to call her her older sister.  Chiya and Sharo/Syaro have been friends for a long time often have a gag with Chiya revealing something Sharo/Syaro doesn't want to be known.  Rize is the military buff of the group, but wants to be just a regular highschool girl.  She is looked up to by Sharo/Syaro which results in many funny moments.  There's many other situations throughout the show but the recurring jokes are nice as well.  There are many situations that work for the group in the show and the characters do well to turn these situations into humor.   I enjoyed the cast a lot and cannot wait to see more of them.\\n\\n\r\nEnjoyment: 8\\n\r\nGochuumon is FUNNY.  I've watched quite a few slice of life shows now to know that many are cute girls doing cute things, but very few are actually funny.  The emphasis is usually placed on being cute and having cute characters.  Gochuumon seems to have it right seeing as they rely more on comedy than cute.  Yes there are still parts there just to make you say \"aw\" and small bits of fan service, but there are also many parts that can make you laugh out loud (surprising to me for a slice of life besides Nichijou and Nichibros).  This is a step in the right direction in my opinion.  I would rather have cute girls doing funny things than cute girls doing cute things.  Many shows recently have been going for cute, like Kiniro Mosaic, but not focusing on being actually funny.  Gochuumon fulfills the comedy genre it's put under.\\n\\n\r\nOverall: 8\\n\r\nIf you want a funny show about cute girls, watch this show.  If you want a show that you can just relax to, watch this show.  If you want a straight up  comedy I would still recommend this show.  I wouldn't recommend this show to people who despise the slice of life genre.  While a comedy, it is still a slice of life show in which there is not much story or anything happening.  Some people who dislike slice of life may enjoy simply for the humor but more cute girls are probably not going to change most people's minds.\\n\\n\r\nI would highly recommend this show to most everyone.  Like I said before, the only person I wouldn't recommend to would be people who dislike slice of life.  Gochuumon is funny, cute and lovable.  \\n\\n\r\nHighly Recommended.",
            "date": "2014-08-13T07:59:00+00:00",
            "helpful_count": 71,
            "mal_id": 156429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2490323.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Xenoka",
                "username": "Xenoka"
            },
            "url": "https://myanimelist.net/reviews.php?id=156429"
        },
        {
            "content": "Gochuumon wa Usagi Desu ka isn't a particularly standout anime among the bunch of new ones coming out this year, but it deserves a little more attention. Many compare this to K-on, and it's no surprise; they both have a large number of similarities, except for the most obvious one that K-on is set in a music club at a high school while Gochuumon is set in a cafe in a small village. But the characters are very similar. Anyway, on to the review.\r\nStory: 6\r\nThere isn't really a whole lot of story in this series, as to be expected from a slice of life anime.Each episode is for the most part self-reliant, the story in each episode not connecting to the one from the previous episode; in short, there is no solid story that keeps this show going. It's rather just a show about five waitresses that work at three different cafes, and their misadventures as such. Yet Gochuumon is different from other slice of life comedy anime from start to finish. I've seen some of other recent slice of life comedy series, but honestly, they aren't that funny. Lately, this genre hasn't been received too well by anime viewers due to the decline in quality of recent slice of life shows, since they seem to be relying too much on moe over humor/quality. But Gochuumon actually provides pretty good humor and I found myself laughing in quite a few parts.\\n\\n\r\nArt: 9\\n\r\nThe art is very good. The style isn't too different from lots of moe anime, but it's well done. The colors are soft and nice to look at, and the animation quality is top-notch. I haven't detected any problems with anatomy or anything of the like, either, unless you count the fact that the teenagers in this show look like middle schoolers, but that too is common in moe style anime.\\n\\n\r\nSound: 8\\n\r\nThe opening and ending songs are very lively and appealing; aside from that the music in this series isn't anything out of this world, but it's good and helps add to the relaxed and sweet atmosphere. The voice-acting is very good; not much else to say on this subject.\\n\\n\r\nCharacter: 8\\n\r\nThe characters are for the most part your average slice of life cast, although the majority of them are developed rather well. In any case, there are some things in each character that helps them stand out from other slice of life anime characters, like Rize's obsession with guns and military combat, and Cocoa's apparent sister complex, but nothing extraordinary. There is also a talking animal companion that is normally seen on top of Chino's head, which is a fluffy little rabbit named Tippy whose real identity is, well, this could be a little spoiler for some so I won't say. This show also contains its shoujo-ai overtones; typical of this genre. It's pretty sweet, though.\\n\\n\r\nEnjoyment: 9\\n\r\nI didn't expect to like this show too much. I really only started watching it because it looked cute and I was kind of bored. But it surprised me. It proved to be a very laid-back and funny show. This anime is a very good way to relax and just laugh. I honestly thought this show had a charm that lots of slice of life anime lately have been lacking. That's just me, though.\\n\\n\r\nOverall: 8\\n\r\nThis is a very good slice of life comedy that I recommend to fans of the genre. Not much else to add. It's adorable, and has a cast of pretty good characters and great art on top of good humor and great voice-acting.",
            "date": "2014-08-01T16:51:00+00:00",
            "helpful_count": 52,
            "mal_id": 154801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3799561.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/inukagome134",
                "username": "inukagome134"
            },
            "url": "https://myanimelist.net/reviews.php?id=154801"
        },
        {
            "content": "When people think of the animal known as the rabbit, there are two common things that pop into mind. The first is luck and the second is cute. The latter usually applies to those who wants to own a rabbit as a pet or have seen them face to face. And it’s not anything unusual too for people to react with delightful grace because rabbits are fluffy, cute, and likeable. Similarly, there is the common trend of ‘cute girls doing cute things’. (CGDCT) Two common things may pop into mind for series with such concept. The first is appreciation and the second is…cute.\r\nMake no mistakethough, Gochuumon wa Usagi Desu ka? (Is The Order a Rabbit) doesn’t just have the cute girls but also has the luck factor when Cocoa Hoto wonders around town and happens upon this place called “Rabbit Café” by pure luck. Contrary to what she may believe, as in a place where people cuddle cute rabbits, it’s instead a café that serves delicious beverages. Well, there happens to be one rabbit, even though it seems to a rather peculiar one sitting on the top of the head of store owner, Chino Kafuu. It’s here where the story begins for a young girl and her new life with rabbits, err I mean…friends.\\n\\n\r\nFor most slice of life shows, there’s one configuration people should be aware of. It’s essentially devoid of plot in both arc form or linear trending. There’s no actual story that develops with its setting because it’s too simple. Take it to face value – we get a café that serves beverages and cute girls managing them. However, it should also be noticeable not to denote a show just for its lack of story because its small yet colorful cast of characters makes up the appreciation for itself. \\n\\n\r\nIndeed, the character cast is the main focus with their dynamics. Gimmicky as it sounds, most of the characters are named after beverages you would find in a café. (ie. Cocoa named after hot cocoa, Chino named after cappuccino, etc) However, the gimmicks that it establishes has a beauty with our characters in terms of conversation and interaction. In essence, none of the characters are alike or parallel in one with another. They all have different backgrounds as Cocoa herself quickly discovers as she works with them on a daily basis. Taken for granted though, Cocoa is a young girl curious about everything around her but in particular cute and cuddly things such as rabbits. While we don’t get a full scope of her character, it’s easy to tell that she is able to make friends easily with others such as the soft spoken Chino. As the owner of the store, she has responsibilities and is often strict with herself. Yet behind her snowy image, Chino is a girl who wants friends. Cocoa pushes the button to her inner desires and gives her the initiative to try out new opportunities.\\n\\n\r\nAs the show progresses, more characters are introduced with diversity. Rize, a girl with a firm background in military, has two sides to her – one that personifies herself as a soldier while the other half an innocent girl with interest in cute things. Here we have her interact with others with different backgrounds. And with a military gimmick, you can expect her to be self-disciplined. On the other hand, we have childhood friends Chiyo and Sharo with their different view on rabbits. Nonetheless, the purpose of these characters are not to influence every aspect of the ‘cute girls do cute things’ concept but to deliver its contrivance. By doing that requires gaining the attention of the audience. Especially for shows without a progressive story, it’s important to realize the connection these girls build off of one another. Thankfully, the show achieves that with the focus on each character. All of them get their spotlights during conversations whether it can seem goofy, innocent, or just lively. It can also feel surprisingly realistic on instances when the girls talk about aspects of life whether it’d be related to work, school, or friends.\\n\\n\r\nA good portion of the show also comes from the comedy. It delivers tenderness and a charming atmosphere that people can appreciate. Some of it comes from the girls’ personalities. Other parts delivers with the conversations that uses all sort of motifs, casualness, and inspiring dialogues of imaginativeness. This can come as forceful on occasions yet can be surprisingly memorable because the show’s gimmicks. But at the same time, this can come as a mixed bag for some fans. Not everyone will appreciate this show’s gimmicks nor its humor. It can feel stale, repetitive, and even cliché at various times. Some jokes also can feel hypocritical and deny logic such as Rize’s ownership of firearms at someone her age or a talking rabbit. There’s also a bit of hidden yuri tropes behind the show for those who pay attention to its ever glimmering character cast. Objective discontent also pops off on occasions such as the first episode of Rize in her underwear or unconventional fantasies courtesy of a young girls’ mind.\\n\\n\r\nWhile the story itself doesn’t hold together with progressive moment, every episode does offer something new and even on occasions a different setting such as at school. This opens up doors for other characters to enter the story such as Chino’s classmates. The more noticeable part is that the show opens up feelings of human emotions whether it’d be jealousy, regret, fear, and even sparks of puppy love between the characters. Just don’t take it too seriously as this show is more about a fun package that should be opened up with appreciation rather than for deep value.\\n\\n\r\nThe artwork is generic to say the least but every character has a distinctive design with their backgrounds. Their personalities match well when it comes to these designs and gags referencing the nature of the characters. And as waitresses at a café, expect the girls to dress decoratively when at work. Their uniforms aren’t just charming but also fits the overall theme of a café such as Chino’s hat or Chiya’s maid-like dress up. The way the show also depicts its gestures with body languages is also solid to show itself colors. However, Tippy (the rabbit and mascot) can be a bit blend and strange. Take notice of his behavior as he may seem cute but acts nothing like an actual rabbit. \\n\\n\r\nWhile the soundtrack isn’t anything explicit for its background OST, one should take more notice of its voice cast. Care is taken when the characters speaks to match consistency with their personas. In particular, I give exceptional praise to Risa Taneda for her role as Rize. She can play her character very well that shifts her mannerisms from those of a self-disciplined waitress to an innocent girl in love with cute things. But to be honest, all the characters’ voice mannerisms are delivered well when it comes to their roles in conversations and ability to draw a viewer in with their expressive responsiveness. And while not as strong as the voice acting, the OP and ED songs shines with charm in the way I expected.\\n\\n\r\nWith all said and done, this show is a healing series that should be at least considered. Even if you’ve never stepped into a café in your life or is unfamiliar with the CGDCT concept, it can still offer something to anyone. 12 episodes. That’s all it takes to convey the message of the Rabbit Café and its characters. Despite some contestable humor and lack of a strong story development, it makes it up with the strength of its characters. Gochuumon wa Usagi Desu ka serves as an example of a slice of life show that is charming to the core and deliciously entrancing. \\n",
            "date": "2014-06-26T20:28:00+00:00",
            "helpful_count": 46,
            "mal_id": 148865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=148865"
        },
        {
            "content": "I lost hope. This anime has ended. ;~;\r\nThere is always an anime showing \"cute girls doing cute things\" every scene. I can never stop loving them, because they are always nice to watch. They are your perfect healers.\r\nSo, do you like lolis in your cafe?\r\nGochuumon wa Usagi desu ka? (or Gochiusa) revolves around five cute girls working on their own shifts in their respective workplace, all of them being cafes. The main character, Cocoa, starts her high-school life in a German-like town. Arriving at the \"Rabbit House\" cafe hoping to see rabbits in the cafe, she finds out that she will be working in thatcafe with a soft-spoken girl Chino, and staying as accomodation as well.\\n\\n\r\nFrom there, she meets the rest of the main cast - Rize, Chiya and Sharo, and other girls. The whole story is simple - cute girl doing cute things. But from an area that doesn't look like a typical Japanese urban, the story is tweaked to fit in its culture. The whole atmosphere is so light and fluffy.\\n\\n\r\nThe pacing is similar to some of the \"slice of life\"s - fast and nice. I like the comedy between the characters. There's a bit of yuri subtext and it's honestly cute.\\n\\n\r\nThe characters are extremely likable because of the moe factor, and they have different personalities. I feel that they match to their appearences as well. Some of the personalities are similar to what you see in the past few \"slice of life\"s, but it doesn't matter anyway.\\n\\n\r\nThere is good character development in some of the characters, the most notably be Chino.\\n\\n\r\nOne of the things I'm attracted to this anime is the character design, which gives off those loli bodies. I'm not a lolicon, but they are very cute. There is some fan-service but that didn't ruin the anime at all. I love the facial expressions made by the characters, whether for comedy or not. The scenery drawn in the anime are very spectacular. The objects shown are nicely drawn too. The visuals for the opening are awesome and the episode card titles are interesting to look at.\\n\r\nThe opening has to be one of the best openings I have listened to in this Spring season. Some parts are catchy while the rest are nice to get the groove on. It is sang by the voice actors vocing the main cast - and they sang wonderfully. The ending, sang by the voice actors of Chino and her two best friends, is nice and smooth. The background music is nice to hear and they somewhat match the culture in the anime's setting - being European-like. The voice acting is too cute, and the voice actors did a good job matching the personalities of their respective characters.\\n\\n\r\nGochiusa may have been an awesome slice of life to watch, but it can be easily compared to Kirino Mosaic (aired on Summer 2013) and Non Non Biyori (aired on Fall 2013). All three have some similarities, such as Rize and Aya - voiced by the same voice actor. Since the two anime I mentioned have their second seasons announced, will Gochiusa have another season?\\n\r\nHonestly, I definitely agree. This anime is too much. I enjoyed the heck out of it. I love the fun the characters are having. This anime leaves a warm feeling to me and I love it.\\n\\n\r\nChiya best girl.",
            "date": "2014-06-26T15:32:00+00:00",
            "helpful_count": 20,
            "mal_id": 148809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440083.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SkyNoHoshi",
                "username": "SkyNoHoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=148809"
        },
        {
            "content": "Is the Order a Rabbit?(Gochūmon wa Usagi Desu ka?), Aired in Japan between April and June 2014, Created by White Fox, is a Slice of life Comedy anime about a girl called Cocoa Hoto, who moves to a new town to attend her new school. She living in town with Chino Kafū at her family's Rabbit House Café, working as a waitress to be able to pay for her accommodation. And the start of the story but because how is anime is written i not say anymore on it, but can say that the story is well written and has quite a charm to it.\\n\r\nNow on to the 5 main characters themselves, Cocoa Hoto (Voiced by Ayane Sakura), a girl starting middle school and works as a waitress part time. She has a thing for cute things like rabbits, she looks at Chino as her little sister she never had and while she may not have many skills, she really skilled at baking bread. Next is Chino Kafū (Voiced by Inori Minase) is a girl in her last year of lower school and works as a waitress at her Family's Cafe in the daytime when she's not at school. While she is a quiet and soft spoken, she starts to warms up to Cocoa, but get annoyed alot when Cocoa ask her to call her big sister. Also she and father knows about the secret about Tippy, her rabbit and the Rabbit House mascot, and her grandfather. Next is Rize Tedeza (Voiced by Risa Taneda) is a girl that is one of the waitresses at the Rabbit House, is oldest girl of the group, goes to a different school than Cocoa, a school for the elite and to me looks like Azusa Nakano from K-on! just older. Being she the daughter of a soldier, she has a very disciplined, military-like but she also very kind. She carries a Glock and a combat knife on her for self-defense, has a very strong feminine side that she hides, she cares alot for her appearance and is close to Sharo. Next is Chiya Ujinatsu (Voiced by Satomi Satō) is a girl the same class as Cocoa and runs her family coffee shop called, Ama Usa An. She loves making Japanese Sweets and naming them, but because of what she names them most people don't know what they are. She owns a rabbit called Anko, who is her shop's mascot and childhood friend to Sharo. Lastly is Sharo Kirima (Voiced by Maaya Uchida), is a girl the same age as Cocoa but goes to same school as Rize as a scholarship student as she is poor and works at a different cafe as a waitress to earn money. She lives next door to Chiya and has a fear of rabbits thanks to Anko. She gets very hyper after drinking coffee, her emotions while hyper differ depending on the type of blend and has feelings for Rize.\\n\r\nNow the main characters are out the way and i will say my opinions on them later, next is presentation. Is The Order Is Rabbit is shown in cell-shaded graphics similar to K-ON!, the characters are very colorful with bright colors, the scenery looks very lively and realistic and overall very well made. The cut-in backgrounds that appears looks very creative and fit what the character at the time is talking about. The characters on screen move very good and have very good body language and facial expressions that fits quite well. The voice acting is great, every voice fits it character's personalty and are spoken very clearly. The music in the anime is great and the opening song and both ending songs are very catchy. The music is used to help fit the mood on screen and changes very smoothly depending on what a character says or do. Lastly the topics used in the anime are very well done as they don't feel out of place and interesting. \\n\r\nNow to the my thoughts about the anime. Is The Order a Rabbit? is a very created animes, one of the best Slice of life animes i ever watch as it keeps you interested by not staying one subject for too long and the conversations between the characters are very entertaining. The anime looks great as it has the look of alot of hard work has been put in and it shows very well as it looks beautifully. The characters themselves i like alot as they look great and their personalizes are very interesting specially Rize, as i like her the most as very older sister like to the others and have a nice side (Also i really like her hair). Overall i recommend this is to anyone and is very family friendly as at can be enjoyed by all because of how the character act and the topics that are used are not inappropriate for young audiences but entertaining for all. \\n\r\nWith that said, I say that Is The Order a Rabbit? is a must watch and is very enjoyable by all ages. If you like things based on real life or watch and like other slice of life animes, then this is for you.",
            "date": "2015-04-13T01:57:00+00:00",
            "helpful_count": 19,
            "mal_id": 185515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4557188.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Seto_Masamune",
                "username": "Seto_Masamune"
            },
            "url": "https://myanimelist.net/reviews.php?id=185515"
        },
        {
            "content": "Okay, before you read on , please note this is my first review, and I am kind of new to Anime. (I have watched it in the past, but you get the idea). Anyways, on to my review:\r\nTo start off, this show is different than other shows I have seen (even though the Slice O' Life section of Anime is huge), so if you have seen those kinds of shows, this might be familiar. If you're looking for an action show where there is always fighting and such, this probably is not the show for you. \r\nFor me the show was fantastic. Loved the charactersand how they interacted with each other in their daily lives. In fact, that's my favorite part of the series. The characters looked pretty similar, however each still has distinct taste, personality, and interaction. What's neat about this show is how it affects you. For me it was something to watch before bed and in the morning. It kind of \"relaxed\" me, if you will. Something about their daily life really made me enjoy the show.\\n\\n\r\nWhile the characters are cute and are meant to be cute, the show actually does not push it in your face, if you catch what I am saying. The characters are respected in a lot of ways. I'm not one for how a character looks, but how they act and are treated, and these characters were down right hilarious and nice to each other, and that's what counts. (They all also had distinct physical features as well, for example, Chino Chan has Tippy on her head, etc).\\n\\n\r\nTo conclude this review, I would like to recommend this show to anyone looking for a break from all the fighting and drama, and just sit down and watch a show like this. Personally, it's one of my favorite shows (In fact, I didn't want it to end) and I think anyone should watch it, or at least try it out. \\n\\n\r\nThanks,\\n\\n\r\n~Kyle",
            "date": "2015-01-12T07:04:00+00:00",
            "helpful_count": 17,
            "mal_id": 177529,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4342063.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/3TH3R3AL-3V3",
                "username": "3TH3R3AL-3V3"
            },
            "url": "https://myanimelist.net/reviews.php?id=177529"
        },
        {
            "content": "This is going to be an informal review about my general thoughts and opinions on this anime, which may involve VERY MINOR SPOILERS.\r\nStory: \r\nIt's a slice of life moe anime revolving around cute lolis working at a cafe. What kind of plot or story line do you expect from this? Whatever \"story\" it does have is done fairly well though, so that's why I give this a 6. The main draw of this anime obviously isn't its plot.\r\n6/10\r\nArt: \r\nPretty nice and vivid, shiny colors that attracted my attention throughout. Good art style in my opinion. Very appealing.\r\n9/10\r\nSound: \r\nReally liked the background music, the opening music,the ending music; just all of the music was really cutesy and fit the tone of the anime quite well. Very enjoyable and relaxing.\\n\r\n9/10\\n\\n\r\nCharacter: \\n\r\nThis is where the anime shines; moe lolis doing cute things while working at a cafe. What's not to like about the characters? Each character has their own personality and their personalities work very well together. The development between the characters is very good as well, as they get acquainted with each other and gradually build upon their friendships, getting closer and closer. Especially Chino and Cocoa. Would have liked some more Rize x Sharo, though. \\n\r\n*VERY MINOR SPOILER* I'm still not so sure on how Chino's grandfather turned into Tippy though, and whether or not Tippy and Chino's grandpa share the same body, or if he just took over the body for himself. Also, it hints in one episode that Cocoa might have an older sister, but it only hinted at that for about 5 seconds during episode 10 or so, so I'm not really sure *END OF VERY MINOR SPOILER*.\\n\r\n10/10\\n\\n\r\nEnjoyment:\\n\r\nNo matter how crappy my day was, or what mood I was in, I always looked forward to watching an episode of Gochuumon was Usagi Desu Ka?. Every episode put a smile on my face and just made me \"aww\" at the cuteness of every second. Very very enjoyable for anyone that likes cute things, and even if you're the manliest man of all men ever created, you'll still probably bubble over with cute feelings after watching one episode.\\n\r\n10/10\\n\\n\r\nOverall:\\n\r\nIf you're just looking for a laid back cute anime to watch and have fun with, and aren't expecting any sort of \"real\" plot, then this is the anime for you. Don't go into this expecting serious conflicts or plot twists, or anything of that bunch, because you won't be getting any of that. If you just turn off your brain, watch and listen, your frown will be turned upside down. Very happy-go-lucky and very enjoyable.\\n\r\n10/10\\n",
            "date": "2014-07-04T19:42:00+00:00",
            "helpful_count": 16,
            "mal_id": 150381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3653271.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Taisho-san",
                "username": "Taisho-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=150381"
        },
        {
            "content": "Gochuumon is a show I first picked up on off of some crossover art with Sora no Method, which in retrospect might have been a missed red flag given how that series has played out. But after a few episodes, reams of fanart of the most adorable and youngest of the main characters, and with its banging OP theme implanted firmly in my music line-up, I was hooked. \r\nUnfortunately, this turned out to be a case of jumping the gun. The more I watched, the more I realized that the initial flash that had pulled me in was just that - frontloading the series withcatchy content to give the appearance of a better show. Lots of shows do this, but the 'slump' in this case was half the series, and by the time it felt like it had found its stride there was a handful of episodes left. The high-energy theme belies a show that's happy to meander through 12 episodes not doing much of anything, rarely very funny and rarely very cute but enough of each that you probably won't drop it.\\n\\n\r\nIt's not a bad show, and it certainly has its moments - Chino, the daughter of the owner of the Rabbit House cafe, is great as the eternally nonplussed companion to the endearingly scatterbrained Cocoa. Their sparring relationship as 'sisters' is one of the better dynamics in the show, and is perhaps the 'story' of Gochuumon in a similar way to how Nano and Mio coming to terms with who they are are the 'stories' of Nichijou. The atmosphere, too, is - to risk a metaphor - comforting like the scent of coffee wafting through Rabbit House must be. Between the gentle pianica of the ost and the many shots of characters strolling cobblestone streets, you get a sense of the sleepy European town they apparently set this in (albeit one where characters eat cake on Christmas).\\n\\n\r\nUnfortunately, both the story and the atmosphere get crowded out by so-so humor, extremely iffy art, and a cast that is far too large for its own good. The humor is played more for cuteness than for actually being funny, resulting in lots of mediocre jokes told poorly. Most of the side characters are made up of a few jokes played on repeat - the infatuated kohei, the spacey, awkward writer, the other sort of spacey and uncomfortably invasive mothering girl - though they manage to massage Rize's tsundere role over the course of the series.\\n\\n\r\nThis is a show that seems destined to be forgotten among the hoards of moe filler, occasionally recalled for its odd title, great theme, and a few characters that will perhaps live beyond the series itself. Perhaps the few interesting moments I mentioned make it worth watching - perhaps it's also worth mentioning that there's a decent amount of fanservice which, while often crass and silly, isn't unwelcome if you're partial to the characters - but in the end there are plenty of other shows that have all the ingredients that Gochuumon has and managed to do it better.",
            "date": "2014-12-15T20:39:00+00:00",
            "helpful_count": 15,
            "mal_id": 172481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695623.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cuteisanarchy",
                "username": "cuteisanarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=172481"
        },
        {
            "content": "For anyone that does not seek a cliche or a proper plot, then this is an anime for you.  Great for loli-cons and people who loves art work from anime.  \r\nThere is no real story or plot behind this anime, but a series of scenes of slice of live situations.  A wonderful anime for your \"break\" from another anime.  This has brought me laughter and joy.  Whenever I think about this, it just sparks me and longs for more.  Not much over-used comedic effects to get cheap laughs from the audience.\r\nThe art is simply splendid.  I guarantee thisis one of the best drawn anime ever.  If you disagree, tell me.  They really maximized the use of the moe effect; from the detailed hair style of Rize to the cute bow that Cocoa wears, to Tippy on Chino's head to Chiya's gleeful smile to Syaro's uniform.  The background is jaw-dropping magnificent.  The medieval style of the buildings is a nice touch and different from your usual Japanese buildings from shows like Initial D etc.  \\n\\n\r\n The real captivating feature about this show are the characters and their personality.  It's what they are that makes the soul of this show.  Without it would be like Fairy Tail without the Fantasy.  In other words, you watch it for the sake of the characters.  There must be one that you like, the apathetic(ish) Chino, the bubbly Cocoa, the prideful Syaro, the ditzy Chiya and the solider-like Rize.   If not, you're going to waste your time.\\n\\n\r\nSoundtrack is alright.  Personally, I listen to a lot of soundtracks, but I've no compliments nor praises for it.  However, the ending is something I always loom forward to after finishing an episode.  It sounds so happy and bouncy.  I will actually rewind and go  back a minute and listen again.  \\n\\n\r\nIt's a really good anime for people who doesn't like a long series, good sit-com like laughs, and who are innocent (No H yay  :D).  \\n\\n\r\nTo sum up, great art, good laughs, nice music, brilliant character and personality.",
            "date": "2014-07-01T13:36:00+00:00",
            "helpful_count": 13,
            "mal_id": 149821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3806395.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Conor_Styles",
                "username": "Conor_Styles"
            },
            "url": "https://myanimelist.net/reviews.php?id=149821"
        },
        {
            "content": "Gochuumon wa Usagi Desu ka? Was a series of 4-panel manga written by Koi and published in Manga Time Kirara Max. From April to June of last year, it got a twelve episode anime adaptation from White Fox Studio. You may remember them from their work on Jormungand, Steins;Gate and their one fail that I've seen, Katanagatari. How does this one hold up? Let's find out. This is GochiUsa.\r\nStory:\r\nOur tale begins with our main character, Cocoa (she's Cocoa but she's not quite loco), moving to a new area. There's just one problem, she can't find the family she's supposed to be staying with. She stopsat a cafe called Rabbit House to ask for directions where she meets young Chino. Luckily for her, Rabbit House turns out to be the place she was looking for. What a fortunate coincidence. While working part time in exchange for room and board, Cocoa meets several other girls, Rize, Chiya and Sharo. Rize works at Rabbit house with her and Chino while Chiya and Sharo work for two other cafes. Various hijinks ensue since this is a comedic work and the story is minimal.\\n\\n\r\nWith that in mind, let's talk about the comedy. GochiUsa has a style of humour that's a lot like K-on's. You've got a cutesy and zany group of girls working their hardest at tasks related to a specific thing and the humour is largely derived from their interactions with one another and their various quirks. The big differences are that they usually aren't working together in this and they introduce some really bizarre supernatural elements. The series does somewhat take advantage of the comedic possibilities presented by them working for competing businesses, although it really doesn't do a lot with it, preferring to keep their relationships cutesy and amicable while downplaying any conflicts that may have been brought up. It also makes some jokes about the supernatural elements, but they're easily the weakest part of the series. Honestly, a lot of it is just repeating the same ventriloquism joke with slight variations. I will say, to the series' credit, most of the humour does work really well. I will also give GochiUsa credit for having some really well done cute moments throughout the series.\\n\\n\r\nCharacters:\\n\\n\r\nThe characters are pretty simple. In all fairness, they are a bit better developed than a lot of slice of life comedic casts and they do have a good mix of characters who can play off of each other really well. I will also give the series a lot of credit for having a lot of really strong character interactions that extend beyond just comedic bits. There are some strong touching and heartfelt moments.\\n\\n\r\nArt:\\n\\n\r\nThere are some real positive aspects to the art. The backgrounds are nicely detailed and the animation really flows well. The series is also really good at drawing rabbits, when they don't get lazy with it. The character designs are kind of standard too. They don't look bad by any means, they just aren't anything special.\\n\\n\r\nSound:\\n\\n\r\nThe vocal cast does well. Sakura Ayane, Minase Inori, Uchida Maaya, Taneda Risa & Sato Satomi all give fine performances. It is a little strange hearing Hayami Show play a perfectly nice, normal guy when I usually hear him voice complete villains like Tenzen, Aizen, Zarbon and Muraki. Don't get me wrong, he's good in this, but it is a little weird. I like the music too, it really suits the series.\\n\\n\r\nHo-yay:\\n\\n\r\nThere's certainly some les-yay. Sharo has a crush on Rize, and that's actually stated in the series itself. There are also two different pairs of girls who can communicate psychically with each other, I'm guessing by the same mechanism that allows Akari and Kris to speak with each other while competing in the semi-finals during Battle Athletes. Cocoa is also really intent on having Chino call her “sister.” It would be suspect even without a younger girl referring to an older girl as “sister” being a fairly common shoujo-ai trope. Don't ask me why it's common, I don't really understand it either. The ho-yay factor is going to be a 6/10.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nGochiUsa is a funny, entertaining, cutesy and really endearing series. It's not a complex series, nor is it the most original series out there, but If you want something light and fluffy for a quick laugh, it would be a really good choice since most of the jokes do work well and it has some really good character interactions. For myself, I give it an 8/10. It knows what it is and it does it really well, although not perfectly. Next week I'll look at the second series of Natsu no Arashi.",
            "date": "2015-02-18T11:05:00+00:00",
            "helpful_count": 12,
            "mal_id": 180719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=180719"
        },
        {
            "content": "This anime was very adorable to watch. All the characters had a really good back story, especially Chino. I give this anime an outstanding score because it was very enjoyable to watch and I recognized two voice actresses from another anime that i previously watched. I also give the character development as a 10 because Chino had a really great back story about her grandpa (currently the rabbit Tippy) and it was all a mystery until episode 10 or 11 (or some of the mystery about chino's grandpa we found out about). The sound I also, as always I'd give a 10 because the voiceactors were very well chosen for this anime. The enjoyment of this anime was very well because Cocoa is the funniest character in this anime (out of the other characters). I'm hoping that this anime will have another season because I really enjoyed it. The music in this anime was very cute and catchy, a lot of beautiful music filled the anime with more enjoyment. I'm hoping that i'll hear these voice actors once again (in a different anime) soon :).",
            "date": "2014-06-30T15:16:00+00:00",
            "helpful_count": 12,
            "mal_id": 149649,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3235803.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shinseul",
                "username": "shinseul"
            },
            "url": "https://myanimelist.net/reviews.php?id=149649"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nNature contains two distinct branches, if you will: flora and fauna. Or for those that prefer the basic terms, plants and animals. Disregarding all of the former gives us a wide range of creatures that roam the Earth. The ferocious rhinos of Africa, the black-and-white pandas of Asia, and the slithering snakes of Australia, to name a few. These examples are more exotic; that is, some animals are a bit more domestic. The most popular among them being dogs and cats. However, there exists one rather cute species that has garnered much attention throughout the years. And ifthe title doesn't make it apparent, this animal is, of course, the bunny rabbit. In Is the Order a Rabbit?, while the coffee and cute girls take the spotlight, there are still bunnies aplenty.\\n\\n\r\nSTORY\\n\\n\r\nRabbit follows a young girl named Cocoa, who, upon moving to some Western town, houses with another young girl named Chino. Along the way, they make friends with Rize, Chiya, and Sharo, and their exploits are shown throughout.\\n\\n\r\nAt its core, Rabbit is nothing more than a cute girl show. From beginning to end, it isn't looking to elicit emotions from the audience other than those of happiness and joy. Drama is irrelevant, development of the characters is nonexistent, and it is thematically lacking any kind of outlook on society or life as we know it. And that's perfectly fine. Not every anime has to cause us to question our self or provide a thought-provoking message. No, what Rabbit relies on is execution.\\n\\n\r\nFor the genre it places itself in, \"cute girls doing cute things,\" it performs very well. The majority of this is due in part to the characters themselves. They seem trope-y -- and to an extent, they are -- but their personalities and interactions are distinct and varied enough to make the entire experience completely fun from start to finish. Cocoa's \"big sister\" shtick, Sharo's inability to compose herself around Rize, and Chiya's sweet-naming powers remain consistent both in quality and quantity, providing the viewer with never-ending cuteness.\\n\\n\r\nWhere Rabbit missteps is in the presentation of the comedy. It's a mixed-bag, to say the least. On the one hand, the show is capable of utilizing its setting and situations to great effect, giving the laughs and adorableness needed for the moment. When it's focusing on the girls working in the coffee or tea shops, or playing up their character quirks, it's fine. On the other hand, though, a lot of the jokes either happen way too quickly or come from out of nowhere. Aoyama suddenly liking looking at girls or the lot of them practicing sports is good fun, but feels out of place within the context of the show.\\n\\n\r\nOne interesting aspect of the anime is the title. The line, \"Is the order a rabbit?\" is only uttered once, and in a flashback no less. From a literal standpoint, it doesn't make much sense. Who \"orders\" a rabbit from anywhere other than at a high-class restaurant? In other words, how does it relate at all to the show? The key word here is \"order.\" It's not a request for food but rather a question about the composition of the show itself. Rabbits are cute, fluffy, small, precious, and harmless. The anime is definitely cute, the girls being a testament to that; it's \"fluffy\" in the lighthearted subjects; the series is contained and doesn't try to be anything more than it presents; it's difficult to mistreat the show; and it certainly isn't out to offend anyone. In this way, one can see the show as a \"rabbit,\" just without the physical (and alive) form. My analytical glasses are straining here, but the comparison of the anime to its presupposed rabbits is definitely interesting.\\n\\n\r\nANIMATION\\n\\n\r\nIs the Order a Rabbit? actually performs nicely in the art and animation department.\\n\\n\r\nTaking place in a Western village, much of the locations are depicted as such. Narrow streets, classic European houses, and bridges spanning canals permeate the show. It gives it a nice sense of \"uniqueness\" even if the girls are speaking Japanese. At the same time, the show does incorporate nice lighting effects and more serene environments besides the \"Rabbit House.\" Places such as the park or the bath-house aren't particularly enticing, but do help to spice up the formula. To help the hilarity, the show also incorporates more minimalist caricatures -- deadpan eyes, faces, and \"chibi\" bodies.\\n\\n\r\nThe character designs follow the simple pattern of \"varied hair and eye colors\" for the most part. This simplicity isn't terrible, as none of the characters are poorly drawn or animated. They are all rather small in stature, giving them a -- perhaps unneeded -- boost to cuteness.\\n\\n\r\nActual animation is often average to above average. It mostly depends on the type of art they are exhibiting at the time. If it is \"modern,\" hair flows, expressions change, and eyes glisten and wander. If it is \"minimalist,\" the characters are usually refrained from moving much to (again) enhance the comedy.\\n\\n\r\nCHARACTERS\\n\\n\r\nThere are five main characters within Rabbit: Cocoa, Chino, Rize, Chiya, and Sharo. This is the order in which they are introduced, but let's go through them by personal preference.\\n\\n\r\nAs the youngest of the group, Chino is often treated as a child. Her emotionless way of speaking and frequent need to have Tippy placed on her head does make her out to be such a person. However, more often than not, she is the most serious and mature of the ladies. Towards the beginning of Rabbit, she is rather distant, refusing to take part in the silliness that Cocoa offers. However, Chino's time with her and the other girls allows her to break out of her self-induced shell, giving her the connections and friends that she always longed to have.\\n\\n\r\nCocoa is as strange as the name she harbors. Her affable personality and \"sisterly\" ways paint her as fun-loving and sibling-wanting. She contains a certain obsessiveness for cuddling anything -- especially Chino and bunnies -- and is rather dense when it comes to understanding the situation. Where she lacks in intelligence she makes up for in happiness, being the type of person who doesn't conform to the environment around her. Instead, while she may get sidetracked or she may cause everyone more trouble than is necessary, she enjoys being the jubilant young girl she's always been.\\n\\n\r\nSharo has an affinity for two things: glassware and Rize. Her abnormal fear of rabbits and misunderstood financial status make her \"stick out\" from the crew. She's refined and ladylike, yet finds herself going with the flow when everything goes down. This is mostly due to her major insecurities, a problem she is usually forced to deal with. Sharo, more so than any of the other cast members, values the people around her, looking to fit in rather than be ostracized due to some misplaced thinking. And over the course of the season, she is given these opportunities to find her place. While it starts somewhat rough, she eventually discovers that it isn't about where you come from that truly matters; what matters most are the feelings you share with those around you.\\n\\n\r\nThe best way to describe Chiya would be to call her a \"mother.\" Doting on Cocoa, Sharo, Rize, and Chino, Chiya is simultaneously very aware and very carefree. She takes pride in coming up with clever names for the sweets she sells, but much like Cocoa, she tends to cause quite a few problems for those around her. In this way, she and Cocoa are \"two peas in a pod.\" Where they differ, though, is in their conversational positions. That is, Cocoa is a \"talker\" whereas Chiya is a \"listener.\" She's willing to sit down and hear out others, owing further to her parental nature.\\n\\n\r\nRize is pretty, but undervalues her own womanly aura. With a deep love for the military, she is often seen equipped with a gun or making coffee cream art in the shapes of tanks and jets. Oddly, compliments go straight to her head; she is generally cool-headed except when it comes to her looks or beauty. Being the oldest, she takes on a leadership role, guiding the girls both at work and in life. For her, she always felt as if she was being left out. And again, a comparison is made, but this time to Sharo. Sharo's perceived loneliness was due to her unwillingness to express herself properly. Rize, however, believed that her behavior was pushing everyone away. Luckily, she finds that her friends are more than willing to accept her for who she is, knives or snipers otherwise.\\n\\n\r\nEach of the characters is quite likable, with no one being particularly grating or underwhelming. They're given an appropriate amount of time to be characterized and to give their own flavor to the comedy. At the same time, there's a particular connection that exists between many of them. The show explores the idea that, even if one feels helpless, there is somebody out there who cares. This is demonstrated constantly throughout the anime: Chiya consoling Sharo in the library, Cocoa looking after Chino as a \"big sister,\" Rize acting as a role model for Chino's friends Megu and Maya, etc. Their aid for one another is what provides the show with the calming and mellow feel that it has. Nobody ever feels in danger, everyone is happy, and it is almost always \"sunshine and rainbows.\" And it's designed this way not because of the individual characters, but because their relationships allow such fun to blossom, to run as free as a wild bunny.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is fine for what it is. The differing vocalists create a cute arrangement, even if the beat is rather boring. It's fun and fleeting, and fits the anime nicely enough.\\n\\n\r\nAs for the ED, it's harder to pinpoint. Once again, the highlight comes from the varying vocals, and not for the instruments themselves. The guitar and clapping are cute, and the three-step lyrics can often be catchy. And while it ends on resounding trumpets, it just isn't that memorable of a song.\\n\\n\r\nThe soundtrack, though, is rather nice. Owing to the setting and atmosphere, it generates many storybook-like tunes. Whimsical harps, dainty piano playing, and funny flutes give Rabbit a fantasy-esque feeling despite the normalcy of the scenarios themselves.\\n\\n\r\nVoice acting sees above average performances for everyone involved. Shout-outs go to Maaya Uchida as Sharo, Ayane Sakura as Cocoa, and Inori Minase as Chino.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one requires the viewer to care about cuteness, more so than other anime, because it solely relies on it. Besides its execution being there, I found myself enjoying pretty much the entire cast. Cocoa as the lead actually didn't deteriorate her laughs; she was usually the one to make me smile. My favorites were Rize and Chiya -- Rize for her blushing and Chiya for her calmness -- but I also greatly liked one of the side characters, Aoyama. Her inclusion is kind of strange, but her lax way of going about her business wasn't so much funny as it was a way to buffer the quite rambunctious girls. She is quite attractive, too.\\n\\n\r\nI find myself wishing that the show would have done a bit more explanation in regards to Tippy, and some of the relationships, most dealing with Chino, weren't as fleshed out as some of the others. This will most likely come with later iterations in the series (if they come to be), but as an example it would have been nice to see Chino and Sharo interact more with each other over the course of the show. Also, while Aoyama was given a small chance to shine, I would have liked to have seen her sooner and more often.\\n\\n\r\nIs the Order a Rabbit? pours out adorableness like a pot pours out coffee: swiftly and in large measure. Combined with the nice art style and lovable cast, the anime should be able to bring a beaming smile to anyone's face.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, nice execution, though lacking comedic guidance and anything else\\n\\n\r\nAnimation: Good, great art style, okay character designs, good actual animation\\n\\n\r\nCharacters: Good, Cocoa, Chino, Rize, Chiya, and Sharo are each both cute and helpful\\n\\n\r\nSound: Fine, okay OP, okay ED, good soundtrack, good VA work\\n\\n\r\nEnjoyment: Good, funny and charming but needs more Aoyama\\n\\n\r\nFinal Score: 6/10",
            "date": "2015-01-21T20:56:00+00:00",
            "helpful_count": 11,
            "mal_id": 178721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=178721"
        },
        {
            "content": "Story: I give this 7/10. Obviously there is no story at all and only just a SoL but the comedy I think is better than usual SoL. It doesn't rely on tired tropes. \r\nArt: Nice and comforting. I liked it very much. Therefore I give it 10/10. I like the change in background scene, not just typical Japanese school setting. This providing a good refresh. \r\nSound: The only thing I can say about the sound is the Season 2 Ending: Tokimeki Poporon. YouTube it, you will get diabetes. Other than that, the soundtrack is not distracting but not always the most memorable.\r\nCharacter is 9/10 becauseI thought they were quite funny character.\\n\\n\r\nEnjoyable SoL for those who want SoL. For the other persons who want more plot, do look elsewhere.",
            "date": "2018-05-24T14:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 281313,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7101956.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xmr2000",
                "username": "xmr2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=281313"
        },
        {
            "content": "First of all this is my first review, I never expected to make one in the first place so I struggled a lot with the redaction.\r\nStory: There is not much to say about the story in a “cute girls doing cute things” (CGDCT) anime. \r\nIt is first introduced with Kokoa who gets lost while looking for the place where she was going to live so she decides to stop by a cafeteria with the coincidence that it was also the place where she was going to live and work part-time, there she meets Chino and Rize, later she would meet Chiya and Sharo whoworked at different cafeterias. It is also worth mentioning that the girls assist to different schools so the show develops in a labor environment or just the girls hanging out after work and not in a school environment like most (if not all) CGDTs.\\n\\n\r\nNow to the actual review:\\n\r\nThe CGDCT anime usually aim for 3 things: the cuteness, the comedy and the heart-warming side but these shows usually fail a bit at the latter, they are so focused on comedy that when they try to be heart-warming in my opinion they tend to become a little boring, they struggle a lot to balance this. However, GochiUsa has a good balance, and this is because it EXCELS at being heart-warming, the comedy is a bit sacrificed but this doesn’t mean the comedy is bad, the comedy is actually good but as I said GochiUsa is very well balanced and it has a bit of character development (though this applies mostly for Chino). \\n\\n\r\nThe animation and art were both amazing, nice to look at and well... extremely cute, the music was also pretty good. Though the background music wasn’t particularly memorable it was good enough to portray this feeling of heart-warmth I mentioned above. \\n\r\nWhat was really memorable was the voice acting, all seiyuus performed their roles very well and were all fitting to their characters. This is especially noticeable with Inori Minase's role as Chino.\\n\r\nJust don't expect much of it during its first episodes as it is until the 4th or 5th episode when it gets better.\\n\\n\r\nIn conclusion, though GochiUsa doesn’t break any grounds at all it feels like a different take on the CGDCT genre and very refreshing to watch. \\n\r\nOverall 8.5/10 \\n",
            "date": "2015-10-18T20:40:00+00:00",
            "helpful_count": 10,
            "mal_id": 201540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4559761.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fruits_punch95",
                "username": "fruits_punch95"
            },
            "url": "https://myanimelist.net/reviews.php?id=201540"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 8\r\nCathartic in nature, GochiUsa is a heartwarmer that has its roots in providing contentment—similar to the relaxation one can feel from sipping freshly-brewed coffee. With an ample amount of lovable charms and a cuteness as cute as the twitches of a bunny's nose, it's the ideal to show to hearten oneself. I mean, just look at my smiling face!\r\nBut let's be clear first. The show doesn't have the most imaginative story as it follows pretty much all the things other CGDCTs have. Instead, it's in its setting—a town with European resemblances—that gives GochiUsa a specialkind of appeal. Elegant, idyllic, and traditional, the town's architectures are adorned by timbered buildings and cobbled streets, making it a breath of a fresh air away from the usual high school setting. Really, it's the perfect environment to have some joviality. Like an \"on cloud nine\" kind of thing. And you can find out just how peaceful this show can get when you enter the Rabbit House, a café where caffeinated aromas linger about and where plenty of lightheartedness is waiting to be met.\\n\\n\r\nA place full of endearments is inviting me.\\n\\n\r\nAfter being greeted by the gentle Chino, who has an odd fluffball of a rabbit atop her head, Cocoa starts a new life in the town by working as a Rabbit House waitress. From there on, she meets the other girls, all of whom are equally as adorable, and this is where the euphoria begins to seep through my heart. There's no deep drama. No major conflicts. The setting has already established a tranquil state-of-mind prior to everything else, and that peacefulness continues to emanate throughout every episode. As a result, all the activities the girls do here—working at their cafés, partaking in silly fun, or developing their friendship and sisterly bonds—are enjoyable to watch. The fluffy atmosphere simply blankets their interactions in a way that makes me want to cuddle them.\\n\\n\r\nOr \"Mofu mofu~!\", as Cocoa will adorably say.\\n\\n\r\nThere's also one other aspect that elevates my fondness for the show. That is, each one of the girl's personality reflects the beverages in which they're named after: hot cocoa for Cocoa's comforting sweetness, cappuccino for Chino's mature and childish duality, Thé des Alizés for Rize's cute tendencies despite her strictness, uji matcha for Chiya's refined elegance, and the Kilimanjaro coffee for Sharo's insecure sensitivity toward her own image. So if you think of GochiUsa as one wholesome café, then the girls are basically its warm, little beverages. Endearing, isn't it?\\n\\n\r\nAnd to further paint the soothing image of the show in your mind, the art—while more on the average side animation-wise—utilizes its soft pastel palette harmoniously in conjunction with its visual design. I already talked about the architectural beauty of the town, so let me expand on that by saying the numerous outfits, sweets, and expressions here are some of the other things that give more delight to an already delightful setting. It's like what they say—appreciate the little things in life. Because as tiny as the aesthetic details may be, they all add up together into one pleasant whole that makes the show continuously fun to bunny-hop through each second along the way.\\n\\n\r\nThe soundtracks deserve a mention as well, as they too contribute to the easy-going atmosphere. Whether they're the fairytale-like or the restful tunes, all of them share the commonality in rejuvenating one's heart and soul, and to highlight the lovable voices of the girls at the same time. You can certainly say the audiovisual has inspired the affection within me.\\n\\n\r\nAt the end of the day, GochiUsa is a show that personifies what happy serenity is all about. It may have used the same kind of ingredients found in other CGDCTs, but the comfort it creates with its town setting and affectionate girls is distinct enough to be appealing—a charm that I like to compare with the refreshing, sweet, and tranquil atmosphere of a café.\\n\\n\r\nStart your day with coffee. End your day with this heartwarming show.",
            "date": "2019-02-16T05:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 301782,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=301782"
        },
        {
            "content": "Yeah, I'm giving Is The Order a Rabbit (ITOAR) a 10. Allow me to explain.\r\nITOAR is a 10 to me because it is the perfect embodiment of moe. I describe this show as \"Loli Heaven.\" It's got nothing but cute girls. I'll break it down now.\r\nStory: 0/10. The show explores both simple and complex things, from learning a new skill or baking bread with friends, to understanding the complex workings of forming and maintaining relationships. Each episode is a one or two vignettes that don't really follow any over-arching narrative. If you've seen Yuru Camp or Gabriel Dropout, it follows those lines. That sets itapart from say, Blend S, that at least has a general direction. I gave ITOAR a 0/10 here because, basically, there is no story. That's ok though, because you'd come to this show for all of the following things.\\n\\n\r\nArt: 10/10. Holy shit. This show is adorable. All the girls are just so fucking cute and there are so many little things that it does to pull your heartstring. From small blushes on the girls' cheeks to big smiles to the way the VAs do their lines, it's pretty damn perfect.\\n\\n\r\nSound: 8/10. The OP and ED are both super cute. I put it up there with the Blend S or Dragon Maid OPs in terms of cuteness and memorability. As I said earlier, the VAs deliver each line well. The girls tend to speak somewhat slowly, so it may be a good show if you want to practice your Japanese. I only know what I've picked up from watching anime but I could pick out phrases here and there. I take away 2 points only because the general OST in-scene isn't memorable. I can't say it's bad but it also doesn't stick out. That may not be a bad thing but I can't award points to what I don't notice.\\n\\n\r\nCharacters: 10/10. Five girls. All unique. They have a depth not often seen in your run of the mill Moe show. They're not sickly-sweet, a problem I had with Yuru Yuri, and sometimes they go through rough patches. \\n\\n\r\nEnjoyment: 10/10. I would sometimes squirm at how cute things are. Chino and Cocoa are adorable together. The rabbits everywhere, and the odd obsession with them, is great. There are a few mysteries that linger throughout the show, but it wouldn't matter to me or most if they are solved or not (to point out, I'm halfway through the show rn so I don't know if they are solved or not). \\n\\n\r\nOverall: 10/10. Hands-down one of the best moe shows out there. I posted on the anime subreddit for moe and this was one of the most recommended shows. I see why now. I understand that the show has ~7.5 at the time of this review, likely because it's not a show that someone who exclusively watches shounens or fantasies will like. But if you want moe, it's here. Chino rivals Kanna for best loli imo, which I think says something.",
            "date": "2018-11-22T23:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 294553,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3555981.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Loganyosoy",
                "username": "Loganyosoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=294553"
        },
        {
            "content": "Your usual moe and slice of life anime. Usually for anime with 12 episodes, I find that they dont spend much time with character development due to the story plot being rushed. But for this anime i must say the producers did a good job with character development in that they take the time to show each character's personality and have a distinct personality for each of them. Add comedy to this anime and it makes watching it all the more interesting and enjoying\r\nFavorite character in this series has got to be Chino. Cool and quiet personality and kawaii as well.  \r\nOverall rating I'llgive this anime a 9/10",
            "date": "2018-02-21T19:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 272141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6872532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tringapore_98",
                "username": "Tringapore_98"
            },
            "url": "https://myanimelist.net/reviews.php?id=272141"
        },
        {
            "content": "I’m going to keep this one short, If you’ve ever seen a cute slice-of-life anime before you already know what to expect with this one…\r\n     Over the duration of the anime nothing really happens, girls working in a cafe make more friends over time… thats it really! There is a tiny bit of character development doesn’t really seem to be much of a plot line to this series at all. It is simply a light-hearted story of a group of girls living their daily lives and joking around and having some laughs along the way.If your looking for an anime that you can sit back and smile at, then this maybe the one for you.\\n\\n\r\n    The characters aren’t anything special, there is the shy and quiet Chino, the very ditzy Cocoa. Sharo (who’s scared of rabbits) and a worker at the rival cafe, Chiya, who runs the rival cafe and seems to be the source of reason in the group and finally (left the best till last) Rize…\\n\\n\r\n     Rize is probably the most interesting character in the group and probably the sole reason I wanted this series through to the end. As far as characters go Rize has a few surprises, pulling Gun’s out on Cocoa in the first episode made me laugh a lot. She is slightly military obsessed, obsessed with guns, combat and all things violence. This is later explained to be down to her father who I presume is in the military and brought her up in that that kind of environment and consequently she does not have a great understanding of how ‘normal’ girls behave. Throughout the series there are comedy moments where Rize completely misunderstands normal things as something military-related but these are mixed with the moments she reveals her tender side which are very cute.\\n\\n\r\n      Music throughout the series was nice and pleasant and suited the series, nothing I’d add to my MP3 player but suited the series.\\n\\n\r\n       The animation/artwork of the series was about average, not bad but as it was not a high -budget project about the level you would expect to see.\\n\\n\r\n       Its a nice pleasant show, but with its lack of story and progression its a hard sell to say this is actually worth watching… Rize is a rather cute and amusing character which adds some good fun into the series but still isn’t enough to say this is a series worth spending the time to watch…\\n\\n\r\n      Overall I’s say its one that if your bored, you want something thats just very light hearted and happy/smiley then maybe its worth picking up, but for most of us its probably not worth the time.",
            "date": "2015-02-06T07:46:00+00:00",
            "helpful_count": 7,
            "mal_id": 179770,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4157753.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Monjoex",
                "username": "Monjoex"
            },
            "url": "https://myanimelist.net/reviews.php?id=179770"
        },
        {
            "content": "Oh hi, people. I am a person who acts like Tommy Wiseau from The Room. Since, mercury1980 is away, I instead should do a review on \"Gochuumon wa Usagi desu ka?\", the anime about cute girls in a cafe. Isn't it good, huh?\r\nHello. I would like to have a cup of coffee. - Me\r\nOh hey, I didn't know it was you. - Shop Owner\r\nThat's me. - Me\r\nThat will be 5 dollars. - Shop Owner\r\nHere you go, keep the change. Hello, Tippy. - Me\r\nSTORY (8):\r\nCocoa Hoto is a girl who moves to Rabbit House cafe where she meets Chino Kafuu. Rabbit House is owned by Chino'sdad. Cocoa Hoto tries to adapt into this environment as she learns how to prepare tea and coffee, especially what she needs to do as a waitress. Chino tries to help Cocoa as possible so that she can effectively serve customers. \\n\\n\r\nWhat an interesting story.\\n\\n\r\nART (7):\\n\\n\r\nThe animation looks normal, huh?\\n\\n\r\nSOUND (9):\\n\\n\r\nI loved the opening song \"Daydream cafe\". It has a relaxing and interesting tune, huh? I loved the ending song \"Everyday Decoration\". It has a fun tone and I loved to listen to it a lot.\\n\\n\r\nCHARACTER (9):\\n\\n\r\nI loved the way how the characters interact and bond with each other. Not only that they make each situation fun and relaxing.\\n\\n\r\nEach characters are named by tea plants.\\n\\n\r\nChino is the type of stoic girl however, she always whispers in a soft voice like it supposed to be adorable just like Kanade Tachibana from Angel Beats.\\n\\n\r\nCocoa is a normal girl. In fact, I loved the way how she behaves like an elder sister figure to Chino.\\n\\n\r\nRize Tedeza is the badass girl but a kind person who maintains order and discipline. She rejected me before when I asked her out. She is using me and I'm a fool. You're tearing me apart, Rize.\\n\\n\r\nChiya Ujimatsu talks like Azusa from Idolmaster. She has this absolutely feminine voice.\\n\\n\r\nAoyama Blue Mountain was an interesting character although she has not enough screen time. \\n\\n\r\nI loved the way how they make every situation funny to watch.\\n\\n\r\nWouldn't it be good if the other characters have more screen time and character development, huh?\\n\\n\r\nCONCLUSION (8):\\n\\n\r\nIt is good to see these characters interact and bond with each other, huh? I really enjoyed it a lot.\\n\\n\r\nIt has its own light hearted moments.\\n\\n\r\nIf you love to see cute girls doing cute things, this anime is for you. So I give this anime an 8 out of 10. Bye. Hello, rabbit, you're my favorite customer.",
            "date": "2014-06-29T00:41:00+00:00",
            "helpful_count": 7,
            "mal_id": 149217,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=149217"
        }
    ],
    [
        {
            "content": "Alongside the frequent harem and superpower shows, anime involving cute girls (generally of the loli variety) living their daily lives has become a common sight in the industry over recent years. If you have watched even one cute slice-of-life before, you already know what kind of anime Gochiusa is going to be. But that isn't necessarily a bad thing.\r\nGochiusa finds a sort of equilibrium in its plainness. It is nothing that anime veterans and newcomers will find to be anything too special, but it is not as though every anime needs to be a life-changing experience. Something that merely allows you to relax and forgetthe troubles of the real world is also an equally valid (though perhaps less important) source of entertainment... especially when it contains cute girls. \\n\\n\r\nThe set-up can be explained in just a few words: \"Girl starts working for café and makes new friends over time.\" There is no exposition, no infodump, no profound characterisation - it is simply a light-hearted story of a young group of girls living their daily lives and joking around along the way. I suppose the setting is a bit different from the norm (just how many high-school themed anime are there, anyway... ?) as it is focused almost entirely on the café itself, but it still follows the genre's trend of 'been there, done that'. That being said, if you enjoy the genre and don't mind feeling a bit of deja vu every now and then, Gochiusa can be a surprisingly pleasant experience. \\n\\n\r\nAnyone looking for a cast of cute characters to fawn and giggle over will find just what they are looking for in Gochiusa. None of them are especially fleshed-out, but that's actually OK here. Gochiusa is not concerned with climaxes and drama. It is simply comprised of a few chapters in Cocoa's and Chino's daily life. Rather than focus entirely on creating sentimental value, it instead crafts a believable (somewhat- the talking rabbit is pretty weird!) world that the audience can identify with. There are no superheroes, no end-of-the-world scenarios. And that's fine. \\n\\n\r\nThe main cast comprises of Cocoa, the ditzy sort of protagonist found in nearly every slice-of-life show; Chino, an adorable, quiet girl that will get your heart pounding on more than a few occasions; Sharo, the timid worker of the rival café (who also wears a maid uniform!); Chiya, the ojou-sama and the sole source of reason in the story; and Rize, the most beautiful girl this world has ever known. \\n\\n\r\nRize is by far the most interesting character in the story. She is somewhat of a military otaku (ミリオタ), obsessed with guns, combat and all things violence. Her father brought her up in such an environment and consequently she does not have a great understanding of how 'normal' girls behave. The moments where Rize misunderstands completely ordinary things as something military-related are often hilarious, and the moments where she reveals her tender side, desperate for human attention, are unbearably cute. Her military background makes her a type of character that has not really been seen in slice-of-life anime, so her presence is very much appreciated. I am just not quite sure whether she looks better with her usual twintails or her hair down. Either way, her cuteness is probably enough to immediately send any human being into cardiac arrest.\\n\\n\r\nThe format of the show is structured similar to Aria the Animation and its sequels. There is a subtle Italian vibe to the setting and the episodes usually succeed in putting a smile on your face by the end. There are certainly episodes that are more exciting and more boring than others, though, and the blatant fanservice during the bathhouse episode is a bit on the pandering side. For a show so innocent and so heart-warming, close-up shots of the characters' ass and titties felt quite unnecessary. It didn't need to stoop itself down to that level. It could have done without. \\n\\n\r\nAnd where was the episode focusing on Rize's father and home situation? I was waiting, waiting for it to happen and received nothing of the sort. It could have been a great source of comedy, a way to portray Rize's military obsession as something genuine rather than a simple joke. It's nothing so severe as to lower the quality of the anime, but it definitely feels like a missed opportunity. \\n\\n\r\nGochiusa impresses with its audio. Many of the tracks evoke a sort of carnival theme, while others (again similar to Aria) are simply quiet orchestral pieces existing to create a sense of peace and tranquillity. The opening theme is lively and catchy, so catchy that it is likely to stick in your head for some days afterwards. It's one of few anime that time the opening track with appropriate visuals, rather than just pan over the protagonist's face or him/her walking for half the sequence. Seriously, what's up with that?\\n\\n\r\nThe artwork on the other hand is about average. Gochiusa is not a high-budget project and it shows. It's never offensive to the eye but it is never quite pleasant either. Sometimes the anatomy can get a bit wonky or the faces static and lazily drawn, but these scenes don't occur with too much frequency. Gochiusa is usually capable of hiding its modest budget. \\n\\n\r\nGochiusa isn't the kind of show that I would hold in high regard critically, but it is what keeps me entertained with the medium during the slow times where there is nothing better to occupy myself with. With all the battle shounen and harem titles dominating each season, I would much rather relax and watch a group of cute girls sipping tea and having fun with their day-to-day lives. And therein lies the appeal of Gochiusa. It is not sophisticated entertainment, but it is fine entertainment nonetheless. \\n\\n\r\nJust do be prepared for more of the same. There isn't much to set Gochiusa apart from its contenders aside from the fact that it has Rize-chan. Actually, doesn't she make the show an easy sell... ?",
            "date": "2014-06-27T21:15:00+00:00",
            "helpful_count": 276,
            "mal_id": 149033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=149033"
        },
        {
            "content": "As you would expect, Gochuumon is a slice of life anime about cute girls doing cute things. However, the emphasis on actual humor puts it well above many others in the slice of life category.\r\nStory: N/A\r\nIt's a slice of life show, so there is no real story to speak of. Cocoa moves into the cafe that Chino's family owns during the first episode, and that's about it. Besides very small character development don't expect much more than this.\r\nArt: 9\r\nWith a show like this you have to make cute girls, and yes, they are cute. The colors of the girls pop out and the animation rarelyfalters.  Everyone is very detailed.  I actually prefer this look in this type of anime rather than the moe blob or ultra deformed types I've seen.  The outfits change often and all look nice. The backgrounds are not bad either, and the scenes change often letting you see more of the town they live in. Not much else I can say about them besides they look nice and they are obviously not in Japan.\\n\\n\r\nSound: 7\\n\r\nThe music in Gochuumon fits well with the show. While there was nothing extremely memorable a la Clannad or Bakemonogatari, it still felt pretty strongly tied to the show. While I can't think of a song now after finishing the show, I remember often getting songs stuck in my head while it aired.  The voice acting was well done and everyone fit their characters.  I don't remember a time telling myself \"Wow this voice actor is amazing and playing out this role so well!\" but I also never thought anyone was out of place.  The voices fit the characters and there's not much else to say.\\n\\n\r\nCharacters: 8\\n\r\nWhat's a good slice of life anime without good characters? Or rather, characters that are fun together?  The Gochuumon cast is a tightly knit group with everyone able to play off of others situations.  While Chino is a shy younger girl who has a hard time talking, Cocoa is older and is kind of a siscon. This plays throughout the show as she tries to get Chino to call her her older sister.  Chiya and Sharo/Syaro have been friends for a long time often have a gag with Chiya revealing something Sharo/Syaro doesn't want to be known.  Rize is the military buff of the group, but wants to be just a regular highschool girl.  She is looked up to by Sharo/Syaro which results in many funny moments.  There's many other situations throughout the show but the recurring jokes are nice as well.  There are many situations that work for the group in the show and the characters do well to turn these situations into humor.   I enjoyed the cast a lot and cannot wait to see more of them.\\n\\n\r\nEnjoyment: 8\\n\r\nGochuumon is FUNNY.  I've watched quite a few slice of life shows now to know that many are cute girls doing cute things, but very few are actually funny.  The emphasis is usually placed on being cute and having cute characters.  Gochuumon seems to have it right seeing as they rely more on comedy than cute.  Yes there are still parts there just to make you say \"aw\" and small bits of fan service, but there are also many parts that can make you laugh out loud (surprising to me for a slice of life besides Nichijou and Nichibros).  This is a step in the right direction in my opinion.  I would rather have cute girls doing funny things than cute girls doing cute things.  Many shows recently have been going for cute, like Kiniro Mosaic, but not focusing on being actually funny.  Gochuumon fulfills the comedy genre it's put under.\\n\\n\r\nOverall: 8\\n\r\nIf you want a funny show about cute girls, watch this show.  If you want a show that you can just relax to, watch this show.  If you want a straight up  comedy I would still recommend this show.  I wouldn't recommend this show to people who despise the slice of life genre.  While a comedy, it is still a slice of life show in which there is not much story or anything happening.  Some people who dislike slice of life may enjoy simply for the humor but more cute girls are probably not going to change most people's minds.\\n\\n\r\nI would highly recommend this show to most everyone.  Like I said before, the only person I wouldn't recommend to would be people who dislike slice of life.  Gochuumon is funny, cute and lovable.  \\n\\n\r\nHighly Recommended.",
            "date": "2014-08-13T07:59:00+00:00",
            "helpful_count": 71,
            "mal_id": 156429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2490323.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Xenoka",
                "username": "Xenoka"
            },
            "url": "https://myanimelist.net/reviews.php?id=156429"
        },
        {
            "content": "Gochuumon wa Usagi Desu ka isn't a particularly standout anime among the bunch of new ones coming out this year, but it deserves a little more attention. Many compare this to K-on, and it's no surprise; they both have a large number of similarities, except for the most obvious one that K-on is set in a music club at a high school while Gochuumon is set in a cafe in a small village. But the characters are very similar. Anyway, on to the review.\r\nStory: 6\r\nThere isn't really a whole lot of story in this series, as to be expected from a slice of life anime.Each episode is for the most part self-reliant, the story in each episode not connecting to the one from the previous episode; in short, there is no solid story that keeps this show going. It's rather just a show about five waitresses that work at three different cafes, and their misadventures as such. Yet Gochuumon is different from other slice of life comedy anime from start to finish. I've seen some of other recent slice of life comedy series, but honestly, they aren't that funny. Lately, this genre hasn't been received too well by anime viewers due to the decline in quality of recent slice of life shows, since they seem to be relying too much on moe over humor/quality. But Gochuumon actually provides pretty good humor and I found myself laughing in quite a few parts.\\n\\n\r\nArt: 9\\n\r\nThe art is very good. The style isn't too different from lots of moe anime, but it's well done. The colors are soft and nice to look at, and the animation quality is top-notch. I haven't detected any problems with anatomy or anything of the like, either, unless you count the fact that the teenagers in this show look like middle schoolers, but that too is common in moe style anime.\\n\\n\r\nSound: 8\\n\r\nThe opening and ending songs are very lively and appealing; aside from that the music in this series isn't anything out of this world, but it's good and helps add to the relaxed and sweet atmosphere. The voice-acting is very good; not much else to say on this subject.\\n\\n\r\nCharacter: 8\\n\r\nThe characters are for the most part your average slice of life cast, although the majority of them are developed rather well. In any case, there are some things in each character that helps them stand out from other slice of life anime characters, like Rize's obsession with guns and military combat, and Cocoa's apparent sister complex, but nothing extraordinary. There is also a talking animal companion that is normally seen on top of Chino's head, which is a fluffy little rabbit named Tippy whose real identity is, well, this could be a little spoiler for some so I won't say. This show also contains its shoujo-ai overtones; typical of this genre. It's pretty sweet, though.\\n\\n\r\nEnjoyment: 9\\n\r\nI didn't expect to like this show too much. I really only started watching it because it looked cute and I was kind of bored. But it surprised me. It proved to be a very laid-back and funny show. This anime is a very good way to relax and just laugh. I honestly thought this show had a charm that lots of slice of life anime lately have been lacking. That's just me, though.\\n\\n\r\nOverall: 8\\n\r\nThis is a very good slice of life comedy that I recommend to fans of the genre. Not much else to add. It's adorable, and has a cast of pretty good characters and great art on top of good humor and great voice-acting.",
            "date": "2014-08-01T16:51:00+00:00",
            "helpful_count": 52,
            "mal_id": 154801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3799561.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/inukagome134",
                "username": "inukagome134"
            },
            "url": "https://myanimelist.net/reviews.php?id=154801"
        },
        {
            "content": "When people think of the animal known as the rabbit, there are two common things that pop into mind. The first is luck and the second is cute. The latter usually applies to those who wants to own a rabbit as a pet or have seen them face to face. And it’s not anything unusual too for people to react with delightful grace because rabbits are fluffy, cute, and likeable. Similarly, there is the common trend of ‘cute girls doing cute things’. (CGDCT) Two common things may pop into mind for series with such concept. The first is appreciation and the second is…cute.\r\nMake no mistakethough, Gochuumon wa Usagi Desu ka? (Is The Order a Rabbit) doesn’t just have the cute girls but also has the luck factor when Cocoa Hoto wonders around town and happens upon this place called “Rabbit Café” by pure luck. Contrary to what she may believe, as in a place where people cuddle cute rabbits, it’s instead a café that serves delicious beverages. Well, there happens to be one rabbit, even though it seems to a rather peculiar one sitting on the top of the head of store owner, Chino Kafuu. It’s here where the story begins for a young girl and her new life with rabbits, err I mean…friends.\\n\\n\r\nFor most slice of life shows, there’s one configuration people should be aware of. It’s essentially devoid of plot in both arc form or linear trending. There’s no actual story that develops with its setting because it’s too simple. Take it to face value – we get a café that serves beverages and cute girls managing them. However, it should also be noticeable not to denote a show just for its lack of story because its small yet colorful cast of characters makes up the appreciation for itself. \\n\\n\r\nIndeed, the character cast is the main focus with their dynamics. Gimmicky as it sounds, most of the characters are named after beverages you would find in a café. (ie. Cocoa named after hot cocoa, Chino named after cappuccino, etc) However, the gimmicks that it establishes has a beauty with our characters in terms of conversation and interaction. In essence, none of the characters are alike or parallel in one with another. They all have different backgrounds as Cocoa herself quickly discovers as she works with them on a daily basis. Taken for granted though, Cocoa is a young girl curious about everything around her but in particular cute and cuddly things such as rabbits. While we don’t get a full scope of her character, it’s easy to tell that she is able to make friends easily with others such as the soft spoken Chino. As the owner of the store, she has responsibilities and is often strict with herself. Yet behind her snowy image, Chino is a girl who wants friends. Cocoa pushes the button to her inner desires and gives her the initiative to try out new opportunities.\\n\\n\r\nAs the show progresses, more characters are introduced with diversity. Rize, a girl with a firm background in military, has two sides to her – one that personifies herself as a soldier while the other half an innocent girl with interest in cute things. Here we have her interact with others with different backgrounds. And with a military gimmick, you can expect her to be self-disciplined. On the other hand, we have childhood friends Chiyo and Sharo with their different view on rabbits. Nonetheless, the purpose of these characters are not to influence every aspect of the ‘cute girls do cute things’ concept but to deliver its contrivance. By doing that requires gaining the attention of the audience. Especially for shows without a progressive story, it’s important to realize the connection these girls build off of one another. Thankfully, the show achieves that with the focus on each character. All of them get their spotlights during conversations whether it can seem goofy, innocent, or just lively. It can also feel surprisingly realistic on instances when the girls talk about aspects of life whether it’d be related to work, school, or friends.\\n\\n\r\nA good portion of the show also comes from the comedy. It delivers tenderness and a charming atmosphere that people can appreciate. Some of it comes from the girls’ personalities. Other parts delivers with the conversations that uses all sort of motifs, casualness, and inspiring dialogues of imaginativeness. This can come as forceful on occasions yet can be surprisingly memorable because the show’s gimmicks. But at the same time, this can come as a mixed bag for some fans. Not everyone will appreciate this show’s gimmicks nor its humor. It can feel stale, repetitive, and even cliché at various times. Some jokes also can feel hypocritical and deny logic such as Rize’s ownership of firearms at someone her age or a talking rabbit. There’s also a bit of hidden yuri tropes behind the show for those who pay attention to its ever glimmering character cast. Objective discontent also pops off on occasions such as the first episode of Rize in her underwear or unconventional fantasies courtesy of a young girls’ mind.\\n\\n\r\nWhile the story itself doesn’t hold together with progressive moment, every episode does offer something new and even on occasions a different setting such as at school. This opens up doors for other characters to enter the story such as Chino’s classmates. The more noticeable part is that the show opens up feelings of human emotions whether it’d be jealousy, regret, fear, and even sparks of puppy love between the characters. Just don’t take it too seriously as this show is more about a fun package that should be opened up with appreciation rather than for deep value.\\n\\n\r\nThe artwork is generic to say the least but every character has a distinctive design with their backgrounds. Their personalities match well when it comes to these designs and gags referencing the nature of the characters. And as waitresses at a café, expect the girls to dress decoratively when at work. Their uniforms aren’t just charming but also fits the overall theme of a café such as Chino’s hat or Chiya’s maid-like dress up. The way the show also depicts its gestures with body languages is also solid to show itself colors. However, Tippy (the rabbit and mascot) can be a bit blend and strange. Take notice of his behavior as he may seem cute but acts nothing like an actual rabbit. \\n\\n\r\nWhile the soundtrack isn’t anything explicit for its background OST, one should take more notice of its voice cast. Care is taken when the characters speaks to match consistency with their personas. In particular, I give exceptional praise to Risa Taneda for her role as Rize. She can play her character very well that shifts her mannerisms from those of a self-disciplined waitress to an innocent girl in love with cute things. But to be honest, all the characters’ voice mannerisms are delivered well when it comes to their roles in conversations and ability to draw a viewer in with their expressive responsiveness. And while not as strong as the voice acting, the OP and ED songs shines with charm in the way I expected.\\n\\n\r\nWith all said and done, this show is a healing series that should be at least considered. Even if you’ve never stepped into a café in your life or is unfamiliar with the CGDCT concept, it can still offer something to anyone. 12 episodes. That’s all it takes to convey the message of the Rabbit Café and its characters. Despite some contestable humor and lack of a strong story development, it makes it up with the strength of its characters. Gochuumon wa Usagi Desu ka serves as an example of a slice of life show that is charming to the core and deliciously entrancing. \\n",
            "date": "2014-06-26T20:28:00+00:00",
            "helpful_count": 46,
            "mal_id": 148865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=148865"
        },
        {
            "content": "I lost hope. This anime has ended. ;~;\r\nThere is always an anime showing \"cute girls doing cute things\" every scene. I can never stop loving them, because they are always nice to watch. They are your perfect healers.\r\nSo, do you like lolis in your cafe?\r\nGochuumon wa Usagi desu ka? (or Gochiusa) revolves around five cute girls working on their own shifts in their respective workplace, all of them being cafes. The main character, Cocoa, starts her high-school life in a German-like town. Arriving at the \"Rabbit House\" cafe hoping to see rabbits in the cafe, she finds out that she will be working in thatcafe with a soft-spoken girl Chino, and staying as accomodation as well.\\n\\n\r\nFrom there, she meets the rest of the main cast - Rize, Chiya and Sharo, and other girls. The whole story is simple - cute girl doing cute things. But from an area that doesn't look like a typical Japanese urban, the story is tweaked to fit in its culture. The whole atmosphere is so light and fluffy.\\n\\n\r\nThe pacing is similar to some of the \"slice of life\"s - fast and nice. I like the comedy between the characters. There's a bit of yuri subtext and it's honestly cute.\\n\\n\r\nThe characters are extremely likable because of the moe factor, and they have different personalities. I feel that they match to their appearences as well. Some of the personalities are similar to what you see in the past few \"slice of life\"s, but it doesn't matter anyway.\\n\\n\r\nThere is good character development in some of the characters, the most notably be Chino.\\n\\n\r\nOne of the things I'm attracted to this anime is the character design, which gives off those loli bodies. I'm not a lolicon, but they are very cute. There is some fan-service but that didn't ruin the anime at all. I love the facial expressions made by the characters, whether for comedy or not. The scenery drawn in the anime are very spectacular. The objects shown are nicely drawn too. The visuals for the opening are awesome and the episode card titles are interesting to look at.\\n\r\nThe opening has to be one of the best openings I have listened to in this Spring season. Some parts are catchy while the rest are nice to get the groove on. It is sang by the voice actors vocing the main cast - and they sang wonderfully. The ending, sang by the voice actors of Chino and her two best friends, is nice and smooth. The background music is nice to hear and they somewhat match the culture in the anime's setting - being European-like. The voice acting is too cute, and the voice actors did a good job matching the personalities of their respective characters.\\n\\n\r\nGochiusa may have been an awesome slice of life to watch, but it can be easily compared to Kirino Mosaic (aired on Summer 2013) and Non Non Biyori (aired on Fall 2013). All three have some similarities, such as Rize and Aya - voiced by the same voice actor. Since the two anime I mentioned have their second seasons announced, will Gochiusa have another season?\\n\r\nHonestly, I definitely agree. This anime is too much. I enjoyed the heck out of it. I love the fun the characters are having. This anime leaves a warm feeling to me and I love it.\\n\\n\r\nChiya best girl.",
            "date": "2014-06-26T15:32:00+00:00",
            "helpful_count": 20,
            "mal_id": 148809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440083.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SkyNoHoshi",
                "username": "SkyNoHoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=148809"
        },
        {
            "content": "Is the Order a Rabbit?(Gochūmon wa Usagi Desu ka?), Aired in Japan between April and June 2014, Created by White Fox, is a Slice of life Comedy anime about a girl called Cocoa Hoto, who moves to a new town to attend her new school. She living in town with Chino Kafū at her family's Rabbit House Café, working as a waitress to be able to pay for her accommodation. And the start of the story but because how is anime is written i not say anymore on it, but can say that the story is well written and has quite a charm to it.\\n\r\nNow on to the 5 main characters themselves, Cocoa Hoto (Voiced by Ayane Sakura), a girl starting middle school and works as a waitress part time. She has a thing for cute things like rabbits, she looks at Chino as her little sister she never had and while she may not have many skills, she really skilled at baking bread. Next is Chino Kafū (Voiced by Inori Minase) is a girl in her last year of lower school and works as a waitress at her Family's Cafe in the daytime when she's not at school. While she is a quiet and soft spoken, she starts to warms up to Cocoa, but get annoyed alot when Cocoa ask her to call her big sister. Also she and father knows about the secret about Tippy, her rabbit and the Rabbit House mascot, and her grandfather. Next is Rize Tedeza (Voiced by Risa Taneda) is a girl that is one of the waitresses at the Rabbit House, is oldest girl of the group, goes to a different school than Cocoa, a school for the elite and to me looks like Azusa Nakano from K-on! just older. Being she the daughter of a soldier, she has a very disciplined, military-like but she also very kind. She carries a Glock and a combat knife on her for self-defense, has a very strong feminine side that she hides, she cares alot for her appearance and is close to Sharo. Next is Chiya Ujinatsu (Voiced by Satomi Satō) is a girl the same class as Cocoa and runs her family coffee shop called, Ama Usa An. She loves making Japanese Sweets and naming them, but because of what she names them most people don't know what they are. She owns a rabbit called Anko, who is her shop's mascot and childhood friend to Sharo. Lastly is Sharo Kirima (Voiced by Maaya Uchida), is a girl the same age as Cocoa but goes to same school as Rize as a scholarship student as she is poor and works at a different cafe as a waitress to earn money. She lives next door to Chiya and has a fear of rabbits thanks to Anko. She gets very hyper after drinking coffee, her emotions while hyper differ depending on the type of blend and has feelings for Rize.\\n\r\nNow the main characters are out the way and i will say my opinions on them later, next is presentation. Is The Order Is Rabbit is shown in cell-shaded graphics similar to K-ON!, the characters are very colorful with bright colors, the scenery looks very lively and realistic and overall very well made. The cut-in backgrounds that appears looks very creative and fit what the character at the time is talking about. The characters on screen move very good and have very good body language and facial expressions that fits quite well. The voice acting is great, every voice fits it character's personalty and are spoken very clearly. The music in the anime is great and the opening song and both ending songs are very catchy. The music is used to help fit the mood on screen and changes very smoothly depending on what a character says or do. Lastly the topics used in the anime are very well done as they don't feel out of place and interesting. \\n\r\nNow to the my thoughts about the anime. Is The Order a Rabbit? is a very created animes, one of the best Slice of life animes i ever watch as it keeps you interested by not staying one subject for too long and the conversations between the characters are very entertaining. The anime looks great as it has the look of alot of hard work has been put in and it shows very well as it looks beautifully. The characters themselves i like alot as they look great and their personalizes are very interesting specially Rize, as i like her the most as very older sister like to the others and have a nice side (Also i really like her hair). Overall i recommend this is to anyone and is very family friendly as at can be enjoyed by all because of how the character act and the topics that are used are not inappropriate for young audiences but entertaining for all. \\n\r\nWith that said, I say that Is The Order a Rabbit? is a must watch and is very enjoyable by all ages. If you like things based on real life or watch and like other slice of life animes, then this is for you.",
            "date": "2015-04-13T01:57:00+00:00",
            "helpful_count": 19,
            "mal_id": 185515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4557188.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Seto_Masamune",
                "username": "Seto_Masamune"
            },
            "url": "https://myanimelist.net/reviews.php?id=185515"
        },
        {
            "content": "Okay, before you read on , please note this is my first review, and I am kind of new to Anime. (I have watched it in the past, but you get the idea). Anyways, on to my review:\r\nTo start off, this show is different than other shows I have seen (even though the Slice O' Life section of Anime is huge), so if you have seen those kinds of shows, this might be familiar. If you're looking for an action show where there is always fighting and such, this probably is not the show for you. \r\nFor me the show was fantastic. Loved the charactersand how they interacted with each other in their daily lives. In fact, that's my favorite part of the series. The characters looked pretty similar, however each still has distinct taste, personality, and interaction. What's neat about this show is how it affects you. For me it was something to watch before bed and in the morning. It kind of \"relaxed\" me, if you will. Something about their daily life really made me enjoy the show.\\n\\n\r\nWhile the characters are cute and are meant to be cute, the show actually does not push it in your face, if you catch what I am saying. The characters are respected in a lot of ways. I'm not one for how a character looks, but how they act and are treated, and these characters were down right hilarious and nice to each other, and that's what counts. (They all also had distinct physical features as well, for example, Chino Chan has Tippy on her head, etc).\\n\\n\r\nTo conclude this review, I would like to recommend this show to anyone looking for a break from all the fighting and drama, and just sit down and watch a show like this. Personally, it's one of my favorite shows (In fact, I didn't want it to end) and I think anyone should watch it, or at least try it out. \\n\\n\r\nThanks,\\n\\n\r\n~Kyle",
            "date": "2015-01-12T07:04:00+00:00",
            "helpful_count": 17,
            "mal_id": 177529,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4342063.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/3TH3R3AL-3V3",
                "username": "3TH3R3AL-3V3"
            },
            "url": "https://myanimelist.net/reviews.php?id=177529"
        },
        {
            "content": "This is going to be an informal review about my general thoughts and opinions on this anime, which may involve VERY MINOR SPOILERS.\r\nStory: \r\nIt's a slice of life moe anime revolving around cute lolis working at a cafe. What kind of plot or story line do you expect from this? Whatever \"story\" it does have is done fairly well though, so that's why I give this a 6. The main draw of this anime obviously isn't its plot.\r\n6/10\r\nArt: \r\nPretty nice and vivid, shiny colors that attracted my attention throughout. Good art style in my opinion. Very appealing.\r\n9/10\r\nSound: \r\nReally liked the background music, the opening music,the ending music; just all of the music was really cutesy and fit the tone of the anime quite well. Very enjoyable and relaxing.\\n\r\n9/10\\n\\n\r\nCharacter: \\n\r\nThis is where the anime shines; moe lolis doing cute things while working at a cafe. What's not to like about the characters? Each character has their own personality and their personalities work very well together. The development between the characters is very good as well, as they get acquainted with each other and gradually build upon their friendships, getting closer and closer. Especially Chino and Cocoa. Would have liked some more Rize x Sharo, though. \\n\r\n*VERY MINOR SPOILER* I'm still not so sure on how Chino's grandfather turned into Tippy though, and whether or not Tippy and Chino's grandpa share the same body, or if he just took over the body for himself. Also, it hints in one episode that Cocoa might have an older sister, but it only hinted at that for about 5 seconds during episode 10 or so, so I'm not really sure *END OF VERY MINOR SPOILER*.\\n\r\n10/10\\n\\n\r\nEnjoyment:\\n\r\nNo matter how crappy my day was, or what mood I was in, I always looked forward to watching an episode of Gochuumon was Usagi Desu Ka?. Every episode put a smile on my face and just made me \"aww\" at the cuteness of every second. Very very enjoyable for anyone that likes cute things, and even if you're the manliest man of all men ever created, you'll still probably bubble over with cute feelings after watching one episode.\\n\r\n10/10\\n\\n\r\nOverall:\\n\r\nIf you're just looking for a laid back cute anime to watch and have fun with, and aren't expecting any sort of \"real\" plot, then this is the anime for you. Don't go into this expecting serious conflicts or plot twists, or anything of that bunch, because you won't be getting any of that. If you just turn off your brain, watch and listen, your frown will be turned upside down. Very happy-go-lucky and very enjoyable.\\n\r\n10/10\\n",
            "date": "2014-07-04T19:42:00+00:00",
            "helpful_count": 16,
            "mal_id": 150381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3653271.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Taisho-san",
                "username": "Taisho-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=150381"
        },
        {
            "content": "Gochuumon is a show I first picked up on off of some crossover art with Sora no Method, which in retrospect might have been a missed red flag given how that series has played out. But after a few episodes, reams of fanart of the most adorable and youngest of the main characters, and with its banging OP theme implanted firmly in my music line-up, I was hooked. \r\nUnfortunately, this turned out to be a case of jumping the gun. The more I watched, the more I realized that the initial flash that had pulled me in was just that - frontloading the series withcatchy content to give the appearance of a better show. Lots of shows do this, but the 'slump' in this case was half the series, and by the time it felt like it had found its stride there was a handful of episodes left. The high-energy theme belies a show that's happy to meander through 12 episodes not doing much of anything, rarely very funny and rarely very cute but enough of each that you probably won't drop it.\\n\\n\r\nIt's not a bad show, and it certainly has its moments - Chino, the daughter of the owner of the Rabbit House cafe, is great as the eternally nonplussed companion to the endearingly scatterbrained Cocoa. Their sparring relationship as 'sisters' is one of the better dynamics in the show, and is perhaps the 'story' of Gochuumon in a similar way to how Nano and Mio coming to terms with who they are are the 'stories' of Nichijou. The atmosphere, too, is - to risk a metaphor - comforting like the scent of coffee wafting through Rabbit House must be. Between the gentle pianica of the ost and the many shots of characters strolling cobblestone streets, you get a sense of the sleepy European town they apparently set this in (albeit one where characters eat cake on Christmas).\\n\\n\r\nUnfortunately, both the story and the atmosphere get crowded out by so-so humor, extremely iffy art, and a cast that is far too large for its own good. The humor is played more for cuteness than for actually being funny, resulting in lots of mediocre jokes told poorly. Most of the side characters are made up of a few jokes played on repeat - the infatuated kohei, the spacey, awkward writer, the other sort of spacey and uncomfortably invasive mothering girl - though they manage to massage Rize's tsundere role over the course of the series.\\n\\n\r\nThis is a show that seems destined to be forgotten among the hoards of moe filler, occasionally recalled for its odd title, great theme, and a few characters that will perhaps live beyond the series itself. Perhaps the few interesting moments I mentioned make it worth watching - perhaps it's also worth mentioning that there's a decent amount of fanservice which, while often crass and silly, isn't unwelcome if you're partial to the characters - but in the end there are plenty of other shows that have all the ingredients that Gochuumon has and managed to do it better.",
            "date": "2014-12-15T20:39:00+00:00",
            "helpful_count": 15,
            "mal_id": 172481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695623.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cuteisanarchy",
                "username": "cuteisanarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=172481"
        },
        {
            "content": "For anyone that does not seek a cliche or a proper plot, then this is an anime for you.  Great for loli-cons and people who loves art work from anime.  \r\nThere is no real story or plot behind this anime, but a series of scenes of slice of live situations.  A wonderful anime for your \"break\" from another anime.  This has brought me laughter and joy.  Whenever I think about this, it just sparks me and longs for more.  Not much over-used comedic effects to get cheap laughs from the audience.\r\nThe art is simply splendid.  I guarantee thisis one of the best drawn anime ever.  If you disagree, tell me.  They really maximized the use of the moe effect; from the detailed hair style of Rize to the cute bow that Cocoa wears, to Tippy on Chino's head to Chiya's gleeful smile to Syaro's uniform.  The background is jaw-dropping magnificent.  The medieval style of the buildings is a nice touch and different from your usual Japanese buildings from shows like Initial D etc.  \\n\\n\r\n The real captivating feature about this show are the characters and their personality.  It's what they are that makes the soul of this show.  Without it would be like Fairy Tail without the Fantasy.  In other words, you watch it for the sake of the characters.  There must be one that you like, the apathetic(ish) Chino, the bubbly Cocoa, the prideful Syaro, the ditzy Chiya and the solider-like Rize.   If not, you're going to waste your time.\\n\\n\r\nSoundtrack is alright.  Personally, I listen to a lot of soundtracks, but I've no compliments nor praises for it.  However, the ending is something I always loom forward to after finishing an episode.  It sounds so happy and bouncy.  I will actually rewind and go  back a minute and listen again.  \\n\\n\r\nIt's a really good anime for people who doesn't like a long series, good sit-com like laughs, and who are innocent (No H yay  :D).  \\n\\n\r\nTo sum up, great art, good laughs, nice music, brilliant character and personality.",
            "date": "2014-07-01T13:36:00+00:00",
            "helpful_count": 13,
            "mal_id": 149821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3806395.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Conor_Styles",
                "username": "Conor_Styles"
            },
            "url": "https://myanimelist.net/reviews.php?id=149821"
        },
        {
            "content": "Gochuumon wa Usagi Desu ka? Was a series of 4-panel manga written by Koi and published in Manga Time Kirara Max. From April to June of last year, it got a twelve episode anime adaptation from White Fox Studio. You may remember them from their work on Jormungand, Steins;Gate and their one fail that I've seen, Katanagatari. How does this one hold up? Let's find out. This is GochiUsa.\r\nStory:\r\nOur tale begins with our main character, Cocoa (she's Cocoa but she's not quite loco), moving to a new area. There's just one problem, she can't find the family she's supposed to be staying with. She stopsat a cafe called Rabbit House to ask for directions where she meets young Chino. Luckily for her, Rabbit House turns out to be the place she was looking for. What a fortunate coincidence. While working part time in exchange for room and board, Cocoa meets several other girls, Rize, Chiya and Sharo. Rize works at Rabbit house with her and Chino while Chiya and Sharo work for two other cafes. Various hijinks ensue since this is a comedic work and the story is minimal.\\n\\n\r\nWith that in mind, let's talk about the comedy. GochiUsa has a style of humour that's a lot like K-on's. You've got a cutesy and zany group of girls working their hardest at tasks related to a specific thing and the humour is largely derived from their interactions with one another and their various quirks. The big differences are that they usually aren't working together in this and they introduce some really bizarre supernatural elements. The series does somewhat take advantage of the comedic possibilities presented by them working for competing businesses, although it really doesn't do a lot with it, preferring to keep their relationships cutesy and amicable while downplaying any conflicts that may have been brought up. It also makes some jokes about the supernatural elements, but they're easily the weakest part of the series. Honestly, a lot of it is just repeating the same ventriloquism joke with slight variations. I will say, to the series' credit, most of the humour does work really well. I will also give GochiUsa credit for having some really well done cute moments throughout the series.\\n\\n\r\nCharacters:\\n\\n\r\nThe characters are pretty simple. In all fairness, they are a bit better developed than a lot of slice of life comedic casts and they do have a good mix of characters who can play off of each other really well. I will also give the series a lot of credit for having a lot of really strong character interactions that extend beyond just comedic bits. There are some strong touching and heartfelt moments.\\n\\n\r\nArt:\\n\\n\r\nThere are some real positive aspects to the art. The backgrounds are nicely detailed and the animation really flows well. The series is also really good at drawing rabbits, when they don't get lazy with it. The character designs are kind of standard too. They don't look bad by any means, they just aren't anything special.\\n\\n\r\nSound:\\n\\n\r\nThe vocal cast does well. Sakura Ayane, Minase Inori, Uchida Maaya, Taneda Risa & Sato Satomi all give fine performances. It is a little strange hearing Hayami Show play a perfectly nice, normal guy when I usually hear him voice complete villains like Tenzen, Aizen, Zarbon and Muraki. Don't get me wrong, he's good in this, but it is a little weird. I like the music too, it really suits the series.\\n\\n\r\nHo-yay:\\n\\n\r\nThere's certainly some les-yay. Sharo has a crush on Rize, and that's actually stated in the series itself. There are also two different pairs of girls who can communicate psychically with each other, I'm guessing by the same mechanism that allows Akari and Kris to speak with each other while competing in the semi-finals during Battle Athletes. Cocoa is also really intent on having Chino call her “sister.” It would be suspect even without a younger girl referring to an older girl as “sister” being a fairly common shoujo-ai trope. Don't ask me why it's common, I don't really understand it either. The ho-yay factor is going to be a 6/10.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nGochiUsa is a funny, entertaining, cutesy and really endearing series. It's not a complex series, nor is it the most original series out there, but If you want something light and fluffy for a quick laugh, it would be a really good choice since most of the jokes do work well and it has some really good character interactions. For myself, I give it an 8/10. It knows what it is and it does it really well, although not perfectly. Next week I'll look at the second series of Natsu no Arashi.",
            "date": "2015-02-18T11:05:00+00:00",
            "helpful_count": 12,
            "mal_id": 180719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=180719"
        },
        {
            "content": "This anime was very adorable to watch. All the characters had a really good back story, especially Chino. I give this anime an outstanding score because it was very enjoyable to watch and I recognized two voice actresses from another anime that i previously watched. I also give the character development as a 10 because Chino had a really great back story about her grandpa (currently the rabbit Tippy) and it was all a mystery until episode 10 or 11 (or some of the mystery about chino's grandpa we found out about). The sound I also, as always I'd give a 10 because the voiceactors were very well chosen for this anime. The enjoyment of this anime was very well because Cocoa is the funniest character in this anime (out of the other characters). I'm hoping that this anime will have another season because I really enjoyed it. The music in this anime was very cute and catchy, a lot of beautiful music filled the anime with more enjoyment. I'm hoping that i'll hear these voice actors once again (in a different anime) soon :).",
            "date": "2014-06-30T15:16:00+00:00",
            "helpful_count": 12,
            "mal_id": 149649,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3235803.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shinseul",
                "username": "shinseul"
            },
            "url": "https://myanimelist.net/reviews.php?id=149649"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nNature contains two distinct branches, if you will: flora and fauna. Or for those that prefer the basic terms, plants and animals. Disregarding all of the former gives us a wide range of creatures that roam the Earth. The ferocious rhinos of Africa, the black-and-white pandas of Asia, and the slithering snakes of Australia, to name a few. These examples are more exotic; that is, some animals are a bit more domestic. The most popular among them being dogs and cats. However, there exists one rather cute species that has garnered much attention throughout the years. And ifthe title doesn't make it apparent, this animal is, of course, the bunny rabbit. In Is the Order a Rabbit?, while the coffee and cute girls take the spotlight, there are still bunnies aplenty.\\n\\n\r\nSTORY\\n\\n\r\nRabbit follows a young girl named Cocoa, who, upon moving to some Western town, houses with another young girl named Chino. Along the way, they make friends with Rize, Chiya, and Sharo, and their exploits are shown throughout.\\n\\n\r\nAt its core, Rabbit is nothing more than a cute girl show. From beginning to end, it isn't looking to elicit emotions from the audience other than those of happiness and joy. Drama is irrelevant, development of the characters is nonexistent, and it is thematically lacking any kind of outlook on society or life as we know it. And that's perfectly fine. Not every anime has to cause us to question our self or provide a thought-provoking message. No, what Rabbit relies on is execution.\\n\\n\r\nFor the genre it places itself in, \"cute girls doing cute things,\" it performs very well. The majority of this is due in part to the characters themselves. They seem trope-y -- and to an extent, they are -- but their personalities and interactions are distinct and varied enough to make the entire experience completely fun from start to finish. Cocoa's \"big sister\" shtick, Sharo's inability to compose herself around Rize, and Chiya's sweet-naming powers remain consistent both in quality and quantity, providing the viewer with never-ending cuteness.\\n\\n\r\nWhere Rabbit missteps is in the presentation of the comedy. It's a mixed-bag, to say the least. On the one hand, the show is capable of utilizing its setting and situations to great effect, giving the laughs and adorableness needed for the moment. When it's focusing on the girls working in the coffee or tea shops, or playing up their character quirks, it's fine. On the other hand, though, a lot of the jokes either happen way too quickly or come from out of nowhere. Aoyama suddenly liking looking at girls or the lot of them practicing sports is good fun, but feels out of place within the context of the show.\\n\\n\r\nOne interesting aspect of the anime is the title. The line, \"Is the order a rabbit?\" is only uttered once, and in a flashback no less. From a literal standpoint, it doesn't make much sense. Who \"orders\" a rabbit from anywhere other than at a high-class restaurant? In other words, how does it relate at all to the show? The key word here is \"order.\" It's not a request for food but rather a question about the composition of the show itself. Rabbits are cute, fluffy, small, precious, and harmless. The anime is definitely cute, the girls being a testament to that; it's \"fluffy\" in the lighthearted subjects; the series is contained and doesn't try to be anything more than it presents; it's difficult to mistreat the show; and it certainly isn't out to offend anyone. In this way, one can see the show as a \"rabbit,\" just without the physical (and alive) form. My analytical glasses are straining here, but the comparison of the anime to its presupposed rabbits is definitely interesting.\\n\\n\r\nANIMATION\\n\\n\r\nIs the Order a Rabbit? actually performs nicely in the art and animation department.\\n\\n\r\nTaking place in a Western village, much of the locations are depicted as such. Narrow streets, classic European houses, and bridges spanning canals permeate the show. It gives it a nice sense of \"uniqueness\" even if the girls are speaking Japanese. At the same time, the show does incorporate nice lighting effects and more serene environments besides the \"Rabbit House.\" Places such as the park or the bath-house aren't particularly enticing, but do help to spice up the formula. To help the hilarity, the show also incorporates more minimalist caricatures -- deadpan eyes, faces, and \"chibi\" bodies.\\n\\n\r\nThe character designs follow the simple pattern of \"varied hair and eye colors\" for the most part. This simplicity isn't terrible, as none of the characters are poorly drawn or animated. They are all rather small in stature, giving them a -- perhaps unneeded -- boost to cuteness.\\n\\n\r\nActual animation is often average to above average. It mostly depends on the type of art they are exhibiting at the time. If it is \"modern,\" hair flows, expressions change, and eyes glisten and wander. If it is \"minimalist,\" the characters are usually refrained from moving much to (again) enhance the comedy.\\n\\n\r\nCHARACTERS\\n\\n\r\nThere are five main characters within Rabbit: Cocoa, Chino, Rize, Chiya, and Sharo. This is the order in which they are introduced, but let's go through them by personal preference.\\n\\n\r\nAs the youngest of the group, Chino is often treated as a child. Her emotionless way of speaking and frequent need to have Tippy placed on her head does make her out to be such a person. However, more often than not, she is the most serious and mature of the ladies. Towards the beginning of Rabbit, she is rather distant, refusing to take part in the silliness that Cocoa offers. However, Chino's time with her and the other girls allows her to break out of her self-induced shell, giving her the connections and friends that she always longed to have.\\n\\n\r\nCocoa is as strange as the name she harbors. Her affable personality and \"sisterly\" ways paint her as fun-loving and sibling-wanting. She contains a certain obsessiveness for cuddling anything -- especially Chino and bunnies -- and is rather dense when it comes to understanding the situation. Where she lacks in intelligence she makes up for in happiness, being the type of person who doesn't conform to the environment around her. Instead, while she may get sidetracked or she may cause everyone more trouble than is necessary, she enjoys being the jubilant young girl she's always been.\\n\\n\r\nSharo has an affinity for two things: glassware and Rize. Her abnormal fear of rabbits and misunderstood financial status make her \"stick out\" from the crew. She's refined and ladylike, yet finds herself going with the flow when everything goes down. This is mostly due to her major insecurities, a problem she is usually forced to deal with. Sharo, more so than any of the other cast members, values the people around her, looking to fit in rather than be ostracized due to some misplaced thinking. And over the course of the season, she is given these opportunities to find her place. While it starts somewhat rough, she eventually discovers that it isn't about where you come from that truly matters; what matters most are the feelings you share with those around you.\\n\\n\r\nThe best way to describe Chiya would be to call her a \"mother.\" Doting on Cocoa, Sharo, Rize, and Chino, Chiya is simultaneously very aware and very carefree. She takes pride in coming up with clever names for the sweets she sells, but much like Cocoa, she tends to cause quite a few problems for those around her. In this way, she and Cocoa are \"two peas in a pod.\" Where they differ, though, is in their conversational positions. That is, Cocoa is a \"talker\" whereas Chiya is a \"listener.\" She's willing to sit down and hear out others, owing further to her parental nature.\\n\\n\r\nRize is pretty, but undervalues her own womanly aura. With a deep love for the military, she is often seen equipped with a gun or making coffee cream art in the shapes of tanks and jets. Oddly, compliments go straight to her head; she is generally cool-headed except when it comes to her looks or beauty. Being the oldest, she takes on a leadership role, guiding the girls both at work and in life. For her, she always felt as if she was being left out. And again, a comparison is made, but this time to Sharo. Sharo's perceived loneliness was due to her unwillingness to express herself properly. Rize, however, believed that her behavior was pushing everyone away. Luckily, she finds that her friends are more than willing to accept her for who she is, knives or snipers otherwise.\\n\\n\r\nEach of the characters is quite likable, with no one being particularly grating or underwhelming. They're given an appropriate amount of time to be characterized and to give their own flavor to the comedy. At the same time, there's a particular connection that exists between many of them. The show explores the idea that, even if one feels helpless, there is somebody out there who cares. This is demonstrated constantly throughout the anime: Chiya consoling Sharo in the library, Cocoa looking after Chino as a \"big sister,\" Rize acting as a role model for Chino's friends Megu and Maya, etc. Their aid for one another is what provides the show with the calming and mellow feel that it has. Nobody ever feels in danger, everyone is happy, and it is almost always \"sunshine and rainbows.\" And it's designed this way not because of the individual characters, but because their relationships allow such fun to blossom, to run as free as a wild bunny.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is fine for what it is. The differing vocalists create a cute arrangement, even if the beat is rather boring. It's fun and fleeting, and fits the anime nicely enough.\\n\\n\r\nAs for the ED, it's harder to pinpoint. Once again, the highlight comes from the varying vocals, and not for the instruments themselves. The guitar and clapping are cute, and the three-step lyrics can often be catchy. And while it ends on resounding trumpets, it just isn't that memorable of a song.\\n\\n\r\nThe soundtrack, though, is rather nice. Owing to the setting and atmosphere, it generates many storybook-like tunes. Whimsical harps, dainty piano playing, and funny flutes give Rabbit a fantasy-esque feeling despite the normalcy of the scenarios themselves.\\n\\n\r\nVoice acting sees above average performances for everyone involved. Shout-outs go to Maaya Uchida as Sharo, Ayane Sakura as Cocoa, and Inori Minase as Chino.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one requires the viewer to care about cuteness, more so than other anime, because it solely relies on it. Besides its execution being there, I found myself enjoying pretty much the entire cast. Cocoa as the lead actually didn't deteriorate her laughs; she was usually the one to make me smile. My favorites were Rize and Chiya -- Rize for her blushing and Chiya for her calmness -- but I also greatly liked one of the side characters, Aoyama. Her inclusion is kind of strange, but her lax way of going about her business wasn't so much funny as it was a way to buffer the quite rambunctious girls. She is quite attractive, too.\\n\\n\r\nI find myself wishing that the show would have done a bit more explanation in regards to Tippy, and some of the relationships, most dealing with Chino, weren't as fleshed out as some of the others. This will most likely come with later iterations in the series (if they come to be), but as an example it would have been nice to see Chino and Sharo interact more with each other over the course of the show. Also, while Aoyama was given a small chance to shine, I would have liked to have seen her sooner and more often.\\n\\n\r\nIs the Order a Rabbit? pours out adorableness like a pot pours out coffee: swiftly and in large measure. Combined with the nice art style and lovable cast, the anime should be able to bring a beaming smile to anyone's face.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, nice execution, though lacking comedic guidance and anything else\\n\\n\r\nAnimation: Good, great art style, okay character designs, good actual animation\\n\\n\r\nCharacters: Good, Cocoa, Chino, Rize, Chiya, and Sharo are each both cute and helpful\\n\\n\r\nSound: Fine, okay OP, okay ED, good soundtrack, good VA work\\n\\n\r\nEnjoyment: Good, funny and charming but needs more Aoyama\\n\\n\r\nFinal Score: 6/10",
            "date": "2015-01-21T20:56:00+00:00",
            "helpful_count": 11,
            "mal_id": 178721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=178721"
        },
        {
            "content": "Story: I give this 7/10. Obviously there is no story at all and only just a SoL but the comedy I think is better than usual SoL. It doesn't rely on tired tropes. \r\nArt: Nice and comforting. I liked it very much. Therefore I give it 10/10. I like the change in background scene, not just typical Japanese school setting. This providing a good refresh. \r\nSound: The only thing I can say about the sound is the Season 2 Ending: Tokimeki Poporon. YouTube it, you will get diabetes. Other than that, the soundtrack is not distracting but not always the most memorable.\r\nCharacter is 9/10 becauseI thought they were quite funny character.\\n\\n\r\nEnjoyable SoL for those who want SoL. For the other persons who want more plot, do look elsewhere.",
            "date": "2018-05-24T14:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 281313,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7101956.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xmr2000",
                "username": "xmr2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=281313"
        },
        {
            "content": "First of all this is my first review, I never expected to make one in the first place so I struggled a lot with the redaction.\r\nStory: There is not much to say about the story in a “cute girls doing cute things” (CGDCT) anime. \r\nIt is first introduced with Kokoa who gets lost while looking for the place where she was going to live so she decides to stop by a cafeteria with the coincidence that it was also the place where she was going to live and work part-time, there she meets Chino and Rize, later she would meet Chiya and Sharo whoworked at different cafeterias. It is also worth mentioning that the girls assist to different schools so the show develops in a labor environment or just the girls hanging out after work and not in a school environment like most (if not all) CGDTs.\\n\\n\r\nNow to the actual review:\\n\r\nThe CGDCT anime usually aim for 3 things: the cuteness, the comedy and the heart-warming side but these shows usually fail a bit at the latter, they are so focused on comedy that when they try to be heart-warming in my opinion they tend to become a little boring, they struggle a lot to balance this. However, GochiUsa has a good balance, and this is because it EXCELS at being heart-warming, the comedy is a bit sacrificed but this doesn’t mean the comedy is bad, the comedy is actually good but as I said GochiUsa is very well balanced and it has a bit of character development (though this applies mostly for Chino). \\n\\n\r\nThe animation and art were both amazing, nice to look at and well... extremely cute, the music was also pretty good. Though the background music wasn’t particularly memorable it was good enough to portray this feeling of heart-warmth I mentioned above. \\n\r\nWhat was really memorable was the voice acting, all seiyuus performed their roles very well and were all fitting to their characters. This is especially noticeable with Inori Minase's role as Chino.\\n\r\nJust don't expect much of it during its first episodes as it is until the 4th or 5th episode when it gets better.\\n\\n\r\nIn conclusion, though GochiUsa doesn’t break any grounds at all it feels like a different take on the CGDCT genre and very refreshing to watch. \\n\r\nOverall 8.5/10 \\n",
            "date": "2015-10-18T20:40:00+00:00",
            "helpful_count": 10,
            "mal_id": 201540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4559761.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fruits_punch95",
                "username": "fruits_punch95"
            },
            "url": "https://myanimelist.net/reviews.php?id=201540"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 8\r\nCathartic in nature, GochiUsa is a heartwarmer that has its roots in providing contentment—similar to the relaxation one can feel from sipping freshly-brewed coffee. With an ample amount of lovable charms and a cuteness as cute as the twitches of a bunny's nose, it's the ideal to show to hearten oneself. I mean, just look at my smiling face!\r\nBut let's be clear first. The show doesn't have the most imaginative story as it follows pretty much all the things other CGDCTs have. Instead, it's in its setting—a town with European resemblances—that gives GochiUsa a specialkind of appeal. Elegant, idyllic, and traditional, the town's architectures are adorned by timbered buildings and cobbled streets, making it a breath of a fresh air away from the usual high school setting. Really, it's the perfect environment to have some joviality. Like an \"on cloud nine\" kind of thing. And you can find out just how peaceful this show can get when you enter the Rabbit House, a café where caffeinated aromas linger about and where plenty of lightheartedness is waiting to be met.\\n\\n\r\nA place full of endearments is inviting me.\\n\\n\r\nAfter being greeted by the gentle Chino, who has an odd fluffball of a rabbit atop her head, Cocoa starts a new life in the town by working as a Rabbit House waitress. From there on, she meets the other girls, all of whom are equally as adorable, and this is where the euphoria begins to seep through my heart. There's no deep drama. No major conflicts. The setting has already established a tranquil state-of-mind prior to everything else, and that peacefulness continues to emanate throughout every episode. As a result, all the activities the girls do here—working at their cafés, partaking in silly fun, or developing their friendship and sisterly bonds—are enjoyable to watch. The fluffy atmosphere simply blankets their interactions in a way that makes me want to cuddle them.\\n\\n\r\nOr \"Mofu mofu~!\", as Cocoa will adorably say.\\n\\n\r\nThere's also one other aspect that elevates my fondness for the show. That is, each one of the girl's personality reflects the beverages in which they're named after: hot cocoa for Cocoa's comforting sweetness, cappuccino for Chino's mature and childish duality, Thé des Alizés for Rize's cute tendencies despite her strictness, uji matcha for Chiya's refined elegance, and the Kilimanjaro coffee for Sharo's insecure sensitivity toward her own image. So if you think of GochiUsa as one wholesome café, then the girls are basically its warm, little beverages. Endearing, isn't it?\\n\\n\r\nAnd to further paint the soothing image of the show in your mind, the art—while more on the average side animation-wise—utilizes its soft pastel palette harmoniously in conjunction with its visual design. I already talked about the architectural beauty of the town, so let me expand on that by saying the numerous outfits, sweets, and expressions here are some of the other things that give more delight to an already delightful setting. It's like what they say—appreciate the little things in life. Because as tiny as the aesthetic details may be, they all add up together into one pleasant whole that makes the show continuously fun to bunny-hop through each second along the way.\\n\\n\r\nThe soundtracks deserve a mention as well, as they too contribute to the easy-going atmosphere. Whether they're the fairytale-like or the restful tunes, all of them share the commonality in rejuvenating one's heart and soul, and to highlight the lovable voices of the girls at the same time. You can certainly say the audiovisual has inspired the affection within me.\\n\\n\r\nAt the end of the day, GochiUsa is a show that personifies what happy serenity is all about. It may have used the same kind of ingredients found in other CGDCTs, but the comfort it creates with its town setting and affectionate girls is distinct enough to be appealing—a charm that I like to compare with the refreshing, sweet, and tranquil atmosphere of a café.\\n\\n\r\nStart your day with coffee. End your day with this heartwarming show.",
            "date": "2019-02-16T05:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 301782,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=301782"
        },
        {
            "content": "Yeah, I'm giving Is The Order a Rabbit (ITOAR) a 10. Allow me to explain.\r\nITOAR is a 10 to me because it is the perfect embodiment of moe. I describe this show as \"Loli Heaven.\" It's got nothing but cute girls. I'll break it down now.\r\nStory: 0/10. The show explores both simple and complex things, from learning a new skill or baking bread with friends, to understanding the complex workings of forming and maintaining relationships. Each episode is a one or two vignettes that don't really follow any over-arching narrative. If you've seen Yuru Camp or Gabriel Dropout, it follows those lines. That sets itapart from say, Blend S, that at least has a general direction. I gave ITOAR a 0/10 here because, basically, there is no story. That's ok though, because you'd come to this show for all of the following things.\\n\\n\r\nArt: 10/10. Holy shit. This show is adorable. All the girls are just so fucking cute and there are so many little things that it does to pull your heartstring. From small blushes on the girls' cheeks to big smiles to the way the VAs do their lines, it's pretty damn perfect.\\n\\n\r\nSound: 8/10. The OP and ED are both super cute. I put it up there with the Blend S or Dragon Maid OPs in terms of cuteness and memorability. As I said earlier, the VAs deliver each line well. The girls tend to speak somewhat slowly, so it may be a good show if you want to practice your Japanese. I only know what I've picked up from watching anime but I could pick out phrases here and there. I take away 2 points only because the general OST in-scene isn't memorable. I can't say it's bad but it also doesn't stick out. That may not be a bad thing but I can't award points to what I don't notice.\\n\\n\r\nCharacters: 10/10. Five girls. All unique. They have a depth not often seen in your run of the mill Moe show. They're not sickly-sweet, a problem I had with Yuru Yuri, and sometimes they go through rough patches. \\n\\n\r\nEnjoyment: 10/10. I would sometimes squirm at how cute things are. Chino and Cocoa are adorable together. The rabbits everywhere, and the odd obsession with them, is great. There are a few mysteries that linger throughout the show, but it wouldn't matter to me or most if they are solved or not (to point out, I'm halfway through the show rn so I don't know if they are solved or not). \\n\\n\r\nOverall: 10/10. Hands-down one of the best moe shows out there. I posted on the anime subreddit for moe and this was one of the most recommended shows. I see why now. I understand that the show has ~7.5 at the time of this review, likely because it's not a show that someone who exclusively watches shounens or fantasies will like. But if you want moe, it's here. Chino rivals Kanna for best loli imo, which I think says something.",
            "date": "2018-11-22T23:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 294553,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3555981.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Loganyosoy",
                "username": "Loganyosoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=294553"
        },
        {
            "content": "Your usual moe and slice of life anime. Usually for anime with 12 episodes, I find that they dont spend much time with character development due to the story plot being rushed. But for this anime i must say the producers did a good job with character development in that they take the time to show each character's personality and have a distinct personality for each of them. Add comedy to this anime and it makes watching it all the more interesting and enjoying\r\nFavorite character in this series has got to be Chino. Cool and quiet personality and kawaii as well.  \r\nOverall rating I'llgive this anime a 9/10",
            "date": "2018-02-21T19:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 272141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6872532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tringapore_98",
                "username": "Tringapore_98"
            },
            "url": "https://myanimelist.net/reviews.php?id=272141"
        },
        {
            "content": "I’m going to keep this one short, If you’ve ever seen a cute slice-of-life anime before you already know what to expect with this one…\r\n     Over the duration of the anime nothing really happens, girls working in a cafe make more friends over time… thats it really! There is a tiny bit of character development doesn’t really seem to be much of a plot line to this series at all. It is simply a light-hearted story of a group of girls living their daily lives and joking around and having some laughs along the way.If your looking for an anime that you can sit back and smile at, then this maybe the one for you.\\n\\n\r\n    The characters aren’t anything special, there is the shy and quiet Chino, the very ditzy Cocoa. Sharo (who’s scared of rabbits) and a worker at the rival cafe, Chiya, who runs the rival cafe and seems to be the source of reason in the group and finally (left the best till last) Rize…\\n\\n\r\n     Rize is probably the most interesting character in the group and probably the sole reason I wanted this series through to the end. As far as characters go Rize has a few surprises, pulling Gun’s out on Cocoa in the first episode made me laugh a lot. She is slightly military obsessed, obsessed with guns, combat and all things violence. This is later explained to be down to her father who I presume is in the military and brought her up in that that kind of environment and consequently she does not have a great understanding of how ‘normal’ girls behave. Throughout the series there are comedy moments where Rize completely misunderstands normal things as something military-related but these are mixed with the moments she reveals her tender side which are very cute.\\n\\n\r\n      Music throughout the series was nice and pleasant and suited the series, nothing I’d add to my MP3 player but suited the series.\\n\\n\r\n       The animation/artwork of the series was about average, not bad but as it was not a high -budget project about the level you would expect to see.\\n\\n\r\n       Its a nice pleasant show, but with its lack of story and progression its a hard sell to say this is actually worth watching… Rize is a rather cute and amusing character which adds some good fun into the series but still isn’t enough to say this is a series worth spending the time to watch…\\n\\n\r\n      Overall I’s say its one that if your bored, you want something thats just very light hearted and happy/smiley then maybe its worth picking up, but for most of us its probably not worth the time.",
            "date": "2015-02-06T07:46:00+00:00",
            "helpful_count": 7,
            "mal_id": 179770,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4157753.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Monjoex",
                "username": "Monjoex"
            },
            "url": "https://myanimelist.net/reviews.php?id=179770"
        },
        {
            "content": "Oh hi, people. I am a person who acts like Tommy Wiseau from The Room. Since, mercury1980 is away, I instead should do a review on \"Gochuumon wa Usagi desu ka?\", the anime about cute girls in a cafe. Isn't it good, huh?\r\nHello. I would like to have a cup of coffee. - Me\r\nOh hey, I didn't know it was you. - Shop Owner\r\nThat's me. - Me\r\nThat will be 5 dollars. - Shop Owner\r\nHere you go, keep the change. Hello, Tippy. - Me\r\nSTORY (8):\r\nCocoa Hoto is a girl who moves to Rabbit House cafe where she meets Chino Kafuu. Rabbit House is owned by Chino'sdad. Cocoa Hoto tries to adapt into this environment as she learns how to prepare tea and coffee, especially what she needs to do as a waitress. Chino tries to help Cocoa as possible so that she can effectively serve customers. \\n\\n\r\nWhat an interesting story.\\n\\n\r\nART (7):\\n\\n\r\nThe animation looks normal, huh?\\n\\n\r\nSOUND (9):\\n\\n\r\nI loved the opening song \"Daydream cafe\". It has a relaxing and interesting tune, huh? I loved the ending song \"Everyday Decoration\". It has a fun tone and I loved to listen to it a lot.\\n\\n\r\nCHARACTER (9):\\n\\n\r\nI loved the way how the characters interact and bond with each other. Not only that they make each situation fun and relaxing.\\n\\n\r\nEach characters are named by tea plants.\\n\\n\r\nChino is the type of stoic girl however, she always whispers in a soft voice like it supposed to be adorable just like Kanade Tachibana from Angel Beats.\\n\\n\r\nCocoa is a normal girl. In fact, I loved the way how she behaves like an elder sister figure to Chino.\\n\\n\r\nRize Tedeza is the badass girl but a kind person who maintains order and discipline. She rejected me before when I asked her out. She is using me and I'm a fool. You're tearing me apart, Rize.\\n\\n\r\nChiya Ujimatsu talks like Azusa from Idolmaster. She has this absolutely feminine voice.\\n\\n\r\nAoyama Blue Mountain was an interesting character although she has not enough screen time. \\n\\n\r\nI loved the way how they make every situation funny to watch.\\n\\n\r\nWouldn't it be good if the other characters have more screen time and character development, huh?\\n\\n\r\nCONCLUSION (8):\\n\\n\r\nIt is good to see these characters interact and bond with each other, huh? I really enjoyed it a lot.\\n\\n\r\nIt has its own light hearted moments.\\n\\n\r\nIf you love to see cute girls doing cute things, this anime is for you. So I give this anime an 8 out of 10. Bye. Hello, rabbit, you're my favorite customer.",
            "date": "2014-06-29T00:41:00+00:00",
            "helpful_count": 7,
            "mal_id": 149217,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=149217"
        }
    ],
    [
        {
            "content": "Moe shows.  There's at least one in every season.  The simple concept of four or more girls living their daily lives in animated form is somehow so fascinating and interesting, that we are required to have one every season.  Not to make moe seem like a bad thing, but really, they're all the same.  Today, I will be reviewing the moe show of this 2013 spring season, Gochuumon wa Usagi Desu ka?  Or, Is the order a rabbit?  \r\nStory (6.33/10):  The story of Gochiusa, as it's known in its shorter form, is simple.  Cocoa, an incoming highschool student, gets transferred to what I assume to be Switzerland or some other European country in that area, in order to attend school due to the fact that her mother is working abroad, and she needs someone to take care of her.  Upon finding her new home known as the cafe \"Rabbit House\", she begins talking and making friends to the people around her, all the while surrounded by rabbits of all forms.\\n\\n\r\nWe've all seen this before.  Be it lucky star, Nichijou, Yuru Yuri, K-on, the list goes on and on.  As a base idea, Gochiusa does not separate itself from any of its sister moe anime, as the base idea of several girls living nice and charming lives has been done to death.  Every episode is done in a sort of one episode stand alone plot point, which rarely or barely serves to continue the story in any way.  To put it in simple terms, this anime is heavily episodic.  Whatever problems the characters face will only pertain to that episode alone and nothing else.  Does this mean that Gochiusa is a bad show?  Well, no.\\n\\n\r\nThis show has a few things going for it, such as an individual charm to its show that really can only be seen, not explained, as well as a very easy to follow storyline where you can watch one episode here, and another there, as there basically is none.  There is no climax, there is no true character development, (until for some reason in the last episode), and there is no convoluted plot where they have to save the world/universe with the power of love or some crap like that.  No, the plot is simply this.  Five girls spending time together.  That's it.  \\n\\n\r\nOverview:\\n\r\n+  Unique show charm\\n\r\n+  Very easy to follow storyline\\n\r\n-   Basic formulaic moe plot \\n\\n\r\nCharacters (6.55/10):  There's not much to say really about the characters.  All of the main characters are more or less troupes of moe genred girls that we've seen many times, copy pasted and given a new body and voice.  \\n\\n\r\nTo put it in perspective, here's a simple explanation for all of them.  The dumb one. (Cocoa)  The polite one. (Chiya)  The one obsessed with the military.  (Rize)  The smart young one.  (Chino)  And the poor one.  (Syaro)  While I understand that there is a lot more to these characters and traits that go far beyond what I had explained, that's really what I saw for the most part.  As you go through the series, you do learn more about who these girls are, but without any convoluted storyline or potential climax to make those traits stand out.  But really, these five are really just standard moe girls that serve no other purpose than being a girl in a moe anime.  Not to say they're bad characters, it's just that I feel they don't have very much to them beyond what we're really given.  \\n\\n\r\nAs for supporting characters, the series doesn't stray too far from the main characters in terms of individual character traits.  More or less, they're all one note characters that have a singular trait that pertains to them.  They serve their role, but really nothing more.\\n\\n\r\nThe characters in this series aren't necessarily memorable, but they serve their role.  They're not bad per say, as they fit very well with the anime and story that they were put in, but they're not deep or extremely detailed in anyway.\\n\\n\r\nOverview:\\n\r\n+/-  Generic, one note characters\\n\\n\r\nArt and Sound (7.35/10 and 6.50/10):  The art style for the series is a rather nice bright style.  Everything in the series was quite bright and colorful, reflecting on the bright and cheery style of the show.  All of the characters had the traditional moe character design of round eyes and a rather child-like look to them, as well as some fairly nice looking details in the ordinarily brightly colored background.  \\n\\n\r\nOverall, the art style of the show is quite aesthetically pleasing with its bright background details and its color coded characters.  \\n\\n\r\nThe tracks of the anime are rather...generic.  Nothing really stood out as very memorable pieces, and nothing really seemed to go beyond the normal cute sounding music that many moe shows have as their soundtrack.  The tracks weren't bad, as they did sound good, but they weren't songs that I feel like I would go back to listen to.  \\n\\n\r\nOverview:\\n\r\n+  Nice and colorful character design\\n\r\n+  Great detailed backgrounds\\n\r\n+/-  Rather generic sounding soundtrack.\\n\\n\r\nPersonal Enjoyment (6.41/10):  As with most moe shows, Gochiusa doesn't really have any other stand out plot points/characters/story.  Aside from the hundreds upon hundreds of rabbit things and rabbits, (I'm not kidding.  In every episode they make at least 5-9 things rabbit themed, from clothes, to books, movies, drinks, and even a music box.)  there wasn't really much to say in terms of individuality for the show.\\n\\n\r\nDid I like the show?  Well, I in fact did.  While originality isn't Gochiusa's strong point, the show in and of itself is entertainment.  While there were some things that weren't really explained, (such as the rabbit known as Tippy), and some of the plot points felt like serious wastes of time due to how pointless they were in comparison to the overall plot, the show has its own personal flair that some people might like.  \\n\\n\r\nIf you're not too into moe, or you don't like meaningless shows without a proper plot, (since there practically is none), then this isn't a show for you.  But, if you do like moe, or just want a nice relaxing show, than this can serve you well.  In terms of anime in general, Gochiusa is more or less a time killer.  For a moe show, this show is rather generic and standard.  (There are in fact better moe shows to watch if you want to watch one in my opinion.)\\n\\n\r\nOverall Score: (6.38/10)\\n\\n\r\nReviewer's note:  I seriously wished they didn't reference everything to rabbits.  It got redundant quite fast...",
            "date": "2014-07-07T20:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 150969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=150969"
        },
        {
            "content": "I thought this was another moeblob anime and did not start watching until it was finished airing, I WAS GRAVELY MISTAKEN.\r\nSo what does this anime have that stand out from all the other cute girls slice of life?\r\nComedy: IT IS ACTUALLY FUNNY, it doesn't try to force the comedy and let some other aspects like commonly the cuteness of characters to compensate for it. \r\nCharacters: They have depth and intelligent! The characters are not just there solely for being cute. As the story progress, you can see the changes in their relationship with each others, their thinking which they don't speak aloud, and their overallgrowth. They are more \"real\" and don't walk the fine line of cute or \"are they okay in the head?\" as the more cliche cute girl slice of life.\\n\\n\r\nAs for the more general side of things:\\n\\n\r\nStory: Slice of life. An everyday look in the lives of the cast after 1 of the main girl move into town, you will see their characters progress through events and scenes which are often comedic in nature.\\n\\n\r\nArt: Cute, warm, soft. I REALLY LIKE THE ART STYLE, CHARACTER DESIGN, the scale of characters size which made them pretty loli-ish. The setting which are inspire by the real location of Colmar France, they capture the beauty and put it in the anime.\\n\\n\r\nSound: The Op and Ed stay true to the genre, but not really my type of music.\\n\\n\r\nCharacter: I already wrote it above. A perfect combination of main cast and support characters.\\n\\n\r\nEnjoyment: I REALLY enjoy it, it put a sunshine on any cloudy day and crush any depressive mood.\\n\\n\r\nOverall: MASTERPIECE, never have i seem a cute girls slice of life executed so perfectly, with so much grace.\\n",
            "date": "2017-12-25T01:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 266328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6829210.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/alreadydead628",
                "username": "alreadydead628"
            },
            "url": "https://myanimelist.net/reviews.php?id=266328"
        },
        {
            "content": "Are you exhausted after watching an intense anime? Or do you just want to see some cute girls trying to get through everyday problems both in school, and in their personal lives?\r\nWell than Gochuumon wa usagi desu ka?( GochiUSa) or Is the order a rabbit? is the anime for you.\r\nStory 8/10- Being a Slice-of-Life/ Moe anime, the story is usually about everyday. mundane events, but due to the colorful cast and great storytelling, the story is bumped up to a 8 out of 10. Although this slife-of-life way of storytelling can create a bit of a slow pace sometimes and there really isn't any huge,earth-shaking character development, which didn't bother me all that much, but this is just a small warning.\\n\\n\r\nArt 9/10 - While also following the traditional moe style of drawing the characters, the anime has some pretty good backrounds and character designs, with colors that color code each character , For Instance, the color purple with Rize\\n\\n\r\nSound 8/10 - If there is one thing I remember about the BGM of this show it's that I really liked the use of Accordion. The Opening is super catchy and one of my favorites, although I don't really remember the ending of this season, but it probably doesn't hold a candle to the ending of the second season,... but this isn't a review on the second season.\\n\\n\r\nCharacter 9/10 - My favorite aspect of this anime has to be the character, as I absolutely enjoyed every single character in this anime, with Chino being my favorite ( Cocoa and Rize are both close seconds though). The Characters are the main driving force of this anime that keeps it going all the way to the end.\\n\\n\r\nEnjoyment 9/10- Personally, I thoroughly enjoyed this anime from start to beginning, although I may be a little biased since this is my first Moe anime, but nevertheless my opinions have never wavered. Although, if you are not at all a little entertained by slice-of-life or if you dislike the moe genre than this anime is not for you.\\n\\n\r\nOverall 9/10",
            "date": "2015-11-25T09:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 204163,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4942810.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/StrawberryHeart",
                "username": "StrawberryHeart"
            },
            "url": "https://myanimelist.net/reviews.php?id=204163"
        },
        {
            "content": "While Gochuumon wa Usagi Desu ka does not have much of a story, it's a slice of life/comedy anime about cute girls and cute activities, so that's to be expected.\r\nStory: 7/10?\r\nThere's nothing much to say about the story in this case, since there wasn't much plot. But that's not the point of these types of shows. This anime was meant to provide entertainment through supplying joy and bringing moe to its own notable level.\r\nArt: 9/10\r\nThe art was really impressive and the character designs were really cute, and captivating. The art is probably the best part of the show, since it really brings out to gentlenessof the setting and cuteness of the characters. The characters are colorful and diverse in appearance and made them all attractive in their own way too.\\n\\n\r\nSound: 8/10\\n\r\nThe thing I like about the sound the most was probably the voices. In some of these cute animes out there, all the characters almost sound exactly the same, but that wasn't the case here. I think each character had a distinctive enough voice, so that even if I were to not see the character's faces, I could tell who was talking. Also, the character's voices weren't as annoying and ear-piercing as some other moe slice of life/comedies out there. There isn't much to mention about the OP and the EDs and they aren't exactly unforgettably amazing. The background music contributed to each of their respective scenes too.\\n\\n\r\nCharacter: 9/10\\n\r\nAlong with their colorful appearances, each of the main characters also had colorful personalities. Although there wasn't lots of character development, the characters act out on their own interesting personalities which is enough to bring most people to a smile. However, there is some character development in some of the characters as they start to open up more or be more honest with themselves, but that might not be what most people pay attention to. The characters also weren't random comedic characters that were thrown together into one show and were in harmony with one another.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI was paying a lot of attention to each of the scenes in the show and actually didn't get around to listening to the BGM as much. Maybe because the BGM wasn't anything special or the scenes themselves were entertaining and distracted me from the BGM. This show was really enjoyable and I couldn't stop laughing in some scenes out of joy (also couldn't stop delighting over others because of the cuteness) even though I'm not all that much into slice of life/comedy animes without an engaging plot.\\n\\n\r\nThat being said, this show is above mostly average in terms of the comedy and slice of life genre and is amusing enough even without a truly engaging plot. And of course, this show might not fit to the tastes of some people.\\n\\n\r\nOverall=8/10",
            "date": "2015-04-07T19:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 185103,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855801.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-Neptune-",
                "username": "-Neptune-"
            },
            "url": "https://myanimelist.net/reviews.php?id=185103"
        },
        {
            "content": "My favorite anime of all time. Cuteness? Check. A variety of amazing characters? Check. Names of characters who are named after your favorite beverages? (Kafu Chino -> Cappu -ccino) (Cocoa -> Hot Cocoa) Check. Amazing soundtracks? Check. Amazing art style? Check. Good story? Well, I'll cover an eye for that one. Could not stop listening to the music of the opening's and endings, you can just hear the cuteness flowing down to your eardrums like rivers of pure vanilla flavored streams. \r\nThis is the type of anime I like the most, personally. A mix of comedy, cuteness, character development, interactions and personalities are very wellthought of. It fits in so well all in all. The only things missing from this is a season 3.",
            "date": "2016-10-19T07:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 232068,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5294493.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TwYee",
                "username": "TwYee"
            },
            "url": "https://myanimelist.net/reviews.php?id=232068"
        },
        {
            "content": "I'm going to keep this super quick because this is a pretty typical S.o.L anime. This is lighthearted, fun and cute. This is an anime where you could mix up most of the episodes (assuming you didn't change character introduction order) and get a similar experience.\r\nIf you like a heartfelt story where not a whole lot happens except that a bunch of cute adolescent girls have fun together and learn and grow as friends you will enjoy it. If you're looking for something more substantive or there to be an overarching story arc or plot then you may be disappointed.",
            "date": "2016-06-12T22:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 220635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=220635"
        },
        {
            "content": "this is my first review and so i don't know how i am even writing this.\r\ni really really really love this anime,this is an anime cute girls doing cute things.an anime full of loli's,for we,lolicons i can say this is a perfect anime!\r\ni really love this anime,and i hope that they make another season,i'll be waiting!\r\nstory 5/10 i guess,it was a normal slice of life anime,so we can't really say that this anime has a wonderfull story or something else,Art 8/10 i guess,i love this anime's art and wonderfull lolis,Sound 9/10,i didn't find anything wrong with the song,Character 10/10,like i said there are so manylolis,and the main loli is a silent kawaii white hair loli.enjoyment 10/10\\n\r\nand overall 7/10,this is a really cute anime,with cute girls,and a really really slice of lifed style story ^o^",
            "date": "2014-12-17T05:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 172689,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042345.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LilCub",
                "username": "LilCub"
            },
            "url": "https://myanimelist.net/reviews.php?id=172689"
        },
        {
            "content": "There wasn't anything particularly interesting plot-wise within Gochuumon wa Usagi Desu Ka?. \"Gochiusa\" relies completely on character design and art direction. That's right, Gochiusa is a moe anime.\r\nBut that's not always a bad thing. Every episode of Gochiusa is entertaining. It's undeniably and endlessly cute. The miniature arcs within each episode are interesting enough to keep the viewer watching. The setting is just unusual enough to keep the slice-of-life motif fresh.\r\nIf somebody doesn't like the moe aesthetic, they probably won't like this show. If somebody likes drama, plot and character development, or action, they probably won't like this show. This show is for people whowant to relax, laugh a little, and have their hearts go \"kyun,\" if you will. It is no lower than 180 proof, weapons-grade doki-doki kyun-kyun moe-moe fuwa-fuwa kawaii cute madness, and that's all it tries to be. That's all it needs to be. That's all it needs to be to get a 7/10 from me.",
            "date": "2015-07-16T18:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 193602,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3372159.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lawnmower16",
                "username": "lawnmower16"
            },
            "url": "https://myanimelist.net/reviews.php?id=193602"
        },
        {
            "content": "\"Ehhh\".\r\nI'm just basing this off episode 1 but if that was really the most effective hook to the series that they could muster then I feel my judgement is valid.\r\nIt didn't have enough of anything. The girls weren't cute enough. The dialogue was bland and unexciting even for moe crap. The aesthetics were off (you've got modern moe in a Victorian style pub setting on first episode, like c'mon man), idc if it's \"plot\" it still looked trash. Not to mention the plot in itself (or lack thereof) was trash. I know most moe shit goes for something simplistic and easily expandable but I failedto pick up on even the littlest bit of substance in the plot.\\n\\n\r\nFurther problems: Only one yuri moment... and it was undertones not actual yuri. Like if you're going to have a show this boring at least spice it up by making it go full lesbo.\\n\\n\r\nI'll give this show one thing to it's credit though; the intro and outro are actually really good. Judging by the standard of all the moe garbage I've watched, it did not fail to meet my expectations. If the show was constantly as good as the into and outro, and by that I mean just over-pandering with cute bs down my throat, then that would be easy 7.5/10.\\n\\n\r\nFor a show that handles their characters, tropes, dialogue, plot, archetypes, and cute moments perfectly (imo) check out: \"Watashi ni Tenshi ga Maiorita!\"",
            "date": "2019-04-28T16:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 307351,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7047774.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SINIU",
                "username": "SINIU"
            },
            "url": "https://myanimelist.net/reviews.php?id=307351"
        },
        {
            "content": "When it comes to CGDCT(Cute Girls Doing Cute Things) anime Gochuumon wa Usagi Desu ka? stands a hare above the rest! \r\nSeriously, this anime was fun to watch and perfect for relaxing, turn your brain off entertainment. Its the perect thing to watch after a bad day, or to put on and watch as falling asleep.\r\nThere really is no plot. The anime follows the staff at Rabbit House, a family owned coffee house, and two competing coffee houses where side characters work. \r\nOverall 8/10\r\nKawaii Power Level: Over 9000!!!!\r\nStory: 8 - While there is no real plot, the stories that unfold in each episode really workthe way they are inteded, which is functioning as an excuse to watch the characters be cute. \\n\\n\r\nArt: 9 - I really liked the art. So moe, and when you are watching a CGDCT anime moe is just what the doctor ordered.\\n\\n\r\nSound: 9 - The soundtrack works amazingly well in this anime. Playful, Youthful, and adds to the cutesy atmosphere that permeates this series.\\n\\n\r\nCharacter: 8 - While not really delving deep into the stories of who the characters are, the characters are all very likable and kawaii, which is exactly what they should be. I loved Chino, and while they didn't really explain it, I really loved how her grandpa somehow had gotten his soul stuck in the body of a Angora Rabbit.\\n\\n\r\nEnjoyment: 9 - This was a very fun show and I enjoyed watching it. If you like Cute Girls doing Cute Things genre, or want to see if the genre is your cup of tea, then put Gochuumon wa Usagi Desu ka? on your watch list ASAP.",
            "date": "2016-06-18T16:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 221118,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4933051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ElSensei",
                "username": "ElSensei"
            },
            "url": "https://myanimelist.net/reviews.php?id=221118"
        },
        {
            "content": "What is \"Is the Order a Rabbit\"? (I'll be damned if I can actually type it's Japanese title).\r\nWell if you have been following me reviews, which, makes me laugh, because no one cares to follow some rando webhole guy who joined this site a day or so ago, then you know I don't care for this rating system. I find it arbitrary and redundant; so with that said: ignore whatever rating I have given it.\r\nGotch-you-mon is the title of this offbrand Pokemon series, that involves a bunch of small girls in anime-land doing a bunch of anime-land stuff, with bottom-b**ch Chino and her faithful companionwho is too afraid to get in the Gochuball, named Tippachu.\\n\r\nOn the surface, this anime seems like nothing to write home about - unless you got a thing for small girls cause these ones are pretty adorable.  The characters are pretty bland and one dimensional for the most part. The way they react between one another almost seems predictable.\\n\r\nBut there is something about this show that wiggled it's way into my heart (much like that other show I reviewed). Yep, this anime is on my favorites list for a reason.\\n\r\nThe beginning comes off pretty slow, and I'll admit, it was hard to get invested in the show at all during the first few episodes. It felt like they had to throw something comical in just to help hold your attention while they get the setting and characters of the show set up. I nearly dropped this one if it wasn't for the fact I had already been preemptively introduced to show through means of the most absolutely adorable, \"kowfyee,\" \"Gween tea,\" \"Kowfyee,\" \"Gween Tea\" moment, and that motivated me enough to watch - at the very least - to that moment in the anime.\\n\r\nBut it was to my surprise, the charm of the anime that started bleeding it's way into my mind. I found myself waking up each morning to lines of the anime running through my head. This anime is the kind of anime you get lost in the dialogue between the characters you will more often find yourself laughing with the characters, making your roommate look over at you at your desk as he reconsiders why he decided to board with a weeaboo-otaku idiot.\\n\r\nMost of the humor is subdued, where the best hitting lines are not something you will laugh out loud with, but rather you find entertaining and help create that charm between the characters that made me fall in love with the show.\\n\r\nAnd, most definitely, the charm is there. This is probably one of the few anime ever that I have watched that I...god, it's so hard to admit this....but...I...loved...the intro theme -THERE I SAID IT! For a lonely, sad, sack of crap like myself, the theme just melts your heart and has an infectious upbeat rhythm that I think compliments the show - that is in part because the theme was actually sung by the voice cast of the main characters, which I found - again - charming.\\n\r\nThen again, I'm a simple man with uncultured plebeian tastes in anime, so I guess my opinion is wrong.\\n\\n\r\nIs the anime perfect? No.\\n\r\nShould you watch Goch-you-mon?\\n\r\nYes. Watch it, and let your cold heart melt.",
            "date": "2015-09-08T06:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 198091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4862057.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NolanAlighieri",
                "username": "NolanAlighieri"
            },
            "url": "https://myanimelist.net/reviews.php?id=198091"
        },
        {
            "content": "At first, I may have only watched it cause of Ayako (an inside joke, feel free to be confused), but this anime had a surprising amount of good moments in it. But, nothing that has enough depth for me to write a full-fledged review, so as usual, I will list it the way that most short reviews are listed.\r\nStory: 5/10\r\nAs usual, do not expect a comedy to have a good story. It only gets a five because it tackled basic comedy fare, had a good setting and so on; the usual rating that I give comedies unless they do something remarkably different.\r\nArt: 6/10\r\nThe buildings lookedreally good, but a few other things did not look as good in comparison. It has a basic art style that most modern anime have and is not doing anything too new here, either.\\n\\n\r\nSound: 5/10\\n\\n\r\nAs per usual, basic soundtrack, nothing too memorable. But, it did have two nice little piano pieces; one played at some points during a comedy scene and another usually played during a serious one.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nYup, this was where the anime shined a bit for me, and kind of makes this \"short\" review fleshed out a bit.\\n\\n\r\nI thought that Cocoa was unusually different for a protagonist, in regards to her weird nature and comedy, though she could never take anything seriously. However, that is the very essence of her character, so it is nothing to hate her for, as that was the way she was intended to be.\\n\\n\r\nBeyond Cocoa, I would say my favorite character is actually Chiya. I would have tackled her first, actually, but I usually make it a rule to note the main protagonist first before I tackle side ones. Her personality alone is almost honestly why I rated this as high as I did, as she steals the show when she is in the room with the other protagonists and I felt like she was more worthy to be a protagonist than Cocoa was. She is like a more mature version of Cocoa at times and has a hilarious sadistic side that is not overbearing at all, like the way they do most female leads that have this personality trait. Oh, and I love their choice in hair and eye color, as it was rather odd to see a brunette girl with the eyes that she had. It really made her character shine a lot.\\n\\n\r\nLastly, Megu is by far my favorite side character because of her style, voice and everything about her is highly enjoyable. She sounds like she would have an annoying voice, but it does not come off to me that way at all. I enjoyed every scene with her in it.\\n\\n\r\nAlright, that tackles the primary protagonist and favorites. The rest are nothing too special, to me anyway. That includes Chino, whom sports the usual tsundere personality, but it she is at least that way for a good reason. Rather than, you know, being a basic bitch like most of them are.\\n\\n\r\nHer other friend, Maya, has the basic tomboy personality, but like a few other characters I enjoy, I give them props for the unique hair and eye colors. Most anime normally make their eyes ALWAYS match their hair, so I thought it was cool how diverse their colors were this time around.\\n\\n\r\nHah, sorry, I just felt like tackling Chino's friends before I went back to the remaining protagonists, but Syaro was alright in this season, but she was nothing too special. She probably has the most basic design among her friends, though I suppose the next one is more simple than she is.\\n\\n\r\nRize had a more obvious tsundere personality, different from Chino's; but she does it in a more joyful kind of way. She was afraid of making new friends, to the point where she starts out by socializing with one of her stuffed animals and feels embarrassed about it shortly after. It fades rather quickly as the season progresses and her funniest traits come from her extreme fascination with weaponry and combat, though she feels this makes her look abnormal and there is a highlight on this right as you start the anime up.\\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nIt was a good comedy, did not offer anything too new in a lot of areas. But, as usual, the characters are usually the defining feature, a feat shared with nearly every little girl anime comedy out there; and they do not fail to deliver a laugh or two. But, honestly, if Chiya were not in this anime, some of these ratings on here would drastically drop.\\n\\n\r\nWatching this is up to you, but I personally think you will not like it too much if you are a veteran. However, you will not dislike it, either, as it does manage to successfully stray away from most anime cliché in a good fashion. And for any newbies, you should definitely watch this, as it is for sure a good start to your anime comedy adventure.",
            "date": "2016-03-02T07:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 212092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=212092"
        },
        {
            "content": "Well, it's the average SoL out there it's cute girls doing cute things with humor and this anime manage to do it in the average perfomance , though i have seen better ones that made me laugh a lot more and made me feel a lot more connected with the characters  so that is why im giving a 7, it has humor and it is ok overall but well as i said it is an average SoL, don't expect a K-ON or something bad either it is just in the middle, but it is really enjoyable so it fulfills the typical SoL objetive sogive it a try!",
            "date": "2018-05-26T23:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 281465,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871141.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/S5_0014_81",
                "username": "S5_0014_81"
            },
            "url": "https://myanimelist.net/reviews.php?id=281465"
        },
        {
            "content": "One of the sweetest anime about friendship. I myself love coffee, so I very much enjoyed the cafe scenery. Also, the town in which the anime is located is so picturesque that made me feel I want to visit it. The story is quiet and peaceful, and the best way to start your day. \r\nThe characters are sweet and unique without pushing it to the edges like the typical harem anime, in which each character tends to be so annoying, because they want to stand out. \r\nThe soundtracks also calm and sweet make you feel like you're inside the cafe, or in the park -they're cheerful and give you the sense of happiness. \\n\\n\r\nI'm definetely watching the 2nd season, and I recommend it to every otaku friend here, who wants to relax and enjoy a beautiful casula story with cute but not provocative girls.",
            "date": "2018-04-02T00:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 276478,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3975607.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ReikaUchiha",
                "username": "ReikaUchiha"
            },
            "url": "https://myanimelist.net/reviews.php?id=276478"
        },
        {
            "content": "Personally speaking, I like my anime to have a little more meat on its' bones than your every-day \"generic cute lolis doing generic cute loli things\" show. Despite that phrase essentially fitting Usagi perfectly, it's still enjoyable and sweet.\r\nStory: 6/10. The story is simple, and not even really that compelling, but on an episode-to-episode level it's enjoyable. There's an emphasis on wacky humor that rarely missed the mark for me; if an anime can make me chuckle consistently at least once per episode, that's good enough for me. \r\nArt: 7/10. The characters are generically moe-y, and not even really *that* well drawn, but they're cuteand distinct with one another  I did appreciate that every character had a diverse and cute wardrobe (if you're going to make a show about cute girls, I commend any show that makes the girls consistently cute). One aspect that really shone throughout the show were the backgrounds and scenery. Whenever the camera is taken off of the cast, or even sometimes when it's on the cast, you can't help but admire the gorgeously drawn and sparkling scenery. It really makes the viewer feel like they're walking along a pretty canal town themselves.\\n\\n\r\nSound: 7/10. Nothing really remarkable here. It's done well and doesn't miss the comedic beats.\\n\\n\r\nCharacter: 7/10.  The characters are sweetly designed to have their own distinct personality, even if no one really gets any deep or consistent backstory except maybe the novelist. The show meanders throughout a year in the lives of the protagonists, and while development occurs, it's small and mostly involves the growing friendships between all of them (especially Chino and Cocoa). Nothing spectacular, but done well enough that you do care about the little circle of friends.\\n\\n\r\nEnjoyment: 7/10. About half way through it becomes more enjoyable due to the expansion of the cast. The humor, as mentioned before, is cute and unobnoxious. It's a nice \"breather\" show in between something more impactful. Not something I'd rewatch, but I'm looking forward to watching season two. \\n\\n\r\nOverall: 7/10. It's fun and simple. It probably won't be at the top of anyone's list, or even in the top 5, but it's nice for when you just need to relax and watch something that doesn't require much thought. However, in comparison to other \"cute girls doing cute things\" type shows, this is definitely one of the better ones.",
            "date": "2016-01-04T14:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 207741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/380838.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ceilingotaku",
                "username": "ceilingotaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=207741"
        },
        {
            "content": "This series was really just okay.\r\nThere really isn't to much to it. It's just a slice of life anime about five girls who work at cafes and are friends. That's it.\r\nIf you like cute girls and slice of life anime, well, you've probably already seen this. \r\nIf you like those things and haven't seen this yet, go ahead and give it a watch.\r\nThis show isn't spectacular, but there were some parts I smiled at, the characters are good, but there are some major plot holes in the 'story' (if I can even bring myself to call it that). \r\nBasically, if you like cute girls doingthings, then you'll probably enjoy this show to some degree.",
            "date": "2015-06-29T14:14:00+00:00",
            "helpful_count": 0,
            "mal_id": 191731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4397951.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tetrizzle",
                "username": "Tetrizzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=191731"
        }
    ]
]