[
    [
        {
            "content": "Hakkenden draws you in through its artwork, elements of fantasy, and its moments of mystery. It was an enjoyable anime that kept me watching every week but it did not have me dying to watch it.\r\nThe storyline is definitely unique, however there is an absence of a central plot or it tends to stray from it. What kept me interested were the characters and their background stories. With the introduction of each character, there are minor plots that keep you interested, however it is usually resolved within the following episode. The storyline tends to feel like a collection of stories that are somewhat connected toa central plot however it feels mostly disconnected. \\n\\n\r\nThe characters are my reason for scoring this anime as an 8. Shino, the protagonist, is very childish however he has a sensitive and caring side that makes him very enjoyable. Sosuke, his childhood friend, maintains a calm and loyal attitude and is seen accompanying Shino mostly everywhere. He provides a balance to Shino, who would otherwise be a typical bratty protagonist. Hamaji is another childhood friend, but her presence in the story is not a prominent halfway through. She appear to be immature and demanding but later displays a level of maturity far greater than most of the characters, even the adult ones. She is a refreshing character, who although lacks a background story of her own, adds a silly and realistic feel to the story. She is a main character but acts mainly as supporting. These characters and the rest as they are introduced actually add to the story. Not only are their personalities in great variety and incredibly different from one another, but their stories are what truly make this series a great one.\\n\\n\r\nThe artwork is definitely done incredibly well. It is one of the first things that drew me in. The characters all have defining features that are immediately noticeable and match the multitude of personalities presented. The background is captured beautifully. Each district, each of the places that the characters visits are almost like a painted work of art. The artwork is the defining beauty of this series.\\n\\n\r\nHakkenden is a very good series if you don’t mind the lack of a central plot. Don’t fret though because it does keep you interested if you get into it. It does tend to leave you wondering what it all leads into, hopefully we will see a central plot in the second season.\\n\\n\\n\\n",
            "date": "2013-04-21T17:34:00+00:00",
            "helpful_count": 52,
            "mal_id": 94523,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2358249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rightyjen",
                "username": "rightyjen"
            },
            "url": "https://myanimelist.net/reviews.php?id=94523"
        },
        {
            "content": "When people make certain decisions in their lives and truly desire something, it could forever change their life, it could even come true if they worked really hard in this world to achieve it, but that’s under the understanding of our world. But, what ‘if’ you were about to die and really desired to live, what would happen? How about, some nasty or beautiful entities come and grant those wishes to keep you alive, but for a price, eveeen if the price falls upon both parties. Well in Hakkenden: Touhou Hakken Ibun that’s all possible if you truly desired it, and even then you kindahave to be in the right place at the right time. \\n\\n\r\nLuckily our main character, Shino Inuzuka exactly was wishing that, and he was just at the wrong place at the wrong time while dying from a tragic accident, but it turns in to be the right place and the right time, as he is saved by the Church’s Riou Satomi, but his price is a lot larger than any, as the boy will forever not age (forever aged 13) or die, technically an immortal, not only that he gives born to a grow who is called Murasame, who is meant to be this super powerful entity (that’s what we are led to believe), that when is called for bursts through Shino’s skin and comes out as a sword (yeah, I know weird transformation). Also, his friend, if not family is a dog and his best friend Hamaji, well we don’t know about her yet, but I suggest she is something too. Thus, their lives changed as well. He is now no longer alive, what will his life be like now?\\n\\n\r\nRight, just before we go into this review I would just like to say that, I will be marking this solely as if there wasn’t even a second season, but that doesn’t mean I won’t mention anything about it. That’s all I would like to say, so let’s get on with this review.\\n\\n\r\nStory (8/10) - Hakkenden: Touhou Hakken Ibun is a an Action, Shoujo and a Supernatural anime, with katanas and all that, which would make you think that this could have some real good battles and fighting scenes, but can I just say ‘right now’, don’t bother, if you are here for action, because you will be wasting your time. I mean don’t get me wrong it has its moments, but they don’t last long and there’s nothing really to them anyway. This anime (or this season) wasn’t based on Action and theatrics, it’s based on one big ass puzzle, with what seems to be a deep story, which is slowly, but surely coming together, and by the end you will definitely see why this anime got a second season, and what exactly is a drawing them in together, as it was hinted quite a few times throughout the series.\\n\\n\r\nThis series, while trying to tell the story goes about it really slowly with barely anything happening. Some of you viewers might give up with this anime 5 episodes in, because let’s be honest, nothing actually happens for like a good 7 to 8 episodes, for me it wasn’t till the 9th one that it really got interesting. It’s around there, that all the previous episodes start to make sense, this anime is just simply, you getting to know the characters, the feel of the story, what they are and get into the feel of it, but honestly I think it failed at getting you into it, until you get to that exact part of the series. Anyway, it’s more like a long introduction of sorts, still if you got through a whole lot of nothing then you are definitely are rewarded with a lot of mystery. I’m sure you will be going straight onto season 2 in no time just wanting to know more, and what the outcome could be, well, at least I certainly am.\\n\\n\r\nThis animes good points are its strong story and presence, while definitely giving us some good characters to enjoy as well. The characters certainly bring the story together, and there is something real deep and mystified about each character, especially, Shino Inuzuka and Sousuke Inukawa.\\n\\n\r\nI think you all will be very surprised, just how good the actually overall experience was like by the end, even if the start was such a drag.\\n\\n\r\nFor the bad points, well like I’ve said this anime literally goes nowhere for like 4 episodes, they then suddenly get sent off to another town and now have to look for beads, and you think this is where something begins but again, nothing. At first you really think something deep is going on, and shit is about to go down, but in the end it was a totally let down, seriously! You get all dumped, just for it to be all thrown away, I mean it had the entire plot there and everything and at first you think, “Wait? What? That it? Can’t be serious, right? They build it all up and even the atmosphere, just for it to end like this?” There was a real good plot, but the conclusion was very droll and boring. This is where you will strangle, because it continues to do this. There’s even a random encounter on a train and ends in them making a friend and leaving him, obviously the guy wasn’t any normal guy and there something more to it and all that, but still, makes you think “what exactly was the purpose of that guy? You know, forget that question, what was the point in the episode?” You need not worry, in the last few episodes everything begins to make sense, I can assure you.\\n\\n\r\nNow I did say that this anime is solely story more than anything, and yes that is correct, but this anime has Action in it, I mean come on! It has *flupping* demons, swords, entities and bloody deities in it, and yet nothing really badass happens, or no real challenge at all throughout the whole thing, apart from this mysterious character that doesn’t get introduced until later in the series, and he is like the first and ‘only’ real threat that I know of throughout the whole thing. I wish it done it sooner, because I honestly think people could lose patience of just how slow it progresses. Also, the actual battles are nothing all that much either, pretty standard, none interesting stuff, if they were to have a battle, I wished it could have been more intense, like maybe bring the story into the fight, make it feel that little more intense and stuff, but what do I know, huh? In the end, I think you could count the number of battles there were on your hand. I would love to make an example, but then this review wouldn’t really be spoiler free, but you will see what I mean.\\n\\n\r\nFor shoujo side of things, well I couldn’t say any girl or man wouldn’t be disappointed at all, the characters are all hot guys and that main character when his curse was lifted, my god I think when I saw him, I think I was just as stunned  as Kobungo Inuta was, haha.\\n\\n\r\nIn the end, it really just depends, if you don’t mind too much about a stories pace or anything like that, then this won’t be a problem for you, in matter of fact, it could even be fairly enjoyable and likeable as well. The story is certainly not perfect and it did have some real flaws. If you’re a person who saw Katanas, the genre, “Action and “Supernatural” and thinking it’s going to be some real fun and awesome battles, then again sorry, you are being totally miss leaded.\\n\\n\r\nArt (9/10) Art was amazing! Recently, animes art and animation have been astounding, like they really have stepped it up a notch, to something suppose from like an anime like maybe 3 or 4 years ago and I honestly think nowadays our rating on art should be a little more strict, as there are less mistakes to point out now, due to all this HD.\\n\\n\r\nStill again, this anime I just couldn’t bring this rating down any further than 9, because the art was (like I said) amazing. The entities were either, beautifully animated and well-drawn or damn right suited to their looks or name, take for example Shino’s Murasame, a crow with black feathers with this, like evil look to his eye. Then you have the deities, which look like what they were and yet so wonderfully drawn and animated, I mean you could tell them apart from maybe some normal entity or demon. Literally everything supernatural was, I would say, “stunning”, as simple as that really. That crow coming how of Shino’s arm, come on! That like creeps me out a little, what’s worse he doesn’t have any reaction to him whatsoever when it happens.\\n\\n\r\nThe actual characters were very well drawn as well, I wasn’t too keen on Hamaji’s art, but for me, I eventually didn’t mind, matter of fact I liked her art as well in the end. \\n\\n\r\nBackground was again well drawn, but nothing really special. It’s something you would expect from a 2013 anime.\\n\\n\r\n(Ignore if you wish) Damn, I hate rating backgrounds because like, who has the time to read the subtitles, look at the screen and what’s actually going on, while trying to soak in the background, when nothing happens there, argh. (End of gibberish)\\n\\n\r\nReason not for a ten is that I had one problem, it just didn’t seem right and I’m sure you viewers will feel the same way, is that when you go into a wider perspective, when like Shino is next to Shousuke, and see just how small he is to them, it felt way too weird and off at the same time, like something just wasn’t right there, he looked like a midget. However, when I saw his real form (without the curse), I honestly think the art for it was magnificent, and I truly thought it was better and it definitely suited in the crowd a lot more than in his “small boy form”. \\n\\n\r\nShino: Eh? Naaaniii?! \\n\\n\r\nSound (6/10) – One thing this anime definitely falls in is the music, the music was simply just there, the OP theme song after listening to it once makes you want to skip it every time so you can just get right in to it, doesn’t want you to stay back and listen to it. I’m sure if you keep listening to it, you might not be bothered by it, but let me just say this, if you listen to ANY music long enough, you’re going to like it by the end of it all, until you’re just sick of hearing it, wait, that’s like that with every music, oh well. One thing the OP did have which was good was the chorus, with its hard beats and up-beat chorus was definitely nice, but that’s about it.\\n\\n\r\nAs for the sounds in the anime, they were fairly good, they did add to some scenes and scenarios, so they definitely did a good job there.\\n\\n\r\nThe EP Theme Song is a little worse than even the OP, as for the OP had a nice Chorus and instruments and so did this instrument wise, but as for the lyrics and the song itself, just didn’t seem right, I ain’t going to say that it didn’t fit because the lyrics and the song is meant to resemble the anime itself.\\n\\n\r\nSo, I definitely will say for sure that the worse side of this anime is the music by far; this is something I’m hoping was done better in season 2. Also the reason for the 6 and not a 7 is purely because of the fact the year of this anime is 2013 and I honestly think music since last year has really been kicked up a notch, nearly every new anime I’ve seen has had outstanding quality of music and it’s getting harder and harder to rate, so this is the reason and I compare to today’s animes and this just isn’t up there with them on this department.\\n\\n\r\nCharacters (8/10) – The characters were surprisingly very well done, they weren’t boring, very far from it. And I’m leaving everything about the characters up to you, because this story revolves around them, but mainly the main character, but don’t they always, argh, so cliché, haha.\\n\\n\r\nAnyway, the characters are all likeable, and you knew which ones were mysterious or ominous beings. They all have something to them, and every character seems to have a part of the plot, even though it centres around Shino, which is nice to see that it ain’t just all about the main character all the time. I find that so refreshing.\\n\\n\r\nThere will be still characters that feel a little off, or know nearly nothing about, which is sad, as I wished it went it to that a bit, well I guess it did, but I just thought maybe a little more, still hopefully that gets all explained in season 2.\\n\\n\r\nThere was a problem however, it’s when a certain characters arc ends, all of a sudden what we saw in the arc, turned out to be totally different in the end, matter of fact even joking and having a laugh to make the comedic moments, which it did poor at if I might add. To be honest, it confused the hell out of me, that they turn to what they were in the arc to suddenly not giving a crap or continuing like nothing happened, I just found that so weird. Meh, it’s nothing mager but it just bugged me, so I thought I should point it out.\\n\\n\r\nEnjoyment (7/10) – Beginning stint was just a little confusing and weird at times, but they were still fun episodes to watch, just seeing how everything unravels is a nice thought. Basically this anime I don’t think was meant to be all this fun fun times, but more to immerse you within its storyline to get you to understand things, what the characters are like, their pasts and what kind of plot the series be going after, that sort of thing, and have you noticed it’s either about the story or the characters which make up the story as well. It centres around story, not action. So, if you are that kind of person, then I suggest just giving this a miss. The beginning was a drag and could make you feel a little bored, but I still think you will find yourself marching on further and further through this anime.\\n\\n\r\nFor the later stages of the anime, it kicks it up a notch by bringing an unknown being into the mix and showing us some new stuff, it was certainly a joy to watch like I’ve said so many times already throughout this review. So, if you’re watching this, just hang in there and you will be REWARDED.\\n\\n\r\nOverall (8/10) – The anime was just too slow to begin with and the viewers could well be fed up and just give up on the show, due to nothing really happening at all, and seeing even nothing during even the action doesn’t help this anime by any means, matter of fact makes it worse. Weird characters also just forgetting what just happened to them during the series and now just seem to act normal and jokingly, which is nice to see that they are doing well, but it just doesn’t seem right the way they act as if nothing has happened to them at all.\\n\\n\r\nThis anime however, is good at telling a story, it gives you lovely backgrounds on characters, gives a deep storyline that is slowly but surely coming together, which longs the enjoyment for more content, amazing characters and meaning. Even the connection with the whole bead business, it really does make for an interesting show to watch, and when you finally get the last few episodes, then you’re going to enjoy this anime even more and makes you feel like you understand what was going on earlier and why they went the way they went with the show, and it doesn’t make It all that confusing anymore, not only that, it actually gives you more good times than anything, it’s dark, it’s deep and it’s mysterious, how about that, hey?\\n\\n\r\nI’ve said quite a few times already, but I will say it again, this anime is NOT for people who are looking for just some awesome action and good fun fun times because you’re not going to get it, however if you are a person who wants to have a real story based, then this is it, or just want something that is a little mysterious then this has it as well, or just want a deep story and awesome characters, then again this anime has it. It’s simply about the story and the characters, nothing more or less.\\n\\n\r\nI recommend this to anyone, who is anything about story and for people who like shoujo and all that, I also would recommend this to people who like a deep mystery with mysterious characters. And I don’t recommend to anyone who want something less serious or action and beefy time, because it just ain’t going to work out for you.",
            "date": "2013-08-18T09:20:00+00:00",
            "helpful_count": 29,
            "mal_id": 110175,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1225197.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Komirai",
                "username": "Komirai"
            },
            "url": "https://myanimelist.net/reviews.php?id=110175"
        },
        {
            "content": "Hakkenden: Eight Dogs of the East, But Went South Fast\r\nThis is one of the rare occasions where I'll say a series fascinated me but bored me to death at the same time. I'm not sure how that's possible, but Hakkenden managed to pull it off. This series is slightly misleading from the get go and it never really got off the ground.\r\nThis series is about a pair of friends, who consider themselves \"brothers\" that each possess a special power after their lives had been saved five years prior to the current plot. Shino Inuzuka is a boy/young man that possesses the sword Murasame in hisbody and takes the shape of a crow. However, as a result, his body does not age and he remains in the form of a 12-year-old boy. Sousuke Inukawa is a young man the same age that takes the form of a dog and it is later discovered in the series that there is a problem with his spirit (which I will not spoil). Together, they live with another girl they consider to be their sister named Hamaji, who also faced a tragedy from her past that brought her together with Shino and Sousuke. The three of them are taken in by Rio Saotome, a priest from the high church and while in his custody, Shino is on a mission to collect the eight beads that are the same as his and Sousuke's beads. Each bead has a different passage on it, what each means...is yet to be determined.\\n\\n\r\nThere isn't much I can say on the positive side of Hakkenden other than I found the premise to be pretty interesting and the music to be downright awesome. I'll admit, this series did keep me interested in what these \"Eight Dogs of the East\" were and what powers they shared. This series was captivating from its OPs and EDs, giving the impression that this series was going to have an interesting story AND excellent shounen elements...even if it is somewhat shounen-ai. I found the music to generally be pretty good, especially with its OPs and EDs. The OP is a song called God FATE performed by Faylan, who I consider to be one of my personal favorite J-pop artists in the industry right now. My only beef with the OP in regards to the song choice is that it does not fit the vibe of the series very well. Hakkenden is a very slow-paced, character driven series with not a whole lot of action. However, the upbeat song with flashy OP visuals gives this series the impression that its a fast-paced shounen series. While the OP is enjoyable, it's a bit of a false advertisement for what you're going to get with the series. The ED is actually one of the better EDs I've seen in a while. While it isn't visually stunning, it is pretty to look at with a pretty cool song to boot, \"String of Pain\" by Tetsuya Kakihara. It's actually kind of funny in retrospect when you realize the person singing the ED song is also doing the voice of Shino...and sounds almost nothing like him. The ED does a nice job showing off each character...but that's about all it accomplishes. Otherwise, the music by Hitomi Kuroishi is pretty solid and fits the theme of the series...which are a couple things I'll give her props for considering her most notable works outside of this series are Code Geass and Last Exile.\\n\\n\r\nAs for the negatives, when I said this series bored me to death, it was because there is almost no story progression whatsoever. If you just watched the first three episodes and the last three episodes, I'd almost be willing to bet you'd be able to pick up on everything that's happened throughout the series. It felt like this first season focused more on character introduction with some slight development around the two leads. It's a little hard to explain, but while I found the characters to be at least somewhat interesting, the pacing of this series didn't reveal a whole lot about them besides their exterior personalities. While yes, I'm aware each character that was introduced did come with their own internal monologue, the way this series was paced felt too slow and didn't really dwell on each character enough. It didn't seem to implement the supporting characters into the over-arcing story very well either. From a production standpoint, there wasn't anything very remarkable about the animation or voice acting. There are quite a few familiar seiyuu's, like the aforementioned Tetsuya Kakihara (Natsu from Fairy Tail, Gaul from Dog Days, Simon from Gurren Lagann), Satoshi Hino (Akito from Bakuman, Koukin from Ikkitousen, Yuji from Shakugan no Shana), and Hiroshi Kamiya (Yuzuru from Angel Beats, Koyomi from the Monogatari series). However, I wouldn't call their performances in this to be all that compelling.\\n\\n\r\nAll-in-all, I'm really not sure what's going on with Studio Deen. It seems like they keep pushing out mediocre series after mediocre series with a hidden gem here and there. Unfortunately, I have to put this series along with the blandly average. It's really a shame because this series did have a ton of potential. It had a very interesting plot and the production values are pretty good on the OP and ED, although a bit misleading. However, again this story seems to struggle due to its horrifically slow pace with a non-existent story progression. While I tend to enjoy animes that are more character driven than story driven, this was one of the few rare occasions where I felt it put a little too much focus on certain characters, not enough on others, and had moments where it felt like there was unnecessary padding. As far as a recommendation for this series, I'd have to say to wait until the 2nd season comes out this summer. The series does a nice job of introducing the characters but is extremely slow with its story progression. I just have the impression that this whole series (including 2nd season) would be easier to marathon than watch and wait for a 2nd season. If you enjoyed something like Katanagatari or shounen-ai animes, I might recommend this...but again, I'd say wait for the 2nd season to finish first to see if it's really something you'd want to invest your time into.",
            "date": "2013-04-01T10:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 91939,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=91939"
        },
        {
            "content": "Hakkenden is a seriously underrated fantasy series that has extremely vivid, beautifully animated characters with distinctive designs and storylines. I was personally drawn by how every character had such an extensive backstory and how all the characters were woven together in a charming, intriguing way through the main protagonists. There's a good balance between magical elements as well as emotional, romantic, and comedic moments. The main plotline does tend to stray, but the individuality of each sideplot is fascinating enough that the series continues at a good pace. Again, the art is possibly this show's greatest strength--there's a stunning use of color in both thecharacter designs and the settings, and the style is smooth and consistent throughout both seasons of the show. There's a little bit of everything within this story, with almost all types of characters touched upon.",
            "date": "2015-06-01T20:26:00+00:00",
            "helpful_count": 18,
            "mal_id": 189371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4400497.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ospreyghost13",
                "username": "ospreyghost13"
            },
            "url": "https://myanimelist.net/reviews.php?id=189371"
        },
        {
            "content": "“One day,I will also find myself dwelling on unfulfilled promises,as I live on alone by myself?”\r\nTo stay the same forever, frozen in time can be frightening,contrary to the popular belief that to obtain “eternal youth”  is the ultimate goal, for most of us it can be a curse.\r\n At first I was conflicted writing a review about this anime, however, watching more episodes, I got quite warmed up to it.\r\n  Hakkenden is adapted from the manga with the same name, created by Abe Miyuki, who is known for her yaoi and shonen-ai mangas, as well as her sense of humor andwit. That also explains the shonen-ai \"hints\" that appear from time to time, fortunately without being  over the board and without straying from the main plot.\\n\\n\r\n  The series begins in a quite dramatic way, with a scenery covered by flames, while two children and a dog are severly wounded, especially a young boy who lays on the ground, dressed in a blood-stained kimono. Suddenly, a young man appears, offering the boy the option to choose between dying without protecting his friends, or letting a ayakashi (spirit,demon) take over his body. The boy chooses to live and to save his friends, but pays a heavy price, his growth process is stopped,making him stuck in his child form for eternity.\\n\r\n    While the story unfolds, we find out about the existence of the Four Beast Clan, which become very important later in the story, since they are the center of the conflict between humans (the power being held by the church) and yokai. To fight the demons,the church chose four children to wield the power of ancient,powerful beasts,in order to protect humanity.\\n\r\n   However,the story is by far original, being based on a classical Japanese novel \"Nanso Satomi Hakkenden\" by Bakin Kyokutei Takizawa. As if that wasn't enough,it has been animated already twice, in different forms. I could say that this current form has been mordernized for the current audience, but I think it could have been better. Even so,after episode 5 we can see some improvement in the story, focusing more on the choices of characters and the consequences.\\n\r\nStory: 5\\n\\n\r\n    My first impression of the characters was decent, at times they were quite enjoyable, especially the young girl, Hamaji, which has quite shows to be quite  mature, posessing observational skills. His brattiness may a temper, for example, even when kidnapped, she remains calm, presearving her composure, asking impossible demands with a straight, poker face. The main character, Shino Inuzuka, may appears as your usual brat, but at times, he have been perserved by the \"curse\" of wielding the power of one of the four beasts,Murasame, that retains him from growing up.\\n\r\n   There is also the loyal  Sousuke Inukawa, that as his family name reflects,has the loyalty of a dog (quite literally,since he can also tranform into one). Other characters start to emerge as Satomi (the one who saved Shino), Kobungo Inuta (whose brother has the same beast seal as Shino) and Kaname Osaki ( who fancies Hamaji's unlady-like but charming personality) however until now they remain quite underdeveloped. In my opinion, it is one of the weakest points in the series, since I consider the plot and characters the most important parts of an anime. However, little by little, the plot thickens, and the characters have to start making decisions that help them develop.\\n\r\nCharacters: 6\\n\\n\r\n  One of the highlights of the anime is the design and animation, the mangaka provided an eye-catching character design ( she specialises in it,since she is a shonen-ai mangaka) as well as the Showa era inspired sceneries,costumes etc.   Studio Deen specialises in fantasy-inspired worlds such as Fate/stay night and Amatsuki,delighting the eyes of the 2013 audince thorugh its bright coloured sceneries,almost as if emanating warmth from each light, each nunance.\\n\r\nArt:8\\n\\n\r\n  The music from the first episodes is not extraordinary, but after that, it starts to pick up the pace, becoming more and more interesting and accomodating the atmosphere.\\n\r\nMusic:7\\n\\n\r\n  Maybe I became less exigent with this anime,therefore my enjoyment was decent.\\n\r\nEnjoyment:6\\n\\n\r\nOverall: 6",
            "date": "2013-02-21T10:38:00+00:00",
            "helpful_count": 17,
            "mal_id": 87455,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/195069.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/-Ereya-",
                "username": "-Ereya-"
            },
            "url": "https://myanimelist.net/reviews.php?id=87455"
        },
        {
            "content": "Hakkenden: Touhou Hakken Ibun is an historical and supernatural anime that revolves around the story of 18 years old Inuzuka Shino, Inukawa Sousuke, and Murasame. Inuzuka Shino was supposed to be dead 5 years ago without the help of Saitome Riou. Riou 'implanted' Murasame in Shino's body to have a second chance in life but the price was that Shino will never die and will always be trapped in a 13 years old body of his. Inukawa Sousuke was also revived but had to live in a consequences of having half of his soul was gone and have the ability of transforming to a dognamed Yoshiro. \\n\\n\r\nHakkenden: Touhou Hakken Ibun is a masterpiece in its own league, having the perfect collaboration within the characters like Sousuke being a big brother to Shino, Riou's superiority to Shino, and many more; and also the perfect layout of unfolding and revealing mysteries such as Ao being Sousuke's shadow, Murasame's true form, Riou's claim of its his duty to give his blood to Shino, and all the bead holders' last names have \"Inu\" in them and have the same situations on how they had the beads.\\n\\n\r\nUnlike in supernatural animes, Hakkenden: Touhou Hakken Ibun has a unique point of master-demons relationships. For example, Murasame and other demons are very vengeful to the people who harmed their masters, very dangerous when they sensed someone threatening their masters' safety, and very obedient to their masters. An example of this was Murasame devouring Shouichi when Shouichi shot Shino at his neck, causing Shino to be dead; Yatsufusa's obedience towards Rio, Hibiki's over protectiveness towards Ayane, Yukihime's possessiveness towards Inuyama Dousetsu and the casual relationship between the Five Foxes and Osaki Kaname. Also, the element of transforming a human to a demon without going berserk and claiming to be \"good demons\" like Inuta Kobungo and Inukai Genpachi. \\n\\n\r\nWhat Hakkenden: Touhou Hakken Ibun fun to watch is the relationship of the characters to each other and the personality of each, which made a good balancing in the anime. In other animes, portraying the relationship of the characters in details can sometimes makes the story draggging and boring but in this case, it was different. It had a flavor of a good balance of relationships without inserting some dramatic events. \\n\\n\r\nThe protagonist's, Shino's, growth can be seen as well. At that start of the series, Shino will always be seen in Sousuke's side but later on, Shino hanging out to the other characters and meet other people like Kouhaku, and also the realization of the world, like Shino's statement to Kouhaku: “I didn’t understand that there are people who didn’t fear death, but instead falter at that thought of living.”\\n\\n\r\nOverall, Hakkende: Touhou Hakken Ibun is strongly recommended for the people who are carving in a different ride of supernatural animes. There are no girls pairing up to these beautiful boys but these boys are pairing up each other themselves (xD); Shino's clingy attitude towards Sousuke and Genpachi's love to Shino. Of course, there's an exception, Hamaji's and Kaname's love to each other (Kaname said himself that he wants to marry Hamaji when she is old enough to marry)\\n\\n\r\n“I told you that I’m afraid of dying, but I think being left all alone in this world is much more painful than death. However, if only there’d be someone by my side to hold my hand, then I’m sure I’d neither fear the thought of life nor death.” -Shino Inuzuka",
            "date": "2014-12-14T23:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 172339,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4068291.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tachibanahotarou",
                "username": "tachibanahotarou"
            },
            "url": "https://myanimelist.net/reviews.php?id=172339"
        },
        {
            "content": "With only five episodes out Hakkenden has already given itself a good reputation. The animation is smooth, the art is clean, and the story has a great basis with an interesting cast of characters. However character development so far is good it can easily get better. Overall this anime has a lot of potential. I look forward to typing up a new hopefully better review when the series ends.",
            "date": "2013-02-05T10:45:00+00:00",
            "helpful_count": 12,
            "mal_id": 85961,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2103421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/schoolstuck",
                "username": "schoolstuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=85961"
        },
        {
            "content": "I am by no means an anime-connoisseur. I tried to watch Death Note and Berserk because it is so highly recommended but it was too intense for my taste. I am mentioning it here so that it may serve as a measuring stick. That said, now to Hakkenden. \r\nWithout revealing too much,  Shino Inuzuka who is the focal point of this anime, is an 18 year old stuck in the body of a 13 year old due to demonic sword Murasame. Around Shino are his companions whose connections to each other are still not 100% clear as of the end of the first season.This mysterious connection of the characters is the main plot. There in lies the only weakness of this anime in my opinion. \\n\r\nAt the end of the 13th episode We still do not exactly know what is going on, who is really the bad guy and what the good guys are supposed to do.  And that despite the fact that we are introduced the first bits of plot information within the first few minutes of the first episode. Also, even though the first season has ended, it is for sure that we have been not introduced to all the characters as yet.  This all happens not because the plot is ingeniously intricate but rather because it is handled sloppily.  Though it did not really bother me, instead of furthering the main plot, unrelated sub plots are pursued, ending the first season not really on a cliffhanger but rather incomplete. \\n\r\nI really enjoyed the art. Very eye pleasing characters all around. Also what I appreciated A LOT was the female characters did not annoy me with the usual weak, help me, support me, I am the damsel demeanor, or the obligatory forced pull-push romance. Hamaji for instance is the main female character. She is strong willed, smart, strong and compassionate. While flirtatious, she is not a character to lose her own being in romance. To my perception she is also not one of those extra dense female characters where the romantic interest all but stick his tongue into her mouth and she still doesn't get the news that he likes her. No, as far as I perceived Hamaji does understand very well Osaki likes her, but she chooses education before romantic mush.\\n\r\nThere are slight undertones of Shounen Ai, so if you are allergic to it, beware. \\n\r\nI liked the music. I am not a very musical person so all I can say is in my opinion music was used very well to enhance the general atmosphere and the specific scenic effects of the anime. Also I liked the opening and the ending songs.\\n\r\nI really enjoyed this anime. Apart from the eye pleasing art and ear pleasing music, despite the plot holes, it had the right balance of humor, fantasy, mystery, adventure and angst for me. Like I said at the beginning, I can't take too much of \"excitement/fantasy\". That is also valid for too mushy romances or nothing but stupid laugh humor. Maybe it means I have no taste or maybe I am too average. Whatever it may be, this anime spoke to my tastes. And the fact a second season was announced pretty much soon also helped. Without a second season it would have annoyed me a lot as many many many things in it are still unsolved/unresolved.\\n\r\nOverall, I recommend it. It is almost like a pop corn movie. You are engaged while you are watching it, because it is interesting and entertaining without ruffling too many feathers but you don't feel the stomach churning excitement waiting for the next episode.\\n\\n\\n\\n",
            "date": "2013-04-28T11:50:00+00:00",
            "helpful_count": 11,
            "mal_id": 95231,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lilithilk",
                "username": "lilithilk"
            },
            "url": "https://myanimelist.net/reviews.php?id=95231"
        },
        {
            "content": "Life is short and I will only give you an honest and straight forward opinion. I enjoyed this anime's artwork, style, and concept until at one point the boy-love tone made me hit the kill switch. What is with the \"mother dresses her son up as a girl to make him a better person\" rubbish? Why do you have to destroy a decent story with all that side stuff? I have not completed this anime and never will based on my personal integrity on what a decent story should entail.",
            "date": "2015-04-24T22:41:00+00:00",
            "helpful_count": 10,
            "mal_id": 186411,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/236140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Twacka",
                "username": "Twacka"
            },
            "url": "https://myanimelist.net/reviews.php?id=186411"
        },
        {
            "content": "Honestly at first I don't have any high anticipation with this anime because firstly,I never heard of this anime and secondly I don't feel interested with the synopsis BUT after I watched through season 1,I find myself dragged into the anime and eventually,I FELL IN LOVE with it.\r\nArt : 10/10\r\nTo tell the truth,I was a really picky person especially the art.I would dropped the anime if I don't satisfied with the art so,believe me,this anime is one of the best art I ever seen and I watched the anime until the end prove it plus I gave 10/10 for the art.\r\nSound 10/10\r\nActually i never careabout the sound but when I watched this anime,I want to download almost all the songs here and I noticed this anime also use a lot of different sound and songs in every event and episodes.Maybe this is why I don't easily get bored when watching this anime.\\n\\n\r\nCharacter 10/10\\n\r\nAha!For all the girls out there,there is a lot of BISHOUNEN guys here and I'm sure it would make you want to watch them more and more!!But anticipate more in season 2 since there is a lot of their action in season 2.\\n\\n\r\nEnjoyment 10/10\\n\r\nI think this anime is a fanservice for girls and I don't know if it suitable for boys to watch it but for shounen-ai lovers such as me,I absolutely enjoy this anime since there is a lot of shounen-ai hints.(>.",
            "date": "2015-01-07T01:38:00+00:00",
            "helpful_count": 8,
            "mal_id": 176605,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4362455.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/icchan8",
                "username": "icchan8"
            },
            "url": "https://myanimelist.net/reviews.php?id=176605"
        },
        {
            "content": "Story 8/10 \r\nThe story involves an eighteen year old guy named Shino Inuzuka\r\nHe is one of the only three survivors of the destruction of Otsuka Village. He possesses the living sword of Murasame, which is controlled by his right arm. He is immortal and is stuck in his 13 year old body, so he often gets treated like he's a little child. He is terrified of bugs and has an obsession with cleanliness, due to him being raised in a sterile place.\r\nFive years ago, everyone in the village seemed to die of an illness. This plague casued for several deaths. So apparently there were 3survivors: Shino Inuzuka, Sousuke Inukawa, They took shelter in a church on the outskirts of another village by a dark and dangerous forest\\n\\n\r\nArt 10/10\\n\r\nYes! I give it a ten. No more or less. The art of the eyes are astounding! I like how the lashes of Shino were so appealing. \\n\\n\r\nCharacter 7/10\\n\r\nSadly, I thought I would be into other characters too but I couldn't seem to bring myself to enjoy them at all. I was aware of the beauty they were creating during the series but there was something lacking... but aside from that there were strong bonds too between the characters.\\n\\n\r\nEnjoyment 7/10\\n\r\nI wish it had a deeper story, yet it was an interesting plot. The series just throws you into its world, a weird mix of old and modern Japan with supernatural beasts running about with no real explanation whatsoever\\n\\n\r\nSound 6/10\\n\r\nHakkenden: Touhou Hakken Ibun, I don't really have anything to say about the sound effects etc. Meaning: I don't think it was that great at all. \\n\\n\\n\r\n\"Promising to do something tomorrow with someone is the same as promising that you'll be alive tomorrow.''",
            "date": "2017-04-04T11:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 244601,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069087.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mervollo",
                "username": "mervollo"
            },
            "url": "https://myanimelist.net/reviews.php?id=244601"
        },
        {
            "content": "Before I start my review, to anyone who cannot tolerate shounen-ai, you probably shouldn't watch this. It doesn't say so in its genre or tags, but the friendship and brotherhood between the main characters implies shounen-ai. It's in almost every episode, and for someone who can't tolerate anything homosexual, it's best if you don't press play. Additionally, Abe Miyuki changed its original magazine to one famous for BL, so it's possible that in the future, real male on male relationships will come into the story.\r\nPersonally, I like shounen-ai and yaoi, so I have nothing bad to say about this anime except this: Hakkenden is sortof an anime that is slow with its plot progress. You have to wait a couple of episodes to see where the story really comes from. It's mainly just character introductions. It takes a while for you to put everything together, but it's fun to watch because of its comedy and bishounens (everyone's practically a bishounen in this series). I like all the characters, mainly their backgrounds and how they came to have their spirits.\\n\\n\r\nI can't wait for the 2nd season in July 2013! I want to see more of everyone. I think the 2nd season will focus more on the real plot, the last episode already came out for this season, and I think it's just the beginning of everything. The real plot finally started to come out.\\n\\n\r\nThe story's unique, but progressing could be better = 9\\n\r\nThe art's by Miyuki-sensei, author of Super Lovers, so of course = 10\\n\r\nI like the seiyuus voice, except Shino's voice is sort of annoying when he whines = 9\\n\r\nCharacters are all cool, with different backgrounds and personal stories = 9\\n\r\nI like shounen-ai and bishounens, as well as youkai/spirits = 9\\n\r\nOverall = 9, it's not as great as Naruto or anything, but it's good enough like Uchuu Kyoudai to keep me interested every week.\\n\\n\r\nIt's better to watch this if you like canon pairings in an anime that's not even genre-d as shounen-ai.",
            "date": "2013-04-01T17:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 91997,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1756759.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/thefujoshi",
                "username": "thefujoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=91997"
        },
        {
            "content": "I just have to give it a 10 and nothing else. The plot is simply amazing, fitting exactly into the 13 episodes. It was well written and drawn, nothing like some anime that were trying to fit five hundred billion plots into 13 episodes. Just saying. \r\nI enjoyed the bromance feeling between the two characters and the caring feelings they harbored for each other. It is not necessary to ship them or anything to feel their caring relationships.\r\nThe anime have just the right amount of action, drama, and funny moments. It also have decent/modern art that just can't even be compared to the art from90's. No offence. \\n\\n\r\nSo for all the fans of anime out there that judge an anime base on its art, I would say that this anime is for you.\\n\r\nStill not sure? Then check the list I came up with, if most of them are what you like, then this anime might be for you:\\n\\n\r\n1. Action\\n\r\n2. Male Mc\\n\r\n3. Mostly Male casts\\n\r\n4. Without pathetic girls\\n\r\n5. Cool action scenes\\n\r\n6. No Harem/Ecchi/Reverse Harem (Finally, without those BOING BOING sounds that just ruin my experiences)\\n\r\n7. Bromance\\n\r\n8. Decent drawing and attracting plots\\n\\n\r\nSo all in all, definitely give this anime a try!",
            "date": "2016-07-31T18:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 225555,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337921.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kadrian",
                "username": "Kadrian"
            },
            "url": "https://myanimelist.net/reviews.php?id=225555"
        },
        {
            "content": "In this reflective, often sweet, occasionally unsettling anime, friends Shino, Sousuke, and Hamaji are the sole survivors of a fire that destroyed their entire village—except that Shino and Sousuke had to meld their souls with animals in order to survive. Shino now has a god in the form of a demon crow (that can turn into a sword) living inside him, which prevents him from aging, and Sousuke can turn into a dog. Now working for the Church, the three of them travel to the capital to investigate demon-related crimes, and they keep having chance encounters with other people with similarly tragic backstories who alsohave spirits living inside them.\\n\\n\r\nClearly, the story here is a little hard to explain: the story takes a while to get going and is confusing once it does. To quote a character in the actual anime, “Jeez, I was already taken aback by that strange eyeball, and now there’s this Sacred Dog. The world is full of surprises.”\\n\\n\r\nRegardless, I enjoyed this anime more and more as it went on (and especially into season 2) because the characters are the real draw here, particularly the two leads. Shino and Sousuke’s relationship is a mix between a married couple, brothers, parent-child, and best friends (who cuddle a lot). Another character remarks that Shino draws people “like a magnet,” and that certainly was the case for me. The characters are all beautiful, and I found they became more interesting the longer I knew them. I also enjoyed all the shounen-ai hints and jokes.",
            "date": "2014-06-27T09:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 148939,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384487.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shadowfireflame",
                "username": "shadowfireflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=148939"
        },
        {
            "content": "\"Loneliness is something whimsical and cruel\"\r\nHakkenden is an anime consisting of spirits and demons, however it focuses more on action whether it be socially or physically (fighting) rather than focusing on logic and the specific details of how these demons exist. Shino, an 18 year old boy who has the permanent body of a non-aging 13 year old boy. This works to his benefit due to his personality and characteristics resembling a child. Shino is what makes the show, he's the lovable little main character; and almost everything is about him. His child hood friend Sosuke (18) accompanies him, and they have a best friend/ brother relationship despite the differences in their appearance.\\n\\n\r\nThe anime immediately gives viewers a general idea of what the characters personalities are like within the first few episodes. From that point, it is up to the viewer to decide whether they will be able to build some sort of connection with the characters, or if the characters do not appeal to them. \\n\\n\r\nAlthought Hakkenden has a bad starting impression, it picks up rather quickly after the first few episodes. The age difference in terms of appearance between Sosuke and Shino makes it hard to see them as best friends and more as the older brother and little brother. Though many will claim there is a bountiful amount of fan service I'd disagree, Shino's just simply a little kid. The story itself implied that him and Sousuke were really close to begin with; it's not weird that two guys hug unless people purposely view it that way... That's just something I'd like to put out there.\\n\\n\r\nThe OP/ED are alright nothing spectacular, but there were two excellent songs inserted  into different episodes to fit the scene. When I say amazing I mean lyrically and vocally, it was a great bonus.\\n\r\nThe art's relatively pretty and satisfying; I feel there is a slight bit of fan service for Shino fan's. Though, the art does make the anime shine and it is one of the most prominent features of the anime.\\n\r\nThe title picture for the anime doesn't do the art justice, I like the look of the characters in the anime much better than what the title picture portrays. \\n\\n\r\nLONG STORY SHORT: Give the anime a shot if you think you'll like the characters; mostly Shino. The story line for the anime is decent enough that the viewer can enjoy the anime and be interested, but not good enough to jump out of your seat applauding.\\n\r\nI find myself re-watching a lot of episodes just simply because they're either really funny or adorable moments. \\n\\n\r\nThere is a season 2 which is out, and it seems very promising. The anime definitely needed more than 13 episodes to complete itself, so I'd definitely give season 2 a shot if you even slightly liked season 1.\\n\\n\r\nI thoroughly enjoyed this anime for it's simplicity, aesthetics, and characters.\\n\\n\\n",
            "date": "2013-08-06T23:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 108597,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2446429.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NostalgiaCrisis",
                "username": "NostalgiaCrisis"
            },
            "url": "https://myanimelist.net/reviews.php?id=108597"
        },
        {
            "content": "I was talking to a friend about Ten (Tenna Toori no Kaidanji) after I finished reading it. Our conversation led to a discussion about the characters, which is when I brought up \"Genpachi\". It turned out the character in Ten is named \"Ginji\", which left me with some very important questions... Just who the hell is Genpachi? Where did I get that name from? It was quite troubling. I Googled \"Genpachi\" and found out about this anime. \r\nTo sum it up, this anime is all over the place. It's just a mess. The story starts off with some people dying in a fire, then somemystery man hands a crying girl a katana with the opportunity to live instead of die. From that day forth, a girl becomes a guy, a man and dog get fused (he gets convenient transformation powers), and the girl forgets everything about the incident while the dead girl/boy shoulders the responsibility. Or at least that's what I made of it. \\n\r\nThey live a simple life in some town. The boy has a pet Niizuma Eiji (literally), he's friends with some river god and frog master, and he gets some fuzzy eyeball that he can't get rid of. Meanwhile, the church has kidnapped the girl, so they must go to town and get her back. Never mind, she went there of her own free will. By the way, there's an evil church of monks torturing a guy who slit his own throat and shot himself in the head. Somebody save him! Too late, he turned into some demon and is going to eat the boy. Or at least that's what we thought. The monks followed after him and fired off a bunch of arrows, resulting in our brave heroes falling into the river and the monks giving up on the chase. I dunno what happened to that old frog dude, but the show is now about some sort of dog fetish. Luckily, the guy who kidnapped the girl is a good guy and he finished off the evil monk. Suicide guy and his bro are now shirtless at the battlescene. I'm not sure why, but they just are. All's well that ends well. \\n\\n\r\nI just want to emphasize the senseless script in this show again. The boy detects enemies, so he turns his crow into a sword and swings the door open to reveal that they're surrounded by the evil monks wielding bows and arrows. He is the only one with a weapon at this point and you think he's gonna be a hero. Someone else kicks up a floor board to reveal some hidden katanas and he dispenses them to everyone else. The boy steps back and lets the big boys handle things, then the dog fusion guy holds the boy's hand and runs off to safety. They spend the remainder of the battle being absent. \\n\r\nHonestly, what the fuck just happened? He went from courageous hero to indecisive punk to molested little boy all within the span of a few minutes. How did this happen?\\n\\n\r\nThe adult male characters in this show are pretty. The setting is some traditional Japanese era where trains and industry have just been introduced. Cool setting and pretty characters, that's about it. The animation is subpar, especially when the animals are talking (their mouths just stay open and sounds come out). \\n\\n\r\nThis show also puts a ton of effort into having characters react to things in the opposite way you'd expect them to, which is supposed to be funny. Now laugh! Basically, if you're gonna watch this show, you should start it up on some stupid whim like I did. That way, you won't feel cheated when you find out the plot was written on similarly stupid whims.\\n\r\nSeriously, I couldn't watch the whole thing. When the \"plot\" advances, you just kinda put a handful of popcorn in your mouth and say \"Oh, I see.\"",
            "date": "2013-10-28T21:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 118637,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Danno",
                "username": "Danno"
            },
            "url": "https://myanimelist.net/reviews.php?id=118637"
        },
        {
            "content": "The anime, is a fantasy and adventure genre.\r\nthe Story: \r\nthe story fro me is pretty engaging, there is mystery and fun. through there are moments where, i feel like the story is dragging or unnecessary. Those times are very few and usually has foreshadowing for something, so its all good\r\nCharacters: \r\nthere are quite a number of characters, but most of them are fleshed out and are reasonable and quite likable. The main Character is likable, he's not perfect he has his bratty moments but its tolerable and at least he's pretty capable.\r\nArt and sound:\r\nthe art is really good, detailed vibrant colors. Its really well madeand easy on the eyes. the soundtrack is pretty nice not really catchy but in the moments in the anime, the music is quite pleasing,\\n\\n\r\noverall:\\n\r\nGive the this anime a try its pretty good, fair warning there is quite a bit of Bromance",
            "date": "2017-02-08T06:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 240153,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5201796.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Merpo",
                "username": "Merpo"
            },
            "url": "https://myanimelist.net/reviews.php?id=240153"
        },
        {
            "content": "As a precursor, please forgive me if I have similar comments to any other reviewers; I have not read any of the reviews for this particular anime.\r\nThe quality of this anime really sneaks up on you.. At first when I started watching, it seemed like just another bishounen typical anime; but after watching a few more episodes, the story and characters have more depth than I first expected. The subtle comedy makes it even more enjoyable on a lighthearted level as well.  \r\nOn a side note: is it just me, or are some of the characters totally reminiscent of Kyou Kara Maoh?? Just forbeginners - Shino and Sousuke ~ Yuuri and Conrad?\\n\r\nWas this on purpose? In any case, I loved KKM so it doesn't bother me so much as it is amusing.",
            "date": "2014-02-21T04:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 133331,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308760.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/acktgirl01",
                "username": "acktgirl01"
            },
            "url": "https://myanimelist.net/reviews.php?id=133331"
        }
    ],
    [
        {
            "content": "Hakkenden draws you in through its artwork, elements of fantasy, and its moments of mystery. It was an enjoyable anime that kept me watching every week but it did not have me dying to watch it.\r\nThe storyline is definitely unique, however there is an absence of a central plot or it tends to stray from it. What kept me interested were the characters and their background stories. With the introduction of each character, there are minor plots that keep you interested, however it is usually resolved within the following episode. The storyline tends to feel like a collection of stories that are somewhat connected toa central plot however it feels mostly disconnected. \\n\\n\r\nThe characters are my reason for scoring this anime as an 8. Shino, the protagonist, is very childish however he has a sensitive and caring side that makes him very enjoyable. Sosuke, his childhood friend, maintains a calm and loyal attitude and is seen accompanying Shino mostly everywhere. He provides a balance to Shino, who would otherwise be a typical bratty protagonist. Hamaji is another childhood friend, but her presence in the story is not a prominent halfway through. She appear to be immature and demanding but later displays a level of maturity far greater than most of the characters, even the adult ones. She is a refreshing character, who although lacks a background story of her own, adds a silly and realistic feel to the story. She is a main character but acts mainly as supporting. These characters and the rest as they are introduced actually add to the story. Not only are their personalities in great variety and incredibly different from one another, but their stories are what truly make this series a great one.\\n\\n\r\nThe artwork is definitely done incredibly well. It is one of the first things that drew me in. The characters all have defining features that are immediately noticeable and match the multitude of personalities presented. The background is captured beautifully. Each district, each of the places that the characters visits are almost like a painted work of art. The artwork is the defining beauty of this series.\\n\\n\r\nHakkenden is a very good series if you don’t mind the lack of a central plot. Don’t fret though because it does keep you interested if you get into it. It does tend to leave you wondering what it all leads into, hopefully we will see a central plot in the second season.\\n\\n\\n\\n",
            "date": "2013-04-21T17:34:00+00:00",
            "helpful_count": 52,
            "mal_id": 94523,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2358249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rightyjen",
                "username": "rightyjen"
            },
            "url": "https://myanimelist.net/reviews.php?id=94523"
        },
        {
            "content": "When people make certain decisions in their lives and truly desire something, it could forever change their life, it could even come true if they worked really hard in this world to achieve it, but that’s under the understanding of our world. But, what ‘if’ you were about to die and really desired to live, what would happen? How about, some nasty or beautiful entities come and grant those wishes to keep you alive, but for a price, eveeen if the price falls upon both parties. Well in Hakkenden: Touhou Hakken Ibun that’s all possible if you truly desired it, and even then you kindahave to be in the right place at the right time. \\n\\n\r\nLuckily our main character, Shino Inuzuka exactly was wishing that, and he was just at the wrong place at the wrong time while dying from a tragic accident, but it turns in to be the right place and the right time, as he is saved by the Church’s Riou Satomi, but his price is a lot larger than any, as the boy will forever not age (forever aged 13) or die, technically an immortal, not only that he gives born to a grow who is called Murasame, who is meant to be this super powerful entity (that’s what we are led to believe), that when is called for bursts through Shino’s skin and comes out as a sword (yeah, I know weird transformation). Also, his friend, if not family is a dog and his best friend Hamaji, well we don’t know about her yet, but I suggest she is something too. Thus, their lives changed as well. He is now no longer alive, what will his life be like now?\\n\\n\r\nRight, just before we go into this review I would just like to say that, I will be marking this solely as if there wasn’t even a second season, but that doesn’t mean I won’t mention anything about it. That’s all I would like to say, so let’s get on with this review.\\n\\n\r\nStory (8/10) - Hakkenden: Touhou Hakken Ibun is a an Action, Shoujo and a Supernatural anime, with katanas and all that, which would make you think that this could have some real good battles and fighting scenes, but can I just say ‘right now’, don’t bother, if you are here for action, because you will be wasting your time. I mean don’t get me wrong it has its moments, but they don’t last long and there’s nothing really to them anyway. This anime (or this season) wasn’t based on Action and theatrics, it’s based on one big ass puzzle, with what seems to be a deep story, which is slowly, but surely coming together, and by the end you will definitely see why this anime got a second season, and what exactly is a drawing them in together, as it was hinted quite a few times throughout the series.\\n\\n\r\nThis series, while trying to tell the story goes about it really slowly with barely anything happening. Some of you viewers might give up with this anime 5 episodes in, because let’s be honest, nothing actually happens for like a good 7 to 8 episodes, for me it wasn’t till the 9th one that it really got interesting. It’s around there, that all the previous episodes start to make sense, this anime is just simply, you getting to know the characters, the feel of the story, what they are and get into the feel of it, but honestly I think it failed at getting you into it, until you get to that exact part of the series. Anyway, it’s more like a long introduction of sorts, still if you got through a whole lot of nothing then you are definitely are rewarded with a lot of mystery. I’m sure you will be going straight onto season 2 in no time just wanting to know more, and what the outcome could be, well, at least I certainly am.\\n\\n\r\nThis animes good points are its strong story and presence, while definitely giving us some good characters to enjoy as well. The characters certainly bring the story together, and there is something real deep and mystified about each character, especially, Shino Inuzuka and Sousuke Inukawa.\\n\\n\r\nI think you all will be very surprised, just how good the actually overall experience was like by the end, even if the start was such a drag.\\n\\n\r\nFor the bad points, well like I’ve said this anime literally goes nowhere for like 4 episodes, they then suddenly get sent off to another town and now have to look for beads, and you think this is where something begins but again, nothing. At first you really think something deep is going on, and shit is about to go down, but in the end it was a totally let down, seriously! You get all dumped, just for it to be all thrown away, I mean it had the entire plot there and everything and at first you think, “Wait? What? That it? Can’t be serious, right? They build it all up and even the atmosphere, just for it to end like this?” There was a real good plot, but the conclusion was very droll and boring. This is where you will strangle, because it continues to do this. There’s even a random encounter on a train and ends in them making a friend and leaving him, obviously the guy wasn’t any normal guy and there something more to it and all that, but still, makes you think “what exactly was the purpose of that guy? You know, forget that question, what was the point in the episode?” You need not worry, in the last few episodes everything begins to make sense, I can assure you.\\n\\n\r\nNow I did say that this anime is solely story more than anything, and yes that is correct, but this anime has Action in it, I mean come on! It has *flupping* demons, swords, entities and bloody deities in it, and yet nothing really badass happens, or no real challenge at all throughout the whole thing, apart from this mysterious character that doesn’t get introduced until later in the series, and he is like the first and ‘only’ real threat that I know of throughout the whole thing. I wish it done it sooner, because I honestly think people could lose patience of just how slow it progresses. Also, the actual battles are nothing all that much either, pretty standard, none interesting stuff, if they were to have a battle, I wished it could have been more intense, like maybe bring the story into the fight, make it feel that little more intense and stuff, but what do I know, huh? In the end, I think you could count the number of battles there were on your hand. I would love to make an example, but then this review wouldn’t really be spoiler free, but you will see what I mean.\\n\\n\r\nFor shoujo side of things, well I couldn’t say any girl or man wouldn’t be disappointed at all, the characters are all hot guys and that main character when his curse was lifted, my god I think when I saw him, I think I was just as stunned  as Kobungo Inuta was, haha.\\n\\n\r\nIn the end, it really just depends, if you don’t mind too much about a stories pace or anything like that, then this won’t be a problem for you, in matter of fact, it could even be fairly enjoyable and likeable as well. The story is certainly not perfect and it did have some real flaws. If you’re a person who saw Katanas, the genre, “Action and “Supernatural” and thinking it’s going to be some real fun and awesome battles, then again sorry, you are being totally miss leaded.\\n\\n\r\nArt (9/10) Art was amazing! Recently, animes art and animation have been astounding, like they really have stepped it up a notch, to something suppose from like an anime like maybe 3 or 4 years ago and I honestly think nowadays our rating on art should be a little more strict, as there are less mistakes to point out now, due to all this HD.\\n\\n\r\nStill again, this anime I just couldn’t bring this rating down any further than 9, because the art was (like I said) amazing. The entities were either, beautifully animated and well-drawn or damn right suited to their looks or name, take for example Shino’s Murasame, a crow with black feathers with this, like evil look to his eye. Then you have the deities, which look like what they were and yet so wonderfully drawn and animated, I mean you could tell them apart from maybe some normal entity or demon. Literally everything supernatural was, I would say, “stunning”, as simple as that really. That crow coming how of Shino’s arm, come on! That like creeps me out a little, what’s worse he doesn’t have any reaction to him whatsoever when it happens.\\n\\n\r\nThe actual characters were very well drawn as well, I wasn’t too keen on Hamaji’s art, but for me, I eventually didn’t mind, matter of fact I liked her art as well in the end. \\n\\n\r\nBackground was again well drawn, but nothing really special. It’s something you would expect from a 2013 anime.\\n\\n\r\n(Ignore if you wish) Damn, I hate rating backgrounds because like, who has the time to read the subtitles, look at the screen and what’s actually going on, while trying to soak in the background, when nothing happens there, argh. (End of gibberish)\\n\\n\r\nReason not for a ten is that I had one problem, it just didn’t seem right and I’m sure you viewers will feel the same way, is that when you go into a wider perspective, when like Shino is next to Shousuke, and see just how small he is to them, it felt way too weird and off at the same time, like something just wasn’t right there, he looked like a midget. However, when I saw his real form (without the curse), I honestly think the art for it was magnificent, and I truly thought it was better and it definitely suited in the crowd a lot more than in his “small boy form”. \\n\\n\r\nShino: Eh? Naaaniii?! \\n\\n\r\nSound (6/10) – One thing this anime definitely falls in is the music, the music was simply just there, the OP theme song after listening to it once makes you want to skip it every time so you can just get right in to it, doesn’t want you to stay back and listen to it. I’m sure if you keep listening to it, you might not be bothered by it, but let me just say this, if you listen to ANY music long enough, you’re going to like it by the end of it all, until you’re just sick of hearing it, wait, that’s like that with every music, oh well. One thing the OP did have which was good was the chorus, with its hard beats and up-beat chorus was definitely nice, but that’s about it.\\n\\n\r\nAs for the sounds in the anime, they were fairly good, they did add to some scenes and scenarios, so they definitely did a good job there.\\n\\n\r\nThe EP Theme Song is a little worse than even the OP, as for the OP had a nice Chorus and instruments and so did this instrument wise, but as for the lyrics and the song itself, just didn’t seem right, I ain’t going to say that it didn’t fit because the lyrics and the song is meant to resemble the anime itself.\\n\\n\r\nSo, I definitely will say for sure that the worse side of this anime is the music by far; this is something I’m hoping was done better in season 2. Also the reason for the 6 and not a 7 is purely because of the fact the year of this anime is 2013 and I honestly think music since last year has really been kicked up a notch, nearly every new anime I’ve seen has had outstanding quality of music and it’s getting harder and harder to rate, so this is the reason and I compare to today’s animes and this just isn’t up there with them on this department.\\n\\n\r\nCharacters (8/10) – The characters were surprisingly very well done, they weren’t boring, very far from it. And I’m leaving everything about the characters up to you, because this story revolves around them, but mainly the main character, but don’t they always, argh, so cliché, haha.\\n\\n\r\nAnyway, the characters are all likeable, and you knew which ones were mysterious or ominous beings. They all have something to them, and every character seems to have a part of the plot, even though it centres around Shino, which is nice to see that it ain’t just all about the main character all the time. I find that so refreshing.\\n\\n\r\nThere will be still characters that feel a little off, or know nearly nothing about, which is sad, as I wished it went it to that a bit, well I guess it did, but I just thought maybe a little more, still hopefully that gets all explained in season 2.\\n\\n\r\nThere was a problem however, it’s when a certain characters arc ends, all of a sudden what we saw in the arc, turned out to be totally different in the end, matter of fact even joking and having a laugh to make the comedic moments, which it did poor at if I might add. To be honest, it confused the hell out of me, that they turn to what they were in the arc to suddenly not giving a crap or continuing like nothing happened, I just found that so weird. Meh, it’s nothing mager but it just bugged me, so I thought I should point it out.\\n\\n\r\nEnjoyment (7/10) – Beginning stint was just a little confusing and weird at times, but they were still fun episodes to watch, just seeing how everything unravels is a nice thought. Basically this anime I don’t think was meant to be all this fun fun times, but more to immerse you within its storyline to get you to understand things, what the characters are like, their pasts and what kind of plot the series be going after, that sort of thing, and have you noticed it’s either about the story or the characters which make up the story as well. It centres around story, not action. So, if you are that kind of person, then I suggest just giving this a miss. The beginning was a drag and could make you feel a little bored, but I still think you will find yourself marching on further and further through this anime.\\n\\n\r\nFor the later stages of the anime, it kicks it up a notch by bringing an unknown being into the mix and showing us some new stuff, it was certainly a joy to watch like I’ve said so many times already throughout this review. So, if you’re watching this, just hang in there and you will be REWARDED.\\n\\n\r\nOverall (8/10) – The anime was just too slow to begin with and the viewers could well be fed up and just give up on the show, due to nothing really happening at all, and seeing even nothing during even the action doesn’t help this anime by any means, matter of fact makes it worse. Weird characters also just forgetting what just happened to them during the series and now just seem to act normal and jokingly, which is nice to see that they are doing well, but it just doesn’t seem right the way they act as if nothing has happened to them at all.\\n\\n\r\nThis anime however, is good at telling a story, it gives you lovely backgrounds on characters, gives a deep storyline that is slowly but surely coming together, which longs the enjoyment for more content, amazing characters and meaning. Even the connection with the whole bead business, it really does make for an interesting show to watch, and when you finally get the last few episodes, then you’re going to enjoy this anime even more and makes you feel like you understand what was going on earlier and why they went the way they went with the show, and it doesn’t make It all that confusing anymore, not only that, it actually gives you more good times than anything, it’s dark, it’s deep and it’s mysterious, how about that, hey?\\n\\n\r\nI’ve said quite a few times already, but I will say it again, this anime is NOT for people who are looking for just some awesome action and good fun fun times because you’re not going to get it, however if you are a person who wants to have a real story based, then this is it, or just want something that is a little mysterious then this has it as well, or just want a deep story and awesome characters, then again this anime has it. It’s simply about the story and the characters, nothing more or less.\\n\\n\r\nI recommend this to anyone, who is anything about story and for people who like shoujo and all that, I also would recommend this to people who like a deep mystery with mysterious characters. And I don’t recommend to anyone who want something less serious or action and beefy time, because it just ain’t going to work out for you.",
            "date": "2013-08-18T09:20:00+00:00",
            "helpful_count": 29,
            "mal_id": 110175,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1225197.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Komirai",
                "username": "Komirai"
            },
            "url": "https://myanimelist.net/reviews.php?id=110175"
        },
        {
            "content": "Hakkenden: Eight Dogs of the East, But Went South Fast\r\nThis is one of the rare occasions where I'll say a series fascinated me but bored me to death at the same time. I'm not sure how that's possible, but Hakkenden managed to pull it off. This series is slightly misleading from the get go and it never really got off the ground.\r\nThis series is about a pair of friends, who consider themselves \"brothers\" that each possess a special power after their lives had been saved five years prior to the current plot. Shino Inuzuka is a boy/young man that possesses the sword Murasame in hisbody and takes the shape of a crow. However, as a result, his body does not age and he remains in the form of a 12-year-old boy. Sousuke Inukawa is a young man the same age that takes the form of a dog and it is later discovered in the series that there is a problem with his spirit (which I will not spoil). Together, they live with another girl they consider to be their sister named Hamaji, who also faced a tragedy from her past that brought her together with Shino and Sousuke. The three of them are taken in by Rio Saotome, a priest from the high church and while in his custody, Shino is on a mission to collect the eight beads that are the same as his and Sousuke's beads. Each bead has a different passage on it, what each means...is yet to be determined.\\n\\n\r\nThere isn't much I can say on the positive side of Hakkenden other than I found the premise to be pretty interesting and the music to be downright awesome. I'll admit, this series did keep me interested in what these \"Eight Dogs of the East\" were and what powers they shared. This series was captivating from its OPs and EDs, giving the impression that this series was going to have an interesting story AND excellent shounen elements...even if it is somewhat shounen-ai. I found the music to generally be pretty good, especially with its OPs and EDs. The OP is a song called God FATE performed by Faylan, who I consider to be one of my personal favorite J-pop artists in the industry right now. My only beef with the OP in regards to the song choice is that it does not fit the vibe of the series very well. Hakkenden is a very slow-paced, character driven series with not a whole lot of action. However, the upbeat song with flashy OP visuals gives this series the impression that its a fast-paced shounen series. While the OP is enjoyable, it's a bit of a false advertisement for what you're going to get with the series. The ED is actually one of the better EDs I've seen in a while. While it isn't visually stunning, it is pretty to look at with a pretty cool song to boot, \"String of Pain\" by Tetsuya Kakihara. It's actually kind of funny in retrospect when you realize the person singing the ED song is also doing the voice of Shino...and sounds almost nothing like him. The ED does a nice job showing off each character...but that's about all it accomplishes. Otherwise, the music by Hitomi Kuroishi is pretty solid and fits the theme of the series...which are a couple things I'll give her props for considering her most notable works outside of this series are Code Geass and Last Exile.\\n\\n\r\nAs for the negatives, when I said this series bored me to death, it was because there is almost no story progression whatsoever. If you just watched the first three episodes and the last three episodes, I'd almost be willing to bet you'd be able to pick up on everything that's happened throughout the series. It felt like this first season focused more on character introduction with some slight development around the two leads. It's a little hard to explain, but while I found the characters to be at least somewhat interesting, the pacing of this series didn't reveal a whole lot about them besides their exterior personalities. While yes, I'm aware each character that was introduced did come with their own internal monologue, the way this series was paced felt too slow and didn't really dwell on each character enough. It didn't seem to implement the supporting characters into the over-arcing story very well either. From a production standpoint, there wasn't anything very remarkable about the animation or voice acting. There are quite a few familiar seiyuu's, like the aforementioned Tetsuya Kakihara (Natsu from Fairy Tail, Gaul from Dog Days, Simon from Gurren Lagann), Satoshi Hino (Akito from Bakuman, Koukin from Ikkitousen, Yuji from Shakugan no Shana), and Hiroshi Kamiya (Yuzuru from Angel Beats, Koyomi from the Monogatari series). However, I wouldn't call their performances in this to be all that compelling.\\n\\n\r\nAll-in-all, I'm really not sure what's going on with Studio Deen. It seems like they keep pushing out mediocre series after mediocre series with a hidden gem here and there. Unfortunately, I have to put this series along with the blandly average. It's really a shame because this series did have a ton of potential. It had a very interesting plot and the production values are pretty good on the OP and ED, although a bit misleading. However, again this story seems to struggle due to its horrifically slow pace with a non-existent story progression. While I tend to enjoy animes that are more character driven than story driven, this was one of the few rare occasions where I felt it put a little too much focus on certain characters, not enough on others, and had moments where it felt like there was unnecessary padding. As far as a recommendation for this series, I'd have to say to wait until the 2nd season comes out this summer. The series does a nice job of introducing the characters but is extremely slow with its story progression. I just have the impression that this whole series (including 2nd season) would be easier to marathon than watch and wait for a 2nd season. If you enjoyed something like Katanagatari or shounen-ai animes, I might recommend this...but again, I'd say wait for the 2nd season to finish first to see if it's really something you'd want to invest your time into.",
            "date": "2013-04-01T10:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 91939,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=91939"
        },
        {
            "content": "Hakkenden is a seriously underrated fantasy series that has extremely vivid, beautifully animated characters with distinctive designs and storylines. I was personally drawn by how every character had such an extensive backstory and how all the characters were woven together in a charming, intriguing way through the main protagonists. There's a good balance between magical elements as well as emotional, romantic, and comedic moments. The main plotline does tend to stray, but the individuality of each sideplot is fascinating enough that the series continues at a good pace. Again, the art is possibly this show's greatest strength--there's a stunning use of color in both thecharacter designs and the settings, and the style is smooth and consistent throughout both seasons of the show. There's a little bit of everything within this story, with almost all types of characters touched upon.",
            "date": "2015-06-01T20:26:00+00:00",
            "helpful_count": 18,
            "mal_id": 189371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4400497.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ospreyghost13",
                "username": "ospreyghost13"
            },
            "url": "https://myanimelist.net/reviews.php?id=189371"
        },
        {
            "content": "“One day,I will also find myself dwelling on unfulfilled promises,as I live on alone by myself?”\r\nTo stay the same forever, frozen in time can be frightening,contrary to the popular belief that to obtain “eternal youth”  is the ultimate goal, for most of us it can be a curse.\r\n At first I was conflicted writing a review about this anime, however, watching more episodes, I got quite warmed up to it.\r\n  Hakkenden is adapted from the manga with the same name, created by Abe Miyuki, who is known for her yaoi and shonen-ai mangas, as well as her sense of humor andwit. That also explains the shonen-ai \"hints\" that appear from time to time, fortunately without being  over the board and without straying from the main plot.\\n\\n\r\n  The series begins in a quite dramatic way, with a scenery covered by flames, while two children and a dog are severly wounded, especially a young boy who lays on the ground, dressed in a blood-stained kimono. Suddenly, a young man appears, offering the boy the option to choose between dying without protecting his friends, or letting a ayakashi (spirit,demon) take over his body. The boy chooses to live and to save his friends, but pays a heavy price, his growth process is stopped,making him stuck in his child form for eternity.\\n\r\n    While the story unfolds, we find out about the existence of the Four Beast Clan, which become very important later in the story, since they are the center of the conflict between humans (the power being held by the church) and yokai. To fight the demons,the church chose four children to wield the power of ancient,powerful beasts,in order to protect humanity.\\n\r\n   However,the story is by far original, being based on a classical Japanese novel \"Nanso Satomi Hakkenden\" by Bakin Kyokutei Takizawa. As if that wasn't enough,it has been animated already twice, in different forms. I could say that this current form has been mordernized for the current audience, but I think it could have been better. Even so,after episode 5 we can see some improvement in the story, focusing more on the choices of characters and the consequences.\\n\r\nStory: 5\\n\\n\r\n    My first impression of the characters was decent, at times they were quite enjoyable, especially the young girl, Hamaji, which has quite shows to be quite  mature, posessing observational skills. His brattiness may a temper, for example, even when kidnapped, she remains calm, presearving her composure, asking impossible demands with a straight, poker face. The main character, Shino Inuzuka, may appears as your usual brat, but at times, he have been perserved by the \"curse\" of wielding the power of one of the four beasts,Murasame, that retains him from growing up.\\n\r\n   There is also the loyal  Sousuke Inukawa, that as his family name reflects,has the loyalty of a dog (quite literally,since he can also tranform into one). Other characters start to emerge as Satomi (the one who saved Shino), Kobungo Inuta (whose brother has the same beast seal as Shino) and Kaname Osaki ( who fancies Hamaji's unlady-like but charming personality) however until now they remain quite underdeveloped. In my opinion, it is one of the weakest points in the series, since I consider the plot and characters the most important parts of an anime. However, little by little, the plot thickens, and the characters have to start making decisions that help them develop.\\n\r\nCharacters: 6\\n\\n\r\n  One of the highlights of the anime is the design and animation, the mangaka provided an eye-catching character design ( she specialises in it,since she is a shonen-ai mangaka) as well as the Showa era inspired sceneries,costumes etc.   Studio Deen specialises in fantasy-inspired worlds such as Fate/stay night and Amatsuki,delighting the eyes of the 2013 audince thorugh its bright coloured sceneries,almost as if emanating warmth from each light, each nunance.\\n\r\nArt:8\\n\\n\r\n  The music from the first episodes is not extraordinary, but after that, it starts to pick up the pace, becoming more and more interesting and accomodating the atmosphere.\\n\r\nMusic:7\\n\\n\r\n  Maybe I became less exigent with this anime,therefore my enjoyment was decent.\\n\r\nEnjoyment:6\\n\\n\r\nOverall: 6",
            "date": "2013-02-21T10:38:00+00:00",
            "helpful_count": 17,
            "mal_id": 87455,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/195069.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/-Ereya-",
                "username": "-Ereya-"
            },
            "url": "https://myanimelist.net/reviews.php?id=87455"
        },
        {
            "content": "Hakkenden: Touhou Hakken Ibun is an historical and supernatural anime that revolves around the story of 18 years old Inuzuka Shino, Inukawa Sousuke, and Murasame. Inuzuka Shino was supposed to be dead 5 years ago without the help of Saitome Riou. Riou 'implanted' Murasame in Shino's body to have a second chance in life but the price was that Shino will never die and will always be trapped in a 13 years old body of his. Inukawa Sousuke was also revived but had to live in a consequences of having half of his soul was gone and have the ability of transforming to a dognamed Yoshiro. \\n\\n\r\nHakkenden: Touhou Hakken Ibun is a masterpiece in its own league, having the perfect collaboration within the characters like Sousuke being a big brother to Shino, Riou's superiority to Shino, and many more; and also the perfect layout of unfolding and revealing mysteries such as Ao being Sousuke's shadow, Murasame's true form, Riou's claim of its his duty to give his blood to Shino, and all the bead holders' last names have \"Inu\" in them and have the same situations on how they had the beads.\\n\\n\r\nUnlike in supernatural animes, Hakkenden: Touhou Hakken Ibun has a unique point of master-demons relationships. For example, Murasame and other demons are very vengeful to the people who harmed their masters, very dangerous when they sensed someone threatening their masters' safety, and very obedient to their masters. An example of this was Murasame devouring Shouichi when Shouichi shot Shino at his neck, causing Shino to be dead; Yatsufusa's obedience towards Rio, Hibiki's over protectiveness towards Ayane, Yukihime's possessiveness towards Inuyama Dousetsu and the casual relationship between the Five Foxes and Osaki Kaname. Also, the element of transforming a human to a demon without going berserk and claiming to be \"good demons\" like Inuta Kobungo and Inukai Genpachi. \\n\\n\r\nWhat Hakkenden: Touhou Hakken Ibun fun to watch is the relationship of the characters to each other and the personality of each, which made a good balancing in the anime. In other animes, portraying the relationship of the characters in details can sometimes makes the story draggging and boring but in this case, it was different. It had a flavor of a good balance of relationships without inserting some dramatic events. \\n\\n\r\nThe protagonist's, Shino's, growth can be seen as well. At that start of the series, Shino will always be seen in Sousuke's side but later on, Shino hanging out to the other characters and meet other people like Kouhaku, and also the realization of the world, like Shino's statement to Kouhaku: “I didn’t understand that there are people who didn’t fear death, but instead falter at that thought of living.”\\n\\n\r\nOverall, Hakkende: Touhou Hakken Ibun is strongly recommended for the people who are carving in a different ride of supernatural animes. There are no girls pairing up to these beautiful boys but these boys are pairing up each other themselves (xD); Shino's clingy attitude towards Sousuke and Genpachi's love to Shino. Of course, there's an exception, Hamaji's and Kaname's love to each other (Kaname said himself that he wants to marry Hamaji when she is old enough to marry)\\n\\n\r\n“I told you that I’m afraid of dying, but I think being left all alone in this world is much more painful than death. However, if only there’d be someone by my side to hold my hand, then I’m sure I’d neither fear the thought of life nor death.” -Shino Inuzuka",
            "date": "2014-12-14T23:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 172339,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4068291.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tachibanahotarou",
                "username": "tachibanahotarou"
            },
            "url": "https://myanimelist.net/reviews.php?id=172339"
        },
        {
            "content": "With only five episodes out Hakkenden has already given itself a good reputation. The animation is smooth, the art is clean, and the story has a great basis with an interesting cast of characters. However character development so far is good it can easily get better. Overall this anime has a lot of potential. I look forward to typing up a new hopefully better review when the series ends.",
            "date": "2013-02-05T10:45:00+00:00",
            "helpful_count": 12,
            "mal_id": 85961,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2103421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/schoolstuck",
                "username": "schoolstuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=85961"
        },
        {
            "content": "I am by no means an anime-connoisseur. I tried to watch Death Note and Berserk because it is so highly recommended but it was too intense for my taste. I am mentioning it here so that it may serve as a measuring stick. That said, now to Hakkenden. \r\nWithout revealing too much,  Shino Inuzuka who is the focal point of this anime, is an 18 year old stuck in the body of a 13 year old due to demonic sword Murasame. Around Shino are his companions whose connections to each other are still not 100% clear as of the end of the first season.This mysterious connection of the characters is the main plot. There in lies the only weakness of this anime in my opinion. \\n\r\nAt the end of the 13th episode We still do not exactly know what is going on, who is really the bad guy and what the good guys are supposed to do.  And that despite the fact that we are introduced the first bits of plot information within the first few minutes of the first episode. Also, even though the first season has ended, it is for sure that we have been not introduced to all the characters as yet.  This all happens not because the plot is ingeniously intricate but rather because it is handled sloppily.  Though it did not really bother me, instead of furthering the main plot, unrelated sub plots are pursued, ending the first season not really on a cliffhanger but rather incomplete. \\n\r\nI really enjoyed the art. Very eye pleasing characters all around. Also what I appreciated A LOT was the female characters did not annoy me with the usual weak, help me, support me, I am the damsel demeanor, or the obligatory forced pull-push romance. Hamaji for instance is the main female character. She is strong willed, smart, strong and compassionate. While flirtatious, she is not a character to lose her own being in romance. To my perception she is also not one of those extra dense female characters where the romantic interest all but stick his tongue into her mouth and she still doesn't get the news that he likes her. No, as far as I perceived Hamaji does understand very well Osaki likes her, but she chooses education before romantic mush.\\n\r\nThere are slight undertones of Shounen Ai, so if you are allergic to it, beware. \\n\r\nI liked the music. I am not a very musical person so all I can say is in my opinion music was used very well to enhance the general atmosphere and the specific scenic effects of the anime. Also I liked the opening and the ending songs.\\n\r\nI really enjoyed this anime. Apart from the eye pleasing art and ear pleasing music, despite the plot holes, it had the right balance of humor, fantasy, mystery, adventure and angst for me. Like I said at the beginning, I can't take too much of \"excitement/fantasy\". That is also valid for too mushy romances or nothing but stupid laugh humor. Maybe it means I have no taste or maybe I am too average. Whatever it may be, this anime spoke to my tastes. And the fact a second season was announced pretty much soon also helped. Without a second season it would have annoyed me a lot as many many many things in it are still unsolved/unresolved.\\n\r\nOverall, I recommend it. It is almost like a pop corn movie. You are engaged while you are watching it, because it is interesting and entertaining without ruffling too many feathers but you don't feel the stomach churning excitement waiting for the next episode.\\n\\n\\n\\n",
            "date": "2013-04-28T11:50:00+00:00",
            "helpful_count": 11,
            "mal_id": 95231,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lilithilk",
                "username": "lilithilk"
            },
            "url": "https://myanimelist.net/reviews.php?id=95231"
        },
        {
            "content": "Life is short and I will only give you an honest and straight forward opinion. I enjoyed this anime's artwork, style, and concept until at one point the boy-love tone made me hit the kill switch. What is with the \"mother dresses her son up as a girl to make him a better person\" rubbish? Why do you have to destroy a decent story with all that side stuff? I have not completed this anime and never will based on my personal integrity on what a decent story should entail.",
            "date": "2015-04-24T22:41:00+00:00",
            "helpful_count": 10,
            "mal_id": 186411,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/236140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Twacka",
                "username": "Twacka"
            },
            "url": "https://myanimelist.net/reviews.php?id=186411"
        },
        {
            "content": "Honestly at first I don't have any high anticipation with this anime because firstly,I never heard of this anime and secondly I don't feel interested with the synopsis BUT after I watched through season 1,I find myself dragged into the anime and eventually,I FELL IN LOVE with it.\r\nArt : 10/10\r\nTo tell the truth,I was a really picky person especially the art.I would dropped the anime if I don't satisfied with the art so,believe me,this anime is one of the best art I ever seen and I watched the anime until the end prove it plus I gave 10/10 for the art.\r\nSound 10/10\r\nActually i never careabout the sound but when I watched this anime,I want to download almost all the songs here and I noticed this anime also use a lot of different sound and songs in every event and episodes.Maybe this is why I don't easily get bored when watching this anime.\\n\\n\r\nCharacter 10/10\\n\r\nAha!For all the girls out there,there is a lot of BISHOUNEN guys here and I'm sure it would make you want to watch them more and more!!But anticipate more in season 2 since there is a lot of their action in season 2.\\n\\n\r\nEnjoyment 10/10\\n\r\nI think this anime is a fanservice for girls and I don't know if it suitable for boys to watch it but for shounen-ai lovers such as me,I absolutely enjoy this anime since there is a lot of shounen-ai hints.(>.",
            "date": "2015-01-07T01:38:00+00:00",
            "helpful_count": 8,
            "mal_id": 176605,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4362455.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/icchan8",
                "username": "icchan8"
            },
            "url": "https://myanimelist.net/reviews.php?id=176605"
        },
        {
            "content": "Story 8/10 \r\nThe story involves an eighteen year old guy named Shino Inuzuka\r\nHe is one of the only three survivors of the destruction of Otsuka Village. He possesses the living sword of Murasame, which is controlled by his right arm. He is immortal and is stuck in his 13 year old body, so he often gets treated like he's a little child. He is terrified of bugs and has an obsession with cleanliness, due to him being raised in a sterile place.\r\nFive years ago, everyone in the village seemed to die of an illness. This plague casued for several deaths. So apparently there were 3survivors: Shino Inuzuka, Sousuke Inukawa, They took shelter in a church on the outskirts of another village by a dark and dangerous forest\\n\\n\r\nArt 10/10\\n\r\nYes! I give it a ten. No more or less. The art of the eyes are astounding! I like how the lashes of Shino were so appealing. \\n\\n\r\nCharacter 7/10\\n\r\nSadly, I thought I would be into other characters too but I couldn't seem to bring myself to enjoy them at all. I was aware of the beauty they were creating during the series but there was something lacking... but aside from that there were strong bonds too between the characters.\\n\\n\r\nEnjoyment 7/10\\n\r\nI wish it had a deeper story, yet it was an interesting plot. The series just throws you into its world, a weird mix of old and modern Japan with supernatural beasts running about with no real explanation whatsoever\\n\\n\r\nSound 6/10\\n\r\nHakkenden: Touhou Hakken Ibun, I don't really have anything to say about the sound effects etc. Meaning: I don't think it was that great at all. \\n\\n\\n\r\n\"Promising to do something tomorrow with someone is the same as promising that you'll be alive tomorrow.''",
            "date": "2017-04-04T11:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 244601,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069087.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mervollo",
                "username": "mervollo"
            },
            "url": "https://myanimelist.net/reviews.php?id=244601"
        },
        {
            "content": "Before I start my review, to anyone who cannot tolerate shounen-ai, you probably shouldn't watch this. It doesn't say so in its genre or tags, but the friendship and brotherhood between the main characters implies shounen-ai. It's in almost every episode, and for someone who can't tolerate anything homosexual, it's best if you don't press play. Additionally, Abe Miyuki changed its original magazine to one famous for BL, so it's possible that in the future, real male on male relationships will come into the story.\r\nPersonally, I like shounen-ai and yaoi, so I have nothing bad to say about this anime except this: Hakkenden is sortof an anime that is slow with its plot progress. You have to wait a couple of episodes to see where the story really comes from. It's mainly just character introductions. It takes a while for you to put everything together, but it's fun to watch because of its comedy and bishounens (everyone's practically a bishounen in this series). I like all the characters, mainly their backgrounds and how they came to have their spirits.\\n\\n\r\nI can't wait for the 2nd season in July 2013! I want to see more of everyone. I think the 2nd season will focus more on the real plot, the last episode already came out for this season, and I think it's just the beginning of everything. The real plot finally started to come out.\\n\\n\r\nThe story's unique, but progressing could be better = 9\\n\r\nThe art's by Miyuki-sensei, author of Super Lovers, so of course = 10\\n\r\nI like the seiyuus voice, except Shino's voice is sort of annoying when he whines = 9\\n\r\nCharacters are all cool, with different backgrounds and personal stories = 9\\n\r\nI like shounen-ai and bishounens, as well as youkai/spirits = 9\\n\r\nOverall = 9, it's not as great as Naruto or anything, but it's good enough like Uchuu Kyoudai to keep me interested every week.\\n\\n\r\nIt's better to watch this if you like canon pairings in an anime that's not even genre-d as shounen-ai.",
            "date": "2013-04-01T17:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 91997,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1756759.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/thefujoshi",
                "username": "thefujoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=91997"
        },
        {
            "content": "I just have to give it a 10 and nothing else. The plot is simply amazing, fitting exactly into the 13 episodes. It was well written and drawn, nothing like some anime that were trying to fit five hundred billion plots into 13 episodes. Just saying. \r\nI enjoyed the bromance feeling between the two characters and the caring feelings they harbored for each other. It is not necessary to ship them or anything to feel their caring relationships.\r\nThe anime have just the right amount of action, drama, and funny moments. It also have decent/modern art that just can't even be compared to the art from90's. No offence. \\n\\n\r\nSo for all the fans of anime out there that judge an anime base on its art, I would say that this anime is for you.\\n\r\nStill not sure? Then check the list I came up with, if most of them are what you like, then this anime might be for you:\\n\\n\r\n1. Action\\n\r\n2. Male Mc\\n\r\n3. Mostly Male casts\\n\r\n4. Without pathetic girls\\n\r\n5. Cool action scenes\\n\r\n6. No Harem/Ecchi/Reverse Harem (Finally, without those BOING BOING sounds that just ruin my experiences)\\n\r\n7. Bromance\\n\r\n8. Decent drawing and attracting plots\\n\\n\r\nSo all in all, definitely give this anime a try!",
            "date": "2016-07-31T18:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 225555,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337921.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kadrian",
                "username": "Kadrian"
            },
            "url": "https://myanimelist.net/reviews.php?id=225555"
        },
        {
            "content": "In this reflective, often sweet, occasionally unsettling anime, friends Shino, Sousuke, and Hamaji are the sole survivors of a fire that destroyed their entire village—except that Shino and Sousuke had to meld their souls with animals in order to survive. Shino now has a god in the form of a demon crow (that can turn into a sword) living inside him, which prevents him from aging, and Sousuke can turn into a dog. Now working for the Church, the three of them travel to the capital to investigate demon-related crimes, and they keep having chance encounters with other people with similarly tragic backstories who alsohave spirits living inside them.\\n\\n\r\nClearly, the story here is a little hard to explain: the story takes a while to get going and is confusing once it does. To quote a character in the actual anime, “Jeez, I was already taken aback by that strange eyeball, and now there’s this Sacred Dog. The world is full of surprises.”\\n\\n\r\nRegardless, I enjoyed this anime more and more as it went on (and especially into season 2) because the characters are the real draw here, particularly the two leads. Shino and Sousuke’s relationship is a mix between a married couple, brothers, parent-child, and best friends (who cuddle a lot). Another character remarks that Shino draws people “like a magnet,” and that certainly was the case for me. The characters are all beautiful, and I found they became more interesting the longer I knew them. I also enjoyed all the shounen-ai hints and jokes.",
            "date": "2014-06-27T09:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 148939,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384487.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shadowfireflame",
                "username": "shadowfireflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=148939"
        },
        {
            "content": "\"Loneliness is something whimsical and cruel\"\r\nHakkenden is an anime consisting of spirits and demons, however it focuses more on action whether it be socially or physically (fighting) rather than focusing on logic and the specific details of how these demons exist. Shino, an 18 year old boy who has the permanent body of a non-aging 13 year old boy. This works to his benefit due to his personality and characteristics resembling a child. Shino is what makes the show, he's the lovable little main character; and almost everything is about him. His child hood friend Sosuke (18) accompanies him, and they have a best friend/ brother relationship despite the differences in their appearance.\\n\\n\r\nThe anime immediately gives viewers a general idea of what the characters personalities are like within the first few episodes. From that point, it is up to the viewer to decide whether they will be able to build some sort of connection with the characters, or if the characters do not appeal to them. \\n\\n\r\nAlthought Hakkenden has a bad starting impression, it picks up rather quickly after the first few episodes. The age difference in terms of appearance between Sosuke and Shino makes it hard to see them as best friends and more as the older brother and little brother. Though many will claim there is a bountiful amount of fan service I'd disagree, Shino's just simply a little kid. The story itself implied that him and Sousuke were really close to begin with; it's not weird that two guys hug unless people purposely view it that way... That's just something I'd like to put out there.\\n\\n\r\nThe OP/ED are alright nothing spectacular, but there were two excellent songs inserted  into different episodes to fit the scene. When I say amazing I mean lyrically and vocally, it was a great bonus.\\n\r\nThe art's relatively pretty and satisfying; I feel there is a slight bit of fan service for Shino fan's. Though, the art does make the anime shine and it is one of the most prominent features of the anime.\\n\r\nThe title picture for the anime doesn't do the art justice, I like the look of the characters in the anime much better than what the title picture portrays. \\n\\n\r\nLONG STORY SHORT: Give the anime a shot if you think you'll like the characters; mostly Shino. The story line for the anime is decent enough that the viewer can enjoy the anime and be interested, but not good enough to jump out of your seat applauding.\\n\r\nI find myself re-watching a lot of episodes just simply because they're either really funny or adorable moments. \\n\\n\r\nThere is a season 2 which is out, and it seems very promising. The anime definitely needed more than 13 episodes to complete itself, so I'd definitely give season 2 a shot if you even slightly liked season 1.\\n\\n\r\nI thoroughly enjoyed this anime for it's simplicity, aesthetics, and characters.\\n\\n\\n",
            "date": "2013-08-06T23:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 108597,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2446429.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NostalgiaCrisis",
                "username": "NostalgiaCrisis"
            },
            "url": "https://myanimelist.net/reviews.php?id=108597"
        },
        {
            "content": "I was talking to a friend about Ten (Tenna Toori no Kaidanji) after I finished reading it. Our conversation led to a discussion about the characters, which is when I brought up \"Genpachi\". It turned out the character in Ten is named \"Ginji\", which left me with some very important questions... Just who the hell is Genpachi? Where did I get that name from? It was quite troubling. I Googled \"Genpachi\" and found out about this anime. \r\nTo sum it up, this anime is all over the place. It's just a mess. The story starts off with some people dying in a fire, then somemystery man hands a crying girl a katana with the opportunity to live instead of die. From that day forth, a girl becomes a guy, a man and dog get fused (he gets convenient transformation powers), and the girl forgets everything about the incident while the dead girl/boy shoulders the responsibility. Or at least that's what I made of it. \\n\r\nThey live a simple life in some town. The boy has a pet Niizuma Eiji (literally), he's friends with some river god and frog master, and he gets some fuzzy eyeball that he can't get rid of. Meanwhile, the church has kidnapped the girl, so they must go to town and get her back. Never mind, she went there of her own free will. By the way, there's an evil church of monks torturing a guy who slit his own throat and shot himself in the head. Somebody save him! Too late, he turned into some demon and is going to eat the boy. Or at least that's what we thought. The monks followed after him and fired off a bunch of arrows, resulting in our brave heroes falling into the river and the monks giving up on the chase. I dunno what happened to that old frog dude, but the show is now about some sort of dog fetish. Luckily, the guy who kidnapped the girl is a good guy and he finished off the evil monk. Suicide guy and his bro are now shirtless at the battlescene. I'm not sure why, but they just are. All's well that ends well. \\n\\n\r\nI just want to emphasize the senseless script in this show again. The boy detects enemies, so he turns his crow into a sword and swings the door open to reveal that they're surrounded by the evil monks wielding bows and arrows. He is the only one with a weapon at this point and you think he's gonna be a hero. Someone else kicks up a floor board to reveal some hidden katanas and he dispenses them to everyone else. The boy steps back and lets the big boys handle things, then the dog fusion guy holds the boy's hand and runs off to safety. They spend the remainder of the battle being absent. \\n\r\nHonestly, what the fuck just happened? He went from courageous hero to indecisive punk to molested little boy all within the span of a few minutes. How did this happen?\\n\\n\r\nThe adult male characters in this show are pretty. The setting is some traditional Japanese era where trains and industry have just been introduced. Cool setting and pretty characters, that's about it. The animation is subpar, especially when the animals are talking (their mouths just stay open and sounds come out). \\n\\n\r\nThis show also puts a ton of effort into having characters react to things in the opposite way you'd expect them to, which is supposed to be funny. Now laugh! Basically, if you're gonna watch this show, you should start it up on some stupid whim like I did. That way, you won't feel cheated when you find out the plot was written on similarly stupid whims.\\n\r\nSeriously, I couldn't watch the whole thing. When the \"plot\" advances, you just kinda put a handful of popcorn in your mouth and say \"Oh, I see.\"",
            "date": "2013-10-28T21:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 118637,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Danno",
                "username": "Danno"
            },
            "url": "https://myanimelist.net/reviews.php?id=118637"
        },
        {
            "content": "The anime, is a fantasy and adventure genre.\r\nthe Story: \r\nthe story fro me is pretty engaging, there is mystery and fun. through there are moments where, i feel like the story is dragging or unnecessary. Those times are very few and usually has foreshadowing for something, so its all good\r\nCharacters: \r\nthere are quite a number of characters, but most of them are fleshed out and are reasonable and quite likable. The main Character is likable, he's not perfect he has his bratty moments but its tolerable and at least he's pretty capable.\r\nArt and sound:\r\nthe art is really good, detailed vibrant colors. Its really well madeand easy on the eyes. the soundtrack is pretty nice not really catchy but in the moments in the anime, the music is quite pleasing,\\n\\n\r\noverall:\\n\r\nGive the this anime a try its pretty good, fair warning there is quite a bit of Bromance",
            "date": "2017-02-08T06:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 240153,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5201796.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Merpo",
                "username": "Merpo"
            },
            "url": "https://myanimelist.net/reviews.php?id=240153"
        },
        {
            "content": "As a precursor, please forgive me if I have similar comments to any other reviewers; I have not read any of the reviews for this particular anime.\r\nThe quality of this anime really sneaks up on you.. At first when I started watching, it seemed like just another bishounen typical anime; but after watching a few more episodes, the story and characters have more depth than I first expected. The subtle comedy makes it even more enjoyable on a lighthearted level as well.  \r\nOn a side note: is it just me, or are some of the characters totally reminiscent of Kyou Kara Maoh?? Just forbeginners - Shino and Sousuke ~ Yuuri and Conrad?\\n\r\nWas this on purpose? In any case, I loved KKM so it doesn't bother me so much as it is amusing.",
            "date": "2014-02-21T04:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 133331,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308760.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/acktgirl01",
                "username": "acktgirl01"
            },
            "url": "https://myanimelist.net/reviews.php?id=133331"
        }
    ]
]